[{
    "name": " Konstantinos Plataniotis",
    "romanize name": " Konstantinos Plataniotis",
    "School-Department": " Electrical and Computer Engineering",
    "University": "University of Toronto",
    "Rank": "Καθηγητής",
    "Apella_id": 9137,
    "Scholar name": "Konstantinos N Plataniotis",
    "Scholar id": "W-4N_2gAAAAJ",
    "Affiliation": "Professor, ECE Department, University of Toronto",
    "Citedby": 23567,
    "Interests": [
        "image and signal processing",
        "pattern recognition",
        "biomedical",
        "machine learning",
        "adaptive systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=W-4N_2gAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Vector median root signals determination for cDNA microarray image segmentation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11559573_107",
            "Abstract": "This paper presents a new cDNA microarray image segmentation framework. The framework uses robust vector median filtering to generate a root sigLnal which is an image obtained from the input by repeatedly filtering it until no more changes occur. During the convergence to the root signal, the framework classifies the cDNA image data as either microarray spots or image background, and ideally separates the regular spots from the background. Thus, the obtained root signal represents the segmented microarray image. In addition, the framework excellently removes noise present in the cDNA microarray images and normalizes spots’ intensities.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:z_wVstp3MssC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An improved widely linear receiver for cyclostationary CDMA systems with OQPSK modulation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1349766/",
            "Abstract": "An improved widely linear (WL) receiver is proposed for direct-sequence code-division multiple-access (DS-CDMA) systems that employ aperiodic spreading sequences with offset quadrature phase shift keying (OQPSK) modulation. The modulation scheme generates improper complex multiple-access interference (MAI) and necessitates the use of WL receivers. Focus is on bandlimited pulse shapes and inherent cyclostationarity (CS) of the uncoded received signal. The enhanced WL receiver replaces the conventional chip-matched filter (CMF) with new filters that exploit the CS of the received signal through frequency-shifting. The proposed WL receiver is shown to outperform the classical strictly linear (SL) receiver when the interfering users are high-powered, which may exist to support high data rate services. Numerical results are presented to demonstrate the performance gain of the WL receiver over the SL …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Event-Triggered Monitoring/Communication of Inertial Measurement Unit for IoT Applications",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956910/",
            "Abstract": "Communication of high-frequency and equidistantly sampled Inertial Measurement Unit (IMU) measurements is impractical as it drains power of the handhold device and even may result in crashing the phone's operating system. In this regard, the paper proposes a novel Event-Triggered (ET) IMU monitoring/communication strategy for indoor localization in IoT applications. This is, to the best of our knowledge, the first work to develop ET methodologies within this context where communication only occurs when specific events are identified via a local triggering mechanism implemented at the sensor level. Different experimental scenarios are implemented illustrating effectiveness of the proposed ET-based IMU communication.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Ei5r6KrKXVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AKF-SR: Adaptive Kalman filtering-based successor representation",
            "Publication year": 2022,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231221014867",
            "Abstract": "To understand animals’ behavior in finding relations between similar tasks and adapting themselves to changes in the tasks, it is necessary to know how the brain generalizes the learned knowledge from a previous task to unseen tasks. Recent studies in neuroscience suggest that Successor Representation (SR)-based models provide adaptation to changes in the goal locations or reward function faster than model-free algorithms, together with lower computational cost compared to that of model-based algorithms. However, it is not known how such representation might help animals to manage uncertainty in their decision making. Existing methods for the SR learning based on standard temporal difference methods (e.g., deep neural network-based algorithms) do not capture uncertainty about the estimated SR. In order to address this issue, the paper presents a Kalman filter-based SR framework, referred to as …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:lPDSu1ZU3VAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Improving BLE beacon proximity estimation accuracy through Bayesian filtering",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956048/",
            "Abstract": "The interconnectedness of all things is continuously expanding which has allowed every individual to increase their level of interaction with their surroundings. Internet of Things (IoT) devices are used in a plethora of context-aware application, such as proximity-based services (PBSs), and location-based services (LBSs). For these systems to perform, it is essential to have reliable hardware and predict a user's position in the area with high accuracy in order to differentiate between individuals in a small area. A variety of wireless solutions that utilize received signal strength indicators (RSSIs) have been proposed to provide PBS and LBS for indoor environments, though each solution presents its own drawbacks. In this article, Bluetooth low energy (BLE) beacons are examined in terms of their accuracy in proximity estimation. Specifically, a mobile application is developed along with three Bayesian filtering …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:s1ouQE5r0WUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Face Image Analysis and Synthesis Collaborative Face Recognition for Improved Face Annotation in Personal Photo Collections Shared on Online Social Networks",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12751531820858524389&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:u-coK7KVo8oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TradeR: Practical Deep Hierarchical Reinforcement Learning for Trade Execution",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.00620",
            "Abstract": "Advances in Reinforcement Learning (RL) span a wide variety of applications which motivate development in this area. While application tasks serve as suitable benchmarks for real world problems, RL is seldomly used in practical scenarios consisting of abrupt dynamics. This allows one to rethink the problem setup in light of practical challenges. We present Trade Execution using Reinforcement Learning (TradeR) which aims to address two such practical challenges of catastrophy and surprise minimization by formulating trading as a real-world hierarchical RL problem. Through this lens, TradeR makes use of hierarchical RL to execute trade bids on high frequency real market experiences comprising of abrupt price variations during the 2019 fiscal year COVID19 stock market crash. The framework utilizes an energy-based scheme in conjunction with surprise value function for estimating and minimizing surprise. In a large-scale study of 35 stock symbols from the S&P500 index, TradeR demonstrates robustness to abrupt price changes and catastrophic losses while maintaining profitable outcomes. We hope that our work serves as a motivating example for application of RL to practical problems.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:JdL-Xu2nR38C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boosting LDA with regularization on MPCA features for gait recognition",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4430542/",
            "Abstract": "In this paper, we present a boosted linear discriminant analysis (LDA) solution with regularization on features extracted by the multilinear principal component analysis (MPCA) for the gait recognition problem. This work is an extension of a recent LDA-based boosting approach and the MPCA is employed to project tensorial gait samples on a number of discriminative EigenTensorGaits (ETGs) to produce gait feature vectors for the base learners in boosting. This new scheme offers one more way to control the learner weakness while being very computationally efficient. Furthermore, the LDA learners are modified through regularization for protection against overfitting on the gallery set. Promising experimental results obtained on the Gait Challenge data sets indicate that the proposed algorithm is an efficient and effective solution consistently enhancing the gait recognition results on the seven probe sets by MPCA+LDA.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:sJPMR1oEGYQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Resizing color images in the compressed domain",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=1914551513612331890&hl=en&oi=scholarr",
            "Abstract": "Resizing images is the process by which an image of size M1× N1 is converted into an image of size M2× N2. A typical example of an image resizing operation is image halving when M2 and N2 are halves of M1 and N1, respectively. Likewise, for image doubling, M2= 2M1 and N2= 2N1. The image resizing operation is required for various purposes such as display, storage, and transmission of images. While displaying an image, the resolution of the display devices imposes constraint on the maximum size of the display screen. Sometimes, the display interface provides for the scrolling of images in the display window. However, in many cases, it is preferred to get the image displayed as a whole. The resizing of images is essential in such cases. Similarly, insufficient bandwidth of a communication channel may demand smaller sizes of images for faster transmission of data. Image resizing operations may also be …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:SgM-ki2adj0C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "On the coupled forward and backward anisotropic diffusion scheme for color image enhancement",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45479-9_8",
            "Abstract": "The use of low-level visual features to search and retrieve information in the multimedia databases has drawn much attention in the recent years [1,2]. Many of the existing techniques of image retrieval are based on image segmentation, which is a difficult task in many practical situations due to image noise and various compression artifacts. In this paper a novel approach to the problem of edge preserving smoothing, which allows to break an image into a set of homogeneous regions, is proposed and evaluated. The new algorithm is based on the combined forward and backward anisotropic diffusion with incorporated time dependent cooling process. This method is able to efficiently remove image noise while preserving and enhancing image edges. The proposed algorithm can be used as a first step of different techniques, which are based on color, shape and spatial location information, to search and …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Measuring Information Content in Biometric Features",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/34254969/biomimetica_3.pdf#page=597",
            "Abstract": "How much information is there in a face or in a fingerprint? This question is related to many issues in biometric technology. For example, one of the most common biometric questions is that of uniqueness—for example, to what extent are fingerprints unique? From the point of view of identifiability, one may be interested in how much identifying information is available from a given technology, such as video surveillance. In the context of biometric fusion [1], one would like to be able to quantify (a) the biometric information in each system individually and (b) the potential gain from fusing the systems. Additionally, such a measure is relevant to biometric cryptosystems and privacy measures. Several authors have presented approaches relevant to this question. For example, Wayman [2] introduced a set of statistical approaches to measure the separability of Gaussian feature distributions using a “cotton ball model.” Another approach was developed by Daugman [3] to measure the information content of iris images based on the discrimination entropy [4], calculated directly from the match score distributions. Also, Golfarelli et al.[5] showed that the most commonly used feature representations of handgeometry and face biometrics have a limited number of distinguishable patterns, on the order of 105 and 103, respectively, as measured by a theoretical estimate of the equal error rate. Other authors have used informationtheoretic approaches, such as the approach of Ross and Jain [1] to biometric fusion. However, none of these methods approach measurement of information content of biometric data from an information-theoretic point of view.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Gb6Hms-Uo9kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Three-dimensional entropy vector median filter for color video filtering",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5150/0000/Three-dimensional-entropy-vector-median-filter-for-color-video-filtering/10.1117/12.503178.short",
            "Abstract": "We provide a new non-motion compensated adaptive multichannel filter for the detection and removal of impulsive noise, bit errors and outliers in color video or color image sequences. The proposed nonlinear filter takes the advantages of the concept of the local entropy contrast and the robust order-statistics theory. The new entropy based vector median is computationally attractive, robust for a wide range of the impulsive noise corruption and significantly improves the signal-detail preservation capability of standard vector median filter. Because the precision of statistical operators such as mean or entropy increases with the increased number of observed samples, the used spatiotemporal cube filter window guarantees a high accuracy of the proposed method that is able to achieve excellent results in terms of commonly used objective measures and clearly outperforms standard vector filtering schemes",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:9Nmd_mFXekcC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Subject independent affective states classification using EEG signals",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7418411/",
            "Abstract": "Affective states classification has become an important part of the Human-Computer Interface (HCI) study. In recent years, studies of physiological signals, such as ECG, GSR and EEG on affective expression have shown very promising results. In this study, we carried out two experiments to better understand the neurological expression of emotions through the use of EEG signals. In particular, we carried out a subject-independent affective states classification study using narrowband spectral power of the EEG signals. The MAHNOB-HCI-Tagging database was used for experimental purposes, which was collected over 27 participants with film clips as emotional stimuli. An averaged correct classification rate of 64.74% and 62.75% were achieved respectively on the 3-class Arousal and valence states classification problem using support vector machine (SVM) with ANOVA as feature selection mechanism. The …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:natZJ_-F0IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Location of mobile terminals using time measurements and survey points",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1224556/",
            "Abstract": "Mobile terminal location has attracted much interest for its applications in emergency communications, location-sensitive browsing, and resource allocation. The paper introduces the use of nonparametric kernel-based estimators for location of mobile terminals using measurements of propagation delays. It is demonstrated that these estimators perform better than the previously used parametric maximum likelihood estimators for the case of a simulated microcell environment with line-of-sight (LOS) and non-line-of-sight (NLOS) radio propagation at several different levels of measurement noise. Their performance is not greatly degraded by NLOS effects. Methods for calculating good values for parameters of the kernel functions are demonstrated, as well as the robustness of the estimators when the values of the parameters vary from the optimal points. A lower bound on the mean square error of location estimation …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A taxonomy of emerging multilinear discriminant analysis solutions for biometric signal recognition",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=fefutm-Dhy0C&oi=fnd&pg=PA21&dq=info:J6o3CnLsgX8J:scholar.google.com&ots=ex8TBh73ah&sig=68VTXzzTBwXf-9mwPiqFPazqomw",
            "Abstract": "Many biometric signals, such as ﬁngerprint, palmprint, ear, face images, and gait silhouettes sequences, are naturally multidimensional objects, which are formally referred to as tensor objects. The elements of a tensor are to be addressed by a number of indices [1]. The number of indices used in the description deﬁnes the order of the tensor object, and each index deﬁnes one “mode.” Gray-level biometric images, 1 such as face images, are naturally second-order tensors with the column and row modes [2, 3]. Color biometric images are naturally third-order tensors with the column, row, and color modes [4, 5]. Three-dimensional gray-level faces are naturally third-order tensors with the column, row, and depth modes [6, 7], and the popular Gabor faces [8] are third-order tensors with the column, row, and Gabor modes. In many surveillance applications, the (sequential) biometric signals observed in surveillance video sequences [9] are naturally higher-order tensors. Binary gait silhouette sequences, the input to most (if not all) gait recognition",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:NhqRSupF_l8C",
            "Publisher": "Wiley/IEEE"
        },
        {
            "Title": "Tractable bound for spherical section property in the presence of side-information",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6220237/",
            "Abstract": "This letter provides a tractable bound for a perfect recovery condition in compressed sensing matrices using the spherical section property in the presence of side information. In particular, when the signal of interest is provided with side-information, we derive an equivalent semidefinite relaxation bound by introducing the related prior knowledge as an additional constraint to the semidefinite programming (SDP) problem. We recast a linear program (LP) cone to this problem and found the dual-SDP to be less complex to handle. Numerical evaluations on the proposed dual-SDP, validates the existence of sparse solutions with high- cardinalities.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:q3CdL3IzO_QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Discriminant learning for face recognition",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Juwei-Lu/publication/267196113_Discriminant_Learning_for_Face_Recognition/links/55c0176308aec0e5f4476e91/Discriminant-Learning-for-Face-Recognition.pdf",
            "Abstract": "An issue of paramount importance in the development of a cost-effective face recognition (FR) system is the determination of low-dimensional, intrinsic face feature representation with enhanced discriminatory power. It is well-known that the distribution of face images, under a perceivable variation in viewpoint, illumination or facial expression, is highly non convex and complex. In addition, the number of available training samples is usually much smaller than the dimensionality of the sample space, resulting in the well documented “small sample size”(SSS) problem. It is therefore not surprising that traditional linear feature extraction techniques, such as Principal Component Analysis, often fail to provide reliable and robust solutions to FR problems under realistic application scenarios.In this research, pattern recognition methods are integrated with emerging machine learning approaches, such as kernel and boosting methods, in an attempt to overcome the technical limitations of existing FR methods. To this end, a simple but cost-effective linear discriminant learning method is first introduced. The method is proven to be robust against the SSS problem. Next, the linear solution is integrated together with",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:u3T1itk59dMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On cDNA microarray spot localization",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1693702/",
            "Abstract": "This paper presents a powerful framework for cDNA microarray spot localization. Following the multichannel nature of the cDNA image data, the framework allows the utilization of various scalar and vector edge operators to determine edges, discontinuities and structural elements, and generate edge maps of cDNA microarray images. It will be shown that vector edge operators, which utilize both the spectral and spatial characteristics of cDNA image, outperform well-known scalar edge detectors. In addition, built on robust theory order statistics, vector operators are more immune to the noise present in microarray images than common scalar operators",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Universal demosaicking for imaging pipelines with an RGB color filter array",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320305001822",
            "Abstract": "A universal demosaicking solution appropriate for imaging pipelines employing a red–green–blue (RGB) color filter array (CFA) is introduced. The proposed solution can demosaick a raw, grayscale, CFA sensor image captured by a digital camera equipped with any RGB-CFA currently in use. The solution utilizes a spectral model, an edge-sensing mechanism, and a postprocessor to preserve the coloration and sharpness of the captured image. The framework readably unifies existing demosaicking solutions which differ in design characteristics, performance, and computational efficiency. Simulation studies indicate that the universal demosaicking framework allows for cost-effective camera image processing and produces visually pleasing full-color digital images.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:aqlVkmm33-oC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Using color texture sparsity for facial expression recognition",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6553769/",
            "Abstract": "This paper presents a new facial expression recognition (FER) which exploits the effectiveness of color information and sparse representation. For extracting face feature, we compute color vector differences between color pixels so that they can effectively capture change of face appearance (e.g., skin texture). Through comparative and extensive experiment using two public FER databases (DBs), we validate that our color texture features are suited to the sparse representation for improving FER accuracy. Specifically, our color texture features can considerably improve the recognition accuracy obtained by sparse representation compared with other features (e.g., Local Binary Pattern (LBP)) under realistic recognition conditions (e.g., low-resolution faces). It is also shown that the use of our features can yield high discrimination capability and sparsity, justifying the high recognition accuracies obtained. Further, the …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:JTqpx9DYBaYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensor selection for mitigation of RSS-based attacks in wireless local area network positioning",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4518047/",
            "Abstract": "Positioning in wireless networks has gained significant ground as an enabling technology for various applications such as event detection and context awareness. Since these positioning systems rely on radio features to locate a mobile, they are susceptible to non-cryptographic attacks resulting from malicious alteration of the propagation environment. This paper proposes a sensor selection scheme for increasing the resilience of fingerprinting-based positioning systems to RSS-based attacks in the context of wireless local area networks (WLAN). A distributed positioning scheme is proposed whereby an estimate is obtained from each WLAN access point (AP). Sensor selection is performed based on a nonparametric estimate of the Fisher information. Experimental results indicate superior performance compared to existing methods and graceful performance degradation in presence of RSS attacks.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smartphone-based wellness assessment using mobile environmental sensors",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9136775/",
            "Abstract": "Mental health and general wellness are becoming a growing concern in our society. Environmental factors contribute to mental illness and have the power to affect a person's wellness. This article presents a smartphone-based wellness assessment system and examines if there is any correlation with one's environment and their wellness. The introduced system was initiated in response to a growing need for individualized and independent mental health care and evaluated through experimentation. The participants were given an Android smartphone and a mobile sensor board and they were asked to complete a brief psychological survey three times per day. During the survey completion, the board in their possession is reading environmental data. The five environmental variables collected are temperature, humidity, air pressure, luminosity, and noise level. Upon submission of the survey, the results of the survey …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:5F1dSjz1ScoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the new filtering technique of noise attenuation in color images",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/938604/",
            "Abstract": "A new filter class for multichannel image processing is introduced and analyzed. The new technique of image enhancement is capable of reducing impulsive and Gaussian noise and it significantly outperforms the standard methods of noise reduction. In the paper, a smoothing operator, based on a random walk model and on a fuzzy similarity measure between pixels connected by a digital geodesic path, is introduced. The efficiency of the proposed method was tested on standard color images using objective image quality measures. Obtained results show that the new method not only outperforms standard noise reduction algorithms, but has some interesting features useful for segmentation of noisy color images.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:X0DADzN9RKwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable e-learning multimedia adaptation architecture",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11559573_24",
            "Abstract": "A neglected challenge in existing e-Learning (eL) systems is providing access to multimedia to all users regardless of environmental conditions such as diverse device capabilities, the heterogeneity of the underlying IP network, and user modality preference. This paper proposes a novel two-tier transcoding framework capable of adapting eL multimedia to meet the end-user environmental challenges. This two-tier architecture consists of 1)an application layer transcoder that adapts the presentation format of the eL content as viewed in a browser to meet device capabilities and user modality preference, 2) a bitstream transcoder that transforms multimedia streams to conform to the device’s processing capabilities and to adapt the encoding rate to meet the network’s fluctuating bandwidth. Results demonstrate the eL multimedia transcoding for mobile devices and its low overhead delays.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Robust correction step for CFA interpolation schemes",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1421392/",
            "Abstract": "This paper prcscnts an efficient poslprocessin~ correction method capable 0 1 rcducing visual artificts introduccd during the color filler array interpolation process. Edge-sensing weights and the original color lilter array data are uscd to detect structural elements in the original image and correct prcviously interpolated color components accordingly. The method produces excellent results in tcrms of both objective and subjective image quality measures.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Detecting the defective nodes in wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5473001/",
            "Abstract": "A local algorithm is proposed and analyzed to monitor the healthiness of a wireless sensor network. Using this local algorithm, we can detect the defective sensors inside the network. The robustness of this algorithm is gauged using the breakdown ratio. We show that for the proposed algorithm, the breakdown ratio can be simply found by solving a quadratic equation. Since the number of defective nodes in a wireless sensor network is assumed to be small compared to the total number of nodes, the compressed sensing algorithm is used to detect the defective nodes also in the fusion center with a low communication cost. The simulation results show that the defective nodes can be successfully detected inside the network and in the fusion center with a low communication cost.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating position of mobile terminals with survey data",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1155/S1110865702000446",
            "Abstract": "Estimating the position of mobile terminals is an important problem for cellular networks. This paper describes low cost methods of locating mobile terminals in urban environments. These methods use data collected during propagation surveys of the network area. It will be shown how the maximum likelihood estimate and minimum mean-square error estimators can be approximated using survey data. Furthermore, the approximate solutions can provide low variance location estimates with low computational cost compared to other methods.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:P5F9QuxV20EC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Accurate kernel-based spectrum sensing for Gaussian and non-Gaussian noise models",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7178552/",
            "Abstract": "This paper introduces a spectrum sensing scenario based on kernel theory which compares favorably against the conventional Energy Detector (ED) in a cognitive radio system. The so-called Kerenlized Energy Detector (KED) can provide superior accuracy in the case of non-Gaussian noise. The incorporation of the nonlinear kernel function in the KED test statistics allows for the development of a nonlinear algorithm capable of considering both higher order and Fractional Lower Order Moments (FLOMs) in the sensing task. Simulation results show that the proposed semi-blind kernelized spectrum sensing algorithm is much robust against impulsive noises and displays a considerably better detection performance than the conventional ED in practical impulsive man-made noises which are generally modeled as the Laplacian and the α-stable distributions. Moreover, for the Gaussian signal and noise model, the …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:QoJ_w57xiyAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "COVID-CT-MD, COVID-19 computed tomography scan dataset applicable in machine learning and deep learning",
            "Publication year": 2021,
            "Publication url": "https://www.nature.com/articles/s41597-021-00900-3",
            "Abstract": "Novel Coronavirus (COVID-19) has drastically overwhelmed more than 200 countries affecting millions and claiming almost 2 million lives, since its emergence in late 2019. This highly contagious disease can easily spread, and if not controlled in a timely fashion, can rapidly incapacitate healthcare systems. The current standard diagnosis method, the Reverse Transcription Polymerase Chain Reaction (RT-PCR), is time consuming, and subject to low sensitivity. Chest Radiograph (CXR), the first imaging modality to be used, is readily available and gives immediate results. However, it has notoriously lower sensitivity than Computed Tomography (CT), which can be used efficiently to complement other diagnostic methods. This paper introduces a new COVID-19 CT scan dataset, referred to as COVID-CT-MD, consisting of not only COVID-19 cases, but also healthy and participants infected by Community Acquired …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:DUFsPKDdMi0C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Boosting discriminant learners for gait recognition using MPCA features",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2009/713183.pdf",
            "Abstract": "This paper proposes a boosted linear discriminant analysis (LDA) solution on features extracted by the multilinear principal component analysis (MPCA) to enhance gait recognition performance. Three-dimensional gait objects are projected in the MPCA space first to obtain low-dimensional tensorial features. Then, lower-dimensional vectorial features are obtained through discriminative feature selection. These feature vectors are then fed into an LDA-style booster, where several regularized and weakened LDA learners work together to produce a strong learner through a novel feature weighting and sampling process. The LDA learner employs a simple nearest-neighbor classifier with a weighted angle distance measure for classification. The experimental results on the NIST/USF \"Gait Challenge\" data-sets show that the proposed solution has successfully improved the gait recognition performance and …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:wE-fMHVdjMkC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Color image filtering and enhancement based genetic algorithms",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1328896/",
            "Abstract": "Genetic algorithms (GA) are applied to recently developed weighted vector directional filter (WVDF) optimization with subject to color image filtering and enhancement. After the GA optimization, the proposed WVDF filters are capable of removing noise in color images, while preserving image details, structural contents and color information. Due to excellent color/structural preserving characteristics, the proposed filters produce high-quality outputs when applying the real color image problem such as television image enhancement and virtual restoration of artworks.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BLE beacons in the smart city: applications, challenges, and research opportunities",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9063401/",
            "Abstract": "The Internet of Things helps to have every individual interconnected with their surroundings and to interact with them through smart devices. In recent years, Bluetooth Low Energy (BLE) technology has become very popular in smart infrastructures, the medical field, the retail industry, and many more areas due to its availability in a plethora of wireless devices. BLE is widely used in IoT devices, such as smartphones, smart watches, and BLE beacons. Beacons are small, low-cost, and low-power wireless transmitters that bring attention to their location by broadcasting a signal with a unique identifier at regular intervals. BLE beacons are a promising solution for many smart city applications, from proximity marketing to indoor navigation. However, they do pose security and privacy challenges. This work discusses the characteristics of BLE beacons, the applications that can benefit from them, and the challenges they …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:oH8HCDhqVGsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Method, system and computer program for identification and sharing of digital images with face signatures",
            "Publication year": 2018,
            "Publication url": "https://patents.google.com/patent/US20180157900A1/en",
            "Abstract": "Methods and systems are provided for sharing a digital image depicting one or more faces. The method may include linking a plurality of computer terminals to a computer network, each computer terminal associated with an individual; receiving a digital image at at least one of the computer terminals; executing a face recognition routine on the digital image, the face recognition routine detecting at least one face in the digital image, each detected face corresponding to a person, the face recognition routine recognizing at least one of the persons as being one of the individuals; and for each individual recognized in the digital image by the face recognition routine, initiating dissemination of the digital image to the computer terminal associated with respective individual whose face is recognized in the digital image.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:S2WlVNSe3u4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Regularized common spatial pattern with aggregation for EEG classification in small-sample setting",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5593203/",
            "Abstract": "Common spatial pattern (CSP) is a popular algorithm for classifying electroencephalogram (EEG) signals in the context of brain-computer interfaces (BCIs). This paper presents a regularization and aggregation technique for CSP in a small-sample setting (SSS). Conventional CSP is based on a sample-based covariance-matrix estimation. Hence, its performance in EEG classification deteriorates if the number of training samples is small. To address this concern, a regularized CSP (R-CSP) algorithm is proposed, where the covariance-matrix estimation is regularized by two parameters to lower the estimation variance while reducing the estimation bias. To tackle the problem of regularization parameter determination, R-CSP with aggregation (R-CSP-A) is further proposed, where a number of R-CSPs are aggregated to give an ensemble-based solution. The proposed algorithm is evaluated on data set IVa of BCI …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Remote Environment Exploration with Drone Agent and Haptic Force Feedback",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8942376/",
            "Abstract": "Camera drones allow exploring remote scenes that are inaccessible or inappropriate to visit in person. However, these exploration experiences are often limited due to insufficient scene information provided by front cameras, where only 2D images or videos are supplied. Combining a camera drone vision with haptic feedback would augment users' spatial understandings of the remote environment. But such designs are usually difficult for users to learn and apply, due to the complexity of the system and unfluent UAV control. In this paper, we present a new telepresence system for remote environment exploration, with a drone agent controlled by a VR mid-air panel. The drone is capable of generating real-time location and landmark details using integrated Simultaneous Location and Mapping (SLAM). The SLAMs' point cloud generations are produced using RGB input, and the results are passed to a Generative …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:1paMEeroeoQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biometrics: Terms and Definitions",
            "Publication year": 2021,
            "Publication url": "https://air.unimi.it/handle/2434/820189",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:27LrP4qxOz0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Spatiotemporal Demosaicking Using Multi-Stage Processing Concepts",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1660417/",
            "Abstract": "This paper presents a spatiotemporal demosaicking scheme suitable for digital video cameras. The proposed method uses multi-stage processing concepts to follow varying spatiotemporal characteristics of the captured video. The method also uses both the structural and spectral information during demosaicking in order to produce visually pleasing full-color videos",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:_axFR9aDTf0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Regularized LDA based on separable scatter matrices for classification of spatio-spectral EEG patterns",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6637848/",
            "Abstract": "Linear discriminant analysis (LDA) is a commonly-used feature extraction technique. For matrix-variate data such as spatio-spectral electroencephalogram (EEG), matrix-variate LDA formulations have been proposed. Compared to the standard vector-variate LDA, these formulations assume a separable structure for the within-class and between-class scatter matrices; these structured parameters can be estimated more accurately with a limited number of training samples. However, separable scatters do not fit some data, resulting in aggravated performance for matrix-variate methods. This paper first proposes a common framework for the vector-variate LDA with non-separable scatters and our previously proposed solution with separable scatters. Then, a regularization of the non-separable scatter estimates toward the separable estimates is introduced. This novel regularized framework integrates vector-variate and …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:rbm3iO8VlycC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Shape and spatial color information extraction for image retrieval",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4299/0000/Shape-and-spatial-color-information-extraction-for-image-retrieval/10.1117/12.429520.short",
            "Abstract": "Digital visual data has bene rapidly becoming more and more ubiquitous, and so content-based techniques to perform indexing are imperative. This paper outlines research geared towards an image retrieval system that identifies shapes in images and classify them into appropriate categories. The system functions on pre-processed, segmented images extracting component regions on the basis of color. This is followed by shape analysis using invariant moments with perceptual considerations made on the basis of subjective testing. The subjectivity is incorporated into the system via a set of thresholds whose strictness can be manipulated by the user. The implementation employing SQL and DB2 provided and 84 percent placement rate for the various images investigated.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:KbBQZpvPDL4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Smart driver monitoring: when signal processing meets human factors: in the driver's seat",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7736132/",
            "Abstract": "This article provides an interdisciplinary perspective on driver monitoring systems by discussing state-of-the-art signal processing solutions in the context of road safety issues identified in human factors research. Recently, the human factors community has made significant progress in understanding driver behaviors and assessed the efficacy of various interventions for unsafe driving practices. In parallel, the signal processing community has had significant advancements in developing signal acquisition and processing methods for driver monitoring systems. This article aims to bridge these efforts and help initiate new collaborations across the two fields. Toward this end, we discuss how vehicle measures, facial/body expressions, and physiological signals can assist in improving driving safety through adaptive interactions with the driver, based on the driver's state and driving environment. Moreover, by highlighting …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:sbeIDTyQOFgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new color filter array interpolation approach for single-sensor imaging",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30126-4_35",
            "Abstract": "This paper presents a new approach suitable for color filter array (CFA) interpolation schemes. The proposed method uses both scaling and shifting operations to normalize color components appearing in the CFA interpolator’s input. The utilization of the proposed model can significantly boost the performance of most well-known CFA interpolators which then exhibit superior performance and eliminates moire noise and color shifts in the full color output.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A comprehensive analysis of weakly-supervised semantic segmentation in different image domains",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11263-020-01373-4",
            "Abstract": "Recently proposed methods for weakly-supervised semantic segmentation have achieved impressive performance in predicting pixel classes despite being trained with only image labels which lack positional information. Because image annotations are cheaper and quicker to generate, weak supervision is more practical than full supervision for training segmentation algorithms. These methods have been predominantly developed to solve the background separation and partial segmentation problems presented by natural scene images and it is unclear whether they can be simply transferred to other domains with different characteristics, such as histopathology and satellite images, and still perform well. This paper evaluates state-of-the-art weakly-supervised semantic segmentation methods on natural scene, histopathology, and satellite image datasets and analyzes how to determine which method is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:RJNGbXJAtMsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Structure-induced complex Kalman filter for decentralized sequential Bayesian estimation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7047775/",
            "Abstract": "The letter considers a multi-sensor state estimation problem configured in a decentralized architecture where local complex statistics are communicated to the central processing unit for fusion instead of the raw observations. Naive adaptation of the augmented complex statistics to develop a decentralized state estimation algorithm results in increased local computations, and introduces extensive communication overhead, making it practically unattractive. The letter proposes a structure-induced complex Kalman filter framework with reduced communication overhead. In order to further reduce the local computations, the letter proposes a non-circularity criterion which allows each node to examine the non-circularity of its local observations. A local sensor node disregards its extra second-order statistical information when the non-circularity coefficient is small. In cases where the local observations are highly non …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:ymY9cBF3mdcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Collaborative face recognition for improved face annotation in personal photo collections shared on online social networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601785/",
            "Abstract": "Using face annotation for effective management of personal photos in online social networks (OSNs) is currently of considerable practical interest. In this paper, we propose a novel collaborative face recognition (FR) framework, improving the accuracy of face annotation by effectively making use of multiple FR engines available in an OSN. Our collaborative FR framework consists of two major parts: selection of FR engines and merging (or fusion) of multiple FR results. The selection of FR engines aims at determining a set of personalized FR engines that are suitable for recognizing query face images belonging to a particular member of the OSN. For this purpose, we exploit both social network context in an OSN and social context in personal photo collections. In addition, to take advantage of the availability of multiple FR results retrieved from the selected FR engines, we devise two effective solutions for merging …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Face annotation for personal photos using collaborative face recognition in online social networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5201095/",
            "Abstract": "Automatic face annotation (or tagging) facilitates improved retrieval and organization of personal photos in online social networks. In this paper, we present a new collaborative face recognition (FR) method that aims to improve face annotation accuracy. The proposed method makes efficient use of multiple FR engines and databases that are distributed over an online social network. The performance of our collaborative face recognition method was successfully evaluated using the standard MPEG-7 VCE-3 data set and a set of real-world personal photos from the Web. The efficacy of the proposed method is demonstrated in terms of comparative annotation performance against non-collaborative approaches utilizing a single FR engine and a single database only.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial Distributed Signal Processing for Security and Privacy in Networked Cyber-Physical Systems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8300288/",
            "Abstract": "The papers in this special section address distributed signal processing applications that support security and privacy in networked cyber-physical systems. Networked cyber-physical systems (CPSs) are engineering systems with integrated computational and communication capabilities that interact with humans through cyber space. The CPSs have recently emerged in several practical applications of significant engineering importance including aerospace, industrial/manufacturing process control, multimedia networks, transportation systems, power grids, and medical systems. The CPSs typically consist of both wireless and wired sensor/agent networks with different capacity/reliability levels where the emphasis is on real-time operations, and performing distributed, secure, and optimal sensing/processing is the key concern. To satisfy these requirements of the CPSs, it is of paramount importance to design …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:qPeb-qHga9sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart parking system based on bluetooth low energy beacons with particle filtering",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8994072/",
            "Abstract": "Urban centers and dense populations are expanding, hence, there is a growing demand for novel applications to aid in planning and optimization. In this article, a smart parking system that operates both indoor and outdoor is introduced. The system is based on Bluetooth low energy (BLE) beacons and uses particle filtering to improve its accuracy. Through simple BLE connectivity with smartphones, an intuitive parking system is designed and deployed. The proposed system pairs each spot with a unique BLE beacon, providing users with guidance to free parking spaces and a secure and automated payment scheme based on real-time usage of the parking space. Three sets of experiments were conducted to examine different aspects of the system. A particle filter is implemented in order to increase the system performance and improve the credence of the results. Through extensive experimentation in both indoor …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:KIRwYnRZzWQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy aggregation of image features in content-based image retrieval",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1039120/",
            "Abstract": "The obstacle of generating hybrid queries within the context of content-based image retrieval is still very real. In attempts to overcome this, fuzzy aggregation can be used to combine single, simple index queries into larger, more complex ones. The paper outlines the use of a fuzzy aggregation technique for hybrid querying which has the ability to adjust its behavior according to operator-controlled parameters. The resulting aggregator can be viewed as a feature-adaptive overall similarity measure. We limit the scope of the aggregator to queries involving color content, color coverage, and horizontal/vertical trends, and apply it to a media database comprised of Corel images of fixed size. Preliminary results show promise and illustrate that hybrid queries using the fuzzy aggregator are effective in their ability to retrieve relevant images while suppressing erroneous retrievals when compared to simple, single-feature …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generalized sigmoidal optimization of selection weighted vector filters",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=2924249364397737693&hl=en&oi=scholarr",
            "Abstract": "In this paper, a new generalized sigmoidal optimization of selection multichannel weighted filters is provided. The proposed multichannel sigmoidal optimization takes the advantage of optimal weighted medians (WM) and stack filters. The proposed approach is fast, easy to implement, saves the memory space and provides good results for the time-varying statistics. After the optimization, the optimal selection weighted multichannel filters can achieve excellent detail preserving capability with simultaneous noise attenuation properties and superior improvement in comparison with standard vector filtering schemes used for multichannel image filtering.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Uncorrelated multilinear discriminant analysis with regularization for gait recognition",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4430540/",
            "Abstract": "This paper proposes a novel uncorrelated multilinear discriminant analysis (UMLDA) algorithm for the challenging problem of gait recognition. A tensor-to-vector projection (TVP) of tensor objects is formulated and the UMLDA is developed using TVP to extract uncorrelated discriminative features directly from tensorial data. The small-sample-size (SSS) problem present when discriminant solutions are applied to the problem of gait recognition is discussed and a regularization procedure is introduced to address it. The effectiveness of the proposed regularization is demonstrated in the experiments and the regularized UMLDA algorithm is shown to outperform other multilinear subspace solutions in gait recognition.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:wkm4DBaukwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Algebraic visual cryptography scheme for color images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4517971/",
            "Abstract": "This paper introduces a novel, cost effective visual cryptography scheme suitable for color image transmission over bandwidth constraint channels. Unlike previously proposed schemes, the solution offers perfect reconstruction while producing shares with size smaller than that of the input image. The maximum distance separable (MDS) code principle used in the design allows for the introduction of a flexible framework that compares favorably to competing solutions as it can be seen by examining the experimental results included in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data adaptive filters for demosaicking: a framework",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1468002/",
            "Abstract": "A new demosaicking framework for single-sensor imaging devices operating on a Bayer color filter array (CFA) is introduced and analyzed. An efficient data adaptive filtering concept in conjunction with the refined spectral models constitutes the base for the proposed framework. Using a different form of the function mapping the aggregated absolute differences among the CFA inputs to the edge-sensing weighting coefficients, the framework allows to design fully automated demosaicking solutions suitable for common digital imaging apparatus, and alternatively, the proposed solutions can also be used to support PC-based demosaicking of the raw CFA images. Thus, the framework can be seen as a universal tool satisfying the needs of the end-users for i) the instant access and visualization of the captured images, and ii) the interactive processing of the raw sensor data. Moreover, the proposed framework is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multimodal physiological biometrics authentication",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5396661/",
            "Abstract": "This chapter contains sections titled:   Introduction   Experimental Protocol   Authentication Algorithm Based on EEG   Authentication Algorithm Based on ECG   EEG and ECG Fusion   Conclusion   Summary   Acknowledgments   References   IntroductionExperimental ProtocolAuthentication Algorithm Based on EEGAuthentication Algorithm Based on ECGEEG and ECG FusionConclusionSummaryAcknowledgmentsReferences",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:rpSJNIKeXWsC",
            "Publisher": "Wiley-IEEE Press"
        },
        {
            "Title": "A time-varying Gaussian model for the complex-valued EEG spectrum during mental imagery tasks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6287972/",
            "Abstract": "Recent findings in neuroscience have shown that the spectral components of electroencephalogram (EEG) signals convey information regarding the mental task not only in their power but also in their phase. This calls for the utilization of complex-valued spectrum, instead of the commonly used power spectral density, in designing the brain computer interfaces. This paper studies the complex-valued spectrum of the EEG signal recorded during mental imagery tasks, and provides a statistical model for the EEG spectral components. Motivated by the results of a recent work by the authors, this paper proposes a time-varying noncircularly-symmetric Gaussian model for complex-valued EEG spectrum during a mental imagery trial. It will be shown that the mean of this Gaussian model is constant over time, whereas its variance and pseudo-variance follow an autoregressive conditional heteroscedastic (ARCH) model …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:1yWc8FF-_SYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In Search of Probeable Generalization Measures",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.12259",
            "Abstract": "Understanding the generalization behaviour of deep neural networks is a topic of recent interest that has driven the production of many studies, notably the development and evaluation of generalization \"explainability\" measures that quantify model generalization ability. Generalization measures have also proven useful in the development of powerful layer-wise model tuning and optimization algorithms, though these algorithms require specific kinds of generalization measures which can probe individual layers. The purpose of this paper is to explore the neglected subtopic of probeable generalization measures; to establish firm ground for further investigations, and to inspire and guide the development of novel model tuning and optimization algorithms. We evaluate and compare measures, demonstrating effectiveness and robustness across model variations, dataset complexities, training hyperparameters, and training stages. We also introduce a new dataset of trained models and performance metrics, GenProb, for testing generalization measures, model tuning algorithms and optimization algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:J6OZcwVsj5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the distance function approach to color image enhancement",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166218X03005444",
            "Abstract": "A new class of image processing filters is introduced and analyzed in this paper. The new filters utilize fuzzy measures applied to image pixels connected by digital paths. The performance of the proposed filters is compared to the performance of commonly used filters, such as the vector median, under a variety of performance criteria. It is shown that the proposed filters are better able to suppress impulsive and Gaussian noise than the existing techniques. Also, they are robust to inaccuracies in parameter settings.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:HoB7MX3m0LUC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "On the Closed Form Expression of Elementary Symmetric Polynomials and the Inverse of Vandermonde Matrix",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1909.08155",
            "Abstract": "Inverse Vandermonde matrix calculation is a long-standing problem to solve nonsingular linear system  where the rows of a square matrix  are constructed by progression of the power polynomials. It has many applications in scientific computing including interpolation, super-resolution, and construction of special matrices applied in cryptography. Despite its numerous applications, the matrix is highly ill-conditioned where specialized treatments are considered for approximation such as conversion to Cauchy matrix, spectral decomposition, and algorithmic tailoring of the numerical solutions. In this paper, we propose a generalized algorithm that takes arbitrary pairwise (non-repetitive) sample nodes for solving inverse Vandermonde matrix. This is done in two steps: first, a highly balanced recursive algorithm is introduced with  complexity to solve the combinatorics summation of the elementary symmetric polynomials; and second, a closed-form solution is tailored for inverse Vandermonde where the matrix' elements utilize this recursive summation for the inverse calculations. The numerical stability and accuracy of the proposed inverse method is analyzed through the spectral decomposition of the Frobenius companion matrix that associates with the corresponding Vandermonde matrix. The results show significant improvement over the state-of-the-art solutions using specific nodes such as th roots of unity defined on the complex plane. A basic application in one dimensional interpolation problem is considered to demonstrate the utility of the proposed method for super-resolved signals.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:U5uP8zs9lfgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "cDNA Microarray Imaging using Single-Sensor Technology",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4054751/",
            "Abstract": "A new solution for cDNA microarray image acquisition and processing is introduced. The proposed solution uses a two-color filter array placed on top of a single image sensor to capture the two-channel cDNA microarray data as a single monochromatic image, thus reducing twofold the memory and storage space. The vectorial nature of the cDNA microarray data is restored using the proposed image processing framework which also denoises and enhances the acquired image",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:4hFrxpcac9AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special issue on spectral imaging II",
            "Publication year": 2005,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16879678",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:-DxkuPiZhfEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Compressive-sampling-based positioning in wireless body area networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6514596/",
            "Abstract": "Recent achievements in wireless technologies have opened up enormous opportunities for the implementation of ubiquitous health care systems in providing rich contextual information and warning mechanisms against abnormal conditions. This helps with the automatic and remote monitoring/tracking of patients in hospitals and facilitates and with the supervision of fragile, elderly people in their own domestic environment through automatic systems to handle the remote drug delivery. This paper presents a new modeling and analysis framework for the multipatient positioning in a wireless body area network (WBAN) which exploits the spatial sparsity of patients and a sparse fast Fourier transform (FFT)-based feature extraction mechanism for monitoring of patients and for reporting the movement tracking to a central database server containing patient vital information. The main goal of this paper is to achieve a high …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:QsaTk4IG4EwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Perceptual wavelet scheme for image compression",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4299/0000/Perceptual-wavelet-scheme-for-image-compression/10.1117/12.429483.short",
            "Abstract": "A perceptual wavelet coder was developed to satisfy a wide range of requirements, from high-end commercial applications where no distortion can be tolerated, to inherent and wireless types of applications, where bandwidth is highly restricted. A perceptual model was designed and incorporated in the compression scheme to allow the encoder to allocate bits for each subband based on minimizing the overall perceptual distortion. The perceptual model takes into account contrasts sensitivity at different frequency subband, local background at desired perceptual quality. The coder achieves scalability by multi-rate quantization and entropy coding. The result of the perceptual wavelet encoder were compared to those of JPEG and wavelet encoder without perceptual model. In addition to PSNR, a quality assessment model based on visual discrimination model was used to evaluate the compressed images. Results …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:HIFyuExEbWQC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Toward a no-reference image quality assessment using statistics of perceptual color descriptors",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7488248/",
            "Abstract": "Analysis of the statistical properties of natural images has played a vital role in the design of no-reference (NR) image quality assessment (IQA) techniques. In this paper, we propose parametric models describing the general characteristics of chromatic data in natural images. They provide informative cues for quantifying visual discomfort caused by the presence of chromatic image distortions. The established models capture the correlation of chromatic data between spatially adjacent pixels by means of color invariance descriptors. The use of color invariance descriptors is inspired by their relevance to visual perception, since they provide less sensitive descriptions of image scenes against viewing geometry and illumination variations than luminances. In order to approximate the visual quality perception of chromatic distortions, we devise four parametric models derived from invariance descriptors representing …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:uUvzmPk0f8oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind stain decomposition for histo-pathology images using circular nature of chroma components",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7178095/",
            "Abstract": "In this paper, we present a novel approach to achieve blind stain decomposition in histo-pathology images. The method is based on stain color estimation, followed by stain absorbing vector generation and matrix computation. Unlike conventional approaches adopting linear processing algorithms to analyze chromatic information in the cylindrical-coordinate color spaces, which may be inappropriate for circular data such as hue, we propose the use of circular thresholding on saturation-weighted hue histogram to compute candidates for stain representative colors. Experimental results suggest that our stain decomposition method is capable to address spectral variation in stains effectively. We compare the proposed method to state-of-the-art blind stain separation algorithms for nuclei segmentation on breast histo-pathology images, and demonstrate that the segmentation scheme adopting our method in its pre …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:WwIwg2wKZ0QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bayer pattern based CFA zooming/CFA interpolation framework",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079895/",
            "Abstract": "A unified framework for Bayer pattern based single-sensor imaging devices is introduced. Operating on the Bayer color filter array (CFA) data, the method performs CFA image zooming and full color image reconstruction in a cost-effective way making the system practical for hardware implementation. The high-level system components, namely CFA zooming, CFA interpolation and CFA based correction step utilize a color-ratio model and an edge-sensing mechanism to produce naturally colored and sharp, enlarged output. Simulation studies presented here indicate that the new method produces excellent results and outperforms other approaches in terms of both objective and subjective evaluation measures.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Beacons and the City: Smart Internet of Things",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128136775000298",
            "Abstract": "The interconnectedness of all things is continuously expanding. One of the main goals driving this growth is to improve the quality of life for its users. The aim is to have every individual interconnected with their surroundings and make it possible to interact with them whether it be at home, at work, or in public spaces through smart devices. Bluetooth low energy (BLE) beacons are wireless radio transmitters that can send an identifier to nearby receivers and trigger a number of applications, from proximity marketing to indoor localization and navigation. BLE beacons are small, low cost, and with minimum energy requirements. However, they do pose security and privacy challenges due to the broadcast nature of wireless communications. In this chapter, an introduction to BLE beacons is presented, along with their design approaches and limitations. Three smart city applications that can take advantage of BLE beacons …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:CCeGMaHljPEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Towards a theoretical framework of autonomous systems underpinned by intelligence and systems sciences",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9242329/",
            "Abstract": "Autonomous systems are an emerging AI technology functioning without human intervention underpinned by the latest advances in intelligence, cognition, computer, and systems sciences. This paper explores the intelligent and mathematical foundations of autonomous systems. It focuses on structural and behavioral properties that constitute the intelligent power of autonomous systems. It explains how system intelligence aggregates from reflexive, imperative, adaptive intelligence to autonomous and cognitive intelligence. A hierarchical intelligence model ( HIM ) is introduced to elaborate the evolution of human and system intelligence as an inductive process. The properties of system autonomy are formally analyzed towards a wide range of applications in computational intelligence and systems engineering. Emerging paradigms of autonomous systems including brain-inspired systems, cognitive robots, and …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:koF6b02d8EEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using colour local binary pattern features for face recognition",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5653653/",
            "Abstract": "In this paper, we propose a novel feature representation based on color-based Local Binary Pattern (LBP) texture analysis for face recognition (FR). The proposed method exploits both color and texture discriminative features of a face image for FR purpose. We evaluate the proposed feature using three public face databases: CMU-PIE, Color FERET, and XM2VTSDB. Experimental results show that the results of the proposed feature impressively better than the results of grayscale LBP and color features. In particular, it is shown that the proposed feature is highly robust against severe variations in illumination and spatial resolution.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Location tracking in wireless local area networks with adaptive radio maps",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1661382/",
            "Abstract": "This paper proposes a dynamic MMSE estimator for tracking mobile users in indoor wireless local area networks (WLAN) based on received signal strength (RSS). The method uses a training-based static estimate obtained by an adaptive kernel density estimator as the input into a Kalman Filter. Predictions from the filter are used during the next iteration to adaptively select a subset of training data, contained in a radio map, for the static estimator. Experimental results show that the combination of the Kalman filter and the adaptive radio map technique results in nearly 0.5 m (20%) improvement in root mean square location accuracy when compared to static localization",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CAE-Transformer: Transformer-based Model to Predict Invasiveness of Lung Adenocarcinoma Subsolid Nodules from Non-thin Section 3D CT Scans",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.08721",
            "Abstract": "Lung cancer is the leading cause of mortality from cancer worldwide and has various histologic types, among which Lung Adenocarcinoma (LAUC) has recently been the most prevalent. Lung adenocarcinomas are classified as pre-invasive, minimally invasive, and invasive adenocarcinomas. Timely and accurate knowledge of the invasiveness of lung nodules leads to a proper treatment plan and reduces the risk of unnecessary or late surgeries. Currently, the primary imaging modality to assess and predict the invasiveness of LAUCs is the chest CT. The results based on CT images, however, are subjective and suffer from a low accuracy compared to the ground truth pathological reviews provided after surgical resections. In this paper, a predictive transformer-based framework, referred to as the \"CAE-Transformer\", is developed to classify LAUCs. The CAE-Transformer utilizes a Convolutional Auto-Encoder (CAE) to automatically extract informative features from CT slices, which are then fed to a modified transformer model to capture global inter-slice relations. Experimental results on our in-house dataset of 114 pathologically proven Sub-Solid Nodules (SSNs) demonstrate the superiority of the CAE-Transformer over the histogram/radiomics-based models and its deep learning-based counterparts, achieving an accuracy of 87.73%, sensitivity of 88.67%, specificity of 86.33%, and AUC of 0.913, using a 10-fold cross-validation.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:DwWRdx-KAo4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hierarchical fuzzy feature similarity combination for presentation slide retrieval",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2008/547923.pdf",
            "Abstract": "This paper proposes a novel XML-based system for retrieval of presentation slides to address the growing data mining needs in presentation archives for educational and scholarly settings. In particular, contextual information, such as structural and formatting features, is extracted from the open format XML representation of presentation slides. In response to a textual user query, each extracted feature is used to compute a fuzzy relevance score for each slide in the database. The fuzzy scores from the various features are then combined through a hierarchical scheme to generate a single relevance score per slide. Various fusion operators and their properties are examined with respect to their effect on retrieval performance. Experimental results indicate a significant increase in retrieval performance measured in terms of precision-recall. The improvements are attributed to both the incorporation of the …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Enhancement of the DNA microarray chip images",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027908/",
            "Abstract": "In this paper a novel method of noise reduction in color images is presented. The new technique is capable of attenuating both impulsive and Gaussian noise, while preserving and even enhancing the sharpness of the image edges. Extensive simulations reveal that the new method outperforms significantly the standard techniques widely used in multivariate signal processing. In this work we apply the new noise reduction method for the enhancement of the images of gene chips. We demonstrate that the new technique is capable of reducing various kinds of noise present in microarray images and that it enables efficient spot location and estimation of the gene expression level, due to the smoothing effect and preservation of the spot edges. This paper contains the comparison of the new technique of noise reduction with the standard procedures used for the processing of vector valued images, as well as examples …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Visual-centric surveillance networks and services",
            "Publication year": 2005,
            "Publication url": "http://www.comm.toronto.edu/~kostas/Publications2008/pub/editorials/e2.pdf",
            "Abstract": "IEEE SIGNAL PROCESSING MAGAZINE [14] MARCH 2005 IEEE SIGNAL PROCESSING MAGAZINE [14] MARCH 2005 the limitations of such systems in regard to the number and type of detected events as well as in detection performance, the perception extension they provide to humans is a breakthrough in the everyday use of video object segmentation and classification tools designed by the image processing community. Until now, the available solutions have utilized a single remote sensor with long time periods to augment human perception. The use of multiple, possibly heterogeneous, networks of sensors distributed over large areas presents an interesting challenge for researchers specializing in this field. The question is the extent to which one can design multisensor processing tools that allow us to monitor larger areas for long time intervals, utilizing signals that can provide us with information at multiple resolution levels depending on the importance of events as defined by current assignments of mined historical data. This question is the subject of this special section on video and signal processing for surveillance networks and services, which highlights solutions based on techniques for multisensor data acquisition and processing. Surveillance systems are based on the strong interaction of these techniques, and their development requires multidisciplinary expertise (signal and image processing, computer vision, communications and networking, pattern recognition, and sensor development).",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:jU7OWUQzBzMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "COVID-19 and your smartphone: BLE-based smart contact tracing",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9373368/",
            "Abstract": "While contact tracing is of paramount importance in preventing the spreading of infectious diseases, manual contact tracing is inefficient and time consuming as those in close contact with infected individuals are informed hours, if not days, later. This article proposes a smart contact tracing (SCT) system utilizing the smartphone’s Bluetooth low energy signals and machine learning classifiers to automatically detect those possible contacts to infectious individuals. SCT’s contribution is two-fold: a) classification of the user’s contact as high/low-risk using precise proximity sensing, and b) user anonymity using a privacy-preserving communication protocol. To protect the user’s privacy, both broadcasted and observed signatures are stored in the user’s smartphone locally and only disseminate the stored signatures through a secure database when a user is confirmed by public health authorities to be infected. Using …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:1_W9tMSvGuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "H. 264-based compression of Bayer pattern video sequences",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4455567/",
            "Abstract": "Most consumer digital cameras use a single light sensor which captures color information using a color filter array (CFA). This produces a mosaic image, where each pixel location contains a sample of only one of three colors, either red, green or blue. The two missing colors at each pixel location must be interpolated from the surrounding samples in a process called demosaicking. The conventional approach to compressing video captured with these devices is to first perform demosaicking and then compress the resulting full-color video using standard methods. In this paper two methods for compressing CFA video prior to demosaicking are proposed. In our first method, the CFA video is directly compressed with the H.264 video coding standard in 4:2:2 sampling mode. Our second method uses a modified version of H.264, where motion compensation is altered to take advantage of the properties of CFA data …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An automated approach for kidney segmentation in three-dimensional ultrasound images",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7490394/",
            "Abstract": "Automated segmentation of kidneys in three-dimensional (3-D) abdominal ultrasound volumes is a task of paramount importance in automated diagnosis of abdominal trauma. However, ultrasound speckle noise, low-contrast boundaries, partial kidney occlusion, and probe misalignment restrict the utility of the solution, especially when it is used in emergency rooms and Focused Assessment with Sonography Trauma applications. This paper introduces a systematic and cost-effective method capable of detecting and segmenting the kidney's shape in acquired 3-D ultrasound volumes, using off-line training datasets. This paper offers a new shape model representation, called the complex-valued implicit shape model, to generate a 3-D kidney shape model by combining prior knowledge of training shapes and anatomical knowledge. We apply shape-to-volume registration, based on a new similarity metric, to detect …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:v_tt_AnqfNMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A {k, n}-Secret Sharing Scheme for Color Images",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25944-2_10",
            "Abstract": "This paper introduces a new {k,n}-secret sharing scheme for color images. The proposed method encrypts the color image into n color shares. The secret information is recovered only if the k (or more) allowed shares are available for decryption. The proposed method utilizes the conventional {k, n}-secret sharing strategy by operating at the bit-levels of the decomposed color image. Modifying the spatial arrangements of the binary components, the method produces color shares with varied both the spectral characteristics among the RGB components and the spatial correlation between the neighboring color vectors. Since encryption is done in the decomposed binary domain, there is no obvious relationship in the RGB color domain between any two color shares or between the original color image and any of the n shares. This increases protection of the secret information. Inverse cryptographic processing …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:M7yex6snE4oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fast adaptive similarity based impulsive noise reduction filter",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077201403000652",
            "Abstract": "In this paper, we address the problem of impulsive noise reduction in multichannel images. A new class of filters for noise attenuation is introduced and its relationship with commonly used filtering techniques is investigated. The computational complexity of the new filter is lower than that of the vector median filter (VMF). Extensive simulation experiments indicate that the new filter outperforms the VMF, as well as other techniques currently used to eliminate impulsive noise in color images.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Best student paper competition, CCECE'01-Introduction",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=18090304967954034432&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:tHtfpZlB6tUC",
            "Publisher": "IEEE CANADA"
        },
        {
            "Title": "2DLDA as matrix-variate formulation of a separable 1DLDA",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865515003232",
            "Abstract": "Two-directional (2D) variants of the linear discriminant analysis (LDA) algorithm have been widely used to extract features of matrix-variate signals. This paper derives the theoretical relationship between 2DLDA and one-directional (1D) LDA based on the separable transformation framework. Separable transforms such as separable 2DDCT are widely used for image compression in the JPEG standard; therefore, a similar framework for 2DLDA provides the corresponding parallel foundation for separable image feature extraction. There are existing 2DLDA methods providing a separable transformation, however they are not directly related to the 1DLDA solution. We will derive a 2DLDA method as a matrix-variate representation of a separable 1DLDA operator. Furthermore, we derive the necessary and sufficient conditions for separability of 1DLDA. These conditions will be helpful to clarify both limitations and …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:cBPnxVikjH8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Content sharing between home networks by using personal information and associated fuzzy vault scheme",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5174404/",
            "Abstract": "Content sharing is getting popular in home network as well as in social media. Content sharing inside home is usually done among family members, while that between different home networks is done by friends and even anonymous users. Especially, anonymous users could access contents in home networks which could act like home portals. To protect content in home servers, the contents can be encrypted by key and the key can be shared among users. However it is quite challenging to distribute the key to anonymous users. In this paper, we present a method for sharing contents securely among different home networks. We propose a method of content sharing between anonymous users, who have similar personal preferences about the contents. The personal preferences include user profiles and contents preference. With the proposed method, a content sharing community is created for content delivery …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:-mN3Mh-tlDkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effect of displayed contrast on perceptual 3D video quality",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6161861/",
            "Abstract": "There are several different factors that affect the perceived quality of 3D content. In this paper we study how the overall 3D visual perception is affected by the contrast between the objects of interest and the background in 3D-displayed videos. Our evaluations showed that the Weber contrast between objects of interest and background should be within the range of -0.5 to 1.5 to provide viewers with high quality of 3D experience.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:OBSaB-F7qqsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel chromaticity similarity based color texture descriptor for digital pathology image analysis",
            "Publication year": 2018,
            "Publication url": "https://sciexplore.net/dspace/handle/science/4712754",
            "Abstract": "Novel chromaticity similarity based color texture descriptor for digital pathology image \nanalysis DSpace Repository Novel chromaticity similarity based color texture descriptor for \ndigital pathology image analysis Login DSpace Home → crossref → Journal Article → View \nItem Novel chromaticity similarity based color texture descriptor for digital pathology image \nanalysis XingyuLi; Konstantinos N.Plataniotis; JieTian URI: http://localhost:8080/xmlui/handle/science/4712754 \nDate: 2018-11-12 Show full item record Files in this item Files Size Format View There are \nno files associated with this item. This item appears in the following Collection(s) Journal \nArticle Search DSpace Search DSpace This Collection Advanced Search Browse All of \nDSpace Communities & Collections By Issue Date Authors Titles Subjects This Collection By \nIssue Date Authors Titles Subjects My Account Login Register DSpace software copyright © -…",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:gkldIfsazJcC",
            "Publisher": "Public Library of Science (PLoS)"
        },
        {
            "Title": "Whole slide preview image segmentation and setup for digital pathology scanners",
            "Publication year": 2020,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.02.24.963645v1.abstract",
            "Abstract": "The problem of tissue finding is of special interest in automating WSI scanners where it decomposes the preview image of tissue glass slides into a simplified and abstract level of localization and identification to setup WSI scanner for high-resolution scan. Prior to such scanning, a preview image is captured to calibrate the scanner’s parameters. Scan parameters such as focus depth and scan region are determined using a tissue finding software package. This paper introduces a series of pipelines (e.g. binary mask segmentation, tissue/artifact classification, region-of-interest allocation) to automate tissue preview segmentation in both brightfield and darkfield microscopy.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:I-2NeQpV75MC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Denoising 3D ultrasound volumes using sparse representation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6610430/",
            "Abstract": "In this paper, a new 3D ultrasound (US) denoising technique that adopts the sparse representation has been proposed for an effective noise reduction in 3D US volumes. The purpose of the proposed method is to reduce image noise while preserving 3D objects edges, hence improving the human interpretation for clinical diagnosis and the 3D segmentation accuracy for further automatic malignancy detection. For denoising 3D US volumes, sparse representation was employed, which has showed an excellent performance in reducing Gaussian noise. It has been well known that US images contain severe multiplicative speckle noise, which has different characteristics compared to the additive Gaussian noise. In this paper, we propose a denoising framework for effectively reducing both Gaussian noise and speckle noise on 3D US volumes. The proposed method removes Gaussian noise using sparse …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:RtRctb2lSbAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multidimensional image processing",
            "Publication year": 2005,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=17100658",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Images of the Athenian Sun: Highlights From ICIP 2018 in Greece [Conference Highlights]",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8700670/",
            "Abstract": "104 IEEE SIgnal ProcESSIng MagazInE| May 2019| enjoyed a fine technical program, put together with the help of an outstanding technical program committee. The program included nine tutorials and five special sessions, which focused on emerging research areas. The technical program comprised 127 sessions arranged in thematic streams to avoid thematic overlaps and allow audience members to attend more sessions in their areas of interest. Sessions were very well attended, despite the competition from the food buffet, which remained well stocked throughout the conference. The conference offered three plenary talks on topics of great interest to our community, covering both academic and industrial trends. The plenary talks, enthusiastically received by ICIP attendees, were given by prominent scientists.■ C.-C. Jay Kuo, from the University of Southern California, shed light on the underlying operational …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:E8ajGqO0XoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BayesCap: A Bayesian Approach to Brain Tumor Classification Using Capsule Networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9244599/",
            "Abstract": "Convolutional neural networks (CNNs), which have been the state-of-the-art in many image-related applications, are prone to losing important spatial information between image instances. Capsule networks (CapsNets), on the other hand, are capable of leveraging such information through their routing by agreement process, making them powerful architectures for small datasets, such as medical imaging ones. Within the domain of medical imaging problems, brain tumor classification is of paramount importance, due to the deadly nature of this cancer and the consequences of the tumor misclassification. In our recent works, we showed potentials of developing CapsNet architecture for the task of brain tumor type classification. Similar to other deep learning models, however, CapsNets do not capture prediction uncertainty (coming from the uncertainty in the model weights, which is significantly important in keeping the …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:nroGzMJTTpEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Boosting color feature selection for color face recognition",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5640669/",
            "Abstract": "This paper introduces the new color face recognition (FR) method that makes effective use of boosting learning as color-component feature selection framework. The proposed boosting color-component feature selection framework is designed for finding the best set of color-component features from various color spaces (or models), aiming to achieve the best FR performance for a given FR task. In addition, to facilitate the complementary effect of the selected color-component features for the purpose of color FR, they are combined using the proposed weighted feature fusion scheme. The effectiveness of our color FR method has been successfully evaluated on the following five public face databases (DBs): CMU-PIE, Color FERET, XM2VTSDB, SCface, and FRGC 2.0. Experimental results show that the results of the proposed method are impressively better than the results of other state-of-the-art color FR methods …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Covid-fact: A fully-automated capsule network-based framework for identification of covid-19 cases from chest ct scans",
            "Publication year": 2021,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc8186443/",
            "Abstract": "The newly discovered Coronavirus Disease 2019 (COVID-19) has been globally spreading and causing hundreds of thousands of deaths around the world as of its first emergence in late 2019. The rapid outbreak of this disease has overwhelmed health care infrastructures and arises the need to allocate medical equipment and resources more efficiently. The early diagnosis of this disease will lead to the rapid separation of COVID-19 and non-COVID cases, which will be helpful for health care authorities to optimize resource allocation plans and early prevention of the disease. In this regard, a growing number of studies are investigating the capability of deep learning for early diagnosis of COVID-19. Computed tomography (CT) scans have shown distinctive features and higher sensitivity compared to other diagnostic tests, in particular the current gold standard, ie, the Reverse Transcription Polymerase Chain …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:onKP9CxGSkIC",
            "Publisher": "Frontiers Media SA"
        },
        {
            "Title": "Color sigma filter",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812776266_0086",
            "Abstract": "In this paper a new filtering scheme for the removal of impulsive noise in digital images is presented. The proposed method represents a nonlinear filtering approach for the impulsive noise reduction in color images. The new filter is based on the combination of the standard sigma-filter concept1 and robust order-statistics theory3. The new filtering scheme is computationally efficient and is able to achieve the balance between the image detail preservation and the noise suppression.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new CFA interpolation framework",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168405002872",
            "Abstract": "The paper introduces a new color filter array (CFA) interpolation method for digital still cameras. The proposed interpolation scheme is able to (i) overcome the hardware limitations of existing CFA based image acquisition solutions, and (ii) restore color images with excellent visual quality. The scheme employs an adaptive edge-sensing mechanism which operates along the vertical, horizontal and diagonal directions to correctly interpolate unavailable color components. Building on the computed edge-sensing map and a refined color-difference model, a new correlation–correction algorithm is introduced. In addition to the basic model, adaptively determined correction operations are also discussed and analyzed. The solutions proposed here, described in a novel vector notation, constitute a unique CFA interpolation framework, which readily unifies previous, seemingly unrelated, results. Simulation studies indicate …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An efficient kernel discriminant analysis method",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320305000877",
            "Abstract": "Small sample size and high computational complexity are two major problems encountered when traditional kernel discriminant analysis methods are applied to high-dimensional pattern classification tasks such as face recognition. In this paper, we introduce a new kernel discriminant learning method, which is able to effectively address the two problems by using regularization and subspace decomposition techniques. Experiments performed on real face databases indicate that the proposed method outperforms, in terms of classification accuracy, existing kernel methods, such as kernel principal component analysis and kernel linear discriminant analysis, at a significantly reduced computational cost.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:IaI1MmNe2tcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "CONetV2: Efficient Auto-Channel Size Optimization for CNNs",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.06830",
            "Abstract": "Neural Architecture Search (NAS) has been pivotal in finding optimal network configurations for Convolution Neural Networks (CNNs). While many methods explore NAS from a global search-space perspective, the employed optimization schemes typically require heavy computational resources. This work introduces a method that is efficient in computationally constrained environments by examining the micro-search space of channel size. In tackling channel-size optimization, we design an automated algorithm to extract the dependencies within different connected layers of the network. In addition, we introduce the idea of knowledge distillation, which enables preservation of trained weights, admist trials where the channel sizes are changing. Further, since the standard performance indicators (accuracy, loss) fail to capture the performance of individual network components (providing an overall network evaluation), we introduce a novel metric that highly correlates with test accuracy and enables analysis of individual network layers. Combining dependency extraction, metrics, and knowledge distillation, we introduce an efficient searching algorithm, with simulated annealing inspired stochasticity, and demonstrate its effectiveness in finding optimal architectures that outperform baselines by a large margin.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:bkKuixW_xMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Feature subspace determination in video-based mismatched face recognition",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4813417/",
            "Abstract": "In video-based face recognition (FR) applications such as surveillance security, the resolution of a facial image could significantly impact the reliability of recognition system. In most practical FR applications, it is reasonable to assume that the face resolution used during training is higher than the resolution used during the identification or verification process. This dimensional mismatch negatively impacts the performance of the traditional subspace recognition solutions. To address resolution mismatch problem, this paper introduces a novel estimation method capable of determining feature subspace of the lower resolution probe given an eigenspace pre-trained with higher resolution facial images. The effectiveness of the proposed solution has been successfully tested on standard CMU PIE face dataset. Experimental results and comparative evaluations provided in this work demonstrate the benefits of the …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EEG-based affect states classification using deep belief networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7574921/",
            "Abstract": "Affective states classification has become an important part of the Brain-Computer Interface (HCI) study. In recent years, affective computing systems using physiological signals, such as ECG, GSR and EEG has shown very promising results. However, like many other machine learning studies involving physiological signals, the bottle neck is always around the database acquisition and the annotation process. To investigate potential ways to address this small sample problem, this paper introduces a Deep Belief Networks (DBN) based learning system for the EEG-based affective processing system. Through the greedy-layer pretraining using unlabeled data as well as a supervised fine-tuning process, the DBN-based approaches significantly reduced the number of labeled samples required. The DBN methods also acted as an application specific feature selector, by examining the weight vector between the input …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:GYcXSSpN504C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the noise attenuation in DNA microarray images",
            "Publication year": 2001,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.baztech-fd981e73-b7ce-42f0-bfd6-94d90cfbc625",
            "Abstract": "In this paper a novel method of noise reduction in color images is presented. The new technique is capable of attenuating both impulsive and Gaussian noise, while preserving and even enhancing sharpness of the image edges. Extensive simulations reveal that the new method outperforms significantly the standard techniques widely used in multivariate signal processing. In this work we apply the new noise reduction method for the enhancement of the images of gene chips. We demonstrate that the new technique is capable of reducing various kinds of noise present in microarray images and that it enables efficient spot location and estimation of the gene expression level due to the smoothing effect and preservation of the spot edges. This paper contains the comparison of the new technique of noise reduction with the standard procedures used for the processing of vector valued images, as well as examples of the efficiency of the new algorithm when applied to typical microarray images.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:N4u4nq0IxgcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image diagnostic system, and methods of operating thereof",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US20200349707A1/en",
            "Abstract": "Various image diagnostic systems, and methods of operating thereof, are disclosed herein. Example embodiments relate to operating the image diagnostic system to identify one or more tissue types within an image patch according to a hierarchical histological taxonomy, identifying an image patch associated with normal tissue, generating a pixel-level segmented image patch for an image patch, generating an encoded image patch for an image patch of at least one tissue, searching for one or more histopathological images, and assigning an image patch to one or more pathological cases.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:5bfplxN71z4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Color Cue in Facial Image Analysis",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=7758510659359797422&hl=en&oi=scholarr",
            "Abstract": "CONTENTS 12.1 Introduction...................................................................................................................... 285 12.2 Color Cue and Facial Image Analysis.......................................................................... 286 12.3 Color Appearance for Color Cameras.......................................................................... 287",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:e0LTWoPxLYMC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "138 Life Sciences Computational Deglutition",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8588426/",
            "Abstract": "Presents a listing of the editorial board, board of governors, current staff, committee members, and/or society editors for this issue of the publication.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:JTtNqH-x4gYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Separable common spatio-spectral pattern algorithm for classification of EEG signals",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6637797/",
            "Abstract": "This paper proposes a novel method for extraction of discriminant spatio-spectral EEG features in motor imagery brain-computer interfaces. Considering a heteroscedastic binary classification setup, this method extracts the spatio-spectral features whose variance is maximized for one brain task and minimized for the other task. Therefore, our method can be considered as a spatio-spectral generalization of the conventional common spatial patterns (CSP) algorithm. In comparison to the similar solutions in the literature, such as filter-bank CSP (FBCSP) method, the proposed method benefits from joint processing of both spatial and spectral features, which improves the overall performance of the BCI while reducing its computational cost. Furthermore, our algorithm provides a simple measure that allows for ranking the discriminant power of extracted spatio-spectral features, which is not possible in FBCSP method …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:IsPWOBWtZBwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards automatic redeye effect removal",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865502003318",
            "Abstract": "The redeye effect is typically formed in amateur photographs taken with a built-in camera flash. Analysis of the available techniques and products indicates that their efficiency in correcting this artifact is limited and their performance is inconsistent. In this work we propose a user friendly solution, which could be used to restore amateur photographs. In the proposed method the redeye effect is detected using a skin detection module and eye colors are restored using morphological image processing. The new method is computationally efficient, robust to parameter settings and versatile, as it can work in conjunction with a number of skin detection methods.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:MXK_kJrjxJIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Personal Devices for Contact Tracing: Smartphones and Wearables to Fight Covid-19",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9566518/",
            "Abstract": "Digital contact tracing has emerged as a viable tool supplementing manual contact tracing. To date, more than 100 contact tracing applications have been published to slow down the spread of highly contagious Covid-19. Despite subtle variabilities among these applications, all of them achieve contact tracing by manipulating the following three components: use of a personal device to identify the user while designing a secure protocol to anonymize the user's identity; leverage networking technologies to analyze and store the data; and exploit rich sensing features on the user device to detect the interaction among users and thus estimate the exposure risk. This article reviews the current digital contact tracing based on these three components. We focus on two personal devices that are intimate to the user: smartphones and wearables. We discuss the centralized and decentralized networking approaches that are …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:aCwMkEyfDy8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Atlas-based segmentation of abdominal organs in 3D ultrasound, and its application in automated kidney segmentation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7318778/",
            "Abstract": "Automated segmentation of abdominal organs in 3D ultrasound images is an important and challenging task toward computer assisted emergency diagnosis. However, speckle noise, low-contrast organ tissues, intensity-profile inhomogeneity, and partial organ visibility are some ultrasound challenges which limits the utility of the automated diagnosis solutions. In this paper, an atlas-based method to automatically segment an organ of interest in abdominal 3D ultrasound images is proposed. The atlas model contains texture information and shape knowledge of the organ, which facilitates an accurate discrimination of organ from non-organ voxels in input 3D ultrasound images. The proposed method offers a mechanism to automatically detect the organ, and therefore, it eliminates the need of manual initialization of organ segmentation. The proposed method is applied to automatically segment the right kidney in 3D …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:Y0-TYkg6YM4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of estimation-assisted detector and space-time block codes for mimo systems",
            "Publication year": 2005,
            "Publication url": "http://www.comm.toronto.edu/~kostas/slam/files/mimo-report.pdf",
            "Abstract": "Multi-input multi-output (MIMO) systems are gaining popularity due to their higher capacity [1]. In MIMO systems, space-time block code (STBC) utilizes the diversity of multiple antenna to mitigate deep fading [2]. Various coherent and differential STBC have been developed to optimize performance in terms of error probability or capacity [3–13]. However, perfect channel state information (CSI) is generally not available at the receiver, and differential demodulation substantially reduces the capacity and degrades detection performance [14]. Therefore, a joint channel estimation and data detection (CE/DD) scheme is often needed [3, 15–19].Due to the importance of estimation-assisted MIMO detection, a novel CE/DD procedure is proposed and analyzed in this report. Other MIMO CE/DD schemes have been discussed in [3, 17–19]. The schemes in [3, 18] estimate the channel using pilot training. They assume that the fading coefficients remain constant from one pilot matrix to the next. This assumption is even more restrictive than the quasi-static fading model where",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:k_7cPK9k7w8C",
            "Publisher": "Dept. Elect. Comput. Eng., Univ. Toronto, Toronto, ON, Canada, Tech. Rep. version"
        },
        {
            "Title": "Compressed Sensing Recoverability In Imaging Modalities",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1212.1187",
            "Abstract": "The paper introduces a framework for the recoverability analysis in compressive sensing for imaging applications such as CI cameras, rapid MRI and coded apertures. This is done using the fact that the Spherical Section Property (SSP) of a sensing matrix provides a lower bound for unique sparse recovery condition. The lower bound is evaluated for different sampling paradigms adopted from the aforementioned imaging modalities. In particular, a platform is provided to analyze the well-posedness of sub-sampling patterns commonly used in practical scenarios. The effectiveness of the various designed patterns for sparse image recovery is studied through numerical experiments.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:KaMxkj08jr0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A statistical modelling based location determination method using fusion technique in WLAN",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.437.2864&rep=rep1&type=pdf",
            "Abstract": "Location information is of paramount importance in context aware Ambient Intelligence (AmI), Smart Space, traffic monitoring, surveillance network and cooperative communications services. This paper describes a Positioning determination solution based on wireless local area network (WLAN) signals. Position determination is based on the statistical modeling of the received signal at any position. This paper presents a probabilistic based statistical modeling approach for location estimation which incorporates fusion strategy in final step to combine efficiently the location individually reported by each WLAN transmitter. The system builds a radio map of the environment. The presented system is easier to implement and provide sufficiently good performance under all conditions. The accuracy with the 90% probability is reported to be 1.85 meters where as average error is reported to be 2.1 meters.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:L1USKYWJimsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer-assisted 3-d ultrasound probe placement for emergency healthcare applications",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7471428/",
            "Abstract": "In this paper, a new computer-assisted ultrasound probe placement system is introduced to guide paramedics and first responders to conduct abdominal ultrasound imaging for diagnosing trauma patients in emergency situations where specialists are not present. Recently, telesonography has been employed to supervise paramedics by remote experts to perform ultrasound scan for triaging, although its utility is limited by unavailability of fast internet connectivity in remote regions. In the proposed solution of this paper, a paramedic is first instructed to place the ultrasound probe on an initial placement for imaging an organ of interest. Then, a three-dimensional (3-D) ultrasound image is acquired and processed to determine the organ's shape misalignment with respect to a reference alignment. Afterward, the organ's shape misalignment is used to estimate the probe misalignment, and then, a probe placement …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:0sTkTiv_uMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Maximum likelihood binary detection in improper complex Gaussian noise",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4518333/",
            "Abstract": "In a wide range of communication systems, including DS-CDMA and OFDM systems, the signal-of-interest might be corrupted by an improper (F.D. Neeser et al.,1993) (also called non circularly symmetric (B. Picinbono, 1994)) interfering signal. This paper studies the maximum likelihood (ML) detection of binary signals in the presence of additive improper complex Gaussian noise. Proposing a new measure for noncircularity of complex random variables, we will derive the ML decision rule and its performance based on this measure. It will be shown that the ML detector performs pseudo correlation (F.D. Neeser et al.,1993) as well as conventional correlation of the observation to the signals-of-interest. As an alternative solution, we will propose a filter for converting improper signals to proper ones, called circularization filter, and will utilize it together with a conventional matched-filter (MF) to construct an ML detector.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Color image processing: methods and applications",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=13057618483559899708&hl=en&oi=scholarr",
            "Abstract": "Color Image Processing: Methods and Applications embraces two decades of extraordinary growth in the technologies and applications for color image processing. The book offers comprehensive coverage of state-of-the-art systems, processing techniques, and emerging applications of digital color imaging. To elucidate the significant progress in specialized areas, the editors invited renowned authorities to address specific research challenges and recent trends in their area of expertise. The book begins by focusing on color fundamentals, including color management, gamut mapping, and color constancy. The remaining chapters detail the latest techniques and approaches to contemporary and traditional color image processing and analysis for a broad spectrum of sophisticated applications, including: Vector and semantic processing Secure imaging Object recognition and feature detection Facial and retinal image analysis Digital camera image processing Spectral and superresolution imaging Image and video colorization Virtual restoration of artwork Video shot segmentation and surveillance Color Image Processing: Methods and Applications is a versatile resource that can be used as a graduate textbook or as stand-alone reference for the design and the implementation of various image and video processing tasks for cutting-edge applications. This book is part of the Digital Imaging and Computer Vision series.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:UebtZRa9Y70C",
            "Publisher": "CRC press"
        },
        {
            "Title": "Improved CFA Interpolation Approach",
            "Publication year": 2004,
            "Publication url": "https://www.ingentaconnect.com/content/ist/cgiv/2004/00002004/00000001/art00060",
            "Abstract": "In this paper, a new color filter array (CFA) interpolation method for digital still cameras is introduced. Building on the computed edge-sensing map and a refined color difference model, a new correlation-correction algorithm is introduced. Due to edge-sensing interpolation mechanism and correction steps performed for each color channel, the proposed interpolation scheme is able to overcome the limitations of existing CFA based image acquisition solutions and restore color images without introducing false colors, edge blurring or visual artifacts. Moreover, the proposed method is described in a novel vector notation, which readily unifies previously developed schemes. Simulation studies indicate that the proposed method is computationally efficient and yields excellent performance, in terms of subjective and objective image quality measures, while outperforming well-known and widely used CFA interpolation …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:2v_ZtQDX9iAC",
            "Publisher": "Society for Imaging Science and Technology"
        },
        {
            "Title": "An analysis of random projection for changeable and privacy-preserving biometric verification",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5382573/",
            "Abstract": "Changeability and privacy protection are important factors for widespread deployment of biometrics-based verification systems. This paper presents a systematic analysis of a random-projection (RP)-based method for addressing these problems. The employed method transforms biometric data using a random matrix with each entry an independent and identically distributed Gaussian random variable. The similarity- and privacy-preserving properties, as well as the changeability of the biometric information in the transformed domain, are analyzed in detail. Specifically, RP on both high-dimensional image vectors and dimensionality-reduced feature vectors is discussed and compared. A vector translation method is proposed to improve the changeability of the generated templates. The feasibility of the introduced solution is well supported by detailed theoretical analyses. Extensive experimentation on a face-based …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fourier-based rotation invariant image features",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5414017/",
            "Abstract": "Fourier Coefficients have long been used to achieve invariance to signal transformations. For the purposes of image processing, the magnitude of the Fourier transform has been used in conjunction with other transforms to achieve invariance to rotation. In this paper we propose a Rotation Invariant Descriptor for matching images based on features derived from the Discrete Fourier Transform (DFT). The features combine both the phase and the magnitude information to achieve invariance. Experiments are conducted to show the robustness of these features under changes of scale and compression of images.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the fast modification of the vector median filter",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1048188/",
            "Abstract": "A new filtering approach designed to eliminate impulsive noise in color images, while preserving fine image details is presented in this paper. The comparison shows that the new filter outperforms the VMF, as well as other standard procedures used in color image processing for the elimination of impulsive noise.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ct-caps: Feature extraction-based automated framework for covid-19 disease identification from chest ct scans using capsule networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9414214/",
            "Abstract": "The global outbreak of the novel corona virus (COVID-19) disease has drastically impacted the world and led to one of the most challenging crisis across the globe since World War II. The early diagnosis and isolation of COVID-19 positive cases are considered as crucial steps towards preventing the spread of the disease and flattening the epidemic curve. Chest Computed Tomography (CT) scan is a highly sensitive, rapid, and accurate diagnostic technique that can complement Reverse Transcription Polymerase Chain Reaction (RT-PCR) test. Recently, deep learning-based models, mostly based on Convolutional Neural Networks (CNN), have shown promising diagnostic results. CNNs, however, are incapable of capturing spatial relations between image instances and require large datasets. Capsule Networks, on the other hand, can capture spatial relations, require smaller datasets, and have considerably …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:6Zm5LS9gQ5UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Memoryless techniques and wireless technologies for indoor localization with the internet of things",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9086809/",
            "Abstract": "In recent years, the Internet of Things (IoT) has grown to include the tracking of devices through the use of indoor positioning systems (IPSs) and location-based services (LBSs). When designing an IPS, a popular approach involves using wireless networks to calculate the approximate location of the target from devices with predetermined positions. In many smart building applications, LBS is necessary for efficient workspaces to be developed. In this article, we examine two memoryless positioning techniques,  K -nearest neighbor (KNN) and Naive Bayes, and compare them with simple trilateration, in terms of accuracy, precision, and complexity. We present a comprehensive analysis between the techniques through the use of three popular IoT wireless technologies: 1) ZigBee; 2) Bluetooth low energy (BLE); and 3) WiFi (2.4-GHz band), along with three experimental scenarios to verify results across multiple …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:ynsZFq2pu0MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Color image denoising using evolutionary computation",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ima.20058",
            "Abstract": "Noise suppression in multichannel data sets, such as color images, has drawn much attention in the last few years. An issue of paramount importance in designing color image filters is the determination of the coefficients that should be used to weight the inputs to the filter. In this study, we propose an evolutionary computation‐based approach to select and optimize the coefficients in the class of weighted vector directional filters. Using a genetic algorithm, we were able to adapt the filter weights to match varying image and noise characteristics. Extended experimentation with realistic image processing applications, including television image enhancement and virtual restoration of artworks, indicates that the proposed filters are capable of removing noise while preserving chromaticity information, edges, and fine details, as well as structural image content. © 2006 Wiley Periodicals, Inc. Int J Imaging Syst Technol, 15 …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Watermark detection for noisy interpolated images",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1632344/",
            "Abstract": "In this brief, the case where the watermark is detected in a noisy interpolated version of the originally watermarked image is investigated. Polyphase decomposition is utilized at the detection side in order to enable the flexible formation of a fused image, which is appropriate for watermark detection. The optimal fused correlator, obtained by combining information from different image components, is derived through a statistical analysis of the correlation detector properties, followed by Lagrange optimization. It is shown that it is preferable to perform detection in a fused image rather than the original image.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new approach to camera image indexing",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11556121_18",
            "Abstract": "This paper presents a color filter array (CFA) image indexing approach. To enhance the functionality of single-sensor consumer electronics such as digital cameras, imaging-enabled mobile phones and wireless personal digital assistants (PDAs), the proposed solution embeds the metadata information to a CFA image using a common discrete cosine transform (DCT) based watermarking scheme. Depending on a consumer electronic device employed, the metadata information can be used to indicate ownership, capturing device identification numbers, time and location information. The metadata information can be extracted from the gray-scale, mosaic-like CFA image or the full-color, demosaicked image using PC software commonly available by camera manufacturers or with conventional public image database tools. Simulation studies reported in the paper indicate that the proposed CFA indexing …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:ipzZ9siozwsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Biometric encryption: Creating a privacy-preserving ‘watch-list’facial recognition system",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-5230-9_9",
            "Abstract": "This paper presents the proof of concept of a facial recognition (FR) system combined with Biometric Encryption (BE) in a watch-list scenario. The system was successfully deployed for Ontario Lottery and Gaming Corporation (OLG) self-exclusion (SE) program. The system is hybrid in nature and comprises a commercial facial recognition module with anonymous templates sequentially combined with a BE module. BE is used to conceal the relationship between a self-excluded person’s FR template and their other personal information (PI). To reveal the corresponding PI record for a matched FR record, BE will attempt to release the pointer key. The FR templates and BE helper data use different biometric feature vectors to prevent interoperability between two modules. In case of a positive match, the final decision is made by a human operator. The BE scheme is based on improved Quantization Index …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:KWzIFqRkAKkC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Distributed Hybrid Kalman Temporal Differences for Reinforcement Learning",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9443572/",
            "Abstract": "The paper focuses on development of model-free and distributed Reinforcement Learning (RL) algorithms for multi-agent networks. The goal is to learn optimal control policies directly from smart agents’ cooperative interactions among themselves and with the environment. In model-free RL methods with continuous state-space, typically, the value function needs to be approximated. In this regard, Deep Neural Networks (DNNs) provide an attractive modeling mechanism to approximate the value function using sample transitions. Direct utilization of DNN-based single-agent approaches, however, failed to fully overcome the complexities of the multi-agent scenarios. In different multi-agent cooperative scenarios, Kalman-based methodologies could be used as an efficient alternative. Such an approach, however, commonly requires a-priori information about the system (such as noise statistics) to perform efficiently. To …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:Lo8V22OuN40C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Efficiency of the Wavelet Based Compression Techniques",
            "Publication year": 2001,
            "Publication url": "http://www.imaging.org/site/PDFS/Papers/2001/PICS-0-251/4658.pdf",
            "Abstract": "In this paper we address the problem of the correlation between the objective quality measures, like mean squared error or signal to noise ratio and the subjective quality perceived by human viewers. Using both the objective and subjective quality measures we aimed to compare the efficiency of the wavelet based lossy codecs DJVU and LWF with the DCT based standard JPEG compression method. For the experiments a set of 3 gray-scale and 3 color test images was used. The images were encoded at the same compression levels and standard objective quality measures were calculated for all images. For the visual assessment of the quality of the compressed images, a group of 100 male students evaluated them using a linear rating scale. The results have shown that there is no significant correlation between the objective and subjective quality measures. Although the wavelet based LWF codec outperformed significantly DJVU in terms of MSE and SNR, no significant differences in human visual perception of those images were observed. It was also observed that the histogram of the viewers preferences regarding the image compression ratio is bimodal and no optimal compression level could be established.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:SpbeaW3--B0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Matrix-Variate Linear Discriminant Analysis for Filterbank-CSP",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.722.543&rep=rep1&type=pdf",
            "Abstract": "Objective: Every 0.5 second, the algorithm should classify the EEG signal received during the last second of data.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:W2uZP3ddy8sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The 2018 IEEE Spoken Language Technology Workshop will be held 18–21 December in Athens, Greece.",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8398590/",
            "Abstract": "[Dates Ahead] Page 1 137 IEEE SIgnal ProcESSIng MagazInE | July 2018 | Please send \ncalendar submissions to: Dates Ahead, Att: Jessica Welsh, E-mail: j.welsh@ieee.org \nDATES AHEAD 2018 august IEEE 20th International Workshop on Multimedia signal \nProcessing (MMsP) 29–31 August, Vancouver, Canada. General Chairs: Z. Jane Wang and \nFrederic Dufaux URL: http://www.ece.ubc.ca/~mmsp2018/ sEPtEMbEr 26th European \nsignal Processing Conference (EusIPCO) 3–7 September, Rome, Italy. General Chair: \nPatrizio Campisi General Cochair: Josef Kittler URL: http://www.eusipco2018.org/ IEEE \nInternational Conference on Content-based Multimedia Indexing (CbMI) 4–6 September, La \nRochelle, France. General Chair: Renaud Péteri URL: http://cbmi2018.univ-lr.fr/ IEEE \nInternational Workshop on Machine Learning for signal Processing (MLsP) 17–20 \nSeptember, Aalborg, Denmark. General Chair: Zheng-…",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:NU-BerS4NX4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer aided diagnosis for detecting abdominal bleeding with 3D ultrasound imaging",
            "Publication year": 2015,
            "Publication url": "https://patents.google.com/patent/US20150201907A1/en",
            "Abstract": "The presented invention provides a detection method for free fluid in the human body. The preprocessing procedure is applied to reduce the speckle noise and enhance tissue volumetric pixels (voxels) intensity levels to make tissue and non-tissue voxels more distinguishable from each other. An initial surface selection step provides flexibility to either manually or automatically selecting a seed point to segment fluid regions in the volumetric data. A kidney and liver organ detection procedure provides a method for determining whether the detected fluid region is a normal fluid-carrying body organ or if it is due to a medical condition as a free fluid region. A combinational approach using a 3-dimensional Snake and Level-Set is utilized to accurately detect fluid regions in the volumetric ultrasound data.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Azgs6IHzeyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boosting linear discriminant analysis for face recognition",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1247047/",
            "Abstract": "In this paper, we propose a new algorithm to boost performance of traditional linear discriminant analysis (LDA)-based face recognition (FR) methods in complex FR tasks, where highly nonlinear face pattern distributions are often encountered. The algorithm embodies the principle of \"divide and conquer\", by which a complex problem, is decomposed into a set of simpler ones, each of which can be conquered by a relatively easy solution. The Ad-aBoost technique is utilized within this framework to: 1) generalize a set of simple FR sub-problems and their corresponding LDA solutions; 2) combine results from the multiple, relatively weak, LDA solutions to form a very strong solution. Experimentation performed on the FERET database indicates that the proposed methodology is able to greatly enhance performance of the traditional LDA-based method with an averaged improvement of correct recognition rate (CRR) up …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:0aBXIfxlw9sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure Throughput Optimization for Cache-Enabled Multi-UAVs Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9542958/",
            "Abstract": "This paper considers an Ultra-Dense Heterogeneous Network (UDHN) consisting of cache-enabled Unmanned Aerial Vehicles (UAVs) and Internet of things Mobile Devices (IMDs) receiving their requested contents via the Power Domain Non-Orthogonal Multiple Access (PD-NOMA) protocol. Employing the Fast Global K-Means (FGKM) algorithm, IMDs are partitioned into several clusters connecting to either other IMDs or UAV belonging to the same cluster in the presence of untrusted users, known as non-legitimate eavesdroppers. It is assumed that users located in the cluster edge area communicate with multiple UAVs to obtain their requested contents. The main goal for such a network is to jointly optimize the number of UAVs, their 3D placements, and the cache placement probability of contents stored in UAVs and IMDs by maximizing the secure cache throughput. Toward this goal, we prove that the objective …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:Zbx7W2Xs4QsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Color texture representation using circular-processing based hue-lbp for histo-pathology image analysis",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7533025/",
            "Abstract": "Texture is considered one of most significant information sources in histo-pathology image analysis. To take advantage of information on color texture in digital histo-pathology, this work analyzes inherent characteristics of the hue component in the cylindrical color space, and introduces an effective color texture descriptor based on the LBP paradigm. Unlike existing LBP variants designed for linear data, the proposed descriptor, namely Hue-LBP, addresses the angular and periodic nature of hue and shows that color variation in the hue channel can be quantified by an angular variable in the range of [0,180]. By introducing the concept of color similarity as a metric to measure color variation, we obtain a histogram to describe local color texture patterns. Experimentation on histo-pathology image classification suggests that the proposed Hue-LBP is discriminative as it is capable of describing texture information …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:idthP5jqfYAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Brain tumor type classification via capsule networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451379/",
            "Abstract": "Brain tumor is considered as one of the deadliest and most common form of cancer both in children and in adults. Consequently, determining the correct type of brain tumor in early stages is of significant importance to devise a precise treatment plan and predict patient's response to the adopted treatment. In this regard, there has been a recent surge of interest in designing Convolutional Neural Networks (CNNs) for the problem of brain tumor type classification. However, CNNs typically require large amount of training data and can not properly handle input transformations. Capsule networks (referred to as CapsNets) are brand new machine learning architectures proposed very recently to overcome these shortcomings of CNNs, and posed to revolutionize deep learning solutions. Of particular interest to this work is that Capsule networks are robust to rotation and affine transformation, and require far less training …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:BCdnXsLIVDwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indoor Positioning with Wireless Local Area Networks (WLAN).",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=10994307214592307160&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:qwy9JoKyICEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multi-model filter for mobile terminal location tracking",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1040794/",
            "Abstract": "Mobile terminal location is an important area of research because of its application in location-sensitive browsing and resource allocation. This paper presents a method for reducing the error in mobile terminal location estimation. A model-based dynamic filter is presented which uses an accurate model of mobile terminal motion to combine information from location measurements made at different time instances to create an improved location estimate. The model of mobile terminal motion has a kinematic state space model describing the physical rules governing terminal motion and a control model that describes the human control input into the motion process. The dependency between the terminal location and the control decisions is used to derive a new dynamic filter. This filter provides better accuracy than previously known location techniques and is robust to variations in the mobile terminal motion.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:7wO8s98CvbsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic annotation of personal video content using an image folksonomy",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5413429/",
            "Abstract": "The increasing popularity of user-generated content (UGC) requires effective annotation techniques in order to facilitate precise content search and retrieval. In this paper, we propose a new approach for the semantic annotation of personal video content, taking advantage of user-contributed tags available in an image folksonomy. Video shots and folksonomy images are first represented by a semantic vector. Next, the semantic vectors are used to measure the semantic similarity between each video shot and the folksonomy images. Tags assigned to semantically similar folksonomy images are then used to annotate the video shots. To verify the effectiveness of the proposed annotation method, experiments were performed with video sequences retrieved from YouTube and images downloaded from Flickr. Our experimental results demonstrate that the proposed method is able to successfully annotate personal …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All at once: Temporally adaptive multi-frame interpolation with advanced motion modeling",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-58583-9_7.pdf",
            "Abstract": "Recent advances in high refresh rate displays as well as the increased interest in high rate of slow motion and frame up-conversion fuel the demand for efficient and cost-effective multi-frame video interpolation solutions. To that regard, inserting multiple frames between consecutive video frames are of paramount importance for the consumer electronics industry. State-of-the-art methods are iterative solutions interpolating one frame at the time. They introduce temporal inconsistencies and clearly noticeable visual artifacts.Departing from the state-of-the-art, this work introduces a true multi-frame interpolator. It utilizes a pyramidal style network in the temporal domain to complete the multi-frame interpolation task in one-shot. A novel flow estimation procedure using a relaxed loss function, and an advanced, cubic-based, motion model is also used to further boost interpolation accuracy when complex motion segments …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:KsTgnNRry18C",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A cost-effective encryption scheme for color images",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077201405000355",
            "Abstract": "A new secret sharing scheme suitable for encrypting color images is introduced. The scheme, which can be viewed as a cost-effective, private-key cryptosystem, encrypts the secret color image into two color shares with dimensions identical to those of the original secret input. Cryptographic operations performed at the bit levels are used to alter both the spectral correlation among the RGB color components and the spatial correlation of the neighboring color vectors in the secret image. The original image is decrypted with perfect reconstruction using inverse logical operations which are applied to the noise-like color shares. The scheme can be used in secure transmission of digital imaging material over untrusted networks or it can serve as stand-alone image encryption solution.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A New Color Image Zooming Technique for Digital Still Cameras",
            "Publication year": 2004,
            "Publication url": "https://www.ingentaconnect.com/content/ist/cgiv/2004/00002004/00000001/art00103",
            "Abstract": "This paper focuses on color image zooming performed on the Bayer pattern, a color filter array widely used in digital still cameras. The proposed method firstly enlarges the Bayer image and secondly interpolates the missing color elements of the enlarged Bayer image by an edge-sensing interpolation scheme combined with a color difference model. This enhances structural content preservation and results in excellent color fidelity of the enlarged image. The proposed edge-sensing zooming algorithm preserves the structural content of the Bayer data and produces a sharp, enlarged output. Used cascades of the proposed zooming method and efficient color filter array interpolations produce images that are naturally colored and pleasurable for viewing. This also results in excellent results in terms of objective image quality measure.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:qe6vwMD2xtsC",
            "Publisher": "Society for Imaging Science and Technology"
        },
        {
            "Title": "SPIHT-based coding of the shape and texture of arbitrarily shaped visual objects",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4011981/",
            "Abstract": "A new scheme for coding both the shape and texture of arbitrarily shaped visual objects is presented. Based on set partitioning on hierarchical trees (SPIHT), the proposed Shape and Texture SPIHT (ST-SPIHT) employs a novel implementation of the shape-adaptive discrete wavelet transform (SA-DWT) using in-place lifting, along with parallel coding of texture coefficients and shape mask pixels to create a single embedded code that allows for fine-grained rate-distortion scalability. The single output code simplifies the logistics of object storage and transmission compared to previously published schemes. An input parameter provides control over the relative progression between shape and texture coding in the embedded code, allowing for adjustment of the emphasis of shape versus texture quality in low bit rate reconstructions. The combination of features provided by ST-SPIHT, namely, explicit and progressive …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Explaining convolutional neural networks through attributionbased input sampling and block-wise feature aggregation",
            "Publication year": 2021,
            "Publication url": "https://msudhakar.com/post/sise-blog/",
            "Abstract": "Deep Neural models based on Convolutional Neural Networks (CNNs) have rendered inspiring breakthroughs in a wide variety of computer vision tasks. However, the lack of interpretability hurdles the understanding of decisions made by these models. This diminishes the trust consumers have for CNNs and limits the interactions between users and systems established based on such models.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:IExZWSxeYXUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Face detection and recognition",
            "Publication year": 2017,
            "Publication url": "https://patents.google.com/patent/US9639740B2/en",
            "Abstract": "The present invention provides, in at least one aspect, methods and systems that detect at least one face in at least one digital image, determine and store area co-ordinates of a location of the at least one detected face in the at least one digital image, apply at least one transformation to the at least one detected face to create at least one portrait of the at least one detected face, rotate the at least one portrait at least until the at least one portrait is shown in a vertical orientation and a pair of eyes of the at least one face shown in the at least one portrait are positioned on a horizontal plane; and store the rotated at least one portrait.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:QsKbpXNoaWkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the energy efficiency of LT codes in proactive wireless sensor networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5643170/",
            "Abstract": "This paper presents an in-depth analysis on the energy efficiency of Luby transform (LT) codes with frequency shift keying (FSK) modulation in a wireless sensor network (WSN) over Rayleigh fading channels with path-loss. We describe a proactive system model according to a flexible duty-cycling mechanism utilized in practical sensor apparatus. The present analysis is based on realistic parameters including the effect of channel bandwidth used in the IEEE 802.15.4 standard, active mode duration, and computation energy. A comprehensive analysis, supported by some simulation studies on the probability mass function of the LT code rate and coding gain, shows that among uncoded FSK and various classical channel coding schemes, the optimized LT coded FSK is the most energy-efficient scheme for distance  d  greater than the predetermined threshold level  dT , where the optimization is performed over …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technical Correspondence",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Plataniotis/publication/227343639_Face_Feature_Weighted_Fusion_Based_on_Fuzzy_Membership_Degree_for_Video_Face_Recognition/links/02bfe513f27774010e000000/Face-Feature-Weighted-Fusion-Based-on-Fuzzy-Membership-Degree-for-Video-Face-Recognition.pdf",
            "Abstract": "This paper proposes a new video face recognition (FR) method that is designed for significantly improving FR via adaptive fusion of multiple face features (belonging to the same subject) acquired from a face sequence of video frames. In this paper, we derive an upper bound for recognition error arising from the proposed weighted feature fusion to justify theoretically its effectiveness for recognition from videos. In addition, in order to compute the optimal weights of face features to be fused, we develop a novel weight determination solution based on fuzzy membership function and quality measurement for face images. Using four public video databases, the effectiveness of the proposed method has been successfully evaluated under the conditions that are similar to those in real-world video FR applications. Furthermore, our method is simple and straightforward to implement.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:PkcyUWeTMh0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An objective and subjective evaluation of content-based privacy protection of face images in video surveillance systems using JPEG XR",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=11411719191385946315&hl=en&oi=scholarr",
            "Abstract": "Present-day video surveillance systems often come with high-speed network connections, high processing power, and plenty of storage capacity. These computational capabilities enable the deployment of sophisticated computer vision algorithms that make it possible to find people [1], detect faces [2], recognize faces [3], and analyze the activity of people [4]. As a result, video surveillance systems are increasingly getting better at detecting terrorists and acts of crime, enhancing our sense of security. However, the increasing ability of video surveillance systems to successfully identify people has raised several privacy concerns during the past few years. Indeed, such concerns have, for instance, been voiced with respect to the use of FR technology in public spaces, archiving face images for possible later use, the unauthorized addition of face images to watch lists, and power abuse by guards [5]. In addition, large …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:65Yg0jNCQDAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonlinear techniques for color image processing",
            "Publication year": 2003,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9780203010419-17/nonlinear-techniques-color-image-processing-bogdan-smolka-konstantinos-plataniotis-anastasios-venetsanopoulos",
            "Abstract": "CONTENTS 12.1 Introduction.......................................................... 445 12.2 Adaptive Noise Reduction Filtering................................. 448 12.3 Anisotropic Diffusion................................................ 453 12.4 Noise Reduction Filters for Color Image Processing................ 460 12.5 Digital Paths Approach to Color Image Filtering................... 471 12.6 Efficiency of the New Filter Class................................... 486 Acknowledgment.......................................................... 498 References.................................................................. 499",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:mVmsd5A6BfQC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Toward breast cancer histopathology image diagnosis using local color binary pattern",
            "Publication year": 2016,
            "Publication url": "https://www.ece.ualberta.ca/~xingyu/resources/C_ImNO2016.pdf",
            "Abstract": "Introduction. Breast cancer is the most common female cancer in the world. Generally, breast cancer, either “in-situ” or “invasive”, has different characteristics from normal breast tissue. In specify, in the normal case, a group of healthy cells are placed along ducts’ walls; However in the “in-situ” breast cancer, carcinoma cells fill the ducts, developing further to the “invasive” cancer where malignant cells spread into nearby tissues. In breast cancer diagnosis via histopathology images, Hematoxylin and Eosin (H&E) are usually used to stain biopsy samples for visibility enhancement. In H&E stained images, Hemaxotylin stains nuclei in cells blue/purple, and Eosin stains cytoplasm and connective tissues pink. Hence, color distribution, or color variation, in an image actually reveals the spatial organization of cells. Figures bellow show examples of an H&E stained normal sample, an in-situ breast cancer and an invasive …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:ujxm2eEBZHIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Microlocation for smart buildings in the era of the internet of things: A survey of technologies, techniques, and approaches",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8454400/",
            "Abstract": "Microlocation plays a key role in the transformation of traditional buildings into smart infrastructure. Microlocation is the process of locating any entity with a very high accuracy, possibly in centimeters. Such technologies require high detection accuracy, energy efficiency, wide reception range, low cost, and availability. In this article, we provide insights into various microlocation-enabling technologies, techniques, and services and discuss how they can accelerate the incorporation of the Internet of Things (IoT) in smart buildings. We cover the challenges and examine some signal processing filtering techniques such that microlocation-enabling technologies and services can be thoroughly integrated with an IoT-equipped smart building. An experiment with Bluetooth Low-Energy (BLE) beacons used for microlocation is also presented.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:LWqeokA2EBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust Automated Framework for COVID-19 Disease Identification from a Multicenter Dataset of Chest CT Scans",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.09241",
            "Abstract": "The objective of this study is to develop a robust deep learning-based framework to distinguish COVID-19, Community-Acquired Pneumonia (CAP), and Normal cases based on chest CT scans acquired in different imaging centers using various protocols, and radiation doses. We showed that while our proposed model is trained on a relatively small dataset acquired from only one imaging center using a specific scanning protocol, the model performs well on heterogeneous test sets obtained by multiple scanners using different technical parameters. We also showed that the model can be updated via an unsupervised approach to cope with the data shift between the train and test sets and enhance the robustness of the model upon receiving a new external dataset from a different center. We adopted an ensemble architecture to aggregate the predictions from multiple versions of the model. For initial training and development purposes, an in-house dataset of 171 COVID-19, 60 CAP, and 76 Normal cases was used, which contained volumetric CT scans acquired from one imaging center using a constant standard radiation dose scanning protocol. To evaluate the model, we collected four different test sets retrospectively to investigate the effects of the shifts in the data characteristics on the model's performance. Among the test cases, there were CT scans with similar characteristics as the train set as well as noisy low-dose and ultra-low dose CT scans. In addition, some test CT scans were obtained from patients with a history of cardiovascular diseases or surgeries. The entire test dataset used in this study contained 51 COVID-19, 28 CAP, and 51 …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:kQqwFFzsCTwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diagnostic color estimation of tissue components in pathology images via von Mises mixture model",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7351163/",
            "Abstract": "In this paper, we present a novel approach to achieve diagnostic color estimation for histological objects in pathology images. The method is based on a von Mises mixture model for hue histogram, followed by implicit pixel clustering via maximum likelihood estimation and representative color computation. Unlike conventional approaches adopting linear processing algorithms to analyze hue histogram which is characterized by a nature of periodicity, we build a circular cluster model composed of multiple von Mises distributions to address the directional nature of hue. Experimental results on synthetic circular data suggest that the proposed circular model outperforms both classical linear thresholding methods and the state-of-art circular thresholding approach in terms of cluster parameter estimation. The color estimation experiment on publicly-accessible cytopathology images demonstrates that our method is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:7H_jS4BsgvYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radio map fusion for indoor positioning in wireless local area networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1592008/",
            "Abstract": "This paper addresses the problem of indoor location estimation (LE) in wireless local area network (WLAN) using received signal strength (RSS). The difficultly of the problem lies in the complexity of the indoor propagation channel at operating WLAN frequency of 2.4 GHz, resulting in nonlinear and non-Gaussian spatio-temporal RSS properties. The first contribution of this paper is the introduction of a non-parametric Nadaraya-Watson estimator for LE using location fingerprints to capture the spatial distribution of RSS. Secondly, a novel method is proposed based on fusion of multiple location fingerprints at each survey location to cope with multimodal temporal probability distributions of RSS. Experimental results using real data collected in an office environment indicate that the proposed multiple-map method outperforms the KNN-based LE methods in terms of root mean square error.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New technique for the restoration of noisy color images",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027823/",
            "Abstract": "In this paper we propose a new efficient algorithm of noise suppression in color images. The new technique of multichannel image enhancement is capable of reducing impulsive and Gaussian noise and it outperforms the standard methods of noise reduction. In this paper a new smoothing operator, based on a random walk model and on a fuzzy similarity membership function of pixels connected by digital paths is introduced. The efficiency of the proposed method has been tested on the standard color images using the widely used objective image quality measures.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:vDijr-p_gm4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "KBSTAP implementation for HFSWR",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11051725278399557732&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:hNSvKAmkeYkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Student Paper Competition, CCECE-Introduction",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=15379581263315500717&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:DyXnQzXoVgIC",
            "Publisher": "IEEE CANADA"
        },
        {
            "Title": "Green modulation in proactive wireless sensor networks",
            "Publication year": 2009,
            "Publication url": "https://arxiv.org/abs/0910.0887",
            "Abstract": "Due to unique characteristics of sensor nodes, choosing energy-efficient modulation scheme with low-complexity implementation (refereed to as green modulation) is a critical factor in the physical layer of Wireless Sensor Networks (WSNs). This paper presents (to the best of our knowledge) the first in-depth analysis of energy efficiency of various modulation schemes using realistic models in IEEE 802.15.4 standard and present state-of-the art technology, to find the best scheme in a proactive WSN over Rayleigh and Rician flat-fading channel models with path-loss. For this purpose, we describe the system model according to a pre-determined time-based process in practical sensor nodes. The present analysis also includes the effect of bandwidth and active mode duration on energy efficiency of popular modulation designs in the pass-band and Ultra-WideBand (UWB) categories. Experimental results show that among various pass-band and UWB modulation schemes, Non-Coherent M-ary Frequency Shift Keying (NC-MFSK) with small order of  and On-Off Keying (OOK) have significant energy saving compared to other schemes for short range scenarios, and could be considered as realistic candidates in WSNs. In addition, NC-MFSK and OOK have the advantage of less complexity and cost in implementation than the other schemes.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D-MCN: a 3D multi-scale capsule network for lung nodule malignancy prediction",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41598-020-64824-5",
            "Abstract": "Despite the advances in automatic lung cancer malignancy prediction, achieving high accuracy remains challenging. Existing solutions are mostly based on Convolutional Neural Networks (CNNs), which require a large amount of training data. Most of the developed CNN models are based only on the main nodule region, without considering the surrounding tissues. Obtaining high sensitivity is challenging with lung nodule malignancy prediction. Moreover, the interpretability of the proposed techniques should be a consideration when the end goal is to utilize the model in a clinical setting. Capsule networks (CapsNets) are new and revolutionary machine learning architectures proposed to overcome shortcomings of CNNs. Capitalizing on the success of CapsNet in biomedical domains, we propose a novel model for lung tumor malignancy prediction. The proposed framework, referred to as the 3D Multi-scale …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:hB2aVRuWZNwC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Response Modeling of Hyper-Parameters for Deep Convolutional Neural Networks",
            "Publication year": 2020,
            "Publication url": "https://openreview.net/forum?id=zCu1BZYCueE",
            "Abstract": "Hyper-parameter optimization (HPO) is critical in training high performing Deep Neural Networks (DNN). Current methodologies fail to define an analytical response surface and remain a training bottleneck due to their use of additional internal hyper-parameters and lengthy evaluation cycles. We demonstrate that the low-rank factorization of the convolution weights of intermediate layers of a CNN can define an analytical response surface. We quantify how this surface acts as an auxiliary to optimizing training metrics. We introduce a dynamic tracking algorithm--autoHyper--that performs HPO on the order of hours for various datasets including ImageNet and requires no manual tuning. Our method--using a single RTX2080Ti--is able to select a learning rate within 59 hours for AdaM on ResNet34 applied to ImageNet and improves in testing accuracy by 4.93% over the default learning rate. In contrast to previous methods, we empirically prove that our algorithm and response surface generalize well across model, optimizer, and dataset selection removing the need for extensive domain knowledge to achieve high levels of performance.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:EsrhoZGmrkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Color image processing and applications",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vUM9-HDespYC&oi=fnd&pg=PA1&dq=info:Q7T_jlqX8XsJ:scholar.google.com&ots=IRZf1-0IQT&sig=uO8oWoC1dtLE8_39Ptx6B2fc_dA",
            "Abstract": "Reporting the state of the art of color image processing, this monograph fills an existing gap in the literature on digital signal and image processing. It can serve the needs of different users at different levels: as a textbook which covers a graduate image processing course, as a up-to-date reference for researchers since it offers a broad survey of the relevant literature, and as a relevant information source for development engineers who work in the design and the implementation of various image processing tasks. Part of the material in the book was the basis of seminars at the University of Toronto. The book contains numerous examples and pictures of color image processing results, as well as tables which summarize the results of the analysis. Algorithms implemented in JAVA can be downloaded from the author's website.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Reduced-dimension MAP turbo-BLAST detection",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1576954/",
            "Abstract": "The Bell Labs layered space-time (BLAST) architecture is a simple and efficient multiantenna coding structure that can achieve high spectral efficiency. Many BLAST detectors require more receiver antennas than transmitter antennas. We propose two novel turbo-processing BLAST detectors that can operate in systems with fewer receiver antennas than transmitter antennas. Both detectors are based on the group-detection strategy. The first proposed detector, the reduced-dimension maximum a posteriori (RDMAP) detector uses a dynamically formed group for each bit decision, while the second proposed detector, the group maximum a posteriori (GMAP) uses a static grouping. For both detectors, a maximum a posteriori (MAP) decision is made using a group of transmitted symbols, and the remaining signal contribution is treated as interference. The interference is characterized as nonzero mean colored-noise …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:pS0ncopqnHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Philosophical, Cognitive and Mathematical Foundations of Symbiotic Autonomous Systems (SAS)",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.07617",
            "Abstract": "Symbiotic Autonomous Systems (SAS) are advanced intelligent and cognitive systems exhibiting autonomous collective intelligence enabled by coherent symbiosis of human-machine interactions in hybrid societies. Basic research in the emerging field of SAS has triggered advanced general AI technologies functioning without human intervention or hybrid symbiotic systems synergizing humans and intelligent machines into coherent cognitive systems. This work presents a theoretical framework of SAS underpinned by the latest advances in intelligence, cognition, computer, and system sciences. SAS are characterized by the composition of autonomous and symbiotic systems that adopt bio-brain-social-inspired and heterogeneously synergized structures and autonomous behaviors. This paper explores their cognitive and mathematical foundations. The challenge to seamless human-machine interactions in a hybrid environment is addressed. SAS-based collective intelligence is explored in order to augment human capability by autonomous machine intelligence towards the next generation of general AI, autonomous computers, and trustworthy mission-critical intelligent systems. Emerging paradigms and engineering applications of SAS are elaborated via an autonomous knowledge learning system that symbiotically works between humans and cognitive robots.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:6pF0wJmtdfAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed-graph-based statistical approach for intrusion detection in cyber-physical systems",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8027126/",
            "Abstract": "Cyber-physical systems have recently emerged in several practical engineering applications where security and privacy are of paramount importance. This motivated the paper and a recent surge of interest in development of innovative and novel anomaly and intrusion detection technologies. This paper proposes a novel distributed blind intrusion detection framework by modeling sensor measurements as the target graph-signal and utilizing the statistical properties of the graph-signal for intrusion detection. To fully take into account the underlying network structure, the graph similarity matrix is constructed using both the data measured by the sensors and sensors' proximity resulting in a data-adaptive and structure-aware monitoring solution. In the proposed supervised detection framework, the magnitude of the captured data is modeled by Gaussian Markov random field and the corresponding precision matrix is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:rqnDXT1GswoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WLAN Positioning Systems: Positioning through the ages; 2. Location-based services; 3. Positioning techniques; 4. Positioning systems; Part II. Signal Processing Theory: 5. Positioning in wireless local area networks; 6. Memoryless positioning; 7. Model-based positioning; 8. Sensor selection; 9. System design considerations; 10. The road ahead",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=4862862534602006976&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:DkZNVXde3BIC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Map-based image tag recommendation using a visual folksonomy",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865509003663",
            "Abstract": "Descriptive tags are needed to enable efficient and effective search in vast collections of images. Tag recommendation represents a trade-off between automatic image annotation techniques and manual tagging. In this letter, we formulate image tag recommendation as a maximum a posteriori (MAP) problem, making use of a visual folksonomy. A folksonomy can be seen as a collaboratively created set of metadata for informal social classification. Our experimental results show that the use of a visual folksonomy for image tag recommendation has two significant benefits, compared to a conventional approach using a limited concept vocabulary. First, our tag recommendation technique can make use of an unrestricted and rich concept vocabulary. Second, our approach is able to recommend a higher number of correct tags.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:vRqMK49ujn8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A multi-steps segmentation approach for 3D ultrasound images using the combination of 3D-Snake and Level-Set",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622693/",
            "Abstract": "The segmentation task of 3D ultrasound images has been investigated by a lot of researchers, due to the advantage that it provides to non-invasively detect internal organs and medical conditions. The challenging problems toward the segmentation of 3D ultrasound images are the presence of high speckle noise, inconsistent intensity level and gaps within walls. We propose a new idea by combining 3D-Snake and Level-Set approaches to overcome ultrasound difficulties and maintain high accuracy to segment bleeding regions. The proposed approach starts with a denosing step. The 3D-Snake is resistive to boundaries' discontinuities, and therefore is applied to robustly extract the approximation of the volume of interest. Then, the Level-Set approach is utilized to increase the segmentation accuracy in a few iterations. The parameters of the proposed method are analysed and its segmentation accuracy is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:YB4bud6kWLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network coding in internet of things",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7790345/",
            "Abstract": "Wireless Smart Home Sensor Network (WSHSN) is a home-similar environment, where several wireless sensors can observe the home status and transmit the data streams to the Smart Home Information System (SHIS). Communication in Wireless Sensor Network (WSN) in small living environments faces noise and data transmission speed problems. Especially in the case of employing mobile agents, the WSN restructures dynamically, hence the network performance reduces dramatically. On the one hand, the Internet of Things (IoT) concept includes a broad application of wireless devices, while on the other hand, the WSN throughput decreases significantly by application of more wireless devices. Network coding is a promising technique that can help to broaden the utilization of nodes in WSNs, while network throughput improves by the application of more wireless nodes. In this paper, IoT in WSHSN is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:V_vSwabWVtYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved Explainability of Capsule Networks: Relevance Path by Agreement",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:cSdaV2aYdYsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Binomial classification based on dlene features in sparse representation: Application in kidney detection in 3d ultrasound",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7178123/",
            "Abstract": "Sparse representation-based classification (SRC) has been recently attracted a great interest among the signal processing society. SRC applies a discriminative representation using training samples to separate signals into their classes. In existing SRC methods, the dictionary size, which highly affects the performance, is manually set. Moreover, they are linear classifiers, and thus, they are not suitable for classifying nonlinear problems. In this paper, we propose a new classification method by cascading a dictionary learning and the neural network to take the advantages of both methods. We use dictionary learning with efficient number of elements (DLENE) to extract discriminative features. We also use the proposed binomial classifier to detect kidneys in 3D ultrasound images. A set of Caltech-101 images are used to compare the proposed method with the state-of-the-art. The proposed kidney detection is …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:x21FZCSn4ZoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the geodesic paths approach to color image filtering",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168403000586",
            "Abstract": "In this paper a novel method of noise reduction in color images is presented. The class of filters introduced here utilizes fuzzy membership functions defined over vectorial inputs connected via digital geodesic paths. The efficiency of the new filters is compared under a variety of performance criteria with the commonly used filters, such as the vector median and the generalized vector directional filter. It is shown that, compared to existing techniques, the filters introduced here are better able to suppress impulsive, Gaussian as well as mixed-type noise. Furthermore, the computational analysis included in this work shows that some members of the new filter family are computationally less demanding than the vector median filter.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:mB3voiENLucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "NETWORKING TECHNOLOGIES TO COMBAT THE COVID-19 PANDEMIC",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9566519/",
            "Abstract": "DESIGN AND IMPLEMENTATION OF DEVICES, CIRCUITS, AND SYSTEMS series editors: bernArd FonG, hAesik kiM, And VYAsA sAi",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:lSLsV1MU4ZUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Color effect on the face recognition with spatial resolution constraints",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4741183/",
            "Abstract": "In the practical face recognition (FR) applications, low-resolution faces (20 times 20 pixels or less) are commonly encountered and negatively impact on reliable performance. To overcome low-resolution face problem, we show that face color can significantly improve the performance compared to intensity-based features. The contribution of this paper is twofold. First, a new metric called dasiavariation ratio gainpsila (VRG) is proposed to theoretically prove the significance of color effect on low-resolution faces. Second, we conduct extensive performance comparison studies. In particular, 3,192 color facial images corresponding to 341 subjects, collected from three standard CMU PIE, FERET, and XM2VTSDB face databases, were used to perform comparative studies of color effect on various face resolutions. Experimental results verified that face color feature improves the degraded recognition rate due to low …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "11: 00 Session 1-Image Segmentation",
            "Publication year": 2004,
            "Publication url": "https://www.aimiconf.org/iciar04/programdetails.pdf",
            "Abstract": "Conference Program Page 1 Time ID Title Author(s) Type 11:00 Session 1 - Image Segmentation \n108 Automatic image segmentation using a deformable model based on charged particles \nAndrei C. Jalba, Michael HF Wilkinson, Jos BTM Roerdink Oral 419 Hierarchical Regions for \nImage Segmentation Slawo Wesolkowski and Paul Fieguth Oral 352 Efficiently Segmenting \nImages with Dominant Sets M. Pavan and M. Pelillo Oral 375 Color Image Segmentation Using \nEnergy Minimization on a Quadtree Representation Adolfo Martinez-Uso, Filiberto Pla and \nPedro Garcia- Sevilla Oral 285 Segmentation using Saturation Thresholding and its Application \nin Content-Based Retrieval of Images A. Vadivel, M. Mohan, Shamik Sural and AKMajumdar \nOral 11:00 Session 2 - Biomedical Applications 219 An Automated Multichannel Procedure \nfor cDNA Microarray Image Processing R. Lukac, KN Plataniotis, B. Smolka, AN Oral :…",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:w7CBUyPWg-0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bluetooth low energy-based angle of arrival estimation via switch antenna array for indoor localization",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9190573/",
            "Abstract": "With expected widespread implementation of 5G networks and 5G Internet of Things (IoT), indoor localization is expected to become of even further importance. Although Global Positioning System (GPS) ensures efficient outdoor localization, generally speaking, indoor localization systems fail to provide the same level of efficiency. In this regard, there has been recent widespread attention to Angle of Arrival (AoA) with the application on Switch Antenna Array (SAA), as an efficient indoor localization method due to its potential in determining location with low estimation error. The AoA, however, suffers from several issues including being sensitive to multipath effects, noise, fluctuations of received signal, and frequency/phase shifts. To tackle these issues, the paper proposes a set of signal processing and information fusion methods by integration of Nonlinear Least Square (NLS) curve fitting, Kalman Filter (KF), and …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:3x-KLxxGyuUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Orientation-matched multiple modeling for RSSI-based indoor localization via BLE sensors",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9287489/",
            "Abstract": "Internet of Things (IoT) has penetrated different aspects of our modern life where smart sensors enabled with Bluetooth Low Energy (BLE) are deployed increasingly within our surrounding indoor environments. BLE-based localization is, typically, performed based on Received Signal Strength Indicator (RSSI), which suffers from different drawbacks due to its significant fluctuations. In this paper, we focus on a multiplemodel estimation framework for analyzing and addressing effects of orientation of a BLE-enabled device on indoor localization accuracy. The fusion unit of the proposed method would merge orientation estimated by RSSI values and heading estimated by Inertial Measurement Unit (IMU) sensors to gain higher accuracy in orientation classification. In contrary to existing RSSIbased solutions that use a single path-loss model, the proposed framework consists of eight orientation-matched path loss models …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:UarirCmVI0EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biometric authentication using augmented face and random projection",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5339014/",
            "Abstract": "In this paper, we propose a revocable and privacy preserving template of face biometrics based on random projection. The face biometric is augmented and simultaneously projected onto random subspace. The face image vector is augmented by adding the vector whose elements are varying with zero mean. The augmented face vector can provide better accuracy of authentication and privacy preservation. We analyze the similarity, privacy preserving and security properties of the proposed augmented face biometric information in the random projection-domain. To demonstrate the feasibility of the proposed method, detailed theoretical analysis and several experimental results are provided. The results show that our method is able to provide revocability and privacy preservation while offering better authentication accuracy and security.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital image indexing using secret sharing schemes: a unified framework for single-sensor consumer electronics",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1510502/",
            "Abstract": "This paper introduces a color filter array (CFA) image indexing approach for cost-effective consumer electronics with image capturing capability. Using a secret sharing technique, the proposed method indexes captured images directly in the single sensor digital camera, mobile phone and pocket device by embedding metadata information in the CFA domain. The metadata are used to determine ownership, capturing device identification numbers, and to provide time and location information. Additional semantic information could be added in the metadata by the end-user through the mobile phone's or pocket device's keyboard. After the metadata are embedded to the CFA image, the subsequent demosaicking step reconstructs a full color RGB image with excellent visual quality. The metadata information can be extracted from the CFA images. Alternatively, it can be recovered by the demosaicked images in …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy aggregation of palette colors for hybrid querying of fine art image databases",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027843/",
            "Abstract": "As outlined by the ISO committee, the problem of hybrid query generation lies outside the scope of the MPEG-7 standard. This problem of creating intelligent image database queries that both correctly reflect the intentions of the user as well as provide good retrieval results can be approached in various ways. This paper proposes a hybrid query generation scheme which employs fuzzy aggregation for including and excluding palette colors within the context of a fine art database containing various paintings and drawings. The aggregator herein exhibits flexibility in its logical behaviour through parameters that can be set by the designer as well permitting the exclusion of specific colors from queries. This translates to richer controls for a user wishing to locate works from a large art image database that have similar, yet complex color palettes. Experimentation on an image database of 464 paintings and drawings …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Color image segmentation for multimedia applications",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1008163913937",
            "Abstract": "Image segmentation is crucial for multimedia applications. Multimedia databases utilize segmentation for the storage and indexing of images and video. Image segmentation is used for object tracking in the new MPEG-7 video compression standard. It is also used in video conferencing for compression and coding purposes. These are only some of the multimedia applications in image segmentation. It is usually the first task of any image analysis process, and thus, subsequent tasks rely heavily on the quality of segmentation. The proposed method of color image segmentation is very effective in segmenting a multimedia-type image into regions. Pixels are first classified as either chromatic or achromatic depending on their HSI color values. Next, a seed determination algorithm finds seed pixels that are in the center of regions. These seed pixels are used in the region growing step to grow regions by …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:w0F2JDEymm0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Maximum Mutation Reinforcement Learning for Scalable Control",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2007.13690",
            "Abstract": "Advances in Reinforcement Learning (RL) have demonstrated data efficiency and optimal control over large state spaces at the cost of scalable performance. Genetic methods, on the other hand, provide scalability but depict hyperparameter sensitivity towards evolutionary operations. However, a combination of the two methods has recently demonstrated success in scaling RL agents to high-dimensional action spaces. Parallel to recent developments, we present the Evolution-based Soft Actor-Critic (ESAC), a scalable RL algorithm. We abstract exploration from exploitation by combining Evolution Strategies (ES) with Soft Actor-Critic (SAC). Through this lens, we enable dominant skill transfer between offsprings by making use of soft winner selections and genetic crossovers in hindsight and simultaneously improve hyperparameter sensitivity in evolutions using the novel Automatic Mutation Tuning (AMT). AMT gradually replaces the entropy framework of SAC allowing the population to succeed at the task while acting as randomly as possible, without making use of backpropagation updates. In a study of challenging locomotion tasks consisting of high-dimensional action spaces and sparse rewards, ESAC demonstrates improved performance and sample efficiency in comparison to the Maximum Entropy framework. Additionally, ESAC presents efficacious use of hardware resources and algorithm overhead. A complete implementation of ESAC can be found at karush17.github.io/esac-web/.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:uWy0R8PweswC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gait recognition through MPCA plus LDA",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4341613/",
            "Abstract": "This paper solves the gait recognition problem in a multilinear principal component analysis (MPCA) framework. Gait sequences are naturally described as tensor objects and feature extraction for tensor objects is important in computer vision and pattern recognition applications. Classical principal component analysis (PCA) operates on vectors and it is not directly applicable to gait sequences. This work introduces an MPCA framework for feature extraction from gait sequences by seeking a multilinear projection onto a tensor subspace of lower dimensionality which captures most of the variance of the original gait samples. A subset of the extracted eigen-tensors are selected and the classical LDA is then applied. In experiments, gait recognition results are reported on the Gait Challenge data sets using the proposed solution. The results indicate that with a simple design, the proposed algorithm outperforms the state …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:C33y2ycGS3YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Face detection and recognition",
            "Publication year": 2017,
            "Publication url": "https://patents.google.com/patent/US9721148B2/en",
            "Abstract": "The present invention provides, in at least one aspect, methods and systems that detect at least one face in at least one digital image, determine and store area co-ordinates of a location of the at least one detected face in the at least one digital image, apply at least one transformation to the at least one detected face to create at least one portrait of the at least one detected face, rotate the at least one portrait at least until the at least one portrait is shown in a vertical orientation and a pair of eyes of the at least one face shown in the at least one portrait are positioned on a horizontal plane; and store the rotated at least one portrait.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:sJK75vZXtG0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved Explainability of Capsule Networks: Relevance Path by Agreement",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:wBLCggQE-ToC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Face detection in mobile phones using co-occurrence of adjacent local binary patterns",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6638087/",
            "Abstract": "This paper investigates a novel combination of Co-occurrence of adjacent Local Binary Patterns histogram and Local Binary Patterns feature extraction methods for face detection in mobile phone applications. In particular, Co-occurrence of adjacent Local Binary Patterns histogram feature extraction provides exceptionally high discriminative power in face/non-face classification and hence is used to ensure the high accuracy of the proposed face detector. Local Binary Patterns feature extraction has low computation complexity and is thus used to reduce the overall processing speed. In the conducted face detection experiments, the proposed face detector yields comparable or better performance as well as faster computation speed than the existing best methods.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:4aZ_i-5WJEQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental investigation of facial expressions associated with visual discomfort: feasibility study toward an objective measurement of visual discomfort based on facial expression",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7588144/",
            "Abstract": "This paper aims to investigate facial expressions associated with visual discomfort induced by excessive screen disparities of stereoscopic three-dimensional (S3D) contents. For this purpose, we constructed a novel facial expression database regarding the visual discomfort. While viewing the realistic stereoscopic stimuli with screen disparities varying from 0° to 4.66°, each viewer's face was captured. The database consisted of face videos and associated comfort scores obtained by self-reporting, which might be only a publicly available database regarding the facial expressions associated with visual discomfort. Using the database, for the quantitative investigation, the facial expressions associated with visual discomfort were compared with basic emotional expressions that were well defined and universal. As a result, we observed that the emotional expression of “stressed” (i.e., anger or disgust) was highly …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:hHIA4WEVY-EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey of multilinear subspace learning for tensor data",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320311000136",
            "Abstract": "Increasingly large amount of multidimensional data are being generated on a daily basis in many applications. This leads to a strong demand for learning algorithms to extract useful information from these massive data. This paper surveys the field of multilinear subspace learning (MSL) for dimensionality reduction of multidimensional data directly from their tensorial representations. It discusses the central issues of MSL, including establishing the foundations of the field via multilinear projections, formulating a unifying MSL framework for systematic treatment of the problem, examining the algorithmic aspects of typical MSL solutions, and categorizing both unsupervised and supervised MSL algorithms into taxonomies. Lastly, the paper summarizes a wide range of MSL applications and concludes with perspectives on future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Adaptive processing in high frequency surface wave radar",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4720881/",
            "Abstract": "This paper investigates the use of space-time adaptive processing (STAP) for high frequency surface wave radar (HFSWR) systems. STAP has hitherto been investigated in great detail for airborne radar systems; the majority of the adaptive algorithms that have been developed have been designed with a bias towards such applications. HFSWR systems are characterized by the severely limited number of data samples available to train the adaptive filter. In this paper we report on investigations in applying low-complexity STAP algorithms to HFSWR systems. In particular we focus on applying such algorithms on HFSWR data cube measurements heavily corrupted by ionospheric clutter. We then reflect on the implications of the results.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:4Yq6kJLCcecC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic model-based filtering for mobile terminal location estimation",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1224557/",
            "Abstract": "Mobile terminal location is an important area of research because of its applications in location-sensitive browsing and resource allocation. The paper presents a method for reducing the error in mobile terminal location estimation. A preprocessor using nonparametric estimation is used to reduce the effects of non-line-of-sight and multipath propagation on the location procedure. A model-based dynamic filter is presented that uses an accurate model of mobile terminal motion to combine information from location measurements made at different time instances to create an improved location estimate. The model of mobile terminal motion has a kinematic state space model describing the physical rules governing terminal motion and a control model that describes the human control input into the motion process. Location dependency in the control input model is used to derive a new dynamic filter. This filter provides …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In Memoriam: Anastasios (Tas) N. Venetsanopoulos",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11760-015-0839-4",
            "Abstract": "On November 17, 2014, the signal processing world lost Anastasios N. Venetsanopoulos. Tas, as he was known to his friends and colleagues, had a long and prolific career that spanned over 40years, wherein he established himself as an internationally renowned and respected researcher, a prolific author and an exceptionally gifted educator. Tas was widely regarded as a world authority and a pioneer of the signal processing field. Specifically, his research in multimedia systems, digital signal and image processing, digital communications, biometrics and neural networks is internationally acclaimed, both in academia and industry, and resulted in nine books (including [1–4]), 35 book chapters and 900 technical papers with over 14,000 citations. He was a mentor to over 160 graduate students and researchers and an educator to thousands of undergraduate students while serving, with distinction, in a number of …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:tz746QTLzJkC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Content sharing based on personal information in virtually secured space",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04438-0_33",
            "Abstract": "User generated contents (UGC) are shared in an open space like social media where users can upload and consume contents freely. Since the access of contents is not restricted, the contents could be delivered to unwanted users or misused sometimes. In this paper, we propose a method for sharing UGCs securely based on the personal information of users. With the proposed method, virtual secure space is created for contents delivery. The virtual secure space allows UGC creator to deliver contents to users who have similar personal information and they can consume the contents without any leakage of personal information. In order to verify the usefulness of the proposed method, the experiment was performed where the content was encrypted with personal information of creator, and users with similar personal information have decrypted and consumed the contents. The results showed that UGCs …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:CB2v5VPnA5kC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Isometric data sequences during joint channel estimation and symbol detection in fading channels",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=255044666794394221&hl=en&oi=scholarr",
            "Abstract": "Due to the multiplicative nature of fading and rota-tional invariance of PSK constellation, detection schemes cannot differentiate phase-rotated versions of the transmitted symbol sequence. These sequences, called isometric sequences, result in detection errors and irreducible bit error rates. To combat isometry, one can employ extra knowledge of the channel, which is not readily available, or pilot symbols, which reduces the effective transmission rate. This paper analyses the problem of isometry, discusses the design of asymmetric signal constellations, and illustrates analytically and experimentally how the use of asymmetric signal constellations for initial symbols improve the system performance without incurring significant complexity.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:Hck25ST_3aIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust estimation of mobile terminal position",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/document/862187/",
            "Abstract": "Estimation of mobile terminal location is made difficult by nonsymmetric contamination of measured data caused by non line of sight (NLOS) propagation effects. Robust estimation functions are proposed to reduce the effects of NLOS propagation on the location error. Simulation results showing the improvement in location accuracy over current methods are presented.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:kw52XkFRtyQC",
            "Publisher": "IET"
        },
        {
            "Title": "A robust, cost-effective post-processor for enhancing demosaicked camera images",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077201405000148",
            "Abstract": "This paper presents an efficient post-processing/enhancement solution capable of reducing visual artifacts introduced during the image demosaicking process. Edge-sensing weights and the original color filter array data are used to detect structural elements in the captured image, and correct color components generated by the demosaicking process using adaptive, spectral model-based enhancement operations. The solution produces excellent results in terms of both objective and subjective image quality measures.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Nonparametric approach to color based image retrieval",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080128/",
            "Abstract": "The rapid growth of image archives increases the need for efficient and fast tools that can retrieve and search through large amount of visual data. In this paper we propose an efficient method of extracting the image color content, which can serve as an image digital signature, allowing the efficient indexing and retrieval of large Internet-based multimedia databases. We applied the proposed method using the images from two Internet databases containing a collection of images of fine arts and a database of low resolution images, and show that the new method of image color representation is robust to image distorsions caused by resizing and compression and can be incorporated into existing web-based retrieval systems, that exploit the information on color content of digital images.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "MDR-SURV: A Multi-Scale Deep Learning-Based Radiomics for Survival Prediction in Pulmonary Malignancies",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9053243/",
            "Abstract": "Predicting death in lung cancer patients before initiating treatment is of paramount importance as this may guide decision-making towards more aggressive or combination of different types of treatment. In this work, we propose a Multi-scale Deep learning-based Radiomics model, referred to as \"MDR-SURV\" that exploits the information from positron emission tomography/computed tomography (PET/CT) images, combined with other clinical factors, to predict the overall survival (OS). Deep learning-based radiomics has the advantage of learning what features to extract, on its own. Furthermore, it does not require the exact segmentation of the tumor. The proposed MDR-SURV, which is a multi-scale framework, incorporates the tumor region and its surroundings, from different scales, and can extract both local and global tumor features. PET/CT images of 132 lung cancer patients who underwent stereotactic body …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:uEM9VtRl8xsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Tripartite Theory of Trustworthiness for Autonomous Systems",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9283219/",
            "Abstract": "It is recognized that system trustworthiness is a hyperstructure embodied by the structural, behavioral, and system dimensions with a set of coherent attributes. We explore a theoretical framework of tripartite trustworthiness that can be applied to real-world autonomous systems. We present a formal study of the essences and mathematical models of system trustworthiness and their quantitative measurements in the contexts of autonomous and mission-critical intelligent systems where humans and machines interact in a hybrid environment.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:qCaWouos7ogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sub-Decimeter VLC 3D Indoor Localization With Handover Probability Analysis",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9523865/",
            "Abstract": "This paper addresses the problem of Visible Light Communication (VLC)-based indoor localization and handover, where mobile users communicate with hybrid VLC/mmWave Access Points (APs). The VLC system consists of multiple Light-Emitting Diodes (LEDs) treated as VLC transmitters, multiple Photodiodes (PDs) on the user’s smart device, and multiple mmWave Radio Frequency (RF) transmitters used as complementary APs for the VLC system in the case of blockage. We propose a Convolutional Neural Network (CNN)-based algorithm consisting of offline and online modes. In the offline mode, we gather a data set by dividing the environment into fixed-sized elements where the received VLC signal along with the data attained from the smart device at each element represent a sample to train a CNN model for indoor localization. In the online mode, users employ the received VLC signals to estimate their …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:sYWwZaPVD1oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bluetooth low energy-based angle of arrival estimation in presence of Rayleigh fading",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9283088/",
            "Abstract": "Angle of Arrival (AoA) approach with applications to Bluetooth Low Energy (BLE) has been recognized as an effective indoor localization method because of its ability for position determination with low estimation error. However, there are several issues including Carrier Frequency Offset (CFO), multipath effect, Inter-Symbol Interference (ISI), noise, and phase shifting faced by the AoA. To tackle these issues, we first highlight the wireless signal model in BLE standard and formulate the transmitted signal, wireless channel model, and the signal received by Linear Antenna Array (LAA). In addition, the paper introduces a novel fusion processing technique to eliminate the destructive impact of the wireless channel on the received signal, which leads to accurate angle detection following precise position estimation. The effectiveness of the proposed fusion processing method is evaluated through an experimental testbed …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:ovGv7akYl-cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A unified framework for similarity calculation between images",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1329195/",
            "Abstract": "Emergence of large digital visual data repositories motivates the need for effective indexing and retrieval tools. In traditional approaches, similarity among two images is a weighted distance between two feature vectors. These techniques, however, do not provide enough flexibility in modelling user queries. This paper proposes a framework where image similarities are obtained through a decision making process using fuzzy theory. The analysis and results of this paper indicate that the aggregation technique presented here provides an effective, general, and flexible tool for similarity calculation based on the combination of individual descriptors and features.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:DJbcl8HfkQkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Message from the ICBC2020 General and Technical Program Chairs",
            "Publication year": 2020,
            "Publication url": "https://experts.illinois.edu/en/publications/message-from-the-icbc2020-general-and-technical-program-chairs",
            "Abstract": "Message from the ICBC2020 General and Technical Program Chairs — University of Illinois \nUrbana-Champaign Skip to main navigation Skip to search Skip to main content University of \nIllinois Urbana-Champaign Logo Help & FAQ Home Profiles Research Units Research & \nScholarship Datasets Activities Press / Media Honors Search by expertise, name or affiliation \nMessage from the ICBC2020 General and Technical Program Chairs Kostas Plataniotis, Andreas \nVeneris, Salil Kanhere, Grigore Rosu, Knottenbelt William Computer Science Information \nTrust Institute Research output: Contribution to journal › Editorial › peer-review Overview \nOriginal language English (US) Article number 9169409 Pages (from-to) 5-6 Number of pages \n2 Journal IEEE International Conference on Blockchain and Cryptocurrency, ICBC 2020 DOIs \nhttps://doi.org/10.1109/ICBC48266.State Published - May 2020 Event 2nd IEEE Conference …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:I2jIoRS3jIgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated diagnostics in 3d ultrasound system and method",
            "Publication year": 2021,
            "Publication url": "https://patents.google.com/patent/US20210251610A1/en",
            "Abstract": "A 3D image is provided for processing. A current resolution is set to a first coarse resolution and the current data is set to a known current data. A process is then iterated and within each iteration of the process the following is performed: pre-processing the ultrasound image in accordance with the current resolution; providing the pre-processed ultrasound image and the current data to a trained system for extracting therefrom objects of interest at the current resolution, the objects of interest extracted with a likelihood above a known threshold; determining data relating to each extracted object of interest to result in first current data; when the current resolution is a finest resolution, stopping the iterative process; and when the current resolution is other than a finest resolution, setting the current resolution to a finer resolution and returning to the start of the iterative process.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:tSVUDDkujAIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new CFA interpolation technique for single-sensor digital cameras",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1329223/",
            "Abstract": "A new color filter array (CFA) interpolation technique for single-sensor digital cameras is introduced. The proposed method utilizes an edge-sensing interpolation mechanism in conjunction with color-difference model based correction steps performed for each color channel. Thus, the proposed computationally efficient interpolation scheme is able to overcome the limitations of existing CFA based image acquisition solutions and restore color images without introducing false colors, edge blurring or visual artifacts. This produces excellent results in terms of subjective and objective image quality measures, while outperforming widely used CFA interpolation methods.",
            "Abstract entirety": 1,
            "Author pub id": "W-4N_2gAAAAJ:LO7wyVUgiFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Public Key Reinforced Blockchain Platform for Fog-IoT Network System Administration",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9515391/",
            "Abstract": "The number of embedded devices that connect to a wireless network has been growing for the past decade. This interaction creates a network of Internet of Things (IoT) devices where data travel continuously. With the increase of devices and the need for the network to extend via fog computing, we have fog-based IoT networks. However, with more endpoints introduced to it, the network becomes open to malicious attackers. This work attempts to protect fog-based IoT networks by creating a platform that secures the endpoints through public-key encryption. The servers are allowed to mask the data packets shared within the network. To be able to track all of the encryption processes, we incorporated the use of permissioned blockchains. This technology completes the security layer by providing an immutable and automated data structure to function as a hyper ledger for the network. Each data transaction …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:_n8fIOMweQoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "From handcrafted to deep-learning-based cancer radiomics: challenges and opportunities",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8746872/",
            "Abstract": "Recent advancements in signal processing (SP) and machine learning, coupled with electronic medical record keeping in hospitals and the availability of extensive sets of medical images through internal/external communication systems, have resulted in a recent surge of interest in radiomics. Radiomics, an emerging and relatively new research field, refers to extracting semiquantitative and/or quantitative features from medical images with the goal of developing predictive and/or prognostic models. In the near future, it is expected to be a critical component for integrating image-derived information used for personalized treatment. The conventional radiomics workflow is typically based on extracting predesigned features (also referred to as handcrafted or engineered features) from a segmented region of interest (ROI). Nevertheless, recent advancements in deep learning have inspired trends toward deep-learning …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:_mQi-xiA4oYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DRTOP : deep learning-based radiomics for the time-to-event outcome prediction in lung cancer",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41598-020-69106-8",
            "Abstract": "Hand-crafted radiomics has been used for developing models in order to predict time-to-event clinical outcomes in patients with lung cancer. Hand-crafted features, however, are pre-defined and extracted without taking the desired target into account. Furthermore, accurate segmentation of the tumor is required for development of a reliable predictive model, which may be objective and a time-consuming task. To address these drawbacks, we propose a deep learning-based radiomics model for the time-to-event outcome prediction, referred to as DRTOP that takes raw images as inputs, and calculates the image-based risk of death or recurrence, for each patient. Our experiments on an in-house dataset of 132 lung cancer patients show that the obtained image-based risks are significant predictors of the time-to-event outcomes. Computed Tomography (CT)-based features are predictors of the overall survival (OS), with the hazard ratio (HR …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:lRPiJ3GhvscC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Technical Program Chairs' overview",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347480/",
            "Abstract": "On behalf of the Technical Program Committee (TPC), we would like to welcome the delegates and their guests to the 17th annual Canadian Conference on Electrical and Computer Engineering (CCECE). CCECE provides a forum for the presentation of technical papers that encompass a range of engineering and computer disciplines. CCECE 2004 drew a record number of 1073 submissions from more than 35 countries around the world, The submissions were sent to the members of the TPC and to 94 additional reviewers for review. Every submission received at least two independent reviews. The Chairs would like to thank the TPC members and the reviewers for their hard work and dedication. Time and space limitations did not allow us to include many fine technical submissions to the program. The CCECE 2004 Technical Program includes 570 papers which is an acceptance rate of 53%. Accepted papers …",
            "Abstract entirety": 0,
            "Author pub id": "W-4N_2gAAAAJ:UmS_249rOGwC",
            "Publisher": "IEEE"
        }
    ]
}]