[{
    "name": " Δημήτριος Νικολός",
    "romanize name": " Dimitrios Nikolos",
    "School-Department": "Μηχ. Η/Υ & Πληροφορικής",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 18928,
    "Scholar name": "Dimitris Nikolos",
    "Scholar id": "kndWOCIAAAAJ",
    "Affiliation": "Professor, Computer Engineering & Informatics Dept, University of Patras",
    "Citedby": 2884,
    "Interests": [
        "Fault Tolerant Circuits/Systems",
        "VLSI Design/Testing/Design for Testability",
        "Computer Architecture",
        "Computer Arithmetic"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=kndWOCIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Virtual-scan: a novel approach for software-based self-testing of microprocessors",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1206240/",
            "Abstract": "A systematic methodology for generating software-based self-tests for microprocessor cores is introduced in this paper. The produced software tests emulate the functionality of a scan path design, and can be applied during the normal-operation mode of the microprocessor, thus enabling at-speed testing. A major advantage of the proposed approach lies in the fact that the generation of the software tests does not require any knowledge about the low-level implementation of the microprocessor and is only based on its RT-level description and its instruction set architecture.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Test data compression based on reuse and bit-flipping of parts of dictionary entries",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6868773/",
            "Abstract": "Several dictionary-based input test data compression methods have been proposed for intellectual property (IP) cores testing. To increase the utilization of the dictionary entries some methods are based on the correction of some bits before the loading of the entries into the scan chains. The coordinates of the bits that should be corrected are sent by the automatic test equipment (ATE), hence, the number of corrections should be relatively small. In this paper we propose a new method which is based on the use of an auxiliary dictionary of minor size for storing masks. To this end, we give an algorithm for the suitable selection of the masks so that any one of them is used for on the fly bit-flipping of parts of many dictionary entries, before they are loaded into the scan chains. The efficiency of the proposed method is supported with extensive experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High speed parallel-prefix modulo 2/sup n/+ 1 adders for diminished-one operands",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/930121/",
            "Abstract": "We present a new methodology for designing modulo 2/sup n/+1 adders with operands in the diminished-one number system. The proposed methodology leads to parallel-prefix adder implementations. Both an analytical model and VLSI implementations in a standard-cell technology are utilized for comparing the adders designed following the proposed methodology against the existing solutions. Our results indicate; that the proposed parallel-prefix adders are considerably faster than any other already known in the open literature and as fast as the corresponding modulo 2/sup n/ and modulo 2/sup n/-1 adders.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast bit permutation unit for media enhanced microprocessors",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1692519/",
            "Abstract": "Bit and subword permutations are useful in many multimedia and cryptographic applications. New shift and permute instructions have been added to the instruction set of general-purpose microprocessors to efficiently implement the required data permutations. In this paper, the design of a high speed bit permutation unit is examined. The proposed architecture has been derived by mapping the functionality of one of the most powerful bit permutation instructions (GRP) to a new enhanced bitonic sorting network. The proposed design achieves delay reductions more than 20% when compared with previously presented solutions, while its regularity enables efficient VLSI implementations",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-speed parallel-prefix module 2/sup n/-1 adders",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/863036/",
            "Abstract": "A novel parallel-prefix architecture for high speed module 2/sup n/-1 adders is presented. The proposed architecture is based on the idea of recirculating the generate and propagate signals, instead of the traditional end-around carry approach. Static CMOS implementations verify that the proposed architecture compares favorably with the already known parallel-prefix or carry look-ahead structures.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Run Time Management of Faulty Data Caches",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9465447/",
            "Abstract": "As the technology continuous to shrink, power consumption appears to be the main design parameter. Operation on low voltage negatively affects mainly the operation of on-chip memories, resulting in multiple malfunctioning memory cells. As a reaction many cache fault tolerance (CFT) mechanisms have been proposed targeting the mitigation of performance degradation. The challenge is to devise mechanisms that are tailored to the memory access patterns of the executing applications.In this work we initially investigate the impact of the granularity of cache line disabling scheme in the first level data caches. Based on our analysis, we propose a run time adaptive mechanism that is able to opt the cache (sub-)block taking into account the diverse memory characteristics of the application. The proposed mechanism is based on the widely used block (sub-block) disabling scheme, and dynamically selects the …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deterministic BIST for RNS adders",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214338/",
            "Abstract": "Modulo 2/sup n/ -1 adders as fast as n-bit 2's complement adders have been recently proposed in the open literature. This makes a residue number system (RNS) adder with channels based on the moduli 2/sup n/, 2/sup n/ - 1, and any other of the form 2/sup k/ - 1, with k < n, faster than RNS adders based on other moduli. We formally derive a parametric, with respect to the adder size, test set, for parallel testing of the channels of an RNS adder based on moduli of the form 2/sup n/, 2/sup n/ - 1, 2/sup k/ - 1, 2/sup l/ - 1, ..., with l < k < n. The derived test set is reusable; it can be used for any value of n, k, l, ..., regardless of the implementation library used and is composed of n/sup 2/ + 2 test vectors. A test-per-clock BIST scheme is also proposed that applies the derived test vectors within n/sup 2/ + 2n cycles. Static CMOS implementations reveal that the proposed BIST offers 100 percent postcompaction fault coverage and …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A family of parallel-prefix modulo 2/sup n/-1 adders",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1212856/",
            "Abstract": "We reveal the cyclic nature of idempotency in the case of modulo 2/sup n/-1 addition. Then based on this property, we derive for each n, a family of minimum logic depth modulo 2/sup n/-1 adders, which allows several trade-offs between the number of operators, the internal wire length, and the fanout of internal nodes. Performance data, gathered using static CMOS implementations, reveal that the proposed architectures outperform all previously reported ones in terms of area and/or operation speed.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sorter based permutation units for media-enhanced microprocessors",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4231881/",
            "Abstract": "Single or multibit subword permutations are useful in many multimedia and cryptographic applications. Several specialized instructions have been proposed to handle the required data rearrangements. In this paper, we examine the hardware implementation of the powerful permutation instruction group (GRP). The design of the proposed permutation unit is based on the functionality of sorting networks. Two variants of the sorter-based GRP unit are introduced and analyzed and their energy-delay behavior is investigated using static CMOS implementations in a 130-nm CMOS technology.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modified Booth modulo 2/sup n/-1 multipliers",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1261842/",
            "Abstract": "2/sup n/-1 is one of the most commonly used moduli in residue number systems. In this paper, we propose a new method for designing modified Booth modulo 2/sup n/-1 multipliers, which, for even values of n, require one less partial product than the already known. CMOS implementations reveal that the proposed multipliers compared to earlier solutions offer savings up to 28.7 percent and up to 29.3 percent in the implementation area and execution delay, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Accumulator based test-per-scan BIST",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1319687/",
            "Abstract": "Arithmetic function modules, which are available in many circuits, can be utilized to generate test patterns and compact test responses. Recently, an accumulator behaving in test mode as a non-linear feedback shift register (NLFSR) has been proposed for bit-serial test pattern generation. However, this structure has the disadvantage that the maximum period of the generated bit sequence depends on the suitable selection of a constant additive value (CAV), which is based on an exhaustive trial and error procedure. In this paper, we propose a slightly modified structure and a heuristic for speeding up significantly the searching of a suitable CAV. We also show, experimentally, that the proposed structure, in most cases, compares favorably to LFSRs and the other arithmetic function based bit-serial sequence generators.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ling adders in CMOS standard cell technologies",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046203/",
            "Abstract": "Two level carry look-ahead (CLA) and novel parallel-prefix Ling adder architectures are introduced in this paper. The adders resulting from these architectures, as well as from the well known single level CLA Ling adder architecture, are compared against traditional adders using CMOS realizations. The results reveal that Ling architectures are more attractive in several cases.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low capture power dictionary-based test data compression",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7479216/",
            "Abstract": "In this paper we first present a new test vector multi-bit correction technique for capture power reduction (average and peak) in scan based launch-on-capture transition delay testing of IP cores. Then we present a method which combines the test vector multi-bit correction technique and the dictionary based test data compression method of [11] in order to derive compressed test data with low capture power. Main characteristic of this technique is that the reduction of the capture power is obtained without (or with marginal) degradation of the compression efficiency. The efficiency of the proposed method is verified with simulations.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient test vector ordering method for low power testing",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1339559/",
            "Abstract": "This paper presents a novel test vector ordering method for average power consumption minimization. The proposed method orders the test vectors taking into account the expected switching activity at the primary inputs and at a very small set of internal lines of the circuit under test. The computational time required by the proposed method is very small while the power reduction achieved is very close to the best, with respect to power reduction, most time-consuming method. Experimental results show that apart from average power reduction, the proposed method achieves significant peak power reduction too.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A compact built-in current sensor for I/sub DDQ/testing",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/856619/",
            "Abstract": "In this paper a simple to implement, compact, build-in current sensor for I/sub DDQ/ testing of CMOS VLSI circuits based on current mirroring techniques is proposed. This sensor can attain small detection times and can be used for both on-line and off-line I/sub DDQ/ testing.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power aware test-data compression for scan-based testing",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633432/",
            "Abstract": "In this paper a new approach that targets the reduction of both the test-data volume and the scan-power dissipation during testing of a digital system's cores is proposed. For achieving the two aforementioned goals, a novel algorithm that inserts some inverters in the scan chain(s) of the core under test (CUT) is presented. However, no performance or area penalty is imposed on the CUT since, instead of additional inverters, the negated outputs of the scan flip-flops can be utilized. The proposed algorithm targets the maximization of run-lengths of zeros (or ones) in the test set accompanying the CUT. This algorithm combined with the Minimum Transition Count mapping of don't cares in a test set as well as with the alternating run-length code that have been recently proposed, achieves better test-data compression and reduced scan-power results than the relative works in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient diminished-1 modulo 2/sup n/+ 1 multipliers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1401868/",
            "Abstract": "In this work, we propose a new algorithm for designing diminished-1 modulo 2/sup n/+1multipliers. The implementation of the proposed algorithm requires n + 3 partial products that are reduced by a tree architecture into two summands, which are finally added by a diminished-1 modulo 2/sup n/+1 adder. The proposed multipliers, compared to existing implementations, offer enhanced operation speed and their regular structure allows efficient VLSI implementations.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diminished-one modulo 2/sup n/+ 1 adder design",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1146705/",
            "Abstract": "This paper presents two new design methodologies for modulo 2/sup n/+1 addition in the diminished-one number system. The first design methodology leads to carry look-ahead, whereas the second to parallel-prefix adder implementations. VLSI realizations of the proposed circuits in a standard-cell technology are utilized for quantitative comparisons against the existing solutions. Our results indicate that the proposed carry look-ahead adders are area and time efficient for small values of n, while for the rest values of n the proposed parallel-prefix adders are considerably faster than any other already known in the open literature.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bit-serial test pattern generation by an accumulator behaving as a non-linear feedback shift register",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030199/",
            "Abstract": "Arithmetic function modules which are available in many circuits can be utilized to generate test patterns and compact test responses. Recently, it was shown that an adder or an accumulator cannot be used as a bit serial test pattern generator due to the poor random properties of the generated sequences. Thus, accumulator-multiplier or adder-multiplier structures have been proposed In this paper we show that an accumulator behaving, in test mode, as a non-linear feedback shift register (NLFSR) can be used efficiently for bit serial test pattern generation. A hardware as well as a software implementation of the proposed scheme is given The efficiency of the proposed scheme is verified by comparing it against LFSR and other arithmetic function based bit serial test pattern generators.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EUDOXUS: a WWW-based generator of reusable arithmetic cores",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/933858/",
            "Abstract": "Presents a WWW-based tool for the generation of arithmetic soft cores for a wide variety of functions, operand sizes and architectures. The tool produces structural and synthesizable VHDL and/or Verilog descriptions and covers several arithmetic operations, such as addition, subtraction, multiplication, division, squaring, square rooting and shifting. Therefore, designs requiring arithmetic cores, as for example those in digital signal processing and multimedia applications, can be completed faster and with less effort.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient partial scan cell gating for low-power scan-based testing",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1497561.1497571",
            "Abstract": "Gating of the outputs of a portion of the scan cells (partial gating) has been recently proposed as a method for reducing the dynamic power dissipation during scan-based testing. We present a new systematic method for selecting, under area and performance design constraints, the most suitable for gating subset of scan cells as well as the proper gating value for each one of them, aiming at the reduction of the average switching activity during testing. We show that the proposed method outperforms the corresponding already known methods, with respect to average dynamic power dissipation reduction.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:4TOpqqG69KYC",
            "Publisher": "ACM"
        },
        {
            "Title": "Test data compression based on variable-to-variable Huffman encoding with codeword reusability",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4544866/",
            "Abstract": "A new statistical test data compression method that is suitable for IP cores of an unknown structure with multiple scan chains is proposed in this paper. Huffman, which is a well-known fixed-to-variable code, is used in this paper as a variable-to-variable code. The precomputed test set of a core is partitioned into variable-length blocks, which are, then, compressed by an efficient Huffman-based encoding procedure with a limited number of codewords. To increase the compression ratio, the same codeword can be reused for encoding compatible blocks of different sizes. Further compression improvements can be achieved by using two very simple test set transformations. A simple and low-overhead decompression architecture is also proposed.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconfigurable: Self Adaptive Fault Tolerant Cache Memory for DVS enabled Systems",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2742060.2742091",
            "Abstract": "Processor caches play a critical role in the performance of today\" s computer systems. As technology scales, due to manufacturing defects and process variations a large number of cells in a cache is expected to be faulty. The number of faulty cells varies from die to die and in the field of the application depends on the operating conditions (eg, supply voltage, frequency). Several techniques have been proposed to tolerate faults in caches. A drawback of the redundancy based techniques is that the amount of redundancy is decided at the design time targeting a maximum number of faults, so in cases of a small number of faults (eg, in the nominal supply voltage in a system with DVS) only a part of the redundant resources is used. In this paper we propose a new reconfigurable-self adaptive fault tolerant cache scheme. The unique characteristic of our scheme is that it uses its resources for both the reduction of the …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient test-data compression for IP cores using multilevel Huffman coding",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1657043/",
            "Abstract": "In this paper we introduce a new test-data compression method for IP cores with unknown structure. The proposed method encodes the test data provided by the core vendor using a new, very effective compression scheme based on multilevel Huffman coding. Specifically, three different kinds of information are compressed using the same Huffman code, and thus significant test data reductions are achieved. A simple architecture is proposed for decoding on-chip the compressed data. Its hardware overhead is very low and comparable to that of the most efficient methods in the literature. Additionally, the proposed technique offers increased probability of detection of unmodeled faults since the majority of the unknown values of the test set are replaced by pseudorandom data generated by an LFSR.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Energy-Delay Efficient Subword Permutation Unit",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4019523/",
            "Abstract": "Subword permutations are useful in many multimedia and cryptographic applications. Specialized instructions have been added to the instruction set of general-purpose processors to efficiently implement the required data rearrangements. In this paper, the design of a new energy-delay efficient subword permutation unit is examined. The proposed architecture has been derived by mapping the functionality of one of the most powerful permutation instructions (GRP) to a new enhanced linear sorting network. The introduced subword permutation unit is fast and achieves significant area and energy reductions compared to previous implementations. Also its regularity and its reduced wiring enables efficient VLSI implementations. The efficiency of the proposed architecture has been validated using static CMOS implementations in a standard performance 130nm CMOS technology",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel fault tolerant cache architecture based on orthogonal latin squares theory",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8342236/",
            "Abstract": "Aggressive dynamic voltage and frequency scaling is widely used to reduce the power consumption of microprocessors. Unfortunately, voltage scaling increases the impact of process variations on memory cells resulting in an exponential increase in the number of malfunctioning memory cells. As a result, various cache fault-tolerant (CFT) techniques have been proposed. In this work, we propose a new CFT technique which applies a systematic redistribution (permutation) of the cache blocks (assuming various block granularity levels) within the cache structure using the orthogonal Latin Square concept and taking as input the location of the malfunctioning cells in the cache array. The aim of the redistribution is twofold. First, to uniformly distribute the faulty blocks to sets and second, to gather the faulty subblocks to a minimum number of blocks, so as the fault free blocks are maximized. Our evaluation results using …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Input test data compression based on the reuse of parts of dictionary entries: Static and dynamic approaches",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6634582/",
            "Abstract": "In this paper, we present a new test data compression method for intellectual property (IP) cores testing, based on the reuse of parts of dictionary entries. Two approaches are investigated: the static and the dynamic. In the static approach, the content of the dictionary is constant during the testing of a core, while in the dynamic approach the testing of a core consists of several test sessions and the content of the dictionary is different during each test session. The efficiency of the proposed method is supported with extensive simulation results and comparisons to already known test data compression methods suitable for IP cores testing.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Test response compaction by an accumulator behaving as a multiple input non-linear feedback shift register",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/894277/",
            "Abstract": "In this paper we show that an accumulator can be modified to behave as a Non-Linear Feedback Shift Register suitable for test response compaction. The hardware required for this modification is less than that required to modify a register to a Multiple Input Linear Feedback Shift Register, MISR. We show with experiments on ISCAS'85, ISCAS'89 benchmark circuits and various types of multipliers that the post-compaction fault coverage obtained by the proposed scheme is higher than that of the already known accumulator based compaction schemes and in most cases identical to that achieved using a MISR.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A highly regular multi-phase reseeding technique for scan-based BIST",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/764808.764885",
            "Abstract": "In this paper a novel reseeding architecture for scan-based BIST, which uses an LFSR as TPG, is proposed. Multiple cells of the LFSR are utilized as sources for feeding the scan chain in different test phases. The LFSR generates the same state sequence in all phases, keeping that way the implementation cost low. Also, a dynamic reseeding scheme is adopted for further reducing the required hardware overhead. A seed-selection algorithm is moreover presented that, taking advantage of the multi-phase architecture, manages to reduce the number of the required seeds for achieving complete (100%) fault coverage. Experimental results demonstrate the superiority of the proposed LFSR reseeding approach over the already known reseeding techniques.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Testable designs of multiple precharged domino circuits",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4162507/",
            "Abstract": "Domino CMOS circuits are an option for speeding up critical units. An inherent problem of Domino logic is that under specific input conditions the charge redistribution between parasitic capacitances at internal nodes of a circuit can violate the noise margins and cause erroneous responses at the output. The dominant solution to this problem is the multiple precharging of the gate's internal nodes. However, the added precharge transistors are not testable for stuck-open faults. Undetectable stuck-open faults at these transistors may cause noise margins reduction and consequently may affect the reliability of the circuit since its operation in the field will be sensitive to environmental factors such as noise. In this paper, we propose new multiple precharging design schemes that enhance Domino circuits' testability with respect to transistor stuck-open and stuck-on faults",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A systematic methodology for designing area-time efficient parallel-prefix modulo 2/sup n/-1 adders",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1206237/",
            "Abstract": "In this paper a systematic methodology for designing parallel-prefix modulo 2/sup n/ - 1 adders, for every n, is introduced. The resulting modulo 2/sup n/ - 1 adders feature minimum logical depth and bounded fan-out loading. Additionally, an optimization technique is proposed, which aims at the reduction of redundant operators that appear on the parallel-prefix carry computation trees. Performance data reveal that the reduced structures achieve area /spl times/ time complexity reduction of up to 46% when compared to previously reported designs.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Domino CMOS SCD/SFS 2-out-of-3 and 1-out-of-3 code checkers",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210310001595383",
            "Abstract": "In this paper we present new strongly code-disjoint (SCD) and strongly fault-secure (SFS) checkers for the 2-out-of-3 and1-out-of-3 codes. They are implementedin Domino CMOS logic andtake into account a comprehensive fault model consisting of stuck-at, transistor stuck-open andtransistor stuck-on faults. The proposedcheckers are the first known SCD/SFS 2-out-of-3 and 1-out-of-3 code checkers in the open literature that consider the above fault model without suffering from static power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Concurrent detection of soft errors based on current monitoring",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/937828/",
            "Abstract": "Transient faults in future ICs turns to be a major consideration as the silicon process scales down. In this paper we propose a new soft error detecting technique with low area overhead, high detection speed and negligible performance penalty on the functional circuit under check. Among the already known techniques for soft error detection in logic circuits the proposed technique is the only one that is based on current monitoring.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital Logic Testing and Simulation, [Book Review]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1304576/",
            "Abstract": "Digital Logic Testing and Simulation, second edition [Book Review] Page 1 78 IEEE \nInstrumentation & Measurement Magazine June 2004 bookreview odern chip design has \ngreatly advanced with recent silicon manufacturing technology. Consequently, design and \ntest of complex digital circuits imposes extreme challenges to current tools and \nmethodologies. Test currently ranks among the most expensive and problematic aspects in \na circuit design cycle. According to the International Technology Roadmap for \nSemiconductors, by 2014, it may cost more to test than to manufacture a transistor. Hence, \nthere is a ceaseless need for innovative, test-related solutions. New solutions require deep \nknowledge of the problems as well as of the already existing methods. Therefore, the \nsecond edition of Digital Logic Testing and Simulation by A. Miczo is well timed. Chapter 1 \nbegins with a discussion of quality as it relates to . of , ’…",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiphase BIST: A new reseeding technique for high test-data compression",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1336953/",
            "Abstract": "In this paper, a new reseeding architecture for scan-based built-in self-test (BIST), which uses a linear feedback shift register (LFSR) as test pattern generator, is proposed. Multiple cells of the LFSR are utilized as sources for feeding the scan chain of the circuit under test in different test phases. The LFSR generates the same state sequence in all phases, keeping that way the implementation cost low. A seed-selection algorithm is furthermore presented that, taking advantage of the multiphase architecture, manages to significantly reduce the number of the required seeds for achieving complete (100%) fault coverage. The proposed technique can be used either in a full BIST implementation or in a test-resource partitioning scenario, since the test-data storage requirements on the tester are very low. When a full BIST implementation is preferable, the multiphase architecture can also be combined with a dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Test set embedding based on phase shifters",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36080-8_12",
            "Abstract": "In this paper we present a new method for designing test pattern generators (TPG) for the embedding of precomputed test sets. The proposed TPG is based on the use of an LFSR and phase shifters and produces the exact test set. The proposed TPG compares favorably, with respect to test application time and/or hardware overhead, to the already known approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A versatile built-in self-test scheme for delay fault testing",
            "Publication year": 2000,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/date/2000/05370756/12OmNzC5SGO",
            "Abstract": "A new Built-In Self Test (BIST) scheme that can be used for both off-line production and periodic testing of delay faults as well as for concurrent detection of faults causing signal delays in the field is presented. The scheme is based on the IDDT monitoring of the outputs of the circuit under test (CUT) or functional circuit. The proposed scheme has minimal impact on the performance and silicon area of the design since the same response verifier circuit is used for both off-line and concurrent detection of errors in the field.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Low power testing by test vector ordering with vector repetition",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1283674/",
            "Abstract": "Test vector ordering with vector repetition has been presented as a method to reduce the average as well as the peak power dissipation of a circuit during testing. Based on this method, in this paper we present some techniques that can be used to further reduce the average power dissipation. Experimental results validate that the proposed techniques achieve considerable savings in energy and average power dissipation while reducing the length of the resulting test sequences compared to the original method.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New architectures for modulo 2n-1 adders",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633502/",
            "Abstract": "Two architectures for parallel-prefix modulo 2 n  - 1 adders are presented in this paper. For large wordlengths we introduce the sparse modulo 2 n  - 1 adders that achieve significant reduction of the wiring complexity without imposing any delay penalty. Then, the Ling-carry formulation of modulo 2 n  - 1 addition is presented. Ling modulo adders save one logic level of implementation and provide high-speed solutions for smaller adder widths, where wiring complexity is small. The performance of the proposed adders has been validated with static CMOS implementations. In all examined cases, the proposed designs achieve significant savings in both area and delay compared to previously published architectures.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handling zero in diminished-one modulo 2",
            "Publication year": 2016,
            "Publication url": "https://ininet.org/handling-zero-in-diminished-one-modulo-2.html",
            "Abstract": "Zero treatment in diminished-one modulo addition has traditionally been performed separately, leading to slow and area consuming implementations. To overcome this, based on an earlier used enhanced number representation, we introduce novel carry look ahead and parallel-prefix architectures for diminished-one modulo adders that can also handle operands equal to 0. Translators for the new representation are also given.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new built-in TPG method for circuits with random pattern resistant faults",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1013898/",
            "Abstract": "The partition of the inputs of a circuit under test (CUT) into groups of compatible inputs reduces the size of a test pattern generator and the length of the test sequence for built-in self-test (BIST) applications. In this paper, a new test-per-clock BIST scheme is proposed which is based on multiple input partitions. The test session consists of two or more phases, and a new grouping is applied during each test phase. Using the proposed method a CUT can be tested at-speed and complete fault coverage (100%) is achieved with a small number of test vectors and small area overhead. Our experiments show that the proposed technique compares favorably to the already known techniques.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel reseeding technique for accumulator-based test pattern generation",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/368122.368145",
            "Abstract": "In this paper we present a novel reseeding technique for accumulator-based Test Pattern Generation suitable for circuits with hard-to-detect faults. Storing the seeds is not necessary since the seeds are generated on-the-fly by inverting the logic value of some of the bits of the accumulator's register. The proposed technique achieves complete fault coverage with shorter test sequences and requires less hardware for its implementation than the corresponding already-known techniques. Furthermore, our technique does not affect the system performance since the logic required for its implementation is not inserted in the critical path.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Novel single and double output TSC CMOS checkers for m-out-of-n codes",
            "Publication year": 2000,
            "Publication url": "https://www.hindawi.com/archive/2000/089292/abs/",
            "Abstract": "This paper presents a novel method for designing Totally Self-Checking (TSC) m-out-of-n code checkers taking into account a realistic fault model including stuck-at, transistor stuck-on, transistor stuck-open, resistive bridging faults and breaks. The proposed design method is the first method in the open literature that takes into account a realistic fault model and can be applied for most practical values of m and n. Apart from the above the proposed checkers are very compact and very fast. The single output checkers are near optimal with respect to the number of transistors required for their implementation. Another benefit of the proposed TSC checkers is that all faults are tested by a very small set of single pattern tests, thus the probability of achieving the TSC goal is greater than in checkers requiring two-pattern tests. The single output TSC checkers proposed in this paper are the first known single output TSC checkers for m-out-of-n codes.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:XiVPGOgt02cC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Closed-form bounds for interconnect-aware minimum-delay gate sizing",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11556930_32",
            "Abstract": "Early circuit performance estimation and easy-to-apply methods for minimum-delay gate sizing are needed, in order to enhance circuit’s performance and to increase designers’ productivity. In this paper, we present a practical method to perform gate sizing, taking also into account the contribution of fixed wiring loads. Closed-form bounds are derived and a simple recursive procedure is developed that directly calculate the gate sizes required to achieve minimum delay. The designer, using the proposed method, can easily compare different implementations of the same circuit and explore the energy-delay design space, including in the analysis the effect of interconnect.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An improved search method for accumulator-based test set embedding",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633350/",
            "Abstract": "In this paper we present a new search method for test set embedding using an accumulator driven with an additive constant C. We formulate the problem of finding the location of a test pattern in the generated sequence in terms of a linear Diophantine equation with two variables, which is known to be solved quickly in linear time. We show that only one Diophantine equation needs to be solved per test set irrespective of its size. Next we show how to find the starting state, for a given constant C and test set T, such that the generated sequence can reproduce T with minimum length. Finally, we show that the best constant C opt  (in terms of shortest test length) for the embedding of T using an accumulator of size n can be found in O(2ldrn+Fldr|T|) steps, instead of O(nldr2 n ldr|T|) steps of a previous approach, where F depends on the particular test set and can be significantly smaller than its worst case value of 2 n-2 …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient seeds selection method for LFSR-based test-per-clock BIST",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996747/",
            "Abstract": "Built-in self-test (BIST) is an effective approach for testing large and complex circuits. When BIST is used, a test pattern generator (TPG), a test response verifier and a BIST controller accompany the circuit under test (CUT) in the chip, creating a self-testable circuit. In this paper we propose a new algorithm for seeds selection in LFSR (linear feedback shift register) based test-per-clock BIST. The proposed algorithm uses the well-known concept of solving systems of linear equations and, based on heuristics, minimizes the number of seeds and test vectors while achieving 100% fault coverage. Experimental results indicate that it compares favorably to the other known techniques.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "LFSR-based test-data compression with self-stoppable seeds",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5090897/",
            "Abstract": "The main disadvantage of LFSR-based compression is that it should be usually combined with a constrained ATPG process, and, as a result, it cannot be effectively applied to IP cores of unknown structure. In this paper, a new LFSR-based compression approach that overcomes this problem is proposed. The proposed method allows each LFSR seed to encode as many slices as possible. For achieving this, a special purpose slice, called stop-slice, that indicates the end of a seed's usage is encoded as the last slice of each seed. Thus, the seeds include by construction the information of where they should stop and, for that reason, we call them self-stoppable. A stop-slice generation procedure is proposed that exploits the inherent test set characteristics and generates stop slices which impose minimum compression overhead. Moreover, the architecture for implementing the proposed technique requires negligible …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Use Them-Don't Waste Them. Recruiting Strong ECC in L1 Caches for Hard Error Recovery Without the Penalty",
            "Publication year": 2015,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01226605/",
            "Abstract": "Operating below nominal voltage levels is a promising direction to enable ultra-low power CMOS-based sytems. This is true due to the cubic relation between the dynamic power consumption and the supply voltage. The main roadblock during aggressive voltage scaling is that the reliability of the circuits and especially of memory structures (SRAM cells) is exponentially decreased. The usage of well-known error correction codes (ECC) can only remedy a part of the problem. ECC have been proposed to protect the lower level caches (e.g., L2 or L3), but ECC cannot be employed in single-cycle first level caches due to their performance sensitivity to the additional latency of ECC. In this work, we propose a methodology to solve this problem by exploring the use of criticality metrics in aggressive superscalar processors. Instead of disabling the faulty frames of a faulty cache (as proposed in related work), we keep these frame \" alive \" (data are still placed and accessed in these faulty frames) and we use strong ECC to correct the hard multibit errors. The key idea is to direct to faulty cache frames data that can be delayed for one or more cycles without affecting program completion time i.e., instructions considered to not be on the critical path of the program execution. The basic mechanisms for hardening first level faulty caches with strong ECC protection without inflating program executing time are described in this position paper.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-speed parallel-prefix modulo 2n-1 adders",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US7155473B2/en",
            "Abstract": "A parallel-prefix modulo 2 n− 1 adder that is as fast as the fastest parallel prefix 2 n integer adders, does not require an extra level of logic to generate the carry values, and has a very regular structure to which pipeline registers can easily be added. All nodes of the adder have a fanout≦ 2. In the prefix structure of the adder, each carry value term output by the parallel prefix structure is determined by the all of the bits in the operands input to the adder. In one embodiment, there are log 2 n stages in the prefix structure. Each stage has n logical operators, and all of the logical operators in the prefix structure are of the same kind. Pipeline registers may be inserted before and/or after a stage in the prefix structure.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing dictionary based test data compression using the ATE repeat instruction",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6815439/",
            "Abstract": "The manufacturing test cost of an IC depends heavily of its test data volume. In this paper we show how to exploit the features of a dictionary based test data compression technique in order to increase the count and the length of 0s and 1s runs appearing in the compressed test data. Then, we experimentally show that using the ATE repeat instruction the test data volume which should be stored in the ATE vector memory can be further reduced significantly.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power BIST for wallace tree-based multipliers",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/838914/",
            "Abstract": "The low power as a feature of a BIST scheme is a significant target due to quality as well as cost related issues. In this paper we examine the testability of multipliers based on Booth encoding and Wallace tree summation of the partial products and we present a methodology for deriving a low power Built In Self Test (BIST) scheme for them. We propose several design rules for designing the Wallace tree in order to be fully testable under the cell fault model. The proposed low power BIST scheme for the derived multipliers is achieved by: (a) introducing suitable Test Pattern Generators (TPG); (b) properly assigning the TPG outputs to the multiplier inputs; and (c) significantly reducing the test set length with respect to earlier schemes; Our results indicate that the total power dissipated during test can be reduced from 64.8% to 72.8%, while the average power per test vector can be reduced from 19.6% to 27.4% and the …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recovery of performance degradation in defective branch target buffers",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7604679/",
            "Abstract": "Dynamic voltage and frequency scaling (DVFS) is a commonly-used power-management technique. Unfortunately, voltage scaling increases the impact of process variations on memory cells reliability resulting in an exponential increase in the number of malfunctioning memory cells. In this work, we systematically investigate the behavior of branch target buffers (BTB) with faulty memory cells. Although being an intrinsically fault-tolerant unit (i.e., it does not affect correctness of the system), as we show in this work for several fault probabilities and core configurations, disabling the faulty parts of BTBs can damage the performance of the executing applications. To remedy the negative impact of malfunctioning BTB memory cells in contemporary BTB organizations, we present an ultra lightweight performance recovery mechanism. The proposed mechanism introduces minimal hardware overheads and practically-zero …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power test set embedding based on phase shifters",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1183367/",
            "Abstract": "A new efficient method for test set embedding based on phase shifters was recently proposed This method suffers from high average and peak power consumption. In this work we propose a new phase shifter-based test set embedding method, which, by using interleaving and two LFSRs that change state in a non-overlapping way, significantly reduces the average and peak power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of modulo 2/sup n//spl plusmn/1 adders",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957792/",
            "Abstract": "In this paper we present new architectures for the design of modulo 2/sup n//spl plusmn/1 adders, which are based on the use of the same design block. Our design block incorporates a parallel-prefix carry computation unit with a carry increment stage. VLSI implementations of the proposed architectures in a static CMOS technology reveal their superiority against all already known architectures when the area * time/sup 2/ product is used as a metric and n > 8.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Parallel Multilevel-Huffman Decompression Scheme for IP Cores with Multiple Scan Chains",
            "Publication year": 2006,
            "Publication url": "http://www.cse.uoi.gr/~kabousia/pdf/Papers/Kavousianos_ETS_06.pdf",
            "Abstract": "Various efficient compression methods have been proposed for tackling the problem of increased test-data volume of contemporary, core-based Systems-on-Chip (SoCs). However, many of them cannot exploit the test-application-time advantage that cores with multiple scan chains offer, since they are not able to perform parallel decompression of the encoded data. For eliminating this problem, we present a new, low-overhead decompression scheme that can generate clusters of test bits in parallel. The test data are encoded using a recently proposed and very effective compression method called multilevel Huffman. Thus, apart from the significantly reduced test-application times, the proposed approach offers high compression ratios, as well as increased probability of detection of unmodeled faults, since the majority of the unspecified bits of the test sets are replaced by pseudorandom data. The time/space advantages of the proposed approach are validated by thorough experiments.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient modulo 2/sup n/+ 1 tree multipliers for diminished-1 operands",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1302011/",
            "Abstract": "In this work we propose a new method for designing modulo 2/sup n/+l multipliers for diminished-1 operands. Our multipliers compared to the already known tree architecture offer enhanced operation speed for the majority of n values, with similar area complexities. They also have very regular structure, and can be pipelined at the full-adder level.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Eeckhout, L. and K. De Bosschere, Quantifying behavioral differences between multimedia and general-purpose workloads 199–220",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=6462624849104324224&hl=en&oi=scholarr",
            "Abstract": "Mailachalam, B., see Sudha, N. 337–352 Mattavelli, M., see Ravasi, M. 403–427 Mazzocca, N., see Cotroneo, D. 81–98 Meribout, M. and M. Motomura, New design methodology with efficient prediction of quality metrics for logic level design towards dynamic reconfigurable logic 285–310 Motomura, M., see Meribout, M. 285–310",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A core generator for arithmetic cores and testing structures with a network interface",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138376210500055X",
            "Abstract": "We present Eudoxus, a tool for generation of architectural variants for arithmetic soft cores and testing structures targeting a wide variety of functions, operand sizes and architectures. Eudoxus produces structural and synthesizable VHDL and/or Verilog descriptions for: (a) several arithmetic operations including addition, subtraction, multiplication, division, squaring, square rooting and shifting, and (b) several testing structures that can be used as test pattern generators and test response compactors. Interaction with the user is made through a network interface. Since the end user is presented with a variety of unencrypted structural cores, each one describing an architecture with its own area, delay and power characteristics, he can choose the one that best fits his specific needs which he can further optimize or customize. Therefore, designs utilizing these cores are completed in less time and with less effort.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:-f6ydRqryjwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Conditional soft-edge flip-flop for SET mitigation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7604708/",
            "Abstract": "Single event transient (SET) pulses are a significant cause of soft errors in a circuit. To cope with SET pulses, we propose a new storage cell that is able to operate either as a hard-edge or soft-edge flip-flop depending on the appearance or not of a transition in a time window. The efficiency of the proposed design with respect to the reduction of soft-errors coming from SET pulses was shown with extensive simulations.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new test pattern generator for high defect coverage in a BIST environment",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/988952.989052",
            "Abstract": "In this paper we propose a new Test Pattern Generator (TPG) for the detection of realistic faults occurring in CMOS nanometer technologies. The proposed TPG compares favorably to the corresponding already known TPGs with respect to the fault coverage obtained by test sequences of the same length. Another advantage of the proposed TPG is that the same TPG can be used for testing more than one modules in a SOC.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modulo 2/sup n//spl plusmn/1 adder design using select-prefix blocks",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1244938/",
            "Abstract": "We present new design methods for modulo 2/sup n//spl plusmn/1 adders. We use the same select-prefix addition block for both modulo 2/sup n/-1 and diminished-one modulo 2/sup n/+1 adder design. VLSI implementations of the proposed adders in static CMOS show that they achieve an attractive combination of speed and area costs.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A ROMless LFSR reseeding scheme for scan-based BIST",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1181712/",
            "Abstract": "In this paper, we present a new LFSR reseeding scheme for scan-based BIST, suitable for circuits with random-pattern-resistant faults. The proposed scheme eliminates the need of a ROM for storing the seeds since the reseedings are performed dynamically by inverting some selected bits of the LFSR register. A time-to-market efficient algorithm is also presented for selecting the reseeding points in the test sequence, as well as a proper seed at each point. This algorithm targets complete fault coverage and minimization of the resulting test length and hardware overhead. Experimental results on ISCAS '85 and ISCAS '89 benchmark circuits demonstrate the advantages of this new LFSR reseeding approach in terms of area overhead and test application time.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On testability of multiple precharged domino logic",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/838886/",
            "Abstract": "Domino circuits are increasingly popular because they offer a significant performance boost over static ones. An inherent problem with domino CMOS gates is that under specific input conditions the charge redistribution between parasitic capacitances at internal nodes of the circuit can destroy the noise margin and cause glitches at the output of a domino gate. Among the dominant solutions proposed, in the open literature, to overcome this problem is the technique of internal nodes multiple precharging. However the added precharge transistors are not testable for stuck-open and stuck-on faults. Undetectable stuck-open faults on these transistors cause reduction of the noise margins of the gate. Then the operation of the circuit in the field is sensitive to environmental factors, such as noise. In this paper we propose a new internal nodes multiple precharging scheme that leads to testable designs for stuck-open and …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of high-speed low-power parallel-prefix VLSI adders",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30205-6_27",
            "Abstract": "Parallel-prefix adders offer a highly-efficient solution to the binary addition problem. Several parallel-prefix adder topologies have been presented that exhibit various area and delay characteristics. However, no methodology has been reported so far that directly aims to the reduction of switching activity of the carry-computation unit. In this paper by reformulating the carry equations, we introduce a novel bit-level algorithm that allows the design of power-efficient parallel-prefix adders. Experimental results, based on static-CMOS implementations, reveal that the proposed adders achieve significant power reductions when compared to traditional parallel-prefix adders, while maintaining equal operation speed.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the design of low power BIST for multipliers with Booth encoding and Wallace tree summation",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1383762102001212",
            "Abstract": "Low power dissipation (PD) during testing is emerging as one of the major objectives of a built-in self-test (BIST) designer. In this paper we examine the testability of multipliers based on Booth encoding and Wallace tree summation of the partial products and we present a methodology for deriving a low power BIST scheme for them. We propose several design rules for designing the Wallace tree in order to be fully testable under the cell fault model. The proposed low power BIST scheme for the derived multipliers is achieved by: (a) introducing suitable test pattern generators (TPGs), (b) properly assigning the TPG outputs to the multiplier inputs and (c) significantly reducing the test set length. Results indicate that the total power dissipated, the average power per test vector and the peak PD during testing can be reduced up to 73%, 27% and 36% respectively with respect to earlier schemes, depending on the …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A Compact Built-In Current Sensor for Ippo Testing",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=12886422193726760793&hl=en&oi=scholarr",
            "Abstract": "In this paper a simple to implement, compact, build-in current sensor for Ippo testing of CMOS VLSI circuits based on current mirroring techniques is proposed. This sensor can attain small detection times and can be used for both on-line and off-line Ippo testing.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Optimal selective Huffman coding for test-data compression",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4264327/",
            "Abstract": "Selective Huffman coding has recently been proposed for efficient test- data compression with low hardware overhead. In this paper, we show that the already proposed encoding scheme is not optimal and we present a new one, proving that it is optimal. Moreover, we compare the two encodings theoretically and we derive a set of conditions which show that, in practical cases, the proposed encoding always offers better compression. In terms of hardware overhead, the new scheme is at least as low-demanding as the old one. The increased compression efficiency, the resulting test-time savings, and the low hardware overhead of the proposed method are also verified experimentally.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deterministic test vector compression/decompression using an embedded processor",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11408901_24",
            "Abstract": "Test data compression and on-chip decompression using an embedded processor has already been proposed for test data volume and test time reduction as well as for use of slower testers without decreasing test quality. On the other hand, scan cell reordering methods have been proposed to overcome the problem of high average power dissipation during scan based external testing. In this paper we propose a scan cell ordering based test vector compression method, which reduces test data volume up to 87.3%. The decompression of the test data is based on the use of an embedded processor.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Low power built-in self-test schemes for array and booth multipliers",
            "Publication year": 2001,
            "Publication url": "https://www.hindawi.com/archive/2001/067893/abs/",
            "Abstract": "Recent trends in IC technology have given rise to a new requirement, that of low power dissipation during testing, that Built-In Self-Test (BIST) structures must target along with the traditional requirements. To this end, by exploiting the inherent properties of Carry Save, Carry Propagate and modified Booth multipliers, in this paper we propose new power-efficient BIST structures for them. The proposed BIST schemes are derived by: (a) properly assigning the Test Pattern Generator (TPG) outputs to the multiplier inputs, (b) modifying the TPG circuits and (c) reducing the test set length. Our results indicate that the total power dissipated during testing can be reduced from 29.3% to 54.9%, while the average power per test vector applied can be reduced from 5.8% to 36.5% and the peak power dissipation can be reduced from 15.5% to 50.2% depending on the implementation of the basic cells and the size of the multiplier. The test application time is also significantly reduced, while the introduced BIST schemes implementation area is small.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:eflP2zaiRacC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Reseeding-based test set embedding with reduced test sequences",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1410588/",
            "Abstract": "A novel technique for reducing the test sequences of reseeding-based schemes is presented in this paper. The proposed technique is generic and can be applied to test set embedding or mixed-mode schemes based on various TPG. The imposed hardware overhead is very small since it is confined to just one extra bit per seed plus one very small counter in the scheme's control logic, while the test-sequence-length reductions achieved are up to 44.71%. Along with the test-sequence-reduction technique, an efficient seed-selection algorithm for the test-per-clock, LFSR-based, test set embedding case is presented. The proposed algorithm targets the minimization of the selected seed volumes and, combined with the test-sequence-reduction technique, delivers results with fewer seeds and much smaller test sequences than the already proposed approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-the-fly reseeding: A new reseeding technique for test-per-clock BIST",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1015039323168",
            "Abstract": "In this paper we present a new reseeding technique for test-per-clock test pattern generation suitable for at-speed testing of circuits with random-pattern resistant faults. Our technique eliminates the need of a ROM for storing the seeds since the reseeding is performed on-the-fly by inverting the logic value of some of the bits of the next state of the Test Pattern Generator (TPG). The proposed reseeding technique is generic and can be applied to TPGs based on both Linear Feedback Shift Registers (LFSRs) and accumulators. An efficient algorithm for selecting reseeding points is also presented, which targets complete fault coverage and allows to well exploiting the trade-off between hardware overhead and test length. Using experimental results we show that the proposed method compares favorably to the other already known techniques with respect to test length and the hardware implementation cost.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Low-power leading-zero counting and anticipation logic for high-speed floating point units",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4539802/",
            "Abstract": "In this paper, a new leading-zero counter (or detector) is presented. New boolean relations for the bits of the leading-zero count are derived that allow their computation to be performed using standard carry-lookahead techniques. Using the proposed approach various design choices can be explored and different circuit topologies can be derived for the design of the leading-zero counting unit. The new circuits can be efficiently implemented either in static or in dynamic logic and require significantly less energy per operation compared to the already known architectures. The integration of the proposed leading-zero counter with the leading-zero anticipation logic is analyzed and the most efficient combination is identified. Finally, a simple yet efficient technique for handling the error of the leading-zero anticipation logic is also presented. The energy-delay behavior of the proposed circuits has been investigated using …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Preemptive built-in self-test for in-field structural testing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7085416/",
            "Abstract": "One-time factory testing of VLSI components after fabrication is insufficient in the deep submicron era. The products must be tested periodically in the field of application. Due to the complexity of the Systems on a Chip (SoCs), huge amounts of test data are required. However in many embedded systems the capacity of the available memory is a limited resource. Besides in real time embedded systems the in-field testing activities should be accommodated with the real-time constraints of the system. In this paper we at first show the suitability of the LFSR-based Test-Data Compression with Self-Stoppable Seeds method [10] for in-field testing and we give the required enhancements so that can be used as a Preemptive Built-In Self-Test mechanism for in-field testing that is applied at the idle time intervals of a hard real-time embedded system with sporadic tasks. Then, based on a probabilistic model and extensive …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Test data compression based on the reuse of parts of the dictionary entries",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6122331/",
            "Abstract": "In this paper we show that the test data compression achieved by a dictionary based method can be improved significantly by suitably reusing parts of the dictionary entries. To this end two new algorithms are proposed, suitable for partial and complete dictionary coding respectively. The efficiency of the proposed techniques is supported with extensive simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new scheme for effective I/sub DDQ/testing in deep submicron",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/843684/",
            "Abstract": "I/sub DDQ/, testing has become a widely accepted defect detection technique in CMOS ICs. However its effectiveness in deep submicron is threatened by the increased transistor sub-threshold leakage current. In this paper a new l/sub DDQ/ testing scheme is proposed based on the use of a compensation circuit. The compensation circuit is used to eliminate, during testing, normal leakage current from the sensing node of the circuit under test so that already known [in the open literature] I/sub DDQ/ sensing techniques can be applied in deep submicron.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient multiphase test set embedding for scan-based testing",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1613175/",
            "Abstract": "In this paper, a new test set embedding method with re-seeding for scan-based testing is proposed. The bit sequences of multiple cells of an LFSR, which is used as test pattern generator, are exploited for effectively encoding the test set of the core under test (multiphase architecture). A new algorithm which comprises four heuristic criteria is introduced for efficiently selecting the required seeds and LFSR cells. Also, a cost metric for assessing the quality of the algorithm's results is proposed. By using this metric, the process of determining proper values for the algorithm's input parameters is significantly simplified. The proposed method compares favorably with the most recent and effective test set embedding techniques in the literature",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient BIST schemes for RNS datapaths",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1206377/",
            "Abstract": "It has recently been shown that accumulators can be used efficiently for test pattern generation as well as for test response compaction. In this paper we present a BIST scheme for accumulators where the accumulator is simultaneously used as a test pattern generator and a response compactor during its own testing. We also show that the proposed BIST scheme is especially suitable for accumulator, adder and multiplier-accumulator RNS channels leading to minimal hardware overhead and short test sequences.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On accumulator-based bit-serial test response compaction schemes",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/915255/",
            "Abstract": "The data paths of most contemporary general and special purpose processors include registers, adders and other arithmetic circuits. If these circuits are also used for built-in self-test, the extra area required for embedding testing structures can be cut down efficiently. Several schemes based on accumulators, subtracters, multipliers and shift, resisters have been proposed and analyzed in the past for parallel test response compaction, whereas some efforts have also been devoted in the bit-serial response compaction case. In this paper, we analyse and evaluate the bit-serial version of a recently proposed scheme for parallel test response compaction. Experimental results on the ISCAS'85 benchmark circuits indicate that the post-compaction fault coverage drop attained by the new scheme is significantly lower than other already known accumulator-based compaction schemes.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient BIST scheme for high-speed adders",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214372/",
            "Abstract": "In this paper we present a new pseudorandom BIST scheme for high-speed adders. Under this scheme an adder is simultaneously used as a test pattern generator and as a response compactor during its own testing. The main advantages of the proposed scheme, compared to prior methods, are minimal performance penalty, small hardware overhead and the benefits of at-speed testing.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-speed parallel-prefix VLSI Ling adders",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1377160/",
            "Abstract": "Parallel-prefix adders offer a highly efficient solution to the binary addition problem and are well-suited for VLSI implementations. A novel framework is introduced, which allows the design of parallel-prefix Ling adders. The proposed approach saves one-logic level of implementation compared to the parallel-prefix structures proposed for the traditional definition of carry lookahead equations and reduces the fanout requirements of the design. Experimental results reveal that the proposed adders achieve delay reductions of up to 14 percent when compared to the fastest parallel-prefix architectures presented for the traditional definition of carry equations.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "DV-TSE: Difference Vector Based Test Set Embedding.",
            "Publication year": 2003,
            "Publication url": "http://www.cs.uoi.gr/~kabousia/pdf/Papers/Bellos_IFIP_03.pdf",
            "Abstract": "In this paper we present a new test set embedding method for test-per-clock BIST schemes. The method works efficiently with fully specified as well as partially specified test sets and requires a number of clock cycles equal to the size of the test set. The resulting test pattern generation mechanism (TPG) compares favourably in terms of area implementation and test application time to already known approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diophantine-equation based arithmetic test set embedding",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1655547/",
            "Abstract": "In this paper we show first that finding the location of a test vector in the sequence generated by an accumulator driven with an odd additive constant C is equivalent to the solution of a linear Diophantine equation with two variables. The latter equation is known to be solved fast in linear time. We then show that only one Diophantine equation needs to be solved per test set irrespective of the number of patterns in it. The finding of the locations of all patterns of a given test set T in the sequence generated under a constant C is done in O(n+ | T |) steps instead of O(n middot |T|) steps of a previous approach. Next we present a method which, given a test set T, and an odd constant C, finds the seed in the sequence generated under C that can reproduce all patterns of T in minimum length. We use this optimum technique to search for the best constant C' (in terms of short test length) in a randomly generated subset …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handling zero in diminished-one modulo 2 n  + 1 adders",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0020721031000148263",
            "Abstract": "Zero treatment in diminished-one modulo 2 n  + 1 addition has traditionally been performed separately, leading to slow and area-consuming implementations. To overcome this, on the basis of an enhanced number representation used previously, we introduce novel carry look ahead and parallel-prefix architectures for diminished-one modulo 2 n  + 1 adders that can also handle operands equal to 0. Translators for the new representation are also given.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:roLk4NBRz8UC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "A Defect-aware reconfigurable cache architecture for low-vccmin DVFS-enabled systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7092426/",
            "Abstract": "As process technology continues to shrink, a large number of bitcells in on-chip caches is expected to be faulty. The number of defective cells varies from die-to-die, wafer-to-wafer, and in the field of application depends on the run-time operating conditions (e.g., supply voltage and frequency). Those trends necessitate i) to study fault-tolerant (FT) cache mechanisms in a wide spectrum of fault-probabilities and ii) to devise appropriate FT techniques that must be able to adapt their FT capacity to the volume of defective locations of the target faulty caches. It is well known that keeping the cache capacity, block size and the volume of defective cells constant, the average number of misses, due to faulty cells, decreases as the associativity of the cache increases. To this end, we propose DARCA, a Defect-Aware Reconfigurable Cache Architecture, which is equipped with the ability of dynamically varying its associativity …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scan cell ordering for low power BIST",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1339558/",
            "Abstract": "Power dissipation during scan-based testing has gained significant importance in the past few years. In this work we examine the use of transition frequency based on scan cell ordering techniques in pseudorandom scan based BIST in order to reduce average power dissipation. We also propose the resetting of the input register of the circuit together with ordering of its elements to further reduce average power dissipation. Experimental results indicate that the proposed techniques can reduce average power dissipation up to 57.7%.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new technique for IDDQ testing in nanometer technologies",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926002000238",
            "Abstract": "IDDQ testing has become a widely accepted defect detection technique in CMOS ICs. However, its effectiveness in very deep submicron technologies is threatened by the increased transistor leakage current. In this paper, we propose a technique for the elimination, during testing, of the normal leakage current from the sensing node of a circuit under test. In this way the already known in the open literature IDDQ sensing techniques can be applied in the nanometer technologies.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A class of easily path delay fault testable circuits",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/836466/",
            "Abstract": "The number of physical paths in a carry save or modified Booth multiplier, as well as in a non-restoring cellular array divider is prohibitively large for testing all paths for delay faults. Besides, neither all paths are robustly testable nor a basis consisting of SPP-HFRT paths exists. In this paper we present sufficient modifications of the above mentioned circuits so that a basis consisting of SPP-HFRT paths exists. The cardinality of the derived basis is very small. Also, hardware and delay overheads due to the modifications are respectively small and negligible.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Path delay fault testing of multiplexer-based shifters",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210110058139",
            "Abstract": "In this paper we present a method for path delay fault testing of multiplexer-based shifters. We show that many paths of the shifter are not single path propagating hazard free robustly testable (SPP-HFRT) and we present a path selection method such that all the selected paths are SPP-HFRT by (Olog2 n) test-vector pairs, where n is the length of the shifter's operand. The propagation delay along all other paths is a function of the delays along the selected paths. This is the first work addressing the problem of shifter path delay fault testing.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "A versatile built-in self test scheme for delay fault testing (poster paper)",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/343647.344343",
            "Abstract": "A new Built-In Self Test (BIST) scheme is presented that can be used for both offfline production or periodic testing of delay faults as well as for concurrent detection of faults causing signal delays in the field. The scheme is based on the I''7 monitoring of the outputs of the circuit under test (CUT). The proposed scheme has minimal impact on the performance and silicon area of the design since the same response verifier circuit is used for both offfline and concurrent detection of errors in the field.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multilevel Huffman coding: An efficient test-data compression method for IP cores",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4167987/",
            "Abstract": "A new test-data compression method suitable for cores of unknown structure is introduced in this paper. The proposed method encodes the test data provided by the core vendor using a new, very effective compression scheme based on multilevel Huffman coding. Each Huffman codeword corresponds to three different kinds of information, and thus, significant compression improvements compared to the already known techniques are achieved. A simple architecture is proposed for decoding the compressed data on chip. Its hardware overhead is very low and comparable to that of the most efficient methods in the literature. Moreover, the major part of the decompressor can be shared among different cores, which reduces the hardware overhead of the proposed architecture considerably. Additionally, the proposed technique offers increased probability of detection of unmodeled faults since the majority of the …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New reseeding technique for LFSR-based test pattern generation",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/937823/",
            "Abstract": "Presents a new reseeding technique for LFSR-based test pattern generation suitable for circuits with random-pattern resistant faults. Our technique eliminates the need of a ROM for storing the seeds since the LFSR jumps from a state to the required state (seed) by inverting the logic value of some of the bits of its next state. An efficient algorithm for selecting reseeding points is also presented, which targets complete fault coverage and minimization of the cardinality of the test set and the hardware required for the implementation of the test pattern generator. The application of the proposed technique to ISCAS '85 and the combinational part of ISCAS '89 benchmark circuits shows its superiority against the already known reseeding techniques with respect to the length of the test sequence and, in the majority of cases, the hardware required for their implementation.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hierarchical architecture for concurrent soft error detection based on current sensing",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030184/",
            "Abstract": "Robust circuit design techniques with respect to soft errors gain importance in the era of very deep submicron technologies. On-line testing will play an important role towards this direction. In this paper we propose a hierarchical architecture for concurrent soft error detection. This architecture is based on current sensing techniques and provides very low area overhead, small detection times and negligible performance penalty on the functional circuit under check.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast parallel-prefix modulo 2/sup n/+ 1 adders",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1315614/",
            "Abstract": "Modulo 2/sup n/+1 adders find great applicability in several applications including RNS implementations and cryptography. In this paper, we present two novel architectures for designing modulo 2/sup n/+1 adders, based on parallel-prefix carry computation units, the first architecture utilizes a fast carry increment stage, whereas the second is a totally parallel-prefix solution. CMOS implementations reveal the superiority of the resulting adders against previously reported solutions in terms of implementation area and execution latency.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient test set embedding scheme with reduced test data storage and test sequence length requirements for scan-based testing",
            "Publication year": 2005,
            "Publication url": "https://www.cs.uoi.gr/wp-content/uploads/publications/TR-26-2005.pdf",
            "Abstract": "In this paper we present an efficient seed-selection algorithm for reducing the test data storage requirements of scan-based, test set embedding schemes with reseeding. Moreover, a technique for reducing the length of the generated test sequences is introduced. This technique achieves significant savings with minor overhead (one extra bit per seed plus a small counter in the scheme’s control logic). Experimental results demonstrate the advantages of the proposed algorithm and the test sequence reduction technique.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multilevel-Huffman test-data compression for IP cores with multiple scan chains",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4539810/",
            "Abstract": "Various compression methods have been proposed for tackling the problem of increasing test-data volume of contemporary, core-based systems. Despite their effectiveness, most of the approaches that are based on classical codes (e.g., run-lengths, Huffman) cannot exploit the test-application-time advantage of multiple-scan-chain cores, since they are not able to perform parallel decompression of the encoded data. In this paper, we take advantage of the inherent parallelism of Huffman decoding and we present a generalized multilevel Huffman-based compression approach that is suitable for cores with multiple scan chains. The size of the encoded data blocks is independent of the slice size (i.e., the number of scan chains), and thus it can be adjusted so as to maximize the compression ratio. At the same time, the parallel data-block decoding ensures the exploitation of most of the scan chains' parallelism. The …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatial pattern prediction based management of faulty data caches",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6800274/",
            "Abstract": "Technology scaling leads to significant faulty bit rates in on-chip caches. In this work, we propose a methodology to mitigate the impact of defective bits (due to permanent faults) in first-level set-associative data caches. Our technique assumes that faulty caches are enhanced with the ability of disabling their defective parts at cache subblock granularity. Our experimental findings reveal that while the occurrence of hard-errors in faulty caches may have a significant impact in performance, a lot of room for improvement exists, if someone is able to take into account the spatial reuse patterns of the to-be-referenced blocks (not all the data fetched into the cache is accessed). To this end, we propose frugal PC-indexed spatial predictors (with very small storage requirements) to orchestrate the (re)placement decisions among the fully and partially unusable faulty blocks. Using cycle-accurate simulations, a wide range of …",
            "Abstract entirety": 0,
            "Author pub id": "kndWOCIAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On obtaining maximum-length sequences for accumulator-based serial TPG",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1715441/",
            "Abstract": "Arithmetic-function modules, which are available in many circuits, can be utilized to generate test patterns and compact test responses. An accumulator-based scheme along with a procedure to find maximum-length nonlinear sequences for bit-serial test-pattern generators is proposed. The proposed scheme achieves good fault coverage with low hardware overhead and short test sequences",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and Analysis of On-Chip CPU Pipelined Caches",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35498-9_15",
            "Abstract": "The access time of the first level on-chip cache usually imposes the cycle time of high-performance VLSI processors. The only way to reduce the effect of cache access time on processor cycle time is the use of pipelined caches. A timing model for on-chip caches has recently been presented in [1]. In this paper the timing model given in [1] is extended so as pipelined caches can be handled. Also the possible pipelined architectures of a cache memory are investigated. The speedup of the pipelined cache against the non-pipelined one is examined as a function of the pipeline depth, the organization and the physical implementation parameters.",
            "Abstract entirety": 1,
            "Author pub id": "kndWOCIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, Boston, MA"
        }
    ]
}]