[{
    "name": " Δημήτριος  Τσουκαλάς",
    "romanize name": " Dimitrios  Tsoukalas",
    "School-Department": "Εφαρμοσμένων Μαθηματικών & Φυσικών Επιστημών",
    "University": "ntua",
    "Rank": "Καθηγητής",
    "Apella_id": 19738,
    "Scholar name": "Dimitris Tsoukalas",
    "Scholar id": "4hv-l94AAAAJ",
    "Affiliation": "Professor at National Technical University of Athens",
    "Citedby": 4766,
    "Interests": [
        "Electronic Devices",
        "Nanotechnology",
        "Electronic Materials",
        "MEMS"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=4hv-l94AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Low-Power and Highly Uniform 3-b Multilevel Switching in Forming Free TiO2–x-Based RRAM With Embedded Pt Nanocrystals",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7482775/",
            "Abstract": "Multilevel capability is greatly desired in order to attain high effective memory density. Here, we demonstrate that 3-b per memory cell storage capacity can take place by incorporating small (~3 nm diameter) Pt nanocrystals (NCs) within 45-nm TiO 2-x -based resistive random access memory. Seven low-resistance states as well one high-resistance state were achieved by setting proper compliance current (I cc ) limit between 2 and 200 μA. In striking contrast, the reference sample without NCs exhibited 2-b multilevel switching at higher operating voltages. The enhanced performance of the Pt NCs embedded sample is ascribed to the preferable creation of small conducting filaments around the NCs with high density of oxygen vacancies, due to the concentrated electric field effect, which improves the uniformity of the switching characteristics regardless of the random nature of switching effect.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:anf4URPfarAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Engineering amorphous-crystalline interfaces in TiO2−x/TiO2−y-based bilayer structures for enhanced resistive switching and synaptic properties",
            "Publication year": 2016,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4964872",
            "Abstract": "The operating principle of resistive random access memories (RRAMs) relies on the distribution of ionic species and their influence on the electron transport. Taking into account that formation and annihilation of conducting filaments (CFs) is the driving mechanism for the switching effect, it is very important to control the regions where these filaments will evolve. Thus, homolayers of titanium oxide with different oxygen contents were fabricated in order to tune the local electrical and thermal properties of the CFs and narrow down the potential percolation paths. We show that the oxygen content in the top layer of the TiO2−x/TiO2−y bilayer memristors can directly influence the morphology of the layers which affect the diffusion barrier and consequently the diffusivity and drift velocity of oxygen vacancies, yielding in important enhancement of switching characteristics, in terms of spatial uniformity (σ/μ < 0.2), enlarged …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:mlAyqtXpCwEC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Non-melting annealing of silicon by CO2 laser",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609009016101",
            "Abstract": "In this work we investigate CO2 laser annealing at millisecond time scale for the fabrication of Ultra Shallow Junctions, able to fulfill the requirements imposed for sub-45 nm CMOS nodes. Silicon samples doped with Boron using BF3 plasma implantation technique at low energy (0.4 and 0.6 keV) were used to ensure ultra shallow as implanted boron concentration profiles. Our aim is to achieve high electrical activation level of the dopant, while maintaining the Boron concentration profile as immobile as possible. Samples have been irradiated at a variety of annealing conditions regarding the duration of the irradiation and the power density; however, in every case the peak surface temperature was kept in the range of 1080–1320 °C. Sheet resistance measurements indicate significant enhancement in the activation levels, while chemical characterization by means of SIMS, shows very limited movement of the dopant …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Electrical behavior of memory devices based on fluorene-containing organic thin films",
            "Publication year": 2008,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2968551",
            "Abstract": "We report on switching and negative differential resistance (NDR) behaviors of crossed bar electrode structures based on Al/organic layer/Al devices in which the organic layer was a spin-coated layer of 7-{4-[5-(4-tert-butylphenyl)-1,3,4-oxadiazol-2-yl]phenyl}-9,9-dihexyl-N,N-diphenyl-fluoren-2-amine. The addition of gold nanoparticles (0.5wt%) did not change the switching behavior of thicker film structures; however, devices incorporating the nanoparticles showed more reproducible characteristics. In most cases, a “forming” process, in which a large positive voltage was applied to the top Al electrode, was required before the NDR and conductivity switching were observed. Three different electrical conductivity mechanisms have been identified: Poole–Frenkel conductivity in unformed structures, linear current versus voltage characteristics for the ON state in formed devices, and superlinear current versus voltage …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:kNdYIx-mwKoC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Atomic layer deposited Al2O3 thin films as humidity barrier coatings for nanoparticle-based strain sensors",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6528/aaddbe/meta",
            "Abstract": "Al 2 O 3 thin films deposited by atomic layer deposition on Pt nanoparticle-based strain sensors were studied as humidity barrier coatings for sensor protection. The effect of two deposition parameters—film thickness and growth temperature—is discussed in relation to an Al 2 O 3 coating's ability to isolate the nanoparticle surface and protect strain sensitivity from humidity variations. It is shown that transmission electron microscopy images cannot confirm the effective protection of a nanoparticle surface, thus x-ray photoelectron spectroscopy and electrical measurements have been employed. The existence of a critical thickness of the Al 2 O 3 protective film above which resistance and gauge factor variations are suppressed during humidity change was observed at different deposition temperatures. This ability is linked with the existence of incorporated pinholes and intrinsic hydroxyl groups in the Al 2 O 3 thin film …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:gVv57TyPmFsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Metal nano-floating gate memory devices fabricated at low temperature",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931706001365",
            "Abstract": "In this communication, we report on the realization of low-temperature processed Electrically Erasable Programmable Read-Only Memory (EEPROM) like device with embedded gold nanoparticles. The realization is based on the fabrication of a V-groove SiGe Metal Oxide Semiconductor Field Effect Transistor (MOSFET), the functionalization of a gate oxide followed by self-assembly of gold nanoparticles and finally, the deposition of an organic insulator by Langmuir–Blodgett (LB) technique. Such structures were processed at a temperature lower than 400 °C. The electrical characteristics of the final hybrid Metal Insulator Semiconductor FET (MISFET) memory cells were evaluated in terms of memory window and program/erase voltage pulses. A model describing the memory characteristics, based on the electronic properties of the gate stack materials, is presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Diffusivity measurements of silicon in silicon dioxide layers using isotopically pure material",
            "Publication year": 2001,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1371003",
            "Abstract": "We report measurement of the silicon diffusion coefficient in silicon dioxide films using isotopically enriched 28Si silicon dioxide layers that enable relatively low 30Si concentration measurements to be performed using secondary ion mass spectrometry. Two types of experiments are made. 30Si atoms are introduced in excess in a stoichiometric isotopically pure silicon dioxide layer either by ion implantation or by a predeposition technique. These experiments are representative of any physical situation in which excess silicon atoms are introduced into silicon dioxide layers during silicon processing. The estimated diffusivity values are significantly higher than previously reported values for Si diffusion within a stoichiometric oxide and closer to reported values for excess Si diffusion within an oxide. The activation energy of the diffusivity is found to be 4.74 eV.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:UeHWp8X0CEIC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Enhancing the synaptic properties of low-power and forming-free HfOx/TaOy/HfOx resistive switching devices",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931720301465",
            "Abstract": "The incorporation of a TaOy layer in a HfOx/TaOy/HfOx resistive switching memory stack results in low-power (~nW in pulsing mode) and forming-free operation. With this material configuration, we derive a stable memory window (~102), good cycling variability (σ/μ < 0.6) and robust pulse endurance (106). The switching phenomenon is confined in the TaOy layer because of its higher oxygen content and deeper oxygen vacancy levels in contrast to the surrounding HfOx layers that act as series resistances. This enables the manifestation of analog switching characteristics, sub-pJ energy consumption for both SET and RESET transitions, enhanced synaptic weight modulation, Spike-Timing-Dependent-Plasticity and short-term plasticity effects of our devices that play an important role in emulating the function of a biological synapse.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:jL-93Qbq4QoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Inorganic nanoparticles for either charge storage or memristance modulation",
            "Publication year": 2013,
            "Publication url": "https://www.scientific.net/AST.77.196",
            "Abstract": "We present prototype memory devices using metallic and metal oxide nanoparticles obtained by a physical deposition technique. The two memory device examples demonstrated concern the use of platinum nanoparticles for flash-type memories and the use of titanium oxide nanoparticles for resistive memories. Both approaches give interesting device memory properties with resistive memories being still in an early exploratory phase.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:eflP2zaiRacC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Structural Characterization of Layers for Advanced Non-volatile Memories",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16919-4_2",
            "Abstract": "                 Non-volatile memory cells                  are the devices with the most aggressive scaling on the market. For this reason the accurate characterization of their layer stacks is of great importance. We present a review of our recent work on a large variety of such stacks, for charge-trap and resistive memories, which have been characterized structurally with Transmission                                  Electron Microscopy                  and Conducting Atomic Force Microscopy                 ; we discuss the features of their structure on their function as memory elements.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:PVjk1bu6vJQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "SILICON CAPACITIVE PRESSURE SENSORS AND PRESSURE SWITCHES FABRICATED USING SILICON FUSION BONDING",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0054",
            "Abstract": "A simple single crystal silicon process for fabricating capacitive type pressure sensors and pressure switches is described. The process relies on silicon fusion bonding for the sealing of the pressure sensor cavity and device construction. The pressure sensor cavity is etched in a thick oxide, thus allowing freedom in cavity design. Pressure sensors and pressure switches have successfully been fabricated using this process. Results are presented of a capacitive type element operating in the medical pressure regime (0-300mmHg) with a sensitivity to pressure of 1.5 fF/mmHg or 305 ppm/mmHg, and of a pressure switch operating at 5 bar for use in truck tyres.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Radiation hardness of flash and nanoparticle memories",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vOqPDwAAQBAJ&oi=fnd&pg=PA211&dq=info:BKyPtvTVQRQJ:scholar.google.com&ots=jdCXOpH1PW&sig=gmiLDI_nY2kRUimH4G6cTWHPGck",
            "Abstract": "Recently, the research for new non-volatile memory in the semiconductor industry has become intense, because current flash memory technologies based on the floating-gate (FG) concept are expected to be difficult to scale down for high density, high performance devices (Lankhorst et al., 2005; Ouyang et al., 2004; Vanheusden et al., 1997). Therefore, a type of non-volatile memory using nanoparticles (NP) as floating gates has attracted much research attention because of its excellent memory performance and high scalability (Tiwari et al., 1996; Park et al., 2002). By utilizing discrete NP as the charge storage element, NP memory is more immune to local oxide defects than flash memory, thus exhibiting longer retention time and allowing more aggressive tunnel oxide scaling than conventional flash memory (Blauwe, 2002; Hanafi et al., 1996). In NP memory, the device performance and reliability depend on many factors, such as the ability to control NP size, size distribution, crystallinity, area density, oxide passivation quality, and the isolation that prevents lateral charge conduction in the NP layer (Ostraat et al., 2001). Thus, NP memory has driven extensive efforts to form NP acting as charging and discharging islands by various methods. Up to now, several techniques have been developed to form uniform NP in gate oxides. For example, Kim (Kim et al., 1999) employed low pressure chemical vapour deposition (LPCVD) to fabricate Si NP with a 4.5 nm average size and 5× 1011cm-2 average density. King (King et al., 1998) fabricated Ge NPs by oxidation of a SiGe layer formed by ion implantation, and demonstrated quasi-nonvolatile memory …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:UHK10RUVsp4C",
            "Publisher": "BoD–Books on Demand"
        },
        {
            "Title": "Recent advances in nanoparticle memories",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510705004897",
            "Abstract": "Nanoparticle memories have made their point during last years as a possible solution to overcome the scaling issue of electronic non-volatile memories. Ultimately, we are looking for nanoparticle memories to significantly decrease the voltage needed to write/erase the memory without compromising its retention characteristics. Several approaches have been reported for semiconductor nanoparticle formation using techniques such as chemical vapor deposition, molecular beam epitaxy or sputtering. In the present review emphasis is placed on a silicon nanoparticle memory resulting from low-energy ion implantation of silicon within a thin oxide layer and subsequent annealing. This process allows for the formation of a two-dimensional array of silicon nanoparticles within the gate oxide in one processing step making the process attractive for CMOS integration. Material issues related with ion implantation energy …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:roLk4NBRz8UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Oxygen and temperature effects on the electrochemical and electrochromic properties of rf-sputtered V2O5 thin films",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0013468617304085",
            "Abstract": "Vanadium pentoxide (V2O5) thin films grown by rf-sputtering have been studied as a function of two growth parameters, O2 content and substrate temperature, which influence importantly their structural, as well as their electrochemical and electrochromic properties. The increase in O2 content appears to result in an increase of the grain size of the films, while the increase in substrate temperature leads in platelets perpendicular to the substrate, which enhance the porosity of the films. Films with low O2 content (3%) and films grown at a substrate temperature of 300 °C, present enhanced charge storage properties of 553 mA h g−1 and large transmittance modulation ability. On the contrary, high O2 content (11%) and a substrate temperature of 150 °C lead to improved coloration efficiency (at λ = 400 nm), reaching values of 84.5 and ∼132 cm2C−1, respectively. These findings are discussed in terms of structural and …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:KbBQZpvPDL4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Unconventional Logic on Memristor-Based Oscillatory Medium",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9493412/",
            "Abstract": "Unconventional computing systems, inspired by nature’s mechanisms, provide new ways to efficiently perform several rather complex computations. Instead of the commonly used digital computing systems, a well-known unconventional approach is the utilisation of oscillating networks to execute computations. The rich dynamics of such networks can be exploited in nanoelectronic-scale by novel devices, like memristors that incorporate inherent memory features and computing capabilities. In this work, the threshold switching mechanism of low-voltage forming-free CBRAM devices is used to develop memristor-based oscillators, which are able to function as a medium for oscillation-based computations. Given the local diffusive coupling of the proposed memristor-based oscillators, the medium is capable of performing Boolean computations through oscillation interactions.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:7wO8s98CvbsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selective deposition of charged nanoparticles by self-electric focusing effect",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931708006163",
            "Abstract": "A process for the selective deposition of nanoparticles by a self-electric focusing effect is discussed. The negatively charged Nickel nanoparticles were fabricated by a DC magnetron sputtering system, and were deposited on a photoresist-patterned silicon substrate. Because of the different conductance between silicon and photoresist, the charges were accumulated on the photoresist as the nanoparticles were deposited, which caused a focusing electric field to drive the nanoparticles towards the silicon substrate. We have demonstrated that the self-focusing effect of the charged nanoparticles is responsible for increasing the density of nanoparticles in the lines patterned on silicon substrate by two orders of magnitude with respect to that on photoresist. The width of the silicon line and the width ratio between photoresist line and silicon line are the two most important parameters that will affect the self-focusing effect.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Understanding the SET/RESET Characteristics of Forming Free TiOx/TiO2‐x Resistive‐Switching Bilayer Structures through Experiments and Modeling",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781119242567.ch12",
            "Abstract": "This chapter contains sections titled:  Introduction Experimental Methodology Bipolar Switching Model RESET Simulations SET Simulations Simulation of Time‐dependent SET/RESET Processes Conclusions Acknowledgments  ",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:6ZxmRoH8BuwC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Room-temperature single-electron charging phenomena in large-area nanocrystal memory obtained by low-energy ion beam synthesis",
            "Publication year": 2002,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1470262",
            "Abstract": "We investigated the dependence of implantation dose on the charge storage characteristics of large-area n-channel metal–oxide–semiconductor field-effect transistors with 1-keV Si+-implanted gate oxides. Gate bias and time-dependent source–drain current measurements are reported. Devices implanted with 1×1016 cm−2 Si dose exhibit a continuous (trap-like) charge storage process under both static and dynamic conditions. In contrast, for 2×1016 cm−2 implanted devices, electrons are stored in Si nanocrystals in discrete units at low gate voltages, as revealed by a periodic staircase plateau of the source–drain current with a low gate voltage sweep rate, and the step-like decrease of the time-dependent monitoring of the channel current. These observations of room-temperature single-electron storage effects support the pursuit of large-area devices operating on the basis of Coulomb blockade phenomena.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:IjCSPb-OGe4C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Nanocrystals manufacturing by ultra-low-energy ion-beam-synthesis for non-volatile memory applications",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168583X03021517",
            "Abstract": "An overview of recent developments regarding the fabrication and structure of thin silicon dioxide films with embedded nanocrystals through ultra-low-energy ion-beam-synthesis (ULE-IBS) is presented. Advances in fabrication, increased understanding of structure formation processes and ways to control them allow for the fabrication of reproducible and attractive silicon-nanocrystal memory devices for a wide-range of memory applications as herein demonstrated in the case of low-voltage EEPROM-like applications.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:eQOLeE2rZwMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Gold Langmuir-Blodgett deposited nanoparticles for non-volatile memories",
            "Publication year": 2004,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/gold-langmuirblodgett-deposited-nanoparticles-for-nonvolatile-memories/5B9FEF4CE67520666FC254FF92DD05C2",
            "Abstract": "In this work, we demonstrate a MISFET memory device that incorporates a monolayer of Langmuir-Blodgett (LB) deposited gold nanoparticles as floating gate charge storage elements. The FET device is fabricated on a SOI substrate using conventional silicon processing. The nanoparticle layer is separated from the channel area of the FET with a 5 nm thermal SiO2 layer and is isolated from Al gate contact with a LB-deposited organic insulator layer. The memory effect is tested using voltage pulses on the gate of the device and monitored through drain current measurements. The nanocrystals can be charged either from the channel through the thermal oxide layer by applying pulses smaller than 5 V or from the gate through the organic insulator for higher voltage depending on the pulse duration.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Investigation of the influence of a dislocation loop layer on interstitial kinetics during surface oxidation of silicon",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168583X00004791",
            "Abstract": "In this work we investigate how the presence of a dislocation loop layer affects the surface interstitial supersaturation during thermal oxidation of silicon. To address this issue we created, using the silicon wafer bonding technique, a dislocation loop layer at different distances from the surface. The results show a linear dependence of the injection flux of interstitials with the inverse of the distance of the loop layer from the surface and also that the presence of the layer does not affect the surface interstitial supersaturation. This conclusion enables the reliable use of the dislocation loops as point defect detectors.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ZHo1McVdvXMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Material and Device Parameters Influencing Multi-Level Resistive Switching of Room Temperature Grown Titanium Oxide Layers",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1557/opl.2015.84",
            "Abstract": "We present a detailed study of memory performance of titanium oxide (TiO2-x)-based resistive switching memories by modifying critical parameters of the films involved in the memory stack grown by reactive sputtering at room temperature. The device includes a Ti nanolayer at the Au/TiO2-x interface and it is defined by the following material stack: Au/Ti/TiO2-x/Au/SiO2/Si. We investigate the memory performance optimization of the device in terms of the Ti nanolayer thickness using as a starting point for the TiO2-x growth conditions these identified by varying the ratio of oxygen concentration to argon concentration by our previous results. Due to the superb ability of Ti to absorb oxygen atoms from the dielectric matrix, a large amount of oxygen vacancies is created, which are crucial for the stable function of the memory devices. We observe the existence of an optimum Ti thickness that if further increased …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:5qfkUJPXOUwC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Nanoparticles for charge storage using hybrid organic inorganic devices",
            "Publication year": 2008,
            "Publication url": "https://www.scientific.net/AST.54.451",
            "Abstract": "We present a concept for integration of low temperature fabricated memory devices in a 3-D architecture using a hybrid silicon-organic technology. The realization of electrically erasable read-only memory (EEPROM) like device is based on the fabrication of a V-groove SiGe MOSFET, the functionalization of a gate oxide followed by self-assembly of gold nanoparticles and finally, the deposition of an organic insulator by Langmuir-Blodgett (LB) technique. Such structures were processed at a temperature lower than 400 C following a process based on wafer bonding. The electrical characteristics of the final hybrid MISFET memory cells were evaluated in terms of memory window and program/erase voltage pulses. A model describing the memory characteristics, based on the electronic properties of the gate stack materials, is presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:HE397vMXCloC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Resistive crack-based nanoparticle strain sensors with extreme sensitivity and adjustable gauge factor, made on flexible substrates",
            "Publication year": 2021,
            "Publication url": "https://pubs.rsc.org/en/content/articlehtml/2021/nr/d0nr07002e",
            "Abstract": "In this paper, we report the demonstration of highly sensitive flexible strain sensors formed by a network of metallic nanoparticles (NPs) grown under vacuum on top of a cracked thin alumina film which has been deposited by atomic layer deposition. It is shown that the sensor sensitivity depends on the surface density of NPs as well as on the thickness of alumina thin films that can both be well controlled via the deposition techniques. This method allows reaching a record strain sensitivity value of 2.6 × 108 at 7.2% strain, while exhibiting high sensitivity in a large strain range from 0.1% to 7.2%. The demonstration is followed by a discussion enlightening the physical understanding of sensor operation, which enables the tuning of its performance according to the above process parameters.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:v1_lew4L6wgC",
            "Publisher": "Royal Society of Chemistry"
        },
        {
            "Title": "Platinum nanoparticle chemical sensors on polyimide substrates",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705812043263",
            "Abstract": "A gas sensor formed by a Platinum (Pt) nanoparticle film and a poly(2-hydroxyethyl methacrylate) (PHEMA) polymer layer is discussed in this paper. The Platinum nanoparticles which have been produced by a modified magnetron sputtering technique are deposited on flexible polyimide substrate. The substrate has been initially patterned with gold interdigitated electrodes (IDEs). A second layer of PHEMA polymer has been delivered on top of the Pt nanoparticles using an ink-jet micro printer. By taking advantage of PHEMA's known susceptibility in alcohol or humidity vapors, chemical gas sensors of varying sensitivity can be produced by controlling the nanoparticle deposition time. As a result an inexpensive alternative to gas sensors using conventional silicon technology can be realized.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:35r97b3x0nAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Silicon self-diffusivity measurement in thermal  by  isotopic exchange",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1589168",
            "Abstract": "Isotopic exchange is used to measure the silicon self-diffusivity in thermal silicon dioxide. The experiments, using an isotopically enriched 28Si oxide layer, are specially designed to obtain the actual equilibrium diffusivity in the oxide. A simple Arrhenius law, with an activation energy of 5.34 eV, very nicely describes the measured diffusivities as a function of the temperature. Our values are compared with literature data, and we discuss the possible origin of the observed differences.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:YsMSGLbcyi4C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Vectorial strain gauge method using single flexible orthogonal polydimethylsiloxane gratings",
            "Publication year": 2016,
            "Publication url": "https://www.nature.com/articles/srep23606",
            "Abstract": "A vectorial strain gauge method using a single sensing element is reported based on the double-sided polydimethylsiloxane (PDMS) Fraunhofer diffraction gratings structures. Using O 2 plasma treatment steps, orthogonal wrinkled gratings were fabricated on both sides of a pre-strained PDMS film. Diffracted laser spots from this structure have been used to experimentally demonstrate, that any applied strain can be quantitatively characterized in both the x and y directions with an error of less than 0.6% and with a gauge factor of approximately 10. This simple and low cost technology which is completely different from the traditional vectorial strain gauge method, can be applied to surface vectorial strain measurement and multi-axis integrated mechanical sensors.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:8d8msizDQcsC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Diffusion and activation of phosphorus in germanium",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1369800108000656",
            "Abstract": "In this work we investigate the diffusion and the activation behavior of implanted phosphorus in Ge. We used both conventional thermal processing as well as laser annealing by pulsed ns Nd–YAG laser. Chemical profiles were obtained by secondary-ion-mass spectrometry (SIMS) and sheet resistance was estimated by Van der Pauw method. These measurements demonstrated a box-shaped dopant profile for both conventional and laser annealed samples which are in agreement with other research reports indicating enhanced dopant diffusivity. From these experiments and critical comparison with other studies we conclude about the value of the intrinsic diffusion coefficient and we discuss the validity of the doubly charged vacancy model in simulating our experiments. To more accurately account for these parameters we have also implemented a pileup and a segregation model to simulate the dopant loss due …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Sensitivity investigations of surface stress capacitive DNA sensor",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5690309/",
            "Abstract": "Investigations of the sensitivity and selectivity of a capacitive type biosensor array, consisting of a total of 256 biosensing elements, in the detection of single oligonucleotide mutations is presented. The biosensor takes advantage of surface stress changes during biological interactions and is able to translate them into a capacitive signal. The array is organized in a 16×16 matrix of distinct biosensing elements thus allowing for the concurrent sensing of multiple biological targets. In this work the sensing elements of the array are spotted with three different oligonucleotides (CD8, CD17 and CD19) and their hybridization is detected using 36nM PCR. Moreover tests with CD19 revealed the ability of the biosensor to detect the hybridization of the oligo with sample concentrations of 36, 18 and 9nM.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fabrication of single crystal Si cantilevers using a dry release process and application in a capacitive-type humidity sensor",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931702004483",
            "Abstract": "A process is presented for the fabrication of suspended silicon microstructures, such as cantilevers and open type membranes, constituting the movable plate of a capacitor at a small distance over the silicon substrate. The process relies on the silicon fusion bonding of two wafers and features dry release of the suspended silicon structures at the final stage of the process, as a step to prevent stiction. With the addition of a hydrophilic polymer film on the Si cantilevers, a capacitive type humidity sensor is fabricated; the moisture-dependent bending of the microcantilever reflects on the measured capacitance between the microcantilever and substrate.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Formation of 2-D arrays of semiconductor nanocrystals or semiconductor-rich nanolayers by very low-energy Si or Ge ion implantation in silicon oxide films",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168583X01004955",
            "Abstract": "The structure evolution of annealed low-energy Si- or Ge-implanted thin and thick SiO2 layers is studied. The majority of Si (or Ge) species is restricted within a 3–4 nm thick layer. Si is able to separate and crystallize more easily than Ge. The glass transition temperature of the as-implanted structure has a significant effect on the progress of phase transformations accompanying annealing.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:_FxGoFyzp5QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "SILICON NANOPHOTONICS: BASIC PRINCIPLES, PRESENT STATUS, AND PERSPECTIVES",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=14808191004138183116&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:1lhNe0rCu4AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Materials science issues for the fabrication of nanocrystal memory devices by ultra low energy ion implantation",
            "Publication year": 2006,
            "Publication url": "https://www.scientific.net/ddf.258-260.531",
            "Abstract": "Nanocrystal memories are attractive candidate for the development of non volatile memory devices for deep submicron technologies. In a nanocrystal memory device, a 2D network of isolated nanocrystals is buried in the gate dielectric of a MOS and replaces the classical polysilicon layer used in floating gate (flash) memories. Recently, we have demonstrated a route to fabricate these devices at low cost by using ultra low energy ion implantation. Obviously, all the electrical characteristics of the device depend on the characteristics of the nanocrystal population (sizes and densities) but also on their exact location with respect to the gate and channel of the MOS transistor. It is the goal of this paper to report on the main materials science aspects of the fabrication of 2D arrays of Si nanocrystals in thin SiO2 layers and at tunable distances from their SiO2/interfaces.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Highly Flexible Artificial Synapses from SiO2-Based Conductive Bridge Memristors and Pt Nanoparticles through a Crack Suppression Technique",
            "Publication year": 2021,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/acsaelm.1c00302",
            "Abstract": "The growth of flexible memory devices with intrinsic neuromorphic properties is attracting tremendous attention due to the wide spread of wearable electronics. The fabrication of robust artificial synaptic structures that will have the ability to remain operational after various strain loads and perform artificial synaptic weight modulation procedures is considered the cornerstone for the development of wearable neuromorphic computing systems. Along these lines, a low-temperature Ag/SiO2/TiN memristive device is demonstrated on a polyethylene naphthalate substrate decorated with Pt nanoparticles (NPs) with a 5 nm average diameter. The memory devices are completely forming-free, operate at a low voltage of 500 mV, and exhibit great stability after bending numerous times under a record high mechanical strain of 4.16% without any severe degradation of the pulse endurance and retention capabilities. Concrete …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:IaI1MmNe2tcC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Plasma induced degradation and surface electronic structure modification of Poly (3-hexylthiophene) films",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141391017303774",
            "Abstract": "Plasma treatment is an environmentally friendly solution for modifying or nanostructuring the surface of several materials including photoactive polymers. The detailed characterization of the effect of plasma treatment on chemical and optoelectronic properties of photoactive polymers is, therefore, of specific interest. Herein, the effect of the exposure of poly(3-hexylthiophene) (P3HT) thin films to plasma created in three different gases (oxygen, argon and hydrogen) was studied. A range of spectroscopic techniques, such as x-ray (XPS) and ultraviolet (UPS) photoelectron spectroscopy in conjunction with UV–vis absorption, Fourier transform infrared (FTIR) and photoluminescence (PL) spectroscopies, are employed to quantify the extent of chemical modification occurring in each particular case. It is shown that oxygen plasma treatment leads to the disruption of the π-conjugation via the direct oxidation of the sulfur …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:u-coK7KVo8oC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Forming-free resistive switching memories based on titanium-oxide nanoparticles fabricated at room temperature",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4775760",
            "Abstract": "In this work, we present symmetric metal-insulator-metal bipolar memristors based on room-temperature deposition of charged titanium-oxide nanoparticles formed in vacuum by a physical process. One of the most striking features of these devices is that they do not require a forming step, which is to be related to protrusions of the top electrode material inside the intrinsically porous nanoparticle films. Furthermore, we report that deposition under substrate biasing conditions strongly affects the structural and electrical properties of the produced titanium oxide nanoparticle films including their bipolar switching behaviour.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:uc_IGeMz5qoC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Chemi-resistive sensors based on platinum nanoparticle arrays",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705811059479",
            "Abstract": "The design and implementation of a chemi-resistor sensor utilizing platinum nanoparticles and a poly(2-hydroxyethyl methacrylate) (PHEMA) polymer layer is presented. The sensor was fabricated utilizing a magnetron sputtering system for the gas phase synthesis of metallic nanoparticles and an ink-jet printer for the PHEMA polymer delivery. The platinum nanoparticles have been deposited on oxidized silicon substrates which have been previously patterned with gold interdigitated electrodes. Following the nanoparticles deposition a PHEMA polymer layer has been delivered on top, using the ink-jet printing technique. By controlling the density of the metal nanoparticle film, sensors of different sensitivity can be fabricated.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:dQ2og3OwTAUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Size and aerial density distributions of Ge nanocrystals in a SiO 2 layer produced by molecular beam epitaxy and rapid thermal processing",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-004-2924-3",
            "Abstract": "We discuss the distribution of size and aerial density of Ge nanocrystals in a metal-oxide-semiconductor (MOS) memory structure fabricated by molecular beam epitaxy combined with rapid thermal processing; the size and aerial density of Ge nanocrystals are controlled by varying the thickness of the deposited Ge layer and the processing time. Variation of tunnel oxide thickness is demonstrated with the extension of the processing time. The effect of processing time and tunnel oxide thickness on the electrical properties of the MOS structures is investigated by high frequency capacitance–voltage measurements. ",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Monte Carlo simulation of multi-band carrier transport in semiconductor materials with complex unit cells",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7091-6244-6_46",
            "Abstract": "In a traditional Monte Carlo (MC) model the carrier preserves its band identity during the free flight between scatterings. However, this assumption may not be valid in semiconductor materials with complex unit cell. A new model is needed where the traditional way to use classical equations during the free flight between scattering is replaced by a fully quantum mechanical model of the Bloch carrier dynamics between scattering events. In this work we present such a model along with simulated results of the hole initiated impact ionization coefficients of 4H-SiC.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:f2IySw72cVMC",
            "Publisher": "Springer, Vienna"
        },
        {
            "Title": "Influence of oxygen content of room temperature TiO2−x deposited films for enhanced resistive switching memory performance",
            "Publication year": 2014,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4862797",
            "Abstract": "In this work, we demonstrate that TiO2−x based Resistive Random Access Memory devices can function without an initial electroforming process and a wide range of switching ratios could be achieved by controlling the oxygen content, the compliance current, the sweep bias amplitude, and the width of the voltage pulse applied on the memory cell. The influence of deposition ambient and more particularly of oxygen flux during thin film sputtering at room temperature to the resistive properties of titanium oxide will be discussed in detail. By controlling the density of oxygen vacancies into the dielectric matrix, we can also improve the repeatability and the operation of the device, in terms of distribution of the SET/RESET voltages. We propose that ultra high density of vacancies deteriorate the switching phenomenon, whereas high vacancy density results in better switching behavior. Moreover, we conclude that the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:KUbvn5osdkgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Capacitive-type chemical sensors using thin silicon/polymer bimorph membranes",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400504002631",
            "Abstract": "Capacitive-type chemical sensing devices based on a silicon/polymer bimorph structure have been fabricated and evaluated. Upon exposure to analytes, the polymer covering the thin silicon membrane swells, inducing a deflection on the membrane, which is measured as a capacitance change between membrane and substrate. Five different polymer layers [poly-hydroxy-ethyl-methacrylate (PHEMA), poly-methyl-methacrylate (PMMA), poly-vinyl-acetate (PVAc), epoxydized novolac (EPN) and poly-dimethylsiloxane (PDMS)] were used. Exposure to water, methanol and ethanol vapors was used for evaluating performance. Sensitivities ranging from 4.5 fF/%RH for PDMS to 29 fF/%RH for PHEMA-covered devices are reported. Devices covered with PHEMA, PVAc and PMMA also exhibit strong response upon exposure to methanol and ethanol atmospheres.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "High strain sensitivity controlled by the surface density of platinum nanoparticles",
            "Publication year": 2012,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/23/28/285501/meta",
            "Abstract": "We report a controllable strain gauge factor obtained using a two-dimensional nanoparticle layer formed from platinum nanoparticles. A vacuum technique is used for room temperature nanoparticle deposition that allows control of the electrical resistance of the film, exhibiting semiconducting-like behavior when nanoparticle arrays cover the surface below a threshold value while above it a metallic behavior is prevalent. The highest sensitivity is obtained for intermediate density values of the nanoparticle assemblies, which could be explained using a tunneling and hopping current expression. The device, which exhibits more than one order of magnitude higher strain sensitivity than continuous metallic films, is fabricated at room temperature through standard lithographic processing allowing for miniaturization and easy integration in silicon technology or flexible substrates.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:Fu2w8maKXqMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Fabrication of gold nanoparticle lines based on fracture induced patterning",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931709000598",
            "Abstract": "We present a low cost method for the selective deposition of gold nanoparticles from a gold colloid. We first introduce a process of maskless patterning on a photoresist layer. With this process, we have fabricated photoresist gratings with a period from 1 to 30 μm, using the fracture induced patterning technique. Then we have performed gold nanoparticle deposition on this patterned surface by a surface functionalization technique. For that purpose, silicon dioxide (SiO2) was deposited on the sample followed by a lift-off process. The remained SiO2 lines after the lift-off were functionalized with 2,3-aminopropyltrimethoxysilane (APTMS) for the selective deposition of the gold colloid. After the deposition, the gold nanoparticles are well organized on top of the SiO2 line patterns.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Emulating artificial neuron and synaptic properties with SiO2-based memristive devices by tuning threshold and bipolar switching effects",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6463/abea3b/meta",
            "Abstract": "The implementation of neuromorphic computations within a fully memristive neural network is considered the holy grail of the artificial intelligence era. In order to attain this goal, it is quite important to develop robust and configurable electronic devices capable of emulating spiking neuronal and synaptic plasticity activities. Along these lines, we report here the direct impact of oxygen concentration as well as of the homo-bilayer material configuration of SiO 2-conductive bridge memories to the manifestation of tunable threshold and bipolar switching effects. Interestingly, while the bilayer structure of Ag/SiO x/SiO y/TiN (x< y) exhibits only bipolar switching effect, the respective single-layer structures of Ag/SiO y/TiN and Ag/SiO x/TiN operate under either threshold switching or both modes. Insights regarding the impact of oxygen concentration into the conducting filament growth process are provided. The manifestation …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:LdasjJ6CEcoC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "MOS memory structures by very-low-energy-implanted Si in thin SiO2",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510702006888",
            "Abstract": "The electrical characteristics of thin silicon dioxide layers with embedded Si nanocrystals obtained by low-energy ion beam implantation and subsequent annealing have been investigated through capacitance and current–voltage measurements of MOS capacitors. The effects of the implantation energy (range: 0.65–2 keV), annealing temperature (950–1050 °C) and injection oxide characteristics on charge injection and storage are reported. It is shown that the implantation energy allows for a fine control of the memory window characteristics, and various device options are possible including memory operation with charge injection at low gate voltages.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Label-free DNA biosensor based on resistance change of platinum nanoparticles assemblies",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0956566316302202",
            "Abstract": "A novel nanoparticle based biosensor for the fast and simple detection of DNA hybridization events is presented. The sensor utilizes hybridized DNA's charge transport properties, combining them with metallic nanoparticle networks that act as nano-gapped electrodes. The DNA hybridization events can be detected by a significant reduction in the sensor's resistance due to the conductive bridging offered by hybridized DNA. By modifying the nanoparticle surface coverage, which can be controlled experimentally being a function of deposition time, and the structural properties of the electrodes, an optimized biosensor for the in situ detection of DNA hybridization events is ultimately fabricated. The fabricated biosensor exhibits a wide response range, covering four orders of magnitude, a limit of detection of 1 nM and can detect a single base pair mismatch between probe and complementary DNA.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:FAceZFleit8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Thin Film Protected Flexible Nanoparticle Strain Sensors: Experiments and Modeling",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/706114",
            "Abstract": "In this work, the working performance of Platinum (Pt), solvent-free nanoparticle (NP)-based strain sensors made on a flexible substrate has been studied. First, a new model has been developed in order to explain sensor behaviour under strain in a more effective manner than what has been previously reported. The proposed model also highlights the difference between sensors based on solvent-free and solvent-based NPs. As a second step, the ability of atomic layer deposition (ALD) developed Al 2 O 3 (alumina) thin films to act as protective coatings against humidity while in adverse conditions (ie, variations in relative humidity and repeated mechanical stress) has been evaluated. Two different alumina thicknesses (5 and 11 nm) have been tested and their effect on protection against humidity is studied by monitoring sensor resistance. Even in the case of adverse working conditions and for increased mechanical strain (up to 1.2%), it is found that an alumina layer of 11 nm provides sufficient sensor protection, while the proposed model remains valid. This certifies the appropriateness of the proposed strain-sensing technology for demanding applications, such as e-skin and pressure or flow sensing, as well as the possibility of developing a comprehensive computational tool for NP-based devices. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:4xDN1ZYqzskC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Electronic memory device based on a single-layer fluorene-containing organic thin film",
            "Publication year": 2007,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2783481",
            "Abstract": "The authors report on a simple bistable switching device based on a thin film of an electroactive polymer containing a fluorene group sandwiched between aluminum electrodes. No additional materials (e.g., metallic or semiconductive nanoparticles) are required for the devices to operate. This improves considerably the scalability of the memory elements at nanometer dimensions. The device operation is thought to depend on charge trapping at fluorenone defects within the organic film.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:LkGwnXOMwfcC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Nitrogen distribution during oxidation of low and medium energy nitrogen-implanted silicon",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168583X03021281",
            "Abstract": "In this work, we performed a systematic study of the influence of nitrogen implantation energy on the final nitrogen distribution and on the growth of thin and ultrathin oxides formed by oxidation of nitrogen-implanted silicon. Nitrogen was implanted in a wide range of energies (3–150 keV) and oxidations were performed for various temperatures (800–900 °C) and times (30 min–4 h). We observe that the amount of nitrogen remaining within the oxides decreases as the implantation energy decreases and nitrogen is located closer to the silicon surface, due to more effective out-diffusion.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:sSrBHYA8nusC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Heavy metal ion detection using DNAzyme-modified platinum nanoparticle networks",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400516313211",
            "Abstract": "Utilizing the sputtering technique, platinum nanoparticles of 5 nm in diameter have been deposited on top of oxidized silicon substrates. The nanoparticle layer has been subsequently functionalized with DNAzymes that are known to self-cleave in the presence of lead (Pb2+) ions. The resulting device has proven to operate as an environmental monitoring sensor for the detection of lead ions down to concentrations of 10 nM, having good reproducibility and stability. The conductive bridging of the DNAzymes that facilitates charge transport between discreet nanoparticles “collapses” due to their self-cleavage upon exposure to lead ions, leading to a shift in the measured resistance of the sensor.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:4hFrxpcac9AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Flexible polyimide chemical sensors using platinum nanoparticles",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400513000634",
            "Abstract": "Platinum nanoparticles without any prior chemical modification and poly(2-hydroxyethyl methacrylate) (PHEMA) have been employed as the transducing and gas sensitive layer respectively for this flexible chemical sensing application. Using a modified magnetron sputtering technique, gas phase platinum nanoparticles have been deposited on top of flexible polyimide substrates. The surface density of such nanoparticle films can be controlled via the overall deposition time, producing devices of varying conductivity. A layer of PHEMA polymer (500–700 nm thick) has been ink-jet printed on top of the nanoparticle film finalizing the sensor's fabrication. By exposing the sensor in ethanol or humidity vapors a change in the film's resistance or capacitance is observed facilitating the detection of such gases. The performance of these sensors has been connected with the nanoparticle film resistance.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:zLWjf1WUPmwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Resistive switching memory using titanium-oxide nanoparticle films",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6343382/",
            "Abstract": "In this work we present symmetric metal-insulator-metal bipolar memristors based on room-temperature deposition of titanium-oxide nanoparticles (TiO NPs) formed in vacuum by a physical process. We report that deposition under substrate biasing conditions strongly affects the structural and electrical properties of the produced TiO-NP films including their bipolar switching behaviour. The application of an external electric field during deposition enhances the mean size and oxygen content of the TiO NPs as well as the high-to-low resistance (HLR) ratio of the memristive films. Under the substrate-biasing deposition conditions examined so far, we successfully achieved bistable devices with a HLR ratio increased by two orders of magnitude compared to devices using TiO-NP films formed without electric-field assisted NP deposition.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special issue on\" Micro/Nano Devices and Systems 2015\"",
            "Publication year": 2016,
            "Publication url": "https://research.tudelft.nl/en/publications/editorial-special-issue-on-micronano-devices-and-systems-2015",
            "Abstract": "Editorial: Special issue on \"Micro/Nano Devices and Systems 2015\" — TU Delft Research \nPortal Skip to main navigation Skip to search Skip to main content TU Delft Research Portal \nLogo Help & FAQ Home Researchers Research Units Research output Activities Datasets \nPress / Media Prizes Projects Search by expertise, name or affiliation Editorial: Special issue \non \"Micro/Nano Devices and Systems 2015\" R Wiegerink, Urs Staufer, D Tsoukalas Micro and \nNano Engineering Research output: Contribution to journal › Editorial › Professional Overview \nOriginal language English Pages (from-to) A1 Journal Microelectronic Engineering Volume \n159 DOIs https://doi.org/10.1016/j.mee..Publication status Published - 2016 Event 41st Micro \nand Nano Engineering conference MNE 2015 - The Hague, The Netherlands Duration: 21 Sep \n0215 → … Access to Document 10.1016/j.mee..Cite this APA Author BIBTEX Harvard RIS , …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:nVrZBo8bIpAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "MOS memory devices based on silicon nanocrystal arrays fabricated by very low energy ion implantation",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S092849310100251X",
            "Abstract": "The electrical characteristics of Si nanocrystal-based MOS memory devices are studied. The nanocrystals are fabricated into 8-nm thin oxide by very low energy Si+ implantation at different doses and subsequent annealing. TEM work suggests that Si nanocrystals develop at a density, size and perfection that vary strongly with the implanted dose and these structural features are found compatible with the device transfer characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Field effect devices with metal nanoparticles integrated by langmuir–blodgett technique for non-volatile memory applications",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/015/meta",
            "Abstract": "In this work, we demonstrate a hybrid silicon-organic nanocrystal floating gate memory device combining organic insulating materials, metal nanoparticles and Si MOSFET. The nanocrystals were organically passivated gold nanoparticles (Au-nps) forming a monolayer which was deposited by Langmuir–Blodgett (LB) technique. The FET device is fabricated on a Silicon-on-Insulator (SOI) substrate using conventional silicon processing. The nanoparticle layer is separated from the channel area of the FET with a 5 nm thermal SiO 2 film and is isolated from the Al gate contact with a LB-deposited organic insulator layer. The memory effect is tested by means of threshold voltage shift measurements under different program/erase pulses. The nanocrystals can be charged either from the channel through the thermal oxide layer or from the gate through the organic insulator depending on the pulse applied pulse …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:mB3voiENLucC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Laser printing of Au nanoparticles with sub-micron resolution for the fabrication of monochromatic reflectors on stretchable substrates",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399220312937",
            "Abstract": "Laser Induced Forward and Backward Transfer (LIFT and LIBT) have emerged as direct nano- and micro-fabrication technologies allowing the digital and controllable printing of a large variety of materials for components with flexible and stretchable form factors. Further advancements on the achievement of very challenging metal/ polymer interfaces can be enabled by employing combinational schemes comprising the best features of direct printing methods and conventional nano-fabrication technologies. This work is a demonstration of the combination of LIFT and LIBT with e-beam and nano-imprint lithography for the fabrication of a narrowband, strongly reflecting surface comprising highly ordered square arrays of Au nanoparticles embedded within Polydimethylsiloxane substrates. The transferred nanoparticle diameters range from 150 to 300 nm and the array pitch is in the order of 500 nm, enabling resonance …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:jgBuDB5drN8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Foreward: Solid-State Electronics",
            "Publication year": 2010,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/37888",
            "Abstract": "Foreward: Solid-State Electronics Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό \nΑποθετήριο → Δημοσιεύσεις μελών ΔΕΠ→ Εμφάνιση Τεκμηρίου HEAL DSpace Foreward: \nSolid-State Electronics Αποθετήριο DSpace/Manakin Foreward: Solid-State Electronics \nDimoulas, A; Tsoukalas, D URI: http://hdl.handle.net/123456789/37888 Ημερομηνία: 2010 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή \nΔεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην \nακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠΠεριήγηση Σε όλο το DSpace Κοινότητες & \nΣυλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία \nΕκδοσης Συγγραφείς Τίτλοι Θέματα Ο Λογαριασμός μου Σύνδεση Εγγραφή Οδηγίες / Βοήθεια \nΟδηγίες Υποβολής Οδηγίες Χρήσης ΙΑ Συχνές Ερωτήσεις Οδηγίες Υποβολής - Διπλωματικές /- …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:uDGL6kOW6j0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-melt laser annealing of plasma implanted boron for ultra shallow junctions in silicon",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510708003772",
            "Abstract": "In this work we present results on sub-melt Excimer laser annealing in order to obtain difussionless activation of Boron for the creation of ultra shallow P-MOS devices. For the fulfillment of the strict requirements imposed by the ITRS roadmap for the 32 nm node we have implemented two emerging techniques: non-melt laser annealing and BF3 Plasma Doping implantation (PLAD). By using PLAD, we were able to create ultra shallow and abrupt as implanted profiles. On the other hand, by performing laser annealing on the samples in the sub-melt regime, we can achieve high levels of electrical activation, while practically eliminating Boron diffusion, due to its capability to deliver low thermal budget in the sub-microsecond time scale. An Excimer KrF laser (λ = 248 nm and pulse duration 38 ns) has been used. The post annealing characterization of the samples included SIMS and Van Der Pauw Sheet resistance …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:rO6llkc54NcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A new masking method for protecting silicon surfaces during anisotropic silicon wet etching",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931702005105",
            "Abstract": "A room-temperature silicon masking approach based on the exposure of silicon to CHF3-based plasma is explored. This plasma treatment leads to ultra-thin (2–5 nm) films that consist of a fluorocarbon top layer and a sub-oxide lower layer and are appropriate for anisotropic wet etching masks. The mask resistance to anisotropic wet-etchants is studied as a function of film preparation parameters. Defect evolution is examined for two key film preparation conditions. Masks explored compare favourably with common masking materials such as SiO2 or Si3N4 in terms of achievable patterns and processing options compatible with standard silicon integrated circuit technology. In addition, the new masking method can be applied when sidewall-only wet etching of mesa patterns is desired.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:nrtMV_XWKgEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Coexistence of bipolar and threshold resistive switching in TiO2 based structure with embedded hafnium nanoparticles",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6463/aa5161/meta",
            "Abstract": "The coexistence of nonvolatile memory switching and volatile threshold switching in a single device is of importance for suppressing the sneak-path currents in crossbar resistive memory architectures. This study demonstrates that the combination of a thin film of TiO 2 with hafnium nanoparticles in Au/Ti/TiO 2/Hf nanoparticles/Au device configuration enables conversion between memory switching and volatile threshold switching by adjusting the current compliance through the materials stack. The presence of hexagonal closed packed Hf nanoparticles, a synthesis of which has not been reported before, is critical for the device operation that exhibits beneficial features as it is forming free and operates at low voltage and power consumption. Analysis of measured current–voltage (I–V) characteristics reveal a filamentary nature of switching phenomena and present operating similarities with electrochemical …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:yFnVuubrUp4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "PHEMA functionalization of gold nanoparticles for vapor sensing: Chemi-resistance, chemi-capacitance and chemi-impedance",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400511001833",
            "Abstract": "A chemical sensor fabricated from gold nanoparticles and poly(2-hydroxyethyl methacrylate) (PHEMA) is presented and its chemi-resistive, chemi-capacitive and chemi-impedance performance is investigated. Detection of humidity and ethanol in the range of 2000–20,000 ppm has been made possible in all the above cases. The sensor was fabricated following a two step process utilizing ink-jet printing to deliver both nanoparticles and PHEMA on oxidized silicon substrates: first a layer of nanoparticles has been delivered on top of gold interdigitated electrodes followed by the successive deposition of PHEMA polymer. By controlling several key design parameters such as nanoparticle size, number of ink-jet printed gold nanoparticles and electrode spacing, the fabrication of chemical sensors with different sensing response and linearity is possible.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Tuning Resistive, Capacitive, and Synaptic Properties of Forming Free TiO2‐x‐Based RRAM Devices by Embedded Pt and Ta Nanocrystals",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.201700440",
            "Abstract": "The incorporation of metal nanocrystals (NCs) within TiO2‐x thin films offers great advantages for adjusting a wide range of non‐volatile memory properties, ranging from resistive and capacitive switching to synaptic capabilities. In this study, it is demonstrated that by inserting very small NCs (≈3 nm diameter) of either Pt or Ta, resistance changes over six orders of magnitude and capacitance changes over two orders of magnitude can be induced, with promising variability due to the local enhancement of the electric field effect, while these effects are attributed to the energy band diagram configuration induced by the presence of NCs. The gradual switching pattern observed exhibits also attractive synaptic properties, offering higher design flexibility for neuromorphic applications.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:nZcligLrVowC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiments and simulation on diffusion and activation of codoped with arsenic and phosphorous germanium",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3456998",
            "Abstract": "We report arsenic and phosphorus diffusion experiments and activation related phenomena in codoped germanium substrates utilizing conventional thermal annealing. Chemical profiles were obtained by secondary ion mass spectroscopy, sheet resistance was estimated by the Van der Pauw method. Our study covers the temperature range from 600 to 750 °C. We accurately described the dopant profiles with a quadratic dependence of the dopants diffusion coefficient on the free electron concentration. In our simulations we considered the dopant pile-up near the surface and dopant loss owing to outdiffusion during the annealing. Although the double donor codoping technique exhibited no advantage over monodoping with P concerning the level of activation and junction depth, it was interesting to observe the different diffusion behavior of the two dopants. Whereas the diffusion of As indicates a retardation under …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:isC4tDSrTZIC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Impact of Active Electrode on the Synaptic Properties of SiO2-Based Forming-Free Conductive Bridge Memory",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9361415/",
            "Abstract": "The influence of active top electrode (TE) material is thoroughly investigated in order to shed light into the manifestation of various switching modes and the concomitant repercussion on a variety of synaptic properties in conductive-bridge random access memory (CBRAM) SiO 2 -based devices. While both threshold and bipolar switching effects were captured when Ag was selected for TE, only the latter switching mode was confirmed for the case of Cu. The SiO 2 -based memristors exhibit not only conductance tuning properties at low bias conditions, but can emulate the synaptic potentiation and depression procedures under the same pulse polarity (Ag TE). Moreover, by modulating the time interval difference of the pulses train, we can obtain short-term (STP) to long-term potentiation (LTP) transition properties along Spike-Timing Dependent Plasticity (STDP) performance. Our results indicate thus, that by …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:7Hz3ACDFbsoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Si NANOCRYSTAL MOS MEMORY OBTAINED BY LOW-ENERGY ION BEAM SYNTHESIS",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0006",
            "Abstract": "Very-low energy (1 keV) Si implantation and subsequent thermal annealing are used for the fabrication of a narrow charge storage layer within the gate oxide of metal-oxide-semiconductor capacitors and transistors. Capacitance and channel current measurements are performed to investigate the charging effects of the Si-implanted oxides as a function of Si fluence. Clear memory characteristics are observed for a dose of 1 × 1016 cm-2 or lower. The device electrical characteristics are found compatible with the spatial arrangement and structural state of implanted Si as well as with the presence of interface states and traps that originate from the nanocrystal formation process.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Capacitive pressure sensors and switches fabricated using strain compensated SiGeB",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931706000840",
            "Abstract": "The fabrication of capacitive pressure sensors and pressure switches using a 2.4 μm thick strain compensated heavily boron doped SiGeB diaphragm is presented. The process relies on the silicon fusion bonding of two silicon wafers to seal the pressure sensor cavity and construct the device. Both rectangular and circular type pressure sensors and pressure switches have successfully been fabricated using this process. Results are presented of a capacitive type sensor operating in the medical pressure regime (0–300 mmHg) with a sensitivity to pressure of 1.5 fF/mmHg or 305 ppm/mmHg, and of a pressure switch operating in the 3–8 bar pressure range and are thus suitable for a number of industrial and automotive applications. The current flowing through the switch when biased at 2 V jumps over six orders of magnitude when its two plates come in contact at a well defined pressure threshold.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Silicon-nanocrystal-based multiple-tunnel junction devices obtained by a combination of V-groove and ion beam synthesis techniques",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931701004324",
            "Abstract": "Multiple-tunnel junction devices with a source–drain electrode separation ranging from 50 to 200 nm and non-linear source–drain current–voltage characteristics, are constructed by a combination of optical lithography, anisotropic wet and dry etching and low-energy Si ion implantation. Electrical characteristics are found to depend strongly on the Si implantation dose and source–drain separation.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:9Nmd_mFXekcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Nanoparticles Synthesised in the Gas-Phase and Their Applications in Sensors: A Review",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/878592",
            "Abstract": "This article aims to provide a comprehensive review of recent advances in the use of gas-phase synthesized nanoparticles in the field of sensing technology. Since there are numerous and diverse reviews that already cover the subject extensively, this review focuses predominantly but not exclusively on gas-phase synthesized metallic nanoparticles and their most prominent sensing-applications. After a brief overview on the main uses of nanoparticles in science and technology, as well as a description of the dominant fabrication methods, the review discusses their incorporation in strain-sensing, chemical sensing and bio-sensing as well as a few other sensing-applications. The review highlights the inherent advantages of nanoparticles, as well as how they combine with flexible gas-phase synthesis processes. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:43bX7VzcjpAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Effect of ion energy and dose on the positioning of 2D-arrays of Si nanocrystals ion beam synthesised in thin SiO2 layers",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510702007249",
            "Abstract": "Silicon nanocrystals (ncs) buried in a thin oxide can be used as charge storage elements and be integrated in standard CMOS technology to fabricate new non-volatile memory devices. In this work, we report on a systematic study of the effect of varying the beam energy (0.65–2 keV) and the dose (1015–1016 cm−2) on the positioning of 2D-arrays of ncs within 10 nm thick oxide after annealing at 950 and 1050 °C. For this, different Transmission Electron Microscopy (TEM) methods have been used including High Resolution Electron Microscopy (HREM) for imaging isolated ncs and Fresnel contrast imaging of populations of ncs. Our results show that the ‘injection distance’ can be precisely tuned in the 5–8 nm range by varying the beam energy. Moreover, very large swelling of the SiO2 layer has been observed when increasing the implanted dose which could be the result of a partial oxidation of the Si ncs layer …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:Se3iqnhoufwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Processing issues in silicon nanocrystal manufacturing by ultra-low-energy ion-beam-synthesis for non-volatile memory applications",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931704002114",
            "Abstract": "Recent fabrication issues encountered during the synthesis of silicon nanocrystals in thin SiO2 films by the technique of ultra-low energy ion implantation and subsequent thermal treatment (ULE-IBS) are presented. The effects of charge neutralization of the implanted species, energy contamination and post-implantation cleaning process on the electrical and structural properties of the processed oxides are described, with emphasis upon the technological options to control them. While much research is still required for industrial exploitation of ULE-IBS in the fabrication of competitive and reproducible memory structures, promising results for prototype devices aiming at low-voltage non-volatile memory applications have been obtained and are here reported.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Picosecond and nanosecond laser annealing and simulation of amorphous silicon thin films for solar cell applications",
            "Publication year": 2014,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4863402",
            "Abstract": "In this work, a picosecond diode pumped solid state laser and a nanosecond Nd:YAG laser have been used for the annealing and the partial nano-crystallization of an amorphous silicon layer. These experiments were conducted as an alternative/complementary to plasma-enhanced chemical vapor deposition method for fabrication of micromorph tandem solar cell. The laser experimental work was combined with simulations of the annealing process, in terms of temperature distribution evolution, in order to predetermine the optimum annealing conditions. The annealed material was studied, as a function of several annealing parameters (wavelength, pulse duration, fluence), as far as it concerns its structural properties, by X-ray diffraction, SEM, and micro-Raman techniques.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:gsN89kCJA0AC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Ultra‐Low Power Multilevel Switching with Enhanced Uniformity in Forming Free TiO2−x‐Based RRAM with Embedded Pt Nanocrystals",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.201700570",
            "Abstract": "Accurate control over the various resistance states is highly desired in order to attain reliable multilevel memory performance. However, due to the inherent random nature of oxygen vacancy creation, serious variability issues may arise. In this work, we demonstrate promising multilevel capability with ultra‐low power consumption in the range of nW, using sub‐200 nA operating current in a 45 nm TiO2−x‐based resistive random access memory (RRAM) with embedded small (≈5 nm in diameter) Pt nanocrystals (NCs). As the resistance values present a strong dependence on both the oxygen vacancy density and the diameter of the conducting filament (CF), hence the degree of the variability (or uniformity) can be improved by controlling one of these two parameters. It is shown here that the presence of NCs allows for the generation of multiple and dense CFs due to the concentrated electric field around the NCs …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:F9fV5C73w3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Power harvesting scheme for remotely powered sensor tags",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=6304350077429099564&hl=en&oi=scholarr",
            "Abstract": "The architecture of a power harvester for autonomous sensor nodes that harvest RF energy is presented. The circuitry has been tested in the near field of a dipole antenna that emits 200mW of RF power at 430MHz.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ge nanocrystals in MOS-memory structures produced by molecular-beam epitaxy and rapid-thermal processing",
            "Publication year": 2004,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/ge-nanocrystals-in-mosmemory-structures-produced-by-molecularbeam-epitaxy-and-rapidthermal-processing/E0B211A70100A9614A7E6883B32B67E7",
            "Abstract": "A method of forming a sheet of Ge nanocrystals in a SiO2 layer based on molecular beam epitaxy (MBE) and rapid thermal processing (RTP) is presented. The method takes advantage of the very high precision by which a very thin Ge layer can be deposited by MBE. With proper choice of process parameters the nanocrystal size can be varied between ∼3 and ∼8 nm and the area-density between ∼1×1011 and ∼1×1012 dots/cm2. The tunneling oxide thickness is determined by the thickness of a thermally grown SiO2 layer, and is typically 4 nm. C-V measurements of MOS capacitors reveal hole and electron injection from the substrate into the nanocrystals. Memory windows of about 0.2 and 0.5 V for gate-voltage sweeps of 3 and 6 V, respectively, are achieved.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:08ZZubdj9fEC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Nickel nanoparticle deposition at room temperature for memory applications",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931707004297",
            "Abstract": "In this work we investigate the non-volatile memory behavior of Ni nanoparticles embedded within an insulating matrix. Nickel nanoparticles are deposited at room temperature by a new high-vacuum technique over a 4 nm tunneling thermal SiO2 layer followed by the deposition of HfO2 as a control insulator. Memory windows of ∼1.5V are observed in MOS capacitors at gate pulse voltages of 8V. Charge retention for write and erase state clearly indicate long time charge storage behavior.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:aqlVkmm33-oC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Laser printing and characterization of semiconducting polymers for organic electronics",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-012-7134-9",
            "Abstract": "Hybrid organic/inorganic thin-film transistors (TFTs) with bottom-contact configuration were fabricated using the Laser Induced Forward Transfer (LIFT) process. The semiconducting polymer P3HT was laser printed from a donor to a receiver substrate in order to form the active layer of the TFTs. With a single laser pulse, P3HT pixels were successfully printed.The printed material was analyzed morphologically by means of Optical Microscopy and its thickness was measured by profilometry. In addition, structural characterization of P3HT thin films before and after laser printing took place by using UV-Visible absorption spectroscopy and X-Ray Diffraction. It was found that the crystallinity of the investigated films is improved upon annealing. An organic thin-film transistor (OTFT) with laser printed P3HT pixel as a channel layer was then fabricated. The OTFTs indicated a field-effect mobility up to 2.23⋅10 …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Identification of Two Commercial Pesticides by a Nanoparticle Gas-Sensing Array",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1424-8220/21/17/5803",
            "Abstract": "This study presents the experimental testing of a gas-sensing array, for the detection of two commercially available pesticides (i.e., Chloract 48 EC and Nimrod), towards its eventual use along a commercial smart-farming system. The array is comprised of four distinctive sensing devices based on nanoparticles, each functionalized with a different gas-absorbing polymeric layer. As discussed herein, the sensing array is able to identify as well as quantify three gas-analytes, two pesticide solutions, and relative humidity, which acts as a reference analyte. All of the evaluation experiments were conducted in close to real-life conditions; specifically, the sensors response towards the three analytes was tested in three relative humidity backgrounds while the effect of temperature was also considered. The unique response patterns generated after the exposure of the sensing-array to the two gas-analytes were analyzed using the common statistical analysis tool Principal Component Analysis (PCA). The sensing array, being compact, low-cost, and highly sensitive, can be easily integrated with pre-existing crop-monitoring solutions. Given that there are limited reports for effective pesticide gas-sensing solutions, the proposed gas-sensing technology would significantly upgrade the added-value of the integrated system, providing it with unique advantages.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:WC23djZS0W4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Capacitance to frequency converter suitable for sensor applications using telemetry",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011290419804",
            "Abstract": "Inductively powered telemetric systems are beginning to gain interest in all fields where remote sensing is needed. In such systems power consumption, miniaturization and packaging pose the greatest design problems [1]. In this paper we present a capacitance to frequency converter suitable for working with an already presented telemetric system [2]. The system uses passive telemetry to transfer power to the transponder and pressure data to a remote base unit. Such telemetric systems are becoming ever more important in the biomedical field as the interest for in vivo measurements of different biological parameters both of humans and animals is increasing.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:4DMP91E08xMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Silicon nanocrystal memories",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=3028809218462519416&hl=en&oi=scholarr",
            "Abstract": "Nanoparticles are an important class of materials in nanoscience and nanotechnology with a wide range of current and potential applications in many industrial sectors. These are mainly clusters of metal or semiconductor atoms with dimensions in the range of a few nanometers. For electronic applications they should have preferentially a crystalline structure and their size should be below 10 nm (hence the name “nanocrystals”). The nanocrystals (ncs) are treated by researchers as quantum-dots (ie, systems with zero dimensions). The increase of bandgap as the nc diameter decreases, the quantization of energy levels and of density of states outside of the bandgap and Coulomb blockade are the most important quantum mechanical phenomena that can be exploited for ncbased electronics. More details on the electronic structure and the properties of nanocrystals can be found in Refs. 1–3. In the present chapter …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:a0OBvERweLwC",
            "Publisher": "Jenny Stanford Publishing"
        },
        {
            "Title": "A chemical sensor microarray realized by laser printing of polymers",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400510006179",
            "Abstract": "The fabrication of chemical sensor arrays using laser induced forward transfer (LIFT) as a means to deposit polymer layers to be used as chemically sensitive material is presented. LIFT is a direct, maskless technique offering high spatial resolution printing of a wide range of polymers and in this work it has been applied in the fabrication of a capacitive chemical sensor array with the ability to host up to 256 sensing sites. Each sensor in the array is composed of a Si membrane covered by a thin low temperature oxide layer and a polymer layer. Owing to the large number of sensing sites there is room for both sensitive polymer layer diversity as well as multiplicity, therefore expanding the capability for odour recognition. As a demonstration, a variety of polymers has been spotted on sensor arrays and tested during exposure to various concentrations of water, methanol and ethanol vapours. The deposited polymers …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Laser annealing of plasma implanted boron for ultra-shallow junctions in Silicon",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168583X06009566",
            "Abstract": "This work combines plasma doping implantation (PLAD) with laser annealing using excimer laser, for the formation of ultra-shallow junctions. For that purpose, high dose BF3 was implanted in n-type silicon wafers using PLAD. The as implanted material was investigated by high resolution TEM, measured by SIMS and simulated by Monte-Carlo codes. Subsequently, the samples were annealed using a KrF laser source at 248 nm with a pulse duration 20 ns and different fluence values. Laser annealing completely recrystallizes the amorphous layer as monitored by TEM measurements, fully activates the dopants achieving low sheet resistance values as shown by Van der Pauw measurements and results in box-shaped dopant profiles with movement less than 10 nm at the junction depth as measured using SIMS.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Evolution and control of the structure of a SiO2/semiconductor nanoelectronics material",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931702004677",
            "Abstract": "The study of a silica nanolayer implanted by semiconductor (germanium or silicon) species offers unique insights regarding the structural evolution and, ultimately, the controlled fabrication of nanoelectronics multiphase materials through one or more phase transformation steps. A description integrating important restructuring phenomena identified so far is provided and special emphasis is placed upon the interpretation and consequences of new transmission electron microscopy observations of in situ phase separation of Ge-implanted nanolayers.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:pqnbT2bcN3wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Two-dimensional nanoparticle self-assembly using plasma-induced Ostwald ripening",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/22/23/235306/meta",
            "Abstract": "In this work, a novel Ag nanoparticle self-assembly process based on plasma-induced two-dimensional Ostwald ripening is demonstrated. Ag nanoparticles are deposited on p-doped Si substrates using a DC magnetron sputtering process. With the assistance of O 2/Ar plasma treatment, different sizes and patterns of Ag nanoparticles are formed, due to the Ostwald ripening. The evolution of plasma-induced nanoparticle ripening is studied and a clear increase in particle size and a decrease in particle density are observed with increasing plasma treatment. From the experiments, it is concluded that the initial nanoparticle density and the plasma gas mixture (Ar/O 2 ratio) are important factors that affect the ripening process. The proposed plasma-directed Ag nanoparticle self-assembly provides a rapid method of tailoring the nanoparticle distribution on substrates, with potential applications in the fields of solar cells …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:2P1L_qKh6hAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Tuning the analog synaptic properties of forming free SiO2 memristors by material engineering",
            "Publication year": 2021,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0044647",
            "Abstract": "The development of alternative brain-inspired neuromorphic computing architectures is anticipated to play a key role in addressing the strict requirements of the artificial intelligence era. In order to obtain a high degree of learning accuracy within an artificial neural network (ANN) that operates with the backpropagation algorithm, a highly symmetric synaptic weight distribution is desired. Along these lines, we present here a detailed device engineering approach that enables analog synaptic properties in completely forming free SiO2-conductive bridge memories. This is achieved by either incorporating a dense layer of Pt nanoparticles as a bottom electrode or fabricating bilayer structures using a second switching layer of VOx. Interestingly, compared with the reference sample that manifests both threshold and bipolar switching modes, the Pt NC sample exhibits only the threshold switching pattern, whereas the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:7BrZ7Jt4UNcC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Design and fabrication of a Si micromechanical capacitive array for DNA sensing",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931707007952",
            "Abstract": "The design considerations and the fabrication process of a single chip capacitive sensor array suitable for chemical and DNA sensing are presented. Each sensor in the array consists of an ultra thin silicon membrane to be covered with receptor DNA. Upon exertion of surface stress, the membrane deflects resulting in a change in device capacitance. Finite element analysis (FEA) was applied to evaluate and optimize the response of the sensor. First experimental results on chemical substances are reported.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Highly stretchable electrodes on wrinkled polydimethylsiloxane substrates",
            "Publication year": 2015,
            "Publication url": "https://www.nature.com/articles/srep16527",
            "Abstract": "This paper demonstrates a fabrication technology of Ag wrinkled electrodes with application in highly stretchable wireless sensors. Ag wrinkled thin films that were formed by vacuum deposition on top of pre-strained and relaxed polydimethylsiloxane (PDMS) substrates which have been treated using an O 2 plasma and a surface chemical functionalization process can reach a strain limit up to 200%, while surface adhesion area can reach 95%. The electrical characteristics of components such as resistors, inductors and capacitors made from such Ag conductors have remained stable under stretching exhibiting low temperature and humidity coefficients. This technology was then demonstrated for wireless wearable electronics using compatible processing with established micro/nano fabrication technology.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:GtLg2Ama23sC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Nanoparticle based gas-sensing array for pesticide detection",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2213343718306468",
            "Abstract": "The present paper discusses the development of a pesticide gas sensor based on self-assembled nanoparticle networks and four distinctive polymer coatings; the sensor is used as a sensing system for chlorpyrifos detection. For the fabrication of the sensing system the sputtering technique is employed for the simultaneous fabrication and deposition of the nanoparticle film while 4 different polymer coatings are then spin-coated on top. The sensors are ultimately able to distinguish between chlorpyrifos (a commonly used pesticide) and its solvent, detecting chlorpyrifos concentrations as low as 0.7 ppb. Each of the 4 polymer coatings produces a unique sensor response when in the presence of chlorpyrifos vapours; this has served as the basis for the development of a multi-sensor array for chlorpyrifos detection. The capability of the system in distinguishing between pesticide and pesticide solvent has been …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:5icHVeHT4IsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Interstitial injection during oxidation of very low energy nitrogen-implanted silicon",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510705004964",
            "Abstract": "Oxidation of nitrogen-implanted silicon is one of the methods developed in order to incorporate nitrogen within a growing thermal gate oxide in order to improve its reliability in the ultra thin (<4 nm) regime. The main advantage of the method is that it enables the formation of various oxide thicknesses across the silicon substrate by performing local nitrogen implantations of various dose and using one single oxidation step, which is very helpful especially for Systems On Chip fabrication. It is also known that oxidation of silicon causes an interstitial injection into the silicon substrate, which enhances the diffusivity of boron, which diffuses via an interstitial-mediated mechanism, in the transistor channel area causing fluctuations in the MOS (Metal-Oxide-Semiconductor) transistor threshold voltage. In this article we present a study of interstitial injection during oxidation of very low energy nitrogen-implanted silicon using …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:K3LRdlH-MEoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Charge storage and interface states effects in Si-nanocrystal memory obtained using low-energy  implantation and annealing",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1328101",
            "Abstract": "Thin SiO2 oxides implanted by very-low-energy (1 keV) Si ions and subsequently annealed are explored with regards to their potential as active elements of memory devices. Charge storage effects as a function of Si fluence are investigated through capacitance and channel current measurements. Capacitance–voltage and source–drain current versus gate voltage characteristics of devices implanted with a dose of 1×1016 cm−2 or lower exhibit clear hysteresis characteristics at low electric field. The observed fluence dependence of the device electrical properties is interpreted in terms of the implanted oxide structure.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:u-x6o8ySG0sC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Surface functionalization studies and direct laser printing of oligonucleotides toward the fabrication of a micromembrane DNA capacitive biosensor",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400512000287",
            "Abstract": "This work presents a comparative study between two functionalization techniques, gold (Au) and 3-glycidoxypropyl-tri-methoxy silane (GOPTS) that were used to immobilize thiol-modified oligonucleotides on low temperature oxide (LTO) on silicon (Si) surfaces toward the fabrication of a micromembrane array capacitive DNA biosensor. In the effort to increase the surface stress that develops upon probe immobilization and target hybridization and thus enhance the sensor's sensitivity, a number of parameters were investigated such as probe and target concentrations as well as the thickness and roughness of the functionalization layers. Our results indicate that GOPTS is better suited as a functionalization layer for the development of microcantilever or micromembrane-based biosensors due to the enhanced hybridization efficiencies achieved, its relative stability over time and the ability to regenerate the surfaces …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "PHEMA functionalized gold nanoparticle films for vapor sensing",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705810008842",
            "Abstract": "The fabrication of a chemical sensor based on the technique of gold nanoparticle ink-jet printing and the subsequent functionalization of the nanoparticle film by Polyhydroxyethylmethacrylate (PHEMA) polymer is presented while its chemiresistive, chemi-capacitive and chemi-impedance response are investigated. By controlling the Gold nanoparticle density and selecting different interdigitated electrode distances and nanoparticle sizes, chemical sensors of different linearity and sensitivity can be obtained.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Effects of annealing conditions on charge storage of Si nanocrystal memory devices obtained by low-energy ion beam synthesis",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931703001242",
            "Abstract": "The structural and electrical characteristics of thin silicon dioxide layers with embedded Si nanocrystals are reported fabricated by low-energy silicon implantation and with subsequent annealing in inert and diluted oxygen. Thermal treatment in diluted oxygen increases the thickness of the control oxide, does not affect significantly the size of the nanocrystals, and improves the integrity of the oxide. As a result, strong charge storage effects at low gate voltages and enhanced charge retention times are observed through electrical measurements of MOS capacitors. These results indicate that a combination of low-energy silicon implants and annealing in diluted oxygen permits the fabrication of low-voltage nonvolatile memory devices.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:k_IJM867U9cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mass-loading effect on parameters of quartz and langasite resonators: recent results",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0151910701900315",
            "Abstract": "This paper presents some of the more relevant results concerning the mass-loading influence on quartz resonators and monolithic filter characteristics, and recent experimental results about the mass-loading effect on electrical parameters of langasite resonators. Based on the Ballato's transmission-line analogs of the trapped-energy resonators vibrating in thickness-shear mode, the mass-loading effect on resonator characteristics was studied. The effective mass-loading, motional inductance and quality factor of quartz and langasite resonators, as a function of harmonic order for various electrode parameters, were computed. In the frame of the Tiersten's analysis of monolithic structure, the theoretical calculations of the coupling coefficient of two-pole quartz and langasite monolithic filters as a function of mass-loading were performed. The analysis of the results shows that the mass-loading influence on …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:uWQEDVKXjbEC",
            "Publisher": "No longer published by Elsevier"
        },
        {
            "Title": "Low temperature rf-sputtered thermochromic VO2 films on flexible glass substrates",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/E-Aperathitis/publication/317741342_Low_Temperature_Rf-Sputtered_Thermochromic_VO2_Films_On_Flexible_Glass_Substrates/links/5e15a6a3299bf10bc39abd0a/Low-Temperature-Rf-Sputtered-Thermochromic-VO2-Films-On-Flexible-Glass-Substrates.pdf",
            "Abstract": "The high deposition temperature of the order of 400 oC and more is requirement for the growth of the thermochromic phase of vanadium dioxide (VO2), limits the type of substrates that one may grow them on only to rigid ones. In this work, thermochromic VO2 films were successfully deposited on flexible Corning® Willow® glass substrates, without the use of a buffer layer, by rf sputtering at a substrate temperature of 300 oC, one of the lowest for this technique ever reported. The critical transition temperature of 80 nm thin films was Tc= 50.7 oC, transmittance hysteresis width was ΔT= 12.1 oC, while the modulation of the transmittance at λ= 2000 nm measured at 25 oC and 90 oC was around 36%, leading to a solar modulation of ΔTrsol= 5%. In addition, an increase in transmittance at λ= 600nm (visible region) of 4% was observed before and after heating, while integrated luminous transmittance remained almost constant at Trlum= 34%. The thermochromic and luminous characteristics of the VO2 films deposited on flexible glass are comparable to those deposited on rigid glass substrates. The deposition of thermochromic VO2 film on flexible glass substrates by sputtering technique opens up a new window for thermochromic applications on flexible substrates. Copyright© 2017 VBRI Press.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:LhH-TYMQEocC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Impact of structural parameters on the performance of silicon micromachined capacitive pressure sensors",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924424707000623",
            "Abstract": "In this paper we examine with analytical and finite element modeling the influence of structural parameters on the performance of capacitive silicon pressure sensors. It is found that device behavior is dependant on the substrate deformation as well as the foundation of the sensor diaphragm. Accurate results may only be obtained when all parameters and residual stresses are included.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:bFI3QPDXJZMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Implementation and Optimization of Chemical Logic Gates Using Memristive Cellular Automata",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9218330/",
            "Abstract": "By utilizing biologically inspired approaches, a wide range of complex and computationally intensive problems can be transformed to simpler and more appropriate forms to be easily solved by unconventional computing systems. A well-known computing platform with such characteristics is the Cellular Automata paradigm, where a spatial-extended network of nodes, with local interactions, exhibit emerging computations. In such CA networks, the application of nanodevices, like memristors, with inherent novel abilities, like memory storing and computing capabilities, together with nonlinear interactions is promising for the advancement of computation. In this work, a memristor-based Cellular Automaton (MemCA) is developed for the implementation and optimization of topological chemical logic gates. The proposed MemCA is inspired by the behaviour of the biological organism Physarum Polycephalum that firstly …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:ubry08Y2EpUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Influence of Ti top electrode thickness on the resistive switching properties of forming free and self-rectified TiO2− x thin films",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609014009195",
            "Abstract": "The memory performance of titanium oxide (TiO2 − x)-based resistive memories containing an ultra thin reactive Ti top electrode can be greatly enhanced. Very good switching memory characteristics were demonstrated for an Au/Ti/TiO2 − x/Au/SiO2/Si structure with the insertion of a Ti nanolayer at the Au/TiO2 − x interface. Due to the superb ability of Ti to absorb oxygen atoms from the dielectric matrix, a large amount of oxygen vacancies is created, which are crucial for the stable function of the memory devices. As the Ti thickness increases, a thick interfacial layer is created, which degrades the resistive switching behavior. The induced interface thickness is found also to affect the fluctuation of the ON/OFF processes. The very good switching characteristics which were recorded for the devices containing Ti as top electrode, denote the direct impact that Ti has on the oxygen vacancy density. Oxygen vacancy …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:-FonjvnnhkoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Langmuir− Blodgett film deposition of metallic nanoparticles and their application to electronic memory structures",
            "Publication year": 2003,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/nl034008t",
            "Abstract": "The Langmuir−Blodgett deposition of organically passivated gold nanoparticles is reported. A monolayer of these particles has been incorporated into a metal−insulator−semiconductor (MIS) structure. The MIS device exhibits a hysteresis in its capacitance versus voltage characteristic, the magnitude of which is dependent on the voltage sweep conditions. Charge storage in the layer of nanoparticles is thought to be responsible for this effect. ",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:u5HHmVD_uO8C",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Low temperature wafer bonding for thin silicon film transfer",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924424703004424",
            "Abstract": "In this work, we investigate the low temperature (<200 °C) wafer bonding using wet chemical surface activation and we demonstrate high bonding strength sufficient to achieve the transfer of a thin silicon film of thickness less than 400 nm on top of another silicon wafer using spin-on-glass (SOG) film as an intermediate layer. The process developed is the first critical step that can enable three-dimensional (3D) integration and wafer level packaging of MEMS with electronic circuits.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Simulation of Semiconductor Processes and Devices 2001: Sispad 2001",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=23iY6eBRRVoC&oi=fnd&pg=PA1&dq=info:EmyJcZgOxDIJ:scholar.google.com&ots=Sl0EL0859L&sig=UdvTxaINDH1iH5plW-g3lUXZwzo",
            "Abstract": "This volume contains the Proceedings of the International Conference on Simulation of Semiconductor Devices and Processes, SISPAD 01, held on September 5–7, 2001, in Athens. The conference provided an open forum for the presentation of the latest results and trends in process and device simulation. The trend towards shrinking device dimensions and increasing complexity in process technology demands the continuous development of advanced models describing basic physical phenomena involved. New simulation tools are developed to complete the hierarchy in the Technology Computer Aided Design simulation chain between microscopic and macroscopic approaches. The conference program featured 8 invited papers, 60 papers for oral presentation and 34 papers for poster presentation, selected from a total of 165 abstracts from 30 countries around the world. These papers disclose new and interesting concepts for simulating processes and devices.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Fabrication of nanowires from gold nanoparticles by AC dielectrophoresis and ink-jet delivery",
            "Publication year": 2009,
            "Publication url": "https://www.scientific.net/JNanoR.6.67",
            "Abstract": "A process for nanowire fabrication from gold nanoparticles is described. In this process, we have combined the ink-jet delivery of a nanoparticle colloid with the dielectrophoresis technique. Ink-jet printing is used for the accurate delivery of gold nanoparticle colloid in an exact position and quantity. The nanoparticles dropped to a two electrode gap are ordered into nanowires by the dielectrophoresis force which is induced by the applied AC voltage. The nanowire structures are characterized by microscopy techniques and IV measurements.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:P5F9QuxV20EC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Nickel nanoparticle size and density effects on non-volatile memory performance",
            "Publication year": 2013,
            "Publication url": "https://avs.scitation.org/doi/abs/10.1116/1.4804407",
            "Abstract": "In this work, the authors present non-volatile memory devices based on nickel nanoparticles deposited by a novel sputtering process at room temperature and demonstrate and discuss the effect of nanoparticle size and density upon optimum device performance. The devices use a mixed dielectric stack comprised of a silicon dioxide tunneling layer and a hafnium oxide layer formed at low temperature. This allows for fabrication of devices with a relatively small thermal budget and superior performance in terms of memory windows and operating voltages. At voltages as low as 8 V, the memory window of the devices is as large as 5 V. Charge retention measurements confirm the non-volatility of these devices for up to 10 years, and analysis of the leakage currents sheds light on the mechanisms involved that create these charge retention characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:BUYA1_V_uYcC",
            "Publisher": "American Vacuum Society"
        },
        {
            "Title": "Detection of DNA mutations using a capacitive micro-membrane array",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S095656631000494X",
            "Abstract": "The detection of DNA hybridization using capacitive readout and a biosensor array of ultrathin Si membranes is presented. The biosensor exploits the ability of the ultrathin membranes to deflect upon surface stress variations caused by biological interactions. Probe DNA molecules are immobilized on the membrane surface and the surface stress variations during hybridization with their complementary strands force the membrane to deflect and effectively change the capacitance between the flexible membrane and the fixed substrate. The sensor array comprises 256 such sensing sites thus allowing the concurrent sensing of multiple DNA mutations. The biosensor and its performance for the detection of complementary DNA strands are demonstrated using beta-thalassemia oligonucleotides. The experimental results show that the presented sensors are able to detect DNA hybridization and to discriminate single …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Laser-matter interactions",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128202555000040",
            "Abstract": "Due to the ever-increasing shrinking of semiconductor technology nodes, phenomena such as parasitic and transient enhanced diffusion preclude the use of traditional annealing methods. To face these issues novel annealing techniques with steep temperature gradients are coming into the forefront of semiconductor processing. One of these is laser annealing which presents a series of attractive characteristics such as high power density, localized heating as well as the ability to tune the effective heating depth. This chapter presents basic aspects of laser-matter interaction from the point of view of the main group IV semiconductors, silicon and germanium, and deals with the radiation absorption mechanisms and processes using deep infrared wavelengths as a use case of particular industrial relevance. The effect of heavy extrinsic doping, typical in semiconductor processing, on absorption coefficient is also …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:j7_hQOaDUrUC",
            "Publisher": "Woodhead Publishing"
        },
        {
            "Title": "Physical modelling of the SET/RESET characteristics and analog properties of TiOx/HfO2−x/TiOx-based RRAM devices",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7605194/",
            "Abstract": "Understanding the origins of switching effect is of great importance, since it can enlighten our perspectives and offers guidance for novel device design. In contrast with the common electronic devices which rely their operation only at electron transport properties, resistive switching effect exhibits a strong dependence from the local distribution of ions. Here, we present a quantitative analysis, both at DC and AC domains, which can account for the analog properties of our trilayer-based devices. Our approach can capture the gradual SET/RESET responses, which stem from the balance between drift and diffusion effect, and highlight the crucial role of temperature, electric field and oxygen vacancy density on the switching pattern.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:9c2xU6iGI7YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A miniature pressure system with a capacitive sensor and a passive telemetry link for use in implantable applications",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/825772/",
            "Abstract": "A miniature telemetric pressure-measuring system is presented in this paper. The system uses passive telemetry to transfer power to the transponder and pressure data to the remote base unit. Such telemetric systems are becoming ever more important in the biomedical field as the interest for in-vivo measurements of different biological parameters both of humans and animals is increasing. A novel capacitive-type pressure sensor based on an SiGeB diaphragm is used as a sensing element. The merits of combining a capacitive pressure sensor and passive telemetry lies in the inherent low-power consumption of the sensor and the continuous availability of power through induction. The pressure sensor is connected to an integrated interface circuit, which includes a capacitance to frequency converter and an internal voltage regulator to suppress supply voltage fluctuations on the transponder side. In addition, the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Injection of point defects during annealing of low energy As implanted silicon",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510705005118",
            "Abstract": "In this work, we investigate the interstitial injection into the silicon lattice due to high-dose, low energy arsenic implantation. The diffusion of the implanted arsenic as well as of boron, existing in buried δ-layers below the silicon surface, is monitored while successive amounts of the arsenic profile are removed by low temperature wet silicon etching. From the analysis of the diffusion profiles of both dopants, consistent values for the interstitial supersaturation ratio can be obtained. Moreover, the experimental results indicate that the contribution of the implantation damage to the TED of boron, and thus the interstitial injection, is not the main one. On the contrary, interstitial generation due to arsenic clustering seems to be more important for the present conditions.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:u9iWguZQMMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Capacitive microsensors for biomedical applications",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/0471732877.emd050",
            "Abstract": "The use of reliable, high performance miniature sensors in the medical field is of growing importance for patient health monitoring. Batch sensor fabrication, as this has been introduced by Integrated Circuit (IC) manufacturing, is an efficient way to produce silicon sensors with desirable characteristics. Since microsensors combine small size with electrical and mechanical principles of operation they constitute together with microactuators what is usually called Microelectromechanical Systems (MEMS). These components are mainly made from silicon and other related materials to explore existing know‐how and infrastructure of silicon technology. All of the above factors have allowed for fast growth of the microsensor field during the last years. This article focuses on physical microsensors used in the medical field that are based on the capacitive approach.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:dshw04ExmUIC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Synthesis of hafnium nanoparticles and hafnium nanoparticle films by gas condensation and energetic deposition",
            "Publication year": 2018,
            "Publication url": "https://www.beilstein-journals.org/bjnano/articles/9/179",
            "Abstract": "In this work we study the fabrication and characterization of hafnium nanoparticles and hafnium nanoparticle thin films. Hafnium nanoparticles were grown in vacuum by magnetron-sputtering inert-gas condensation. The as deposited nanoparticles have a hexagonal close-packed crystal structure, they possess truncated hexagonal biprism shape and are prone to surface oxidation when exposed to ambient air forming core–shell Hf/HfO 2 structures. Hafnium nanoparticle thin films were formed through energetic nanoparticle deposition. This technique allows for the control of the energy of charged nanoparticles during vacuum deposition. The structural and nanomechanical properties of the nanoparticle thin films were investigated as a function of the kinetic energy of the nanoparticles. The results reveal that by proper adjustment of the nanoparticle energy, hexagonal close-packed porous nanoparticle thin films with good mechanical properties can be formed, without any additional treatment. It is shown that these films can be patterned on the substrate in sub-micrometer dimensions using conventional lithography while their porosity can be well controlled. The fabrication and experimental characterization of hafnium nanoparticles is reported for the first time in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:lvd772isFD0C",
            "Publisher": "Beilstein-Institut"
        },
        {
            "Title": "Influence of implantation dose on the charge storage characteristics of MOS memory devices with low energy Si implanted gate oxides",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931702004835",
            "Abstract": "The charge storage properties of n-channel MOS transistors with 1 keV Si implanted gate oxides are investigated for 1 and 2×1016 cm−2 Si densities through gate bias (Vg) and time (t) dependent source-drain current (Ids) measurements. Low dose implanted devices exhibit a continuous (trap-like) charge storage process under both static and dynamic conditions in contrast to the high dose implanted case, where injection of a fixed amount of electrons into the Si nanocrystals at low electric fields leads to step-like Ids–t characteristics and discrete threshold voltage shifts versus Vg at room temperature. These findings can be related to the spatial arrangement and structural state of the implanted Si material after annealing as deduced by a TEM study.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Deposition and electrical characterization of hafnium oxide films on silicon",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200780208",
            "Abstract": "Hafnium oxide dielectric is under intense investigation in recent years as a new high‐k insulator to replace silicon dioxide thus allowing further device scaling in silicon technology. In this work we investigate HfO2 deposited films using RF reactive sputtering technique and we present results on their electrical characterization using MOS capacitors. The HfO2 films have been sputtered on n or p‐type Si substrate from high purity HfO2 target at low deposition rate (0.1 Å/s) monitored by a quartz crystal. After deposition of the insulator aluminum has been evaporated and patterned to form MIS capacitors. In this paper we investigate the effect of deposition parameters and post‐deposition‐annealing on the electrical properties of the HfO2 films. (© 2008 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:lSLTfruPkqcC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Nanoparticle strain sensor",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705811058279",
            "Abstract": "Strain sensors have been fabricated by depositing platinum nanoparticles between interdigitated gold electrodes on oxidised silicon substrate. A significant improvement in strain sensitivity is achieved with a gauge factor in excess of 700, which is two orders of magnitude higher than continuous metallic films and five times higher than semiconductor devices. The measured resistance is strongly dependant on inter-particle distance, which is altered when the substrate is strained.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:z_wVstp3MssC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Impact of Pt embedded nanocrystals on the resistive switching and synaptic properties of forming free TiO2 – x/TiO2 – y-based bilayer structures",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5094242",
            "Abstract": "The resistive switching characteristics of forming free TiO2 – x/TiO2 – y memory devices containing Pt nanocrystals (NCs) beneath the top electrode were systematically investigated through experiments and numerical simulation insights. By embedding Pt nanocrystals, we have the possibility to narrow down the possible locations where the switching effect will evolve and thus significantly improve the inherent variability of the devices. Besides, the deployment of bilayer structures can tune the resistance levels, since the presence of the layer with low oxygen content (TiO2 – y) acts practically as series resistance, limiting the operating currents and at the same time forcing the switching effect to evolve in the layer with the higher oxygen content (TiO2 – z). A numerical model is implemented, in order to shed light into the origin of the SET/RESET transitions and illustrate the direct impact of NCs on the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:4X0JR2_MtJMC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "E-Mail: C. Tsamis (a) imel. demokritos. gr",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=X21qDQAAQBAJ&oi=fnd&pg=PA205&dq=info:WmN4WP3pGy8J:scholar.google.com&ots=Bi8oNeqkug&sig=aIsBf-c_okAqIwP64cr2kDlf81M",
            "Abstract": "In this work we investigate the influence of controlled damage generated by Si'implantation in the S/D region on the extent of the Reverse Short Channel Effect (RSCE) of NMOS devices. The implantation that is performed prior to S/D formation is followed by either RTA or furnace annealing using different ramp rates. The influence of the ramp rates on the RSCE is then studied. The experimental data are analysed using combined process and device simulations by taking into account the dissolution kinetics of {113} defects,",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:bz8QjSJIRt4C",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Structural and electrical properties of silicon dioxide layers with embedded germanium nanocrystals grown by molecular beam epitaxy",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1555709",
            "Abstract": "A sheet of spherical, well-separated, crystalline Ge nanodots embedded in SiO2 on top of a p-(001)Si wafer was fabricated by molecular beam epitaxy (MBE) combined with rapid thermal processing and characterized structurally and electrically. The average size of the Ge nanodots was estimated to be 4.5 nm with an average aerial density of 3×1011 cm−2, situated at 4.4 nm in average away from the Si/SiO2 interface. Significant charge storage effects were observed through capacitance–voltage measurements of metal–oxide–semiconductor capacitors.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:d1gkVwhDpl0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Effect of ion energy and dose on the positioning of 2D-arrays of Si nanocrystals ion beam synthesized in thin SiO2 layers",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138694770200855X",
            "Abstract": "Silicon nanocrystals buried in a thin oxide can be used as charge storage elements and be integrated in standard CMOS technology to fabricate new non-volatile memory devices. The control of the distances between the nanocrystals layer and the two electrodes of the MOS determines the final characteristics of the device (write–erase and retention times). This 2D arrays of ncs can be elaborated by ion implantation. In this work, we study by TEM the effect of varying the beam energy and dose on the positioning of 2D-arrays of nanocrystals within 10 nm thick oxide after annealing. Our results show that the “injection distance” can be precisely tuned in the 5–8 nm range by varying the beam energy.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:mVmsd5A6BfQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Experiments and simulation of multilevel resistive switching in forming free Ti/TiO2−xRRAM devices",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7962574/",
            "Abstract": "We report high multilevel resistive switching in forming free resistive random access memory (RRAM) using Ti (4 nm) as top electrode. We demonstrate that at least six-level resistance states could be obtained by modifying the amplitude of the voltage pulse applied on the memory cell or the compliance current, exhibiting excellent resistance uniformity and retention capability. The resistive switching mechanism is believed to be associated with the generation/dissolution of conducting filaments (CFs) that mainly consist of oxygen vacancies, while the gradual transitions indicate the manifestation of trap-assisted conduction model. During DC scan low power resistive switching was recorded for both SET (about 50 mW) and RESET (about 50 μW) processes, while for pulse voltages even lower power was achieved (0.4 mW and 30 nW respectively) for 100 ns switching duration. A numerical approach is also presented …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:yqoGN6RLRZoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proton radiation effects on nanocrystal non-volatile memories",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4291799/",
            "Abstract": "We report on proton radiation effects on Si-nanocrystal (Si-NCs) MOS capacitors and nMOS transistors aiming at non-volatile memory applications. Irradiation experiments were conducted on NC MOS capacitors using protons of 1.5 MeV and 6.5 MeV and on NC nMOS transistors using protons of 1.5 MeV. The range of doses investigated was ~ 1 to ~ 100 Mrad (SiO 2 ). A 2-D layer of Si NCs with ~ 3 nm mean diameter and 10 12  cm -2  surface density was successfully achieved by low-energy (1 keV) ion-beam-synthesis in thin SiO 2  layers. After irradiation, programmed capacitors are found to undergo bit flip while programmed transistors are not. Charge retention measurements at room temperature for the write and erase states of irradiated and non-irradiated samples reveal that a significant memory window exists at an extrapolated time of ten years even after an irradiation dose as high as 120 Mrad (SiO 2 ). The …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling and experiments on diffusion and activation of phosphorus in germanium",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3117485",
            "Abstract": "We report on phosphorus diffusion and activation related phenomena in germanium. We have used both conventional thermal processing and laser annealing by pulsed nanosecond Nd:YAG laser. Chemical profiles were obtained by secondary-ion-mass spectroscopy, sheet resistance was estimated by the van der Pauw method, and structural defects were monitored by transmission electron microscopy. Our study covers the temperature range from 440 to 750 °C, and we were able to efficiently simulate the dopant profiles within that temperature range, taking into account a quadratic dependence of the P diffusion coefficient on the free electron concentration. To achieve that we have taken into account dopant activation dependence on temperature as well as dopant pile-up near the surface and dopant loss owing to outdiffusion during the annealing. A combined laser thermal treatment above the melting …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:Zph67rFs4hoC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Wrinkled Ag nanostructured gratings towards single molecule detection by ultrahigh surface Raman scattering enhancement",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400515004426",
            "Abstract": "A novel triangular cross-section Ag nanostructured grating is demonstrated in this paper, which can be used as an extremely high sensitivity bio-chemical sensing substrate. Ag films with a thickness of several nanometers and up to 40 nm were sputtered on a pre-strained PDMS substrate. After releasing the PDMS, the Ag films wrinkled and sharp structures were formed due to the mechanical stress on the continuous thin metallic nano films. Because of the electromagneticfield enhancement at the sharp peaks, extremely high Surface Enhanced Fluorescence (SEF) and Surface Enhanced Raman Scattering (SERS) was observed which can be used to detect Crystal Violet (CV) and Rhodamine 6G (R6G) molecules with concentrations down to 10−14 M. The method provides an effective and inexpensive technique to create wrinkled periodic singular patterns for various applications.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:86PQX7AUzd4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Simulation tool for predicting and optimizing the performance of nanoparticle based strain sensors",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6528/abf195/meta",
            "Abstract": "In this work a Monte-Carlo tool simulating platinum nanoparticle (NP) based strain-sensors, on flexible substrates, is presented. The tool begins by randomly placing the NPs on the simulation area, with the ability to tune the NP surface coverage. After the calculation of the conductive paths that were generated in the previous step, the whole system is represented with an equivalent circuit; the NPs and the NP clusters act as nodes and the inter-particle gaps as resistances. The effective resistance is then calculated with the use of a Laplacian Matrix, which has proven extremely effective in significantly reducing the overall computational time. The simulation results are then benchmarked with experimental measurements from actual strain-sensing devices. The software is capable of predicting the strain-sensitivity for different NP sizes as well as surface coverages, emerging as a powerful computational tool for design …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:PaBasH6fAo0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A low power RF harvester for a smart passive sensor tag with integrated antenna",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924424712000052",
            "Abstract": "The design and implementation of a low power RF harvester for use in smart passive sensor tags applied in structural health monitoring applications is presented. The tag operation is divided into two cycles: a standby mode cycle and a fully operational cycle. While in standby the tag requires only 5 μA at 2.5 V while any excess energy is stored in an accumulation capacitor and made available to the tag during full operation, where a low power commercial microcontroller responsible for sensor measurement and data transmission turns on. An optimized PIFA-type embedded antenna has been integrated in the design in order to enable tag operation near ground planes and metal structures. The system operates in the 430 MHz band requiring a measured minimum input RF power of −5.8 dBm. Tag operation has been tested by activating the onboard microcontroller. Indoor measurements as well as measurements …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Influence of the annealing ambient on the relative thermal stability of dislocation loops in silicon",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168583X01005018",
            "Abstract": "In this work, we have studied the relative stability of perfect (PDLs) and faulted (FDLs) dislocation loops formed during annealing of preamorphised silicon. In particular, we have investigated the effect of the annealing ambient (N2, O2) on their thermal evolution. Transmission Electron Microscopy analysis shows that after short annealing times FDLs are the more stable defects if the ripening process is conservative or if the surface acts as a sink for Si interstitial atoms. On the contrary, when the surface injects Si atoms (oxidising conditions) or for long annealing times under conservative conditions, PDLs are stabilised. We have calculated the formation energies of these defects as a function of their sizes and we have found that a stability inversion occurs for sizes of about 80 nm. All the experimental results presented here are explained by making use of these calculations.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:NaGl4SEjCO4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Investigation of the gate oxide leakage current of low temperature formed hafnium oxide films",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4795278",
            "Abstract": "In this work, low temperature physically deposited hafnium oxide films are investigated in terms of their electrical properties through measurements and analysis of leakage currents in order to understand the defect's behavior in this dielectric material. Two extreme conditions will be presented and discussed: the first one concerns the use of a nearly trap-free hafnium oxide layer, while the second one concerns the use of a hafnium oxide film with a very large amount of electrically active traps. Particular emphasis is given to the detection and comparison of the shallow and deep traps that are responsible for the room temperature leakage of these films. It is shown that by modifying the amount of traps in the hafnium oxide layer, achieved by changing the deposition conditions, the trap's energy location is heavily influenced. The nearly trap-free sample exhibits Ohmic conduction at low fields (with activation energies in …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:URolC5Kub84C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Assembly of charged nanoparticles by self-electrodynamic focusing",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5331603/",
            "Abstract": "We demonstrate a self-assembly process of charged metallic or semiconducting nanoparticles on silicon substrates using conventional photoresist patterning. The self-assembly of nanoparticles is mainly due to a self-electric focusing effect created by the electric field of charged nanoparticles landed on the photoresist patterns. The detailed parameters that affect the focusing effect are investigated both experimentally and theoretically using Monte Carlo simulations. The presented technique is a simple and effective method for the fabrication of patterned nanoparticle lines made from different materials.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ClCfbGk0d_YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integration of organic insulator and self-assembled gold nanoparticles on Si MOSFET for novel non-volatile memory cells",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931704002102",
            "Abstract": "We have fabricated a hybrid non-volatile gold nanoparticle floating-gate memory metal insulator semiconductor field effect transistor (MISFET) device combining silicon technology and organic thin film deposition. The nanoparticles are deposited by chemical processes at room temperature over a 5 nm thermal silicon dioxide layer. A multi-layer organic insulator (cadmium arachidate) deposited by the Langmuir–Blodgett technique at room temperature covers the nanoparticle layer and separates it from an Al gate electrode. Charge injection/rejection into the nanoparticles takes place by applying different voltage pulses (less than ±6 V) to the gate electrode, resulting in significant threshold-voltage shift. Charge retention measurements reveal that the device has non-volatile behavior.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Novel conducting polymer current limiting devices for low cost surge protection applications",
            "Publication year": 2014,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4899246",
            "Abstract": "We report on the development of novel intrinsic conducting polymer two terminal surge protection devices. These resettable current limiting devices consist of polyaniline nanofibres doped with methane sulphonic acid electrochemically deposited between two 55 μm spaced gold electrodes. At normal applied voltages, the low resistance devices act as passive circuit elements, not affecting the current flow. However during a current surge the devices switch from ohmic to non-ohmic behaviour, limiting current through the device. After the current surge has passed, the devices reset back to their original state. Our studies show that a partial de-doping/re-doping process caused by the rapid diffusion of moisture out of or into the polymer film during joule heating/cooling is the underlying mechanism responsible.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:PoWvk5oyLR8C",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Understanding the formation of conducting filaments in RRAM through the design of experiments",
            "Publication year": 2016,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129156416400073",
            "Abstract": "The resistive switching effect in TiO2-x memory devices is thoroughly investigated in order to obtain optimum memory performance, in terms of switching ratio, uniformity of the switching characteristics and multilevel capability. As a result, various fabrication procedures were followed with the aim to enhance the above properties. The main body of our devices was TiO2-x thin film, with constant thickness of 45 nm, while different approaches were implemented during the fabrication process, such as increasing the oxygen content during film growth, depositing top electrodes with different thicknesses, inserting a layer of nanocrystals (NCs) within the middle of the dielectric and using two various oxygen contents during film deposition in order to create a homobilayer structure. The common feature of these techniques is to control the regions where oxygen vacancy creation will take place in order to control the formation …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:mNrWkgRL2YcC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Chemiresistive sensor fabricated by the sequential ink-jet printing deposition of a gold nanoparticle and polymer layer",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931710001127",
            "Abstract": "A technique for the fabrication of chemiresistive sensors using ink-jet printing is reported. Gold nanoparticles stabilised in water were ink-jet printed on gold interdigitated electrodes patterned on an oxidized silicon wafer. As a first step the influence of substrate functionalization, electrode spacing, and nanoparticle density were investigated by electrical measurements and microscopy imaging. Finally a second layer of PHEMA polymer was printed on top of the gold nanoparticle films. The device was exposed to vapours of humidity and ethanol and the obtained results are presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:BqipwSGYUEgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Competitive technology approaches for electronic hybridisation detection in a microsystem with microfluidics for diagnosis genetic tests",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4462703/",
            "Abstract": "This paper is presenting competitive technology alternatives for the electronic hybridization detection in a microsystem with microfluidics for diagnosis genetic tests that are carried out by two competitive research projects. The technologies developed are a photosensor, a capacitive sensor and an optical real-time affinity biosensor. The performance of those biosensors will be evaluated but also their manufacturability and cost will define the appropriateness of each one for industrialization and their integration on a microsystem for diagnosis genetic testing",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Institute of Microelectronics, NCSR'Demokritos', 15310 Aghia Paraskevi, Greece E-mail: dskar (a) imel. demokritos. gr M. OMRI, LF GILES and A. CLAVERIE CEMES/CNRS, BP 4347, 31055 Toulouse Cedex, France",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=X21qDQAAQBAJ&oi=fnd&pg=PA115&dq=info:xY2KmLyKCJAJ:scholar.google.com&ots=Bi8oNeqkui&sig=4hO6OY8XFDbctlWy1fBhoq-z_Qs",
            "Abstract": "In this work we use dislocation loops and boron-doped 8-layers to monitor the interstitial injection during common and nitrous oxidation of silicon at low temperatures (850–950 C). The interstitials captured by the loops are measured using Transmission Electron Microscopy. The number of Si atoms released after oxynitridation was calculated from the difference between the total number of atoms stored in the loops for oxidizing and inert ambient. We found that this number is larger compared with the same dry oxygen oxidation conditions. This result is also confirmed by measuring the diffusivity enhancement of boron 6-layers during oxidation under both ambients.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:kh2fBNsKQNwC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Emulating Artificial Synaptic Plasticity Characteristics from SiO2-Based Conductive Bridge Memories with Pt Nanoparticles. Micromachines 2021, 12, 306",
            "Publication year": 2021,
            "Publication url": "https://search.proquest.com/openview/5f9aa4a36784a535163e5a25974cf67e/1?pq-origsite=gscholar&cbl=2032359",
            "Abstract": "The quick growth of information technology has necessitated the need for developing novel electronic devices capable of performing novel neuromorphic computations with low power consumption and a high degree of accuracy. In order to achieve this goal, it is of vital importance to devise artificial neural networks with inherent capabilities of emulating various synaptic properties that play a key role in the learning procedures. Along these lines, we report here the direct impact of a dense layer of Pt nanoparticles that plays the role of the bottom electrode, on the manifestation of the bipolar switching effect within SiO 2-based conductive bridge memories. Valuable insights regarding the influence of the thermal conductivity value of the bottom electrode on the conducting filament growth mechanism are provided through the application of a numerical model. The implementation of an intermediate switching transition …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:nRpfm8aw39MC",
            "Publisher": "s Note: MDPI stays neutral with regard to jurisdictional claims in published maps and institutional affil-iations."
        },
        {
            "Title": "Resistive memory multilayer structure with self-rectifying and forming free properties along with their modification by adding a hafnium nanoparticle midlayer",
            "Publication year": 2017,
            "Publication url": "https://avs.scitation.org/doi/abs/10.1116/1.4968204",
            "Abstract": "Despite the amount of work that has been produced using TiO2 to study its resistance dynamic properties, the switching mechanism is not fully understood. In this context, the authors have fabricated and investigated the switching mechanism of TiO2 based memristors with and without the incorporation of crystalline hafnium nanoparticles. The resistive switching of the devices needs no electroforming and is dictated by electrode/film interface modifications. The results indicate that the dominant conduction mechanism is Schottky emission while in the case of hafnium nanoparticles incorporation, a synthesis of which has not been reported before, conduction prevailing mechanism changes to Fowler–Nordheim tunneling. Insight on device operation can be obtained by revealing the role of nanoparticles on loss of rectifying properties, through local modification of oxygen vacancy concentration.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:HIFyuExEbWQC",
            "Publisher": "American Vacuum Society"
        },
        {
            "Title": "Tungsten doping effect on V2O5 thin film electrochromic performance",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0013468619316147",
            "Abstract": "Electrochromic W-doped V2O5 thin films have been deposited on FTO-coated glass substrates by RF magnetron sputtering. The structural, morphological, optical and electrochromic properties of films deposited with various tungsten concentrations were studied. The increase of the doping content induces an amorphization of the films, which contributes to an enhanced cycling performance. High W doping (resulting in WO3) values exhibit high coloration efficiency of ∼ 41 cm2 C−1at 560 nm and large transmittance modulation of 76.9% at 560 nm. Both WO3 and V2O5 are electrochromic materials with very good properties, hence their combination is of interest from both technological and fundamental perspectives.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:6yz0xqPARnAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Influence of Ge implantation on the mechanical properties of polycrystalline silicon microstructures",
            "Publication year": 2002,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0960-1317/12/4/318/meta",
            "Abstract": "Polycrystalline silicon (poly-Si) based microstructures, with boron doping (B-doping), are studied, with reference to their built-in stress, for different germanium implantation (Ge-implantation) doses. The microstructures are studied free standing and under static and dynamic deformations, by a combination of macroscopic (pull-in voltage, resonance frequency) and microscopic (micro-Raman) experimental techniques, in comparison with numerical calculation methods. The counterbalancing effect of Ge-implantation versus the B-doping, with respect to the built-in stress, is examined in poly-Si. Measurements, with three different experimental methods, and calculations, on bridges designed and fabricated for micromachining applications, show, consistently, the same maximization trend for the built-in stress, with a maximum at a Ge-dose of 10 15 ions/cm 2, in agreement with a similar non-monotonic Ge-dependence of …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:maZDTaKrznsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A capacitive biosensor based on ultrathin Si membranes",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4716421/",
            "Abstract": "A biosensor which takes advantage of surface stress changes during biological interactions and is able to translate them into a capacitive signal is presented. The sensor consists of an ultrathin silicon membrane on which receptor molecules are immobilized. During biomolecular interactions, the surface stress changes and the membrane deflects resulting in a change in device capacitance. The biosensor is part of a 16 times 16 array thus allowing for the making of larger assays with the concurrent sensing of multiple biological targets. First results using the biotin-steptavidin system are presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Emulating Artificial Synaptic Plasticity Characteristics from SiO2-Based Conductive Bridge Memories with Pt Nanoparticles",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1034758",
            "Abstract": "The quick growth of information technology has necessitated the need for developing novel electronic devices capable of performing novel neuromorphic computations with low power consumption and a high degree of accuracy. In order to achieve this goal, it is of vital importance to devise artificial neural networks with inherent capabilities of emulating various synaptic properties that play a key role in the learning procedures. Along these lines, we report here the direct impact of a dense layer of Pt nanoparticles that plays the role of the bottom electrode, on the manifestation of the bipolar switching effect within SiO 2-based conductive bridge memories. Valuable insights regarding the influence of the thermal conductivity value of the bottom electrode on the conducting filament growth mechanism are provided through the application of a numerical model. The implementation of an intermediate switching transition slope during the SET transition permits the emulation of various artificial synaptic functionalities, such as short-term plasticity, including paired-pulsed facilitation and paired-pulse depression, long-term plasticity and four different types of spike-dependent plasticity. Our approach provides valuable insights toward the development of multifunctional synaptic elements that operate with low power consumption and exhibit biological-like behavior.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:MpfHP-DdYjUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A Si/SiGe MOSFET utilizing low-temperature wafer bonding",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931704005684",
            "Abstract": "A process scheme for the fabrication of a low temperature SiGe V-groove MOSFET is demonstrated. The transfer and output characteristics show promising results for the device performance. The source/drain resistance and the quality of the gate insulator/SiGe channel must be optimized for device operation improvement.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Effect of annealing environment on the memory properties of thin oxides with embedded Si nanocrystals obtained by low-energy ion-beam synthesis",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1588378",
            "Abstract": "The effect of annealing in diluted oxygen versus inert environment on the structural and electrical characteristics of thin silicon dioxide layers with embedded Si nanocrystals fabricated by very low-energy silicon implantation (1 keV) is reported. Annealing in diluted oxygen increases the thickness of the control oxide, improves the integrity of the oxide and narrows the size distribution of the nanocrystals without affecting significantly their mean size (∼2 nm). Strong charge storage effects at low gate voltages and enhanced charge retention times are observed through electrical measurements of metal-oxide-semiconductor capacitors. These results indicate that a combination of low-energy silicon implants and annealing in diluted oxygen allows for the fabrication of improved low-voltage nonvolatile memory devices.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:9yKSN-GCB0IC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Chemical sensing based on double layer PHEMA polymer and platinum nanoparticle films",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925400511011488",
            "Abstract": "Chemical gas sensors have been fabricated from platinum and poly(2-hydroxyethylmethacrylate) (PHEMA) polymer. Sputtered platinum nanoparticles have been deposited on flat silicon substrates and a second layer of PHEMA polymer has been deposited on top using ink-jet printing. Density of the platinum nanoparticles and resistance of the device, which can both be tuned by controlling the deposition time, directly affect the response of the sensors as measured in the presence of ethanol and humidity. Chemi-resistive and chemi-capacitive sensors capable of detecting low gas concentrations (1000 ppm of humidity and 500 ppm of ethanol) have been made possible.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Raman enhancement of rhodamine adsorbed on Ag nanoparticles self-assembled into nanowire-like arrays",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1556-276X-6-629",
            "Abstract": "This work reports on Raman scattering of rhodamine (R6G) molecules absorbed on either randomly distributed or grating-like arrays of approximately 8-nm Ag nanoparticles developed by inert gas aggregation. Optimal growth and surface-enhanced Raman scattering (SERS) parameters have been obtained for the randomly distributed nanoparticles, while effects related to the aging of the silver nanoparticles were studied. Grating-like arrays of nanoparticles have been fabricated using line arrays templates formed either by fracture-induced structuring or by standard lithographic techniques. Grating structures fabricated by both methods exhibit an enhancement of the SERS signal, in comparison to the corresponding signal from randomly distributed Ag nanoparticles, as well as a preferential enhancement in the areas of the sharp features, and a dependence on the polarization direction of the incident exciting laser …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:l7t_Zn2s7bgC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Memory programming of TiO2− x films by Conductive Atomic Force Microscopy evidencing filamentary resistive switching",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433215001580",
            "Abstract": "Resistive Random Access Memory (RRAM) with a structure Au/Ti/TiO2−x/Au demonstrated a clear bipolar resistive switching behavior without the necessity of an initial electroforming process. The titanium oxide (TiO2−x) thin film was deposited by reactive RF magnetron sputtering at room temperature in a controlled oxygen/argon ambient. The high density of oxygen vacancies within the film (induced by the low oxygen content) is an essential component for the formation of conducting filaments and demonstration of DC or nanosecond pulsed resistance switching, but also impose limitations for the conduction behavior of the high resistance state. Conductive Atomic Force Microscopy (C-AFM) was then employed in order to investigate the nanoscale electrical properties of our device. In situ current distribution during the SET process disclosed possible formation of conducting filaments while DC sweeping bias …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:hCrLmN-GePgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Point defect injection during nitrous oxidation of silicon at low temperatures",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.371986",
            "Abstract": "In this work we use dislocation loops and boron-doped δ layers to monitor the interstitial injection during nitrous oxidation of silicon at low temperatures (850–950 °C). The interstitials captured by the loops are measured using transmission electron microscopy. The number of Si atoms released after oxynitridation was calculated from the difference between the total number of atoms stored in the loops for oxidizing and inert ambient. We found that this number is larger compared with the same dry oxygen oxidation conditions, although the oxidation rate is lower during oxynitridation in comparison to dry oxidation. Analysis of the earlier data leads to higher supersaturation ratio of interstitials in the former case. This result is also confirmed by measuring the diffusivity enhancement of boron δ layers during oxidation under both ambients.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:QIV2ME_5wuYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Assembly of charged nanoparticles using self-electrodynamic focusing",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/20/36/365605/meta",
            "Abstract": "In this paper, a self-assembly process of charged nanoparticles on a silicon substrate is demonstrated. The self-assembly of the nanoparticles is mainly due to a self-electric-focusing effect caused by the electric field which is created by charged nanoparticles when these are deposited on photoresist patterns. The dynamics of the focusing process and the detailed parameters that affect the focusing effect are discussed both experimentally and by Monte Carlo simulation. The presented technique is a quite simple and effective method to fabricate nanoparticle stripes from different materials.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ZeXyd9-uunAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Coalescence of Cluster Beam Generated Sub‐2 nm Bare Au Nanoparticles and Analysis of Au Film Growth Parameters",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/andp.201700256",
            "Abstract": "In this work is presented the growth model for Au films grown on a carbon substrate at room temperature by using as building blocks Au nanoparticles (NPs) with 1.4 nm mean size generated via remote cluster beam synthesis and soft landing on the substrate. The key results highlighted in this work are that 1) the deposited nanoparticles coalesce at substrate level in such a way that the film growth is 3D, 2) newly formed nanoparticles at substrate level are predominantly magic number clusters and 3) coalescensce takes place as soon as two neighboring nanopartciles come closer than a critical distance. The film growth was investigated by TEM as a function of Au load, in the range 0–1.2 μg/cm2. Two distinct regimes are identified: the “landing regime” and the “coalescence regime”. During the latter the film growth is 3D with a dynamic scaling exponent z of 2.13. Particular attention was devoted to the study of the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:Ehil0879vHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proton radiation tolerance of nanocrystal memories",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386947706005911",
            "Abstract": "We report on proton radiation tolerance of Si-nanocrystal (Si-NCs) MOS structures aiming at non-volatile memory applications. Si-NCs were formed by low-energy (1 keV) ion-beam-synthesis within a 9 nm thick SiO2 layer. A 2-D layer of Si-NCs with 3 nm mean diameter and 1012 cm−2 surface density was successfully achieved. After fabrication of Al capacitors, samples with and without Si-NCs were 1.5 and 6.5 MeV proton were irradiated at doses ranging from 1 Mrad (SiO2) to 120 Mrad (SiO2). Significant irradiation-dose-dependent shifts are detected in the C–V curves of the NC-MOS cells and programmed cells are found to undergo bit flip. Despite the above, the attainable memory windows after write/erase operations remain unchanged. Retention time characteristics at room temperature for the write and erase states of irradiated and non-irradiated samples reveal that even after an irradiation dose as high as …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:CHSYGLWDkRkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": " Laser Annealing for USJ Formation in Silicon: Comparison of Simulation and Experiment",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6722883/",
            "Abstract": "In this paper, we compare the experimental and simulation results of the effect of laser annealing on boron implanted silicon using a CO 2  source and commercially available process TCAD tools. The main objective of this analysis is the prediction of the evolution of temperature distribution induced into the wafer during the laser irradiation below the melting threshold as well as its effect on boron diffusion and activation kinetics. A series of factors are considered along with the use of advanced heat transfer and dopant diffusion models provided by the TCAD tool to accurately prototype the effect of the CO 2  irradiation on temperature and dopant distribution. These include the nonuniformity of the incident laser beam, the strong dependence of heat capacity and thermal conductivity from temperature and, most importantly, the dependency of the absorptivity from temperature and dopant distribution, which requires the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacitive pressure-responsive devices and their fabrication",
            "Publication year": 2004,
            "Publication url": "https://patents.google.com/patent/US6704185B2/en",
            "Abstract": "A method for making capacitive silicon pressure sensors and pressure switches with high long-term stability involves fabrication by wafer bonding of a silicon substrate wafer with another silicon wafer where a highly boron-doped diaphragm is defined by a self-aligned doping process through a window defined on an insulating layer. The long-term stability of the device is secured by anisotropically etching the window, eg by reactive ion etching, so as to create vertical window walls. The flatness of the diaphragm can be secured by the provision of an insulating film on the backside of the substrate wafer that compensates the stress on the silicon diaphragm created by the insulating layer present between the two wafers. The cavity formed by the window may contain gas or it may be evacuated in which case the fabrication method may also involve a process step facilitating the evacuation of the cavity and sealing the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ESSDERC 2009",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5331378/",
            "Abstract": "The following topics are dealt with: SRAM circuit; DRAM; OTP; high frequency devices; thin film CMOS; non-CMOS device modeling; dielectric characterization; carbon based electronics; alternative memories; silicon nanostructures; reliability and degradation; flash memories; thermal modeling; nanowire; transport engineering; RF MEMS; circuit design; high mobility channel; high k dielectrics; variability; RF power transistors; and tunneling devices.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:kVjdVfd2voEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Oxidation of nitrogen-implanted silicon: Energy dependence of oxide growth and defect characterization of the silicon substrate",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1535260",
            "Abstract": "It is well known that nitrogen implantation in silicon leads in reduction of the SiO2 thickness in implanted wafers, which makes this a very promising technique for present and future device processing. In this work we investigate the influence of the implantation energy on oxidation kinetics in nitrogen-implanted silicon. Nitrogen was implanted in silicon wafers at low (3 keV), and medium (25, 80, and 150 keV) energies and oxidations were performed at various temperatures (800–900 °C) and times. The experiment shows that the decrease in the oxide thickness is smaller when nitrogen is implanted closer to the silicon surface. We attribute this to nitrogen out-diffusion during the ramping and the initial oxidation steps, which is more effective when nitrogen is placed closer to the surface. Additional experiments varying the ramping time support this explanation. An additional study of the growth of extended defects under …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:IWHjjKOFINEC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Use of isotopically pure silicon material to estimate silicon diffusivity in silicon dioxide",
            "Publication year": 2001,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/use-of-isotopically-pure-silicon-material-to-estimate-silicon-diffusivity-in-silicon-dioxide/C21C466C02C043786632C883FB874FF6",
            "Abstract": "In this paper we report measurement of the silicon diffusion coefficient in silicon dioxide films using isotopically enriched 28Si silicon dioxide layers. 30Si atoms are introduced in excess in a stoichiometric isotopically pure silicon dioxide layer either by ion implantation or by a predeposition technique and the time evolution of the 30Si concentration profile under various thermal conditions is monitored using SIMS. The estimated diffusivity values are significantly higher than previouslyreported values for Si diffusion within a stoichiometric oxide and closer to reported values for excess Si diffusion within an oxide.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:EUQCXRtRnyEC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Trapping properties of sputtered hafnium oxide films: Bulk traps vs. interface traps",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609010007194",
            "Abstract": "The purpose of this work is to investigate the influence of the spatial distribution of traps on the electrical characteristics of hafnium oxide films deposited by physical vapor deposition. Samples were Al gated metal-oxide-semiconductor capacitors with hafnium oxide films deposited on SiO2 layer thermally grown on Si. During capacitance–voltage measurements large hysteresis, up to 10 V, are observed in all samples. It is shown that depending on the hafnium oxide deposition conditions, the spatial distribution of the traps responsible for the hysteresis can be either two dimensional (interface/border traps) or three dimensional (bulk traps).",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:dfsIfKJdRG4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Flexible platinum nanoparticle strain sensors",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6818891/",
            "Abstract": "Using a modified magnetron sputtering technique, platinum nanoparticles having a mean diameter of 4-6 nm have been deposited on flexible polyimide substrates. The polyimide substrates have been previously patterned with gold interdigitated electrodes having an inter-finger distance of 10 μm using conventional photo lithography and the e-gun evaporation of gold. By controlling the nanoparticle deposition time, platinum nanoparticle sensors of varying sensitivity can be produced. As a result a flexible cost effective alternative to silicon strain sensors is hereby presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:VaXvl8Fpj5cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A COMPARISON BETWEEN POINT DEFECT INJECTING PROCESSES IN SILICON USING EXTENDED DEFECTS AND DOPANT MARKER LAYERS AS POINT DEFECT DETECTORS",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0025",
            "Abstract": "In this work we use dislocation loops and boron - doped δ-layers to monitor the interstitial injection during common and nitrous oxidation of silicon at low temperatures (850–950 °C). The interstitials captured by the loops are measured using Transmission Electron Microscopy. The number of Si atoms released after oxynitridation was calculated from the difference between the total number of atoms stored in the loops for oxidizing and inert ambient. We found that this number is larger compared with the same dry oxygen oxidation conditions. This result is also confirmed by measuring the diffusivity enhancement of boron δ-layers during oxidation under both ambients.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating the origins of ultra-short relaxation times of silver filaments in forming-free SiO2-based conductive bridge memristors",
            "Publication year": 2020,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6528/aba3a1/meta",
            "Abstract": "The threshold switching effect is considered of outmost importance for a variety of applications ranging from the reliable operation of crossbar architectures to emulating neuromorphic properties with artificial neural networks. This property is strongly believed to be associated with the rich inherit dynamics of a metallic conductive filament (CF) formation and its respective relaxation processes. Understanding the origin of these dynamics is very important in order to control the degree of volatility and design novel electronic devices. Here, we present a synergistic numerical and experimental approach in order to deal with that issue. The distribution of relaxation time is addressed through time-resolved pulse measurements whereas the entire switching behavior is modeled through a 2D dynamical model by taking into account the destructive interference of the drift/diffusion transport mechanisms and the Soret diffusion …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:CaZNVDsoPx4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Optimization of hafnium oxide for use in nanoparticle memories",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931711003339",
            "Abstract": "In this work we investigate the dielectric properties of hafnium oxide deposited by RF magnetron sputtering with the purpose to implement it as control oxide for non-volatile memories based on metallic nanoparticles as charge storage centers. The influence of deposition temperature, ambient and post-deposition annealing onto the trapping properties of hafnium oxide, deposited over a tunneling silicon oxide layer, will be discussed and optimized conditions under which no charge trapping is observed into the dielectric stack will be presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:35N4QoGY0k4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Combination of integrated thermal flow and capacitive pressure sensors for high sensitivity flow measurements in both laminar and turbulent regions",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/068/meta",
            "Abstract": "A combination of a silicon thermal flow and two capacitive pressure sensors placed in a specially designed housing, is proposed for high sensitivity flow measurements in both laminar and turbulent flows. The system of these sensors can determine the transition point between laminar and turbulent region with sufficient accuracy. The pressure distribution in the flow tube was studied in detail experimentally by using a series of pressure sensors. Analytical and simulation results were extracted for different sensor configurations in the flow system. The influence of the position of the sensor in the flow tube, as well as the pressure profile at the surface of the sensor die, was studied and the optimum conditions were found. Good agreement between experimental results and theory was found.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:_Ybze24A_UAC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Nanoparticles-Based Flash-Like Nonvolatile Memories: Cluster Beam Synthesis of Metallic Nanoparticles and Challenges for the Overlying Control Oxide Layer",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48705-2_5",
            "Abstract": " Nanoparticles          (NPs) are of great scientific interest as they are effectively a bridge between bulk materials and atomic or molecular structures. In this work the focus is to present results concerning the use of NPs deposited using a novel room temperature cluster beam technique and show their applications in an emerging non-volatile memory (NVM) technology which represents an evolution of the standard floating gate NVM (which is the building block of the Flash architecture) and consists in the replacement of the floating gate with a NP layer. This work, except presenting new results, provides also a review and in depth insight into the main results obtained by the authors in the last decade.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:fFSKOagxvKUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "High-density plasma silicon oxide thin films grown at room-temperature",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931708000191",
            "Abstract": "The fabrication at room-temperature of thin (<8 nm) silicon oxide films has been achieved, in a high-density helicon plasma source reactor using Ar/O2 mixture, exhibiting relatively low concentration of fixed oxide and interface charges, after annealing. The developed plasma oxidation process was employed in order to fabricate SOI-MOSFETs at low thermal budget with competitive operating characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Competitive technology approaches for Electronic Hybridisation Detection in a microsystem with microfluidics for diagnosis genetic tests",
            "Publication year": 2006,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.ieee-art-000004462703",
            "Abstract": "This paper is presenting competitive technology alternatives for the electronic hybridization detection in a microsystem with microfluidics for diagnosis genetic tests that are carried out by two competitive research projects. The technologies developed are a photosensor, a capacitive sensor and an optical real-time affinity biosensor. The performance of those biosensors will be evaluated but also their manufacturability and cost will define the appropriateness of each one for industrialization and their integration on a microsystem for diagnosis genetic testing",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:cK4Rrx0J3m0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emulating artificial mechanoreceptor functionalities from SiO2-based memristor and PDMS stretchable sensor for artificial skin applications",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9567875/",
            "Abstract": "The development of robust artificial sensory systems that will be able to detect, memorize and respond to external stimuli is attracting a considerable amount of interest over the last years towards emulating artificial skin properties. Skin is the largest sensory system of the human body that carries out complex procedures by employing a variety of biological receptors. However, it is quite difficult to acquire stretchable artificial skin functionalities by combining the present tactile sensors. Along these lines, we report here a sensory system that has the ability to detect various strain loads with excellent sensitivity and at the same time respond and store the applied stimuli. In order to attain this goal, we used a bipolar switching memory device made on poly-ethylene naphthalate (PEN) substrate and Pt nanoparticles (NPs)-based sensor on poly-dimethylsiloxane (PDMS). The memristor operates only under strain conditions …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:7H_MAutzIkAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid silicon–organic nanoparticle memory device",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1604962",
            "Abstract": "We demonstrate a nonvolatile electrically erasable programmable read-only memory device using gold nanoparticles as charge storage elements deposited at room temperature by chemical processing. The nanoparticles are deposited over a thermal silicon dioxide layer that insulates them from the device silicon channel. An organic insulator deposited by the Langmuir–Blodget technique at room temperature separates the aluminum gate electrode from the nanoparticles. The device exhibits significant threshold voltage shifts after application of low-voltage pulses (⩽±6 V) to the gate and has nonvolatile retention time characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:qjMakFHDy7sC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Tunable Properties of Mg-Doped V2O5 Thin Films for Energy Applications: Li-Ion Batteries and Electrochromics",
            "Publication year": 2017,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/acs.jpcc.6b09018",
            "Abstract": "Vanadium pentoxide (V2O5) is doped for the first time with Mg, and the influence of Mg content on the films properties and functionality is investigated in detail, emphasis given on the electrochemical and electrochromic response. The Mg-doped V2O5 films exhibit characteristics suitable for lithium ion batteries and electrochromic window applications, the optimization of the functionality depending on the Mg content. Low Mg content (2 at. % Mg) appears to favor lithium ion battery applications, the corresponding films exhibiting high specific discharge capacity, increased diffusion coefficient, and high capacity retention. In contrast, high Mg content (15 at. % Mg) is more favorable for electrochromic windows, presenting fast switching response time, high coloration efficiency, and high visible transmittance. In both cases, the determined characteristics are superior or at least equivalent to those reported for V2O5 doped …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:DJbcl8HfkQkC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Accurate TEM measurements of the injection distances in nanocrystal based memories",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1258089/",
            "Abstract": "Silicon nanocrystals buried in a thin oxide can be used as charge storage elements and be integrated in standard CMOS technology to fabricate new non-volatile memory devices. The control of the distances between the nanocrystals layer and the two electrodes of the MOS determines the final characteristics of the device (write-erase and retention times). This 2D arrays of ncs can be elaborated by ion implantation of Si at low energy. In this paper, we compare two transmission electron microscopy methods that can be used to extract such distances in 10 nm-thick SiO 2  layers implanted with Si at low energy. We demonstrate by using image simulations that conventional electron microscopy under out-of-Bragg and strongly underfocussed conditions is the fastest and most efficient technique to be used for routine measurements at subnanometer resolution. Our results show that the injection distance in such devices …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling of charge-trapping non-volatile-memories based on HfO2",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931711004448",
            "Abstract": "In the present work we present experimental results and the first simulation results concerning the charge-trapping properties of devices based on HfO2, MNOS-like, for non-volatile-memory applications. Hafnium oxide sputtered on top of a silicon dioxide tunneling layer represents the storage layer for the charges injected/extracted from the p-type silicon substrate. Although no blocking oxide on top of the structure has been considered in this study, electrical characterization shows large hysteresis at voltages lower than 12 V. Insight to the physics underlying the behavior of such a device is given using a simulator presented in this work. The simulation of the programming characteristics will be presented and compared with those obtained from the fabricated devices giving insight to the properties of the traps involved. Good agreement is found between measured and simulated data.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A highly sensitive impedimetric aptasensor for the selective detection of acetamiprid and atrazine based on microwires formed by platinum nanoparticles",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0956566317307005",
            "Abstract": "A novel impedimetric biosensor was developed for the detection of the two extensively used pesticides, acetamiprid and atrazine. By employing the sputtering and e-beam lithography techniques, platinum nanoparticles (Pt NPs) were deposited in a bridge-like arrangement, in between interdigitated electrodes (IDEs). The resulting Pt NP microwires were chemically functionalized to allow the covalent immobilization of aptamers against the two target analytes onto the sensor surfaces. The biosensing platform facilitated charge transfer through the microwire-bridged IDEs, while upon analyte binding to the immobilized aptamers electron transfer was hindered, resulting in an increase of the electrochemical cell's impedance. The combination of Pt NPs microwires and aptamers allowed the sensitive and highly selective detection of acetamiprid with a linear range of response in the range of 10 pM to 100 nM with a limit …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:OP4eGU-M3BUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Oxidation of nitrogen-implanted silicon: Comparison of nitrogen distribution and electrical properties of oxides formed by very low and medium energy  implantation",
            "Publication year": 2004,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1739286",
            "Abstract": "In a previous work [Skarlatos et al., J. Appl. Phys. 93, 1832 (2003)] we investigated the influence of implantation energy on oxide growth and defect formation in nitrogen-implanted silicon substrates. It was shown that as the implantation energy decreases from medium to very low values the oxide reduction decreases. This was attributed to nitrogen out-diffusion, which is more effective when nitrogen is placed closer to the silicon surface. On the other hand very low implantation energy avoids the formation of dislocation loops in the silicon substrate, a key point for modern devices performance. In this second part we compare the nitrogen distribution and electrical properties of ultrathin (25–30 Å) oxides grown under the same oxidation conditions on very low (3 keV) and medium (25 keV) energy nitrogen-implantated silicon. Nitrogen distribution measurements show that a lower content of nitrogen remains within the …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:RHpTSmoSYBkC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Cluster beam synthesis of metal and metal-oxide nanoparticles for emerging memories",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110114001506",
            "Abstract": "In this work we present results concerning the cluster beam synthesis of metal and metal-oxide nanoparticles together with their applications in emerging memories like nanoparticle Flash memories and resistive switching memories. Regarding the former, very large memory windows of 7–8 V are presented at voltages below 10 V using Ni, Pt or Au nanoparticles. Regarding the latter, metal–insulator–metal devices based upon titanium oxide nanoparticle films show switching voltages well below 1 V with high-to-low resistance ratios as high as 1000. An in depth analysis of the physical and electrical properties of the titanium oxide nanoparticle films allows to shine light onto the physics behind the switching mechanism.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The effect of buffer layer on the thermochromic properties of undoped radio frequency sputtered VO2 thin films",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609015006173",
            "Abstract": "Thermochromic (TC) coatings can find use in a wide range of applications. Vanadium dioxide (VO2) specifically, can be potentially used as a smart window coating, as it presents a metal-to-semiconductor transition close to the room temperature (Tc = 68 °C). This results in low transmission in the infrared (thermal) part of the spectrum, while preserving its transmittance in the visible. In the present work, vanadium dioxide (VO2) thin films with a thickness of ~ 85 nm were prepared by radio frequency sputtering, to investigate the influence of the buffer layer and deposition properties employed, on their thermochromic behavior. The substrates used were uncoated glass and pre-coated glasses with SnO2 or ZnON as buffer layer. The lowest growth temperature applied was 300 °C, yielding TC-VO2, without the necessity of any post-growth treatment. The structure of the VO2 films was studied by X-ray diffraction and …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:_axFR9aDTf0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "From silicon to organic nanoparticle memory devices",
            "Publication year": 2009,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rsta.2008.0280",
            "Abstract": "After introducing the operational principle of nanoparticle memory devices, their current status in silicon technology is briefly presented in this work. The discussion then focuses on hybrid technologies, where silicon and organic materials have been combined together in a nanoparticle memory device, and finally concludes with the recent development of organic nanoparticle memories. The review is focused on the nanoparticle memory concept as an extension of the current flash memory device. Organic nanoparticle memories are at a very early stage of research and have not yet found applications. When this happens, it is expected that they will not directly compete with mature silicon technology but will find their own areas of application.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:RYcK_YlVTxYC",
            "Publisher": "The Royal Society Publishing"
        },
        {
            "Title": "Investigation of the interaction between silicon interstitials and dislocation loops using the wafer bonding technique",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.373550",
            "Abstract": "In this work, we investigate (i) the interaction of silicon interstitial atoms during thermal oxidation of silicon with a dislocation loop layer positioned at different distances from the surface as well as (ii) the interaction between two loop layers positioned at different depth distances. In both experiments, interstitials are injected by surface oxidation. The results show a linear dependence of the injection flux of interstitials with the inverse of the distance of the loop layer from the surface and a small leakage (16%) of the injected interstitials escaping from the upper and becoming bounded to the deeper loop layer. The experiments are performed using the wafer bonding technique that allows versatility on their design.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:GnPB-g6toBAC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Formation of silicon ultra shallow junction by non-melt excimer laser treatment",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110110001425",
            "Abstract": "Implementation of plasma doping and nanosecond laser annealing in the non-melt regime has shown to hold great promise for the realization of ultra shallow junctions, designed for the sub 45 nm node. This work includes extensive simulation of these two emerging techniques using the Synopsys Sentaurus Process software tool, in direct comparison with experimental data for each step involved in the process. Analytical calculations were performed in order to investigate the interaction of the KrF Excimer Laser Annealing and silicon regarding the temperature gradients induced into silicon and the boron diffusion kinetics. On the other hand, analytically obtained surface temperature profiles of each annealing condition, were used as input to KMC calculations of the boron diffusion and activation behavior. Simulation predictions, in accordance with SIMS measurements revealed very limited dopant profile movement …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:_xSYboBqXhAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Development of wireless pressure measurement system for short range medical applications",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4432827/",
            "Abstract": "A prototype of miniaturized, low power, bi-directional wireless communication system was designed for in vivo pressure monitoring. The capacitive pressure sensors have been developed particularly for the medical field, where packaging size and minimization of the power requirements of the sensors are the major drivers. The pressure sensors have been fabricated using a 2.4 mum thick strain compensated heavily boron doped SiGeB. In order to integrate the sensors with the wireless module, the sensor dice was wire bonded onto TO package using chip on board (COB) technology. The telemetric link and its capabilities to send information have been examined on a test bench. A full pressure range from 0 to 10 kPa was generated using either air or water pressure pumped through connected tubes to simulate the environment similar to the one inside the gastrointestinal (GI) tract.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Influence of implantation energy on the electrical properties of ultrathin gate oxides grown on nitrogen implanted Si substrates",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1585133",
            "Abstract": "Metal–oxide–semiconductor tunnel diodes with gate oxides, in the range of 2.5–3.5 nm, grown either on 25 or 3 keV nitrogen-implanted Si substrates at (0.3 or 1) ×1015 cm−2 dose, respectively, are investigated. The dependence of N2+ ion implant energy on the electrical quality of the growing oxide layers is studied through capacitance, equivalent parallel conductance, and gate current measurements. Superior electrical characteristics in terms of interface state trap density, leakage current, and breakdown fields are found for oxides obtained through 3 keV nitrogen implants. These findings together with the full absence of any extended defect in the silicon substrate make the low-energy nitrogen implantation technique an attractive option for reproducible low-cost growth of nanometer-thick gate oxides.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:ns9cj8rnVeAC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "From silicon to organic nanoparticle memory",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/D-Tsoukalas/publication/26827529_From_silicon_to_organic_nanoparticle_memory_devices/links/57128e0208aeebe07c03a3db/From-silicon-to-organic-nanoparticle-memory-devices.pdf",
            "Abstract": "After introducing the operational principle of nanoparticle memory devices, their current status in silicon technology is briefly presented in this work. The discussion then focuses on hybrid technologies, where silicon and organic materials have been combined together in a nanoparticle memory device, and finally concludes with the recent development of organic nanoparticle memories. The review is focused on the nanoparticle memory concept as an extension of the current flash memory device. Organic nanoparticle memories are at a very early stage of research and have not yet found applications. When this happens, it is expected that they will not directly compete with mature silicon technology but will find their own areas of application.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:GFxP56DSvIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A masking approach for anisotropic silicon wet etching",
            "Publication year": 2001,
            "Publication url": "https://iopscience.iop.org/article/10.1149/1.1398559/meta",
            "Abstract": "A new simple and rapid room-temperature silicon masking approach based on the exposure of silicon to-based plasma is presented. This plasma treatment leads to silicon surface modifications appropriate for masking purposes during anisotropic etching in ethylenediamine-pyrocatechol-water (EPW) solutions. The resistance of the mask to EPW etching solutions is studied as a function of plasma radio frequency power and pressure, plasma duration, silicon surface preparation, and aging. Mask resistance increases with increasing power density and decreasing pressure. Plasma duration has a significant effect on the temporal and spatial pattern of defects that evolve during etching and lead eventually to mask destruction.© 2001 The Electrochemical Society. All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Laser annealing and simulation of a: Si thin films for solar cell applications",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_si-2013-CM1H.6",
            "Abstract": "Laser annealing experiments for the crystallization of amorphous silicon layer and improvement of its solar cell efficiency are presented here. Temperature simulation to define the depth profile distribution was also performed.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "ZnO nanoparticles produced by novel reactive physical deposition process",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433210017228",
            "Abstract": "This paper reports the deposition of ZnO nanoparticles with controlled sizes and different particle densities and their structural, composition and optical properties. They were deposited by means of a DC magnetron based vacuum nanoparticle source onto different substrates (GaAs, Si and Ti/SiO2/Si). We believe that this is the first time that such nanoparticles have been produced using this unique technique. Zinc was used as sputtering target to produce zinc nanoparticles which were oxidized in-line using molecular oxygen. The structural properties and chemistry of the ZnO were studied by transmission electron microscopy. An average particle size of 6(±2) nm was produced with uniform size distribution. The particle density was controlled using a quartz crystal monitor. Surface densities of 2.3 × 1011/cm2, 1.1 × 1013/cm2 and 3.9 × 1013/cm2 were measured for three different deposition runs. The ZnO particles …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:kzcrU_BdoSEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Special Session III-Electronic Materials-Materials Science Issues for the Fabrication of Nanocrystal Memory Devices by Ultra Low Energy Ion Implantation",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=9150373520373145349&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:F1b5ZUV5XREC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Facile synthesis of core–shell structured PANI-Co3O4 nanocomposites with superior electrochemical performance in supercapacitors",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016943321502869X",
            "Abstract": "Core–shell structured PANI-Co3O4 nanocomposites for supercapacitor applications were synthesized by combination of carbon-assisted method and in situ polymerization method. The crystalline structure, optical band gap, morphology, and hydrophilic property, as the major factors affecting the performances of supercapacitors, were investigated by X-ray diffraction (XRD), UV–vis spectrophotometry (UV–vis), scanning electron microscopy (SEM), transmission electron microscopy (TEM) and water contact angle (WCA). The core–shell structured PANI-Co3O4 nanocomposites are characterized by amorphous PANI, small bandgaps, large surface area and favorable hydrophilicity, which indicates the superior electrochemical performances of the nanocomposites as electrode material for supercapacitors. Cyclic voltammetry (CV), galvanostatic charge/discharge and electrochemical impedance spectroscopy (EIS …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:9pM33mqn1YgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "THE INFLUENCE OF SILICON INTERSTITIAL CLUSTERING ON THE REVERSE SHORT CHANNEL EFFECT",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0044",
            "Abstract": "In this work we investigate the influence of controlled damage generated by Si+ implantation in the S/D region on the extent of the Reverse Short Channel Effect (RSCE) of NMOS devices. The implantation that is performed prior to S/D formation is followed by either RTA or furnace annealing using different ramp rates. The influence of the ramp rates on the RSCE is then studied. The experimental data are analysed using combined process and device simulations by taking into account the dissolution kinetics of {113} defects.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigation of top gate electrode options for high‐k gate dielectric MOS capacitors",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200780147",
            "Abstract": "Capacitors with a high‐k HfO2 film as gate dielectric were fabricated, using three different variations for the top gate electrode. This way it was possible to acquire important information on which kind of gate material should be used in combination with HfO2 as a gate insulator for optimum performance of possible low temperature applications, such as high‐k TFTs. The variations of gate electrode were e‐gun evaporated Al, sputtered W and CVD polysilicon followed by ion implantation and annealing. The capacitors were then characterized with capacitance‐voltage measurements and current‐voltage measurements. (© 2008 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:VL0QpB8kHFEC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Spatial Confinement Effects of Embedded Nanocrystals on Multibit and Synaptic Properties of Forming Free SiO2-Based Conductive Bridge Random Access Memory",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9099508/",
            "Abstract": "In this work we examine the position effect of embedded Pt nanocrystals (NCs) within a conductive bridge resistive switching memory (CBRAM) based on SiO 2  which results in self-rectifying properties, low-voltage and more reliable operation. With this material configuration, we derive a large memory window, good spatial and temporal variability, robust pulse endurance and charge retention capabilities. Depending on the applied pulse characteristics we also exhibit low power 4-bit multilevel capabilities along with synaptic properties. The results are compared against a similar device without embedded NCs, gaining insights regarding the spatial confinement of silver nanofilaments by the presence of metallic NCs and its beneficial impact on device operation.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:QD3KBmkZPeQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capping technique for chemical vapor deposition of large and uniform MoS2 flakes",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609021002911",
            "Abstract": "Molybdenum disulfide (MoS2) has attracted a lot of attention due to its semiconducting behavior. Chemical vapor deposition of MoS2 is considered a relatively simple and user-friendly technique but there are several obstacles that may hinder the growth, and might result in rather small and non-uniformly distributed triangular flakes over the substrate surface. To tackle this issue, we developed an approach for large flakes (>300 μm) grown homogeneously over two substrates at once. This is based on spin-coating one of the two substrates with an aqueous solution of Mo-based salt particles, and covering it with the other. During the growth, the particles will act as nucleation sites for both substrates. Raman and atomic force microscopy measurements show that the grown flakes are monolayer. Finally, electrical measurements demonstrate the semiconducting behavior of the material and further analysis reveal two …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:WHdLCjDvYFkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A RF power harvester with integrated antenna capable of operating near ground planes",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924424712003445",
            "Abstract": "An RF power-harvester with an onboard microcontroller operating at 430 MHz and an optimized, multi-slotted planar inverted-F antenna (PIFA) integrated within the system volume is presented. Use of the PIFA in the tag design reduces problems when the tag operates near ground and metal structures which often occur in a variety of applications. Vector network analyzer measurements as well as indoor measurements have been performed to demonstrate that harvester performance near metal structures is not degraded in contrast to systems equipped with dipole antennas. It has been found that the microcontroller could be powered up to a 3 m range for time intervals up to 20 ms while standing as near as 1 cm above a metal plane.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:VLnqNzywnoUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Materials and Processes for Nonvolatile Memories: Volume 830",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=12019995984354250146&hl=en&oi=scholarr",
            "Abstract": "This 2005 book focuses on the scientific and technological exploration of materials and devices with nonvolatile memory properties. Scientists and engineers working on diverse memory technologies come together here to highlight possible advantages and disadvantages of each expertise. A broad range of topics are featured-from fundamental materials properties and integration, to demonstration and industrial devices. Invited presentations are broad-based and more tutorial in nature, helping to illustrate major trends. Topics include: nonvolatile memories with discrete storage nodes; ferroelectric memories; magnetoresistive randam access memory; nanoparticle memories; materials for nonvolatile memories and organic and resistive memories.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:buQ7SEKw-1sC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Millisecond non-melt laser annealing of phosphorus implanted germanium: Influence of nitrogen co-doping",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4932600",
            "Abstract": "In this work, we present the results obtained using a CO2 laser source at 10.6 μm wavelength for the study of the non-melt annealing of phosphorus doped germanium in the millisecond regime. Main objective of this paper is the demonstration of electrically active n+-p junctions in germanium by implanting phosphorus in p-type substrate while trying to maintain minimal dopant diffusion, which is a critical issue for scaling germanium devices. In addition to the phosphorus diffusion studies, we also explore the presence of nitrogen introduced in the substrate together with phosphorus and we conclude that it can further reduce dopant movement at the expense of lower activation level. The observation is confirmed by both electrical and SIMS measurements. Moreover, density functional theory calculations show that nitrogen-phosphorus co-doping of germanium creates stable N-P complexes that, indeed, are …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:Ri6SYOTghG4C",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Depth positioning of silicon nanoparticles created by Si ULE implants in ultrathin SiO 2",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1258088/",
            "Abstract": "Silicon nanocrystals buried in a thin oxide can be used as charge storage elements and be integrated in standard CMOS technology to fabricate new non-volatile memory devices. In this geometry, the control of the distances between the nanocrystals layer and the two electrodes, the channel and the gate, of the MOS determines the final characteristics of the device (write-erase and retention times). In this work, we report on a systematic study of the effect of varying the beam energy (0.65 - 2 keV) and the dose (10 15 -10 16  cm -2 ) on the positioning of 2D-arrays of nanocrystals within 10 nm thick oxide after annealing at 950 and 1050°C. For this, different Transmission Electron Microscopy (TEM) methods have been used including High Resolution Electron Microscopy (HREM) for imaging isolated nanocrystals and Fresnel contrast imaging of populations of nanocrystals. Our results show that the injection distance\"\" …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ιmpedimetric nanoparticle aptasensor for selective and label free pesticide detection",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931717304136",
            "Abstract": "An impedimetric label-free aptasensor for the simultaneous and highly selective detection of two pesticides is presented. The sensor is based on the combination of self-assembled platinum nanoparticle two-dimensional films (produced in room temperature via the magnetron sputtering technique) and target specific nucleic acids (a.k.a. aptamers). The platinum nanoparticle films have been deposited on top of SiO2 substrates previously patterned with interdigitated electrodes. The surface of the device has been chemically modified in order to enhance the subsequent aptamer deposition and immobilization. Two distinctive aptamer configurations have been employed in order to facilitate capturing and detection of two pesticides, namely acetamiprid and atrazine. Successful binding events between aptamer and target induce a shift in the impedance of the aptasensor which can be attributed in charge transport …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:8xutWZnSdmoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A multi-stack insulator silicon-organic memory device with gold nanoparticles",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1256917/",
            "Abstract": "We demonstrate a memory device, using gold nanoparticles as charge storage elements deposited at room temperature by chemical processing. The nanoparticles are deposited over a thin thermal silicon dioxide layer that insulates them from the device silicon channel. An organic insulator deposited by the Langmuir-Blodget technique at room temperature separates the aluminium gate electrode from the nanoparticles. The device exhibits significant threshold voltage shifts after application of low voltage pulses (",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transmission electron microscopy measurements of the injection distances in nanocrystal-based memories",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1536026",
            "Abstract": "The characteristics of nonvolatile memories making use of Si nanocrystals as charge storage elements buried in the gate oxide of regular metal–oxide–semiconductor transistors strongly depend on the distances between the nanocrystals and two electrodes, the channel and the gate. In this letter, we compare two transmission electron microscopy methods that can be used to extract such distances. We demonstrate by using image simulations that conventional electron microscopy under out-of-Bragg and strongly underfocused conditions is the fastest and most efficient technique to be used for routine measurements at a subnanometer resolution. Finally, we show that the injection oxide thickness of nanocrystal devices obtained by low-energy Si implantation into thin SiO2 layers and subsequent annealing can be precisely tuned from 8 to 5 nm by adjusting the implantation energy from 0.65 to 2 keV.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Deposition Of Uniform Size Metallic Nanoparticles For Use In Non Volatile Memories",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/deposition-of-uniform-size-metallic-nanoparticles-for-use-in-non-volatile-memories/EE0DF4467F7A7B117E9B09334C0AAD59",
            "Abstract": "In this work we investigate the non-volatile memory behavior of Ni nanoparticles embedded within an insulating matrix. Nickel nanoparticles are deposited at room temperature by a new high-vacuum technique over a 4 nm tunneling thermal SiO2 layer followed by the deposition of HfO2 as a control insulator. Memory windows of ∼1.5V are observed in MOS capacitors at gate pulse voltages of 8V. Charge retention for write and erase state clearly indicate long time charge storage behavior.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Laser annealing and simulation of amorphous silicon thin films for solar cell applications",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8967/89670T/Laser-annealing-and-simulation-of-amorphous-silicon-thin-films-for/10.1117/12.2038557.short",
            "Abstract": "In this work, a picosecond DPSS and a nanosecond Nd:YAG laser have been used for the annealing and the partial nanocrystallization of an amorphous silicon layer. These experiments were conducted in order to improve the characteristics of a micromorph tandem solar cell. The laser annealing was attempted at 1064nm in order to obtain the desired crystallization’s depth and ratios. Preliminary annealing-processes, with different annealing parameters, have been tested, such as fluence, repetition rate and number of pulses. Irradiations were applied in the sub-melt regime, in order to prevent significant diffusion of p- and n-dopants to take place within the structure. The laser experimental work was combined with simulations of the laser annealing process, in terms of temperature distribution evolution, using the Synopsys Sentaurus Process TCAD software. The optimum annealing conditions for the two different …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:LI9QrySNdTsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Low-Power Forming Free TiO2–x/HfO2–y/TiO2–x-Trilayer RRAM Devices Exhibiting Synaptic Property Characteristics",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942019/",
            "Abstract": "The insertion of an HfO 2-y  layer within TiO 2-x /HfO 2-y /TiO 2-x  resistive random access memory (RRAM) yields in low set power of 50 nW (10 nA at 5 V), low reset power of 3 nW (1 nA at -3 V), and good cycling variability (σ/μ <; 0.5). In addition, under pulse experiments, fast switching time of 1 μs, good 107 cycling endurance and retention performance at 150 °C, was demonstrated. The confinement of the switching effect into the HfO 2-y  film, which has the highest oxygen content and deeper oxygen vacancy energy levels compared with the adjusting two layers of TiO 2-x  which act as two series resistances, can explain the low switching energy. The gradual modulation of the resistance permits also the manifestation of longterm potentiation synaptic plasticity, induced by the application of a train of pulses with different repetition intervals. A quantitative model was applied in order to reproduce the analog SET …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:r_AWSJRzSzQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nanocrystal memories",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4951308506576581825&hl=en&oi=scholarr",
            "Abstract": "The technologies that have been developed over the years in realizing data storage can be divided into semiconductor types (MOS, bipolar, and charge-coupled devices) and moving media types (magnetic disk, optical disk) which require mechanical equipment operation. Compared to disk devices, semiconductor memories exhibit superior characteristics in terms of cost and performance [1]. Furthermore, due to the advantages of MOS technology in device manufacturability and miniaturization, most ultralarge-scale integration (ULSI≥ 107 transistors on a chip) memory circuits are made at the present time using MOS memories. The most important device for MOS memory technology today is the metal–oxide semiconductor (MOS) field-effect transistor (FET)[2, 3]. A simplified cross section of an n-channel MOS transistor is shown in Figure 1. It consists of a p (“positive”)-type silicon substrate with a surplus of holes …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:fPk4N6BV_jEC",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "MOS Memory Using Silicon Nanocrystals Formed by Very-Low Energy Ion Implantation",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/48984237/MOS_Memory_Using_Silicon_Nanocrystals_Fo20160920-16993-18fpdxl.pdf",
            "Abstract": "Metal Oxide Semiconductor Field Effect Transistor (MOSFET) memory devices using silicon nanocrystals as charge storage elements have been fabricated. The nanocrystals are obtained by Si ion implantation at very low energy (1keV) into a thin thermal oxide (8 nm) and subsequent annealing. The memory characteristics of the devices under static and dynamic operation are reported. These devices exhibit fast write/erase characteristics at low voltage operation. The presence of interface states and defects that originate from the nanocrystal formation process is also found to have a strong effect on the device transfer characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detection of the biotin–streptavidin interaction by exploiting surface stress changes on ultrathin Si membranes",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016793170800600X",
            "Abstract": "The detection of the biotin–streptavidin interaction is presented based on surface stress changes of functionalized Si membranes. During the biomolecular interaction, the surface stress of the functionalized membranes alters resulting in their deflection and finally in capacitance variations. The biological interaction on the sensors surface was verified after each experiment using fluorescent microscopy. Successful detection of 21 nM of streptavidin using 3.55 mM biotin probes is presented.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ge/SiO 2 THIN LAYERS THROUGH LOW-ENERGY Ge+ IMPLANTATION AND ANNEALING: NANOSTRUCTURE EVOLUTION AND ELECTRICAL CHARACTERISTICS",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0016",
            "Abstract": "The structure and electrical characteristics of low-energy Ge-implanted SiO2 thin layers are investigated. Glass transition and Ge-species relocation lead to an arrest of phase separation in the annealed oxide, which, nevertheless, can phase separate following e-irradiation during transmission electron microscopy observation. The electrical characteristics of the oxide layers annealed at different temperatures are studied through high-frequency capacitance-voltage measurements of metal-oxide-semiconductor capacitors before and after the application of constant voltage stress. Measurements indicate that Ge-implanted-SiO2 undergoes a major structural change after annealing at temperatures > 910°C. The latter change is identified as a relocation of Ge towards the upper portion of the oxide with a significant fraction of them leaving the oxide.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conceptual Design of a Wireless Strain Monitoring System for Space Applications",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_38",
            "Abstract": "The conceptual design of the architecture of a wireless strain monitoring network suitable for space applications is presented. The system is a heterogeneous wireless network that consists of battery powered nodes and batteryless nodes that are able to harvest energy from an incident RF field. Battery powered nodes are based on the Zigbee standard. Both battery and batteryless nodes are envisioned to include sensors but some battery powered nodes could simply serve as relaying points to transfer data to the central computer. The structure of the batteryless nodes as well as remote powering and data transmission are analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Size control of Ag nanoparticles for SERS sensing applications",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705811057389",
            "Abstract": "Ag nanoparticles developed by inert gas aggregation were deposited on silicon and quartz substrates. The samples were annealed under high vacuum at 200C. The influence of annealing time-length on the average size and size dispersion was examined by field emission scanning electron microscopy and UV-visible absorption spectra. The results showed that the average size of the nanoparticles decreased continuously for annealing time up to 6mins followed by a more tight size distribution. After further annealing the average size increased again approaching the average size of the nanoparticles in the non-annealed sample. The samples prepared were tested as substrates for SERS of R6G molecules adsorbed on the Ag nanoparticles. It was found that the characteristic 612cm-1 rhodamine peak followed the variation of the average nanoparticle size.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:SdhP9T11ey4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evaluation of capacitive surface stress biosensors",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931711005624",
            "Abstract": "The evaluation of a capacitive type biosensor array, consisting of a total of 256 biosensing elements, in the detection of single oligonucleotide mutations is presented. The biosensor takes advantage of surface stress changes during biological interactions and is able to translate them into a capacitive signal. The array is organized in a 16 × 16 matrix of distinct biosensing elements thus allowing for the concurrent sensing of multiple biological targets. In this work the sensing elements of the array are spotted with three different oligonucleotides (CD8, CD17 and CD19) and their hybridization is detected using 36 nM PCR. Moreover tests with CD19 revealed the ability of the biosensor to detect the hybridization of the oligo with sample concentrations of 36, 18 and 9 nM.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:1yQoGdGgb4wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Thermochromic performance of Mg-doped VO2 thin films on functional substrates for glazing applications",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0927024816303129",
            "Abstract": "The reversible phase transition VO2 exhibits, makes it a great candidate for energy efficient building glazing. Thus, a great need arises to optimize its optical and thermochromic properties, to be better suited for real smart window applications. In this study, thin films of Mg-doped VO2 have been successfully fabricated using RF reactive magnetron sputtering on commercially available products (glass coated with SnO2 buffer layer) and, for the first time, on ZnO/glass substrates, as an alternative buffer layer. Doping concentration is found to strongly affect the thermochromic properties of the films, namely the transition temperature (Tc) and transmittance modulation ability. XRD and SEM studies have been performed to examine the structural and morphological features of the Mg-doped films. Optical transmittance measurements vs. temperature have been used to calculate Tc and hysteresis width of the transition …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:sNmaIFBj_lkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Annealing behavior of locally confined dislocation loops under inert and oxidizing ambient",
            "Publication year": 2002,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/annealing-behavior-of-locally-confined-dislocation-loops-under-inert-and-oxidizing-ambient/9C4D3876F06ACEFDC9C9B06382B10464",
            "Abstract": "In this work, we report data for the growth kinetics of locally confined dislocation loops organized within lines of controlled dimension and periodicity. The dislocation loop lines were formed in the crystalline substrate after local Si implantation and annealing in predefined areas. The distance between the lines ranges between 0.2 νm to 5 μm. It is shown that the kinetics of the DLs depends on the distance between them. When the distance is less than 1 μm, the DLs behave in a similar fashion like those grown in a continuous layer, under inert and oxidizing conditions. However, when the distance between the lines is increased (eg. 5 μm), the behavior of the loops is changed. Fast dissolution of the dislocations loops is observed during annealing in inert ambient, due to enhanced interstitial losses, while under oxidizing conditions the loops grow faster.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:Y5dfb0dijaUC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "SILICON NANOPHOTONICS: BASIC PRINCIPLES, CURRENT STATUS AND PERSPECTIVES",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=6626313241176399833&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:lgwcVrK6X84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "GERMANIUM QUANTUM DOTS IN SIO2: FABRICATION AND CHARACTERIZATION",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812796738_0103",
            "Abstract": "A new method of forming Ge nanocrystals in SiO2 based on molecular-beam epitaxy combined with rapid-thermal processing is presented. We demonstrate that the method allows the formation of a high aerial density (~5 × 1011 dots/cm2) of small spherical dots (~4 nm in diameter) of a narrow size distribution located at a controlled and well-defined distance from the Si/SiO2 interface, and that these dots show a significant memory effect.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Laser annealing for n+/p junction formation in germanium",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1369800106001557",
            "Abstract": "In the present work we focus our study on laser annealing of implanted with high phosphorus dose p-type germanium wafers using an Nd-YAG laser at 355 nm. Dopant profiles as monitored by SIMS measurements demonstrate dopant profile movement less than 15 nm at junction depth. Germanium (Ge) structural defects were observed by TEM measurements and the roughness of the surface was measured by AFM. The above analysis shows the efficiency of laser annealing in recrystallizing the Ge substrates at lower energy fluences compared to Si and without substantial dopant loss and diffusion.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A sensing approach for automated and real-time pesticide detection in the scope of smart-farming",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016816992031379X",
            "Abstract": "The increased use of pesticides across the globe has a major impact on public health. Advanced sensing methods are considered of significant importance to ensure that pesticide use on agricultural products remains within safety limits. This study presents the experimental testing of a hybrid, nanomaterial based gas-sensing array, for the detection of a commercial organophosphate pesticide, towards its integration in a holistic smart-farming tool such as the “gaiasense” system. The sensing array utilizes nanoparticles (NPs) as the conductive layer of the device while four distinctive polymeric layers (superimposed on top of the NP layer) act as the gas-sensitive layer. The sensing array is ultimately called to discern between two gas-analytes: Chloract 48 EC (a chlorpyrifos based insecticide) and Relative Humidity (R.H.) which acts as a reference analyte since is anticipated to be present in real-field conditions. The …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:ALROH1vI_8AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Silicon nanocrystal memory devices obtained by ultra-low-energy ion-beam synthesis",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110104001029",
            "Abstract": "Si-nanocrystal memory devices aiming at low-voltage non-volatile memory applications are explored. The devices consist of a single metal-oxide-semiconductor field-effect-transistor with silicon nanocrystals fabricated through ultra-low-energy (1 keV) Si implantation of the gate oxide (7 nm in thickness) and subsequent thermal annealing. Process issues like boron contamination and parasitic currents that affect the threshold voltage and transfer characteristics of the intended devices are discussed in terms of device structure, process parameter and device simulation. It is shown that these issues can be overcome under appropriate process modifications. Threshold shift of about 2 V are obtained for a 10 ms +9 V/−9 V pulse regime where both electron and hole trapping occur. Neither degradation, nor drift in memory window is detected after 1.5 × 106 10 ms +9 V/−9 V cycles. Charge retention measurements reveal …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Improving the resistive switching uniformity of forming-free TiO2−x based devices by embedded Pt nanocrystals",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7324767/",
            "Abstract": "The resistive switching characteristics of TiN/Ti/TiO 2-x /Au devices containing Pt nanocrystals with different diameters, were systematically investigated. We demonstrate that comparing the reference with the Pt nanocrystals embedded devices, important enhancement of switching characteristics is obtained, in terms of uniformity and enlarged switching ratio. Our results indicate that the switching characteristics of TiO 2-x  device are very strongly related with the control of conductive filaments' growth within the dielectric layer, which stems from the local enhancement of the electric field in the vicinity of nanocrystals. This effect in conjunction with the room temperature fabrication process and the forming free nature of the thin films is considered as an optimization route of resistive random access memory design.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:4fGpz3EwCPoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ZnO nanoparticles embedded in polyethylene-glycol (PEG) matrix as sensitive strain gauge elements",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11051-014-2714-6",
            "Abstract": "In this work, we investigate the strain-sensing properties of nanocomposite material made from ZnO nanoparticles (NPs) embedded in polyethylene-glycol (PEG) by measuring three different electrical parameters: piezo-resistance, piezo-capacitance, and piezo-impedance. To understand the conduction mechanisms involved in such a material and optimize its performance, a systematic experimental study of DC and AC conductivity was performed using various concentrations of ZnO NPs in PEG. The size range of the NPs is 10–400 nm in diameter. Our results show that conductivity is reduced as the concentration of ZnO NPs increases that reveals the role of ion trapping by ZnO NPs. We then discuss possible mechanisms of high strain sensitivity observed which is attributed to stress influencing surface defects of ZnO NPs as characterized by Raman measurements. Finally, application of the nanocomposite …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:HbR8gkJAVGIC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Investigating the origins of high multilevel resistive switching in forming           free Ti/TiO2−x-based memory devices through experiments and           simulations",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4977063",
            "Abstract": "Although multilevel capability is probably the most important property of resistive random access memory (RRAM) technology, it is vulnerable to reliability issues due to the stochastic nature of conducting filament (CF) creation. As a result, the various resistance states cannot be clearly distinguished, which leads to memory capacity failure. In this work, due to the gradual resistance switching pattern of TiO2−x-based RRAM devices, we demonstrate at least six resistance states with distinct memory margin and promising temporal variability. It is shown that the formation of small CFs with high density of oxygen vacancies enhances the uniformity of the switching characteristics in spite of the random nature of the switching effect. Insight into the origin of the gradual resistance modulation mechanisms is gained by the application of a trap-assisted-tunneling model together with numerical simulations of the filament …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:yMeIxYmEMEAC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Fabrication of chemical sensors based on Si/polymer bimorphs",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931704002321",
            "Abstract": "The fabrication and first results of a capacitive type chemical sensor based on a silicon/polymer bimorph structure are described. Upon exposure to analytes the polymer covering the thin silicon membrane swells inducing a deflection on the membrane which is measured as a capacitance change between membrane and substrate. Five different polymer layers [poly-hydroxy-ethyl-methacrylate (PHEMA), poly-methyl-methacrylate (PMMA), poly-vinyl-acetate (PVAc), epoxy-novolac (EPN) and poly-dimethylsiloxane (PDMS)] are examined. Exposure to water, methanol and ethanol vapors is used to evaluate performance. Sensitivities ranging from 4.5fF/%RH for PDMS up to 29fF/%RH for PHEMA covered devices are reported. Devices covered with PHEMA, PVAc and PMMA also exhibit strong response upon exposure to methanol and ethanol atmospheres. Differences in sensitivities between these layers may be …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:JV2RwH3_ST0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Metallic nanoparticles for application in electronic non-volatile memories",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJNT.2009.021706",
            "Abstract": "Nanoparticle memories have appeared during last years as a possible solution to overcome the scaling issue of electronic nonvolatile memories. Ultimately, we are looking for nanoparticle memories to significantly decrease the voltage needed to write/erase the memory without compromising its retention characteristics. As an alternative to semiconductor nanoparticles which have been intensively investigated, metallic nanoparticles have been recently also used since they have the potential for more versatile engineering of energy barriers. This would allow improved data retention for memory devices operating at low voltages. Processing approaches for metallic nanoparticle fabrication are addressed and corresponding memory devices performance is discussed. The work presented in this paper is a review of results obtained during the last four years within the Nanodevice Research group at NTUA in …",
            "Abstract entirety": 0,
            "Author pub id": "4hv-l94AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "STRUCTURAL, MECHANICAL, THERMODYNAMIC, AND OPTICAL PROPERTIES OF CONDENSED MATTER (PACS 61-68, 78)-Point defect injection during nitrous oxidation of silicon at low temperatures",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15551338467589200832&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:NJ774b8OgUMC",
            "Publisher": "New York, NY: American Institute of Physics, c1937-"
        },
        {
            "Title": "Electrostatic self-assembly of nanoparticles into ordered nanowire arrays",
            "Publication year": 2011,
            "Publication url": "https://www.cambridge.org/core/journals/journal-of-materials-research/article/electrostatic-selfassembly-of-nanoparticles-into-ordered-nanowire-arrays/A3E46D7BBCBB25FC89BFF0FD1F5008F5",
            "Abstract": "A novel nanoparticle self-assembly process is demonstrated. Nanoparticles were fabricated by a DC magnetron sputtering process. A silicon substrate was initially patterned with arrays of peak and valley photoresist structures using inexpensive patterning techniques. When the nanoparticles were deposited onto the prepatterned substrate, due to surface topography induced local increase in the electric field created by the charges on the nanoparticles, the nanoparticles were self-assembled onto the peaks of the structures and formed long nanowire arrays.",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:NhqRSupF_l8C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "STRUCTURAL, MECHANICAL, THERMODYNAMIC, AND OPTICAL PROPERTIES OF CONDENSED MATTER (PACS 61-68, 78)-Investigation of the interaction between silicon interstitials and dislocation loops using the",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9334051878653105777&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "4hv-l94AAAAJ:t6usbXjVLHcC",
            "Publisher": "New York, NY: American Institute of Physics, c1937-"
        }
    ]
}]