[{
    "name": " Εμμανουήλ Κριεζής",
    "romanize name": " Emmanouil Kriezis",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 3707,
    "Scholar name": "Emmanouil Kriezis",
    "Scholar id": "CUb8oGIAAAAJ",
    "Affiliation": "Professor of Electrical Engineering, Aristotle University of Thessaloniki",
    "Citedby": 2836,
    "Interests": [
        "Nanophotonics",
        "Plasmonics",
        "Liquid Crystals",
        "Photonic Crystal Fibers"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=CUb8oGIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Modelling Switching and Optics in Ferroelectric Liquid Crystal Microdisplays",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10587250108029942",
            "Abstract": "Switching in surface stabilised ferroelectric liquid crystal (SSFLC) cells takes place through the formation and evolution of domains, which can grow up to many tens of microns in size. Domain growth can be described by the Avrami model, but this relies on a statistical distribution of the number of nucleated domains, and hence a large number of domains are required for this model to succeed. We discuss the limitations of this model, for example in a microdisplay pixel, which is between 10 20 microns in size, and therefore only a few domains exist within each pixel. We also investigated the effects of light scattering during partial switching. Light scattering through domains is modelled using the Finite Difference Time Domain (FDTD) method, and shows good agreement with experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Philadelphia, Pa.: Taylor & Francis, c2003-"
        },
        {
            "Title": "Liquid crystal-infiltrated photonic crystal fibres for switching applications",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9781782423294000035",
            "Abstract": "This work reviews the key aspects on the design and analysis of fibre-polarization control components based on liquid crystal (LC)-infiltrated photonic crystal fibres (PCFs). The physics governing the electro-optic actuation of LC materials both inside cylindrical capillaries and the entire PCF lattice are discussed. Different light guidance mechanisms in LC-PCFs are investigated in detail for various combinations of fibre geometry and materials. Finally, three all-in-fibre LC-PCF switching elements are rigorously investigated: a single-polarization switch, a complete polarization controller and a polarization splitter.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Woodhead Publishing"
        },
        {
            "Title": "Perturbation theory for Kerr nonlinear leaky cavities",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-45-23-6442",
            "Abstract": "Detail for the derivation of the proposed nonlinear perturbation theory and connection to temporal coupled-mode theory used to build a complete mathematical framework that allows for specifying the nonlinear response of leaky resonant structures.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:8d8msizDQcsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Data transmission and thermo-optic tuning performance of dielectric-loaded plasmonic structures hetero-integrated on a silicon chip",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6094169/",
            "Abstract": "We demonstrate experimental evidence of the data capture and the low-energy thermo-optic tuning credentials of dielectric-loaded plasmonic structures integrated on a silicon chip. We show 7-nm thermo-optical tuning of a plasmonic racetrack-resonator with less than 3.3 mW required electrical power and verify error-free 10-Gb/s transmission through a 60-μm-long dielectric-loaded plasmonic waveguide.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical determination of twist elastic constant of the chiral smectic liquid crystal SCE8",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00150190490510771",
            "Abstract": "When a “thick” device is filled with a chiral smectic liquid crystal material, a helix is allowed to evolve within the device. In this paper, such a device was fabricated and filled with the ferroelectric liquid crystal material, SCE8. Application of voltage to the device will cause a deformation of the helix, and hence a deviation of the optic axis. The optical response of the device due to the applied voltage, was obtained experimentally. The helical deformation was also theoretically modeled using the continuum approach. In this paper, two different theoretical models will be presented. The first model is a one dimensional model which calculates the director variation along the helical axis. The second model is a two dimensional model which calculates the director variation through the thickness of the device, and along the helical axis. Comparison of the theoretical and experimental results allows us to calculate the twist elastic …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Sensore fotonico ultracompatto basato su cristallo fotonico di silicio",
            "Publication year": 2008,
            "Publication url": "http://eprints.bice.rm.cnr.it/4410/",
            "Abstract": "We report the design and numerical evaluation of a ultra-compact, 2.7 μm long 1 μm wide sensor, based on a silicon on insulator photonic crystal micromachined at the submicron scale.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Asymmetric Si-slot Coupler with Nonreciprocal Response Based on Graphene Saturable Absorption",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9395480/",
            "Abstract": "We present the study of a proof-of-concept integrated device that can be used as a nonlinear broadband isolator. The device is based on the asymmetric loading of a highly-confining silicon-slot photonic coupler with graphene layers, whose ultrafast and low-threshold saturable absorption can be exploited for nonreciprocal transmission between the cross-ports of the coupler. The structure is essentially a non-Hermitian system, whose exceptional points are briefly discussed. The nonlinear device is modeled with a coupled Schrödinger equation system whose validity is checked by full-vector finite element-based beam-propagation method simulations in CW. The numerically computed performance reveals a nonreciprocal intensity range (NRIR) in the vicinity of 100 mW peak power with a bandwidth spanning tens of nanometers, from CW down to ps-long pulses. Finally, the combination of saturable absorption and …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:0izLItjtcgwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "0.48 Tb/s (12x40Gb/s) WDM transmission and high-quality thermo-optic switching in dielectric loaded plasmonics",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-20-7-7655",
            "Abstract": "We demonstrate Wavelength Division Multiplexed (WDM)-enabled transmission of 480Gb/s aggregate data traffic (12x40Gb/s) as well as high-quality 1x2 thermo-optic tuning in Dielectric-Loaded Surface Plasmon Polariton Waveguides (DLSPPWs). The WDM transmission characteristics have been verified through BER measurements by exploiting the heterointegration of a 60μm-long straight DLSPPW on a Silicon-on-Insulator waveguide platform, showing error-free performance for six out of the twelve channels. High-quality thermo-optic tuning has been achieved by utilizing Cycloaliphatic-Acrylate-Polymer as an efficient thermo-optic polymer loading employed in a dual-resonator DLSPPW switching structure, yielding a 9nm wavelength shift and extinction ratio values higher than 10dB at both output ports when heated to 90°C.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Rigorous broadband investigation of liquid-crystal plasmonic structures using finite-difference time-domain dispersive-anisotropic models",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-30-10-2722",
            "Abstract": "A finite-difference time-domain scheme is proposed for the rigorous study of liquid-crystal photonic and plasmonic structures. The model takes into account the full-tensor liquid-crystal anisotropy as well as the permittivity dispersion of all materials involved. Isotropic materials are modeled via a generalized critical points model, while the dispersion of the liquid-crystal indices is described by Lorentzian terms. The validity of the proposed scheme is verified via a series of examples, ranging from transmission through liquid-crystal waveplates and cholesteric slabs to the plasmonic response of arrays of gold nanostripes with a liquid-crystal overlayer and the dispersive properties of metal–liquid-crystal–metal plasmonic waveguides. Results are directly compared with reference analytical or frequency-domain numerical solutions.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:738O_yMBCRsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Electro-optic phase modulators based on transparent-conducting-oxide loaded silicon waveguides",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8082239/",
            "Abstract": "Electro-optic phase modulation schemes are investigated by inducing carrier-concentration changes in transparent conducting oxide semiconductors, integrated in well-established silicon-photonic platforms. By exploiting the epsilon-near-zero effect, binary phase-shift keying modulation is manifested, resulting in high-speed modulation solutions of reduced footprint, compared to the conventional all-silicon designs.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:tYavs44e6CUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Zenithal bistable liquid-crystal gratings as tunable beam splitters",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.726.4895&rep=rep1&type=pdf",
            "Abstract": "2 Theoretical Framework Liquid-crystal studies via the Q-tensor formulation Optical studies and calculation of the diffraction efficiencies",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A topologically consistent class of 3-D higher order curvilinear FDTD schemes for dispersion-optimized EMC and material modeling",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924013604009185",
            "Abstract": "An enhanced higher order finite-difference time-domain (FDTD) algorithm for the precise analysis of complex 3-D electromagnetic compatibility (EMC) structures and arbitrary interface material distributions in general curvilinear, skewed and stretching lattices is presented in this paper. Introducing a systematic topological tessellation, the novel methodology develops a family of robust higher order non-standard forms, which exactly represent the material properties and significantly suppress the artificial dispersion errors. To handle inherent mesh deficiencies an enhanced low-pass filtering procedure is implemented, while a consistent class of self-adaptive compact operators ensures the correct evaluation of electromagnetic components near boundary walls. Moreover, for more involved media interfaces that do not follow the lines of the grid, a convergent transformation around these discontinuities leads to precise …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:g3aElNc5_aQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Numerical modelling of light wave propagation in reflective liquid crystal microdisplay devices",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09500340110115532",
            "Abstract": "Steep variation in the liquid crystal director orientation in more than one dimension is frequently encountered in microdisplay devices in the proximity of pixel edges. It is expected that light wave propagation inside such devices cannot be addressed rigorously if the traditional matrix methods for optics are employed. Numerical modelling is suggested for such demanding situations based on the general solution of Maxwell's equations by the finite difference time-domain method or by properly applying a vector beam propagation method suitable for anisotropic media. Interest is focused on reflective devices. A complete understanding of light diffraction in two-dimensional reflective devices is made possible using the proposed numerical methods, contrary to matrix methods for optics (which are not suitable for such a task). Approaches for addressing cases involving incoherent illumination are also suggested.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Tb/s switching fabrics for optical interconnects using heterointegration of plasmonics and silicon photonics: The FP7 PLATON approach",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5698810/",
            "Abstract": "We present recent work that is carried out within the FP7 project PLATON on novel Tb/s switch fabric architectures and technologies for optical interconnect applications, employing heterointegration of plasmonics, silicon photonics and electronics.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Single-and Multi-Channel Nonlinear Phenomena in Resonant Structures Comprising Graphene",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900806/",
            "Abstract": "Graphene exhibits high third-order nonlinearity in both THz and NIR regimes. Here, we consider single- and multi-channel nonlinear phenomena in resonators comprising graphene to exploit its high nonlinearity. Specifically, we study optical bistability in the NIR with a graphene-covered silicon slot microring resonator and degenerate four-wave mixing in the THz regime with a graphene ribbon resonator. For calculating the nonlinear response, we employ a recently developed perturbation theory/coupled mode theory framework which is both efficient and accurate. We find low power requirements and high conversion efficiencies, highlighting graphene's potential for nonlinear applications.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:5qfkUJPXOUwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the use of liquid crystals for adaptive optics",
            "Publication year": 2016,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420033748-3/use-liquid-crystals-adaptive-optics-sergio-restaino",
            "Abstract": "This chapter provides an introduction to image formation, followed by the effects of aberrations and presents an overall look at adaptive optics (AO) systems with a brief analysis of two wavefront sensors and explores the use of liquid crystals for AO with an overview of what is the state-of-the-art in this arena. Choosing a liquid crystal with low viscosity to increase the temporal rate of the cell response usually leads to an increase of the control voltage. The electric field in the liquid crystal layer becomes inhomogeneous and is determined by anisotropy conditions. Nematic liquid crystals have been used as phase retarders for wavefront shaping for a number of years, for example, see references. The control of a liquid crystal device can be achieved using four different techniques: amplitude control, transient method, pulse method and dual frequency control. For adaptive optics purposes, instead, the use of dual …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:ClCfbGk0d_YC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Photonic crystal-liquid crystal fibers for single-polarization or high-birefringence guidance",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-14-2-914",
            "Abstract": "The dispersive characteristics of a photonic crystal fiber enhanced with a liquid crystal core are studied using a planewave expansion method. Numerical results demonstrate that by appropriate design such fibers can function in a single-mode/single-polarization operation, exhibit high- or low- birefringence behavior, or switch between an on-state and an off-state (no guided modes supported). All of the above can be controlled by the application of an external electric field, the specific liquid crystal anchoring conditions and the fiber structural parameters.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Light wave propagation in liquid crystal displays by the 2-D finite-difference time-domain method",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401800005952",
            "Abstract": "Light wave propagation within liquid crystal (LC) devices is studied using a two-dimensional (2-D) finite-difference time-domain (FDTD) method. Computational space termination is provided by a combination of the perfectly matched layer absorbing boundary condition and periodic boundary conditions, to overcome the limitations imposed by previously proposed FDTD methods for LC optics. Both normal and oblique incidence cases are successfully implemented and a consistent method for magnitude and phase extraction is made available. This provides a rigorous numerical solution for the light wave propagating within LC devices, and a sample application for a small twisted nematic pixel is given.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Nonreciprocal Silicon Photonic Coupler Exploiting Graphene Saturable Absorption",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=NP-2020-NpW1E.2",
            "Abstract": "We present a broadband half-duplex high-power photonic isolator using the exceptional point in a non-Hermitian nonlinear silicon slot coupler. The concept relies on spatially asymmetric saturable losses, by overlaying one waveguide with graphene.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Diversity combining in hybrid RF/FSO systems with PSK modulation",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962684/",
            "Abstract": "We present a novel architecture for hybrid radio frequency (RF)/ free space optical (FSO) wireless systems without feedback or channel state information (CSI) at the transmitter. Under the assumption that 60 GHz RF and FSO systems support the same data rates, the proposed implementation transmits the same data over both links, using phase shift keying (PSK) as a common modulation scheme, and combines the signals from each individual link at the receiver on a symbol-by-symbol basis. Two popular diversity combining schemes are considered, namely, selection combining (SC) and maximal ratio combining (MRC), while tractable analytical approximations for the bit error rate (BER) are obtained. Investigations over various weather conditions and link distances revealed that the proposed implementation fully exploits the complementary nature of RF and FSO channels, even when one of the two available …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chapter Merging Plasmonics and Silicon Photonics Towards Greener and Faster “Network-on-Chip” Solutions for Data Centers and High-Performance Computing Systems",
            "Publication year": 2012,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/49060/40348.pdf?sequence=1",
            "Abstract": "In recent years it has become evident that the increasing need for huge bandwidth and throughput capabilities in Data Center and High Performance Computing (HPC) environments can no longer be met by bandwidth-limited electrical interconnects. Besides their limited capacity, electrical wiring technologies impose great energy and size limitations originating from the requirements to handle the vast amount of information that needs to be exchanged across all hierarchical communication levels within Data Centers and HPCs, ie rack-to-rack, backplane, chip-to-chip and on-chip interconnections. This reality has inevitably led to a clearly shaped roadmap for bringing optics into the spotlight and replacing electrical with optical interconnects, thereby overtaking the bottleneck in traffic exchange imposed by electrical wires [1]. Hence, the optical technology should penetrate into intra-rack and board-to-board transmission links, considering that the optical fiber as a large-bandwidth transmission medium [2] is used only in commercial systems for rack-torack communication [3].",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:vbGhcppDl1QC",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Diffraction and Gratings-Calculation of the efficiency of polarization-insensitive surface-stabilized ferroelectric liquid-crystal diffraction gratings",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=5682107783021571547&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:q3CdL3IzO_QC",
            "Publisher": "[New York: Optical Society of America], 1962-"
        },
        {
            "Title": "Boundary condition for the efficient excitation and absorption of hybrid waveguide modes in finite element formulations",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.26364",
            "Abstract": "A boundary condition capable of efficiently exciting and absorbing hybrid waveguide modes is derived for use in the context of the finite element method.Its performance is assessed in two cases, that is, a silicon and a plasmonic waveguide, and compared with that of the standard absorbing boundary condition. © 2011 Wiley Periodicals, Inc. Microwave Opt Technol Lett 53:2626–2631, 2011; View this article online at wileyonlinelibrary.com. DOI 10.1002/mop.26364",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:TQgYirikUcIC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Theoretical analysis of microring resonator filters made of plasmonic waveguides",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5185251/",
            "Abstract": "Microring resonator filters which are made of dielectric-loaded surface plasmon polariton waveguides and operate in the telecommunication range are thoroughly analyzed by means of 3D-FEM simulations. The filters' functional characteristics, such as the resonant frequencies, the free spectral range, the transmission bandwidth and the extinction ratio, are investigated for different values of the key structural parameters, namely the ring radius and the gap separating the bus waveguide from the ring. In addition, the shift in the operating wavelength is quantified when the ring's refractive index is controlled as a result of thermal tuning.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Prospects and Limitations for Large Numbers of Multi-Layers in Optical Data Storage",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1632757/",
            "Abstract": "Fourth-generation technologies that use multiple layers are now under investigation. This presentation describes the inter-layer interference and crosstalk characteristics of multiple layers under several illumination conditions using Babinet decomposition of the recording structure. Limitations based on performance bounds are introduced for various film characteristics, like reflectivity, transmission and layer spacing. Primary results include that the total crosstalk is minimized for certain layer spacings for both coherent and incoherent illuminations. The incoherent illumination shows lower values of total crosstalk and more generous tolerances than the coherent illumination",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nonlinear coupled-mode-theory framework for graphene-induced saturable absorption in nanophotonic resonant structures",
            "Publication year": 2018,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.97.063836",
            "Abstract": "A strict mathematical framework combining perturbation theory and temporal coupled-mode theory is developed to model graphene-induced saturable absorption in graphene-enhanced nanophotonic resonators. To allow for loss saturation in graphene, a power-dependent model of its surface conductivity is carefully introduced, based on the underlying physics. The framework is then cautiously unfolded to capture the two-dimensional nature of graphene and its interaction with the electromagnetic mode, additionally allowing one to incorporate any bulk or sheet material that is subject to saturable loss, together with other nonlinear effects. Both exact and approximative approaches are introduced, revealing the capabilities of the proposed framework to address the effect of saturable absorption. A graphene-enhanced silicon slab ring resonator is examined using the developed framework, uncovering its excellent …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:-FonjvnnhkoC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "A strict framework for analyzing linear and nonlinear propagation in photonic and terahertz graphene waveguides",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7193603/",
            "Abstract": "Two-dimensional (sheet) materials, with graphene being a prominent example, are recently finding their way in a variety of photonic and terahertz waveguide applications. We provide a framework for the rigorous study of three-dimensional guided-wave devices that comprise both bulk and sheet materials. Our formulation, relying on the finite element method, allows for arbitrary anisotropy in the susceptibility and surface conductivity tensors describing bulk and sheet material properties, respectively. A number of emerging graphene-comprising waveguide platforms are critically assessed, targeting both linear and in particular nonlinear (third-order) applications in the near- and far-infrared spectral region.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:NJ774b8OgUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Degenerate four-wave mixing in the THz regime with standing-wave graphene resonators",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-37-9-2626",
            "Abstract": "Graphene is one the most promising two-dimensional materials for functional electromagnetic components. Harnessing graphene’s high third-order nonlinearity, a standing-wave resonant system is proposed that realizes low-power and high-conversion-efficiency degenerate four-wave mixing in the THz regime. The proposed system is analyzed in depth, using a recently developed nonlinear framework based on the perturbation theory and temporal coupled-mode theory, which allows for efficient design, accurate results, and physical insight into the system performance. Following robust design guidelines derived from the developed framework, a clear design path is highlighted, covering two possible realizations of the coupling scheme using one or two waveguides as physical ports. The two systems are compared on the basis of input power and conversion efficiency performance metrics, accurately extracted …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:YohjEiUPhakC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Field driven helix unwinding in thick AFLC cells",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10587250108024007",
            "Abstract": "The interaction of the antiferroelectric helix with an electric field applied perpendicular to its axis is investigated. A two stage switching process is observed, in which the helix unwinds to an intermediate state in the pretransitional regime, at voltages below the threshold for antiferroelectric to ferroelectric switching. A series of experimental studies and theoretical modelling show that the intermediate state is an antiferroelectric state in which the directors lie in the plane containing the applied electric field and the smectic layer normal. The mechanism for the unwinding process is the interaction of the applied field with an induced polarisation, which arises from a distortion to the antiferroelectric ordering.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Determination of material constants of antiferroelectric liquid crystal mixture CS4001",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15421400490436205",
            "Abstract": "This work outlines a number of experimental techniques that can be used to determine some fundamental material constants in antiferroelectric liquid crystal materials, exemplified by results for the commercial AFLC mixture CS4001. The parameters measured range from the helical pitch of the material to the interlayer interaction coefficients, elastic constants and viscosities. The experimental methods employed include a variety of both optical and dielectric techniques.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Switchable photonic components based on zenithal-bistable nematic liquid crystal gratings",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8116241/",
            "Abstract": "Electro-optically switchable photonic components based on zenithal bistable liquid-crystal gratings are designed and theoretically investigated. By properly selecting the material and geometrical parameters, we demonstrate that such gratings can operate as switchable beam splitters, beam steerers, quarter-wave plates, and narrowband guided-mode resonant filters. The switching dynamics of the proposed components are also investigated by employing a tensorial formulation for the liquid-crystal orientation problem, which is coupled with the lightwave propagation studies in a multiphysics environment based on the finite-element method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Theoretical analysis of thermally tunable microring resonator filters made of dielectric-loaded plasmonic waveguides",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3256139",
            "Abstract": "Microring resonator filters, which are made of dielectric-loaded surface plasmon polariton waveguides and operate in the telecom spectral range, are thoroughly analyzed by means of vectorial three dimensional (3D) finite element method (FEM) simulations. The filters’ functional characteristics, such as the resonant frequencies where the transmission minima occur, the free spectral range, the extinction ratio, and the minima linewidth associated with the quality factor of the resonances, are investigated for different values of the key structural parameters, namely, the ring radius and the gap separating the bus waveguide from the ring. The rigorous 3D-FEM simulations are qualitatively complemented by a simplified model. Apart from the harmonic propagation simulations, the uncoupled microring is treated as an eigenvalue problem, and the frequencies of the resonances are compared with those of the transmission …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Analysis of tunable photonic crystal based directional couplers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1568384/",
            "Abstract": "In this paper, we introduce a liquid crystal layer in a photonic crystal directional coupler, in order to tune its characteristics. The simulations are conducted utilizing an anisotropic formulation of the finite difference time domain (FDTD) method",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tunable one-dimensional photonic crystal slabs based on preferential etching of silicon-on-insulator",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OE-15-4-1832",
            "Abstract": "We design and assess a one-dimensional photonic crystal slab fabricated by preferential etching of a silicon-on-insulator substrate. The etched grooves are considered to be infiltrated by a highly-birefringent nematic liquid crystalline material. A detailed analysis of the nematic director response within the grooves is presented. We investigate different configurations and demonstrate large band gap shifting when switching the liquid crystal with an applied voltage. Furthermore, we assess this type of device as an efficient alternative for compact refractometric optical sensing  applications.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Nonreciprocal propagation in a non-Hermitian silicon photonic coupler employing graphene saturable absorption",
            "Publication year": 2020,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2020/14/epjconf_eosam2020_11006/epjconf_eosam2020_11006.html",
            "Abstract": "We present the concept, analysis and design of a nonreciprocal system of coupled nonlinear waveguides, operating at the near infrared. We exploit the spatial asymmetry induced by the exceptional points of a non-Hermitian coupler which, combined with saturable absorption in the nonlinear regime, can break Lorentz reciprocity. In this work, we introduce asymmetric losses in a pair of coupled silicon waveguides by overlaying only one of them with unbiased graphene, subject to saturable absorption. The device can be used as a broadband half-duplex isolator: a two-port component offering unidirectional transmission of high-power signals.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:bz8QjSJIRt4C",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Optimizing silicon-plasmonic waveguides for                                           χ                         (             3             ) nonlinear applications",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-013-8055-y",
            "Abstract": "Hybrid silicon-plasmonic waveguides constitute an appealing platform for integrated photonic circuitry. They merge the technical maturity and prevalence of the SOI platform with the subwavelength confinement of plasmonic waveguides, essential for accessing enhanced nonlinear response at micron length-scales. Employing full-wave numerical simulations complemented with Schrödinger equation techniques, we propose nonlinear waveguide designs for Kerr-effect applications exhibiting minimized impairments due to free-carrier effects, thus raising the power-ceiling imposed on standard silicon waveguides.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "10 Gb/s transmission and thermo-optic resonance tuning in silicon-plasmonic waveguide platform",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ECOC-2011-We.10.P1.27",
            "Abstract": "The first system-level experimental results of hybrid Si-DLSPP structures incorporated into a SOI chip are reported. We demonstrate over 7nm thermo-optical tuning of a Si-Plasmonic racetrack-resonator and verify error-free 10Gb/s transmission through 60um Si-Plasmonic waveguide.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Dual-core photonic crystal fibers for tunable polarization mode dispersion compensation",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-22-21680",
            "Abstract": "A novel type of dual concentric core photonic crystal fiber (PCF) is proposed and theoretically analyzed, aiming at the design of tunable dispersive fiber elements for polarization-mode-dispersion (PMD) compensation. The adjustment of the fiber’s geometrical birefringence through the proper selection of structural parameters leads to very high values of differential group-delay (DGD). Moreover, the value of DGD can be dynamically tuned by infiltrating the outer core capillaries of the PCF with an optical liquid, which allows for the thermal control of its refractive index. Such fibers are envisaged as tunable dispersive fiber elements for PMD compensation or emulation modules.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:qUcmZB5y_30C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Electro-optic modulation in integrated photonics",
            "Publication year": 2021,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0048712",
            "Abstract": "Electro-optic modulators are an indispensable part of photonic communication systems, largely dictating the achievable transmission rate. Recent advances in materials and fabrication/processing techniques have brought new elements and a renewed dynamic to research on optical modulation. Motivated by the new opportunities, this Perspective reviews the state of the art in integrated electro-optic modulators, covering a broad range of contemporary materials and integrated platforms. To provide a better overview of the status of current modulators, an assessment of the different material platforms is conducted on the basis of common performance metrics: extinction ratio, insertion loss, electro-optic bandwidth, driving voltage, and footprint. The main physical phenomena exploited for electro-optic modulation are first introduced, aiming to provide a self-contained reference to researchers in physics and engineering …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:_5tno0g5mFcC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Nonlinear effects in hybrid plasmonic waveguides",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6254436/",
            "Abstract": "We assess the potential of metal-dielectric-semiconductor plasmonic waveguides for χ (3) -related nonlinear applications. The waveguide geometry is numerically optimized with respect to a nonlinear figure-of-merit accounting for both the nonlinear parameter and inherent Ohmic losses. Subsequently, we design an integrated directional coupler 2×2 switch and demonstrate switching through nonlinearity-mediated coupling suppression. The overall switch performance is assessed both in the framework of coupled vectorial nonlinear Schrödinger equations and by means of an appropriately implemented finite-element beam-propagation method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modelling multi-dimensional optics in complex liquid crystal structures and displays",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/744815193",
            "Abstract": "Finite Difference Time Domain (FDTD) numerical modelling of light scattering from complex structures in liquid crystals is undertaken. As an example, typical Polymer Dispersed Liquid Crystal (PDLC) configurations such as the radial, axial, bipolar and concentric structures are analysed. Two-dimensional studies are used together with Gaussian Beam illumination conditions. In addition, the scattering at the edge of an isolated twisted nematic pixel in a reflective device is modelled. Apart from the numerical discretisation, no other approximations are introduced.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Bistable action with hybrid plasmonic Bragg-grating resonators",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11082-016-0377-5.pdf",
            "Abstract": "Optical bistability with a hybrid silicon–plasmonic configuration consisting of a nonlinear Bragg-grating resonator side-coupled with a bus waveguide is theoretically investigated. The nonlinear response is studied with a modeling framework combining perturbation theory and temporal coupled-mode theory, fed with three-dimensional finite element method simulations. For the CW case, a general closed-form expression describing the nonlinear response is derived, valid for finite intrinsic quality factors and arbitrary coupling conditions. This generalization is necessary for studying plasmonic resonators which are inherently lossy. The effect of the parameters entering in the expression on the bistability curve is thoroughly investigated and the physical system is accordingly designed so as to exhibit minimum power threshold and an extinction ratio between bistable states exceeding 10 dB. Finally, the temporal …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Tunable highly birefringent bandgap-guiding liquid-crystal microstructured fibers",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-24-9-3427",
            "Abstract": "A new type of nematic liquid-crystal infiltrated photonic bandgap-guiding fiber for single polarization or high-birefringence guidance is proposed. Numerical studies demonstrate that modal birefringence can be tuned by proper selection of the structural and material parameters as well as by the application of an external electric field in conjunction with the specific liquid-crystal anchoring conditions.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Terahertz Modulation by Schottky Junction in Metal-Semiconductor-Metal Microcavities",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8840432/",
            "Abstract": "We discuss arrays of metal-semiconductor-metal cavities as electrically tunable terahertz metasurfaces. The operation of the considered device is based on reverse biasing the Schottky junction formed between top metal strips and the n-type semiconductor buried beneath. The effective Drude permittivity of the cavity array is tuned by changing the depletion layer thickness via a gate bias applied between the strips and a back metal reflector. Combining Maxwell equations for terahertz waves with a drift-diffusion model for the semiconductor carriers into a multiphysics framework, we show that the proposed modulation concept is promising for a large part of the terahertz spectrum.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:hCrLmN-GePgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dual-band electro-optic polarization switch based on dual-core liquid-crystal photonic crystal fibers",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-52-26-6439",
            "Abstract": "Compact voltage-controlled all-in-fiber polarization switches are designed and investigated based on dual-core photonic crystal fibers, by selectively infiltrating one of the fiber’s cores with a nematic liquid crystal. The electro-optical control of the liquid crystal core’s optical properties allows for the splitting of the two orthogonal polarizations, showing crosstalk values lower than −20  dB in a 40 nm window at 1550 nm, for an ultracompact length less than 0.6 mm. With proper selection of the control voltage and the component length, dual-band operation with a crosstalk lower than −20  dB is also demonstrated for the 1300 and 1550 nm telecom bands.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:WbkHhVStYXYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "High numerical aperture vectorial imaging in coherent optical microscopes",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-16-2-507",
            "Abstract": "Imaging systems are typically partitioned into three components: focusing of incident light, scattering of incident light by an object and imaging of scattered light. We present a model of high Numerical Aperture (NA) imaging systems which differs from prior models as it treats each of the three components of the imaging system rigorously. It is well known that when high NA lenses are used the imaging system must be treated with vectorial analysis. This in turn requires that the scattering of light by the object be calculated rigorously according to Maxwell’s equations. Maxwell’s equations are solvable analytically for only a small class of scattering objects necessitating the use of rigorous numerical methods for the general case. Finally, rigorous vectorial diffraction theory and focusing theory are combined to calculate the image of the scattered light. We demonstrate the usefulness of the model through examples.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:abG-DnoFyZgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Wide-angle beam propagation method for liquid-crystal device calculations",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-39-31-5707",
            "Abstract": "A wide-angle beam propagation method suitable for analyzing anisotropic devices involving liquid crystals is presented. The mathematical formulation is based on a system of coupled differential equations involving an electric and a magnetic field component. The contribution of all dielectric tensor elements is included. A numerical implementation based on finite differences is used. Numerical examples are focused on light-wave propagation within twisted nematic pixels found in microdisplays, with all effects arising at pixel edges that are incorporated. A comparison between the results obtained and the prediction of finite-difference time-domain simulations is conducted, showing satisfactory agreement. The required computational effort is found to be minimal.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optical disk and reader therefor",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=3635534735991443843&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Surface plasmon circuitry in opto-electronics",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=QELS-2012-QM2K.5",
            "Abstract": "This tutorial reviews the physics of surface plasmon circuitry in order to bring to the fore recently demonstrated applications of surface plasmon in optoelectronics such as on-board optical interconnects or routing in datacom networks.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Electrically tunable solid-state terahertz metamaterial absorbers",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8534075/",
            "Abstract": "This work presents the design of electrically tunable solid-state metamaterial absorbers in the terahertz spectrum. The proposed devices consist of a metal-insulator-metal resonant cavity formed between a subwavelength metal stripe grating and a back metal reflector. The dielectric spacing between the metallic parts is occupied by a deeply subwavelength layer of n-doped GaAs. By reverse biasing the Schottky junction formed at the interface between GaAs and the top metal grating, the thickness of the associated carrier depletion zone is controlled and, hence, the GaAs complex permittivity profile in the resonant cavities. Optimized structures are derived based on the mechanism of critical coupling, achieving amplitude modulation of the reflected terahertz wave with low insertion losses and theoretically infinite extinction ratio.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:PoWvk5oyLR8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Thermo-optic plasmo-photonic mode interference switches based on dielectric loaded waveguides",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3670500",
            "Abstract": "We demonstrate an efficient thermo-optic dielectric loaded surface plasmon polariton waveguide (DLSPPW) 2 × 2 switch using a high thermo-optic coefficient polymer and a dual mode interference configuration. Unlike previous configurations relying on single-mode waveguide circuitry, the switch we consider is based on the interference between a plasmonic and a low-damping photonic mode of the DLSPPW, thus leading to the minimization of insertion losses of the device. Switching extinction ratios of 7 dB are measured for a compact 119 μm-long device. The overall device performances are in good agreement with numerical simulations performed using the beam propagation method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Light propagation in nanophotonic waveguides considering graphene's saturable absorption",
            "Publication year": 2020,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.102.053512",
            "Abstract": "We study saturable absorption in graphene-comprising nanophotonic waveguides taking into account the finite relaxation time as well as the carrier diffusion due to the nonuniform, tightly confined spatial profile of the guided modes. We discuss various details of graphene SA and comment on the necessary conditions that allow for directly comparing our model with available experimental. The mathematical framework is based on the nonlinear Schrödinger equation which provides a strict framework for our analysis and is developed for two optical channels. We explore the propagation of cw, long and short pulsed signals in a silicon slot waveguide and show the importance of our model in order to capture the ultrafast dynamics of graphene and the spatial distribution of guided modes. Finally, we demonstrate how cross absorption modulation can be exploited in order to imprint data from a high power optical …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "3-D optical simulations of azimuthal bistable nematic devices",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15421400490437042",
            "Abstract": "A composite scheme based on the Finite-Difference Time-Domain (FDTD) method and a plane wave expansion is developed and applied to the optics of doubly periodic liquid crystal microstructures. This is used to investigate 3-D light wave propagation in grating aligned azimuthal bistable nematic devices.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Beam-splitter switches based on zenithal bistable liquid-crystal gratings",
            "Publication year": 2014,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.90.042503",
            "Abstract": "The tunable optical diffractive properties of zenithal bistable nematic liquid-crystal gratings are theoretically investigated. The liquid-crystal orientation is rigorously solved via a tensorial formulation of the Landau–de Gennes theory and the optical transmission properties of the gratings are investigated via full-wave finite-element frequency-domain simulations. It is demonstrated that by proper design the two stable states of the grating can provide nondiffracting and diffracting operation, the latter with equal power splitting among different diffraction orders. An electro-optic switching mechanism, based on dual-frequency nematic materials, and its temporal dynamics are further discussed. Such gratings provide a solution towards tunable beam-steering and beam-splitting components with extremely low power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:LPZeul_q3PIC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "On the calculation of the quality factor in contemporary photonic resonant structures",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/oe/fulltext.cfm?uri=oe-27-10-14505",
            "Abstract": "The correct numerical calculation of the resonance characteristics and, principally, the quality factor Q of contemporary photonic and plasmonic resonant systems is of utmost importance, since Q defines the bandwidth and affects nonlinear and spontaneous emission processes. Here, we comparatively assess the commonly used methods for calculating Q using spectral simulations with commercially available, general-purpose software. We study the applicability range of these methods through judiciously selected examples covering different material systems and frequency regimes from the far-infrared to the visible. We take care in highlighting the underlying physical and numerical reasons limiting the applicability of each one. Our findings demonstrate that in contemporary systems (plasmonics, 2D materials) Q calculation is not trivial, mainly due to the physical complication of strong material dispersion and light …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:XoXfffV-tXoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optical diffraction from a liquid crystal phase grating",
            "Publication year": 2002,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1446216",
            "Abstract": "The finite-difference time-domain method has been used in the numerical analysis of the optical diffraction properties of a liquid crystal phase grating. The grating is formed using a nematic material that is switched using striped electrodes with a unity mark-space ratio. Three different surface pretilts have been investigated: 0°, 30° parallel, and 30° antiparallel. The tilt geometry determines the degree of suppression of the zero order and the asymmetry of the diffraction. Highly efficient beam-steering devices are shown to be possible using the antiparallel tilt alignment.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:b0M2c_1WBrUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Terabyte Optical Data Storage",
            "Publication year": 2005,
            "Publication url": "https://doc.rero.ch/record/8403/files/T_r_k_P._-_Terabyte_optical_data_storage_20071130.pdf",
            "Abstract": "P Török 1, PRT Munro 1, M. Salt 2, HP Herzig 2, E. Kriezis 3, B Eastley 1 1 Imperial College, Blackett Laboratory, Prince Consort Rd, London SW7 2BW, UK 2 Institute of Microtechnology, University of Neuchâtel, Rue A.-L. Breguet 2, CH-2000 Neuchâtel, Switzerland 3 Aristotle University of Thessaloniki, Dept. of Electrical and Computer Engineering Division of Telecommunications, Thessaloniki 54 124, Greece Email: peter. torok@ imperial. ac. uk",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:dshw04ExmUIC",
            "Publisher": "Friedrich Schiller University"
        },
        {
            "Title": "Modeling nonlinear resonators comprising graphene: A coupled mode theory approach",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_qels-2017-FTu3H.3",
            "Abstract": "We develop a perturbation theory framework for modeling nonlinear resonators comprising dispersive sheet materials. It is applied to model optical bistability with graphene-based nonlinear resonant structures in the THz and near-infrared regimes.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:EYYDruWGBe4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Tunable polarization properties of hybrid-guiding liquid-crystal photonic crystal fibers",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-27-6-773",
            "Abstract": "Tunable polarization properties in hybrid-guiding photonic crystal fibers infiltrated with nematic liquid-crystalline materials are theoretically investigated, both in the case of uniform switching of the liquid crystal molecules and for realistic nematic director patterns. It is demonstrated that the bandgap formation mechanism and the modal transmission properties in such fibers offer the possibility for electrically switchable, wavelength-selective single-polarization and/or zero to extremely high-birefringence guidance.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A switchable circular polarizer based on zenithal bistable liquid crystal gratings",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0022-3727/49/19/195104/meta",
            "Abstract": "A switchable circular polarizer for infrared telecom wavelengths based on zenithal bistable liquid crystal gratings is designed and investigated by employing the finite-element method for the study of full-wave light propagation and a tensorial formulation for the liquid crystal orientation. The handedness of the output circular polarization can be selected by switching between the two stable states of the liquid-crystal grating. Analysis of the spectral dependence and the tolerance of the polarizer's performance with respect to deviations from the optimized geometry reveals the robustness of its polarizing properties, which stems from the non-resonant nature of its operation.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Relay selection in relay-assisted free space optical systems",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6134064/",
            "Abstract": "We investigate transmission protocols for relay-assisted free-space optical (FSO) systems, when multiple parallel relays are employed and there is no direct link between the source and the destination. As an alternative to all-active FSO relaying, where all the available relays transmit jointly, we propose a scheme which selects only a single relay to participate in the communication between the source and the destination in each transmission slot, based on the channel state information (CSI) obtained from all FSO links. Thus, the need for synchronizing the relays' transmission is avoided, while the slowly varying nature of the atmospheric channel is exploited. For both relay selection and all-active relaying, novel analytical closed-form expressions for their outage performance are derived, assuming the Gamma-Gamma channel model. Numerical results are provided for equal and non-equal length FSO links, which …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical simulations and measurements of In-Plane-Switching structures with rapid refractive-index variations.",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling light propagation in liquid crystal devices with a 3-D full-vector finite-element beam propagation method",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-008-9261-2",
            "Abstract": "A full-vector finite-element beam propagation method in 3-D is introduced for the simulation of light propagation in liquid crystal (LC) devices. The three electric field components are expressed in terms of mixed finite elements, providing the correct enforcement of boundary conditions. Moreover, the optical dielectric tensor of the medium can have all its nine elements nonzero, thus allowing the LC director to have an arbitrary orientation. A photonic crystal fiber with a LC infiltrated core and a homeotropic to multi-domain cell are analyzed. Comparison with other existing simulation techniques is provided, in order to validate the accuracy of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Quasi-soliton pulse-train propagation in dispersion-managed silicon rib waveguides",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6469165/",
            "Abstract": "Dispersion-managed soliton-like pulse-train propagation in silicon rib waveguides is theoretically investigated by means of the nonlinear Schrödinger equation. A vectorial formulation is employed taking rigorously into account all relevant phenomena. For the purpose of minimizing pulse broadening, the waveguide width is precisely engineered (tapered) along the propagation direction by demanding that the soliton formation condition is locally satisfied. For typical carrier lifetimes (3 ns), bit rates up to 160 Gb/s can be transmitted with negligible pulse broadening and less than 3 dB of free-carrier-induced loss. The application of a carrier-sweep bias allows for the extension of the transmission rate beyond 1.28 Tb/s, matching current trends in silicon-photonic optical time-division multiplexing systems.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Protocols for relay-assisted free-space optical systems",
            "Publication year": 2011,
            "Publication url": "https://arxiv.org/abs/1105.3835",
            "Abstract": "We investigate transmission protocols for relay-assisted free-space optical (FSO) systems, when multiple parallel relays are employed and there is no direct link between the source and the destination. As alternatives to all-active FSO relaying, where all the available relays transmit concurrently, we propose schemes that select only a single relay to participate in the communication between the source and the destination in each transmission slot. This selection is based on the channel state information (CSI) obtained either from all or from some of the FSO links. Thus, the need for synchronizing the relays' transmissions is avoided and the slowly varying nature of the atmospheric channel is exploited. For both relay selection and all-active relaying, novel closed-form expressions for their outage performance are derived, assuming the versatile Gamma-Gamma channel model. Furthermore, based on the derived analytical results, the problem of allocating the optical power resources to the FSO links is addressed, and optimum and suboptimum solutions are proposed. Numerical results are provided for equal and non-equal length FSO links, which illustrate the outage behavior of the considered relaying protocols and demonstrate the significant performance gains offered by the proposed power allocation schemes.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "All‐Dielectric Toroidal Metasurfaces for Angular‐Dependent Resonant Polarization Beam Splitting",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adom.202002143",
            "Abstract": "An all‐dielectric metasurface exhibiting a strong toroidal resonance is theoretically designed and experimentally demonstrated as an angular‐dependent resonant polarization beam‐splitter in the microwave K‐band. The metasurface is fabricated by embedding a square periodic array of high‐permittivity ceramic cuboid resonators in a 3D‐printed substrate of polylactic acid. It is demonstrated that by properly selecting the resonator geometry and by tuning the angle of incidence through mechanical rotation, the metasurface can switch between a polarization beam splitting and bandpass or bandstop operation. Such performance is achieved by exploiting the highly asymmetric Fano spectral profile of the toroidal resonance and the very low (high) dispersion of the associated p‐(s‐) polarized mode resulting from the resonant toroidal dipole mode's field profile, as evidenced by both full‐wave and band structure …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Theoretical and experimental optical studies of cholesteric liquid crystal films with thermally induced pitch gradients",
            "Publication year": 2006,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.73.061701",
            "Abstract": "The reflection properties of cholesteric films with thermally induced pitch gradients are theoretically and experimentally studied. It is shown that the optical behavior of such films corresponds to the averaged contribution of a number of stochastic pitch variation profiles, due to the transversal and longitudinal nonuniformities that develop in the helical structure of such samples. Depending on the annealing time, both narrow-band and broadband behavior can be selectively achieved. The influence of the pitch profile gradient on the broadband reflection performance of cholesteric samples is theoretically analyzed, and a multi-slab structure for achieving optimum efficiency is proposed.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Liquid Crystal Diffractive Optical Elements",
            "Publication year": 2007,
            "Publication url": "http://irep.ntu.ac.uk/15089/",
            "Abstract": "Liquid crystal diffractive optical elements - IRep - Nottingham Trent University Current students | \nNOW | Staff login Nottingham Trent University Study with us International Services for business \nResearch Alumni NTU > IRep IRep Liquid crystal diffractive optical elements Tools + Tools \nKriezis, EE and Brown, CV ORCID: 0000-0002-1559-3238, 2007. Liquid crystal diffractive \noptical elements. In: Handbook of organic electronics and photonics. American Scientific \nPublishers. ISBN 1588830950 Full text not available from this repository. Item Type: Chapter \nin book Creators: Kriezis, EE and Brown, CV Publisher: American Scientific Publishers Date: \n2007 ISBN: 1588830950 Divisions: Schools > School of Science and Technology Record \ncreated by: EPrints Services Date Added: 09 Oct 2015 10:35 Last Modified: 09 Jun 2017 13:33 \nURI: http://irep.ntu.ac.uk/id/eprint/15089 Actions (login required) Edit View Edit View Views (on…",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:CHSYGLWDkRkC",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "Hybrid silicon-plasmonics: efficient waveguide interfacing for low-loss integrated switching components",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8424/84241E/Hybrid-silicon-plasmonics--efficient-waveguide-interfacing-for-low-loss/10.1117/12.922298.short",
            "Abstract": "We present a thorough numerical investigation of end-fire coupling between dielectric-loaded surface plasmon polariton (DLSPP) and compact rib/wire silicon-on-insulator (SOI) waveguides. Simulations are based on the three-dimensional vector finite element method. The interface geometrical parameters leading to optimum performance, i.e., maximum coupling efficiency or, equivalently, minimum insertion loss (IL), are identified. We show that coupling efficiencies as high as 85 % are possible. In addition, we quantify the fabrication tolerances about the optimum parameter values. In the same context, we assess the effect of a metallic stripe gap and that of a horizontal offset between waveguides on insertion loss. Finally, we demonstrate that by benefiting form the low-loss coupling between the two waveguides, hybrid silicon-plasmonic 2 x 2 thermo-optic switching elements can outperform their all-plasmonic …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:RGFaLdJalmkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Relay selection protocols for relay-assisted free-space optical systems",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-5-1-92",
            "Abstract": "We investigate transmission protocols for relay-assisted free-space optical (FSO) systems, when multiple parallel relays are employed and there is no direct link between the source and the destination. As alternatives to all-active FSO relaying, where all the available relays transmit concurrently, we propose schemes that select only a single relay to participate in the communication between the source and the destination in each transmission slot. The selection is based on the channel state information obtained either from all or from the last used FSO links. Thus, the need for synchronization of the relays’ transmissions is avoided, while the slowly varying nature of the atmospheric channel is exploited. For the considered relay selection and all-active relaying schemes, novel closed-form expressions for the outage performance are derived, assuming the versatile Gamma–Gamma channel model. In addition, based on …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "OPTIP-4 Theoretical and experimental analysis of cholesteric broadband reflectors with thermally induced pitch gradients",
            "Publication year": 2006,
            "Publication url": "https://ilcc.confex.com/ilcc/2006/techprogram/P3155.HTM",
            "Abstract": "Broadband cholesteric reflectors are well-known for their ability to reflect circular polarized light over the entire visible spectrum. Among other techniques, such reflectors can be fabricated via thermal annealing of individual cholesteric films, which leads to the development of a pitch gradient due to a thermal diffusion process [1, 2]. The reflection properties of cholesteric reflectors with thermally induced pitch gradients are both theoretically investigated via the finite-difference time-domain method, and experimentally verified [3]. The optical behaviour of such films can be attributed to the averaged contribution of many stochastic pitch variation samples due to the longitudinal and transversal inhomogeneities present in the samples (Fig. 1). The reflection properties of the sample can be tuned depending on the annealing time, leading to both narrow-band and broadband behaviour. A theoretical approach on the influence of the pitch transition form on the broadband reflection performance of cholesteric samples is presented, and, finally, a multi-slab structure is proposed for optimum efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wave Mixing in Graphene Nonlinear Resonators Utilizing Coupled-Mode Theory",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=EQEC-2019-ei_p_6",
            "Abstract": "A rigorous mathematical framework combining temporal coupled-mode theory (CMT) and perturbation theory for modeling wave mixing in resonant systems involving 2D (sheet) materials is developed, expanding the existing literature that focuses on wave mixing in bulk systems [1]. Throughout this work, conductive 2D materials are naturally modeled with a nonlinear surface current term, rigorously implemented in the nonlinear CMT formalism to accurately describe the system response using coefficients calculated after linear finite-element (FEM) simulations. The developed framework is flexible, allowing the systematic incorporation of other nonlinear effects such as the Kerr effect, two photon absorption, and saturable absorption [2], unfolding the complex dynamic behavior of the system, that can also demonstrate optical bistability and limit cycles [1, 3].",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:0N-VGjzr574C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Silicon-photonic electro-optic modulators based on graphene and epsilon-near-zero materials",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=iprsn-2018-IW3B.5",
            "Abstract": "Silicon-photonic modulators are investigated, integrating either graphene or epsilon-near-zero films, tuned by the field effect. Both waveguide and resonance modulation schemes are demonstrated, allowing for compact, efficient, and broadband designs.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Quasi-soliton propagation in dispersion-engineered silicon nanowires",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401812003100",
            "Abstract": "Soliton-like propagation of ultra-short pulses in dispersion-engineered silicon photonic wires is theoretically investigated via the nonlinear Schrödinger equation. It is shown that by proper patterning of silicon waveguides, the engineering of group velocity dispersion can effectively compensate for both linear and two-photon absorption-induced nonlinear losses. Quasi-soliton propagation is demonstrated for 100-fs pulses over large propagation lengths for a realistic silicon wire of optimally patterned waveguide width.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:70eg2SAEIzsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "OPTICAL TECHNOLOGY AND BIOMEDICAL OPTICS-Diffraction and Gratings-Surface-stabilized ferroelectric liquid-crystal diffraction gratings with micrometer-scale pitches",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4479819855366632011&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:foquWX3nUaYC",
            "Publisher": "[New York: Optical Society of America], 1962-"
        },
        {
            "Title": "Light propagation in domain walls in ferroelectric liquid crystal devices by the finite-difference time-domain method",
            "Publication year": 2000,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1464-4258/2/1/305/meta",
            "Abstract": "A finite-difference time-domain method for light wave propagation through a liquid crystal cell containing a twisted/tilted deformation profile is presented. Our interest is focused on deformation profiles that correspond to the commonly encountered domain walls found in ferroelectric liquid crystal (FLC) devices. The mathematical formulation is based on Maxwell's equations, and, apart from the numerical discretization, no assumptions are made. This results in consistent treatment of all phenomena associated with light wave propagation within the FLC device. The transmitted optical intensity between arbitrarily placed polarizers is calculated for various combinations of the parameters involved. Comparison is also made between the obtained results and the outcome of the standard Berreman 4× 4 matrix method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A 320 Gb/s-Throughput Capable 22 Silicon-Plasmonic Router Architecture for Optical Interconnects",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6012500/",
            "Abstract": "We demonstrate a 2 × 2 silicon-plasmonic router architecture with 320 Gb/s throughput capabilities for optical interconnect applications. The proposed router platform relies on a novel dual-ring Dielectric-Loaded Surface Plasmon Polariton (DLSPP) 2 × 2 switch heterointegrated on a Silicon-on-Insulator (SOI) photonic motherboard that is responsible for traffic multiplexing and header processing functionalities. We present experimental results of a Poly-methyl-methacrylate (PMMA)-loaded dual-resonator DLSPP waveguide structure that uses two racetrack resonators of 5.5 μm radius and 4 μ m-long straight sections and operates as a passive add/drop filtering element. We derive its frequency-domain transfer function, confirm its add/drop experimental spectral response, and proceed to a circuit-level model for dual-ring DLSPP designs supporting 2 × 2 thermo-optic switch operation. The validity of our circuit-level …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical nanophotonic resonant element for switching and routing applications exploiting graphene saturable absorption",
            "Publication year": 2020,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0004552",
            "Abstract": "A silicon disk resonator overlaid with a uniform graphene layer in an add-drop configuration is proposed as an all-optical routing element. Operation is based on the saturable absorption effect provided by the graphene layer. The element is thoroughly analyzed as a two-channel device in the context of an appropriate nonlinear framework combining perturbation theory and temporal coupled-mode theory. Taking into consideration the primary nonlinear effect, which is graphene saturable absorption, a design path is carefully developed that eventually leads to a traveling-wave resonant element with low-power requirements, low insertion loss, high extinction ratio, and sufficient bandwidth. In a subsequent step, other important nonlinear effects originating from graphene and the silicon disk, including the Kerr effect and free-carrier effects, are considered and means for counterbalancing their action are demonstrated. A …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:rmuvC79q63oC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Optical bistability with hybrid silicon-plasmonic disk resonators",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-31-7-1698",
            "Abstract": "Optical bistability with a hybrid silicon-plasmonic configuration consisting of a nonlinear traveling-wave (disk) resonator side-coupled with a bus waveguide is theoretically investigated. The nonlinear response is studied with a theoretical framework combining perturbation theory and temporal coupled-mode theory. For the CW case, a general closed-form expression is derived. The effect of the parameters entering in the expression on the bistability curve is thoroughly investigated, and the physical system is accordingly designed so as to exhibit minimum power threshold for bistability and maximum extinction ratio between bistable states. Finally, the temporal dynamics are assessed. The system can toggle between bistable states in approximately 5 ps and is thus suitable for ultrafast memory and switching applications.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:sSrBHYA8nusC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Theoretical and experimental studies of hyperreflective polymer-network cholesteric liquid crystal structures with helicity inversion",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401808011437",
            "Abstract": "Single-layer cholesteric liquid crystals exhibit a reflection coefficient which is at most 50% for unpolarized incident light. We give theoretical and experimental evidence of single-layer polymer-stabilized cholesteric liquid-crystalline structures that demonstrate hyper-reflective properties. Such original features are derived by the concurrent and randomly interlaced presence of both helicities. The fundamental properties of such structures are revealed by detailed numerical simulations based on a stochastic approach.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:kNdYIx-mwKoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Three-dimensional simulations of light propagation in periodic liquid-crystal microstructures",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-41-25-5346",
            "Abstract": "A composite scheme based on the finite-difference time-domain method and a plane-wave expansion method is developed and applied to the optics of periodic liquid-crystal microstructures. This is used to investigate three-dimensional light-wave propagation in grating-induced bistable nematic devices with double periodicity. Detailed models of realistic devices are analyzed with emphasis on two different underlying surface-relief grating structures: a smooth bisinusoidal grating and a square-post array. The influence of the grating feature size is quantified. Device performance is examined in conjunction with an appropriate compensation layer, and the optimum layer thickness is determined for the different grating geometries.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A numerical study of optical switches and modulators based on ferroelectric liquid crystals",
            "Publication year": 2004,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1464-4258/7/1/013/meta",
            "Abstract": "Optical switches and modulators based on ferroelectric liquid crystal (LC) cladding layers are numerically analysed. The switches follow a directional coupler design with the LC layer placed between two waveguides, and the level of coupling between them is directly controlled by the LC material state. Similarly, the modulators use the LC as a switchable cladding layer. Light propagation is tackled using an appropriate beam propagation method suitable for anisotropic materials, retaining the pertinent coupling between the field components. The variation of the LC director orientation through the cladding layer is carefully considered by examining profiles which are typically anticipated. Calculations demonstrate a performance which is compatible with the needs of a low-cost class of devices for optical communications.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Carrier-controlled nanophotonic components for routing and modulation operations",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495141/",
            "Abstract": "We present optical devices that employ free-carrier effects for routing and modulation applications. By electrically controlling the carrier concentration in indium tin oxide, we realize an electro-optic modulator employing the silicon slot waveguide platform. Moreover, using the free-carrier effects in undoped silicon, we demonstrate an optical clock utilizing self-pulsation in a long-range hybrid plasmonic disk resonator design that can additionally function as a voltage-controlled frequency modulator. Lastly, by electrically tuning graphene conductivity, we design a nonlinear interference amplitude modulator based on a silicon directional coupler configuration with an additional graphene layer.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "14TH INTERNATIONAL CONFERENCE ON GROUP IV PHOTONICS, GFP 2017",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=5099681921619281586&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Properties of highly-nonlinear hybrid silicon-plasmonic waveguides",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6801913/",
            "Abstract": "Summary form only given. Nonlinear hybrid silicon-plasmonic (HSP) waveguides are comprised of a low-index dielectric with a high nonlinear-index (n 2 ) occupying the area between a metal and a high-index dielectric, i.e. silicon. Fusing plasmonic and index-contrast guiding mechanisms [1], HSP waveguides can increase the lateral confinement thus boosting the nonlinear parameter (γ); this effect is maximized as the gap between metal and silicon reaches the 10nm-scale and can be exploited in practical integrated circuits. The HSP design incorporates silicon so as to maintain fabrication-compatibility and seamless coupling to the dominant silicon-on-insulator (SOI) platform. However, silicon exhibits two-photon absorption (TPA) below λ=2200nm, which increases the losses and additionally generates free-carriers which, in turn, give rise to secondary nonlinear free-carrier effects (FCE) [2]. The temporal …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Degenerate four-wave mixing in nonlinear resonators comprising two-dimensional materials: A coupled-mode theory approach",
            "Publication year": 2018,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.98.235421",
            "Abstract": "Two-dimensional (2D) or sheet materials have been recently recognized as fascinating materials for nonlinear photonics. Here, we develop a rigorous mathematical framework based on perturbation theory and temporal coupled-mode theory capable of analyzing third-order, χ (3), multichannel nonlinear processes in resonant systems comprising 2D materials. The framework is applied to model degenerate four-wave mixing in a guided-wave graphene plasmon-polariton resonant structure, consisting of a standing-wave resonator directly coupled to access waveguides. The results obtained with the proposed framework are compared with full-wave finite-element simulations revealing excellent agreement. Aside from being accurate and efficient, our framework allows for selectively incorporating different nonlinear phenomena, identifying their unique impact on the nonlinear response and providing valuable physical …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:Dip1O2bNi0gC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Electrically tunable metal–semiconductor–metal terahertz metasurface modulators",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8616810/",
            "Abstract": "We propose metal-semiconductor-metal cavity arrays as active elements of electrically tunable metasurfaces operating in the terahertz spectrum. Their function is based on reverse biasing the Schottky junction formed between top metal strips and the n-type semiconductor buried beneath. A gate bias between the strips and a back metal reflector controls the electron depletion layer thickness thus tuning the Drude permittivity of the cavity array. Using a rigorous multiphysics framework which combines Maxwell equations for terahertz waves and the drift-diffusion model for describing the carrier behavior in the semiconductor, we find a theoretically infinite extinction ratio, insertion loss of around 10%, and picosecond intrinsic switching times at 1 THz, for a structure designed to enter the critical coupling regime once the depletion layer reaches the bottom metal contact. We also show that the proposed modulation …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical modelling of multi-dimensional liquid crystal optics: finite-difference time-domain method",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10587250108035588",
            "Abstract": "Light wave propagation within complex liquid crystal structures is undertaken by the FDTD method, a purely numerical method that explicitly solves Maxwell's equations in space and time. A specific FDTD arrangement suitable for liquid crystal applications is described, allowing for efficient space termination, oblique angles of illumination, and correct phasor representation. Two application examples are considered: a two-domain twisted pixel formed by two oppositely twisted sub-domains, and a helical ferroelectric liquid crystal material. In each case comparison is also made with the optical prediction obtained by the Berreman method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Quasi-soliton formation in silicon nanowires with engineered dispersion profile",
            "Publication year": 2012,
            "Publication url": "http://eprints.bice.rm.cnr.it/4551/",
            "Abstract": "Soliton-like propagation of fs pulses in dispersion-engineered silicon photonic wires is theoretically investigated. Quasi-soliton propagation is demonstrated for 100-fs pulses over large propagation lengths for a realistic patterned silicon wire of optimally engineered group-velocity dispersion (GVD) profile.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:SP6oXDckpogC",
            "Publisher": "European Optical Society"
        },
        {
            "Title": "Nonlinear Photonic Resonators With Graphene: Saturable Absorption and the Effect of Carrier Diffusion and Finite Relaxation Time",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=IPRSN-2021-ITh1A.1",
            "Abstract": "We assess the CW and dynamic nonlinear optical response of microdisc res-onators enhanced by graphene saturable absorption, by carefully considering the carrier diffusion and finite relaxation time of graphene photoexcited carriers.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Tunable one-dimensional photonic crystal slabs",
            "Publication year": 2007,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6593/659314/Tunable-one-dimensional-photonic-crystal-slabs/10.1117/12.721985.short",
            "Abstract": "A 1D photonic crystal slab based on preferential etching of commercially available silicon-on-insulator wafers is presented. Compared to dry etching, anisotropic wet etching is more tolerant to errors as it is self-stopping on crystallographic {111} planes and it produces a more precise geometry with symmetries and homothetic properties, with surface roughness close to 1 nm. The resulting grooves are infiltrated by low viscosity liquid crystal having large positive optical anisotropy. The use of slanted grooves provides advantages: first of all the complete filling of slanted grooves is simplified when compared to vertical walls structures. Furthermore alignment is significantly facilitated. Indeed the liquid crystal molecules tend to align with their long axis along the submicron grooves. Therefore by forcing reorientation out of a rest position, the liquid crystal presents a choice of refractive indices to the propagating optical field …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Multi-channel nonlinear interactions in practical graphene components",
            "Publication year": 2020,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/5.0031772",
            "Abstract": "Graphene exhibits high third-order nonlinearity in both THz and NIR regimes. It can be exploited in resonant structures to enable elaborate nonlinear functionalities such as frequency generation and all-optical routing. Here, we study multi-channel nonlinear interactions in practical guided-wave resonators comprising graphene. We demonstrate four-wave mixing in the THz with a graphene micro-ribbon standing-wave resonator supporting tightly confined graphene plasmons, and saturable-absorption-based all-optical routing in the NIR with a graphene-covered silicon photonic microdisk. For calculating the nonlinear response, we employ a recently developed perturbation theory/coupled-mode theory framework which is both efficient and accurate. Harnessing the intrinsic nonlinear properties of graphene and following a thorough design process for each component, we demonstrate low power requirements …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:anf4URPfarAC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Design and optimization of uniplanar EBG structures",
            "Publication year": 2012,
            "Publication url": "https://content.iospress.com/articles/international-journal-of-applied-electromagnetics-and-mechanics/jae01519",
            "Abstract": "Electromagnetic bandgaps (EBG) are periodic formations, inspired by photonic crystals, exhibiting prohibited frequency bands for electromagnetic wave propagation. The uniplanar EBG is particularly assessed, due to its fabrication simplicity and is found to exhibit a propagation mode that cancels the desired bandgap behaviour. Two new planar EBG structures, without such modes are presented, retaining the distinct feature of easy fabrication, since the metallic structures are exclusively on the interface layers, with no vertical connections. The EBGs are optimized to maximize the bandgap, making them suitable for the design of wideband microwave circuits and antennas.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Transparent conducting oxide electro-optic modulators on silicon platforms: A comprehensive study based on the drift-diffusion semiconductor model",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4973896",
            "Abstract": "Electro-optic waveguide modulators exploiting the carrier-induced epsilon-near-zero effect in transparent conducting oxides are comprehensively studied and evaluated using a rigorous multi-physics modeling framework. The examined amplitude modulators integrate indium tin oxide with two representative examples of the silicon-on-insulator technology, the silicon-rib and silicon-slot platform, with the latter design exhibiting superior performance, featuring μm modulation lengths, switching speeds exceeding 100 GHz, and a sub-pJ per bit of energy consumption. The effect of free carriers is rigorously introduced by combining the drift-diffusion model for the description of the carrier dynamics with near-infrared carrier-dependent permittivity models, leading to a seamless and physically consistent integration of solid-state physics and Maxwell wave theory on a unified finite-element platform.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:p__nRnzSRKYC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Calculation of the efficiency of polarization-insensitive surface-stabilized ferroelectric liquid-crystal diffraction gratings",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=AO-42-13-2257",
            "Abstract": "A rigorous analysis is presented of the diffraction efficiency of a polarization-insensitive surface-stabilized ferroelectric liquid-crystal (SSFLC) phase grating, taking full account of the internal structure of the ferroelectric liquid-crystal layer. When no field is applied, the twisted director profile in the relaxed state gives an optimum diffraction efficiency for a device thickness between the half-wave-plate and the full-wave-plate conditions. The influence of the magnitude of the spontaneous polarization and applied ac fields are investigated, and it is shown that the diffraction efficiency of a binary SSFLC phase grating can be strongly enhanced with the technique of ac stabilization.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:Zph67rFs4hoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Computational techniques for the analysis and design of dielectric-loaded plasmonic circuitry",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-011-9440-4",
            "Abstract": "The finite element and the beam propagation method, two widely used methods in photonics, are utilized for the analysis of plasmonic components based on the dielectric-loaded plasmonic waveguide. Two components are chosen as examples and are subsequently numerically investigated by employing the aforementioned methods, in order to demonstrate their applicability in plasmonics. Specifically, a microring resonator add-drop filter and a Mach–Zehnder interferometric switch are analyzed by means of the finite element and the beam propagation method, respectively. The formulation adopted is clearly presented in both cases and the case-dependent implementation details are thoroughly discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Fast analysis of photonic crystal structures with mixed-order prism macroelements",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-26-13-2002",
            "Abstract": "In this paper, a new concept of a mixed-order prism macroelement is introduced for the analysis of photonic crystal slabs and waveguiding structures. The mixed-order concept used here implies arbitrary orders of variation towards different directions and it differs essentially from the well-known mixed-order approximation that is an integral part of every Whitney element. The reduction of degrees of freedom, achieved by the employment of such elements, facilitates the solution of the resulting eigenvalue equation. Thus, an efficient 3-D finite-element analysis tool is developed to calculate the band structure of both symmetric and asymmetric photonic crystal slabs. Dispersion relation results for two different types of photonic crystal waveguides are also presented, to further verify the method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Longitudinal 2 x 2 switching configurations based on thermo-optically addressed dielectric-loaded plasmonic waveguides",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5955059/",
            "Abstract": "Longitudinal 2 × 2 thermo-optic switches based on dielectric-loaded plasmonic circuitry are thoroughly studied using vectorial numerical tools, i.e., an eigenmode solver and a beam propagation method, implemented with the finite-element technique. The switching configurations studied are based on the Mach-Zehnder interferometer (MZI) and a novel multimode interference (MMI) design. Both components offer improved performance, with respect to comparable microring-based ones, exhibiting larger bandwidth and output port extinction ratio, allowing values up to 30 dB. The reference MZI configuration has better overall performance when compared to the MMI, mainly in terms of available bandwidth.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Path integral analysis for Gaussian beam propagation over non‐penetrable obstacles",
            "Publication year": 2000,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/03321640010347411/full/html",
            "Abstract": "The path integral analysis has been used to examine the propagation of a Gaussian beam in two cases. First in free space and second in a space with a non‐penetrable obstacle, placed parallel to the direction of propagation. Full analytical equations have been given in both cases and results have been taken in the same spatial coordinates in order to facilitate comparisons. No numerical instabilities have been observed and the method seems to be quite tractable and easily extended in spaces with more that one obstacle.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:eMMeJKvmdy0C",
            "Publisher": "MCB UP Ltd"
        },
        {
            "Title": "Rigorous near-to far-field transformation for vectorial diffraction calculations and its numerical implementation",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOSAA-23-3-713",
            "Abstract": "A rigorous method for transforming an electromagnetic near-field distribution to the far field is presented. We start by deriving a set of self-consistent integral equations that can be used to represent the electromagnetic field rigorously everywhere in homogeneous space apart from the closed interior of a volume encompassing all charges and sinks. The representation is derived by imposing a condition analogous to Sommerfeld's radiation condition. We then examine the accuracy of our numerical implementation of the formula, also on a parallel computer cluster, by comparing the results with a case when the analytical solution is also available. Finally, an application example is shown for a nonanalytical case.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Parametric study of dielectric loaded surface plasmon polariton add-drop filters for hybrid silicon/plasmonic optical circuitry",
            "Publication year": 2011,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7945/794513/Parametric-study-of-dielectric-loaded-surface-plasmon-polariton-add-drop/10.1117/12.873165.short",
            "Abstract": "Surface plasmons polaritons are electromagnetic waves propagating along the surface of a conductor.  Surface plasmons photonics is a promising candidate to satisfy the constraints of miniaturization of optical interconnects. This contribution reviews an experimental parametric study of dielectric loaded surface plasmon waveguides ring resonators and add-drop filters within the perspective of the recently suggested hybrid technology merging plasmonic and silicon photonics on a single board (European FP7 project PLATON \"Merging Plasmonic and Silicon Photonics Technology towards Tb/s routing in optical interconnects\"). Conclusions relevant for dielectric loaded surface plasmon switches to be integrated in silicon photonic circuitry will be drawn. They rely on the opportunity offered by plasmonic circuitry to carry optical signals and electric currents  through the same thin metal circuitry. The heating of the …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:hFOr9nPyWt4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Polarisation-maintaining and highly-briefringent liquid-crystal photonic crystal fibers",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4013912/",
            "Abstract": "Numerical studies demonstrate that infiltration of index- or bandgap-guiding photonic crystal fibers with nematic liquid crystalline materials may allow for tunable operation, such as single-polarisation or controllable birefringence guidance",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Highly nonlinear hybrid silicon-plasmonic waveguides: analysis and optimization",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-30-7-1954",
            "Abstract": "We rigorously analyze nonlinear propagation in hybrid silicon-plasmonic (HSP) waveguides. Focusing on the relative importance of Kerr and free carrier effects (FCE) originating from two-photon absorption, we establish a set of figures of merit applicable to any silicon-comprising waveguide. An optimized HSP design is proposed, deeply confining the optical field in a nanosized nonlinear polymer gap formed between a metal wedge and an underlying silicon wire. An exceptionally high nonlinear parameter γ>10^4  m^−1 W^−1 is attained, combined with an FCE power threshold larger than 1 W, even in CW. The formulation is also extended to multimode waveguides, supported by two all-optical applications of an HSP nonlinear directional coupler.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:u9iWguZQMMsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Conoscopic observations of a homeotropically aligned antiferroelectric liquid crystal device: a comparison of theory and experiment",
            "Publication year": 2002,
            "Publication url": "https://iopscience.iop.org/article/10.1143/JJAP.41.L1485/meta",
            "Abstract": "A homeotropically aligned sample of CS4001 is examined conoscopically both in the ground state and under the application of an electric field parallel to the smectic layers. The results compare well with those predicted by a combination of an extended Jones optical method and a theoretical model of the helix distortions. The comparison not only gives support to the underlying theory, but allows the determination of values for the elastic constant associated with distortions to the helical structure, and also a combination of the interlayer coupling coeffients.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diffraction from the two stable states in a nematic liquid crystal cell containing a mono-grating with homeotropic director alignment",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15421400490433352",
            "Abstract": "In this work we use the Q-tensor order parameter to express the elastic free energy of a nematic liquid crystal. This correctly preserves the +n/−n symmetry and thus allows the modelling of defects. Using this, we calculate director profiles for cells containing surface relief gratings. Director profiles are presented which demonstrate that the cell supports two stable director configurations, in agreement with previous investigations [1–3]. The director profiles calculated are used in conjunction with Finite-Difference Time-Domain optical modelling to simulate the diffraction from the two stable states. The results of these simulations are then compared with experimental results for a cell fabricated with a relief grating on one internal surface. Diffraction strength is measured as a function of incident angle and as a function of incident polarisation.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:lSLTfruPkqcC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Switchable beam steering with zenithal bistable liquid-crystal blazed gratings",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-39-20-5842",
            "Abstract": "Switchable beam steerers based on zenithal bistable liquid crystal (LC) gratings are designed and theoretically investigated. The nematic orientation profiles and the optical transmittance properties of the gratings are rigorously calculated, respectively, via a tensorial formulation of the Landau-de Gennes theory and the full-wave finite-element-method. By proper design of the grating geometry, beam steering with high diffraction efficiency is demonstrated between the two stable LC states. The tolerance of the device performance with respect to material parameters is assessed, evidencing spectral operation windows of more than 50 nm in the visible for a beam steering efficiency higher than 90%.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:geHnlv5EZngC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Tunable optical properties of silicon-on-insulator photonic crystal slab structures",
            "Publication year": 2009,
            "Publication url": "http://www.jeos.org/index.php/jeos_rp/article/view/274",
            "Abstract": "A photonic crystal slab structure with one-dimensional periodicity, obtained by preferential etching of a silicon-on-insulator wafer, is numerically investigated in 3-D. The etched grooves are considered to be filled either with an isotropic or with a Nematic Liquid Crystal (NLC) material. The molecular director is calculated using a consistent model of NLC reorientation under an external voltage. Different structures together with a broad range of voltage values are numerically simulated by means of a three-dimensional finite-difference time-domain method. The shifting of the photonic bandgap induced by the applied voltage, as well as its sensitivity in terms of refractometric applications, are discussed for a range of different structure geometries.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coupled-mode-theory framework for nonlinear resonators comprising graphene",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.94.062219",
            "Abstract": "A general framework combining perturbation theory and coupled-mode theory is developed for analyzing nonlinear resonant structures comprising dispersive bulk and sheet materials. To allow for conductive sheet materials, a nonlinear current term is introduced in the formulation in addition to the more common nonlinear polarization. The framework is applied to model bistability in a graphene-based traveling-wave resonator system exhibiting third-order nonlinearity. We show that the complex conductivity of graphene disturbs the equality of electric and magnetic energies on resonance (a condition typically taken for granted), due to the reactive power associated with the imaginary part of graphene's surface conductivity. Furthermore, we demonstrate that the dispersive nature of conductive materials must always be taken into account, since it significantly impacts the nonlinear response. This is explained in terms …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:BwyfMAYsbu0C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Rigorous calculation of nonlinear parameters in graphene-comprising waveguides",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4926501",
            "Abstract": "We describe a rigorous formalism for the calculation of the nonlinear parameter of arbitrary three-dimensional nanophotonic graphene-comprising waveguides. Graphene is naturally implemented as a zero-thickness conductive sheet, modeled solely by complex linear and nonlinear surface conductivity tensors, whose values are extracted from theoretical models. This representation is compared to the more commonly employed equivalent bulk-medium representation and is found superior. We numerically calculate the nonlinear parameters of several optical waveguide archetypes overlaid with infinite graphene monolayers, including silicon-wire and plasmonic metal-slot and metal-stripe configurations. The metal-slot configuration offers the most promising performance for Kerr-type nonlinear applications. Finally, we apply the same formalism to probe the potential of graphene nanoribbon waveguide nonlinearity …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:kzcrU_BdoSEC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Quarter-wave plate metasurfaces on electromagnetically thin polyimide substrates",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5132716",
            "Abstract": "We experimentally demonstrate that electromagnetically thin polyimide substrates can mitigate substrate-induced detrimental effects to the performance of metallic metasurfaces. A planar quarter-wave plate for the microwave K-band is fabricated on a polyimide substrate of deep subwavelength thickness by means of standard photolithography. By properly selecting the combination of the polyimide thickness and the aluminum layer thickness of the metasurface, conversion from linear to circular polarization is achieved at the design frequency. The proposed approach is generic, and it can be applied to the fabrication of mechanically robust, flexible metallic metasurfaces, which are primarily designed to work in a free-standing configuration.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:_axFR9aDTf0C",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Soliton-like propagation in dispersion-managed silicon nanowaveguides",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2013-CD_P_14",
            "Abstract": "Over the last few years, significant research effort has been devoted to the study of nonlinear phenomena in silicon nanowaveguides (SNWs)[1]. In particular, the capability for extensively engineering the dispersion characteristics of SNWs [1], has directed considerable interest to the dynamics of femtosecond solitonic pulses [2]. However, the formation of pure solitons in SNWs is hindered (besides linear propagation losses) by the presence of nonlinear losses, namely, two-photon (TPA) and free-carrier absorption (FCA). Despite these extra loss mechanisms, we demonstrate in this work the possibility for quasi-soliton propagation in dispersion-managed SNWs. Both single-pulse and, more importantly, pulse-train cases are thoroughly examined, by employing a vectorial nonlinear Schrödinger equation (NLSE) formulation [4], rigorously taking into account all relevant phenomena, including free-carrier and higher …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Lamina a band gap fotonico unidimensionale sintonizzabile basata su microlavorazione del silicio",
            "Publication year": 2007,
            "Publication url": "http://eprints.bice.rm.cnr.it/4404/",
            "Abstract": "We present the numerical study of a photonic crystal slab micromachined in silicon-oninsulator wafers. The slab is infiltrated with a fluid which experiences variations of its refractive index. We evaluate the band edge tuning with an anisotropic fluid.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Amplitude modulation in infrared metamaterial absorbers based on electro-optically tunable conducting oxides",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-017-1506-0",
            "Abstract": "A class of electro-optically tunable metamaterial absorbers is designed and theoretically investigated in the infrared regime towards realizing free-space amplitude modulators. The spacer between a subwavelength metallic stripe grating and a back metal reflector is occupied by a bilayer of indium tin oxide (ITO) and hafnium oxide (). The application of a bias voltage across the bilayer induces free-carrier accumulation at the /ITO interface that locally modulates the ITO permittivity and drastically modifies the optical response of the absorber owing to the induced epsilon-near-zero (ENZ) effect. The carrier distribution and dynamics are solved via the drift–diffusion model, which is coupled with optical wave propagation studies in a common finite-element method platform. Optimized structures are derived that enable the amplitude modulation of the reflected wave with moderate insertion losses, theoretically …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:tuHXwOkdijsC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A Theoretical Study of Nonlinear Multi-Channel Graphene Components for the Near and Far-Infrared",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=LS-2020-JTh4B.17",
            "Abstract": "Two graphene-based nonlinear multi-channel components are presented. They include a graphene-enhanced silicon disk resonator for all-optical saturable-absorption-induced routing in the NIR together with a high conversion-efficiency graphene standing-wave micro-ribbon resonator for FWM in the FIR.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:FAceZFleit8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Photonic integrated system-in-package platform for Tb/s silicon-plasmonic router",
            "Publication year": 2012,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2012SPIE.8265E..0BT/abstract",
            "Abstract": "In today's Peta-flop High-Performance Computing (HPC) machines the size and power consumption appear to be daunting issues, signifying that new technological and architectural considerations will be required in order to be able to move towards Exascale-computing powers. Whereas silicon photonics emerges as a powerful technology for low-loss and high bandwidth optical connectivity in integrated circuit environments, servers and network switches are already consolidating into high-density blade enclosures in order to reduce space and cooling requirements. These determine new tasks for switching infrastructures of miniature data networks: the next generation of routing circuitry has to provide high throughput capabilities while keeping in line with the requirements of small foot-print, low power consumption and low latency. Next generation computing architectures are needed with ultra low power …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dielectric-loaded plasmonic switching elements and circuits",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5953720/",
            "Abstract": "We provide a thorough theoretical investigation of switching elements made of dielectric-loaded surface plasmon polariton waveguides that can meet the practical requirements of board-to-board multi-wavelength optical interconnects. For this purpose, advanced numerical techniques including the finite element method (FEM) and the beam propagation method (BPM) have been employed.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of tunable photonic crystal devices comprising liquid crystal materials as defects",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1424248/",
            "Abstract": "The tuning properties of two-dimensional dielectric and metallic photonic crystals, which contain nematic liquid crystal materials as defect elements or layers, are thoroughly analyzed using appropriate formulations of the finite difference time domain (FDTD) method. Our methodology correctly incorporates the anisotropy introduced by the liquid crystal materials together with the dispersive properties of the metallic elements; it is used for calculating both the dispersion diagrams of the defect-free photonic crystal as well as the device response in the presence of the defect elements. Numerical simulations reveal that defect states originating from the liquid crystal impurities can be effectively tuned by the application of a local static electric field. Indeed, tuning ranges up to almost 100 nm can be achieved requiring operating voltages lower than 4 V. It is also concluded that the placement of a defect mode relative to the …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical interconnects using plasmonics and Si-photonics",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5772690/",
            "Abstract": "Optical interconnects have continued to experience significant advances during the last year, exploiting mainly relevant progress in silicon photonics technologies. This year has also marked the first attempts toward integrating silicon photonics with plasmonics and enabling the introduction of the small-size power-effective plasmonic structures in true interconnect applications. The first successful silicon-plasmonic coupling configurations have been reported, and switching by miniaturized thermo-optic plasmonic modules has been realized, resulting in the first efforts for high-throughput on-chip silicon-plasmonic router architectures.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Liquid–crystal tunable waveguides for integrated plasmonic components",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1569441012001137",
            "Abstract": "A broad range of liquid–crystal tunable plasmonic waveguides, based on long-range, dielectric-loaded, and channel surface plasmon polaritons, are theoretically designed and investigated. Liquid–crystal switching is rigorously modeled by solving for the coupled elastic/electrostatic problem, whereas the optical studies are conducted via the finite-element method. Extensive tunability of key optical properties, such as modal index, propagation losses, and modal confinement is demonstrated for waveguides of different optical confinement scale. These highly functional waveguiding structures are proposed as building blocks for the design of functional components, e.g. optical attenuators, directional couplers and switches, in integrated plasmonic chips.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:M05iB0D1s5AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Beam propagation method modelling of zenithal bistable nematic devices: analysis and assessment",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10587250108035587",
            "Abstract": "Modelling of liquid crystal optics is commonly based on variants of matrix-type solvers, which are ideally suited for addressing light wave propagation in stratified anisotropic media. Liquid crystal devices with complex director structures on the micron scale require more rigorous methods for predicting their optical response. Two potential candidate methods exist: the Beam Propagation Method and the Finite-Difference Time-Domain Method. The scope of this paper is to apply the former and assess its accuracy against the latter, which is considered to be more general. The analysis and assessment is focused on Zenithal Bistable Nematic devices.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:HDshCWvjkbEC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Tunable optical fiber polarization elements based on long-period gratings inscribed in birefringent microstructured fibers",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-25-1-111",
            "Abstract": "The polarization properties of long-period gratings inscribed in highly birefringent photonic crystal fibers are investigated in the context of a multipole method analysis. It is demonstrated that by proper design such fibers may act as selective polarization elements, showing an ample separation of the resonance peaks corresponding to the two orthogonal polarization states. Furthermore, the infiltration of the fiber's capillaries with an isotropic liquid may lead to extensive tuning of the resonant wavelengths. A tuning efficiency of up to 10 nm/°C is demonstrated in the case of a typical infiltrated birefringent photonic crystal fiber.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Design of switchable guided-mode resonant filters in zenithal-bistable liquid-crystal gratings",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7967823/",
            "Abstract": "An electro-optically switchable infrared filter based on guided-mode resonances in a zenithal-bistable liquid-crystal grating is designed and theoretically investigated. By proper selection of the material and geometrical parameters, it is shown that the grating can switch between transparent and narrowband filtering operation. Switching times of few milliseconds are predicted owing to the employment of a dual-frequency nematic liquid crystal as the addressable material. The tunability of the resonant wavelength is also studied following two approaches, namely, the adjustment of the angle of incidence of the impinging lightwave and the liquid-crystal tuning by the electro-optic effect.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:ILKRHgRFtOwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Thermo-optic microring resonator switching elements made of dielectric-loaded plasmonic waveguides",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3564949",
            "Abstract": "Thermo-optic switching elements made of dielectric-loaded plasmonic (DLSPP) waveguides are theoretically investigated by utilizing the three-dimensional vector finite element method. The configurations considered employ microring resonators, whose resonant frequency is varied by means of thermal tuning. First, a classic add-drop filter with parallel access waveguides is examined. Such a component features very poor drop port extinction ratio (ER). We therefore extend the analysis to add-drop filters with perpendicular access waveguides, which are found to exhibit superior drop port ERs, due to interference effects associated with the drop port transmission. In the process, the performance of a DLSPP waveguide crossing is also assessed, since it is a building block of those filters whose bus waveguides intersect. An elliptic tapering scheme is proposed for minimizing cross talk and its effect on the filter …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Optical Pulse Propagation in Graphene-comprising Waveguides: Beyond the Perturbative Nonlinear Regime",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=EQEC-2021-ej_2_6",
            "Abstract": "We present a consolidated overview of electromagnetic nonlinearity in graphene, spanning perturbative and thermodynamic regimes. Our focus is on all-optical applications of highly confining NIR photonic waveguide structures, where graphene is in-plane and patterned.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:2VqYfGB8ITEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Behaviour of a nematic liquid crystal cell containing a diffraction grating",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15421400390242887",
            "Abstract": "The director structure of a nematic liquid crystal cell containing a surface relief grating has been modelled using a finite element method. Homeotropic alignment is used, with weak anchoring and the flexoelectric term at the grating surface. The diffraction behaviour of the cell has been modelled using the Finite-Difference Time-Domain (FDTD) method. The liquid crystal's response depends on the sign of the applied electric field and gives different increases in diffraction strength in each case. The changes in the diffraction intensity depend on the surface anchoring and flexoelectric coefficients. Experimental results for cells with a similar structure to those modelled show that the variation of diffraction strength with electric fields of different signs is clearly observable. Results obtained by applying pulses to the cells are presented. These results are compared with the theoretical predictions and are used to estimate the …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Surface-stabilized ferroelectric liquid-crystal diffraction gratings with micrometer-scale pitches",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ao-43-28-5287",
            "Abstract": "The first-order diffraction efficiency η_1 of surface-stabilized ferroelectric liquid-crystal (SSFLC) phase gratings is calculated for device thicknesses in the range d = 1 to 5 μm and for pitches p of 5 to 20 μm assuming incident light at 633 nm. The peak value of η_1 as a function of d has negligible dependence on the incoming polarization when p = 20 μm. For smaller pitch values the peak value of η_1 decreases and becomes increasingly dependent on the orientation of the incoming polarization owing to the influence of the domain walls that occur between the SSFLC pixels.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:hC7cP41nSMkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Characterization of thermo-optical 2× 2 switch configurations made of dielectric loaded surface plasmon polariton waveguides for telecom routing architecture",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6192158/",
            "Abstract": "We report on the characterization of thermo-optic switch structures based on Dielectric Loaded Surface Plasmon Polariton Waveguide for high data bit rate transfer. Performances are extracted by Leakage Radiation Microscopy and compared to numerical results.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Theoretical and numerical modeling of linear and nonlinear propagation in graphene waveguides",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11082-016-0510-5.pdf",
            "Abstract": "A formulation for the theoretical and numerical modeling of electromagnetic wave propagation in graphene-comprising waveguides is presented, targeting applications in the linear and nonlinear regime. Waveguide eigenmodes are rigorously calculated using the finite-element method (FEM) in the linear regime and are subsequently used to extract nonlinear properties in terms of the nonlinear Schrödinger equation framework. Graphene sheets are naturally represented as sheet/2D media and are seamlessly implemented with interface conditions in the FEM, thus greatly enhancing the computational efficiency. This formulation is used to analyze the nonlinear performance of several graphene-comprising waveguide configurations in the optical band, including silicon-based photonic waveguides, metal-based plasmonic waveguides and glass microfibers. Optimal design choices are identified for each …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:EkHepimYqZsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Explicit finite-difference vector beam propagation method based on the iterated Crank-Nicolson scheme",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josaa-26-10-2183",
            "Abstract": "We introduce and develop a new explicit vector beam propagation method, based on the iterated Crank-Nicolson scheme, which is an established numerical method in the area of computational relativity. The proposed approach results in a fast and robust method, characterized by simplicity, efficiency, and versatility. It is free of limitations inherent in implicit beam propagation methods, which are associated with poor convergence or uneconomical use of memory in the solution of large sparse linear systems, and thus it can tackle problems of considerable size and complexity. The advantages offered by this approach are demonstrated by analyzing a multimode interference coupler and a twin-core photonic crystal fiber. A possible wide-angle generalization is also provided.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:mB3voiENLucC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Light propagation in domain walls in ferroelectric liquid crystal devices by the finite-difference time-domain method",
            "Publication year": 2000,
            "Publication url": "https://arch.neicon.ru/xmlui/handle/123456789/1828502",
            "Abstract": "A finite-difference time-domain method for light wave propagation through a liquid crystal cell containing a twisted/tilted deformation profile is presented. Our interest is focused on deformation profiles that correspond to the commonly encountered domain walls found in ferroelectric liquid crystal (FLC) devices. The mathematical formulation is based on Maxwell's equations, and, apart from the numerical discretization, no assumptions are made. This results in consistent treatment of all phenomena associated with light wave propagation within the FLC device. The transmitted optical intensity between arbitrarily placed polarizers is calculated for various combinations of the parameters involved. Comparison is also made between the obtained results and the outcome of the standard Berreman 4× 4 matrix method.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Institute of Physics Publishing"
        },
        {
            "Title": "Comparative Study of Silicon Photonic Modulators based on Transparent Conducting Oxide and Graphene",
            "Publication year": 2019,
            "Publication url": "https://journals.aps.org/prapplied/abstract/10.1103/PhysRevApplied.12.064023",
            "Abstract": "Transparent conducting oxides (TCOs) and graphene have been extensively investigated as promising materials for electro-optic modulation applications due to their dynamically configurable near-infrared properties. In this study, a detailed comparison between modulators comprising either a TCO film or a graphene-insulator-graphene structure is presented, considering a conventional silicon photonic waveguide as the underlying physical system. Both in-line and resonant configurations are investigated, integrating an electro-optic switching mechanism that changes the free-carrier concentration in the configurable material by means of electrical gating. The carrier-concentration change effect is rigorously modeled using solid-state physics principles, providing a physically consistent and straightforward comparison between the investigated material platforms. The performance of the designed modulators is …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:PVjk1bu6vJQC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "A comparative study of light scattering from liquid crystal droplets",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.10632",
            "Abstract": "Light scattering from electrically small nematic liquid crystal droplets is routinely studied by methods based on the Rayleigh–Gans (RG) approximation. The error introduced by the Rayleigh–Gans approximation is critically assessed for radial, bipolar, and aligned spherical droplets. Comparisons are made with respect to the prediction of the finite‐difference time‐domain (FDTD) method for the above droplet configurations. © 2002 Wiley Periodicals, Inc. Microwave Opt Technol Lett 35: 437–441, 2002; Published online in Wiley InterScience (www.interscience.wiley.com). DOI 10.1002/mop.10632",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Analysis of tunable photonic crystal directional couplers",
            "Publication year": 2006,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2335800",
            "Abstract": "Tunable directional coupler structures based on triangular photonic crystal lattices are investigated using the finite difference time domain method. The infiltration of nematic liquid crystal materials into the coupler waveguides allows for the control of its properties through the application of external static electric fields, which reorient the nematic director. Strong dynamical shifting of the dispersion curves, along with the decoupling frequencies and the coupling coefficient, is demonstrated. Such features render this class of couplers suitable for a range of applications. The coupling lengths accomplished are quite short even when the interaction region between the two coupler branches is widened. Furthermore, operation as a channel interleaver in wavelength division multiplexing systems is explored, and it is revealed that by proper selection of the geometrical parameters a constant channel separation of 0.8nm is …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:aqlVkmm33-oC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Long-range hybrid plasmonic disk resonators for mw bistability and self-pulsation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7362095/",
            "Abstract": "A side-coupled disk-waveguide system based on a long-range hybrid plasmonic waveguiding configuration is theoretically investigated for Kerr bistability and self-pulsation. The nonlinear response is studied with a theoretical framework combining perturbation theory and temporal coupled-mode theory, where all relevant effects, including two-photon absorption (TPA) as well as free-carrier dispersion (FCD) and absorption (FCA), are taken into account. We show that bistable operation with input powers as low as 40 mW is possible; a consequence of the significant reduction in resistive losses made possible by the long-range waveguiding principle. The effect of TPA, FCD, and FCA on the nonlinear response is thoroughly assessed and it is shown that carrier lifetime must drop to 8 ps in order to suppress free-carrier effects and obtain a high-quality bistable response, which is subsequently exploited for …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:evX43VCCuoAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Silicon-loaded surface plasmon polariton waveguides for nanosecond thermo-optical switching",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-39-8-2282",
            "Abstract": "A MHz-bandwidth thermo-optical (TO) plasmonic switch operating at telecommunication wavelengths and based on a hybrid solid-state silicon-loaded surface plasmon polariton waveguide design is demonstrated numerically. The nanosecond (ns) TO response of the switch is due to the high thermal conductivities of the employed materials and we demonstrate specifically a 10 dB extinction ratio in the time-dependent switch transmission which features a pulsed 1 ns rise time followed by a 25 ns fall time when the switch is photo-thermally activated by a ns pulse at 532 nm wavelength.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:vRqMK49ujn8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Microdisk resonator filters made of dielectric-loaded plasmonic waveguides",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401810003408",
            "Abstract": "Microdisk resonator filters, an alternative to microring resonator filters, are studied by means of vectorial three dimensional finite element method simulations. Their performance characteristics are highlighted for different microdisk radii, and compared with those of the respective, footprint-wise, microring filters. We show that microdisk filters are advantageous, as the resonator involved exhibits smaller radiation losses. Extinction ratios as high as 30 dB are possible by properly tuning the gap separating the waveguide from the microdisk in each case. Transmission dips due to higher-radial-order modes that drastically change the transmission picture appear only for very large microdisk radii.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:4DMP91E08xMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Silicon-photonic electro-optic phase modulators integrating transparent conducting oxides",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8401497/",
            "Abstract": "Higher-order digital modulation formats are demonstrated by electrically inducing free-carrier concentration changes in thin films of transparent conducting oxides, integrated into well-established silicon-photonic waveguiding architectures. The proposed near-infrared modulators employ as physical platforms the silicon-rib and silicon-slot waveguides, exploiting the highly dispersive and carrier-dependent epsilon-near-zero behavior of transparent conducting oxides to modulate the optical carrier. Advancing the existing studies on conventional amplitude modulation, phase-shift keying formats are investigated in this paper, using a rigorous and physically consistent modeling framework that seamlessly combines solid-state physics with Maxwell wave theory through carrier-dependent material models. The designed in-line modulators achieve Vπ L products in the order of 0.1 Vmm, two orders of magnitude lower than …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guided Wave Plasmonics",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FDTD analysis of photonic crystal defect layers filled with liquid crystals",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-005-1132-5",
            "Abstract": "Dielectric and metallic photonic crystals comprising nematic liquid crystal materials as defect layers or elements are investigated by the Finite Difference Time Domain (FDTD) method. Appropriate formulations of the FDTD algorithm, for the simulation of anisotropic and dispersive media as well as periodic geometries, are utilised and combined with the proper absorbing and periodic boundary conditions. The spectral properties of the presented structures are tuned by means of applying static electric fields across the defect layers, thus affecting the molecular orientation of the liquid crystal material. Numerical results show that sufficient tuning ranges are achieved, requiring low operating voltages. Moreover, high and sharp resonance peaks are observed.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:roLk4NBRz8UC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Polarization properties of liquid-crystal infiltrated photonic crystal fibers",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4598576/",
            "Abstract": "The polarization properties of photonic crystal fibers infiltrated by nematic liquid crystals are investigated for various structural and material parameters. It is demonstrated that by proper design single-polarization or controllable highly-birefringent light guidance can be achieved. In addition, such favourable polarization properties may also be dynamically tuned via the application of an external field or the variation of the operating temperature.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tunable one-dimensional photonic crystal slabs (Invited Paper)[6593-15]",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=313752093835755813&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:TFP_iSt0sucC",
            "Publisher": "International Society for Optical Engineering; 1999"
        },
        {
            "Title": "Optical properties and applications of ferroelectric and antiferroelectric liquid crystals",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guided-wave liquid-crystal photonics",
            "Publication year": 2012,
            "Publication url": "https://pubs.rsc.org/en/content/articlehtml/2012/lc/c2lc40514h",
            "Abstract": "In this paper we review the state of the art in the field of liquid-crystal tunable guided-wave photonic devices, a unique type of fill-once, molecular-level actuated, optofluidic systems. These have recently attracted significant research interest as potential candidates for low-cost, highly functional photonic elements. We cover a full range of structures, which span from micromachined liquid-crystal on silicon devices to periodic structures and liquid-crystal infiltrated photonic crystal fibers, with focus on key-applications for photonics. Various approaches on the control of the LC molecular orientation are assessed, including electro-, thermo- and all-optical switching. Special attention is paid to practical issues regarding liquid-crystal infiltration, molecular alignment and actuation, low-power operation, as well as their integrability in chip-scale or fiber-based devices.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:isC4tDSrTZIC",
            "Publisher": "Royal Society of Chemistry"
        },
        {
            "Title": "Optical behaviour of display performance enhancement films",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09500340108232464",
            "Abstract": "The optical properties of holographic display screen enhancement films are investigated. Experimental data show that the on-axis scattering from such films is significantly stronger than the off-axis scattering. The results are modelled using the beam propagation method in two dimensions. Good qualitative comparisons between experimental and theoretical results are obtained.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Electromagnetically induced transparency with hybrid silicon-plasmonic traveling-wave resonators",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4821796",
            "Abstract": "Spectral filtering and electromagnetically induced transparency (EIT) with hybrid silicon-plasmonic traveling-wave resonators are theoretically investigated. The rigorous three-dimensional vector finite element method simulations are complemented with temporal coupled mode theory. We show that ring and disk resonators with sub-micron radii can efficiently filter the lightwave with minimal insertion loss and high quality factors (Q). It is shown that disk resonators feature reduced radiation losses and are thus advantageous. They exhibit unloaded quality factors as high as 1000 in the telecom spectral range, resulting in all-pass filtering components with sharp resonances. By cascading two slightly detuned resonators and providing an additional route for resonator interaction (i.e., a second bus waveguide), a response reminiscent of EIT is observed. The EIT transmission peak can be shaped by means of resonator …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:XiSMed-E-HIC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Diffraction grating with suppressed zero order fabricated using dielectric forces",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-36-22-4404",
            "Abstract": "An electric-field-assisted method to produce diffractive optical devices is demonstrated. A uniform film of liquid UV curable resin was produced as a drying ring from an organic solvent. Dielectrophoresis forces maintained the stability of the thin film and also imprinted a periodic corrugation deformation of pitch 20?μm on the film surface. Continuous in situ voltage-controlled adjustment of the optical diffraction pattern was carried out simultaneously with UV curing. A fully cured solid phase grating was produced with the particular voltage-selected tailored optical property that the zero transmitted order was suppressed for laser light at 633?nm.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:IWHjjKOFINEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Accelerating FDTD simulations for eigenfrequency detection in EBG devices by means of the GPOF method",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4787467/",
            "Abstract": "In this paper, a technique introducing the generalized-pencil-of-function (GPOF) algorithm as a post processing procedure in the finite-difference time-domain (FDTD) method is presented to facilitate the study of electromagnetic bandgap (EBG) devices. Correction criteria are also developed to deal with erroneous eigenfrequencies associated with computational noise. The numerical results obtained are considered sufficiently accurate, while the potentials of this approach are thoroughly discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In-line polarization controller based on liquid-crystal photonic crystal fibers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5929481/",
            "Abstract": "Compact polarization control elements based on index-guiding soft-glass photonic crystal fibers infiltrated with nematic liquid crystals are proposed and thoroughly studied. The nematic director profiles at the fiber's cross section are consistently calculated by solving the coupled electrostatic and elastic problem, in the context of an analysis on the tunability of liquid-crystal-infiltrated photonic crystal fibers. The fiber's dispersive properties and light propagation in the proposed polarization controller are studied by means of a fully anisotropic finite-element-based beam propagation method. The electrically induced evolution of the state of polarization is mapped on the Poincaré sphere. Efficient polarization conversion is demonstrated, with a crosstalk of -50 dB, for a total device length of 4.65 mm and a maximum applied voltage of 150 V. Crosstalk values lower than -20 dB are achieved over a 30 nm window. The …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-power bistability in graphene-comprising 3D photonic resonant circuits",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5005610",
            "Abstract": "Practical graphene-comprising resonant structures are proposed for high-quality Kerr-induced bistability with a low input power. Two structures are designed for operation in the far-infrared (FIR) and near-infrared (NIR) frequency regimes, respectively. The nonlinear response is studied by utilizing a theoretical framework combining perturbation theory and coupled-mode theory, capable of accurately and efficiently modeling resonant structures with dispersive bulk and sheet materials. The FIR system is based on a side-coupled graphene-nanoribbon ring resonator, formed by applying a bias voltage between a uniform graphene sheet and an uneven silicon substrate. By optimizing the system geometry, we demonstrate bistable response with a theoretically infinite extinction ratio between states and an operating power of only 400 μW at 10 THz. In the NIR circuit, a silicon photonic ring resonator is overlaid with a …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:kuK5TVdYjLIC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "An ADE-FDTD formulation for the study of liquid-crystal components in the Terahertz spectrum",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15421406.2015.1087282",
            "Abstract": "An anisotropic auxiliary differential equation finite-difference time-domain formulation is presented in detail for the time-domain study of nematic liquid crystal devices in the terahertz spectrum. The termination of the computation domain is achieved by employing a properly designed convolution perfectly matched layer. The material dispersion and dichroism of the LC complex permittivities is modeled via a modified Lorentzian function that is demonstrated to provide an accurate description for a series of state-of-the-art materials used in LC-THz technology.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Breaking reciprocity in a non-Hermitian photonic coupler with saturable absorption",
            "Publication year": 2021,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.103.053503",
            "Abstract": "We study the breaking of reciprocity in non-Hermitian coupled photonic waveguides by the simultaneous action of the nonlinear effect of saturable absorption and the presence of exceptional points. The nonlinear response of such a system is studied in depth, giving physical insight into the operational principles and fundamental limitations while producing analytical and semianalytical results for the transmission and nonreciprocal intensity range. We numerically validate the theoretical results and assess important performance metrics for the nonreciprocal operation of such a device. This class of passive nonresonant devices can offer broadband on-chip nonreciprocal operation, with significant potential for high-speed applications.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:NXb4pA-qfm4C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Numerical Modeling of Optical Wave Propagation in Liquid Crystal Displays: Two Extreme Alternatives",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:rO6llkc54NcC",
            "Publisher": "Society for Information Display"
        },
        {
            "Title": "Dielectric loaded surface plasmon waveguides for datacom applications",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8424/842407/Dielectric-loaded-surface-plasmon-waveguides-for-datacom-applications/10.1117/12.921766.short",
            "Abstract": "We rst report on design, fabrication and characterizations of thermally-controlled plasmonic routers relying on the interference of a plasmonic and a photonic mode supported by wide enough dielectric loaded waveguides. We show that, by  owing a current through the gold lm on which the dielectric waveguides are deposited, the length of the beating created by the interference of the two modes can be controlled accurately. By operating such a plasmonic dual-mode interferometer switch, symmetric extinction ratio of 7dB are obtained at the output ports of a 2x2 router. Next, we demonstrate ber-to-ber characterizations of stand-alone dielectric loaded surface plasmon waveguide (DLSPPW) devices by using grating couplers. The couplers are comprised of dielectric loaded gratings with carefully chosen periods and duty-cycles close to 0.5. We show that insertion loss below 10dB per coupler can be achieved with …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Studies of photonic crystal structures infiltrated with liquid crystals",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6182/618213/Studies-of-photonic-crystal-structures-infiltrated-with-liquid-crystals/10.1117/12.668356.short",
            "Abstract": "This paper investigates the tunable characteristics of various photonic crystal structures infiltrated with nematic liquid crystals. A triangular lattice of air cylinders drilled into silicon provides the photonic crystal structure and the nematic material is inserted either in all or in properly selected air voids in order to create one-dimensional cavities or directional couplers. We have shown in previous studies that the spectral properties of such geometries can be tuned by means of applying appropriate static electric fields, which eventually determine the orientation of the liquid crystal molecules inside the cylindrical cavities. The essential aspect of the present study is to consider various profiles for the nematic director, which are associated with different molecular anchoring conditions at the confining surfaces, as well as electric fields of various strengths and orientation. In particular, we examine the cases of homeotropic or …",
            "Abstract entirety": 0,
            "Author pub id": "CUb8oGIAAAAJ:dhFuZR0502QC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Interfacing dielectric-loaded plasmonic and silicon photonic waveguides: theoretical analysis and experimental demonstration",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6164209/",
            "Abstract": "A comprehensive theoretical analysis of end-fire coupling between dielectric-loaded surface plasmon polariton and rib/wire silicon-on-insulator (SOI) waveguides is presented. Simulations are based on the 3-D vector finite element method. The geometrical parameters of the interface are varied in order to identify the ones leading to optimum performance, i.e., maximum coupling efficiency. Fabrication tolerances about the optimum parameter values are also assessed. In addition, the effect of a longitudinal metallic stripe gap on coupling efficiency is quantified, since such gaps have been observed in fabricated structures. Finally, theoretical results are compared against insertion loss measurements, carried out for two distinct sets of samples comprising rib and wire SOI waveguides, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical switching through graphene-induced exceptional points",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=josab-35-7-1525",
            "Abstract": "The switching properties of coupled nanophotonic waveguides under the influence of a loss-induced exceptional point are analytically and numerically investigated. The specific requirements for switching/routing functionality are determined, and an analytically predicted lower boundary for the insertion losses is established. These passive Parity-Time-Symmetric dynamics are substantiated in a silicon photonic coupler through the use of graphene layers. Graphene’s chemical potential is properly tuned, in accordance with the exceptional point requirements, for the electro-optic control of its surface conductivity. All analytically derived findings are numerically verified enabling linear, low-loss, and high-extinction-ratio switching elements. Finally, a polarization-dependent photonic switch is proposed based on both exceptional points and graphene’s anisotropic surface conductivity.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Liquid crystal-based dielectric loaded surface plasmon polariton optical switches",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3658247",
            "Abstract": "An optical switch based on liquid crystal dielectric loaded surface plasmon polariton waveguides is proposed and theoretically analyzed. The infiltration of the plasmonic structure with a nematic liquid crystalline material serving as the dielectric loading is shown to allow for extensive electrical tuning of its waveguiding characteristics. Both the electrical switching and optical properties of the proposed waveguide are investigated in the context of designing a directional coupler optical switch, which is found to combine efficient voltage control, low power consumption, high extinction ratio, and relatively low insertion losses.",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:8k81kl-MbHgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Multiplexed optical data storage",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1632758/",
            "Abstract": "The paper presents an overview of techniques designed to increase data storage density by putting more than a single bit of information into a single pit. The current solution differs from previous suggestions in that we do not require an improved signal-to-noise ratio to achieve higher data storage density. Instead we use a hitherto unutilised feature of light: its polarisation. Although the research is still very much ongoing the paper reports on the progress so far and summarises future development directions",
            "Abstract entirety": 1,
            "Author pub id": "CUb8oGIAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        }
    ]
}]