[{
    "name": " Θεόδωρος Λαόπουλος",
    "romanize name": " Theodoros Laopoulos",
    "School-Department": "Φυσικής",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 17535,
    "Scholar name": "Theodore Laopoulos",
    "Scholar id": "Kb2N6d4AAAAJ",
    "Affiliation": "Aristotle University of Thessaloniki, Greece",
    "Citedby": 993,
    "Interests": [
        "Instrumentation and Measurement Circuits Systems & Techniques"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Kb2N6d4AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Том. 4",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=3546441520474424504&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "State of art of the distributed measurement systems for industrial and educational purposes",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4062140/",
            "Abstract": "The large diffusion of the distributed measurement systems (DMS) aims to providing innovative solutions to different situations which appear for both industrial and educational applications. Consequently, advanced hardware platforms and innovative software architectures are demanded. In these situations, the development of novel approaches in software and hardware tools for DMS has fundamental importance. The paper provides an overview of the hardware and software architectures which are currently used to develop DMSs, focusing on advanced topics concerning the DMS management. In particular, the workload, the synchronization and the communication delay aspects are taken into account.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using neural network for the evaluation of power consumption of instructions execution",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4547122/",
            "Abstract": "In this work a method is being proposed for estimating the power consumption of digital processing systems by the use of neural networks. The case study is an ARM7TDMI processor. Real hardware data are already known for this processor and provided for neural network training. Many different attempts for training have been made, by combining different sets of training vectors to the neural network and initial results have been extracted. Results indicate that the proposed approach is good for power consumption estimation, and with a proper selection of training vectors, the neural network can provide results with increased accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction level energy modeling for pipelined processors",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39762-5_34",
            "Abstract": "A new method for creating instruction level energy models for pipelined processors is introduced. This method is based on measuring the instantaneous current drawn by the processor during the execution of the instructions. An appropriate instrumentation set up was established for this purpose. According to the proposed method the energy costs (base and inter-instruction costs) are modeled in relation to a reference instruction (e.g. NOP). These costs incorporate inter-cycle energy components, which cancel each other when they are summed to produce the energy consumption of a program resulting in estimates with high accuracy. This is confirmed by the results. Also the dependencies of the energy consumption on the instruction parameters (e.g. operands, addresses) are studied and modeled in an efficient way.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Energy consumption estimation in embedded systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4426072/",
            "Abstract": "This paper presents an energy consumption modeling technique for embedded systems based on a microcontroller. The software tasks that run on the embedded system are profiled, and their characteristics are analyzed. The type of executed assembly instructions, as well as the number of accesses to the memory and the analog-to-digital converter, is the required information for the derivation of the proposed model. An appropriate instrumentation setup has been developed for measuring and modeling the energy consumption in the corresponding digital circuits.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time-domain analysis of ARM7TDMI core instructions",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6072877/",
            "Abstract": "Correlation between time-domain of routine execution and obtained waveforms is analyzed. In this case CPU's internal activities, related to the instruction execution can be defined more explicitly. In such manner power consumption of the CPU may be separated from noises and external effects. Proposed approach has been used for analysis of some data-processing instructions of ARM7TDMI, in order to estimate power consumption accurately.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring the capabilities of web-based measurement systems for distance learning",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-30394-4_26",
            "Abstract": "The paper presents a brief state of art of distributed laboratories for teaching of electric and electronic measurement and proposes an innovative platform for distance learning in such field. The platform consists of a learning management system (LMS) and a remotely accessible distributed laboratory to carry out experiments on real instrumentation without requiring specific software components on client side. In particular, the user authentication and management and the tracking of learning process are provided by the LMS. The experimental phase is carried out by means of Virtual Instruments executed on computers connected to the instrumentation included in a remote laboratory system distributed on geographical scale.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Microcomputer Architecture: low-level programming methods and applications of the M68HC908GP32",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3ocmDwAAQBAJ&oi=fnd&pg=PA340&dq=info:sGtfJPsuhGAJ:scholar.google.com&ots=kPxqA9kHZY&sig=7x1COXUzfazFPBEVXMz3YKM6zZQ",
            "Abstract": "Through a long term research in education, the authors incorporate in this book all the information needed for an effective microcontroller-based tutoring system, which is particularly suitable for readers with insufficient background on hardware design issues. In addition, the book addresses a pedagogy that draws readers' attention to the parallelism between assembly-level programming for microcontrollers and higher-level programming (a particularly helpful guide for those who might have previous experience on high-level programming). The book provides a comprehensive guide on the subject of microcomputer architecture teaching and learning and it is designed for a variety of engineering disciplines, such as Electrical Engineering, Electronic Engineering, Automation Engineering, Computer Engineering, and all the engineering disciplines that have specific requirements for the design and development of microcontroller-based applications. Apart from the academic community, the book is designed to support self-study training, appropriate for professional engineers.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Self-publishing (Printed by Createspace)"
        },
        {
            "Title": "A graphical approach to estimation of gas concentration with SnO2 sensors",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=9128157337199565281&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aspects of traditional versus virtual laboratory for education in instrumentation and measurement",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1604343/",
            "Abstract": "Nowadays the multimedia tools have an important role in both the management of the lectures and the organization of the course program on instrumentation and measurement. In this new scenario, the virtual laboratory (VL) represents the environment in which the learning activities are performed. Starting from this observation, in the paper an overview of the state of the art of the VL-based education on instrumentation and measurement is given. The fundamental aspects concerning both the software and the hardware to design the VL are examined. Attention it is also devoted to innovative requirements and interesting open questions arising from the large diffusion of the VLs",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Arithmetic operations in assembly language: Educators' perspective on endianness learning using 8-bit microcontrollers",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5342909/",
            "Abstract": "Endianness concept is of great value for engineers who are employing microcontrollers in their applications. This paper presents a perspective on endianness learning using 8-bit microcontroller units (MCUs). The authors propose a practicable approach on assembly language arithmetic techniques, addressed to aid students in exploring big and little-endian ordering for handling memory storage. The proposed approach associates the study of endianness representation with a regular challenge in 8-bit microcontroller education, that is, the assembly-level arithmetic techniques for numbers extending one-byte range. The educational objective intended to be reached in this communication is to provide to the students a better understanding of the processor's workings at the machine level, and help them in exploiting byte ordering towards to an optimum performance of a low-level system implementation.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An automated measurement bench for vibration-based energy harvesting systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6662631/",
            "Abstract": "A measurement bench has been developed to fully automate the procedure for the characterization of a vibration-based energy scavenging system. The measurement system is capable of monitoring all important characteristics of a vibration harvesting system (input and output voltage, current, and other parameters, frequency and acceleration values, etc). It is composed of a PC, typical digital measuring instruments (oscilloscope, waveform generator, etc), certain sensors and actuators, along with a microcontroller based automation module. The automation of the procedure and the manipulation of the acquired data are performed by LabVIEW software. Typical measurements of a system consisting of a vibrating source, a vibration transducer and an active rectifier are presented.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vibration-based Energy Harvesting Systems Characterization Using Automated Electronic Equipment",
            "Publication year": 2015,
            "Publication url": "https://www.sensorsportal.com/HTML/DIGEST/april_2015/Vol_187/P_2648.pdf",
            "Abstract": "A measurement bench has been developed to fully automate the procedure for the characterization of a vibration-based energy scavenging system. The measurement system is capable of monitoring all important characteristics of a vibration harvesting system (input and output voltage, current, and other parameters, frequency and acceleration values, etc.). It is composed of a PC, typical digital measuring instruments (oscilloscope, waveform generator, etc.), certain sensors and actuators, along with a microcontroller based automation module. The automation of the procedure and the manipulation of the acquired data are performed by LabVIEW software. Typical measurements of a system consisting of a vibrating source, a vibration transducer and an active rectifier are presented. Copyright© 2015 IFSA Publishing, SL",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic algorithm transform of wavelet packet decomposition structure in audio coders",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Vladimir-Golovko-5/publication/266042933_Dynamic_algorithm_transform_of_wavelet_packet_decomposition_structure_in_audio_coders/links/54b4bc5c0cf2318f0f96e1ba/Dynamic-algorithm-transform-of-wavelet-packet-decomposition-structure-in-audio-coders.pdf",
            "Abstract": "The dynamic algorithm transform of wavelet packet (WP) decomposition on each frame of audio is presented. The WP decomposition structure is signal adaptive, and the analysis filters are time invariant and are obtained from the family of Daubechies wavelets. The objective of the tree transformation process, therefore, is to construct a minimum cost subband decomposition by maximizing the minimum masking threshold in wavelet domain in every subband. For audio coding, as an example, a complexity-constrained tree transformation procedure is shown to yield a basis requiring the fewest bits for perceptually transparent coding for a given embedded processor architecture and temporal resolution.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurements analysis of the software-related power consumption in microprocessors",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1315991/",
            "Abstract": "In this paper the measurements taken for the development of instruction-level energy models for microprocessors are presented and analyzed. An appropriate measuring environment and a suitable measuring methodology were developed for taking the necessary measurements. The energy of an instruction is defined as a sum of three components, which are the pure base energy cost, the interinstruction cost, and the effect of the energy-sensitive factors (instruction parameters). These components are characterized for each instruction of the ARM7TDMI embedded processor, and their values are analyzed. Using the resulting models, estimates of the energy consumption of real software kernels with up to only 6% error were determined.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ethernet and PC‐based experiments on barometric altimetry using MEMS in a wireless sensor network",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cae.21722",
            "Abstract": "This paper presents a training framework that applies to Micro‐Electro‐Mechanical‐Systems (MEMS) technology. Recommendations are in line with a prototype educational platform along with an innovative set of experiments for a creative training on barometric altimetry. The proposed platform relies on a wireless sensor network system of Ethernet as well as PC‐based (i.e., LabVIEW) user interface for ambient air pressure acquisition. The web user interface renders feasible the implementation of a single setup per class, while also minimizes students' occupation on software and hardware configuration activities; hence, students are concentrated on the problem solving process. The LabVIEW controlled interface advocates tutor‐demonstration by means of real‐time graphical monitoring of the measurement procedure. The wireless system feature provides flexibility in experimentation, allowing the examination of …",
            "Abstract entirety": 0,
            "Author pub id": "Kb2N6d4AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Earthquake instrumentation node with MEMS sensors",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956265/",
            "Abstract": "Earthquake monitoring has always been a vital application for human safety. This work proposes an implementation of an instrumentation node for earthquake monitoring that combines the recent advances in portable instrumentation systems (e.g. IoTs), along with the latest development in MEMS sensors. The focus is on creating a measuring node optimal for such a case study, meaning high accuracy measurements, smart and adaptive functionality and minimal energy consumption.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developing an environment for embedded software energy estimation",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548905000188",
            "Abstract": "The paper presents the results of a novel method for the instruction-level energy consumption measurement and the corresponding modeling approach for embedded microprocessors. According to the proposed method the base and inter-instruction energy costs of the ARM7TDMI embedded processor as well as the energy cost due to different values in the instruction parameters are modeled. These models can be used in the estimation of the energy consumed by the processor to execute real software programs. A software tool has been developed to automate energy estimation.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:-f6ydRqryjwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Measurement of power consumption in digital systems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1703914/",
            "Abstract": "A study on different measurement configurations for the estimation of power consumption of processing systems is presented. The problem addressed is to measure the energy consumed by a digital system during a number of clock cycles and to assign this consumption to a specific group of instructions. This kind of energy measurement provides the information needed for determining the energy consumption of specific software routines that run on digital processing systems. The proposed configuration is expected to provide clear information about the power behavior of single-chip processing systems as it may monitor the energy consumption during different tasks of operation. Furthermore, it may be integrated in the same chip as a peripheral unit that may be turned on periodically as the front-end circuit of an accurate built-in self-test configuration",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Technique of learning rate estimation for efficient training of MLP",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/857856/",
            "Abstract": "A new computational technique for training of multilayer feedforward neural networks with sigmoid activation function of the units is proposed. The proposed algorithm consists two phases. The first phase is an adaptive training step calculation, which implements the steepest descent method in the weight space. The second phase is estimation of calculated training step rate, which reaches a state of activity of the units for each training iteration. The simulation results are provided for the test example to demonstrate the efficiency of the proposed method, which solves the problem of training step choice in multilayer perceptrons.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Training of MLP with Training Step Rate Estimation",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7908-1844-4_4",
            "Abstract": "A new computational technique for training of multilayer feed-forward neural networks with sigmoid activation function of the units is proposed. The proposed algorithm consists two phases. The first phase is an adaptive training step calculation, which implements the steepest descent method in the weight space. The second phase is estimation of calculated training step rate, which provide reach a state of activity of the units on the each training iteration. The simulation results are provided for the test example to demonstrate the efficiency of the proposed method, which solves the problem of training step choice in multilayer perceptrons.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Physica, Heidelberg"
        },
        {
            "Title": "ACCURATE DISPLACEMENT MEASUREMENT BASED ON THE FREQUENCY VARIATION MONITORING OF ULTRASONIC SIGNALS",
            "Publication year": 2003,
            "Publication url": "https://www.imeko.org/publications/wc-2003/PWC-2003-TC14-020.pdf",
            "Abstract": "This paper introduces a different approach to the measurement of the time-of-flight of ultrasonic signals. Frequency variation monitoring and recording is used to determine accurately the arrival time of the ultrasonic signal. A high speed Digital Signal Processor (DSP) is used for both: transmission and direct measurement of the frequency of the incoming signal in every single period and with an accuracy of about 0.1%. The proposed configuration offers small size and low cost solution to displacement measurements with a remarkable performance in terms of accuracy, range and measurement time.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unsupervised learning for dimensionality reduction",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=11194777753874203489&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurement of Power Consumption in Wireless Zigbee Network Nodes",
            "Publication year": 2010,
            "Publication url": "https://www.imeko.org/publications/tc4-2010/IMEKO-TC4-2010-031.pdf",
            "Abstract": "The results of the implementation of a novel measurement technique in monitoring variations of power consumption in wireless sensors network nodes which operate under the ZigBee protocol are presented in this work. A simple wireless ZIGBEE network consisting of three nodes (one sample from each of the typical node types) is measured with the proposed energy measuring configuration. The measurements are performed during the switch-on or switch-off operation of the nodes and the resulting waveforms provide useful information about the energy consumption of each node type, in each phase operation or “handshaking”.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Comparative Study on Methods for Improved Tracking of Mechanical Movements of IPMC Actuators",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=F7yzfrJtwKgC&oi=fnd&pg=PA101&dq=info:i5_2vC142tsJ:scholar.google.com&ots=wqBrMuIEHE&sig=3HfaW30BtHON1T8LU35apzyNb3o",
            "Abstract": "A comparison of three different methods for end-edge detection of the IPMC actuator as it moves is presented in this chapter, using image analysis captured by a CCD camera. The degrees of freedom for actuator move are specific and experiments were realized in underwater conditions when one end-edge is fixed-clapped and the other is free. The tracking techniques of free edge are based on three different approaches while the two recent of these use the new technology of Graphical Processing Units (GPUs) to reduce more the processing time. The results show that the new techniques increased by 47 and 70 times the speed of detection. Comparing the two last methods it can be concluded that they offer satisfactory reduced processing time for the speed of material which can be measured to values up to 10 KHz theoretically. The second improved method uses more calculations regarding position estimation and is slower if material bends out of the way track. The last approach is slower than second because is implemented in the entire area but handles better the bigger bending of the material within shorter execution times. A prerequisite for high speed measurements is the adequate support of the frame rate of camera.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:7PzlFSSx8tAC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "A prototype wireless sensor network system for a comparative evaluation of differential and absolute barometric altimetry",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7374067/",
            "Abstract": "This article presents data analysis derived from a prototype wireless sensor network system, which was developed to evaluate the influence of barometric pressure variations on height measurements. Data analysis explores height accuracy of differential barometric altimetry compared with the absolute barometric altimetry approach. In the former case, two equivalent and custom-made altimeters are synchronized for the simultaneous acquisition of atmospheric pressure with 300 ms sampling interval. In the latter case, height is determined using the same pressure data obtained from the rover-in the system-altimeter. As regards differential barometric altimetry, the authors address a simple setup in order to explore sensors' output deviation under the same conditions (i.e., pressure, temperature, etc.), as well as evaluate the subsequent effect on height measurement error. The experimental setup exploits the wireless …",
            "Abstract entirety": 0,
            "Author pub id": "Kb2N6d4AAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A reconfigurable storage unit for autonomously powered IoT nodes",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956272/",
            "Abstract": "A self-adaptive supercapacitor scheme, suitable for energy harvesting applications is presented in this work. The structure is comprised of two supercapacitors, a small one and a larger one, four switches and the control unit. The critical parameters for the system's reconfiguration is the small supercapacitor's voltage level and the sufficient supply of the load. The system's design was carried out in 0.18um CMOS technology. This highly efficient architecture provides a fast supply of the load and output voltage pre-regulation.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Model reference adaptive control for an ionic polymer metal composite in underwater applications",
            "Publication year": 2008,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0964-1726/17/4/045020/meta",
            "Abstract": "Ionic polymer metal composite (IPMC) materials are in an early stage of development. Their response as actuators is still very unpredictable. Their dynamic response is still subjected to several critical parameters that vary with time, thus extracting an accurate and repeatable model is very difficult. This paper presents the design and implementation of an adaptive efficient position control system for an IPMC actuator working in underwater conditions. The control system is an model reference adaptive control (MRAC) based on a reference model and an adaptation that controls a 1 cm× 0.5 cm length IPMC strip based on a Nafion 117 Na+ membrane. As the reference model a second-order empirical model of the plant is used. The control system is first simulated and then experimentally implemented within the LabVIEW framework.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:qjMakFHDy7sC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Documenting knowledge to the undergraduate education of professional engineers: a case study in microcontroller education",
            "Publication year": 2012,
            "Publication url": "https://www.sefi.be/wp-content/uploads/2017/10/058-sum.pdf",
            "Abstract": "058 Documenting Knowledge to the Undergraduate Education of Professional Engineers: A \nCase Study in Microcontroller Education Page 1 23-26 September 2012 Thessaloniki, Greece \nPhysics and Engineering Education 40th annual conference 058 1 DE Bolanakis, \ndbolanis@cc.uoi.gr Documenting Knowledge to the Undergraduate Education of Professional \nEngineers: A Case Study in Microcontroller Education DE Bolanakis1 PhD Student Dept. of \nPrimary Education, University of Ioannina Ioannina, Greece dbolanis@cc.uoi.gr E. Glavas \nProfessor Dept. of Informatics & Telecommunications, Epirus Educational Inst. of Technology \nArta, Greece eglavas@teiep.gr GA Evangelakis Professor Dept. of Physics, University of Ioannina \nIoannina, Greece gevagel@cc.uoi.gr KT Kotsis Professor Dept. of Primary Education, University \nof Ioannina Ioannina, Greece kkotsis@cc.uoi.gr T. Laopoulos Associate Professor Dept. of , , .…",
            "Abstract entirety": 0,
            "Author pub id": "Kb2N6d4AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-Calibration of Ultrasonic Transducers in an Intelligent Data Acquisition System",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Christos-Papageorgiou-4/publication/4045719_Self-calibration_of_ultrasonic_transducers_in_an_intelligent_data_acquisition_system/links/00b49522797f11bf19000000/Self-calibration-of-ultrasonic-transducers-in-an-intelligent-data-acquisition-system.pdf",
            "Abstract": "The rapid growth of powerful single-chip microcomputers for monitoring and data acquisition applications permits nowadays the design of advanced measuring systems. The work reported here is presenting an advanced on-line monitoring configuration in order to improve the performance and extend the lifetime of ultrasonic transducers by applying an automated testing and calibration technique. The operation of this instrumentation system is based on the fast measurement of frequency and amplitude, performed by the proposed configuration. The combination of this information with the time of flight of each pulse-train is then used to derive practically all characteristics of ultrasonic transducers. Due to its low cost and small size, the system can be used either for characterization and classification of transducers, or as a self-testing and automated calibration section within any high performance ultrasonic system.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurement of current variations for the estimation of software-related power consumption [embedded processing circuits]",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232369/",
            "Abstract": "A current measurement configuration for the estimation of the power consumption of processing systems is presented in this work. The problem addressed is to measure the variations of the power supply current of digital circuits (and especially of embedded processing circuits) and to calculate from these measurements the energy consumption variations associated with certain tasks performed by the system software. Accurate monitoring of the instantaneous variations of the power supply current provides the appropriate information for the estimation of the power consumption at different operating situations of the processor (core) and of the overall processing system, as well (consumption of peripheral units). The proposed instantaneous current measuring approach, along with the execution of special test programs for analysis of inter-instruction effects, is expected to provide clear information of the power …",
            "Abstract entirety": 0,
            "Author pub id": "Kb2N6d4AAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction level energy modeling for pipelined processors",
            "Publication year": 2005,
            "Publication url": "https://content.iospress.com/articles/journal-of-embedded-computing/jec00035",
            "Abstract": "A new method for creating instruction level energy models for pipelined processors is introduced. This method is based on measuring the instantaneous current drawn by the processor during the execution of the instructions. An appropriate instrumentation set up was established for this purpose. According to the proposed method the energy costs (base and inter-instruction costs) are modeled in relation to a reference instruction (eg NOP). These costs incorporate inter-cycle energy components, which cancel each other when they are summed to produce the energy consumption of a program resulting in estimates with high accuracy. This is confirmed by the results. Also the dependencies of the energy consumption on the instruction parameters (eg operands, addresses) are studied and modeled in an efficient way.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:IjCSPb-OGe4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Self-calibration of ultrasonic transducers in an intelligent data acquisition system",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1249504/",
            "Abstract": "The rapid growth of powerful single-chip microcomputers for monitoring and data acquisition applications permits nowadays the design of advanced measuring systems. We present an advanced on-line monitoring configuration in order to improve the performance and extend the lifetime of ultrasonic transducers by applying an automated testing and calibration technique. The operation of this instrumentation system is based on the fast measurement of frequency and amplitude, performed by the proposed configuration. The combination of this information with the time of flight of each pulse-train is then used to derive practically all characteristics of ultrasonic transducers. Due to its low cost and small size, the system can be used either for characterization and classification of transducers, or as a self-testing and automated calibration section within any high performance ultrasonic system",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fixed-point arithmetic for a microcomputer architecture course",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Dimosthenis-Bolanakis/publication/299487918_Fixed-point_Arithmetic_for_a_Microcomputer_Architecture_Course/links/5734d8c108ae298602def4cf/Fixed-point-Arithmetic-for-a-Microcomputer-Architecture-Course.pdf",
            "Abstract": "This paper raises the point of employing solid fundamental knowledge within professional courses. Considering a case study in microcomputer architecture education, the authors address fixed-point arithmetic for the teaching of numerical operations in small microcontroller units (MCUs). A concentrated training framework is proposed, attempting to enhance traditional tutoring methods on 8-bit MCUs number representation and arithmetic.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis and design of a chopped current mode instrumentation amplifier",
            "Publication year": 2013,
            "Publication url": "http://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-c3a77cdd-92c3-44c2-8fd6-bffd0221dc32",
            "Abstract": "This paper presents the design of a chopper stabilized current mode instrumentation amplifier and analyzes the performance limitations imposed by chopping technique in detail. The amplifier targets to be the read out circuitry of a high precision temperature sensor. Since the required bandwidth in this kind of applications is very low, nested chopping technique is used to provide continuous offset reduction and eliminate 1/f noise. The amplifier is designed in 0.18 μm CMOS process. The resulting input referred noise is 20nV/",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching concepts in microcontroller education: CISC vs RISC assembly-level programming",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=2956608784161492263&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-speed FPGA implementation of the SHA-1 Hash function",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4062123/",
            "Abstract": "The main applications of the Hash functions lie in the fields of communication integrity and authentication. In every communication protocol, especially in mobile protocols, a Hash function is employed in the security layer. However, as communication protocols evolve and new high-performance applications appear, the throughput of hash functions seems to reach to a limit. Especially the SHA-1 Hash function, which is common in the majority of the wireless protocols (WAP etc.), was limited to a maximum throughput of 2 Gbps. In this paper, a new implementation is introduced to exceed this limit improving the throughput by 37% without significant area penalty.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic instructor set computer architecture of wavelet packet processor for real-time audio signal compression systems",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=17370429937910147623&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving sensitivity and selectivity of SnO< sub> 2</sub> gas sensors by temperature variation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1583857/",
            "Abstract": "A microcontroller-based gas-sensing system is presented in this paper. The analysis presented here exploits the differences in the steady-state performance of SnO/sub 2/ gas sensors at different operating temperatures and the potential use of such differences for improving their selectivity and sensitivity. Sets of experimental measurements of sensitivity versus temperature are used for the detailed presentation of the proposed approach. The results indicate that selective identification and rather accurate measurement of a mixture of CH/sub 4/ and CO gases are quite possible. Finally, a microcontroller-based configuration is presented as a working example of a small-size implementation, which may offer measurements of improved sensitivity and selectivity along with high accuracy and reliability.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Switching from computer to microcomputer architecture education",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03043790903312162",
            "Abstract": "In the last decades, the technological and scientific evolution of the computing discipline has been widely affecting research in software engineering education, which nowadays advocates more enlightened and liberal ideas. This article reviews cross-disciplinary research on a computer architecture class in consideration of its switching to microcomputer architecture. The authors present their strategies towards a successful crossing of boundaries between engineering disciplines. This communication aims at providing a different aspect on professional courses that are, nowadays, addressed at the expense of traditional courses.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Sensor errors prediction using neural networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/860811/",
            "Abstract": "The features of neural networks used for increasing the accuracy of physical quantity measurement are considered by prediction of sensor drift. The technique of data volume increasing for predicting neural network training is offered at the expense of various data types replacement for neural network training and at the expense of the separate approximating neural network use.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Temperature influence on differential barometric altitude measurements",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7340711/",
            "Abstract": "This paper evaluates the temperature influence on differential barometric altimetry, from data acquired by a prototype vertical direction measurement system. The system obtains atmospheric pressure data from two identical MEMS sensors so as to determine the absolute height difference in-between sensor devices. Matlab analysis determines indoor height accuracy in reference to calculations performed by a) the international barometric formula which is independent of temperature measurements and b) the hypsometric equation that depends on a constant temperature value in-between measurement devices; thereby, illustrating an isothermal atmosphere.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the evaluation of contemporary commercial barometric pressure sensors for altitude measurements",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8095123/",
            "Abstract": "MEMS barometers are often addressed for vertical position detection in navigation systems because of the relatively high accuracy of measurement. This paper presents results of the assessment of two (contemporary) commercial barometric pressure sensors in indoor and outdoor (barometric) altitude measurements. A comparison of the acquired pressure data derived simultaneously from two pairs of sensors of different MEMS vendors (employed in a prototype system) is addressed.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Features of intelligent distributed sensor network higher level development",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/846881/",
            "Abstract": "The functions and software structure of the higher level of intelligent distributed sensor network (IDSN) are considered. The main purpose of software functions is reaching high accuracy of the data acquisition and processing using neural networks. The proposed client-server software architecture provides effective use of computing resources of the IDSN central computer.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent Node for Sensor Signal Processing",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=17167106418556089718&hl=en&oi=scholarr",
            "Abstract": "The structure and functions of Intelligent Node, which provides sensor signals processing into Distributed Sensor Network, are considered in this paper. There is proposed to include additional Neurocontroller into Intelligent Node structure for increasing of its productivity. The hardware and software of low cost Neurocontroller and experimental results about its productivity at calculation of single layer and multi layer perceptron models are considered.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A camera based method for the measurement of motion parameters of IPMC actuators",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4967949/",
            "Abstract": "A visual measurement technique that is specifically developed to monitor the movements of ionic polymer metal composite (IPMC) materials in underwater conditions is presented. The proposed method is based on the extraction of appropriate information about the movement of an IPMC strip from subsequent picture frames. Since the time difference between these pictures is known, the system calculates both the displacement and the speed of the moving part. The processing algorithm implements a fully automated procedure for the localization of the point of interest (i.e., the edge of a microrobotic wing) and calculates the distance (displacement) between subsequent frames. This method is particularly useful for rather large and slow movements of the IPMC strips, as found in underwater microrobotic applications. The experimental results are compared with concurrent reference measurements by a high-accuracy …",
            "Abstract entirety": 0,
            "Author pub id": "Kb2N6d4AAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instrumentation set-up for instruction level power modeling",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45716-X_8",
            "Abstract": "Energy constraints form an important part of the design specification for processors running embedded applications. For estimating energy dissipation early at the design cycle, accurate power consumption models characterized for the processor are essential. A methodology and the corresponding instrumentation setup for taking current measurements to create high quality instruction level power models, are discussed in this paper. The instantaneous current drawn by the processor is monitored at each clock cycle. A high performance instrumentation setup has been established for the accurate measurement of the processor current, which is based on a current sensing circuit, instead of the conventional solution of a series resistor.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An improved tracking technique for visual measurements of ionic polymer–metal composites (IPMC) actuators using Compute Unified Device Architecture (CUDA)",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/22/11/114006/meta",
            "Abstract": "The implementation of a real-time measurement system based on visual measurements of displacement of an actuator–cantilever is presented in this paper. This work is aimed at accelerating image processing for the fast tracking of small actuators based on ionic polymer–metal composites using the graphics processing unit (GPU) approach. The proposed processing techniques for point tracking are based on the analysis of subsequent images of the moving item. The area-segmentation approach is used which combines region prediction, successive scanning, edge filtering and match processing. The overall implementation uses the CPU and GPU, while the results achieved indicate that the computation process speeds up by more than 40×. This is a quite useful improvement especially for real-time measurement and control applications of closed-loop systems based on IPMC materials.",
            "Abstract entirety": 1,
            "Author pub id": "Kb2N6d4AAAAJ:aqlVkmm33-oC",
            "Publisher": "IOP Publishing"
        }
    ]
}]