[{
    "name": " Κωνσταντίνος Μπάλας",
    "romanize name": " Konstantinos Balas",
    "School-Department": "Ηλεκτρονικών Μηχ και Μηχ Υπολογιστών",
    "University": "tuc",
    "Rank": "Καθηγητής",
    "Apella_id": 19456,
    "Scholar name": "Costas Balas",
    "Scholar id": "NkVkf9QAAAAJ",
    "Affiliation": "School of Electrical and Computer Engineering-Technical University of Crete",
    "Citedby": 1847,
    "Interests": [
        "Biophotonics and Hyperspectral Imaging"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=NkVkf9QAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The potential of spectral imaging in the noninvasive diagnostics of tissue cancers and precancers",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5123/0000/The-potential-of-spectral-imaging-in-the-noninvasive-diagnostics-of/10.1117/12.517034.short",
            "Abstract": "A novel approach to the problem of non-invasive diagnostics is presented, which relay son a combiend optical and chemical excitation of the tissue, by employing white light and topical application of acetic acid solution, respecitvley. Acetic acid-tissue interaction results in a transient alteration in the light scattering properties of the abnormal tissue selectivity. A specially developed Spectral Imaging system was used for the in vivo spectral imaging and analysis of the tissue and for the measurement, as a function of both time and location, of the acetic acid-induced alterations in the tissue scattering properties. Modeling and fitting of the experimental data result in the calculation of the kinetic constants of the marker-tissue interaction process, and spatil distribution of whcih is visualized with the aid of a pseudocolor scale. Clinical evaluation of both methodology and technology in normal, precancerous and cancerous …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:4TOpqqG69KYC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A novel hyper-spectral imaging system: Application on in-vivo detection and grading of cervical precancers and of pigmented skin lesions",
            "Publication year": 2001,
            "Publication url": "https://www.ics.forth.gr/cvrl/publications/conferences/2001_12_cvbvs01_balas_hyperspectral.pdf",
            "Abstract": "We present a novel Hyper-Spectral Imaging (HySI) System capable of acquiring and real time displaying of 5nm specrtal images, with 2nm tuning step, in the range of 400nm-1000nm. Synchronized spectral scanning and image storing enables the collection of a stack of calibrated spectral images, from which a fully resolved spectrum per image pixel can be calculated and displayed. We also present results from a pilot use of the developed HySI system as a research tool, in an attempt to develop novel, non-invasive diagnostic methods for the detection and grading of cervical precancers and of pigmented skin lesions. In the case of cervical diagnosis we have succeeded to detect in vivo, quantitatively assess and map alterations in tissue structure and functionality, associated with progress of the disease, with high sensitivity and specificity. In the case of pigmented skin areas, near infrared spectral analysis and imaging of melanin-rich spots show that they become transparent at certain imaging wavelengths and that the transparency wavelength increases with the melanin content and the lesion’s depth. This information can be used for the in vivo quantitative assessment of the later, which is considered to be of great diagnostic and predictive value.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectral Hyper-Vision as an Emerging Imaging Modality in Clinical Research and Management of Caries: 143",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=12194454167007110145&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "In vivo, early detection, quantitative grading and mapping of cervical cancers and precancers based on the dynamic spectral imaging and analysis of the acetic acid-induced alterations in the tissue light scattering properties.",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=BIO-2002-TuA5",
            "Abstract": "An imaging diagnostic method relaying on the measurement of the acetic acid-induced alterations in the scattering properties of cervix is presented. Clinical tests show that the alteration kinetics is correlated with the neoplasia grade.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:HDshCWvjkbEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "In vivo fluorescence kinetics and photodynamic therapy efficacy of d-aminolevulinic acid-induced porphyrins in basal cell carcinomas and actinic keratoses; implications for optimization of photodynamic therapy",
            "Publication year": 2000,
            "Publication url": "https://www.jle.com/en/revues/ejd/e-docs/in_vivo_fluorescence_kinetics_and_photodynamic_therapy_efficacy_of_d_aminolevulinic_acid_induced_porphyrins_in_basal_cell_carcinomas_and_actinic_keratoses_implications_for_optimization_of_photodynamic_therapy_100900/article.phtml?cle_doc=00018A24&fichier=images.htm",
            "Abstract": "Photodynamic therapy (PDT) with topical d-aminolevulinic acid (ALA) has become a therapeutic option of growing interest for superficial non-melanoma precancerous and malignant lesions. After application of ALA, in situ conversion to endogenous porphyrins is accomplished in a gradual manner. Therefore, the determination of fluorescence kinetics and spatial distribution in vivo versus time is a crucial point for the success of ALA-PDT. Seventeen basal cell carcinomas (BCC) and 20 actinic keratoses (AK) were enrolled in this study. In 5 BCC and 4 AK, in vivo fluorescence kinetics were performed over 24 hrs and for the remaining lesions between 2 and 7 hrs after ALA application. In vivo spatial and quantitative detection of the fluorescence intensity versus time showed considerable variations among tumors of the same type, so light irradiation was performed according to patient individualities. Both BCC and AK …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wavelet and physical parametric analysis of the acetowhitening optical effect: comparative evaluation of performances in non-invasive diagnosis of cervical neoplasia",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687609/",
            "Abstract": "The quantitative assessment of the dynamic scattering characteristics associated with the Aceto-Whitening (AW) effect provides a powerful tool for the in vivo detection, grading and mapping of cervical neoplasia. In this study we perform wavelet analysis of the in vivo measured Intensity of the Backscattered Light (IBSL) vs. time curve with the purpose of improving the diagnostic performance of the method. The performance of the Wavelet analysis is comparatively evaluated with the classification performed with the aid of the area under the IBSL vs. time curve parameter (BS-AUC). A total of 371 Intensity of the Back Scattered Light (IBSL) vs. time curves corresponding to 73 tissue points obtained from 64 patients, that have been subsequently biopsied were used for developing and for evaluating the performance of the method. The data set included cases with No Evidence for Disease (NED), Inflammation, HPV …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi/hyper-spectral imaging",
            "Publication year": 2016,
            "Publication url": "https://www.taylorfrancis.com/chapters/multi-hyper-spectral-imaging-costas-balas-christos-pappas-george-epitropou/e/10.1201/b10951-11",
            "Abstract": "Biomedical optics holds tremendous promise to deliver effective, safe, non-or minimally invasive diagnostics and targeted, customizable therapeutics. Handbook of Biomedical Optics provides an in-depth treatment of the field, including coverage of applications for biomedical research, diagnosis, and therapy. It introduces the theory and fundamental",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:5nxA0vEk-isC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Laser induced breakdown spectroscopy and hyper-spectral imaging analysis of pigments on an illuminated manuscript",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0584854701003020",
            "Abstract": "Laser induced breakdown spectroscopy (LIBS) was used for the first time in the in-situ identification of pigments in an illuminated manuscript dated from the 12th-13th century ad. Spectral data are presented from the analysis performed on the illumination of an initial letter ‘T’ and on the gold paint used in several parts of the writing. Identification of most pigments, in a nearly non-destructive way, was achieved. In parallel to LIBS, hyper-spectral imaging analysis was performed, which enabled the mapping of the pigments’ spatial distribution on the basis of their characteristic, visible and near infrared absorption spectral features. The identification of the red pigment based on hyper-spectral imaging analysis is demonstrated. Identification of pigments and inks is of great importance for the dating and systematic characterization of illuminated manuscripts and, as shown in this work, a combined analytical approach can …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Dynamic spectral imaging: improving colposcopy",
            "Publication year": 2009,
            "Publication url": "https://clincancerres.aacrjournals.org/content/15/5/1814.short",
            "Abstract": "Purpose: Colposcopy occupies a key role in the prevention of cervical cancer by identifying preinvasive or invasive lesions. However, colposcopy is subjective and is responsible for 52% of screening failures. Dynamic spectral imaging (DSI) is based on the objective, quantitative assessment of the acetowhitening effect. This study compared DSI with colposcopy.Experimental Design: Women referred for colposcopy were examined simultaneously with colposcopy and DSI using a precommercial DySIS model (FPC-03) in an international, multicenter trial. The colposcopy impression and DySIS values were compared with consensus histology reports of biopsies. Subjects were recruited to a training group and subsequently to a test group. Measures were taken to avoid verification bias.Results: The training and test groups comprised 82 and 308 eligible women, respectively. A cutoff value to identify high-grade disease …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:Y0pCki6q_DkC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Estimation of neoplasia-related biological parameters through modeling and sensitivity analysis of optical molecular imaging data",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6374656/",
            "Abstract": "We combine system's biology approaches with in vivo optical molecular imaging of epithelial neoplasia for estimating disease-specific biological parameters. Molecular imaging measures and maps the dynamic optical effects, generated by the topical application of acetic acid diluted solution. The dynamic characteristics of the in vivo measured optical signal are governed by the epithelial transport effects of the biomarker. Nine biological parameters, both structural and functional, have been identified to be potentially correlated with the neoplasia growth and to be manifested to the measured data in a convoluted manner. A compartmental model of the cervical neoplastic epithelium has been developed, which predicts the dynamic optical effects in all possible parameter value combinations. We have performed global sensitivity analysis for the purpose of identifying the subset of the input parameters that are the key …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high-performance image registration technique and application to multispectral imaging for medical diagnosis",
            "Publication year": 2002,
            "Publication url": "https://www3.icsd.aegean.gr/karybali/cr1036.pdf",
            "Abstract": "In many applications the image registration task is a fundamental prerequisite for any further processing and analysis. In the proposed paper a new efficient technique is presented, appropriate for registering images, which are translated and rotated versions of a reference image. The technique consists of two main parts: an efficiently implemented prewhitening part and an iterative part, which yields the unknown displacements after a few iterations. The most costly part of the algorithm (ie cross-correlation computations) is performed efficiently via a new scheme based on a proper partitioning of the images and the use of the FFT. The new registration technique exhibits a superior performance compared to the conventional cross-correlation method. The new technique has been successfully applied in a visual diagnostic method for detecting, in vivo, epithelial dysplasias and malignancies.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel endoscopic spectral imaging platform integrating k-means clustering for early and non-invasive diagnosis of endometrial pathology",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6610532/",
            "Abstract": "We report a multimodal endoscopic system capable of performing both color and fast multispectral imaging in the spectral range 400-1000nm. The system is based on a computer controllable tunable light source, which can be coupled with all types of endoscopes. Performance evaluation showed about 60% flat transmittance in almost all the operating wavelengths, at about 13 nm bandwidth per tuning step. With this system adapted to a thin hysteroscope, we also report, for the first time, spectral analysis of the endometrium and unsupervised/objective clustering of the spectra. We have implemented a method combining the k-means algorithm with the silhouette criterion for estimating the number of the distinguishable spectral classes that may correspond to different medical conditions of the tissue. It was found that there are five-well defined clusters of spectra, while preliminary clinical data seem to correlate well …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In vivo Estimation of Functional and Structural Characteristics in Epithelial Neoplasia",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=omp-2011-OMA5",
            "Abstract": "We have developed a method for estimating both functional and structural characteristics in cervical intraepithelial neoplasia based on pharmacokinetic modeling of biomarker-tissue interaction and on the solution of the inverse problem through Global Optimization methods.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:M05iB0D1s5AC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Short free running Nd: YAG laser to clean different encrustations on Pentelic marble: procedure and evaluation of the effects",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296207402011512",
            "Abstract": "On ancient Greek monuments of Pentelic marble, environmentally induced encrustation (black dendritic and thin) along with layers with ancient treatments (patina) were irradiated with a Nd:YAG laser system operating at the fundamental mode (λ = 1064 nm) with td = 20 μs (short free running Nd:YAG laser). Laser experiments were coupled with the spraying of small quantities of distilled water on the encrustation before the irradiation. The effects of the laser-assisted cleaning were investigated using thin section analysis, optical microscopy, scanning electron microscopy coupled to energy dispersive X-ray analysis, infrared spectroscopic analysis, and X-ray diffraction analysis, as well as color measurements and imaging analysis using multi-spectral imaging. Based on the results, the main evaluation criteria were achieved for the application of the short free running Nd:YAG laser system for cleaning purposes. Multi …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "In Vivo Molecular Imaging of Cervical Neoplasia Using Acetic Acid as Biomarker",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4451106/",
            "Abstract": "In this paper, a molecular imaging method employing acetic acid dilute solution as a biomarker is described. An interpretation of the biophysical processes that are involved in the biomarker-tissue interaction and are determining the in vivo measured dynamic scattering characteristics is presented. On the basis of this interpretation, a compartmental model of the epithelium is developed for predicting the epithelial transport phenomena that are expected to be correlated with the dynamic characteristics of the backscattered light. The model predictions have been compared with the experimental data obtained from patients with cervical neoplasia of different grade, with the aid of a specially developed imaging system. Comparisons confirmed the validity of the interpretation of the phenomenon, and particularly, the fact that dynamic scattering characteristics are largely determined by the intracellular proton concentration …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel spectral microscope system: application in quantitative pathology",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1185144/",
            "Abstract": "A novel spectral microscope system is presented together with a method for the quantitative assessment of the uptake by histologic samples of stains used in pathology to label tissue features of diagnostic importance. The critical component of the microscope is a variable interference filter-based monochromator. The system is capable of performing real-time spectral imaging in a plurality of spectral bands and micro-spectroscopy in any image pixel, in the spectral range 400-1000 nm. The wavelength-tuning step is 2.4-2.6 nm, while the full-width at half maximum in each step is about 1.5% of the operating central wavelength. The developed system integrates algorithms and calibration procedures for the calculation of the stain-uptake by the tissue. The acquired spectra from both stained tissue and calibration stain solutions enable the calculation of the concentration maps of the stains, even if the latter are multiple …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance of dynamic spectral imaging (DSI) colposcopy to detect high-grade cervical neoplasia in different referral groups, including reflex hrHPV-testing: PP3. 03",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=16479622130598589450&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hyperspectral imaging: potential in non-destructive analysis of palimpsests",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530131/",
            "Abstract": "Palimpsests -twice written manuscripts- are of great interest since they may contain important hidden text underneath the visible one. Hyperspectral imaging may aid the expert to read the old script by enhancing the contrast between the under- and -overwriting. We present a hyperspectral imager (MUSIS), capable of acquiring 34 calibrated spectral bands in the range of 360-1150 nm (extended to 1550 nm when coupled with a photocathode tube). The potential of spectral imaging to improve the readability of manuscripts by employing common spectral analysis techniques is explored. Results on different manuscripts obtained by principal component analysis (PCA) and linear spectral mixture analysis (LSMA) prove that hyperspectral imaging tools has the potential to become an indispensable tool for the analysis of old manuscripts.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "DYNAMIC SPECTRAL IMAGING OF CERVIX: A NOVEL IMAGING MODALITY AND TECHNOLOGY FOR NON-INVASIVE DIAGNOSIS OF CERVICAL NEOPLASIA",
            "Publication year": 2004,
            "Publication url": "https://ijgc.bmj.com/content/14/Suppl_1/239.4.abstract",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:hFOr9nPyWt4C",
            "Publisher": "BMJ Specialist Journals"
        },
        {
            "Title": "Quantitative assessment of the pupillary photomotor response dynamics to tunable, narrow band stimuli",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6399645/",
            "Abstract": "Digital pupillography presents a “window” for studying the autonomous nervous system functionality, with an uprising research interest. Multiband pupillary responses are exploited only partially up to now, due to technological limitations of the devices developed so far and to the lack of the parameterization of the measured responses. We have developed a spectral binocular pupillographic device, capable of recording papillary responses to polychromatic stimuli spanning the entire visible spectrum. The recorded direct and consensual reflexes are further processed and novel pupil mobility indices such as velocity and acceleration vs. wavelength are calculated and displayed. The wavelength dependence of these parameters is studied for the first time and it is expected to be very informative for various pathologic conditions of the autonomous nervous system. The ultimate goal of this project is to develop a new …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial spectral vision for studying the spectral, the spatial and the temporal characteristics of dynamic optical phenomena in biomedicine",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6958473/",
            "Abstract": "In this paper we present a novel snapshot spectral imager with the distinct advantage of being able to display maps representing different spectral classes in a scene in video rates. The Simultaneous capturing of spectral images through a common aperture is combined with spectral estimation algorithms for improving spectral resolution at no cost to the spatial resolution. The developed real time spectral mapper (RTSM) is validated in a pilot study as a blood oxygen saturation mapper, where its great value in studying the spatiotemporal characteristics of dynamic optical effects was clearly established.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hyperspectral imaging and spectral classification for assisting in vivo diagnosis of melanoma precursors: preliminary results obtained from mice",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7738255/",
            "Abstract": "Dysplastic nevi are at high risk of converting to melanoma. Early detection of signs of skin dysplasias at their curable stage, is crucial. We present an integrated system combining a Hyperspectral Camera system (HyCam), with spectral classification algorithms, developed for the in vivo and objective discrimination between non dysplastic, dysplastic nevi and melanomas. A melanoma animal model was developed in order to monitor the process of melanoma development. Reference spectra were collected from normal skin areas, which were compared with the spectra obtained from the lesions using the Spectral Angle Mapper (SAM) algorithm. A pseoudocolor map was created with different colors representing various degrees of similarity between test and reference spectra. The system's predictions ware validated with biopsy/histology. Both sensitivity and specificity were found to be 77%, highlighting the potential …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bootstrap clustering approaches for organization of data: Application in improving grade separability in cervical neoplasia",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809418303136",
            "Abstract": "This study introduces a novel technique for the self-organization of large datasets, without prior knowledge on the statistical distribution of data. The particular application of interest concerns the self-organization of diffuse reflectance time-lapse curves, expressing the biomarker uptake-wash out kinetics in cervical epithelium. Dynamic spectral imaging generates one curve per pixel resulting to about 700.000 curves per person examined. It comprises an established technology for the non-invasive diagnosis of precancerous lesions, since various curve profiles represent distinct neoplasia grades. The methodology developed in this study constitutes an effective automatic clustering approach improving the discrimination ability between a number of precancerous and non-precancerous abnormalities. The automatic clustering of such a large number of curves is expected to facilitate early diagnosis and prognosis, as …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:lSLTfruPkqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A novel hyper-spectral imaging apparatus for the non-destructive analysis of objects of artistic and historic value",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296207402012165",
            "Abstract": "We have developed a computer controllable hyper-spectral imaging apparatus, capable of acquiring spectral images of 5 nm bandwidth and with 3 nm tuning step, in the spectral range 380–1000 nm. The critical component of the apparatus is the innovative imaging monochromator, which enables the tuning of the imaging wavelength. This module is coupled with a two-dimensional detector array composing a tunable wavelength camera system. Electronic controllers are employed for detector and monochromator synchronization and driving, while the system calibration, image processing and analysis are performed with the aid of specially developed software. The system records light intensity as a function of both wavelength and location. In the image domain, the data set includes a full image at each individual wavelength. In the spectroscopy domain, a fully resolved diffuse reflectance and/or fluorescence …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Modeling of epithelia transport phenomena related with the acetowhitening optical changes: potential for the in vivo diagnosis of cervical neoplasia",
            "Publication year": 2008,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6991/69912C/Modeling-of-epithelia-transport-phenomena-related-with-the-acetowhitening-optical/10.1117/12.781501.short",
            "Abstract": "A molecular imaging method employing acetic acid dilute solution as a biomarker of cervical neoplasia is described and the interpretation of the biophysical processes involved determining the in-vivo measured dynamic scattering characteristics is presented. A compartmental model of the epithelium has been developed for predicting the epithelial transport phenomena that are expected to be correlated with the dynamic characteristics of the backscattered light. Model predictions have been compared and confirmed by experimental data obtained from patients with cervical neoplasia of different grade, with the aid of specially developed imaging system. Results revealed that the dynamic scattering characteristics and both structural and functional alterations are largely determined by the intracellular proton concentration kinetics. This highlights the potential of the developed imaging method and technology for the …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:R3hNpaxXUhUC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A hyper spectral imaging FUndus camera for the detection and characterization of retinal lesions",
            "Publication year": 2002,
            "Publication url": "https://iovs.arvojournals.org/article.aspx?articleid=2421606",
            "Abstract": "Purpose: To present an innovative new hyper-spectral imaging fundus camera. Methods: We have developed a new hyper-spectral fundus camera capable to perform in-vivo retinal spectroscopy. This new system can acquire high-resolution spectral images from 400nm to 1000nm with a FWHM of 15nm-25nm and a tuning step of 3nm. Following image capturing, special algorithms are used to perform registration of the eye micro-movement. In combination with a calibration method that has been used to normalize the captured spectral images, a full spectrum per image pixel is achieved. Results: Up to 50 high-resolution spectral images per eye were captured across the visible and infrared part of the spectrum. The need for registration was assessed by evaluating the spatial coordinates of specific features in a series of consecutive images. Measurement of the spectral features of the fundus enabled the evaluation …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:NMxIlDl6LWMC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Spectral data self-organization based on bootstrapping and clustering approaches",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7294546/",
            "Abstract": "This study introduces a novel technique for self-organizing data, without any prior knowledge on their statistical distribution, fusing efficient strategies from clustering and resampling. The proposed methodology aims at searching for hidden characteristics within the processed dataset and revealing additional data structures or subclasses that can be utilized for identifying irregular groups that are of particular importance in disease modeling. The performance evaluation of the presented algorithm to biomedical data from cervical cancer is tested and analyzed on sample vectors representing the temporal response of tissue areas obtained through multispectral imaging. The results of this study show that stratified, repeated applications of simple clustering schemes can effectively organize big data, giving rise to the application of the proposed method for tissue classification for enabling accurate and early disease …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Journal of Photochemistry and Photobiology B: Biology 65 (2001) 184 www. elsevier. com/locate/jphotobiol",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=14335682371801905852&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel optical imaging method for the early detection, quantitative grading, and mapping of cancerous and precancerous lesions of cervix",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/900259/",
            "Abstract": "Describes a novel optical imaging method for the in vivo early detection, quantitative staging, and mapping of cervical cancer and precancer. A multispectral imaging system was developed, which is capable of performing time-resolved imaging spectroscopy. The system was used in order to assess quantitatively the alterations in the light scattering properties of the cervix, induced selectively and reversibly in cervical neoplasias, after the application of acetic acid solution. Spectral imaging and analysis of cervix show that the maximum contrast between acetic acid responsive and nonresponsive areas is obtained at 525/spl plusmn/15 nm, which is further enhanced by cutting off the regular component of tissue reflection, with the aid of two linear cross polarizers. Successive snapshot imaging at this spectral band enables the quantitative assessment of the temporal alterations in the intensity of the backscattered light …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "In vivo detection of human papilloma virus-induced lesions of anogenital area after application of acetic acid: a novel and accurate approach to a trivial method",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1011134401002378",
            "Abstract": "Human papilloma virus infection is increasing at an alarming rate. The ability of the virus to establish a subclinical infection and its association with malignancy of the lower genital tract make the statistics even more worrisome. Topical application of acetic acid solution provokes temporal alterations of the light-scattering properties of human papilloma virus-induced lesions of anogenital area. For the in vivo study of the phenomenon, an imaging system has been employed, which performs time-lapse imaging and enables the calculation and display of the kinetics of the provoked alterations in any point within the examined area. Confirmation of diagnosis has been established with conventional histology and polymerase chain reaction. It has been shown that the method provides early detection and staging of skin alteration or transformation due to human papilloma virus infection and enables mapping of the infected …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A real-time spectral mapper as an emerging diagnostic technology in biomedical sciences",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6609777/",
            "Abstract": "Real time spectral imaging and mapping at video rates can have tremendous impact not only on diagnostic sciences but also on fundamental physiological problems. We report the first real-time spectral mapper based on the combination of snap-shot spectral imaging and spectral estimation algorithms. Performance evaluation revealed that six band imaging combined with the Wiener algorithm provided high estimation accuracy, with error levels lying within the experimental noise. High accuracy is accompanied with much faster, by 3 orders of magnitude, spectral mapping, as compared with scanning spectral systems. This new technology is intended to enable spectral mapping at nearly video rates in all kinds of dynamic bio-optical effects as well as in applications where the target-probe relative position is randomly and fast changing.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectral imaging for the in-vivo detection and mapping of tissue lesions",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=16614450126197060550&hl=en&oi=scholarr",
            "Abstract": "The early detection and mapping of tissue abnor-malities forms the basis for the efficient and ef-fective treatment of any pathological process. In current clinical practice, subjective impressions and qualitative assessment of the pathology are obtained by visual examination. The treatment modality is based on the findings' recorded at the time of the initial examination. These could of course change by the time the treatment is un-dertaken. To counteract this possibility, further intraoperative visual assessment is carried out im-mediately prior to undertaking definitive man-agement.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Kugler Publications"
        },
        {
            "Title": "Multi-and Hyper-Spectral Imaging in Tissue Optical Biopsy",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=5448551831259732185&hl=en&oi=scholarr",
            "Abstract": "The deficiencies encountered in the visual clinical diagnosis of malignant and premalignant lesions are mainly due to the fact that the metabolic or structural alterations, occurring during the progress of the disease, do not alter significantly and with specificity the color characteristics of the abnormal tissue. In order to obtain more accurate diagnosis, biopsy samples are obtained, which undergone histologic examination. Although this method is considered up to now as the\" gold standard\" for the tissue diagnostics, it is widely known that it is qualitative, subjective time consuming, costly and labor intensive and that it suffers from several limitations and drawbacks, such as tissue sampling and reading errors. These limitations highlight the need for the development of novel, more efficient diagnostic methods and systems.In recent years, several clinical and research activities are directed toward the development of novel, noninvasive methods and technologies for tissue diagnostics, frequently dubbed\" Optical Biopsy\". The motivation is the demand for a powerful screening tool, capable of detecting tissue abnormalities in early stage, avoiding multiple biopsies and allowing faster, more effective diagnosis and treatment.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:dhFuZR0502QC",
            "Publisher": "Alpha Science Int'l Ltd."
        },
        {
            "Title": "Hyperspectral image acquisition and analysis of skin",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4959/0000/Hyperspectral-image-acquisition-and-analysis-of-skin/10.1117/12.479491.short",
            "Abstract": "Hyperspectral imaging of skin combines the spectral information of diffuse reflectance spectroscopy with the spatial information of 2D imaging. Skin chromophore maps can be reconstructed in which features such as pigmented lesions, diffuse and localized erythema, areas of increased blood stasis, etc. could be identified and the relative parameters quantified. Hyperspectral imaging is the only reliable method to produce a quantitative distribution map of chromophores contributing to the color appearance of the skin.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:YsMSGLbcyi4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "In vivo dynamic imaging, in silico modeling and global sensitivity analysis for the study and the diagnosis of epithelial neoplasia",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6089905/",
            "Abstract": "We present a method for detecting and studying neoplasia-specific functional and structural features through the combination of in vivo dynamic imaging, in silico modeling and global sensitivity analysis. We particularly present the case of cervical epithelium interacting with acetic acid solution, which is employed as an optical biomarker. The in vivo measured dynamic scattering characteristics are strongly correlated with the output of the biomarker's pharmacokinetic model that we have developed. Model global sensitivity analysis has shown that the measured/modeled bio-optical processes can be used for probing, in vivo, the number of neoplastic layers, the extracellular pH, the intracellular buffering efficiency and the size of the extracellular space.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Laser cleaning of inorganic encrustation on excavated objects: evaluation of the cleaning result by means of multi-spectral imaging",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296207402012177",
            "Abstract": "This report addresses the removal of inorganic encrustations from excavated marble objects. The use of laser radiation was compared with established cleaning methods (micro-air abrasive, ultrasound pick, etc.) and proved to be the most desirable method as it preserves the authentic surface relief. In order to choose the best parameters for laser cleaning, additional tests were performed to compare the effect of ultraviolet and infrared Q-switched pulses. The results were evaluated by means of multi-spectral imaging. It has been proven that such an imaging system can give significant information regarding the cleaning result and therefore highlights the potential for the in situ assessment of the laser cleaning process.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "A New Equalization Scheme for Series Connected Battery Cells",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09398368.2009.11463726",
            "Abstract": "In this paper a new equalization scheme for series connected battery cells or monoblocks is presented which provides both charge and discharge equalization. The equalization scheme described in this paper provides support for the battery operation even with damaged cells, ensures a uniform battery cell voltage fall, thus protecting cells from reverse polarization, and maximizes the energy delivered by the battery (Fig. 2). An evaluation Battery Management System (BMS) was developed in the laboratory, utilizing the proposed equalization scheme, and the experimental results verify the theoretical ones.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Routledge"
        },
        {
            "Title": "A novel hyperspectral camera and analysis platform for the non-destructive material identification and mapping: An application in paintings by El Greco",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7738225/",
            "Abstract": "Non-destructive point spectroscopic techniques and destructive methods based on sampling and ex-situ analysis are not efficient for examining large areas of objects of artistic and historic value. A novel hyperspectral camera and analysis platform (HySCAP) is presented in this paper, integrating innovative electrooptic solutions and advanced spectral analysis and classification algorithms. This combination offers and attractive alternative to a variety of destructive or ionizing methods used routinely for material identification. HySCAP acquires millions of reflectance and/or fluorescence spectra and tens of narrow band images, spanning the entire 370nm-1100nm wide spectral range. Specially developed and integrated into the HySCAP spectral analysis and system's training tools maximizes the obtained information with regard to the target-object's composition and structure. We have validated the HySCAP concept …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Review of biomedical optical imaging—a powerful, non-invasive, non-ionizing technology for improving in vivo diagnosis",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/20/10/104020/meta",
            "Abstract": "This paper reviews the recent developments in the field of biomedical optical imaging, emphasizing technologies that have been moved from'bench top to bedside'. Important new developments in this field allow for unprecedented visualization of the tissue microstructure and enable quantitative mapping of disease-specific endogenous and exogenous substances. With these advances, optical imaging technologies are becoming powerful clinical tools for non-invasive and objective diagnosis, guided treatment and monitoring therapies. Recent developments in visible and infrared diffuse spectroscopy and imaging, spectral imaging, optical coherence tomography, confocal imaging, molecular imaging and dynamic spectral imaging are presented together with their derivative medical devices. Their perspectives and challenges are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Hyperspectral imaging and spectral classification for pigment identification and mapping in paintings by El Greco and his workshop",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-017-5564-2",
            "Abstract": "The identification of painting materials is of essential importance for artistic and scientific analysis of objects of artistic and historic value. In this paper we report a new method and technology comprising a) hyperspectral imaging, b) development of spectral libraries corresponding to target materials and c) proper classification strategies with (a) and (b) as inputs. Our findings advocate that the method improves radically the diagnostic potential of visible-near infrared imaging spectroscopy. A system’s approach is implemented by combining a novel hyperspectral camera integrating an innovative electro-optic tunable filter solution with spectral analysis and classification algorithms. A series of pigment material replicas was developed using original methods covering almost the entire palette of Renaissance painters. Hyperspectral acquisition of the constructed pigment panels provided millions of spectra, which …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Hyper-spectral imaging system with embedded spectral segmentation and classification algorithms for the non-destructive analysis of artworks and manuscripts an application in paintings by El Greco'",
            "Publication year": 2008,
            "Publication url": "https://www.ndt.net/article/art2008/papers/111Balas.pdf",
            "Abstract": "We report on the development of a spectral database and of spectral classification and segmentation algorithms and software, which have been integrated to MuSIS Hyper-Spectral camera (MuSIS HS) for improving its diagnostic capabilities in non-destructive analysis of works of art and manuscripts. MuSIS HS comprises an innovative imaging monochromator, operating as an electronically tunable optical filter in a wide wavelength range (370-1000 nm). The monochromator is coupled with a megapixel CCD sensor and MuSIS HS records light intensity as a function of both wavelength and location. Operating in imaging mode, an image at each wavelength band is acquired while, in spectroscopy mode, a fully resolved diffuse reflectance and/or fluorescence spectrum per image pixel can be recorded (image spectral cube). Both the monochromator and the camera are driven by electronic controllers. We have …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agreement between colposcopic impression and histological diagnosis among human papillomavirus type 16‐positive women: a clinical trial using dynamic spectral imaging colposcopy",
            "Publication year": 2012,
            "Publication url": "https://obgyn.onlinelibrary.wiley.com/doi/abs/10.1111/j.1471-0528.2012.03280.x",
            "Abstract": "Please cite this paper as: Zaal A, Louwers J, Berkhof J, Kocken M, ter Harmsel W, Graziosi G, Spruijt J, Balas C, Papagiannakis E, Snijders P, Meijer C, van Kemenade F, Verheijen R. Agreement between colposcopic impression and histological diagnosis among human papillomavirus type 16‐positive women: a clinical trial using dynamic spectral imaging colposcopy. BJOG 2012;119:537–544.Objective  To investigate the agreement between conventional colposcopic impression, dynamic spectral imaging (DSI) colposcopy and histology, for human papillomavirus type 16‐positive (HPV16+) and non‐16 high‐risk (hr) HPV+ women.Design  Prospective, comparative, multicentre clinical trial.Setting  Three colposcopy clinics in the Netherlands.Population  Women (n = 177) aged 18 years or over with an intact cervix, referred for colposcopy.Methods  The colposcopist graded the lesion by using the DSI …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "In silico modeling and global optimization of dynamic bio-optical processes for probing, in vivo, biological features of neoplasia",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6245122/",
            "Abstract": "We present the first in silico simulation of biomarker uptake kinetics and of the associated dynamic optical signals, measured in vivo in neoplastic epithelial tissue. We introduce a new, non-invasive method for estimating and mapping of both structural and functional, neoplasia-correlated parameters. The method relies on model-based fitting of dynamic optical signals, measured in vivo, and on solving the inverse problem with the aid of global sensitivity analysis and global optimization approaches.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DYNAMIC SPECTRAL IMAGING–HISTOLOGICAL CORRELATION",
            "Publication year": 2004,
            "Publication url": "https://ijgc.bmj.com/content/14/Suppl_1/172.3.abstract",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:7PzlFSSx8tAC",
            "Publisher": "BMJ Specialist Journals"
        },
        {
            "Title": "Dynamic contrast enhanced optical imaging of cervix, in vivo: a paradigm for mapping neoplasia-related parameters",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6610291/",
            "Abstract": "We present a novel biophotonic method and imaging modality for estimating and mapping neoplasia-specific functional and structural parameters of the cervical precancerous epithelium. Estimations were based on experimental data obtained from dynamic contrast-enhanced optical imaging of cervix, in vivo. We have developed a pharmacokinetic, in silico, model of the optical tracer's uptake by the epithelium. We have identified that the kinetic parameters of the model correlate well with pathologic alterations in both metabolic and structural characteristics of the tissue, associated with the neoplasia progress. Global sensitivity analysis and global optimization methods were employed for identifying the key determinant set of biological parameters that dictate the model's output. Particularly, the shuffled complex evolution algorithm converged to a set of four parameters that can be estimated with an error of 7 …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic spectral imaging colposcopy: higher sensitivity for detection of premalignant cervical lesions",
            "Publication year": 2011,
            "Publication url": "https://obgyn.onlinelibrary.wiley.com/doi/abs/10.1111/j.1471-0528.2010.02806.x",
            "Abstract": " Please cite this paper as: Louwers J, Zaal A, Kocken M, ter Harmsel W, Graziosi G, Spruijt J, Berkhof J, Balas C, Papagiannakis E, Snijders P, Meijer C, van Kemenade F, Verheijen R. Dynamic spectral imaging colposcopy: higher sensitivity for detection of premalignant cervical lesions. BJOG 2011;118:309–318.Objective  To validate the dynamic spectral imaging (DSI) colposcope’s colour‐coded map in discriminating high‐ from low‐grade cervical lesions and non‐neoplastic tissue.Design  Prospective, comparative, multicentre clinical trial.Setting  The colposcopy clinics of three Dutch hospitals.Population  Women of 18 years or over with an intact cervix, referred for colposcopy.Methods  During a 3‐minute image acquisition phase, the DSI colposcope was used as a regular video colposcope: the colposcopist located and graded potential lesions based on conventional colposcopic criteria. Subsequently …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Spectral characteristics of acute lymphoblastic leukemia in childhood",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0145212604000931",
            "Abstract": "Although the differentiation and classification of acute leukemia are based upon cytochemical features as well as immunologic, cytogenetic, and molecular characteristics, in many cases the morphological distinction of normal lymphocytes from lymphoblasts of acute lymphoblastic leukemia (ALL) is difficult using light microscopy. In this study the distinction between normal lymphocytes and lymphoblasts of childhood ALL is proposed using their spectral characteristics. The method has been based upon the analysis and classification of optical absorption characteristics of the bone marrow cells. Spectral microscopy system is capable of capturing a great number of narrow-band images, in the wide spectral range of the optical spectrum. The analysis showed statistically significant difference (P<0.0001) between normal lymphocytes and lymphoblasts as far as it concerns the detection, identification and mapping of their …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:UebtZRa9Y70C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Modelling of epithelial transport phenomena related with the acetowhitening optical characteristics: Potential for the in-vivo diagnosis of Cervical Neoplasia",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=16652019726933205427&hl=en&oi=scholarr",
            "Abstract": "A molecular imaging method employing acetic acid dilute solution as a biomarker of cervical neoplasia is described. The biophysical basis of the AcetoWhitening (AW) phenomenon and the exploitation of its optical characteristics for assessing, in-vivo, functional and structural characteristics of the abnormal cervical epithelium utilizing an advanced colposcope, are presented. Towards the quantitative assessment of the AW optical effect in different CIN stages, we developed a biophysical model for the epithelial transport pathways of dilute Acetic Acid (AA) solution in the cervical stratified epithelium. Model predictions for various neoplasia grades confirmed the validity of the model. The dynamic optical characteristics of the AW effect are found to be strongly correlated with functional (extracellular acidity) and structural (extracellular space and abnormal layer number) parameters. This highlights the potential of the …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recursive-mode K-means clustering for self-organization of Dynamic Imaging data",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7738197/",
            "Abstract": "The aim of this study was to develop a novel algorithmic scheme for self-organizing data, adopting an recursive-mode k-means clustering approach. The proposed methodology attempts to refine and improve the clustering result by sequentially updating centers on the basis of their present and previous positions, exploiting both prior expert knowledge and posterior data information from the statistical distribution of the examined population. The performance of the implemented algorithm is evaluated on Dynamic Imaging data from cervical tissue, examining numerous sample curves representing the temporal response of tissue areas under the aceto-whitening effect. In comparison to the performance of classical k-means approach, the preliminary results of this study indicate the outperformance of the proposed iterative scheme. The primary benefit is attributed to the center improvement strategy against the center …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Yellowing effect and discoloration of pigments: experimental and theoretical studies",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296207402012050",
            "Abstract": "Two issues of great interest in the field of lasers in artwork conservation are the so-called yellowing effect and the discoloration of pigments. We have viewed these issues from a comprehensive point of view, considering all our present experimental results as well as ongoing modeling and theoretical calculations. The first concern to be discussed is the yellowing effect in laser cleaning of marble or stone artifacts. Although, in most cases, a yellowish layer exists underneath the black encrustation, the so-called ‘patina’, it has become clear that there are situations where yellowing cannot be attributed to an existing layer. In the present study, a light scattering model that may account for the yellowing is presented. This model considers a thin absorbent layer and the surface roughness and/or created voids and accounts for the reflectance spectra measured by (i) hyper-spectral imaging and (ii) integrating sphere …",
            "Abstract entirety": 0,
            "Author pub id": "NkVkf9QAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Investigative reports-In vivo fluorescence kinetics and photodynamic therapy efficacy of d-aminolevulinic acid-induced porphyrins in basal cell carcinomas and actinic keratoses; implications for",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=3862780733371292909&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:35N4QoGY0k4C",
            "Publisher": "Montrouge, France: John Libbey Eurotext, c1991-"
        },
        {
            "Title": "Novel optical imaging technologies for in vivo diagnosis and screening",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4659957/",
            "Abstract": "There is currently an ongoing revolution in in vivo optical imaging. Important new developments allow for unprecedented visualization of tissue microstructure and enable quantitative mapping of disease-specific endogenous and exogenous chromophores. With these advances, optical imaging technologies are becoming powerful clinical tools for non invasive and objective diagnosis, guided treatment and for monitoring therapies. This report seeks to capture the current state of the art in optical imaging, emphasizing to new technology platforms that have achieved adoption and implementation in clinical setting.",
            "Abstract entirety": 1,
            "Author pub id": "NkVkf9QAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        }
    ]
}]