[{
    "name": " Κυριάκος Ζωηρός",
    "romanize name": " Kyriakos Zoiros",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Μηχανικών Η/Υ",
    "University": "duth",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 19606,
    "Scholar name": "KYRIAKOS ZOIROS",
    "Scholar id": "KcVeVFkAAAAJ",
    "Affiliation": "Associate Professor, Democritus University of Thrace",
    "Citedby": 2398,
    "Interests": [
        "optical communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=KcVeVFkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Numerical investigation of an all-optical logic OR gate at 80 Gb/s with a dual pump–probe semiconductor optical amplifier (SOA)-assisted Mach–Zehnder interferometer (MZI)",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-018-1275-9",
            "Abstract": "The performance of an all-optical OR gate using a dual pump–probe semiconductor optical amplifier (SOA)-assisted Mach–Zehnder interferometer (MZI) is investigated and demonstrated through numerical simulations at a data rate of 80 Gb/s. The proposed scheme enables to obtain a higher quality factor and smaller pattern dependence for a more feasible choice of critical operating parameters than when using for the same purpose the SOA–delayed interferometer.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Theoretical analysis and performance investigation of ultrafast all-optical Boolean XOR gate with semiconductor optical amplifier-assisted Sagnac interferometer",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401805007674",
            "Abstract": "A comprehensive theoretical model of an ultrafast all-optical Boolean XOR gate implemented with a semiconductor optical amplifier (SOA)-assisted Sagnac interferometer is presented. The model accounts for the SOA small signal gain, linewidth enhancement factor and carrier lifetime, the switching pulses energy and width and the Sagnac loop asymmetry. By undertaking a detailed numerical simulation, the influence of these key parameters on the metrics that determine the quality of switching is thoroughly investigated and simple design rules are extracted for their proper selection so as to ensure optimum operation. The obtained results are in good agreement with the published experimental measurements and confirm the feasibility of realizing the gate at 10 Gb/s with fairly high performance. The model can be extended for studying more complex all-optical circuits of enhanced functionality in which the XOR …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:qjMakFHDy7sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "40 GHz mode-locked SOA fiber ring laser with 20 nm tuning range",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2000-TuR3",
            "Abstract": "High repetition rate, picosecond laser sources are key elements for WDM/OTDM transmission, switching and photonic network systems.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "SOA-MZI all-optical RoF signal mixing",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8840153/",
            "Abstract": "Fiber-optic transmission of high radiofrequency (RF) signals is being established as a key means for efficiently dealing with the ever-demanding bandwidth, services and cost requirements of modern broadband wireless networks and systems. Implementation of this technology critically relies on the capability of processing RF signals in the optical layer. A Mach-Zehnder Interferometer (MZI) which incorporates semiconductor optical amplifiers (SOAs) is an attractive scheme for executing all-optically the important task of RF signal frequency transposition via mixing function. In this paper we present the progress and main outcomes obtained so far on the work carried-out to achieve this goal under collaborative project `Choraal'. In this context we characterize, evaluate, demonstrate and discuss the performance capabilities, limitations and perspectives of the SOA-MZI when it is architecturally configured to realize RF …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applications of Semiconductor Optical Amplifiers",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/books/pdfdownload/book/777",
            "Abstract": "Articles in this volume are Open Access and distributed under the Creative Commons Attribution (CC BY) license, which allows users to download, copy and build upon published articles even for commercial purposes, as long as the author and publisher are properly credited, which ensures maximum dissemination and a wider impact of our publications. The book taken as a whole is c 2018 MDPI, Basel, Switzerland, distributed under the terms and conditions of the Creative Commons license CC BY-NC-ND (http://creativecommons. org/licenses/by-nc-nd/4.0/).",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:08ZZubdj9fEC",
            "Publisher": "MDPI"
        },
        {
            "Title": "Performance improvement of directly modulated semiconductor optical amplifier with filter‐assisted birefringent fiber loop",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.29313",
            "Abstract": "We propose to use an optical bandpass filter (OBPF) placed after a birefringent fiber loop (BFL) to improve the performance of a semiconductor optical amplifier (SOA), which is directly modulated at an extended data rate than that enabled by its limited modulation bandwidth. The OBPF complements the BFL action by being detuned toward the opposite sideband than the BFL. The obtained experimental results demonstrate and confirm that compared with the BFL only, the filter‐assisted BFL scheme can further reduce the chirp and pulse peak amplitude variations, reshape the eye diagram, and make more symmetric and narrow the spectrum of the encoded data signal after the SOA. © 2015 Wiley Periodicals, Inc. Microwave Opt Technol Lett 57:2247–2251, 2015",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modelling of semiconductor optical amplifier chirp compensation using optical delay interferometer",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6041153/",
            "Abstract": "The feasibility of employing an optical delay interferometer (ODI) to compensate for the chirp imposed by a semiconductor optical amplifier (SOA) on its driving data pulses is demonstrated through the proper modelling of the joined setup of these elements. The simulation conducted for this purpose allows to specify the optimum temporal offset inserted by the cascaded ODI that effectively reduces the magnitude of the chirp and the variations of its peaks even when the SOA operational conditions are tight.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical XNOR gate using quantum-dot semiconductor optical amplifier-based Mach-Zehnder interferometer",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6292656/",
            "Abstract": "An all-optical XNOR gate is theoretically implemented using for the first time a quantum-dot semiconductor optical amplifier-based Mach-Zehnder interferometer. By conducting numerical simulation the feasibility of the proposed scheme is demonstrated for return-to-zero data pulses at 160 Gb/s and a suitable choice of values for the critical parameters is specified that allows XNOR logic to be executed with high performance at this ultrafast bit rate.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Communication Networks Standards for Smart Grid Infrastructures",
            "Publication year": 2021,
            "Publication url": "https://www.preprints.org/manuscript/202106.0510",
            "Abstract": "The upgrade of energy infrastructure to those of smart grids, necessarily goes through the provision of integrated technological solutions that ensure the interoperability of their business capabilities and reduce the risk of devaluation of the systems used. The heterogeneity of the infrastructures and the dynamics of their operating environment, requires the continuous reduction of the complexity, the faster execution of the processes and the easy addition of innovative counterparts. Also, the integrated management of the overall ecosystem demands the provision of end-to-end interconnection, quality assurance, the definition of strict security policies, collaborative integration and correlation of events. In this respect, every design detail can be critical to the success or failure of a costly and ambitious project, such as that of smart energy networks. This work presents communication operating standards specific to the smart electricity networks applications, which should be taken into account in the process of planning and implementation of new infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Preprints"
        },
        {
            "Title": "Performance analysis of ultrafast all-optical Boolean XOR gate using semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401803024313",
            "Abstract": "An all-optical Boolean XOR gate implemented with a SOA-based Mach–Zehnder Interferometer (SOA-MZI) is numerically simulated at 10 and 40 Gb/s to extract simple design rules. If the control and clock energies are properly selected so that the SOAs are heavily saturated and at the same time the switched-out pulses are not distorted, the metrics that define the quality of switching can be optimized for high gate performance at 10 Gb/s. However, the operation at 40 Gb/s is limited by the SOAs gain recovery time that results in strong pattern dependence of the output pulses and so the extension to this rate requires the deployment of gain recovery reduction techniques in bulk and quantum-well SOAs or alternatively the exploitation of other technologically advanced optical devices, such as quantum-dot SOAs.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:UeHWp8X0CEIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Proposal for ultrafast all-optical XNOR gate using single quantum-dot semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399212003398",
            "Abstract": "The feasibility of realizing an all-optical XNOR gate for 160 Gb/s return-to-zero data pulses by using for the first time a single quantum-dot semiconductor optical amplifier (QD-SOA)-based Mach–Zehnder interferometer (MZI) is theoretically investigated and demonstrated. The proposed scheme differs from the usually employed ones in the way the MZI configuration is exploited. This consists in combining the data streams between which the XNOR logic is to be executed and launching them together into the QD-SOA of one MZI arm. The QD-SOA in the other MZI arm is constantly driven by an auxiliary signal that comprises of continuous pulses. By conducting numerical simulation, the impact of the active input signals and QD-SOA characteristics on the profile of the logically produced pulses is thoroughly explored and evaluated. This design procedure allows to specify the requirements that the critical performance …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:0EnyYjriUFMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "All-optical logic gates with quantum-dot semiconductor optical amplifiers",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6602760/",
            "Abstract": "In this invited paper we review the progress on all-optical gates that exploit quantum-dot semiconductor optical amplifiers (QD-SOAs) as nonlinear elements. In particular we focus on our research conducted in this cutting-edge technological field, which relies on QD-SOAs incorporated in a Mach-Zehnder Interferometer (MZI). We present results on an extensive set of Boolean operations executed in the optical domain by properly configuring and driving the QD-SOA-based MZI. We address the feasibility of these logic gates and we give guidelines for their design so that they can be realized with logical correctness and high performance. Finally we report on some characteristic applications of enhanced functionality where these fundamental gates are employed as core logic units to form complex all-optical circuits.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultrafast pattern-operated all-optical Boolean XOR with semiconductor optical amplifer-assisted Sagnac switch",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-42/issue-12/0000/Ultrafast-pattern-operated-all-optical-Boolean-XOR-with-semiconductor-optical/10.1117/1.1624851.short",
            "Abstract": "All-optical Boolean XOR operation is demonstrated on pseudo-data patterns at 20 Gb/s with a three optical input semiconductor optical amplifier-assisted Sagnac switch. Bit pattern switching has been achieved with low energies of the incoming clock and data pulses and low pattern dependence on the switched-out pulses.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "On the output characteristics of a semiconductor optical amplifier driven by an ultrafast optical time division multiplexing pulse train",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030402606000817",
            "Abstract": "A comprehensive theoretical analysis of a semiconductor optical amplifier (SOA) that is subject to an ultrafast optical time division multiplexing pulse stream is presented with the help of a simple but efficient model developed for this purpose. The model combines the necessary set of mathematical equations with the appropriate simplifying assumptions to describe in the time domain gain saturation and recovery for the case of multiple incoming pulses. In this manner, analytical expressions can be obtained for the power and chirp profile of the amplified pulses, essentially extending the work that has been performed for a single pulse only. This allows to identify the critical operational parameters and to investigate and evaluate their effect on these two output characteristics. The derived simulation curves are thoroughly studied to specify the limitations imposed on the SOA small signal gain and carrier lifetime as well …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Semiconductor optical amplifier pattern effect suppression using optical notch filtering",
            "Publication year": 2016,
            "Publication url": "https://pdfs.semanticscholar.org/f755/5068538a6394d29f911b71e2b8f723a80741.pdf",
            "Abstract": "We propose to employ four optical notch filtering schemes for mitigating the pattern effect in a semiconductor optical amplifier (SOA). The schemes are capable of feasibly and efficiently realizing significant improvements in the patterndependent performance of the SOA.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speed enhancement of all-optical pseudo random binary sequence (PRBS) generator using microring resonator",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-021-03329-5",
            "Abstract": "In the present communication, we have designed and simulated an all-optical Pseudo Random Binary Sequence (PRBS) generator using a suitable multiplexing technique that exploits the PRBS decimation and shift-and-add properties for doubling the PRBS speed at a rate of 500 Gb/s without increasing the synchronization frequency of the generator. The PRBS generator comprises of serially connected D flip-flops realized with double waveguide-coupled optical microring resonator (OMRR)-based switches in a pump-probe configuration, OMRR-based 2-input XOR gates for feedback and for creating the necessary PRBS phase-shifted replicas, and OMRR-based 2:1 multiplexer. The expected PRBS doubled speed operation is theoretically validated for 4-bit and 5-bit degree PRBS generator and can be extended in a straightforward manner for any rate multiplication factor or PRBS order with extra OMRR …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:1qzjygNMrQYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Investigation of SOA-assisted Sagnac recirculating shift register switching characteristics",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030402605001117",
            "Abstract": "The switching characteristics of a Semiconductor Optical Amplifier (SOA)-assisted Sagnac recirculating shift register with an inverter are investigated by undertaking a numerical analysis that describes the dynamic gain response of the SOA to high speed and strong feedback optical pulses. The key performance parameters are identified and their role in the formation of the switching window is analyzed. The optimum values of these parameters are not unique and must be adapted to the specific all-optical shift register network application. For this reason, they must be properly selected and combined so as to ensure the satisfaction of the desired operating conditions. The technical restrictions that the derived values may impose on the state-of-the-art photonics technology are also discussed and efficient ways of overcoming them are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Comparison of basic notch filters for semiconductor optical amplifier pattern effect mitigation",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/213448",
            "Abstract": "We conduct a thorough comparison of two basic notch filters employed to mitigate the pattern effect that manifests when semiconductor optical amplifiers (SOAs) serve linear amplification purposes. The filters are implemented using as the building architecture the optical delay interferometer (ODI) and the microring resonator (MRR). We formulate and follow a rational procedure, which involves identifying and applying the appropriate conditions for the filters’ spectral response slope related to the SOA pattern effect suppression mechanism. We thus extract the values of the free spectral range and detuning of each filter, which allow one to equivocally realize the pursued comparison. We define suitable performance metrics and obtain simulation results for each filter. The quantitative comparison reveals that most employed metrics are better with the MRR than with the ODI. Although the difference in performance is small, it is sufficient to justify considering also using the MRR for the intended purpose. Finally, we concisely discuss practical implementation issues of these notch filters and further make a qualitative comparison between them in terms of their inherent advantages and disadvantages. This discussion reveals that each scheme has distinct features that render it appropriate for supporting SOA direct signal amplification applications with a suppressed pattern effect. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Study on the cascadability of a SOA-assisted Sagnac switch pair",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030402609000382",
            "Abstract": "The ability of the SOA-assisted Sagnac switch to be cascaded in a pair scheme where the output from the transmission port drives directly the subsequent control terminal is investigated and demonstrated. For this purpose an efficient model that simulates the behavior of the SOA employed in each one of these interferometric arrangements is suitably applied to describe their concatenated setup. By conducting an extensive theoretical treatment the impact of the involved critical operational parameters on the defined quality metrics is thoroughly analyzed and assessed enabling to provide useful design rules for their proper selection and the achievement of enhanced performance. The two switches in tandem are a replica of each other if the leading one is driven as well as serially triggers its trailing counterpart with the proper amount of energy so that both SOAs are biased around the same saturation point. In this …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Proposal for ultrafast all-optical pseudo random binary sequence generator using microring resonator-based switches",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-020-01586-3",
            "Abstract": "An all-optical pseudo-random binary sequence (PRBS) generator is designed and simulated employing micro-ring resonators (MRRs) as the core technology. The PRBS generator consists of serially connected D flip-flops realized with double-bus MRR-based switches that exploit two-photon absorption induced in a pump-probe configuration, and of a MRR-based feedback XOR gate whose design is simpler than previously reported. The expected operation is theoretically validated for 3-bit and 4-bit degree PRBS generators and can be extended to higher PRBS orders with the straightforward addition of extra MRR-based D flip-flops. The MRR critical parameters, including radius, coupling coefficient and detuning, are optimized against performance metrics through numerical simulation at 250 Gb/s. The selection of these parameters according to the derived specifications can render feasible the practical …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Semiconductor optical amplifier pattern effect suppression with passive single microring resonator-based notch filter",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401814004131",
            "Abstract": "We propose to employ a passive single microring resonator (MRR) to suppress the pattern effect in a semiconductor optical amplifier (SOA). We specify the necessary conditions that must hold in order for the MRR to act as notch filter and compensate for the uneven spectral broadening of the amplified data pulses. This procedure allows us to find the permissible range of values of the MRR radius and suitably select this parameter so that the defined design criteria are satisfied and the employed figure-of-merits are acceptable. If designed and constructed as suggested, which is feasible with state-of-the-art technology, the MRR-based notch filter enables to significantly improve the pattern-dependent SOA performance and the quality characteristics of the amplified signal.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:isC4tDSrTZIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Performance investigation of 120 Gb/s all-optical logic XOR gate using dual-reflective semiconductor optical amplifier-based scheme",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-018-1243-4",
            "Abstract": "Reflective semiconductor optical amplifiers (RSOAs) use an anti-reflective coating on the front facet and a high reflectivity coating on the rear facet to produce a higher gain than conventional SOAs. In this paper, this potential is exploited to numerically investigate the ultrafast performance of an all-optical logic XOR gate implemented using a dual-RSOA-based scheme at a data rate of 120 Gb/s. The simulation results demonstrate that the XOR gate is capable of operating at 120 Gb/s with better performance than when using conventional SOAs.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Ultrafast all-optical exclusive OR operation with semiconductor optical amplifier-assisted fiber Sagnac switch",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/journalIssue/Download?downloadType=journal%20article&urlId=10.1117%2F1.1599362&isResultClick=True",
            "Abstract": "All-optical Boolean exclusive OR operation is demonstrated on a high-speed serial bit stream with a threeoptical-input-fiber Sagnac interferometer that employs a semiconductor optical amplifier as the nonlinear element. Full duty cycle bit switching has been achieved at 20 GHz with low switching energies and contrast ratio as high as10.4 dB.© 2003 Society of Photo-Optical Instrumentation Engineers.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:-f6ydRqryjwC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Reflective semiconductor optical amplifier pattern effect compensation with birefringent fiber loop",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-020-02485-4",
            "Abstract": "We experimentally explore and demonstrate the potential of a birefringent fiber loop (BFL) to compensate for the pattern effects (PE) induced in a reflective semiconductor optical amplifier (RSOA), which is driven by optical data whose intensity, temporal and spectral characteristics heavily stress the RSOA. By properly tailoring the BFL comb-like profile and adjusting the relative offset between the BFL maximum transmission and carrier signal position, the BFL improves the RSOA pattern-dependent performance even though the input pulses’ modulation bandwidth exceeds the 3 dB cut-off frequency of the RSOA optical response. The extensive set of obtained experimental results confirms the BFL capability to enhance the RSOA operation even under strong saturation, since the BFL acts in a beneficial manner on the amplified pulses by reducing their overshoot to an acceptable level, restoring their spectral position …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Necessary temporal condition for optimizing the switching window of the semiconductor-optical-amplifier-based ultrafast nonlinear interferometer in counter-propagating configuration",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-45/issue-11/115005/Necessary-temporal-condition-for-optimizing-the-switching-window-of-the/10.1117/1.2393089.short",
            "Abstract": "A comprehensive theoretical model of the semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) in counter-propagating configuration is presented. The model consists of a set of equations that describe the gain and phase dynamics of an SOA deployed as the nonlinear element in an interferometric switch. By undertaking an extensive numerical analysis, the transmission response of the UNI is calculated with respect to the key temporal parameters of the SOA transit time, the time delay between the two copies of the clock signal to be switched, and the width of the control pulses that alter the SOA properties. The obtained simulation results allow us to investigate the simultaneous influence of these parameters on the switching window and effectively correlate them to derive an operational condition that must necessarily hold in order to achieve satisfactory operation. The thorough study …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:BqipwSGYUEgC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Performance of single semiconductor optical amplifier-based ultrafast nonlinear interferometer with clock-control signals timing deviation in dual rail-switching mode",
            "Publication year": 2009,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-48/issue-8/085004/Performance-of-single-semiconductor-optical-amplifier-based-ultrafast-nonlinear-interferometer/10.1117/1.3202837.short",
            "Abstract": "The performance of a single semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer that is simultaneously driven by two ultrafast data streams with respect to the timing deviation between these signals and the standard clock input is theoretically studied and investigated. For this purpose, a numerical model is applied to simulate the operation of the specific module in pattern-operated dual rail-switching mode and under the presence of such imperfect synchronization. The thorough analysis and interpretation of the obtained results allows one to evaluate the impact of this temporal offset on the achievement of both bitwise logical correctness and high quality at the output. In this manner, the conditions that it must necessarily fulfill are derived and the dependence of its permissible margin and accordingly the way the latter can be extended is revealed, while its optimal amount for maximizing the …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:r0BpntZqJG4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Analyse de la modulation directe à travers un amplificateur optique à semi-conducteurs en présence d’un filtrage optique adapté",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=14751965299684417150&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-optical write/read memory for 20 Gbit/s data packets",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/document/852195/",
            "Abstract": "A writable all-optical memory for variable length, 20 Gbit/s data packets is demonstrated. The memory uses an ultrafast nonlinear interferometer (UNI) gate and does not perform data inverting in each pass. Regenerative storage with low switching energies is verified.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:WF5omc3nYNoC",
            "Publisher": "IET"
        },
        {
            "Title": "An Eigenanalysis Study of Tunable THz and Photonic Unbounded Structures Employing Finite Element Method",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8805115/",
            "Abstract": "This work aims at the establishment of a rigorous full-wave eigenmode analysis technique based on a finite element scheme for the study of terahertz (THz) or photonic/optical unbounded structures. This numerical tool follows the last decades' trend to migrate the technological knowledge from microwave to THz and photonic regimes. The performed eigenanalysis offers an insightful view of the studied structures, revealing their characteristics. For the truncation of the infinite solution domain, the first kind absorbing boundary conditions are employed, while the involved spurious modes are eliminated with the incorporation of a tree-cotree splitting formulation. The study focuses on tunable microring resonators supporting leaky-radiating wave propagation and bounded-resonating whispering gallery modes. Tunability is achieved by integrating an electro-optical layer and in turn through the enforcement of an external …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Échantillonnage par modulation tout-optique d’un train d’impulsions courtes dans un SOA-MZI appliqué à la transposition de fréquence",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02135621/",
            "Abstract": "Archive ouverte HAL - Échantillonnage par modulation tout-optique d’un train d’impulsions \ncourtes dans un SOA-MZI appliqué à la transposition de fréquence Accéder directement au \ncontenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL \nMédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org \nRevues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers \ndépôts Par type de publication Par discipline Par année de publication Par structure de recherche \nLes portails de l'archive Recherche Documentation hal-02135621, version 1 Communication \ndans un congrès Échantillonnage par modulation tout-optique d’un train d’impulsions \ncourtes dans un SOA-MZI appliqué à la transposition de fréquence Dimitrios Kastritsis 1, \n2 Thierry Rampone 2, 1 Kyriakos Zoiros 3 Ammar Sharaiha 2, 1 Détails 1 Lab-STICC - l…",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance investigation of all-optical clock recovery circuit based on Fabry-Pérot filter and semiconductor optical amplifier assisted Sagnac switch",
            "Publication year": 2007,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-46/issue-8/085005/Performance-investigation-of-all-optical-clock-recovery-circuit-based-on/10.1117/1.2768956.short",
            "Abstract": "A theoretical model is developed and exploited for characterizing the behavior of an all-optical circuit that deploys a Fabry-Pérot filter (FPF) and a semiconductor optical amplifier (SOA)-assisted Sagnac switch driven by an intense continuous wave (cw) holding beam to extract the clock signal from a received ultra-fast data stream. The role of each unit is thoroughly studied, and its understanding allows us to identify the critical operational parameters, which include the cw power, the energy of the data pulses, the SOA small signal gain, carrier lifetime and linewidth enhancement factor, the Sagnac loop asymmetry, and the finesse of the FPF. By means of numerical simulation, an extensive set of diagrams is derived, and from their interpretation the impact of these key factors on the amplitude modulation of the extracted clock pulses is investigated and evaluated. This process enables us to appropriately select and …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:bEWYMUwI8FkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Numerical simulation of semiconductor optical amplifier assisted Sagnac gate and investigation of its switching characteristics",
            "Publication year": 2004,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-43/issue-7/0000/Numerical-simulation-of-semiconductor-optical-amplifier-assisted-Sagnac-gate-and/10.1117/1.1751132.short",
            "Abstract": "The switching characteristics of a semiconductor optical amplifier (SOA)-assisted Sagnac gate are analyzed in terms of their critical performance parameters for full duty cycle operation from 10 to 40 GHz. Within this frame, the influence of the control pulse width, as well as of the SOA gain recovery time on the switching energy and the contrast ratio, is examined through numerical simulation. The obtained results show that full switching operation at 40 GHz or higher is feasible either by deploying gain recovery reduction techniques in bulk SOAs, or other alternative technologically advanced optical devices, such as quantum-dot SOAs.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:YsMSGLbcyi4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Investigation of nonreciprocal dispersion phenomena in anisotropic periodic structures based on a curvilinear FDFD method",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7707390/",
            "Abstract": "The aim of this paper is the investigation of nonreciprocal phenomena in anisotropically loaded 2-D periodic structures. For this purpose, our well-established 2-D curvilinear finite difference frequency domain method is combined with periodic boundary conditions and extended toward the eigenanalysis of periodic structures loaded with both isotropic and general anisotropic materials. The periodic structures are simulated in a 2-D domain, while uniformity is considered along the third axis. The propagation constant along the third axis can either be zero (in-plane-propagation) or nonzero (out-of-plane propagation). Particular effort was devoted to the identification of the appropriate irreducible Brillouin zone to be scanned during the eigenanalysis. It was herein realized that similar to geometrically artificial crystal anisotropy, the wave propagation directional asymmetries modify the irreducible Brillouin zone in the …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced performance of semiconductor optical amplifier at high direct modulation speed with birefringent fiber loop",
            "Publication year": 2014,
            "Publication url": "https://aip.scitation.org/doi/10.1063%2F1.4889869",
            "Abstract": "We employ a birefringent fiber loop (BFL) for enhancing the performance of a semiconductor optical amplifier (SOA) which is directly modulated. By properly exploiting the BFL comb-like spectral response, we show that the SOA can be directly modulated at a data rate which is more than five times faster than that enabled by the SOA electrical bandwidth. The experimental results, which include chirp measurements, demonstrate the significant improvements achieved in the performance of the directly modulated SOA with the help of the BFL.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:k_IJM867U9cC",
            "Publisher": "American Institute of PhysicsAIP"
        },
        {
            "Title": "On the design of ultrafast all-optical NOT gate using quantum-dot semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399211002611",
            "Abstract": "The feasibility of implementing an ultrafast NOT gate by means of a two-input Mach–Zehnder interferometer (MZI) that employs quantum-dot semiconductor optical amplifiers (QD-SOAs) is theoretically explored and shown. For this purpose a numerical treatment is conducted by modeling the propagation of strong pulses through a QD-SOA and the resultant change of the QD-SOA gain dynamics. This procedure allows to evaluate the impact of the critical parameters on the MZI complementary output port and find which is the most appropriate way to be selected and combined. The analysis of the simulation results reveals that with the non-data driven QD-SOA constantly held in the linear gain regime, the other QD-SOA, which is perturbed by the data to be logically inverted, must be operated in a nonlinear regime. This is defined by the drop of the specific QD-SOA gain by approximately 5.5 dB from its unsaturated …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Numerical study of carrier reservoir semiconductor optical amplifier-based all-optical XOR logic gate",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09500340.2021.1885760",
            "Abstract": "The long carrier lifetime of the semiconductor optical amplifier (SOA) limits its operation speed and exploitation as ultrafast nonlinear switching element. Therefore, an alternative SOA with a faster carrier lifetime is desired for high speed photonic applications. In this paper, we employ the carrier reservoir SOA (CR-SOA) for the first time to demonstrate through simulations the feasibility of all-optical exclusive-OR (XOR) logic gate at 100 Gb/s. For this purpose, a pair of CR-SOAs are incorporated in a Mach-Zehnder Interferometer. The variation of the quality factor (QF) against the key operating parameters is examined for both CR-SOAs- and conventional SOAs-based XOR gate at 100 Gb/s, including the effect of amplified spontaneous emission. The results show that not only higher but also acceptable QF is obtained at 100 Gb/s only when using CR-SOAscompared to conventional bulk SOAs, i.e. QF = 18.5 …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:8AbLer7MMksC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Simulation of ultrafast all-optical NOT gate with quantum-dot SOA-based Mach-Zehnder switch",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6041161/",
            "Abstract": "The feasibility of implementing an ultrafast NOT gate by means of a Mach-Zehnder switch that employs quantum-dot semiconductor optical amplifiers is theoretically investigated and demonstrated. The numerical simulation conducted for this purpose allows to find the permissible range of values for the critical parameters and a combination that is appropriate for realizing the specific Boolean function with high performance.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Session D-Broadband Experiences-Subsession D2-Broadband Infrastructures-The Path Towards All-Optical Packet Switching in Future Broadband Networks",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9980660983579727076&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:UxriW0iASnsC",
            "Publisher": "London: The Communications Network, c2002-c2006."
        },
        {
            "Title": "Theoretical investigation of 120 Gb/s all-optical AND and OR logic gates using reflective semiconductor optical amplifiers",
            "Publication year": 2021,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-60/issue-6/066107/Theoretical-investigation-of-120Gb-s-all-optical-AND-and-OR/10.1117/1.OE.60.6.066107.short",
            "Abstract": "The performance of all-optical (AO) logic AND and OR gates, which are realized for the first time using reflective semiconductor optical amplifiers (RSOAs) as nonlinear elements, is theoretically investigated at 120  Gb  /  s. The switching modules that incorporate the RSOAs and exploit their potential for AO signal processing are the Mach–Zehnder interferometer and the delayed interferometer for the AND and OR operations, respectively. A performance comparison between an RSOA and a conventional semiconductor optical amplifier (SOA) is made by examining and assessing the quality factor against the operational critical parameters, including the effect of the amplified spontaneous emission. The obtained results confirm that these Boolean functions based on RSOAs can be executed at the target data rate with better performance than if conventional SOAs were used instead.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:BrmTIyaxlBUC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Analysis and design of ultrahigh-speed all-optical semiconductor-optical-amplifier-assisted Sagnac recirculating shift register with an inverter",
            "Publication year": 2005,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-44/issue-6/065001/Analysis-and-design-of-ultrahigh-speed-all-optical-semiconductor-optical/10.1117/1.1925530.short",
            "Abstract": "The operation of a semiconductor-optical-amplifier-assisted Sagnac recirculating shift register with an inverter is studied theoretically and analyzed using a numerical model developed for this purpose. The impact of critical operational parameters, such as the SOA small-signal gain and carrier lifetime, the controlling pulses' energy and width, and the Sagnac loop asymmetry, on the switching energy and contrast ratio metrics is thoroughly investigated. The performance of the shift register is first evaluated at 10 GHz by comparing the simulated results against experimental ones, which reveals good agreement and proves the validity of the model. The model is then exploited to derive the optimum operating conditions in terms of the critical parameters that render feasible the extension of the storage capability to 20 GHz. The analysis demonstrates that the major limiting factor in achieving this goal is the SOA carrier …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:YOwf2qJgpHMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "On the feasibility of 320 Gb/s all-optical and gate using quantum-dot semiconductor optical amplifier-based Mach-Zehnder interferometer",
            "Publication year": 2013,
            "Publication url": "https://www.jpier.org/PIERB/pier.php?paper=13013108",
            "Abstract": "The feasibility of realizing an all-optical AND gate for 320 Gb/s return-to-zero data by incorporating quantum-dot semiconductor optical amplifiers (QD-SOAs) in a Mach-Zehnder interferometer (MZI) is theoretically investigated and demonstrated. The proposed scheme employs the QD-SOA-based MZI in a configuration where the QD-SOA in one MZI arm is subject to the first data sequence, the QD-SOA in the other MZI arm receives no such input but is constantly held in the small signal gain regime, and the second data stream is inserted from the common MZI port acting as enabling or disabling signal. Compared to other approaches adopted for the same purpose this implementation is more general, direct, flexible and affordable as only one strong data signal is required to control switching. By conducting numerical simulation the impact of the critical parameters on the Q-factor is thoroughly assessed. The obtained …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:IWHjjKOFINEC",
            "Publisher": "EMW Publishing"
        },
        {
            "Title": "Ultrafast performance of all-optical AND and OR logic operations at 160 Gb/s using photonic crystal semiconductor optical amplifier",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399219301756",
            "Abstract": "The light confined and controlled by photonic crystals (PCs) can be exploited to enhance the performance and reduce the size of semiconductor optical amplifiers (SOAs) in which they are embedded. By incorporating PCSOAs in a Mach-Zehnder interferometer, or using a PCSOA followed by a delayed interferometer, Boolean AND and OR gates are formed, respectively, whose performance when executed all-optically (AO) is thoroughly analyzed at 160 Gb/s. For this purpose, the variation of the quality factor against the critical data signal and PCSOA operating factors is examined and assessed when the effects of amplified spontaneous emission and working temperature are included to make the simulation more realistic. The results obtained from the conducted theoretical study suggest that leveraging the PCSOAs benefits of low absorption loss, suppressed undesirable nonlinear effects, low power consumption …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:u9iWguZQMMsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Theoretical analysis of pattern effect suppression in semiconductor optical amplifier utilizing optical delay interferometer",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401808002629",
            "Abstract": "The ability of an optical delay interferometer (ODI) to suppress the pattern effect that is inherently present in a straightforward, solitary semiconductor optical amplifier (SOA) whose dynamic response is slower than the period of its driving high-speed return-to-zero (RZ) data signal is theoretically investigated. For this purpose an existing comprehensive model that simulates and links the operation of these two elements is methodically applied to their concatenated configuration. In this manner an extensive set of curves is numerically obtained, which allow to analyze and assess the impact of the input pulse energy and width as well as of the SOA carrier lifetime, linewidth enhancement factor and small signal gain on the amplitude modulation of the transmitted sequence at the output of each one of these block units. Their thorough study and interpretation reveals that the employment of the ODI can significantly reduce …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:ufrVoPGSRksC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Semiconductor optical amplifier pattern effect suppression for return-to-zero data using an optical delay interferometer",
            "Publication year": 2010,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-49/issue-8/085005/Semiconductor-optical-amplifier-pattern-effect-suppression-for-return-to-zero/10.1117/1.3481137.short",
            "Abstract": "An optical delay interferometer (ODI) is employed to suppress the pattern effect manifested on a 10  Gb/s return-to-zero (RZ) data stream when amplified by a semiconductor optical amplifier (SOA) operated in deep gain saturation. The experimental results verify the competence of the scheme to confront the problem for this signal format by achieving a far better performance than that with the SOA alone.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:7PzlFSSx8tAC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "CONCEPTS AND TECHNOLOGIES FOR IMPLEMENTATION OF ALL-OPTICAL PACKET SWITCHING BROADBAND TELECOMMUNICATIONS NETWORKS",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=4166809577377348635&hl=en&oi=scholarr",
            "Abstract": "This chapter addresses the state-of-the-art all-optical signal processing concepts and technologies that are required to implement optical packet switching broadband telecommunications networks. Starting from the continuous growth of bandwidth demand that is fuelled by the massive use of Internet and multimedia applications, the attractive features of optical fibers that have rendered them the primary transmission medium are underlined and the modern optical multiplexing techniques that enhance their performance are presented. Particular attention is given on Wavelength Division Multiplexing and Optical Time Division Multiplexing concerning their advantages, problems, technical maturity and combination to effectively increase capacity. The evolution of telecommunications networks that rely on electronic switching is reported with emphasis on the bandwidth-handling mismatch between the optical layer and the higher Synchronous Digital Hierarchy and Internet Protocol layers. The perspectives of electronic switching are described focusing on the technical restrictions that are imposed by its use due to the inevitable opto-electrical conversions at the users\" nodes. The mandatory need for moving towards all-optical packet switching networks through the development and implementation of all-optical digital fiber logic modules is demonstrated and the fact that the adoption of this technological option is inevitable in order to provide versatile, high quality and reliable services is justified. The operation of semiconductor optical amplifier-assisted nonlinear interferometric configurations, which are the core elements for performing all-optical …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:blknAaTinKkC",
            "Publisher": "Nova Science Publishers"
        },
        {
            "Title": "10 simultaneously mode-locked and synchronized channels at 30 GHz from fiber ring laser",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2000-WM45",
            "Abstract": "The introduction of wavelength division multiplexing (WDM) to satisfy the increasing demand in the capacity of optical fiber network systems, has created an intense interest to demonstrate multiwavelength, high bit rate laser sources operating at 1.5 μm [1] and to qualify them in transmission experiments [2, 3]. Multi-wavelength sources have so far been demonstrated using spectrum slicing with LEDs [4], super luminescent diodes [5], amplified spontaneous emission from EDFAs [6] or supercontinuum generation in fiber [7].",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Eigenanalysis of a tuneable two-dimensional radiating array of wires covered with magnetized ferrite using a curvilinear FDFD method",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7302959/",
            "Abstract": "Computing of wave propagation and radiation through periodic band gap structures and their unique electromagnetic features attracted a huge research interest during the last decades. These features enabled the development of novel metamaterials and were exploited in frequency selective surfaces, phased arrays and numerous electromagnetic bandgap applications. Moreover, the metamaterials including photonic crystals are extensively investigated in the fields of optics, microwave, and antenna engineering due to their inherent possibility to develop novel devices that may not be found until now, [Huan Xie and Ya Yan Lu, J. Opt. Soc. Am. A 26, 2009, pp. 1606–1614]. Thus, the analysis and design of such structures have received particular attention which is almost exclusively directed toward the deterministic numerical simulations. Even though this analysis served as a very useful tool, it does not offer the …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical functions for microwave signal processing using SOA and SOA-MZI",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02469882/",
            "Abstract": "Optical functions for microwave signal processing using SOA and SOA-MZI - Archive ouverte \nHAL Accéder directement au contenu Accéder directement à la navigation Toggle navigation \nCCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation \nEpisciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil \nDépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de \npublication Par structure de recherche Les portails de l'archive Recherche Documentation \nhal-02469882, version 1 Communication dans un congrès Optical functions for microwave \nsignal processing using SOA and SOA-MZI Noor Hamdash 1, 2, 3 Dimitrios Kastritsis 1, 3 \nThierry Rampone 4 Ammar Sharaiha 5, 2 Kyriakos Zoiros 6 Denis Le Berre 7 Noham Martin \n8 Cédric Quendo 7 Détails 1 Lab-STICC - Laboratoire des sciences et techniques de l', de -'…",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of all-optical XOR gate with photonic crystal semiconductor optical amplifier-assisted Mach–Zehnder interferometer at 160 Gb/s",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401817305266",
            "Abstract": "The photonic crystal (PC) can be used to prohibit, confine, or control the propagation of light in a photonic band-gap. The performance of an ultrafast exclusive disjunction (XOR) gate-implemented with a photonic crystal semiconductor optical amplifier (PC-SOA)-assisted Mach–Zehnder interferometer (MZI) is numerically investigated and analyzed at a data rate of 160 Gb/s. The impact of the data signals and PC-SOA’s critical parameters on the output quality factor (Q-factor) is examined and assessed. The simulation results demonstrate that the XOR gate which is based on the proposed scheme is capable of operating at the target data rate with logical correctness and high quality. This is achieved with better performance than when having conventional SOAs in the MZI, which justifies employing PC-SOAs as nonlinear elements.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:D03iK_w7-QYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Design rules for implementation of 10-Gb/s all-optical Boolean XOR gate using semiconductor optical-amplifier-based Mach-Zehnder interferometer",
            "Publication year": 2004,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-43/issue-6/0000/Design-rules-for-implementation-of-10-Gb-s-all-optical/10.1117/1.1737376.short",
            "Abstract": "An all-optical Boolean XOR gate implemented with a semiconductor-optical-amplifier (SOA)-based Mach-Zehnder interferometer (SOA-MZI) is numerically simulated at 10 Gbits/s to extract simple design rules. If the control and clock energies and the small signal gain are properly selected, the metrics that define the quality of switching can be optimized for high gate performance.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:KlAtU1dfN6UC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Simulation of ultrafast all-optical XOR gate with SOA-based UNI and cascaded ODI",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6041162/",
            "Abstract": "The feasibility of employing an optical delay interferometer (ODI) to double the data rate of the conventional semiconductor optical amplifier-based ultrafast nonlinear interferometer configured as XOR gate is theoretically investigated and demonstrated. The numerical simulation conducted for this purpose allows to find the optimum temporal offset that must be inserted by the cascaded ODI in order to realize the specific Boolean function both with error-free and pattern-free performance.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of transport protocols in cloud data center networks",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11107-021-00946-8",
            "Abstract": "In recent years, cloud data centers have received increased attention by the research community, due to their key function of hosting a big number of cloud applications and services. At the same time, however, various and conflicting requirements have emerged, such as a mixture of different type of flows in shallow buffer switches, which are interconnected via fiber optics in many-to-one network topology. In this environment, the conventional transmission control protocol (TCP) exhibits severe performance degradation. In this paper, the issues affecting TCP performance in data center networks are studied and different congestion control schemes, such as CUBIC, DCTCP, HighSpeed, NewReno and Vegas, are presented and evaluated by means of computer simulations in realistic data center network scenarios. Our results show that DCTCP eliminates the performance problems of conventional TCP in data center …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Flexible high power Free Space Optical system for aircraft to ground communications",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6876612/",
            "Abstract": "Nowadays Free Space Optical (FSO) systems are a promising approach for a variety of applications such as interconnection of network nodes and as rapidly deployable communication systems in disaster recovery situations. In particular deploying FSO technology for mobile links between Unmanned Aerial Vehicles (UAVs) and fixed Ground Stations (GS) introduces several interesting challenges. In this paper, we investigate the ability of a mobile FSO system to operate in different atmospheric conditions. Specifically, we report a detailed optical amplification model able to support a constant Quality of Service for different distances from 1 km up to 35 km at 10 Gbps with 1550 nm wavelength. A high power optical amplifier and a low noise optical amplifier with adaptive power controlled are proposed that are able to support different environment attenuation factors. An extensive analysis among different distances for …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Realization of ultrafast all-optical NAND and XNOR logic functions using carrier reservoir semiconductor optical amplifiers",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11227-021-03876-4",
            "Abstract": "The conventional SOA suffers from the problem of the finite gain recovery time that limits its application at higher data rates. Therefore, in the present paper, we employ a carrier reservoir semiconductor optical amplifier (CR-SOA) as an alternative device to realize the all-optical NAND and XNOR logic gates for 120 Gb/s return-to-zero data, for the first time to our knowledge. For this goal, a pair of symmetrical CR-SOAs are incorporated in properly driven and combined Mach–Zehnder interferometers (MZIs), which constitute an appealing technological choice for all-optical switching purposes. The CR-SOA performance is compared against that of the conventional SOA for both considered logic gates. This is done by evaluating the quality factor and associated bit error rate, as well as the quality of the logic outcome. The results reveal the superiority of the CR-SOAs-based MZIs for realizing the logic NAND and XNOR …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Design of ultrafast all-optical pulsed-mode 2$$\\times $$× 2 crossbar switch using quantum-dot semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-016-0863-9",
            "Abstract": "An all-optical 2  2 crossbar switch capable of pulsed-mode operation and of handling ultrafast information is proposed and analytically designed. For this purpose, the quantum-dot semiconductor optical amplifier (QD-SOA)-based Mach–Zehnder interferometer (MZI) is employed as two-input two-output switching unit, in which the direction where the input data are forwarded is controlled by a single, purely lightwave excitation of alternating binary content. The performance of the crossbar switch under bitwise pulsed-mode of operation is thoroughly investigated and assessed by means of numerical simulation to find the range of permissible values of critical operating parameters. These parameters are distinguished depending on whether they affect the saturation level of the QD-SOA that is influenced by the optical control signal or translate the associated gain changes into differential phase shift between …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Proposal for all-optical NOR gate using single quantum-dot semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401811013630",
            "Abstract": "The feasibility of realizing an all-optical NOR gate for 160 Gb/s return-to-zero data pulses using a single quantum-dot semiconductor optical amplifier (QD-SOA)-based Mach–Zehnder interferometer is theoretically investigated and demonstrated. The proposed scheme exploits a modified Fredkin gate driven not only by the pair of data streams between which the Boolean NOR function is executed but by the complement of one of these signals as well. A numerical simulation is conducted to evaluate the performance of the scheme against the extinction ratio and find for which choice of the critical data signals and QD-SOAs parameters this metric becomes acceptable. Provided that the specified requirements are satisfied, which is technologically feasible, the NOR gate can be realized for data signals of the same wavelength both with logical correctness and high quality.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:LkGwnXOMwfcC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Operating speed extension of SOA external modulator using microring resonator",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=3037851127916415493&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cascaded semiconductor optical amplifiers-based all-optical OR logic gate",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1402-4896/abf18d/meta",
            "Abstract": "We present a novel study of the ultrafast performance of an all-optical OR logic gate using two-cascaded semiconductor optical amplifiers (SOAs) at a data rate of 80 Gb s− 1. The variation of the gate's quality factor (Q-factor) against various key operating parameters, such as the continuous wave input power and wavelength, the operating data rate and the equivalent pseudorandom binary sequence length, is examined and assessed, taking into account the effects of SOAs amplified spontaneous emission and operating temperature to obtain results that are closer to reality. The simulation results indicate that the OR logic gate can be realized using the proposed two-cascaded SOAs scheme at 80 Gb s− 1 with logical correctness and a Q-factor= 23.7, which is higher than that previously reported with other SOA-based schemes.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:LPZeul_q3PIC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Performance investigation of all-optical clock recovery circuit based on Fabry-Pérot filter and semiconductor optical amplifier assisted Sagnac switch",
            "Publication year": 2007,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-46/issue-8/085005/Performance-investigation-of-all-optical-clock-recovery-circuit-based-on/10.1117/1.2768956.short",
            "Abstract": "A theoretical model is developed and exploited for characterizing the behavior of an all-optical circuit that deploys a Fabry-Pérot filter (FPF) and a semiconductor optical amplifier (SOA)-assisted Sagnac switch driven by an intense continuous wave (cw) holding beam to extract the clock signal from a received ultra-fast data stream. The role of each unit is thoroughly studied, and its understanding allows us to identify the critical operational parameters, which include the cw power, the energy of the data pulses, the SOA small signal gain, carrier lifetime and linewidth enhancement factor, the Sagnac loop asymmetry, and the finesse of the FPF. By means of numerical simulation, an extensive set of diagrams is derived, and from their interpretation the impact of these key factors on the amplitude modulation of the extracted clock pulses is investigated and evaluated. This process enables us to appropriately select and …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:MXK_kJrjxJIC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "160 Gb/s photonic crystal semiconductor optical amplifier-based all-optical logic NAND gate",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11107-018-0776-6",
            "Abstract": "The performance of an ultra-fast all-optical logic NOT-AND gate using photonic crystal semiconductor optical amplifiers (PCSOA)-based Mach–Zehnder interferometers is numerically analysed and investigated. The dependence of the quality factor (Q-factor) on the input signals’ and PCSOA operating parameters is examined, with the impact of amplified spontaneous emission included so as to obtain realistic results. The achieved Q-factor is 18 at 160 Gb/s, which is higher than when using conventional SOAs.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "2 Tb/s all-optical gates based on two-photon absorption in quantum dot semiconductor optical amplifiers",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399218312362",
            "Abstract": "The performance of all-optical AND, OR, and NAND gates based on quantum dot semiconductor optical amplifiers (QDSOAs), which are either incorporated in properly configured Mach-Zehnder interferometer or combined with a delayed interferometer, is theoretically investigated at a data rate of 2 Tb/s when the nonlinear effect of two-photon absorption (TPA) is exploited in these active devices. The impact of the input signal and QDSOA key parameters on the quality factor (QF) is assessed. The obtained results indicate that these Boolean functions can be executed at 2 Tb/s with almost as twice as high QF than without TPA.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:KxtntwgDAa4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "SOA-assisted Sagnac switch and investigation of its roadmap from 10 to 40 GHz",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1027394606525",
            "Abstract": "Future broadband optical communications networks will rely on all-optical switches to perform a set of processing functions exclusively in the optical domain. Interferometric optical switches using semiconductor optical amplifier (SOA) nonlinearities can perform efficient optical switching with few tens of fJ control energies and short fiber lengths allowing for monolithic integration. In this paper we present work performed with a three terminal SOA-assisted Sagnac interferometer. We review all-optical Boolean AND and XOR logic results at 10 GHz and 10 Gb/s for full duty cycle and pseudo-random data pattern operation, respectively, achieved with adequate contrast ratios, remarkably low switching energies and low pattern dependence. The ability of the device to be cascaded was proved up to 10 GHz by recirculating stably for hours arbitrary pattern profiles. Finally, and in view of the extension of photonic …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Microring resonator design with application to performance improvement of optically or electrically modulated semiconductor optical amplifiers",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8259960/",
            "Abstract": "We propose to employ, through numerical simulations, a passive single-bus microring resonator (MRR) to suppress the pattern effect in an optically or electrically modulated semiconductor optical amplifier (SOA). The proposed scheme improves the quality of the amplified or encoded signal, respectively, while extending the SOA modulation rate in each case.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reduction of pattern-dependent amplitude modulation for RZ data in semiconductor optical amplifier with delay interferometer",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6292651/",
            "Abstract": "The pattern-dependent amplitude modulation in a semiconductor optical amplifier driven by return-to-zero (RZ) data is experimentally shown to be reduced using a delay interferometer (DI). Pulses of this format are amplified with far better performance than without the DI, as quantified by the measured reduction of the amplitude modulation from 1.6 dB to 0.29 dB and the enhancement of the eye diagram extinction ratio from 10.5 dB to 13.1 dB.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "10 x 30 GHz pulse train generation from semiconductor amplifier fiber ring laser",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/817457/",
            "Abstract": "A multiwavelength, fiber ring laser source, is demonstrated. It generates 10 wavelength channels, simultaneously mode-locked and synchronized at 30 GHz, each producing 7-ps pulses. The mode-locking technique relies on the gain saturation of the semiconductor amplifier from an external optical pulse train to impose the simultaneous mode-locking of the 10 wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of ultrafast all-optical 4-bit parity generator and checker using quantum-dot semiconductor optical amplifier-based Mach-Zehnder interferometer",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-013-0463-x",
            "Abstract": "The feasibility of implementing all-optically an ultrafast 4-bit parity generator and checker using the quantum-dot semiconductor optical amplifier (QD-SOA)-based Mach-Zehnder Interferometer (MZI) as XOR gate is theoretically investigated and demonstrated. The proposed circuit exploits an architecture where four XOR gates are concatenated in a modular manner. The first XOR gate drives the control input of the second one whose other control port receives the current bit of the word that undergoes parity processing. This interconnection is repeated up to the fourth XOR gate, on which an extra bit is applied. Depending on the binary value of this bit, the same circuit can operate both as parity generator and checker and support both even and odd parity. The performance of the scheme critically depends on the total amplitude modulation (AM) at its output. By conducting numerical simulation the impact of the …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Performance investigation of semiconductor optical amplifier-based ultrafast nonlinear interferometer in nontrivial switching mode",
            "Publication year": 2008,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-47/issue-11/115006/Performance-investigation-of-semiconductor-optical-amplifier-based-ultrafast-nonlinear-interferometer/10.1117/1.3028348.short",
            "Abstract": "The feasibility of operating the semiconductor optical amplifier (SOA)–based ultrafast nonlinear interferometer (UNI) in nontrivial switching mode is methodically investigated and demonstrated. For this purpose, a comprehensive model that simulates the dynamical behavior of an SOA subject to an ultra-high-speed pseudorandom binary sequence is appropriately adapted to the case of the specific configuration. By undertaking a detailed theoretical treatment, the impact of the most important SOA parameters on the fully loaded Q-factor is thoroughly analyzed and assessed, enabling us to extract useful design rules for their proper selection so as to ensure enhanced error-free performance at the desired output port of the considered interferometric arrangement. The outcome of this effort may assist the study and implementation of all-optical circuits and subsystems of nontrivial functionality, in particular with feedback …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Design rules for full pattern-operated all-optical XOR gate with single semiconductor optical amplifier-based ultrafast nonlinear interferometer",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5580344/",
            "Abstract": "The feasibility of implementing an ultrafast all-optical XOR gate using a single semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) is theoretically investigated and demonstrated. The numerical simulation conducted for this purpose allows to assess the impact of the involved critical parameters on the performance of the specific interferometric module in full data-loaded dual rail switching mode and extract basic design rules for pattern-free and error-free operation.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultrafast all-optical Boolean XOR logic using semiconductor optical amplifier-assisted Sagnac switch",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo-2005-JTuC61",
            "Abstract": "All-optical Boolean XOR logic is demonstrated using a semiconductor optical amplifier-assisted Sagnac switch for full duty cycle and bit pattern switching at 20 GHz and 20 Gb/s, with low signal energies and negligible pattern effect.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "BOOLEAN FUNCTIONS: ALL-OPTICAL IMPLEMENTATION USING QUANTUM-DOT SEMICONDUCTOR OPTICAL AMPLIFIERS IN MACH-ZEHNDER INTERFEROMETER",
            "Publication year": 2015,
            "Publication url": "https://search.proquest.com/openview/475b366008506df71b9e03562b334ca1/1?pq-origsite=gscholar&cbl=2034863",
            "Abstract": "Boolean functions provide the necessary framework for expressing the operation of logic gates, which are the key building units for the accomplishment of signal processing tasks in fundamental and system-oriented level. With the unceasing increase of digital information volume, the capability of executing these functions has been progressively evolved from electronics to photonics so as to avoid the severe constraints imposed in the former domain. This book chapter reviews how this can be done exclusively by means of light by exploring the novel technology of quantum-dot semiconductor optical amplifiers (QD-SOAs), which are incorporated in a switching structure formed by the Mach-Zehnder interferometer (MZI). For this purpose we initially present some state-of-the-art technologies that are available for realizing all-optically logic operations, with particular emphasis on the well-established option of SOAs. We …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Nova Science Publishers, Inc."
        },
        {
            "Title": "Technique de linéarisation pour un SOA-MZI dans un contexte d’échantillonnage tout-optique",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02469836/",
            "Abstract": "Technique de linéarisation pour un SOA-MZI dans un contexte d’échantillonnage tout-optique - \nArchive ouverte HAL Accéder directement au contenu Accéder directement à la navigation \nToggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API \nData Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org \nSupport hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par \ndiscipline Par année de publication Par structure de recherche Les portails de l'archive \nRecherche Documentation hal-02469836, version 1 Communication dans un congrès Technique \nde linéarisation pour un SOA-MZI dans un contexte d’échantillonnage tout-optique Dimitrios \nKastritsis 1 Thierry Rampone 2 Kyriakos Zoiros 3 Ammar Sharaiha 4, 5 Détails 1 Lab-STICC \n- Laboratoire des sciences et techniques de l'information, de la communication et de la 2 -…",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-optical signal processing and applications within the esprit project DO_ALL",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-23-2-781",
            "Abstract": "This paper reviews the work performed under the European ESPRIT project DO_ALL (Digital OpticAL Logic modules) spanning from advanced devices (semiconductor optical amplifiers) to all-optical modules (laser sources and gates) and from optical signal processing subsystems (packet clock recovery,optical write/store memory, and linear feedback shift register) to their integration in the application level for the demonstration of nontrivial logic functionality (all-optical bit-error-rate tester and a 2 x 2 exchange-bypass switch). The successful accomplishment of the project's goals has opened the road for the implementation of more complex ultra-high-speed all-optical signal processing circuits that are key elements for the realization of all-optical packet switching networks.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "10 simultaneously mode-locked and synchronized channels at 30 GHz from fiber ring laser",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2000-WM45",
            "Abstract": "The introduction of wavelength division multiplexing (WDM) to satisfy the increasing demand in the capacity of optical fiber network systems, has created an intense interest to demonstrate multiwavelength, high bit rate laser sources operating at 1.5 μm [1] and to qualify them in transmission experiments [2, 3]. Multi-wavelength sources have so far been demonstrated using spectrum slicing with LEDs [4], super luminescent diodes [5], amplified spontaneous emission from EDFAs [6] or supercontinuum generation in fiber [7].",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:Zph67rFs4hoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Execution of all-optical Boolean OR logic using carrier reservoir semiconductor optical amplifier-assisted delayed interferometer",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399221003182",
            "Abstract": "It is known that the conventional bulk semiconductor optical amplifier (SOA) faces the problem of the slow gain recovery time, which limits its application as a nonlinear element at higher data rates. Therefore, our goal is to find an alternative that works at higher rates with acceptable performance. In this paper, we employ, for the first time to our knowledge, a carrier reservoir SOA (CR-SOA) followed by a delayed interferometer (DI) to execute all-optically the Boolean OR operation at a data rate of 100 Gb/s. A performance comparison between the CR-SOA- and the conventional bulk SOA-based DI is made by studying the variation of the quality factor (Q-factor) against various key operating parameters, which include the transition time from the carrier reservoir to the active region, the population inversion factor, the injection current, the equivalent pseudorandom binary sequence length, the alpha-factor, the optical …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:D_sINldO8mEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ultrafast all-optical recirculating shift register with SOA-assisted Sagnac switch and SOA feedback",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO-2004-CTuP43",
            "Abstract": "An all-optical shift register is demonstrated at 10 GHz and 10 Gb/s using a Sagnac interferometer with two semiconductor optical amplifiers for nonlinear switching and feedback amplification. Arbitrary pattern profiles could recirculate stably for hours.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Suppression of pattern effect in semiconductor optical amplifier using birefringent fiber loop",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5996253/",
            "Abstract": "A birefringent fiber loop is employed to suppress the pattern effect in a semiconductor optical amplifier. By properly manipulating its spectral response the scheme enables to achieve significant performance improvements compared to direct signal amplification.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the feasibility of ultrafast all-optical NAND gate using single quantum-dot semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003039921200076X",
            "Abstract": "The feasibility of implementing an all-optical NAND gate for 160 Gb/s return-to-zero data pulses using a single quantum-dot semiconductor optical amplifier (QD-SOA)-based Mach–Zehnder interferometer is theoretically investigated and demonstrated. The proposed scheme exploits a modified Fredkin gate simultaneously driven by the pair of data streams between which the Boolean NAND function is to be executed, a sequence of continuous pulses and the complement of the first data input. The impact of the peak data power as well as of the QD-SOAs current density, small signal gain and electron relaxation time from the excited state to the ground state on the amplitude modulation of the switching outcome is explored and assessed by means of numerical simulation. The interpretation of the obtained results allows to specify the conditions under which the QD-SOAs must be biased to operate so that the defined …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Improving SOA direct modulation capability with optical filtering",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7550362/",
            "Abstract": "Semiconductor optical amplifiers (SOAs) have been receiving intense interest for use as external modulators in a variety of fundamental and advanced applications. However the employment of these modules for the target purpose is hindered by their limited modulation bandwidth. Motivated by this fact, in this invited paper we review the main outcome of our recent research on enabling the direct modulation of SOAs with improved performance at enhanced data speeds. In this context we present experimental and theoretical results that we have obtained by exploiting different types and combinations of optical filters. These filters include the birefringent fiber loop (BFL), either alone, in cascade with another BFL or assisted by an optical bandpass filter (OBPF), and a passive single microring resonator (MRR). To this end we demonstrate the capability of the schemes to efficiently overcome the pattern-dependent …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of high-speed TCP protocols in LTE X2 handover under realistic operational conditions",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-021-00784-z",
            "Abstract": "Broadband mobile networks have rapidly evolved over the last years. The unique environment they operate, however, sets new challenges for the Transmission Control Protocol (TCP). In this paper, we study the impact of Long Term Evolution (LTE) handover on TCP performance with different TCP congestion control algorithms and in a wide range of networks settings, including different handover types, random channel errors and support of error correction at lower layers. Our results suggest that the congestion control algorithms employed by TCP variants during the LTE X2 handover have different impacts on TCP performance. In particular CUBIC, Scalable TCP and BIC-TCP achieve high goodput and fast window convergence in available channel capacity after LTE X2 handover. In environments involving packet drops that are not corrected at lower layers and single errors with high probability, all TCP variants …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Performance analysis and improvement of semiconductor optical amplifier direct modulation with assistance of microring resonator notch filter",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11082-017-0954-2.pdf",
            "Abstract": "We demonstrate through numerical simulations that a passive single-bus microring resonator (MRR) employed as notch filter enables to directly modulate an ordinary semiconductor optical amplifier (SOA) at 10 Gb/s. This data rate constitutes a fourfold increase in the speed that it is possible to modulate the SOA due to its finite differential carrier lifetime. The theoretical analysis unveils how the MRR radius and detuning must be selected so that the MRR-based filtering scheme efficiently overcomes the pattern-dependent impairments incurred by the SOA narrow electrical bandwidth. Moreover, the small-signal analysis conducted to correlate the perturbations in power of the modulated optical signal inserted in the MRR with those at the MRR output confirms the enhancement in the electrical bandwidth of the SOA–MRR combination. Provided that the MRR response is tailored as suggested, which is …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Theoretical analysis of directly modulated reflective semiconductor optical amplifier performance enhancement by microring resonator-based notch filtering",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/259490",
            "Abstract": "We demonstrate the feasibility of using a single microring resonator (MRR) as optical notch filter for enabling the direct modulation of a reflective semiconductor optical amplifier (RSOA) at more than tripled data rate than possible with the RSOA alone. We conduct a thorough simulation analysis to investigate and assess the impact of critical operating parameters on defined performance metrics, and we specify how the former must be selected so that the latter can become acceptable. By using an MRR of appropriate radius and detuning, the RSOA modulation bandwidth, which we explicitly quantify, can be extended to overcome the RSOA pattern-dependent performance limitations. Thus, the MRR makes the RSOA-encoded signal exhibit improved characteristics that can be exploited in practical RSOA direct modulation applications. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:_xSYboBqXhAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Simulation of SOA-MRR-based equalization technique for FSO signals",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6935360/",
            "Abstract": "The feasibility of combining a semiconductor optical amplifier (SOA) with a single passive microring resonator (MRR) to equalize the amplitude and phase fluctuations of the distorted signal in free space optical (FSO) communications is theoretically investigated and demonstrated. The numerical simulation conducted for this purpose allows to specify the MRR radius and detuning so that the critical performance metrics are acceptable and the signal's quality is sufficiently restored.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "320 Gb/s all-optical XOR gate using semiconductor optical amplifier-Mach–Zehnder interferometer and delayed interferometer",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s11107-019-00844-0",
            "Abstract": "All-optical exclusive OR (XOR) gate with semiconductor optical amplifier (SOA)-Mach–Zehnder interferometer (MZI) and delayed interferometer (DI) is demonstrated at 320 Gb/s through numerical simulation and analysis. The performance of the XOR gate is investigated and evaluated against the quality factor (QF). The obtained results indicate that placing the DI in series with the SOA-MZI renders acceptable QF of the XOR outcome at the target data rate, as opposed to the case without the DI, where the achievement of the same goal is not possible.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Study on the instantaneous frequency deviation of pulses switched from semiconductor optical amplifier-assisted Sagnac interferometer",
            "Publication year": 2010,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-49/issue-7/075003/Study-on-the-instantaneous-frequency-deviation-of-pulses-switched-from/10.1117/1.3467484.short",
            "Abstract": "The instantaneous frequency deviation of the pulses switched from a semiconductor optical amplifier (SOA)-assisted Sagnac interferometer is theoretically studied and analyzed. By using explicit expressions for the phase response and its temporal derivative and applying a numerical model, a set of curves is obtained that allows us to investigate and assess the dependence of the function of interest on the critical operational parameters. From their interpretation, the basic design rules that must govern them in order for its profile to acquire a form suitable for practical exploitation are extracted. These suggest that the combination of the energy of the driving control pulses and the small signal gain of the SOA must be such that the latter is biased to operate up to the medium saturation regime. Moreover, the width of these pulses must not exceed 10% of their allocated time slot, while the role of the loop asymmetry and …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:j3f4tGmQtD8C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Q-factor assessment of SOA-based ultrafast nonlinear interferometer",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401807006438",
            "Abstract": "The performance of the semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) gated by an ultra high speed pseudorandom binary sequence is theoretically analyzed. For this purpose, a comprehensive model formed by a set of equations that describe the gain and phase evolution inside a SOA deployed as the nonlinear element in an interferometric switch is appropriately applied to this particular configuration. By undertaking a detailed numerical simulation, the impact of the SOA and input data key parameters on the Q-factor is thoroughly investigated and assessed enabling to extract useful design rules for their proper selection so as to optimize this metric. The calculations confirm the experimental evidence that the main technical limitation is imposed by the SOA carrier lifetime, which must be reduced below the bit period in order to avoid the deleterious consequences of the pattern …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:ULOm3_A8WrAC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "10-GHz all-optical recirculating shift register with semiconductor optical amplifier (SOA)-assisted Sagnac switch and SOA feedback",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-42/issue-9/0000/10-GHz-all-optical-recirculating-shift-register-with-semiconductor-optical/10.1117/1.1599363.short",
            "Abstract": "ConclusionsIn conclusion we have demonstrated an all-optical recirculating shift register with inverter at 10 GHz implemented using a SOA-assisted Sagnac switch with a second SOA to provide feedback. The device could operate stably holding a variety of patterns for hours without change, in this way proving that the switch is cascadable at 10 GHz. The use of the second SOA results in significant latency reduction compared to an EDFA and holds the promise for implementing short, integrated all-optical shift register devices, thus opening the road for the performance of high-speed “on-the-fly” processing in future photonic networks.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:_kc_bZDykSQC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Performance tolerance analysis of birefringent fiber loop for semiconductor optical amplifier pattern effect suppression",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00340-015-6051-y",
            "Abstract": "In this paper, we analyze the performance of the birefringent fiber loop (BFL) when the settings of the components that construct this module are not perfect. The BFL is employed for suppressing the pattern effect on directly amplified data in a semiconductor optical amplifier (SOA). The analysis is conducted by describing the non-optimum BFL transmission response using Jones matrix method. This allows to formulate a comprehensive model, which is validated by comparing it to the experiment. Then we investigate and specify how sensitive the BFL is to imperfections of its building components by assessing its performance against the output amplitude modulation, power penalty, and crosstalk. For each critical operating parameter, we derive the tolerance range within which these performance metrics are acceptable. The obtained results suggest that the BFL can efficiently mitigate the SOA pattern effect …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Performance investigation of pattern effect suppression in semiconductor optical amplifier using optical delay interferometer",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4610762/",
            "Abstract": "The ability of an optical delay interferometer (ODI) to suppress the pattern effect in a semiconductor optical amplifier (SOA) whose dynamic response is slower than the period of its driving high-speed return-to-zero (RZ) data signal is demonstrated through numerical simulation and theoretical analysis.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reflective semiconductor optical amplifier direct modulation capability enhancement using birefringent fiber loop",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/786194",
            "Abstract": "The feasibility of employing a birefringent fiber loop to enhance the performance of a directly modulated reflective semiconductor optical amplifier is experimentally demonstrated for the first time. The birefringent fiber loop acts as an optical filter of opposite slope than that of the reflective semiconductor optical amplifier electro-optical response and counteracts the finite reflective semiconductor optical amplifier modulation bandwidth of only 0.89 GHz. By proper adjustment of its detuning, the birefringent fiber loop tailors the spectral components that physically manifest due to the reflective semiconductor optical amplifier dynamic perturbation subject to direct modulation in the saturated gain regime, and suppresses the pattern-dependent distortions in the time domain. In this manner, the birefringent fiber loop manages to significantly improve the quality characteristics of the encoded signal at higher data rates than those enabled by the reflective semiconductor optical amplifier limited modulation capability. Owing to the birefringent fiber loop, the reflective semiconductor optical amplifier modulation range is extended to 4 Gb/s at the raw bit error rate of 1.0× 10− 9, and to 11 Gb/s at the forward error correction limit of 3.8× 10− 3. These results, which are unique against the evaluation criterion adopted in the first case, and the modulation speed achieved with post-filtering schemes in the second, highlight the beneficial role that the birefringent fiber loop can play in supporting reflective semiconductor optical amplifier operation for intensity amplification and modulation purposes. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Experimental and theoretical studies of a high repetition rate fiber laser, mode-locked by external optical modulation",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401800007082",
            "Abstract": "An experimental and theoretical study of a high repetition rate laser source operating on a novel mode-locking technique is presented. This technique relies on the fast saturation and recovery of a semiconductor optical amplifier induced by an external optical pulse and has been used to obtain 4.3 ps pulses at 20 GHz. A complete mathematical model of the fiber ring laser is presented describing the mode-locking process in the laser oscillator and providing solutions for the steady-state mode-locked pulse profile. The critical parameters of the system are defined and analyzed and their impact on the formation of the mode-locked pulses is examined. The comparison between the theoretical results and the experimental data reveals very good agreement and has allowed the optimization of the performance of the system in terms of its critical parameters.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:W7OEmFMy1HYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "All-optical pseudorandom binary sequence generator with TOAD-based D flip-flops",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401811004846",
            "Abstract": "An all-optical pseudo random binary sequence (PRBS) generator is designed using serially interconnected discrete Terahertz Optical Asymmetric Demultiplexer (TOAD)-based D flip-flops in a configuration exactly like the standard electronic setup. The performance of the circuit is evaluated through numerical simulation, which confirms its feasibility in terms of the choice of the critical parameters. The proposed scheme has been theoretically demonstrated for a 3-bit and 7-bit degree PRBS but can be extended to higher order by means of additional TOAD-based D flip-flops. Thus it can constitute an efficient solution for implementing all-optically a PRBS in an affordable, controllable and realistic manner.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:5nxA0vEk-isC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Simulation of all-optical logic XNOR gate based on quantum-dot semiconductor optical amplifiers with amplified spontaneous emission",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-013-9742-9",
            "Abstract": "The performance of all-optical logic XNOR gate has been simulated. XNOR operation is realized by using Mach–Zehnder interferometer utilizing semiconductor optical amplifiers (SOAs) with quantum-dot (QD) active region. The study is carried out when the amplified spontaneous emission (ASE) is included. Nonlinear dynamics including carrier heating and spectral hole-burning in the QD–SOA are taken into account together with the rate equations in order to realize the all-optical logic XNOR operation. Results show that the XNOR gate is capable of operating at data speed of 250 Gb/s with high output quality factor (-factor). The dependence of the output -factor on signals and QD–SOAs parameters is also investigated and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Performance investigation of all-optical Boolean XOR gate using semiconductor optical amplifier-based Mach-Zehnder interferometer",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OAA-2005-ME10",
            "Abstract": "An ultrafast all-optical Boolean XOR gate implemented with a semiconductor optical amplifier-based Mach-Zehnder interferometer is numerically simulated to provide simple design rules for the optimization of the metrics that define the quality of switching.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Performance of all-optical XOR gate based on two-photon absorption in semiconductor optical amplifier-assisted Mach–Zehnder interferometer with effect of amplified spontaneous emission",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-013-9807-9",
            "Abstract": "The performance of all-optical XOR gate is simulated and investigated. This Boolean function is realized by using a Mach–Zehnder interferometer (MZI) and exploiting the nonlinear effect of two-photon absorption (TPA) in semiconductor optical amplifier (SOA) incorporated in the MZI arms. By adjusting the input pulse intensities to be high enough, the TPA-induced phase change can be larger than the regular gain-induced phase change and hence support ultrafast operation in dual rail switching mode. The numerical study is carried out by taking into account the effect of amplified spontaneous emission (ASE). The dependence of the output quality factor (-factor) on critical data signals and SOAs parameters is examined and assessed. The obtained results confirm that the XOR gate implemented with the proposed scheme is capable of operating at a data rate of 250 Gb/s with logical correctness and high …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "FSO signal equalization using directly modulated SOA and dual MRR filtering",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8024826/",
            "Abstract": "Free Space Optical (FSO) communications are a promising alternative over conventional fiber-based wired systems. The unobstructed employment of this technology critically depends on its robustness against atmospheric impairments, such as scintillation. A semiconductor optical amplifier (SOA) in conjunction with optical filtering can act as amplitude equalizer to restore the quality of the impaired FSO signal. In this paper we propose to exploit as hard limiter a SOA whose current is directly modulated by non-return-to-zero (NRZ) electrical data pulses that correspond to the distorted FSO signal components. Moreover, we employ after the SOA two microring resonators (MRRs), which are configured as notch filters and are detuned toward opposite sidebands to mutually compensate for the SOA bandwidth-limited modulation response. The simulation results demonstrate the capability of the SOA-dual MRR-based …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical XOR, NOR, and NAND logic functions with parallel semiconductor optical amplifier-based Mach-Zehnder interferometer modules",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399218306066",
            "Abstract": "The performance of XOR, NOR, and NAND functions implemented all-optically (AO) using two parallel semiconductor optical amplifier (SOA)-based Mach-Zehnder interferometers is simulated and investigated. The dependence of the quality factor on key input signals and SOAs parameters is investigated and assessed. The obtained results show that the target AO Boolean functions can simultaneously be realized with the employed scheme with both logical correctness and high quality at 80 Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:abG-DnoFyZgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design optimization of all-optical actively mode-locked ring laser based on cross-gain modulation in a semiconductor optical amplifier",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030402605704095",
            "Abstract": "A complete and detailed model is presented that describes the main physical phenomena that occur in an actively mode-locked fiber ring laser based on cross-gain modulation in a semiconductor optical amplifier employed as both the gain medium and mode-locking element. The relationship between key laser parameters and the output pulse characteristics is numerically analyzed to provide simple design rules and derive a set of necessary operational conditions. The adoption of these rules and the satisfaction of these conditions enables the optimization of the laser performance and the generation of short and high energy mode-locked output pulses.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:TFP_iSt0sucC",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "SOA-MZI photonic sampler with a post-distortion linearization technique",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-29-15-23736",
            "Abstract": "We present a post-distortion linearization technique for a semiconductor optical amplifier Mach-Zehnder interferometer (SOA-MZI) photonic sampler. The sampling source is an active mode-locked laser producing 12.6 ps-width pulses with a repetition frequency of 10 GHz. The mathematical model for the linearization technique is presented and then evaluated for the quasi-static regime, i.e. sampling continuous-wave signals, and for the dynamic regime, i.e. sampling sinusoidal signals. A significant improvement in terms of total harmonic distortion (THD) equal to 23.4 dB is observed for a modulation index equal to 80% in the quasi-static regime, matching the highest observed THD improvement in the dynamic regime.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Complete theoretical analysis of actively mode-locked fiber ring laser with external optical modulation of a semiconductor optical amplifier",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401805005389",
            "Abstract": "We present a complete and extensive study of an actively mode-locked ring laser that uses a semiconductor optical amplifier (SOA) acting both as gain medium and mode-locker controlled by an external optical signal, including self-phase modulation (SPM) due to the SOA gain saturation by the recirculating mode-locked pulses and the associated imposed chirp. The operation of the different cavity elements is separately modelled and combined to obtain the self-consistent equation of mode-locking. The role of the critical parameters on the formation of the mode-locked pulses, which include the SOA linewidth enhancement factor, small signal gain and carrier lifetime, the external driving pulse width and energy and the bandwidth of the filter, as well as the simultaneous effect of SPM and dispersion is thoroughly investigated in order to specify the conditions that are required to obtain output pulses of short width and …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:roLk4NBRz8UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Correction to\" 10 x 30 GHz pulse train generation from semiconductor amplifier fiber ring laser\"",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/823521/",
            "Abstract": "In the above-named letter [ibid., vol. 12, pp. 25-27, Jan. 2000] the title on the table of contents was incorrect. The correct title is: \"10 x 30 GHz Pulse Train Generation From Semiconductor Amplifier Fiber Ring Laser.\"",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effect of lte handover on tcp performance over optical networks",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-16-0980-0_41",
            "Abstract": "High-speed mobile networks have rapidly evolved over the last years. The unique environment they operate, however, sets new challenges for the transmission control protocol (TCP). In this paper, we study the impact of long-term evolution (LTE) handover on TCP performance in a wide range of networks settings including different handover algorithms, random channel errors and support of error correction at lower layers. First, results indicate a severe TCP goodput reduction in most considered scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "1 Tb/s all-optical XOR and AND gates using quantum-dot semiconductor optical amplifier-based turbo-switched Mach–Zehnder interferometer",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-019-01329-z",
            "Abstract": "The turbo-switch (TS) architecture conceived for speeding up the response of conventional semiconductor optical amplifiers (SOAs) is combined for the first time with the exceptional ultrafast capability of quantum-dot (QD) SOAs. The possibility of exploiting this combination in the Mach–Zehnder interferometer (MZI) for implementing fundamental all-optical (AO) XOR and AND logic gates run at 1 Tb/s is numerically investigated, assessed, and verified. The simulation results demonstrate the superiority of the QDSOA-based TS-MZI scheme over its QDSOA-based MZI counterpart, as quantified by the improved quality factor, which can be achieved under more favorable operating conditions. The outcomes of the conducted theoretical treatment can help execute AO signal processing tasks with enhanced performance while keeping pace with the perpetual increase of single-channel data rates in an efficient and …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Simulation of directly modulated RSOA",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8010033/",
            "Abstract": "We apply a reduced but efficient model to simulate the operation of a directly modulated reflective semiconductor optical amplifier (RSOA). The numerical results allow us to investigate and assess how the RSOA responds to different data modulation rates and show trends for acceptable performance.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the feasibility of full pattern-operated all-optical XOR gate with single semiconductor optical amplifier-based ultrafast nonlinear interferometer",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401809003319",
            "Abstract": "The possibility of implementing an ultrafast all-optical XOR gate using a single semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) is theoretically investigated and demonstrated. For this purpose a comprehensive model that characterizes the performance of a SOA when it is successively driven by two strong pseudorandom binary sequences is applied to simulate the specific module under dual rail switching mode of operation. In this manner an extensive set of curves is obtained allowing to analyze and evaluate the impact of the input data, SOA and interferometer critical parameters on the fully loaded Q-factor. Their thorough study and interpretation reveals that the satisfaction of their requirements in order to render acceptable this metric is feasible from a technological perspective and thus if their selection is made according to the extracted guidelines then pattern-free and error …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Special issue on applications of semiconductor optical amplifiers",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/2076-3417/8/7/1185/htm",
            "Abstract": "During recent years, the technology of semiconductor optical amplifiers (SOAs) has remarkably been evolving and has matured to the point that it presently is established as a key enabler for the development, implementation, optimization, and overall establishment of photonic circuits, subsystems, and networks (see indicatively [1–16]). Owing to the remarkable advancements that have been achieved in the field, SOAs are commercially available devices that exhibit several important properties, such as strong nonlinearities, low power consumption, wavelength flexibility, large dynamic range, fast response, broadband and versatile operation, small footprint, and capability for scalable integration in single chips at affordable cost [17]. These attractive characteristics have rendered SOAs core elements for the accomplishment of critical and indispensable tasks at fundamental [18] and system-oriented [19] level. Thus, SOAs have widely been adopted both by the research community and the industrial sector as a principal technological platform for the realization of a diverse range of applications with high performance.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Semiconductor optical amplifier pattern effect suppression using a birefringent fiber loop",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5373930/",
            "Abstract": "The capability of a birefringent fiber loop to suppress the pattern effect in a semiconductor optical amplifier is experimentally demonstrated. The results verify that compared to direct signal amplification this scheme achieves reduced amplitude modulation, enhanced eye diagram extinction ratio, pulse reshaping, tolerance to long string of spaces, low power penalty, and extended input power dynamic range.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of reconfigurable ultrafast all-optical NOR and NAND gates using a single quantum-dot semiconductor optical amplifier-based Mach–Zehnder interferometer",
            "Publication year": 2012,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2040-8978/14/10/105401/meta",
            "Abstract": "The feasibility of implementing reconfigurable ultrafast all-optical NOR and NAND gates by employing a single Mach–Zehnder interferometer (MZI) with quantum-dot semiconductor optical amplifiers (QD-SOAs) is theoretically investigated. The reconfiguration of the scheme that allows conversion from one gate to the other is achieved by simply turning on or off a clock signal, while the complement of one of the data signals is used too as input for both gates. By conducting a numerical simulation, the conditions under which the QD-SOA-based MZI must be adjusted to operate so as to simultaneously ensure an acceptable extinction ratio for the NOR and amplitude modulation for the NAND are specified. This procedure is more demanding than when each gate is considered separately. Nevertheless it is possible to extract technologically realistic and achievable guidelines for the data signals and QD-SOAs …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:4TOpqqG69KYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Performance evaluation of optical channel transmission between UAVs and Ground Stations",
            "Publication year": 2016,
            "Publication url": "https://www.matec-conferences.org/articles/matecconf/abs/2016/04/matecconf_mceea2016_01005/matecconf_mceea2016_01005.html",
            "Abstract": "Free space optical (FSO) communications links is a promising solution for the provision of high data rate point to point communications. In particular deploying FSO technology for mobile links between Unmanned Aerial Vehicles (UAVs) and fixed Ground Stations (GS) introduces several interesting challenges. In this paper, we investigate the ability of a mobile FSO system to operate in different atmospheric conditions. Specifically, we characterize the quality of the optical channel with a proper model in terms of Bit Error Rate (BER) and average Signal to Noise Ratio (SNR) and we report a detailed optical amplification model able to support a constant Quality of Service for different distances from 1 km up to 35 km at 10 Gbps with 1550 nm wavelength. An extensive comparative analysis among different FSO configurations links considering the altitude of the UAV, the wavelength and the atmospheric conditions is …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:3s1wT3WcHBgC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "The finite difference frequency domain method for the eigenanalysis of open periodic structures",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7228770/",
            "Abstract": "The eigenanalysis of periodic stuctures is presented herein by extending our previous two - dimensional curvilinear frequency domain finite difference domain (FDFD) toward the eigenanalysis of open/radiating periodic structures. Initially, the open/radiating structures are simulated using the Perfectly Matched Layer (PML), while later Mur's Absorbing Boundary Conditions (ABC) will be introduced within the FDFD formulation. In parallel, the periodicity of the structure is accounted through the enforcement of Periodic Boundary conditions (PBC) within the FDFD formulation. The periodicity can be either in one or in two dimensions, while out of plane propagation is assumed along the third dimension with propagation constant different from zero.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconfigurable All-Optical Logic Gates (AND, NOR, NOT, OR) With Quantum-Dot Semiconductor Optical Amplifier and Optical Filter",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9198146/",
            "Abstract": "All-optical logic gates are indispensable modules for executing exclusively by means of light fundamental Boolean operations. Despite intense research in this field, most efforts have not treated these gates in a joint design and operating manner. This causes waste of hardware resources and lack of versatility. In this paper, we theoretically investigate, assess and demonstrate the feasibility of implementing all-optically multiple logic gates (AND, NOR, OR, NOT) at 160 Gb/s by means of a single quantum-dot semiconductor optical amplifier (QD-SOA) and a concatenated optical filter. We follow a methodical approach and conduct a thorough numerical study to derive rules for the selection of the critical operating parameters so that appropriate performance criteria defined for each gate are made acceptable. The intersection of the permissible bounds allows us to specify a combination of parameters’ values which is the …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design analysis of SOA-based UNI in non-trivial switching mode",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4598397/",
            "Abstract": "The feasibility of operating the semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) in non-trivial switching mode is theoretically investigated and demonstrated using for this purpose a comprehensive model. By conducting numerical simulation the impact of the involved critical parameters on the Q-factor is thoroughly investigated and assessed enabling to extract useful design rules for their proper selection so as to ensure error-free performance at the desired output port of the specific interferometric arrangement. The obtained results may assist the study and implementation of all-optical circuits and subsystems of enhanced functionality, in particular with feedback, in which the UNI employing a SOA as the nonlinear element is the core logical module.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of semiconductor optical amplifier-assisted Sagnac interferometer with full data dual output switching capability",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399210002367",
            "Abstract": "The ability of a semiconductor optical amplifier assisted Sagnac interferometer to support error-free as well as pattern-independent operation at both of its output ports simultaneously when all of the incoming data can potentially be switched to them is investigated and demonstrated. For this purpose a numerical model is used to simulate the operation of the considered module so as to identify under which working conditions this full data dual output switching mode is possible. The thorough analysis and interpretation of the results obtained from the evaluation of the impact that each critical parameter has on the defined performance metrics allows to infer that meeting at the limit the criterion for the Q-factor at both outputs is determined by the transmission port for all of them but the carrier lifetime, for which the reflection port prevails. However this is not enough to guarantee that the pseudo-eye diagrams acquire their …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Characterization and optimization of SOA-based UNI recirculating shift register switching window",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-007-9150-0",
            "Abstract": "The operation of an all-optical recirculating shift register implemented with the semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) in a counter-propagating, inverting configuration is methodically studied and analyzed. This is achieved by applying an appropriate model for a SOA deployed as the nonlinear element in an interferometric switch driven by ultrafast and strong feedback optical pulses. By means of numerical simulation the impact of the critical functional parameters on the formation of the switching window is thoroughly investigated and assessed enabling to provide useful design rules for their proper selection and combination so as to optimize the specific metric and ensure high performance. The undertaken theoretical treatment can be extended for characterizing other more complex all-optical circuits and subsystems of enhanced functionality that employ this …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The path towards all-optical packet switching in future broadband networks",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=4119548727944047161&hl=en&oi=scholarr",
            "Abstract": "Modern telecommunications networks are faced with an unprecedented bandwidth demand, which is fuelled by the tremendous growth of Internet and multimedia applications. This demand determines decisively the evolution of their structure, which must be such as to provide ideally the highest capacity with the lowest possible cost. Within this frame, optical fibre has been established as the preferred transmission medium, while WDM has been adopted as the means for fibre bandwidth efficient utilisation. WDM increases the capacity of installed fibres by simultaneously transmitting via the same single fibre multiple low-rate data streams (up to 40 Gbit/s) assigned to different wavelengths (> 100) 1. Moreover, the emerging optical time-division multiplexing (OTDM) techniques that multiplex in time domain secondary low data streams to obtain a higher one (640 Gbit/s or more) on a single wavelength2 will enhance …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:8k81kl-MbHgC",
            "Publisher": "THE COMMUNICATIONS NETWORK"
        },
        {
            "Title": "40 GHz mode-locked SOA fiber ring laser with 20 nm tuning range",
            "Publication year": 2000,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2000-TuR3",
            "Abstract": "High repetition rate, picosecond laser sources are key elements for WDM/OTDM transmission, switching and photonic network systems.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:lSLTfruPkqcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "All-optical XOR gate using single quantum-dot SOA and optical filter",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6651672/",
            "Abstract": "In this paper, we propose to implement an all-optical XOR gate for 160 Gb/s return-to-zero data signals using a single quantum-dot semiconductor optical amplifier (QD-SOA) assisted by a detuned optical filter (OF). These two elements are connected in series in a probe-dual pump configuration. By conducting numerical simulations, we thoroughly investigate and assess the impact of the critical performance parameters on the Q 2 -factor. The analysis of the obtained results against this metric enables us to specify the data signals peak power, QD-SOA small signal gain, current density, electron relaxation time from the excited state to the ground state and linewidth enhancement factor, and OF detuning, bandwidth and shape, for which the XOR logic is executed at the target data format and rate both with logical correctness and high quality. The confirmation of its design feasibility combined with its simplicity and …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design analysis and performance optimization of a Lyot filter for semiconductor optical amplifier pattern effect suppression",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6472012/",
            "Abstract": "In this paper, we analyze in detail, based on numerical modeling, the use of a Lyot filter to suppress the semiconductor optical amplifier (SOA) pattern effect. By formulating a robust design strategy, which is based on defining appropriate figures of merit and making the necessary tradeoffs between them, the filter performance can be optimized in terms of the wavelength spacing and detuning of its spectral response. The results obtained from this design procedure agree with experiment and enable us to accurately quantify to what degree the Lyot filter can resolve the SOA pattern effect problem.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Soliton all-optical logic AND gate with semiconductor optical amplifier-assisted Mach–Zehnder interferometer",
            "Publication year": 2016,
            "Publication url": "https://www.spiedigitallibrary.org/journals/Optical-Engineering/volume-55/issue-8/087109/Soliton-all-optical-logic-AND-gate-with-semiconductor-optical-amplifier/10.1117/1.OE.55.8.087109.short",
            "Abstract": "The concept of soliton provides a line in research in telecommunications systems. In the present study, a soliton all-optical logic AND gate with semiconductor optical amplifier (SOA)-assisted Mach–Zehnder interferometer has been numerically simulated and investigated. The dependence of the output quality factor (Q-factor) on the soliton characteristics and SOA parameters has been examined and assessed. The obtained results demonstrate that the soliton AND gate is capable of operating at a data rate of 80  Gb/s with logical correctness and high-output Q-factor.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:u_35RYKgDlwC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "On the design of all-optical gates based on quantum-dot semiconductor optical amplifier with effect of amplified spontaneous emission",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-013-9813-y",
            "Abstract": "The performances of all-optical logic XOR, AND and OR gates have been simulated. These Boolean operations are realized by using a Mach–Zehnder interferometer utilizing semiconductor optical amplifier (SOA) with quantum-dot (QD) active region. The study is carried out when the effect of amplified spontaneous emission is taken into account in the simulation analysis. Results show that these logic gates are capable of operating at a data speed of 250 Gb/s with high output quality factor (-factor). The dependence of the output -factor on signals and QD–SOA parameters is also investigated and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Simulation and design of ultrafast all-optical Boolean XOR gate with semiconductor optical amplifier-assisted Sagnac switch",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OAA-2005-ME9",
            "Abstract": "The critical operational parameters of an ultrafast all-optical Boolean XOR gate implemented with a semiconductor optical amplifier-assisted Sagnac switch are appropriately selected through numerical simulation to ensure optimum design and performance.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "On the Fairness of DCTCP and CUBIC in Cloud Data Center Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9493352/",
            "Abstract": "Data center networks (DCNs) hold a key role in information industry as the infrastructure for hosting cloud data services and related applications. The increasing number of customers using cloud services sets, however, new challenges for the efficient management of the DCN traffic handled by the transport protocols. TCP is adapted as the main transport control protocol in DCNs, but the standard congestion control algorithm it employs has been found to be very inefficient in providing a fair sharing of the available channel capacity among the competing DCN traffic flows. DCTCP and CUBIC are two promising TCP variants designed to resolve the fairness issues identified in these environments. In this paper, we evaluate the fairness properties of these two TCP variants in comparison to the conventional TCP Reno with the use of network simulator 3 (ns-3) in realistic DCN scenarios. Our results show that DTCP …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical Modeling of a High Repetition Rate Fiber Laser, Mode—Locked by External Optical Modulation of a Semiconductor Optical Amplifier",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35410-1_5",
            "Abstract": "A theoretical study of a high repetition rate laser source based on a novel mode — locking technique is presented. This technique relies on the fast saturation and recovery of a semiconductor optical amplifier induced by an external optical pulse and has been used to obtain 4.3 ps pulses at 20 GHz. A numerical model of the fiber ring laser has been developed describing the mode — locking process in the laser oscillator and providing solutions for the steady — state mode — locked pulse profile. The critical parameters of the system are defined and analyzed and their impact on the formation of the mode — locked pulses is examined. The comparison between the theoretical results and the experimental data reveals very good agreement and has allowed the optimization of the performance of the system in terms of these parameters.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Semiconductor optical amplifier dynamics and pattern effects",
            "Publication year": 2017,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781315152301-25/semiconductor-optical-amplifier-dynamics-pattern-effects-zoe-rizou-kyriakos-zoiros",
            "Abstract": "This chapter investigates the impact of different semiconductor optical amplifier (SOA) and signal operating conditions on the gain dynamics through experimental observations and numerical simulations. Many theoretical treatments have been conducted aiming at explaining the operation, understanding the dynamics, predicting the behavior, evaluating the performance, and optimizing the working conditions of SOAs. If the full-width at half-maximum is such that its difference from the pulses repetition interval is smaller than the SOA gain recovery time, then the strain imposed on the SOA gain dynamics is heavier. The distinctive properties of SOAs have revived interest for direct signal amplification purposes, which have traditionally been the primary target of SOAs. The characteristics of the encoded pulse stream are degraded as the rate of SOA direct modulation is increased due to the concomitant aggravation of …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Semiconductor optical amplifier pattern effect suppression using Lyot filter",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/document/5325132/",
            "Abstract": "The feasibility of employing a Lyot filter to compensate for the pattern effect in a semiconductor optical amplifier (SOA) is experimentally demonstrated. The operation mechanism relies on the control of its comb-like transfer function by proper adjustment of the wavelength spacing and detuning to suppress the spectral components broadened owing to SOA gain saturation. The scheme is experimentally demonstrated on amplified 10 Gbit/s return to zero data.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IET"
        },
        {
            "Title": "All-optical D flip-flop using single quantum-dot semiconductor optical amplifier assisted Mach–Zehnder interferometer",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-014-0632-6",
            "Abstract": "A scheme for an ultra-high speed all-optical D flip-flop based on single quantum-dot semiconductor optical amplifier (QD-SOA) assisted Mach–Zehnder interferometer (MZI) is proposed and its performance is theoretically investigated. The architecture of the all-optical circuit comprises of a properly driven and configured single QD-SOA-MZI with an external feedback loop. The impact of the input data pulse width as well as of the QD-SOAs length on the extinction ratio, contrast ratio, Q factor, relative opening of the pseudo-eye diagram and amplitude modulation of the switching outcome is explored and assessed by means of numerical simulations. The obtained results confirm the feasibility of the devised flip-flop scheme at a much higher data rate than that enabled by the conventional SOA-assisted MZI, with acceptable performance metrics.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Comparison of two photonic sampling mixer architectures based on SOA-MZI for all-optical frequency up-conversion",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8552871/",
            "Abstract": "An experimental comparison of the conversion gain and harmonic distortion performance between Switching and Modulation architectures of an all-optical photonic sampler mixer up-converter using a Semiconductor Optical Amplifier-based Mach-Zehnder Interferometer (SOA-MZI) is presented. The process of frequency up-conversion from 1 GHz to 9 GHz is evaluated. Because of their different principle of operation, the Switching architecture demonstrates higher positive conversion gain by approximately 6 dB and 8 dB for standard and differential configuration, respectively, while the Modulation architecture achieves lower harmonic distortion up to 8 dB, depending on the modulation index of the 1 GHz signal.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modulation and Switching Architecture Performances for Frequency Up-Conversion of Complex-Modulated Data Signals Based on a SOA-MZI Photonic Sampling Mixer",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-38-19-5375",
            "Abstract": "A theoretical and experimental performance analysis of a semiconductor optical amplifier-Mach–Zehnder interferometer (SOA-MZI) photonic sampling mixer used as a frequency up-converter is presented employing Switching and Modulation architectures. An active mode-locked laser, generating 2 ps-width pulses at a repetition rate equal to 10 GHz, is used as a sampling source. An optical carrier intensity modulated by a sinusoidal signal at 1 GHz is up-converted to 9 GHz and 39 GHz. High conversion gains (CGs) of about 15 dB are demonstrated for the frequency conversion to 9 GHz using both architectures, whereas up to 4 dB and 9 dB for the conversion to 39 GHz employing switching and modulation architectures, respectively. Small-signal equations for the up-converted signal in both architectures are formulated and developed, which permit to quantify the CG from closed-form expressions. The numerically …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the data rate extension of semiconductor optical amplifier-based ultrafast nonlinear interferometer in dual rail switching mode using a cascaded optical delay interferometer",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030399211000570",
            "Abstract": "The feasibility of increasing by a factor of two the data speed of the semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer in dual rail switching mode by means of a cascaded optical delay interferometer (ODI) is explored and shown through numerical simulation. From the theoretical analysis it has been found that such extension cannot be done without employing this passive element for any selection of the critical parameters but the SOA carrier lifetime, for which the requirements are yet very demanding. If, however, the time delay introduced by the ODI is adjusted to almost 1/3rd of the bit period, then the result of Boolean XOR operation can be improved for a specified range of parameter values, which can be further selected to be more relaxed than is possible when the ODI is not being used. The use of the ODI allows both error-free and pattern-free performance at the output of the …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:HDshCWvjkbEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Experimental demonstration of all-optical SOA-assisted Sagnac recirculating shift register with an inverter and SOA feedback",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030402604702727",
            "Abstract": "We report the operation of an all-optical recirculating shift register with an inverter at 10 Gb/s using a Sagnac interferometer with a semiconductor optical amplifier (SOA) as the nonlinear switching element and a second SOA to provide feedback. Binary pulse patterns were stored in the memory circuit recirculating stably for periods of several hours. The demonstration of this simple optical loop memory proves also the cascadability of the SOA-assisted Sagnac switch.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:aqlVkmm33-oC",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "FDFD eigenanalysis of non-reciprocal periodic structures",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7366019/",
            "Abstract": "A two dimensional Finite Difference Frequency Domain (2D-FDFD) eigenanalysis of an array consisting of periodically located strips printed on axially magnetized ferrite film is presented. The main interest in these structures arises from our previous study which revealed their support of backward surface and possibly backward leaky waves. Moreover these structures exhibit non-reciprocal phenomena. These phenomena are studied thoroughly by using our two - dimensional curvilinear frequency domain finite difference (2D-FDFD) method, modified appropriately for the eigenanalysis of periodic structures. The present effort is particularly focused on the study of the non-reciprocal phenomena involved in periodic structures loaded with magnetized ferrites.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ultra-high speed all-optical shift registers and their applications in OTDM networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s11082-004-2040-9",
            "Abstract": "All-optical shift registers are basic building modules for the development of ultra-high speed optical time division multiplexing networks. In this paper, we review the progress that has been made in this cutting-edge technology, focusing on implementations that exploit the attractive features of semiconductor optical amplifier (SOA)-based interferometric configurations. We present regenerative storage performed with an all-optical recirculating shift register with an inverter at 10 Gb/s using a SOA-assisted Sagnac switch and a second SOA to provide feedback. We demonstrate also an all-optical memory based on the SOA-assisted Ultrafast Nonlinear Interferometer capable of reading/writing 20 Gb/s packets of variable length without data inversion. These registers can find application in the development of two nontrivial complex all-optical circuits of enhanced functionality. The first is an all-optical …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Evaluation and optimization of SOA-based UNI Q-factor",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4296397/",
            "Abstract": "The performance of the semiconductor optical amplifier (SOA)-based ultrafast nonlinear interferometer (UNI) gated by an ultra-high speed pseudorandom binary sequence is theoretically analyzed using a comprehensive model developed for this purpose. By conducting numerical simulation, the impact of the SOA and input data critical parameters on the Q-factor is thoroughly investigated and assessed enabling to extract useful design rules for their proper selection so as to optimize this performance metric and ensure error-free operation.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "1 Tb/s high quality factor NAND gate using quantum-dot semiconductor optical amplifiers in Mach–Zehnder interferometer",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10825-014-0567-y",
            "Abstract": "The performance of all-optical logic NAND gate realized by employing quantum-dot semiconductor optical amplifiers (QD-SOAs)-based Mach–Zehnder interferometers (MZI) is numerically simulated. Boolean NAND operation is achieved by a series combination of properly configured and driven QD-SOAs-MZIs. The theoretical study is carried out by taking into account the effect of amplified spontaneous emission. The dependence of the output -factor on data signals and QD-SOA parameters is investigated and discussed. The obtained results indicate that the NAND gate is capable of operating at 1 Tb/s with high output quality factor (-factor) provided that these parameters are properly optimized.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Signal amplitude and phase equalization technique for free space optical communications",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6602798/",
            "Abstract": "We propose a technique for equalizing the amplitude and phase fluctuations of the distorted signal in free space optical (FSO) communications. The technique exploits the dynamic characteristics of a semiconductor optical amplifier (SOA) together with the interferometric properties of a cascaded optical delay interferometer (ODI). By conducting numerical simulation we have investigated the impact of the SOA and ODI critical operating parameters on the performance of the FSO communication system. The obtained results confirm the feasibility of the scheme and its capability of efficiently mitigating the amplitude and phase variations, as quantified by the achievement of acceptable metrics. Thus the technique can enhance the robustness of FSO links against atmospheric impairments, including scintillation, and allow for better quality and more reliable interconnections.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semiconductor optical amplifier direct modulation with double-stage birefringent fiber loop",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00340-016-6426-8.pdf",
            "Abstract": "The feasibility of cascading two birefringent fiber loops (BFLs) for directly modulating a conventional semiconductor optical amplifier (SOA) at a faster data rate than that being possible by its limited electrical bandwidth is demonstrated for the first time. The experimental results reveal the improvements in the quality characteristics of the encoded signal compared to those achieved with a single-stage BFL. The observed trends are complemented by numerical simulations, which allow to investigate the impact of the double-stage BFL detuning and specify how this critical parameter must be selected for enhanced performance. Provided that it is properly tailored, the proposed optical notch filtering scheme efficiently compensates for the pattern-dependent SOA response and enables this element to be employed as intensity modulator with improved performance at enhanced data speeds.",
            "Abstract entirety": 1,
            "Author pub id": "KcVeVFkAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "The role of photonics technology in the implementation of future broadband telecommunications networks",
            "Publication year": 2003,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/15623",
            "Abstract": "The role of photonics technology in the implementation of future broadband \ntelecommunications networks Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό \nΑποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση Τεκμηρίου HEAL \nDSpace The role of photonics technology in the implementation of future broadband \ntelecommunications networks Αποθετήριο DSpace/Manakin The role of photonics \ntechnology in the implementation of future broadband telecommunications networks \nHoubavlis, T; Zoiros, KE URI: http://hdl.handle.net/123456789/15623 Ημερομηνία: 2003 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο \nΠροβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο \nεμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Περιήγηση Σε \nόλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Τίτλοι /…",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the compensation of chirp induced from semiconductor optical amplifier on RZ data using optical delay interferometer",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401811003634",
            "Abstract": "The capability of an optical delay interferometer (ODI) to compensate the chirp induced on return-to-zero pulses amplified by a semiconductor optical amplifier (SOA) when operated under stressful conditions for its gain dynamics is investigated and demonstrated through extensive numerical simulation. The phase response of the ODI, which through its variation per time increment determines the chirp, is calculated at its crossed output port using an explicit expression. The theoretical analysis reveals that cascading the ODI after the SOA can reduce both the magnitude of the chirp and the variations of its peaks as well as those of the amplified pulses while ensuring error-free performance even for a tight combination of the critical parameters. In order for this goal to be successfully accomplished while not distorting the pulses acted on by the ODI the offset introduced by this passive element is computationally found …",
            "Abstract entirety": 0,
            "Author pub id": "KcVeVFkAAAAJ:4DMP91E08xMC",
            "Publisher": "North-Holland"
        }
    ]
}]