[{
    "name": " Νικόλαος Πελεκάνος",
    "romanize name": " Nikolaos Pelekanos",
    "School-Department": "Επιστήμηης και Τεχνολογίας Υλικών",
    "University": "uoc",
    "Rank": "Καθηγητής",
    "Apella_id": 7389,
    "Scholar name": "Nikos Pelekanos",
    "Scholar id": "Uj9w0jUAAAAJ",
    "Affiliation": "Professor",
    "Citedby": 4204,
    "Interests": [
        "Nanophotonics",
        "Optoelectronics",
        "Semiconductor Nanostructures"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Uj9w0jUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Widely tunable light-emitting diodes by Stark effect in forward bias",
            "Publication year": 2002,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1503403",
            "Abstract": "By band gap engineering of the active region of a light-emitting diode, we were able to induce, in forward bias, large space-charge electric fields that generated Stark shifts over 100 nm in the 900 nm spectral region. These shifts are analyzed in terms of inhomogeneous carrier distribution throughout the active region.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Reduced threshold current in  grown  laser diodes: The positive role of piezoelectric effect",
            "Publication year": 2007,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2716214",
            "Abstract": "The authors demonstrate that (111)B grown InGaAs∕AlGaAs laser diodes outperform their (100) counterparts, in terms of lower threshold currents observed for all temperature and cavity lengths tested. A low temperature threshold current density as low as 15A∕cm2 has been observed in (111)B grown devices, whereas identical (100) laser diodes exhibited threshold in the range of 30–40A∕cm2. The comparison of experimental findings with a Poisson-Schrödinger self-consistent model reveals that the improved performance of the (111)B devices is attributed to the piezoelectric field present in the (111)B In0.1Ga0.9As active quantum well as well as to the different heavy hole effective masses in the (111)B configuration.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:M05iB0D1s5AC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Polarization Resolved Single Dot Spectroscopy of (211) B InAs Quantum Dots",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3666431",
            "Abstract": "We report on single dot spectroscopy of (211)B InAs quantum dots, grown by molecular beam epitaxy. The dots exhibit sharp emission lines, the origin of which has been identified. Polarization dependent microphotoluminescence spectra confirm fine structure splittings from 20μeV down to the determination limit of our setup (10 μeV).",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:D_sINldO8mEC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Semiconductors II: Surfaces, interfaces, microstructures, and related topics-Selective measurement of hole tunneling times through AlGaAs barriers based on the quantum confined Stark effect (5",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=7419809258232024200&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Woodbury, NY: published by the American Physical Society through the American Institute of Physics, c1998-"
        },
        {
            "Title": "GaN quantum dots: from basic understanding to unique applications",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/016/meta",
            "Abstract": "The GaN self-assembled quantum dots constitute a very special and intriguing type of semiconductor nanostructure, mainly because they carry in their structure a giant internal electric field that can reach a value up to 7 MV/cm. In this report, we review the most important structural and optical properties of GaN quantum dots, and we discuss their advantages and limitations for blue-UV optoelectronic applications.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:SdhP9T11ey4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Non-polar GaN/AlGaN quantum-well polariton laser at room temperature",
            "Publication year": 2021,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.104.125311",
            "Abstract": "We demonstrate room temperature (RT) polariton lasing in an all-dielectric microcavity containing non-polar III-nitride quantum wells (QWs) as active media. The microcavity is fabricated using the photo-electrochemical etching method, by which an optimally grown m-plane III-nitride active region is detached from the substrate in the form of a membrane, which is subsequently inserted between two Si O 2/Ta 2 O 5 distributed Bragg reflectors, with 4 and 10 pairs for the top and bottom mirrors, respectively. The active region consists of 25 GaN/Al 0.1 Ga 0.9 N (5 nm/3 nm) QWs. The produced microcavities exhibit two closely spaced polarization-resolved lower polariton branches at RT, in line with the selection rules of the non-polar orientation, having a Rabi splitting of 62 and 72 meV in the E∥ a and E∥ c polarizations, respectively. In a positively detuned 3λ/2-thick microcavity, polariton lasing is observed at ambient …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:uc_IGeMz5qoC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Piezoelectric effects in semiconductor heterostructures: applications and consequences",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269202000204",
            "Abstract": "The piezoelectric (PZ) effect in strained semiconductor heterostructures can be used as an additional degree of freedom in designing novel heterostructures with desired optoelectronic properties. After a short review of previous work in the field, we discuss two examples in which the presence of the PZ field is either beneficial or unwelcome. First, we present a wavelength-tunable laser diode whose tuning mechanism is based on the quantum confined Stark effect and we show that the tuning range of the device can be significantly enhanced if the active quantum well contains a PZ field. Next, we discuss the case of nitride heterostructures where unwanted polarization-induced electric fields limit seriously their performance in optoelectronic applications. We show that the use of quaternary nitrides can help circumvent this problem.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Micro-Raman characterization of In {sub x} Ga {sub 1-x} N/GaN/Al {sub 2} O {sub 3} heterostructures",
            "Publication year": 2005,
            "Publication url": "https://www.osti.gov/biblio/20719633",
            "Abstract": "In{sub x}Ga{sub 1-x}N/GaN/Al{sub 2}O{sub 3} (0001) heterostructures with x=10.5%, 13.5%, 19.0%, 19.6%, and 26.5% are studied, by polarized micro-Raman spectroscopy, under plane and side backscattering geometries. The combination of both scattering geometries, together with variable excitation wavelengths, enabled the possibility to check independently strain-vs-depth distribution and selective-resonance effects from In-rich regions. Several Raman modes have been detected and were attributed to either the GaN or the InGaN films. Particular modes, which are not permitted in the bulk materials, are activated in the InGaN layers. Shifts of the frequencies relative to the ones expected in the bulk materials are explained as due to the elastic strains present in the hetero-structures. The results are evaluated in combination with compositional RBS analysis and the strain values obtained are compared with high resolution x-ray diffraction results including reciprocal space mapping, leading to very good consistency between Raman and XRD. Consequent relaxation values are obtained and the underlying mechanisms are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ultra-smooth GaN membranes by photo-electrochemical etching for photonic applications",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10853-014-8071-0",
            "Abstract": "Photo-electrochemical, bandgap selective, lateral etching is used to create 200 nm-thick, ultra-smooth GaN membranes, containing 10 pairs of GaN/AlGaN quantum wells. The use of electrolyte concentrations as low as 0.0004 M, along with appropriate excitation power and bias conditions, are shown to enhance the quality of freestanding membranes immensely, with an AFM roughness of 0.65 nm; the best ever reported value for GaN membranes fabricated using a similar technique. Transmission and photoluminescence experiments on these membranes were made possible at cryogenic temperatures by membrane transferring onto a double-side polished sapphire substrate, revealing pronounced excitonic features; the analysis of which strongly suggest that the absorption coefficients of GaN are at least 30 % higher than the values previously reported in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Negative bi-exciton binding energy in (211) B InAs/GaAs piezoelectric quantum dots",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=PhAST-2007-JTuA6",
            "Abstract": "We report on isolated dot spectroscopy of polar (211) InAs/GaAs quantum dots grown by MBE. Exciton and biexciton peaks have been identified, revealing a negative biexciton binding energy attributed to the presence of strong piezoelectric field.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:VLnqNzywnoUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Absorption in ultrathin GaN-based membranes: The role of standing wave effects",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5112173",
            "Abstract": "A methodology is described to extract the absorption coefficient spectrum and exciton oscillator strength of GaN layers and GaN/AlGaN quantum wells by analyzing microtransmittance experiments in high-quality, free-standing membranes with thicknesses in the 160–230 nm range. The absorbance of a subwavelength GaN membrane is found to be an oscillating function of its thickness, in keeping with the standing wave effect. We analyze our results using two alternative models including interference effects and extract identical absorption coefficient values. The room-temperature absorption coefficient of bulk GaN membranes at the main exciton peak is found to be 9 × 104 cm−1. In the case of GaN/AlGaN quantum wells, the enhancement and blue shift of the excitonic absorption are observed, as a result of quantum confinement.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:-_dYPAW6P2MC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Tunable laser diodes by Stark effect",
            "Publication year": 2003,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1602561",
            "Abstract": "We demonstrate wavelength tuning of a laser diode (LD) by the quantum-confined Stark effect. This is achieved by introducing tunneling barriers in the LD active region, as a result of which significant space-charge fields are generated during current injection, modulating the gain spectrum of the “lasing” quantum well. In such a “modified” InGaAs/AlGaAs LD, we observed up to 5-nm Stark-tuning of the lasing wavelength in the 900-nm spectral region.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Direct MBE growth of GaN on GaAs substrates for integrated short wavelength emitters",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1369800100000767",
            "Abstract": "The growth and material properties of GaN heteroepitaxial layers on vicinal (1 0 0) and exact (1 1 1)B substrates have been investigated, using molecular beam epitaxy (MBE) with N2 RF-plasma source. We examined the approach to grow GaN directly on the oxide desorbed GaAs, without the incidence of an As beam during oxide desorption or the following stages of growth. Perfect smooth surfaces were obtained on (1 1 1)B GaAs but excellent luminescence properties were observed on vicinal (1 0 0) GaAs. Four growth temperatures (TG) were compared for the (1 0 0) orientation and a monotonic increase of photoluminescence intensity with increasing TG, in the range of 570–680°C, was observed. The best surface morphology of less than 10 nm rms roughness was also determined, by atomic force microscopy, for the maximum (680°C) temperature. The layers exhibited up to 1017 cm−3 electron concentration …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Spatial nonuniformity of excitonic properties in exfoliated WS2 monolayers",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8087721/",
            "Abstract": "Summary form only given. Monolayers of transition metal dichalcogenides (TMDs) are promising new materials for future 2D nanoelectronic systems. 1  With their tunable direct gap in the visible range of the optical spectrum and high surface-to-volume ratio, these 2D semiconducting systems are ideal for field-effect transistors, photovoltaics, light-emitting diodes (LEDs), single-atom storage, molecule sensing, quantum-state metamaterials and electrocatalytic water splitting applications. 2  Furthermore, the outstanding stretchability of 2D crystals is promising for strain engineering and related applications.Here, we report on the extraordinary photoluminescence (PL) and Raman properties, not only of the physical but also of intentionally created via femtosecond laser ablation4, boundaries of mechanically exfoliated WS2 monolayers. In particular, it is shown that the edges of such monolayers exhibit significant Raman …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3‐D Strain Fields in Low‐Dimensional III–V Semiconductors: A Combined Finite Elements and HRTEM Approach",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.201700409",
            "Abstract": "A versatile route toward the study of strain fields of low‐dimensional III–V semiconductor nanostructures is presented, by combining quantitative high‐resolution transmission electron microscopy (HRTEM) observations with the finite elements method (FEM). FEM facilitates a fast and straightforward three‐dimensional (3‐D) analysis of elastic properties for various growth orientations and compositional profiles down to the nanoscale. FEM calculations are employed to simulate elastic stress–strain fields of III–V cubic heterostructures comprising InAs surface and buried quantum dots (QDs) grown on GaAs(211)B substrates, and (111)‐oriented GaAs/AlxGa(1−x)As core–shell nanowires (NWs) on Si. The results are compared with experimental strain maps obtained from HRTEM images by geometric phase analysis (GPA), as well as with molecular dynamics (MD) atomistic simulations. In the former, the compositional …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Growth and characterisation of self-assembled cubic GaN quantum dots",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921510700007637",
            "Abstract": "Self-assembled cubic GaN quantum dots have been grown by plasma-assisted molecular-beam epitaxy on cubic AlN. Atomic force microscopy and transmission electron microscopy reveal islands of a mean height of 1.6 nm and a mean diameter of 13 nm. The influence of stacking faults on island nucleation is discussed. The quantum dots show ultraviolet photo- and cathodo-luminescence with no thermal quenching up to room temperature.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:mB3voiENLucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Monolithic integration of nitride-based transistor with Light Emitting Diode for sensing applications",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931711004941",
            "Abstract": "A novel monolithically-integrated LED and HEMT sensor, based on III-nitrides, is designed and realized. The main aspects of the design and processing issues of such a device are presented and discussed. Satisfactory operation of both LED and HEMT parts of the device was ascertained by means of electrical characterization. The best obtained turn-on voltage for the LED part of the device was as low as ∼4.5 V, which is quite acceptable for nitrides, while the IDSsat value of ∼26 mA/mm for the HEMT part, is rather low as compared to typical AlGaN/GaN HEMTs. Moreover, intense light emission was readily obtained from the LED, with a large portion of light illuminating the sensor active area. The overall satisfying performance of the integrated device opens the way for actual sensing experiments to be performed.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Influence of polarization field on the lasing properties of III-nitride quantum wells",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138694770500603X",
            "Abstract": "A theoretical investigation of the effect of polarization-induced fields on the optoelectronic properties of a 3 nm In0.2Ga0.8N/GaN single quantum well has been carried out via a self-consistent solution of Schrödinger–Poisson equations within the effective mass approximation. A pronounced, non-monotonic dependence of the threshold current density Jth on the well width has been found due to the enhanced quantum-confined Stark effect. Furthermore, the dependence of threshold current density on the value of the electric field in the well was examined. The threshold current in the 3 nm In0.2Ga0.8N/GaN well is higher by a factor of 2–5 compared to an identical well with zero internal field Eint. We show that the ability to reduce or eliminate internal fields appears attractive for the improvement of the optoelectronic properties of nitride-based laser diodes and one of achieving this is by using field-compensated …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:WF5omc3nYNoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Extraction of absorption coefficients from GaN nanowires grown on opaque substrates",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1402.7318",
            "Abstract": "We demonstrate a new method to measure absorption coefficients in any family of nanowires, provided they are grown on a substrate having considerable difference in permittivity with the nanowire-air matrix. In the case of high crystal quality, strain-free GaN nanowires, grown on Si (111) substrates with a density of ~1010 cm-2, the extracted absorption coefficients do not exhibit any enhancement compared to bulk GaN values, unlike relevant claims in the literature. This may be attributed to the relatively small diameters, short heights, and high densities of our nanowire arrays.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical emission spectroscopy during fabrication of indium-tin-oxynitride films by RF-sputtering",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169433206008555",
            "Abstract": "Indium-tin-oxide (ITO) and indium-tin-oxynitride (ITON) films have been deposited on glass by rf-sputtering from an ITO target, using Ar plasma and N2 plasma, respectively, and different rf-power. Optical emission spectroscopy (OES) was employed to identify the species present in the plasma and to correlate them with the properties of the ITO and ITON thin films. Emission lines of ionic In could only be detected in N2 plasma, whereas in the Ar plasma additional lines corresponding to atomic In and InO, were detected. The deposition rate of thin films was correlated with the In species, rather than the nitrogen species, emission intensity in the plasma. The higher resistivity and lower carrier concentration of the ITON films, as compared to the respective properties of the ITO films, were attributed to the incorporation of nitrogen, instead of oxygen, in the ITON structure.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:XiVPGOgt02cC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "InAs/GaAs (211) B quantum dots with negligible FSS for the generation of entangled photons",
            "Publication year": 2011,
            "Publication url": "https://arxiv.org/abs/1103.5424",
            "Abstract": "Polarization-resolved single dot spectroscopy performed on (211)B InAs/GaAs quantum dots reveals that the fine structure splitting of the excitonic levels in these dots is much lower compared to the usual (100)-grown InAs dots. Time-resolved measurements confirm the high oscillator strength of these dots, and thus their good quantum efficiency at 4 K, comparable with that of (100) InAs/GaAs dots. Last, photon correlation measurements demonstrate single photon emission out of the excitonic optical transition of these dots. All these features make this novel dot system very promising for implementing solid-state entangled photon sources.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time‐Resolved Photoluminescence Studies of Cubic and Hexagonal GaN Quantum Dots",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1521-3951(200103)224:1%3C13::AID-PSSB13%3E3.0.CO;2-M",
            "Abstract": "We report time‐integrated and time‐resolved photoluminescence (PL) experiments on cubic and hexagonal GaN/AlN quantum wells (QWs) and self‐assembled quantum dots (QDs). The comparison between nitride nanostructures of different phase allows us to distinguish pure dimensionality effects from the influence of the large polarization‐induced electric fields present in the hexagonal nanostructures. The QDs show a weak temperature dependence of the PL intensity and decay time as a result of enhanced exciton localization. Furthermore, the hexagonal nanostructures exhibit longer decay times than the cubic ones due to electric field‐induced carrier separation.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:wbdj-CoPYUoC",
            "Publisher": "WILEY‐VCH Verlag Berlin GmbH"
        },
        {
            "Title": "Transferrable dielectric DBR membranes for versatile GaN-based polariton and VCSEL technology",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931720300642",
            "Abstract": "We present an innovative process to realize planar GaN microcavities, based on transferrable high-quality oxide-based Distributed-Bragg-Reflector (t-DBR) membranes. Unlike the widely used direct DBR deposition, which is not always feasible, the concept of t-DBR membranes allows their versatile use as top mirrors in all kinds of vertical-cavity surface emitting geometry devices, including light emitting diodes and lasers. The process illustrated here starts by evaporating first a 4-pair SiO2/Ta2O5 DBR centered around 400 nm on a lithographically patterned GaAs substrate. The GaAs substrate is subsequently removed by wet-etching, and the released DBR membranes are transferred onto other templates for their use as top mirrors in microcavities. By transferring a 4-pair top DBR on an 8-pair bottom SiO2/Ta2O5 DBR, a distinct cavity mode appears due to the formed λ/2 oxide cavity with a Q-factor of 110. If the 4 …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Recombination kinetics in polarization matched GaN/InAlGaN quantum wells",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200562042",
            "Abstract": "We report on time‐resolved photoluminescence (PL) experiments on ‘polarization‐matched’ GaN/InAlGaN heterostructures, to get unique information on the recombination kinetics of nitride quantum wells (QWs) without the obscuring influence of polarization‐induced internal fields. The samples have been grown by MBE choosing an In content of 14% and an Al content of 24% in order to compensate the internal fields. We have measured PL time decay as a function of several experimental parameters on a selected number of InAlGaN/GaN QWs. Careful analysis of time resolved spectra allows to isolate the intrinsic contribution from extrinsic bands. Very fast recombination times have been observed, demonstrating the enhancement of the exciton oscillator strength in these zero‐field GaN based QWs, with recombination times down to about a hundred ps. (© 2005 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:tS2w5q8j5-wC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Optical cavity formation on GaN using a conventional RIE system",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200565281",
            "Abstract": "We report on the fabrication of mirror‐like facets on GaN‐based laser structures, using a conventional RIE system and photoresist AZ 5214 as the etch mask. The roughness of the etched sidewalls is below 100 nm and the slope is practically vertical. For enhanced material protection during plasma etching, we describe an alternative lithography procedure with a double photoresist layer. (© 2006 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Field‐compensated quaternary InAlGaN/GaN quantum wells",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssb.200303536",
            "Abstract": "We demonstrate that it is possible to reduce significantly the internal polarisation fields in InAlGaN/GaN quantum wells (QWs), provided that the composition of the quaternary layer is appropriate. We have experimentally estimated an internal field of 2.65 mV/Å in In0.085Al0.285Ga0.63N/GaN QWs, which is a factor of four smaller than in “equivalent” GaN/Al0.15Ga0.85N QWs. Preliminary optical pumping experiments on laser structures using as active medium In0.085Al0.285Ga0.63N/GaN QWs have shown lower threshold than GaN/AlGaN laser structures at room temperature. (© 2003 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:xtRiw3GOFMkC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Piezoelectric InAs (211) B quantum dots grown by molecular beam epitaxy: Structural and optical properties",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3510490",
            "Abstract": "The structural and optical properties of piezoelectric (211)B InAs nanostructures grown by molecular beam epitaxy are systematically investigated as a function of the various growth parameters. Depending on the specific growth conditions, we show that the InAs nanostructures take the form of a quantum dot (QD) or a quantum dash, their height ranges between 2 and 20 nm, and their density varies from a few times 108 cm−2 all the way up to a few times 1010 cm−2. The (211)B QDs are characterized by large aspect ratios, which are compatible with a truncated pyramid morphology. By analyzing the QD emission spectrum, we conclude that only small size QDs, with heights less than 3 nm, are optically active. This is consistent with high resolution transmission electron microscopy observations showing that large QDs contain misfit dislocations, whereas small QDs are dislocation-free. The formation of a two …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:_xSYboBqXhAC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Nanophotonic Semiconductor Devices",
            "Publication year": 2019,
            "Publication url": "https://cc-webserver.iesl.forth.gr/sites/default/files/Events_programs/IESL%20Science%20days_Program%20and%20Book%20of%20Abstracts_final.pdf#page=38",
            "Abstract": "We will present an overview of our recent and ongoing activities, regarding novel nanophotonic semiconductor devices, including robust polaritonic devices operating at room temperature, tunable single photon emitters operating at elevated temperatures and semiconductor nanowire-based solar cells.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Piezoelectric InAs/GaAs quantum dots with reduced fine-structure splitting for the generation of entangled photons",
            "Publication year": 2012,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.86.035323",
            "Abstract": "Polarization-resolved single-dot spectroscopy reveals that the exciton fine-structure splitting in piezoelectric (211) B InAs/GaAs quantum dots is smaller than 10 μeV in the vast majority of examined dots. These values are significantly reduced compared to as-grown (100)-oriented InAs dots. Time-resolved measurements confirm the high oscillator strength of these dots, in spite of the internal piezoelectric field, suggesting good quantum efficiency at 4 K, comparable with that of (100) InAs/GaAs dots. Lastly, photon correlation measurements demonstrate single-photon emission from exciton levels of these dots. All these features make this intriguing dot system promising for implementing solid-state entangled photon sources.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:IjCSPb-OGe4C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Assembly of quantum dots on peptide nanostructures and their spectroscopic properties",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s00339-014-8538-5",
            "Abstract": "We present a chemical process for the decoration of self-assembled two-dimensional peptide fibrils with two different sizes of CdSe@ZnS core–shell quantum dots (Qdots) capped with trioctylphosphine oxide molecules. The attachment of the semiconducting nanoparticles to the fibrils is directed via disulfide bond between the quantum dot and cysteine aminoacids that are deliberately impeded in the peptide structures. A significant red shift in the emission spectra of the quantum dots is observed and attributed to the synergistic interaction between adjacent nanoparticles arranged on peptide film templates extending over hundreds of nanometers.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Room temperature GaAs exciton-polariton light emitting diode",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3082093",
            "Abstract": "Room temperature GaAs polariton emission is demonstrated under electrical injection. Temperature and angle-resolved electroluminescence measurements on a polariton light emitting diode clearly show the persistence of Rabi splitting and anticrossing behavior at temperatures as high as 315 K. We show that by increasing the number of quantum wells in the structure, the cutoff temperature for the strong coupling regime can be pushed beyond room temperature, in good agreement with theory. Our results suggest that optimally designed GaAs microcavities are perfectly suited for room temperature polaritronics.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:hFOr9nPyWt4C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Growth and characterization of self-assembled cubic quantum dots",
            "Publication year": 2001,
            "Publication url": "https://iris.unica.it/handle/11584/5485",
            "Abstract": "Self-assembled cubic GaN quantum dots have been grown by plasma-assisted molecular-beam epitaxy on cubic AlN. Atomic force microscopy and transmission electron microscopy reveal islands of a mean height of 1.6 nm and a mean diameter of 13 nm. The influence of stacking faults on island nucleation is discussed. The quantum dots show ultraviolet photo- and cathodo-luminescence with no thermal quenching up to room temperature.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Phonon deformation potentials of CdTe",
            "Publication year": 2000,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08957950008200955",
            "Abstract": "Single and multiple quantum wells (QWs) of CdTe/Cd1−xZnxTe, of different composition (x), grown on a Cd1−xZnxTe (001) substrate are studied by Raman spectroscopy at low temperature, under resonance conditions. Two of the three phonon deformation potentials (PDPs) of the LO phonon of CdTe are calculated using the observed phonon frequency shifts due to a lattice-misfit bisotropic strain.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Spontaneous polarization effects in  quantum wells",
            "Publication year": 2000,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.61.7211",
            "Abstract": "We observe in GaN/Al x Ga 1− x N quantum wells with varying aluminum concentration strong electric fields whose amplitudes are significantly larger than those observed before in comparable structures fabricated at higher growth temperatures. We show that the measured fields are clearly stronger than what is expected based on piezoelectric effects alone, which constitutes a direct experimental proof of the existence of important spontaneous polarization effects in the GaN/Al x Ga 1− x N heterostructure system.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:3fE2CSJIrl8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Direct comparison of recombination dynamics in cubic and hexagonal GaN/AlN quantum dots",
            "Publication year": 2003,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.68.035312",
            "Abstract": "We report on time-integrated and-resolved photoluminescence (PL) data on self-assembled GaN quantum dots (QD’s) embedded in AlN, in both cubic [zinc-blende (ZB)] and hexagonal [wurtzite (Wz)] crystallographic phases. The comparison of the optical properties of ZB and Wz nitride QD’s allows us to distinguish pure dimensionality effects from the influence of the large polarization-induced electric fields present in the Wz nanostructures. Specifically, the PL energy of the ZB QD’s is always higher than the bulk cubic GaN band-gap energy, in contrast to the Wz QD’s where a 7-MV/cm polarization field gives rise to below-gap PL emission for sufficiently large QD’s. As a further consequence of the internal field, the low-temperature PL decay times of the Wz QD’s are significantly longer than the ZB ones, and increase strongly with the QD height in contrast to the ZB ones, which exhibit only a small size dependence …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Recent progress in growth and physics of GaN/AlN quantum dots",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200304083",
            "Abstract": "We report our recent results on hexagonal and cubic GaN/AlN quantum dots grown by molecular beam epitaxy. It is shown that the growth of GaN on AlN can occur either in a layer‐by‐layer mode to form quantum wells or in the Stranski–Krastanow mode to form self‐assembled quantum dots. High resolution transmission electron microscopy reveals that quantum dots are truncated pyramids (typically 3 nm high and 15 nm wide), nucleating on top of a wetting layer. The existence of internal electric fields of 7 MV/cm in hexagonal quantum dots is evidenced by observations of various physical effects related to the quantum confined Stark effect, e.g. redshift of the interband transition energy, decrease of its oscillator strength, or enhancement of the exciton interaction with LO phonons. Preliminary results on rare‐earth doping of GaN/AlN quantum dots will be discussed also in this report. (© 2004 WILEY‐VCH Verlag …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:Tiz5es2fbqcC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "A GaAs polariton light-emitting diode operating near room temperature",
            "Publication year": 2008,
            "Publication url": "https://www.nature.com/articles/nature06979",
            "Abstract": "The increasing ability to control light–matter interactions at the nanometre scale has improved the performance of semiconductor lasers in the past decade. The ultimate optimization is realized in semiconductor microcavities, in which strong coupling between quantum-well excitons and cavity photons gives rise to hybrid half-light/half-matter polariton quasiparticles 1. The unique properties of polaritons—such as stimulated scattering 2, 3, parametric amplification 4, 5, 6, lasing 7, 8, 9, 10, condensation 11, 12, 13 and superfluidity 14, 15—are believed to provide the basis for a new generation of polariton emitters and semiconductor lasers. Until now, polariton lasing and nonlinearities have only been demonstrated in optical experiments, which have shown the potential to reduce lasing thresholds by two orders of magnitude compared to conventional semiconductor lasers 16. Here we report an experimental …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Resonant Raman characterization of InAlGaN/GaN heterostructures",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssb.200565132",
            "Abstract": "InAlGaN/GaN heterostructures and thin films with In composition ranging from 0.03 to 0.1 are characterized by means of Raman scattering excited at various energies in the ultra violet range, tuning the laser excitation energy through the band gap of InxAlyGa1–x–yN. It is shown that the addition of In to the AlyGa1–yN alloy diminishes considerably the vibration energy of the A1(LO) phonon mode. The phonon line is asymmetric on the low energy side, and the asymmetry increases with In content, while the main peak shifts to lower energies. A shift of the phonon energy has also been observed when the excitation energy is close to the absorption edge of the InxAlyGa1–x–yN layer. The nature of this shift is discussed in relation with intrinsic and extrinsic inhomogeneities in the quaternary alloy. (© 2006 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "current topics in solid state physics",
            "Publication year": 2006,
            "Publication url": "https://quantopt.materials.uoc.gr/papers/211QDs.pdf",
            "Abstract": "InAs nanostructures were grown by molecular beam epitaxy on GaAs (211) B at temperatures between 400-530 C and growth rates that were varied between 0.1 to 0.02 mono-layers (ML) per second. For temperatures up to 500 C we obtain pyramidal-shaped InAs quantum dots with average heights between 3 and 7 nm while at 530 C the dots become elongated, higher and are self organized into dashes along a specific crystallographic direction. Photoluminescence (PL) spectra taken at 18 K reveal in the QD samples grown at 500 C a broad (55 meV FWHM) PL peak at 1.27 eV, associated with the QD layer. The PL peak blue shifts noticeably (~ 7 meV) upon increasing power of excitation, as a consequence of the strain induced electric field that exists in the (211) B direction. phys. stat. sol.(c) 3, No. 11, 3988–3991 (2006)/DOI 10.1002/pssc. 200671616",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved GaN Quantum Well Microcavities for Robust Room Temperature Polaritonics",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssb.201800716",
            "Abstract": "New experiments on state‐of‐the‐art nitride polariton microcavities are reported which consist of high‐quality 3λ/2‐membranes with 8, 10, or 38 GaN/Al0.07Ga0.93N quantum wells, embedded in all‐dielectric distributed Bragg reflectors (DBRs). The optical density of the membranes, extracted from transmittance measurements taking into account standing wave effects, is found proportional to the number of quantum wells. At room temperature, the optical density per quantum well at the exciton wavelength reaches values around 3.5%. It is demonstrated that a top DBR consisting of four alternating pairs of SiO2/Ta2O5 is sufficient to obtain robust polariton features from these membranes at room temperature, with a Rabi splitting of 36 and 71 meV for the 10 and 38 quantum well microcavities, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-dielectric GaN microcavity: Strong coupling and lasing at room temperature",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4795019",
            "Abstract": "The strong light-matter coupling regime and lasing in a GaN microcavity fabricated by incorporating a high optical quality GaN membrane inside an all-dielectric mirror cavity is demonstrated at room temperature. A nonlinear increase of the emission and line narrowing marks the onset of polariton lasing regime with significantly reduced threshold compared with previous reports for bulk GaN microcavity. This combination of low lasing thresholds and ease of fabrication allows incorporation of quantum wells and electrical contacts into the active region, paving the way for electrically driven room temperature (RT) polariton laser devices.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:5nxA0vEk-isC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Improved GaN Quantum Well Microcavities for Robust Room Temperature Polaritonics",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=6882166972249179776&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Thin film mesoscale organization of nanoparticles by using biomolecular peptide tools",
            "Publication year": 2014,
            "Publication url": "https://eprints.soton.ac.uk/377409/",
            "Abstract": "Thin film mesoscale organization of nanoparticles by using biomolecular peptide tools - ePrints \nSoton The University of Southampton Courses University life Research Business Global About \nVisit Alumni Departments News Events Contact × Search the Site Search Filter your search: All \nCourses Projects Staff University of Southampton Institutional Repository Search Advanced \nSearch Policies & Help Latest Download Statistics Browse by Year Browse by Divisions \nLeftRight Thin film mesoscale organization of nanoparticles by using biomolecular peptide tools \nParak, Wolfgang J., Osinski, Marek, Yamamoto, Kenji I., Kasotakis, Emannouil, Kostopoulou, \nAthanasia, Spuch-Calvar, Miguel, Androulidaki, Maria, Pelekanos, Nikos T., Kanaras, \nAntonios G., Mitraki, Anna and Lappas, Alexandros (2014) Thin film mesoscale organization \nof nanoparticles by using biomolecular peptide tools. Proceedings of SPIE 8955: Colloidal , (…",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Papers presented at the Fourth International Conference on Nitride Semiconductors (ICNS-4) Denver, Colorado, USA, July 16-20, 2001 (Part A. 2)-AlGaN/GaN heterostructures-Residual Doping Effects",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=2362786589663703598&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Berlin: Akademie-Verlag,[1970]-c2004."
        },
        {
            "Title": "Molecular beam epitaxy of GaN, AlN, InN and related alloys: from 2D to 3D growth mode",
            "Publication year": 2000,
            "Publication url": "https://iris.unica.it/handle/11584/4842",
            "Abstract": "We demonstrate that the growth mode of GaN, AlN and InN in molecular beam epitaxy is two or three dimensional, depending on the competing kinetics of the metal species (Ga, Al or In) and of N. In this view, we show that the presence of foreign species acting as surfactants profoundly modifies the kinetics of the adatoms, eventually leading to an improvement in both structural and optical properties of the material. Next, we discuss the interplay between the growth mode and the strain relaxation in nitride heterostructures. In particular, we show that GaN and InGaN can experience a Stranski-Krastanov growth mode leading to the formation of quantum dots. A mechanism of quantum dot nucleation is proposed in the case of GaN on AIN.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effect of annealing on the properties of Indium− Tin− oxynitride films as ohmic contacts for GaN-based optoelectronic devices",
            "Publication year": 2009,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/am900138f",
            "Abstract": "Indium−tin−oxynitride (ITON) films have been fabricated by rf sputtering from an indium−tin−oxide target in nitrogen plasma. The influence of postdeposition annealing up to 800 °C is analyzed by electrical, optical, and surface characterization of the films in comparison to indium−tin−oxide (ITO) films fabricated in argon plasma. High-temperature annealing resulted in ITO(N) films with similar carrier concentrations. However, the resistivity and optical transmittance of the ITON films were higher than those of the ITO films. Photoelectron spectroscopy revealed that nitrogen is incorporated into the ITON structure in an unbound state as well as through the formation of metal−nitrogen and oxynitride bonds that decorate oxygen vacancies. When the core level electron spectra of ITO and ITON films are compared, a correlation between carrier concentration and the incorporated nitrogen is found. Changes in ITON electrical …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:NhqRSupF_l8C",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Piezoelectric effect on the optical phonon modes of strained cubic semiconductors: case of CdTe quantum wells",
            "Publication year": 2003,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.67.165304",
            "Abstract": "We report on Raman experiments of uniaxially stressed bulk CdTe and strained CdTe/CdZn (Mn) Te [001] and [111] quantum wells, which allowed us to determine the strain and piezoelectric field phonon deformation potentials (PDP’s) for the LO phonons in CdTe. Several PDP’s for the CdTe TO phonons have been extracted as well. We demonstrate that the piezoelectric effect on the phonon frequencies brings in a non-negligible correction, which should be taken into account in all strain-characterization Raman experiments on piezoelectric nanostructures. Examples on the piezoelectric-field induced phonon shifts are given for TO and LO phonons of low-symmetry grown ([111],[211],[311]) strained quantum wells of CdTe.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:mVmsd5A6BfQC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Effect of boiling aqua regia on MOCVD and MBE p-type GaN surfaces and Cr/p-GaN interfaces",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016793171100493X",
            "Abstract": "The effect of boiling aqua regia treatment on MOCVD and MBE p-GaN surface and p-GaN/Cr interface is examined with I–V measurements and X-ray photoelectron spectroscopy. The MBE p-GaN/Cr/Au contacts are of lower resistance in all cases, as compared to their MOCVD counterparts. Upon boiling aqua regia treatment, the surface of the MBE p-GaN material appeared to be more stable, as opposed to the increased sensitivity of the MOCVD one. As a result of the different behavior of the two samples surfaces was the fact that surface Fermi energy levels of MOCVD and MBE p-GaN moved towards opposite directions, which improved the contacts formed on the MOCVD sample in contrast to the MBE one, as confirmed by electrical characterization. Finally, the formation of Ga–Cr phase at the MOCVD p-GaN/Cr interface is detected, without any thermal treatment of the contacts. A possible formation mechanism …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Plasma-assisted MBE growth of quaternary InAlGaN quantum well heterostructures with room temperature luminescence",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022024802022753",
            "Abstract": "Quaternary InxAlyGa1−x−yN alloys with In mole fraction x ranging from 0 to 0.10 and Al mole fraction y in the range of 0.30–0.40 were grown by RF plasma-assisted molecular beam epitaxy (RF-MBE) by varying the growth temperature and the In flux. The surface morphology and structural quality of InAlGaN layers were optimized using metal-rich growth conditions and a relatively low growth temperature. The layers exhibited strong band-edge photoluminescence (PL) up to room temperature and a minimum line width of 61 meV for 20 K PL emission at 3.0 eV. Abrupt GaN/InAlGaN multiple quantum well structures were grown, with high-resolution X-ray diffraction curves exhibiting satellite peaks and interference fringes. Unwanted In incorporation in the GaN layers by In segregation effects was eliminated. Laser structures with active region consisting of InAlGaN wells and GaN barriers exhibited lasing under optical …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Residual Doping Effects on the Amplitude of Polarization‐Induced Electric Fields in GaN/AlGaN Quantum Wells",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1521-396X(200112)188:2%3C867::AID-PSSA867%3E3.0.CO;2-K",
            "Abstract": "We show that residual doping and carrier distribution effects decrease the observed polarization‐induced electric fields in GaN/AlGaN quantum wells and that these effects ought to be considered if we want to compare in a meaningful manner the experimental and theoretical polarizations in the AlGaN system.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:hqOjcs7Dif8C",
            "Publisher": "WILEY‐VCH Verlag Berlin GmbH"
        },
        {
            "Title": "Selective photochemical etching of GaN films and laser lift‐off for microcavity fabrication",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.200780215",
            "Abstract": "Wavelength dependent photochemical etching of GaN films reveals strong dependence of the photocurrent on the excitation wavelength. Sharp increase in the photocurrent with increasing photon energy is attributed to the onset of absorption above the GaN bandgap. The etching rate of GaN films strongly correlates with the measured photocurrent. No photocurrent and etching is observed for AlGaN films under same conditions. The method could pave the way to the development of truly selective self‐stop etching of GaN on AlGaN yielding smooth surfaces for the fabrication of GaN based microcavities. (© 2008 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:tOudhMTPpwUC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Optical characterization of indium-tin-oxynitride fabricated by RF-sputtering",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0040609003014263",
            "Abstract": "Indium-tin-oxynitride (ITON) and indium-tin-oxide (ITO) thin films have been fabricated by r.f. sputtering from an indium-tin-oxide target in a plasma containing N2 and Ar gases, respectively. The properties of films grown at two different plasma pressures were examined just after deposition and after annealing. Although the electrical properties of these films were improved after annealing, the properties of the ITON films were still inferior to those of the ITO films. The resistivity of the ITON films after annealing was reduced by a factor of two for the film at the higher plasma pressure, but the carrier concentration was almost the same. The ITON films fabricated at low pressure exhibited a significant blue shift in transmittance, which was not related to the increase carrier concentration after annealing.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Threshold current reduction due to piezoelectric effects in InGaAs/AlGaAs laser diodes",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/009/meta",
            "Abstract": "We show that despite expectations the piezoelectric field present, for instance, in strained InGaAs quantum wells (QWs) grown along the (111) B orientation, can lead to a significant threshold current reduction in laser diodes (LDs) using piezoelectric QWs as active medium. We have fabricated a series of LD structures in variable cavity lengths, with a single 10nm-thick InGaAs/AlGaAs active QW, grown either on (100) or (111) B GaAs substrates. We have observed for all temperatures in the range 20–300 K, and for all cavity lengths between 0.5–2 mm, systematically lower threshold currents in the (111) B LDs compared to their (100) counterparts. To interpret this unexpected result, we have employed modeling of the devices based on a self-consistent Schroedinger-Poisson solver, incorporating strain and screening effects, as well as the piezoelectric field dependence of gain and spontaneous emission rate.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Room temperature observation of biexcitons in exfoliated WS2 monolayers",
            "Publication year": 2017,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4983285",
            "Abstract": "Single layers of WS2 are direct gap semiconductors with high photoluminescence (PL) yield holding great promise for emerging applications in optoelectronics. The spatial confinement in a two-dimensional monolayer together with the weak dielectric screening leads to huge binding energies for the neutral excitons as well as other excitonic complexes, such as trions and biexcitons whose binding energies scale accordingly. Here, we report on the existence of biexcitons in mechanically exfoliated WS2 flakes from 78 K up to room temperature. Performing temperature and power dependent PL measurements, we identify the biexciton emission channel through the superlinear behavior of the integrated PL intensity as a function of the excitation power density. On the contrary, neutral and charged excitons show a linear to sublinear dependence in the whole temperature range. From the energy difference between …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:D03iK_w7-QYC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Thin film mesoscale organization of nanoparticles by using biomolecular peptide tools",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8955/89551W/Thin-film-mesoscale-organization-of-nanoparticles-by-using-biomolecular-peptide/10.1117/12.2048292.short",
            "Abstract": "Templating semiconductor nanoparticles’ growth on the surface of biological self-assembled molecules is a promising avenue over the limitations that top-down techniques may impose on device fabrication. We report on two-dimensional ordered structures of preformed TOPO (trioctylphosphine oxide) capped CdSe@ZnS core-shell quantum dots (Qdots) on self-assembled peptide fibrils. An amphiphilic peptide was employed both as ligand-exchange element (via its cysteine residues) and as a structural scaffold for the ordering of Qdots at the water-chloroform interface. We discuss the topological arrangement of the Qdots as imposed by the peptide fibril film and the impact of the assembly on the materials’ photoluminescent properties, which display signatures of long-range electronic energy transfer.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:olpn-zPbct0C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "InAs quantum dots grown by molecular beam epitaxy on GaAs (211) B polar substrates",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200671616",
            "Abstract": "InAs nanostructures were grown by molecular beam epitaxy on GaAs (211)B at temperatures between 400‐530 °C and growth rates that were varied between 0.1 to 0.02 mono‐layers (ML) per second. For temperatures up to 500 °C we obtain pyramidal‐shaped InAs quantum dots with average heights between 3 and 7 nm while at 530 °C the dots become elongated, higher and are self organized into dashes along a specific crystallographic direction. Photoluminescence (PL) spectra taken at 18 K reveal in the QD samples grown at 500 °C a broad (55 meV FWHM) PL peak at 1.27 eV, associated with the QD layer. The PL peak blue shifts noticeably (∼7 meV) upon increasing power of excitation, as a consequence of the strain induced electric field that exists in the (211)B direction. (© 2006 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Structure, strain, and composition profiling of InAs/GaAs (211) B quantum dot superlattices",
            "Publication year": 2016,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4940419",
            "Abstract": "The morphology, nanostructure, and strain properties of InAs quantum dots (QDs) grown on GaAs(211)B, uncapped or buried, are explored by transmission electron microscopy and related quantitative techniques. Besides the built-in piezoelectric field, other differences of (211) growth compared to (100)-oriented growth are discussed in terms of the (211) surface non-singularity, leading to anisotropic shape of the QDs and local chemical inhomogeneity of the wetting layer. The shape of the uncapped QDs was precisely defined as truncated pyramidal, elongated along the <111> direction, and bounded by the {110}, {100}, and {213} facets. Local strain measurements showed that large surface QDs were almost unstrained due to plastic relaxation, exhibiting small residual elastic strain at the interface that gradually diminished toward their apex. Conversely, buried QDs were pseudomorphically grown on GaAs. By …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:J_g5lzvAfSwC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Strain field determination in III–V heteroepitaxy coupling finite elements with experimental and theoretical techniques at the nanoscale",
            "Publication year": 2017,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/jmbm-2017-0009/html",
            "Abstract": "We are briefly reviewing the current status of elastic strain field determination in III–V heteroepitaxial nanostructures, linking finite elements (FE) calculations with quantitative nanoscale imaging and atomistic calculation techniques. III–V semiconductor nanostructure systems of various dimensions are evaluated in terms of their importance in photonic and microelectronic devices. As elastic strain distribution inside nano-heterostructures has a significant impact on the alloy composition, and thus their electronic properties, it is important to accurately map its components both at the interface plane and along the growth direction. Therefore, we focus on the determination of the stress-strain fields in III–V heteroepitaxial nanostructures by experimental and theoretical methods with emphasis on the numerical FE method by means of anisotropic continuum elasticity (CE) approximation. Subsequently, we present our …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:vRqMK49ujn8C",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "Residual strain and piezoelectric effects in passivated GaAs/AlGaAs core-shell nanowires",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4803685",
            "Abstract": "We observe a systematic red shift of the band-edge of passivated GaAs/Al0.35Ga0.65As core-shell nanowires with increasing shell thickness up to 100 nm. The shift is detected both in emission and absorption experiments, reaching values up to 14 meV for the thickest shell nanowires. Part of this red shift is accounted for by the small tensile strain imposed to the GaAs core by the AlGaAs shell, in line with theoretical calculations. An additional contribution to this red shift arises from axial piezoelectric fields which develop inside the nanowire core due to Al fluctuations in the shell.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:Y5dfb0dijaUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Micro-Raman characterization of  heterostructures",
            "Publication year": 2005,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.72.155336",
            "Abstract": "In x Ga 1− x N∕ Ga N∕ Al 2 O 3 (0001) heterostructures with x= 10.5%, 13.5%, 19.0%, 19.6%, and 26.5% are studied, by polarized micro-Raman spectroscopy, under plane and side backscattering geometries. The combination of both scattering geometries, together with variable excitation wavelengths, enabled the possibility to check independently strain-vs-depth distribution and selective-resonance effects from In-rich regions. Several Raman modes have been detected and were attributed to either the GaN or the InGaN films. Particular modes, which are not permitted in the bulk materials, are activated in the InGaN layers. Shifts of the frequencies relative to the ones expected in the bulk materials are explained as due to the elastic strains present in the hetero-structures. The results are evaluated in combination with compositional RBS analysis and the strain values obtained are compared with high resolution x …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:abG-DnoFyZgC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Self-assembled InGaN quantum dots grown by molecular-beam epitaxy",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.126098",
            "Abstract": "Self-assembled InGaN islands were grown by molecular-beam epitaxy on GaN, following a Stranski–Krastanow growth mode. Atomic force microscopy revealed that their dimensions were small enough to expect zero-dimensional quantum effects: the islands were typically 27 nm wide and 2.9 nm high. Strong blue-violet photoluminescence of the dots is observed, persisting up to room temperature. The temperature dependence of the photoluminescence is analyzed and compared to that of InGaN quantum well and bulk samples.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:LkGwnXOMwfcC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Current transport in semiconductor nanowires with built-in barriers based on a 1D transfer matrix calculation",
            "Publication year": 2008,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2963691",
            "Abstract": "A one dimensional (1D) transfer matrix calculation of current transport in semiconductor nanowires with built-in barriers is described within the effective mass approximation by taking into account (i) the quantum confinement in the radial direction and (ii) the Fermi level position with respect to the 1D sub-band(s), both of which can be determined analytically. We calculate the current-voltage (I-V) characteristic for an InAs nanowire, which has a radius of 200 Å and two 50 Å InP, built-in barriers, which define a 150 Å long InAs quantum disk and find that a peak in the current occurs at an applied voltage of 72 mV, corresponding to resonant tunneling of carriers through the double barriers. This is in good agreement with the I-V curve measured in a similar nanowire at a temperature of 4.2 K, where resonant tunneling occurs at 80 mV. It is deduced that the Fermi level is ≈26 meV above the conduction band edge at …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "STRUCTURAL, MECHANICAL, THERMODYNAMIC, AND OPTICAL PROPERTIES OF CONDENSED MATTER-Self-assembled zinc blende GaN quantum dots grown by molecular-beam epitaxy",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=1051666006984231420&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "New York [etc.] American Institute of Physics."
        },
        {
            "Title": "Bragg polariton luminescence from a GaN membrane embedded in all dielectric microcavity",
            "Publication year": 2011,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3595481",
            "Abstract": "We report on the development of a band gap-selective photochemical etching technique capable of producing 200 nm thick optical quality freestanding GaN membranes. The use of low electrolyte concentration combined with intense excitation by a laser source are shown to yield highly anisotropic etch profile with optical quality etched surfaces. Using this technique, high quality GaN microcavity is fabricated by embedding the GaN membrane inside an all-dielectric mirror cavity. In these structures, Bragg polariton photoluminescence is observed at room temperature.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:eMMeJKvmdy0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Spatially selective reversible charge carrier density tuning in WS2 monolayers via photochlorination",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/2053-1583/aae45c/meta",
            "Abstract": "Chlorine-doped tungsten disulfide monolayer (1L-WS 2) with tunable charge carrier concentration has been realized by pulsed laser irradiation of the atomically thin lattice in a precursor gas atmosphere. This process gives rise to a systematic shift of the neutral exciton peak towards lower energies, indicating reduction of the crystal's electron density. The capability to progressively tune the carrier density upon variation of the exposure time is demonstrated; this indicates that the Fermi level shift is directly correlated to the respective electron density modulation due to the chlorine species. Notably, this electron withdrawing process enabled the determination of the trion binding energy of the intrinsic crystal, found to be as low as 20 meV, in accordance to theoretical predictions. At the same time, it is found that the effect can be reversed upon continuous wave laser scanning of the monolayer in air. Scanning auger …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:uLbwQdceFCQC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Resonantly enhanced selective photochemical etching of GaN",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3122932",
            "Abstract": "Wavelength dependent photochemical etching of GaN films reveals a strong resonant enhancement of the photocurrent at the GaN gap, in close agreement with the excitonic absorption profile of GaN. The corresponding etching rate of GaN strongly correlates with the measured photocurrent. No photocurrent, nor etching is observed for AlGaN films under same excitation conditions. The method could pave the way to the development of truly selective etching of GaN on AlGaN for the fabrication of nitride based optoelectronic devices.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:1qzjygNMrQYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "GaN quantum dots: Physics and applications",
            "Publication year": 2003,
            "Publication url": "https://rei.iteso.mx/bitstream/handle/11117/656/JKPS_42.pdf?sequence=2",
            "Abstract": "In semiconductor physics, quantum dots (QDs) are the ultimate three-dimensional (3D) confinement structures of carriers. They can be considered as artificial atoms, with discrete energy levels and reduced density of states (DOS). Their unusual electronic properties, mostly due to the nanometer scale of the confinement potential, have attracted increasing interests and a recent review of their physical studies and device applications can be found in ref [1]. In this paper, we present a brief summary of GaN/AlN QDs which are much less well known than their II-VI (CdTe/ZnTe, CdSe/ZnSe) or III-V (InAs/GaAs) counterparts. It will be shown, in Section II, that nitride QDs are a model system to investigate the various energetic and kinetic processes governing the growth of QDs by molecular beam epitaxy (MBE). In Sections III and IV, we discuss some new physical situations and device applications deriving from the unique properties of nitride semiconductors. Finally in section V, the main conclusions are summarized.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Korean Physical Society"
        },
        {
            "Title": "Optical Properties of InAlGaN Heterostructures Grown by RF‐MBE",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200390099",
            "Abstract": "We performed optical characterisation on high‐quality InAlGaN thin films and InAlGaN/GaN quantum wells (QWs) grown by rf‐MBE. Our main findings are that the In bowing coefficient in In0.08Al0.29Ga0.63N alloys is found unexpectedly large (bI = 8.4 eV), and that the internal field in In0.08Al0.29Ga0.63N/GaN QWs is strongly reduced (0.25 MV/cm) as a consequence of enhanced polarisation matching between well and barrier layers.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:WA5NYHcadZ8C",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Comparative study of (100) and (111) B InGaAs single quantum well laser diodes",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386947704001444",
            "Abstract": "In this work, a series of identical In x Ga 1− x As/Al y Ga 1− y As single quantum well laser diodes, grown on (1 0 0) and (1 1 1) B GaAs substrates, have been thoroughly studied. For all samples, clear evidence of reduced threshold current densities in the (1 1 1) B substrate has been observed in electroluminescence spectra at 17 and 300 K. Modelling of the devices, based on a self-consistent solution of Schrödinger–Poisson's equations, was utilised in order to reproduce the experimental results. The model incorporates strain and piezoelectric effects on the quantum well states, free carrier screening, overlap integral computation, and optical gain calculation. The underlying mechanism, that explains the threshold reduction observed in the (1 1 1) B laser diodes, is discussed based on the results of the modelling.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:4DMP91E08xMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Selective measurement of hole tunneling times through AlGaAs barriers based on the quantum confined Stark effect",
            "Publication year": 2005,
            "Publication url": "https://journals.aps.org/prb/abstract/10.1103/PhysRevB.72.235323",
            "Abstract": "We demonstrate a method able to measure selectively and over a wide dynamic range the tunneling time of electrons or holes through a given potential barrier in a semiconductor heterostructure. The method relies on appropriate band gap engineering of the intrinsic region of a p− i− n diode, and on the quantum confined Stark effect. As an example, the hole tunneling time through thick Al x Ga 1− x As potential barriers has been measured over six orders of magnitude in In Ga As∕ Al Ga As structures. For x= 0.6, ultralong hole tunneling times are demonstrated in fair agreement with a semiclassical tunneling model. This model however turns out to be inapplicable for x⩽ 0.4, overestimating the tunneling times by several orders of magnitude. This suggests the formation of intrinsic leakage current paths through the AlGaAs barriers at these concentrations.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:BqipwSGYUEgC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Internal field effects on the lasing characteristics of InGaN/GaN quantum well lasers",
            "Publication year": 2008,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3021103",
            "Abstract": "A theoretical investigation of InxGa1−xN/GaN single quantum well lasers with x in the range 0.05⩽x⩽0.3 is carried out via self-consistent Schrödinger–Poisson calculations in the effective mass approximation in order to quantify the adverse effects of the internal electric field on the lasing characteristics of these heterostructures. We find a nonzero optimum internal field value that minimizes the threshold current density Jth, and whose amplitude depends on the quantum well width, In content, and cavity losses. We demonstrate that the complete elimination of the internal field in In0.2Ga0.8N/GaN blue laser diodes with typical cavity losses should result in a decrease in Jth by as much as a factor of 4. Furthermore, for a wide range of In contents and cavity losses, we find that the optimum well width that minimizes Jth ranges between 2.5 and 4 nm. Finally, we show that the longest lasing wavelength that can be achieved …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:dfsIfKJdRG4C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Tunable piezoelectric semiconductor laser controlled by the carrier injection level",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1306908",
            "Abstract": "We propose a tunable laser diode based on a piezoelectric heterostructure. The tuning mechanism consists of modulating the gain spectrum during lasing by the quantum-confined Stark effect. The modulating electric field is produced by carrier separation in the active region, and its amplitude depends on the injected carrier density. In a proof-of-principle photopumped experiment, we were able to generate a space-charge field of 20 kV/cm which shifted the lasing wavelength by more than 3 nm in the 800 nm spectral region.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:kRWSkSYxWN8C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Raman study of elastically strained bulk and layered structures based on CdTe",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1521-3951(200101)223:1%3C237::AID-PSSB237%3E3.0.CO;2-V",
            "Abstract": "Bulk CdTe bars under uniaxial stress, as well as single and multiple CdTe strained quantum wells (QWs), with varying barrier composition (degree of strain), have been studied by resonant Raman spectroscopy and photoluminescence excitation (PLE) at low temperature (T ≤ 90 K). Combining, a) piezo‐Raman results from bulk CdTe samples, b) misfit‐strain‐induced and piezoelectric‐field‐induced phonon shifts measured on QWs, and c) measured Gr neisen parameters, we estimate strain‐ and field‐ Phonon Deformation Potentials (PDPs) for the TO and LO phonons of CdTe.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:8AbLer7MMksC",
            "Publisher": "WILEY‐VCH Verlag Berlin GmbH"
        },
        {
            "Title": "InN quantum dots grown on GaN (0001) by molecular beam epitaxy",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200671613",
            "Abstract": "The growth properties of InN quantum dots on GaN (0001) surfaces by molecular beam epitaxy are being investigated. The dependence of the dimensions and density of the dots on the nucleation temperature and their evolution during growth at a constant substrate temperature are described. It is shown that both dimensions and density can be accurately controlled through nucleation temperature and deposition time. In the range from 400 °C to 450 °C, the formation of InN quantum dot structures of small dimensions and high density is feasible. InN dots with less than 3nm height, less than 22 nm diameter and with density higher than 1.7×1011 cm–2 have been obtained. Finally, vertical alignment of dots was observed for a multi‐period InN quantum dot structure in GaN matrix, grown at 430 °C. (© 2006 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Ultra-low threshold polariton lasing at room temperature in a GaN membrane microcavity with a zero-dimensional trap",
            "Publication year": 2017,
            "Publication url": "https://www.nature.com/articles/s41598-017-06125-y",
            "Abstract": "Polariton lasers are coherent light sources based on the condensation of exciton-polaritons in semiconductor microcavities, which occurs either in the kinetic or thermodynamic (Bose-Einstein) regime. Besides their fundamental interest, polariton lasers have the potential of extremely low operating thresholds. Here, we demonstrate ultra-low threshold polariton lasing at room temperature, using an all-dielectric, GaN membrane-based microcavity, with a spontaneously-formed zero-dimensional trap. The microcavity is fabricated using an innovative method, which involves photo-electrochemical etching of an InGaN sacrificial layer and allows for the incorporation of optimally-grown GaN active quantum wells inside a cavity with atomically-smooth surfaces. The resulting structure presents near-theoretical Q-factors and pronounced strong-coupling effects, with a record-high Rabi splitting of 64 meV at room-temperature …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Recombination dynamics in piezoelectric (2 1 1) B InAs quantum dots",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931713003912",
            "Abstract": "The carrier dynamics in self-assembled (2 1 1)B InAs quantum dots grown by Stranski–Krastanow method has been investigated by time-resolved and temperature-dependent photoluminescence experiments. The radiative recombination times are found to be larger than 1.7 ns and remain practically constant with temperature in line with the zero degree of dimensionality of the system. Above 100 K, the decay time is dominated by non-radiative channels. The main activation mechanism for non-radiative recombination is associated with carrier escape from the quantum dots to the wetting layer.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Self-catalyzed growth of highly vertical GaAs core-shell nanowires on chemically-treated Si (111) surfaces",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7528819/",
            "Abstract": "The reproducibility of self-catalyzed molecular beam epitaxy growth of GaAs nanowires (NWs) on oxide-covered Si(111) substrates depends on the consistent quality of the oxide layer. We have developed an effective chemical treatment method to create oxide surfaces that are conducive to the nucleation of vertical GaAs NWs on Si(111). Here we demonstrate a high yield, exceeding 90%, of vertical GaAs NWs with density in the order of 10 9  cm -2 . Using a combination of chemical oxide treatment and in situ growth conditions, we investigate how to achieve a good control of the morphology and density of GaAs and GaAs/III-As core-shell NWs grown on Si.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards electrically‐pumped microcavity polariton lasers",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200780210",
            "Abstract": "We present preliminary experimental results on a doped‐DBR microcavity diode sample, designed for electrically‐pumped operation at the elevated temperatures around 200 K. Low temperature reflectivity measurements as a function of incidence angle have shown clear evidence of polaritons in the strong coupling regime in this sample. Moreover, reflectivity spectra recorded at various temperatures between 185 and 217 K have demonstrated that the strong coupling regime persists at these elevated temperatures. Our results are very promising for the realization of polaritonic devices under electrical injection. (© 2008 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:u-x6o8ySG0sC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Strained GaAs/InGaAs core-shell nanowires for photovoltaic applications",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s11671-016-1384-y",
            "Abstract": "We report on the successful growth of strained core-shell GaAs/InGaAs nanowires on Si (111) substrates by molecular beam epitaxy. The as-grown nanowires have a density in the order of 108 cm−2, length between 3 and 3.5 μm, and diameter between 60 and 160 nm, depending on the shell growth duration. By applying a range of characterization techniques, we conclude that the In incorporation in the nanowires is on average significantly smaller than what is nominally expected based on two-dimensional growth calibrations and exhibits a gradient along the nanowire axis. On the other hand, the observation of sharp dot-like emission features in the micro-photoluminescence spectra of single nanowires in the 900–1000-nm spectral range highlights the co-existence of In-rich enclosures with In content locally exceeding 30 %.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:J-pR_7NvFogC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Self-assembled zinc blende GaN quantum dots grown by molecular-beam epitaxy",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1306633",
            "Abstract": "Zinc blende (ZB) GaN quantum dots have been grown by plasma-assisted molecular-beam epitaxy on AlN buffer layers using 3C-SiC(001) substrates. The two- to three-dimensional growth mode transition is studied by following the evolution of the reflection high-energy electron diffraction pattern. ZB GaN island layers are further examined by atomic force microscopy and transmission electron microscopy, extracting a mean island height of 1.6 nm and a mean diameter of 13 nm at a density of 1.3×1011 cm−2. Embedded ZB GaN quantum dots show strong ultraviolet photoluminescence without any thermal quenching up to room temperature.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "InAs nanostructures on polar GaAs surfaces",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJNT.2009.021712",
            "Abstract": "InAs nanostructures were grown by molecular beam epitaxy on GaAs (111)B and (211)B substrates at various growth temperatures between 450°C and 530°C. Their structural properties were studied by atomic force microscopy. For the (111)B grown nanostructures, the formation of self-aligned InAs quantum dashes was revealed, which in some cases took the form of nanowires. In the (211)B case, the shape and size of nanostructures is drastically affected by growth temperature. At lower growth temperatures, fabrication of quantum dots has been achieved by deposition of 2MLs of InAs. However, when the same amount of InAs was deposited at higher growth temperatures, a drastic change of nanostructure from dots to dashes occurred. Towards a better understanding of nanostructure properties, systematic photoluminescence (PL) measurements were performed on the (211) sample series. No PL emission …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Semiconductors II: Surfaces, interfaces, microstructures, and related topics-Piezoelectric effect on the optical phonon modes of strained cubic semiconductors: Case of CdTe quantum wells",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=7856639199496458248&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:RGFaLdJalmkC",
            "Publisher": "Woodbury, NY: published by the American Physical Society through the American Institute of Physics, c1998-"
        },
        {
            "Title": "High quality quaternary InAlGaN alloys grown by plasma-assisted molecular beam epitaxy",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1242726/",
            "Abstract": "We have investigated the growth of InAlGaN alloy thin films and InAlGaN/GaN quantum well (QW) heterostructures by rf plasma-assisted molecular beam epitaxy (RF-MBE). In-situ reflected high-energy electron diffraction (RHEED) was used to optimize the conditions for layer-by-layer growth and 0.25 /spl mu/m thick InAlGaN layers exhibited very smooth surfaces with rms roughness of 0.7-1.0 nm. Sharp X-ray diffraction peaks with 2/spl theta/-widths as low as 3 times that of the commercial GaN template and /spl omega/-widths about the same as the GaN template evidence the good structural quality and compositional uniformity of the InAlGaN alloys. All the InAlGaN samples exhibited intense band-edge photoluminescence up to room temperature with linewidths as lows as 73 meV at 3.25 eV. The InAlGaN bandgap was characterized as a function of the In content, controlled by varying the growth temperature, and …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Molecular beam epitaxy of GaN, AlN, InN and related alloys: from two-to three-dimensional growth mode",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925963599002204",
            "Abstract": "We demonstrate that the growth mode of GaN, AlN and InN in molecular beam epitaxy is two or three dimensional, depending on the competing kinetics of the metal species (Ga, Al or In) and of N. In this view, we show that the presence of foreign species acting as surfactants profoundly modifies the kinetics of the adatoms, eventually leading to an improvement in both structural and optical properties of the material. Next, we discuss the interplay between the growth mode and the strain relaxation in nitride heterostructures. In particular, we show that GaN and InGaN can experience a Stranski–Krastanov growth mode leading to the formation of quantum dots. A mechanism of quantum dot nucleation is proposed in the case of GaN on AlN.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:5ugPr518TE4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Single dot spectroscopy on InAs/GaAs piezoelectric quantum dots",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.200780190",
            "Abstract": "We report on single dot spectroscopy of InAs/GaAs quantum dots grown by molecular beam epitaxy along the polar (211)B direction. Unlike the (001) dots, in the (211)B dots we have systematically observed large blue shifts of the biexciton lines with respect to the excitonic ones. This is attributed to the strong piezoelectric field present inside the polar dots. In order to better interpret our results, we performed preliminary photoluminesence studies under the influence of an external electric field, which showed large Stark shifts of the quantum dot ensemble. From the analysis of these results, we deduced that the piezoelectric field in the (211)B InAs/GaAs quantum dots is as large as 800kV/cm, which is consistent with the large anti‐binding energies of bi‐excitons observed in this system. (© 2008 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:f2IySw72cVMC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Nanostructure and strain properties of core-shell GaAs/AlGaAs nanowires",
            "Publication year": 2015,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0268-1242/30/11/114012/meta",
            "Abstract": "GaAs/AlGaAs core–shell nanowires (NWs) were grown on Si (111) by Ga-assisted molecular beam epitaxy via the vapor–liquid–solid mechanism. High-resolution and scanning transmission electron microscopy observations showed that NWs were predominantly zinc-blende single crystals of hexagonal shape, grown along the [111] direction. GaAs core NWs emerged from the Si surface and subsequently, the NW growth front advanced by a continuous sequence of (111) rotational twins, while the AlGaAs shell lattice was perfectly aligned with the core lattice. Occasionally, single or multiple stacking faults induced wurtzite structure NW pockets. The AlGaAs shell occupied at least half of the NW's projected diameter, while the average Al content of the shell, estimated by energy dispersive x-ray analysis, was x= 0.35. Furthermore, molecular dynamics simulations of hexagonal cross-section NW slices, under a new …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:maZDTaKrznsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Highly uniform zinc blende GaAs nanowires on Si (111) using a controlled chemical oxide template",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6528/aa7169/meta",
            "Abstract": "GaAs-based nanowires (NWs) can be grown without extrinsic catalyst using the Ga-assisted vapor–liquid–solid method in an epitaxy reactor, on Si (111) substrates covered with native oxide. Despite its wide use, the conventional method fails to provide a good control over uniformity, reproducibility, and yield of vertical NWs. The nucleation of GaAs NWs is very sensitive to the properties of the native oxide such as chemical composition, roughness and porosity. Consequently, samples grown under the same conditions on Si (111) substrates from different manufacturing batches often produce dramatically different growth results. In order to remove the dependence on wafer batch, a controlled chemical oxidation process is developed to replace the native oxide on Si (111) substrate with a reproducible chemical oxide. A high yield (exceeding 90%) of vertical GaAs NWs is achieved with excellent uniformity on chemical …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:08ZZubdj9fEC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Anti-binding of biexcitons in (2 1 1) B InAs/GaAs piezoelectric quantum dots",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386947707006273",
            "Abstract": "We report on single dot spectroscopy of polar (2 1 1)B InAs/GaAs quantum dots grown by molecular beam epitaxy. Exciton and biexciton peaks have been identified, revealing a negative biexciton binding energy attributed to the presence of strong piezoelectric field.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:RHpTSmoSYBkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Stark-tunable InGaAs laser diodes",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1105824/",
            "Abstract": "Summary form only given. Cost-effective wavelength-tunable laser diodes (LDs) can become crucial components in optical telecommunications. There are currently several technologically interesting solutions to achieve tunability based on temperature, external cavity laser, or a multi-section DBR laser. In this work we explore an alternative approach, where the LD tuning mechanism is based on the quantum-confined Stark effect (QCSE). To achieve this, the LD active region is designed such that the injection current generates during lasing a space-charge field that tunes the lasing wavelength /spl lambda//sub L/. We show a schematic band diagram of the LD active region we propose. It consists of three quantum wells (QWs) separated by two tunneling barriers. The central QW is the active QW (AQW), whose lowest transition is the ground state of the whole structure. The outer QWs are the collection QWs (CQWs …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Piezoelectric effect on the lasing characteristics of (111) B InGaAs/AlGaAs laser diodes",
            "Publication year": 2005,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1994698",
            "Abstract": "In this work we investigate both experimentally and theoretically the effect of the piezoelectric (PZ) field on the lasing characteristics of InGaAs (111)B quantum wells. We show that, under certain conditions, the existence of the PZ field can be beneficial and lead to substantial threshold current reduction in (111)‐grown InGaAs/AlGaAs laser diodes, compared to their (100) counterparts.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:HE397vMXCloC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Enhanced Stark Tuning of Single InAs  Quantum Dots due to Nonlinear Piezoelectric Effect in Zincblende Nanostructures",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/prapplied/abstract/10.1103/PhysRevApplied.6.014004",
            "Abstract": "We report enhanced Stark tuning of single exciton lines in self-assembled (211) B InAs quantum dots (QDs) as a consequence of pronounced piezoelectric effects in polar orientations, making this QD system particularly sensitive to relatively “small” applied external fields. The Stark shifts in the first hundreds of kilovolts per centimeter of applied external field are at least 2.5 times larger, compared to those observed in nonpiezoelectric (100) InAs QDs of similar size. To account quantitatively for the observed transition energies and Stark shifts, we utilize a graded In-composition potential profile, as deduced from local strain analysis performed on high-resolution transmission microscopy images of the QDs. Our results provide a direct demonstration of the importance of nonlinear piezoelectric effects in zincblende semiconductors.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:roLk4NBRz8UC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Extraction of absorption coefficients from as-grown GaN nanowires on opaque substrates using all-optical method",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-22-16-19555",
            "Abstract": "We demonstrate a new all-optical method to measure absorption coefficients in any family of as-grown nanowires, provided they are grown on a substrate having considerable difference in permittivity with the nanowire-air matrix. In the case of high crystal quality, strain-free GaN nanowires, grown on Si (111) substrates, the extracted absorption coefficients do not exhibit any enhancement compared to bulk GaN values, unlike relevant claims in the literature. This could be attributed to the relatively small diameters, short heights, and high densities of our nanowire arrays.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Structural and optical properties of self-assembled GaN/AlN quantum dots",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296214700001050",
            "Abstract": "Nous présentons dans cet article une synthèse de nos études sur les boîtes quantiques de structure wurtzite de GaN/AlN élaborées par épitaxie par jets moléculaires selon le mode de croissance Stranski–Krastanow. L’étude en microscopie électronique en transmission à haute résolution montre que ces boîtes ne contiennent pas de dislocations, mais se forment sur une couche de mouillage, au voisinage des dislocations traversantes. Ces boîtes sont des pyramides tronquées (4 nm de hauteur et 15 nm de diamètre de base), qui présentent un effet de corrélation verticale très marqué lorsqu’on les empile entre des plans distants de moins de 10 nm. Les mesures optiques de photoluminescence et de temps de déclin ont permis de mettre en évidence l’existence de champs électriques internes de plusieurs MV·cm−1 générés par la polarisation spontanée et l’effet piézoélectrique. Néanmoins, ces boîtes quantiques …",
            "Abstract entirety": 0,
            "Author pub id": "Uj9w0jUAAAAJ:IWHjjKOFINEC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Low resistance as-deposited  contacts on -type GaN",
            "Publication year": 2007,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2828044",
            "Abstract": "The influence of several predeposition surface treatments and different contact metals to the electrical properties of metal/p-GaN contacts was studied. A low resistance as-deposited Cr∕Au Ohmic contact was achieved, using boiling aqua regia as surface treatment. The Ohmic resistance of Cr∕Au contacts with 50μm interspacing was found to be 50Ω, while the specific contact resistivity value was measured 2.6×10−3Ωcm2. Direct comparison with the standard oxidized Ni∕Au contacts confirmed the superior characteristics of the Cr∕Au contact scheme. Violet emission was readily obtained when the as-deposited Cr∕Au contacts were used as the p electrode of a light emitting diode emitting at 385nm.",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:t6usbXjVLHcC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Semiconductors II-Surfaces, interfaces, microstructures, and related topics-Micro-Raman characterization of InxGa1-xN/GaN/Al2O3 heterostructures",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=15022814547967811121&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:eflP2zaiRacC",
            "Publisher": "Woodbury, NY: published by the American Physical Society through the American Institute of Physics, c1998-"
        },
        {
            "Title": "InGaN (0001) alloys grown in the entire composition range by plasma assisted molecular beam epitaxy",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssa.200563509",
            "Abstract": "Indium gallium nitride alloy (0001) films in the entire composition range were grown heteroepitaxially by radio‐frequency plasma assisted molecular beam epitaxy on Ga‐polarity GaN(0001)/Al2O3 substrates. A growth approach based on low substrate temperatures and near‐stoichiometric growth conditions was followed. Under these conditions incorporation efficiency of indium atoms was equal to one. X‐ray diffraction data reveal that phase separation phenomena were effectively suppressed. As the indium mole fraction increased, a tendency of the strain state of the films to change from compressive to tensile was observed. This was attributed to growth through nucleation and coalescence of three‐dimensional InGaN islands with high lattice mismatch on GaN(0001). (© 2006 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:LPZeul_q3PIC",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "Energy gaps and bowing parameters of InAlGaN ternary and quaternary alloys",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pssc.200565280",
            "Abstract": "We report a study of band gap energies and bowing parameters of all possible families of ternary and quaternary nitride alloys. The experimental band gap energies (E g) measured by photoluminescence, optical transmission and reflection methods, were strain‐corrected in order to obtain for every sample the unstrained value of its E g. For Alx Ga1–x N the bowing parameter is equal to 1 eV, but the alloys Inx Ga1–x N and Inx Al1–x N exhibited strong dependence of the bowing parameter on alloy composition. Finally, we investigated many quaternaries alloys Inx Aly Ga1–x –y N and we observed that the bowing parameter appears also to be very sensitive on In content. (© 2006 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)",
            "Abstract entirety": 1,
            "Author pub id": "Uj9w0jUAAAAJ:ye4kPcJQO24C",
            "Publisher": "WILEY‐VCH Verlag"
        }
    ]
}]