[{
    "name": " Παναγιώτης Τραχανιάς ",
    "romanize name": " Panagiotis Trachanias ",
    "School-Department": "Επιστήμης Υπολογιστών",
    "University": "uoc",
    "Rank": "Καθηγητής",
    "Apella_id": 9346,
    "Scholar name": "Panos Trahanias",
    "Scholar id": "MwSYJxsAAAAJ",
    "Affiliation": "Professor of Computer Sience, University of Crete and FORTH",
    "Citedby": 5253,
    "Interests": [
        "Robotics",
        "Computer Vision",
        "Computational Modeling"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=MwSYJxsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Prototype Deployment of the Network of Affined Honeypots Architecture",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.461.5014&rep=rep1&type=pdf",
            "Abstract": "Internet security is an arms race between attackers and the whitehat community. Honeypots are a valuable asset that helps researchers and security experts obtain knowledge for both known and unknown attacks. Honeypots are specially designed hosts set up to act as decoys for attackers and automated attacking tools. Since a single honeypot host can only receive a small portion of the unsolicited internet traffic and thus has limited chances to be the victim of a cyber attack, a distributed monitoring infrastructure of cooperative honeypots is needed.Network of Affined Honeypots (NoAH) aims to develop and deploy a large scale system of honeypots which cooperate in order to identify new and analyze existing attacks. NoAH is composed of a core that is comprised of low and high interaction honeypots, which are responsible for interacting with the attackers and analyze the received traffic. Apart from the core, there are tunneling and funneling mechanisms that collect and direct traffic from participating honeypots to the NoAH core. Moreover, home users and small enterprises can participate in NoAH infastructure through Honey@ Home tool. Honey@ Home listens to the unused address space of a home or enterprise network and forwards received traffic to the NoAH core. In this thesis we present a prototype deployment of the NoAH infastructure along with some experimental results and record our experiences with the NoAH infrastructure. Results suggest that we can build a robust and effective infrastructure with moderate resource requirements.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodological framework for robotic reproduction of observed human actions: Formulation using latent space representation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7803331/",
            "Abstract": "The current work presents a comprehensive methodological framework that facilitates robots to acquire human-like behavioral acts by observing human demonstrators. Accordingly, the introduced framework is established as a Learning from Demonstration (LfD) process that enables the reproduction of either learned or novel actions. Mapping of human actions to the respective robotic ones is achieved via an indeterminate depiction, termed latent space representation. The latter accomplishes a compact, yet precise abstraction of action trajectories, effectively representing high dimensional raw actions in a low dimensional space. Extensive experimentation with a real robotic arm demonstrates the robustness and applicability of the introduced framework.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gesture recognition based on arm tracking for human-robot interaction",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5648870/",
            "Abstract": "In this paper we present a novel approach for hand gesture recognition. The proposed system utilizes upper body part tracking in a 9-dimensional configuration space and two Multi-Layer Perceptron/Radial Basis Function (MLP/RBF) neural network classifiers, one for each arm. Classification is achieved by buffering the trajectory of each arm and feeding it to the MLP Neural Network which is trained to recognize between five gesturing states. The RBF neural network is trained as a predictor for the future gesturing state of the system. By feeding the output of the RBF back to the MLP classifier, we achieve temporal consistency and robustness to the classification results. The proposed approach has been assessed using several video sequences and the results obtained are presented in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational modeling of observational learning inspired by the cortical underpinnings of human primates",
            "Publication year": 2012,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1059712312445902",
            "Abstract": "Recent neuroscientific evidence in human and non-human primates indicates that the regions that become active during motor execution and motor observation overlap extensively in the cerebral cortex. This suggests that to observe an action, these primates employ their motor and somatosensation areas in order to simulate it internally. In line with this finding, in the current paper, we examine relevant neuroscientific evidence in order to design a computational agent that can facilitate observational learning of reaching movements. For this reason, we develop a novel motor control system, inspired from contemporary theories of motor control, and demonstrate how it can be used during observation to facilitate learning, without the active involvement of the agent’s body. Our results show that novel motor skills can be acquired only by observation, by optimizing the peripheral components of the agent’s motion.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Predictive autonomous robot navigation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1041438/",
            "Abstract": "This paper considers the problem of a robot navigating in a crowded or congested environment. A robot operating in such an environment can get easily blocked by moving humans and other objects. To deal with this problem it is proposed to attempt to predict the motion trajectory of humans and obstacles. Two kinds of prediction are considered: short-term and long-term. The short-term prediction refers to the one-step ahead prediction and the long-term to the prediction of the final destination point of the obstacle's movement. The robot movement is controlled by a partially observable Markov decision process (POMDP). POMDPs are utilized because of their ability to model information about the robot's location and sensory information in a probabilistic manner. The solution of a POMDP is computationally expensive and thus a hierarchical representation of POMDPs is used.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Outlier-Robust State Estimation for Humanoid Robots*",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8968152/",
            "Abstract": "Contemporary humanoids are equipped with visual and LiDAR sensors that are effectively utilized for Visual Odometry (VO) and LiDAR Odometry (LO). Unfortunately, such measurements commonly suffer from outliers in a dynamic environment, since frequently it is assumed that only the robot is in motion and the world is static. To this end, robust state estimation schemes are mandatory in order for humanoids to symbiotically co-exist with humans in their daily dynamic environments. In this article, the robust Gaussian Error-State Kalman Filter for humanoid robot locomotion is presented. The introduced method automatically detects and rejects outliers without relying on any prior knowledge on measurement distributions or finely tuned thresholds. Subsequently, the proposed method is quantitatively and qualitatively assessed in realistic conditions with the full-size humanoid robot WALK-MAN v2.0 and the mini-size …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:Dip1O2bNi0gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and integration of partial brain models using hierarchical cooperative coevolution",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.117.8845&rep=rep1&type=pdf",
            "Abstract": "The current work addresses the problem of designing and integrating brain-inspired artificial cognitive systems. Specifically, we introduce a new computational framework for modelling partial brain areas following a coevolutionary agent-based approach. Properly formulated neural agents are employed to represent brain areas. A cooperative coevolutionary method, with the inherent ability to co-adapt substructures, supports the design of the models, and additionally provides a consistent methodology to achieve their integration. The implemented models are successfully embedded in a simulated robotic platform which supports environmental interaction. The proposed approach is utilized to design two distinct models: one for primary motor cortex able to drive the robot in a purposeless wall avoidance mode, and one for hippocampus which supports selflocalization. These models are further integrated by adding at the same time prefrontal structures, in order to drive the robot in a purposeful mode, accomplishing a DMS task in a cross (+) maze.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Full-body pose tracking—the top view reprojection approach",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7332960/",
            "Abstract": "Recent introduction of low-cost depth cameras triggered a number of interesting works, pushing forward the state-of-the-art in human body pose extraction and tracking. However, despite the remarkable progress, many of the contemporary methods cope inadequately with complex scenarios, involving multiple interacting users, under the presence of severe inter- and intra-occlusions. In this work, we present a model-based approach for markerless articulated full body pose extraction and tracking in RGB-D sequences. A cylinder-based model is employed to represent the human body. For each body part a set of hypotheses is generated and tracked over time by a Particle Filter. To evaluate each hypothesis, we employ a novel metric that considers the reprojected Top View of the corresponding body part. The latter, in conjunction with depth information, effectively copes with difficult and ambiguous cases, such as …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PYTHEAS: an integrated robotic system with autonomous navigation capabilities",
            "Publication year": 2002,
            "Publication url": "https://139.91.152.92/_publications/2001_07_ktisivios01_pytheas.pdf",
            "Abstract": "PYTHEAS is an integrated robotic software system that offers advanced navigation capabilities, which include localization, workspace mapping, path planning and tracking and obstacle avoidance. PYTHEAS facilitates mapping of an unknown indoors environment by exploiting information extracted from a laser scanner. Based on this acquired environment representation, the system is able to navigate autonomously in the mapped environment, while, at the same time, avoiding dynamic obstacles such as moving persons, etc. All the required competences are coupled in an integrated system, which can be controlled through a user-friendly interface over the web. Extensive experimental results demonstrate the capability of the developed system to map complicated environments and support navigation in dynamic worlds.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Humanoid robot dense RGB-D SLAM for embedded devices",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Stylianos-Piperakis/publication/332686387_Humanoid_Robot_Dense_RGB-D_SLAM_for_Embedded_Devices/links/5cc341654585156cd7b4518e/Humanoid-Robot-Dense-RGB-D-SLAM-for-Embedded-Devices.pdf",
            "Abstract": "Visual Simultaneous Localization and Mapping (visual SLAM) constitutes a challenging task when applied to humanoid robots. While walking, the robot’s feet strike the ground and generate sudden accelerations due to rapid and sequential contact switching. These in turn give rise to visual motion blurriness that greatly compromises the performance of the system. In this work we present a dense visual SLAM approach that integrates information from IMU, robot kinematics and contact measurements, to overcome these issues.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:e_rmSamDkqQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrated intrinsic and dedicated representations of time: a computational study involving robotic agents",
            "Publication year": 2015,
            "Publication url": "https://brill.com/view/journals/time/3/3-4/article-p246_4.xml",
            "Abstract": "The computational modeling of cognitive processes provides a systematic means to study hidden and particularly complex aspects of brain functionality. Given our rather limited understanding of how the brain deals with the notion of time, the implementation of computational models addressing duration processing can be particularly informative for studying possible time representations in our brain. In the present work we adopt a connectionist modeling approach to study how time experiencing and time processing may be encoded in a simple neural network trained to accomplish time-based robotic tasks. A particularly interesting characteristic of the present study is the implementation of a single computational model to accomplish not only one but three different behavioral tasks that assume diverse manipulation of time intervals. This setup enables a multifaceted exploration of duration-processing mechanisms …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:tzM49s52ZIMC",
            "Publisher": "Brill"
        },
        {
            "Title": "A virtual reality brainwave entrainment method for human augmentation applications",
            "Publication year": 2015,
            "Publication url": "https://sonictonic.io/wp-content/uploads/2016/10/2015.TR458_VIRTUAL_REALITY_BRAINWAVE-4.pdf",
            "Abstract": "In order to investigate the brain activity under rhythmic stimulation we developed a novel architecture for Augmented Cognition by integrating latest wearable Virtual Reality (VR) immersive Head-Mounted-Displays with wireless, mobile neuro-biofeedback systems for Real-time, Autonomous Cognitive State Detection, Manipulation and Augmentation. We integrated in our open-source VR framework both latest experimental Oculus Rift HMDs (DK1 and DK2) together with the Emotiv EPOC mobile EEG headset in an innovative, open architecture for user position, orientation and brainwave frequency tracking. We carried out a novel experiment with five groups tracking the brain frequency states of people while relaxing or performing certain sensorimotor tasks in an interactive, immersive 3D environment. The primary aim of this novel research is human cognition augmentation and improvement of task performance via a unique VR-induced entrainment methodology. In most of our experimental groups, we witnessed the transition of the beta-wave to the alpha-wave state. The brainwave entrainment at alpha frequency (10Hz) and relaxation via modern VR, using our open s/w framework, allowed us to verify for the first time enhanced task performance in a fast-learning setup. These first results empower us to plan future studies concerning clinical treatments in VR entrainment using modern wearable devices.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiences from the Use of a Robotic Avatar in a Museum Setting",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/584993.585017",
            "Abstract": "Access to cultural exhibits is a central issue in museums and exhibition galleries that is recently approached under a new, technological perspective. Although the cultural industries' practices in the cases of museums and cultural exhibits have remained practically unchanged for long, in recent years we are witnessing a gradual adoption of media-technologies in various aspects, such as collections archiving and digital document preservation, media-and Web-presentation, graphical animations, etc. Lately, Internet and Web-based technologies have been employed for providing access, mostly to images of exhibited objects. In few cases, the incorporation of higher-end technology, such as virtual reality, artificial intelligence, or robotics, is explored. In this paper we present such an effort, the TOURBOT project (an acronym for TOUr-guide RoBOT), which emphasizes the development of alternative ways for interactive …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual estimation of attentive cues in HRI: the case of torso and head pose",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20904-3_34",
            "Abstract": "Capturing visual human-centered information is a fundamental input source for effective and successful human-robot interaction (HRI) in dynamic multi-party social settings. Torso and head pose, as forms of nonverbal communication, support the derivation people’s focus of attention, a key variable in the analysis of human behaviour in HRI paradigms encompassing social aspects. Towards this goal, we have developed a model-based approach for torso and head pose estimation to overcome key limitations in free-form interaction scenarios and issues of partial intra- and inter-person occlusions. The proposed approach builds up on the concept of Top View Re-projection (TVR) to uniformly treat the respective body parts, modelled as cylinders. For each body part a number of pose hypotheses is sampled from its configuration space. Each pose hypothesis is evaluated against the a scoring function and the …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A framework for visual landmark identification based on projective and point-permutation invariant vectors",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0921889000001299",
            "Abstract": "Autonomous robotic navigation based on machine vision, presents a challenging field in current robotics research. This task presupposes a representation of the environment and methods to process this representation and use it to derive the appropriate platform motions, in order to accomplish specific navigation goals. Following recent theories of active and purposive vision, we attempt to qualitatively describe the environment, avoiding thus a metric, 3D representation of it. A set of reference patterns, the so-called landmarks, together with their topological relations, is used to adequately describe the robot’s workspace. Mathematical tools from projective geometry are employed for landmark identification, facilitating robust landmark recognition irrespective from the camera viewpoint. A complete framework is presented in this work for landmark extraction and recognition based on projective and point-permutation …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Artificial agents perceiving and processing time",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7280727/",
            "Abstract": "Time perception is a fundamental component of intelligence that structures the way humans act in various contexts. As action evolves over time, timing is necessary to appreciate environmental contingencies, estimate relations between events and predict the effects of our actions at future moments. Despite the fundamental role of time in human cognition it remains largely unexplored in the field of artificial cognitive systems. The present work makes concrete steps towards making artificial systems aware that the notion of time as a unique entity that can be processed on its own right. To this end, we evolve artificial neural networks to perceive the flow of time and to be able to accomplish three different duration processing tasks. Subsequently we study the internal dynamics of neural networks to obtain insight on the representation and processing mechanisms of time. The self-organized neural network solutions …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online Performance Prediction and Profiling of Human Activities by Observation",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8967707/",
            "Abstract": "The capacity of a system to automatically analyze and predict the performance of a human in a particular task can provide important information in Human-Robot Interaction. Despite its usefulness, the above topic has received rather limited attention in the literature. In the current work, we introduce a method for performance prediction and profiling of human activities. Using little information about a task, our method is able to extract the characteristic motion patterns of an agent, analyze them and predict his/her performance in a given activity. We demonstrate the robustness of the method in several different activities, that involve both periodic and oscillatory primitive motions. In addition, we evaluate it thoroughly on data obtained from public datasets and discuss its usefulness for contemporary robotic applications.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:foquWX3nUaYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing museum visitor access through robotic avatars connected to the web",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Panos-Trahanias/publication/249688649_Enhancing_Museum_Visitor_Access_Through_Robotic_Avatars_Connected_to_the_Web/links/00b495294b26f13a91000000/Enhancing-Museum-Visitor-Access-Through-Robotic-Avatars-Connected-to-the-Web.pdf",
            "Abstract": "Access to cultural exhibits is a central issue in museums and exhibition galleries that is recently",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The VPLF method for vanishing point computation",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885600000871",
            "Abstract": "A basic problem in computer vision is the extraction of 3D vanishing points (VP) out of 2D perspective projections. VP analysis provides strong cues for inferring the 3D structure of a scene from only a single view. In this work we present a novel method for VP computation based on a likelihood function that characterizes the plausibility of a point as VP. The performance of our method has been tested with a variety of artificial and real scenes and has been found very promising.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:TFP_iSt0sucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The explicit judgment of long durations of several minutes in everyday life: Conscious retrospective memory judgment and the role of affects?",
            "Publication year": 2018,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0195397",
            "Abstract": "In this study, individuals estimated interval times of several minutes (from 2 to 32 minutes) during their everyday lives using a cell phone they kept with them. Their emotional state, the difficulty of the activity performed during this interval, and the attention that it required were also assessed, together with their subjective experience of the passage of time. The results showed that the mean time estimates and their variability increased linearly with increasing interval duration, indicating that the fundamental scalar property of time found for short durations also applies to very long durations of several minutes. In addition, the emotional state and difficulty of the activity were significant predictors of the judgment of long durations. However, the awareness of the passage of time appeared to play a crucial role in the judgment of very long duration in humans. A theory on the emergence of the awareness of the passage of time and how it affects the judgment of interval durations lasting several minutes is therefore discussed.",
            "Abstract entirety": 1,
            "Author pub id": "MwSYJxsAAAAJ:tYavs44e6CUC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Nonlinear state estimation for humanoid robot walking",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8403285/",
            "Abstract": "This letter presents a novel cascade state estimation framework for the three-dimensional (3-D) center of mass (CoM) estimation of walking humanoid robots. The proposed framework, called State Estimation RObot Walking (SEROW), fuses effectively joint encoder, inertial, feet pressure, and visual odometry measurements. Initially, we consider the humanoid's Newton-Euler dynamics and rigorously derive the nonlinear CoM estimator. The latter accurately estimates the 3D-CoM position, velocity, and external forces acting on the CoM, while directly considering the presence of uneven terrain and the body's angular momentum rate and, thus, effectively coupling the frontal with the lateral plane dynamics. Furthermore, we extend an established floating mass estimator to take into account the support foot pose, yielding in such a way the mandatory, for CoM estimation, affine transformations and forming a cascade state …",
            "Abstract entirety": 0,
            "Author pub id": "MwSYJxsAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        }
    ]
}]