[{
    "name": " Σπυρίδων Νικολαϊδης",
    "romanize name": " Spyridon Nikolaidis",
    "School-Department": "Φυσικής",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 18160,
    "Scholar name": "Spyridon Nikolaidis",
    "Scholar id": "CeK-UugAAAAJ",
    "Affiliation": "Aristotle University of Thessaloniki",
    "Citedby": 2205,
    "Interests": [
        "Digital circuits and Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=CeK-UugAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Pipeline leak localization techniques",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956289/",
            "Abstract": "Pipeline networks have been a frequently used and safe way of transporting fluids (such as crude oil, petroleum products, natural gas, water etc.) for many years. Some of the reasons which made the pipeline networks so popular are the relatively short period of time that they need to be constructed and the low cost of their construction and operation. However, a serious issue which causes problems in the normal operation of pipeline networks is the occurrence of leaks. Therefore, a large number of leak detection and localization methods have been developed over the years. In this paper a method is proposed for this purpose, which involves the use of acoustic sensors and a Data Acquisition (DAQ) system (in combination with a proper signal processing software) in order to identify the location of leaks in pipelines. The method is based on the estimation of the time delay between the signals obtained by two …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Oscilloscope Reading Device for the Visually Impaired",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_22",
            "Abstract": "The purpose of this paper is to describe an assistive technology solution to the problem of allowing visually impaired individuals to use an oscilloscope in an electronics laboratory setting. More specific, a stylus device was implemented with which the person will scan the oscilloscope’s surface. This device interacts with the user via sound and vibration to indicate the location of the signal of interest. By sliding the stylus over the screen, the user can visualize the depicted shape, locate the waveform’s peaks and take approximate measurements of amplitude and period. In general, the device is a low cost, portable solution that will support visually impaired people to participate and understand the lab courses more effectively.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Ilp formulation for hybrid fpga mpsocs optimizing performance, area and memory usage",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6122382/",
            "Abstract": "In this paper an integer linear programming (ILP) model is proposed for identifying the optimal resources allocation and application partitioning on FPGA-based hybrid MPSoC, including the memory allocation for each processing unit and total BRAM usage on the device. The motivation behind this work is the reduction of the necessary exploration time for the identification of the optimal hybrid MPSoC architecture implementation for each particular application. Whilst many ILP model approaches have been proposed, none of the existing models presents an accurate calculation model for the BRAM usage on the FPGA device and can impose the memory usage and/or BRAM usage as a design constraint. Our work comes to fill this void, especially now that modern multimedia applications have an ever increasing need for memory space and data throughput.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A software tool for aging analysis of the CMOS inverter based on hot carrier degradation modeling",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495148/",
            "Abstract": "It has been made clear that the presence of hot carriers triggers a series of physical processes that affects the FD-SOI and FinFET device characteristics under normal circuit operation. These effects cumulatively build up over prolonged periods, causing the circuit to age with time, resulting in performance degradations that may eventually lead to circuit failure. In this paper we tackle with the HC effects using a software tool that is able to quantify the HC induced degradation of the devices in a design, and furthermore predict the lifetime of the corresponding circuit. We present the Graphical User Interface (GUI) and we give examples of tool operation.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A High Performance Multi-Core FPGA Implementation for 2D Pixel Clustering for the ATLAS Fast TracKer (FTK) Processor",
            "Publication year": 2014,
            "Publication url": "https://cds.cern.ch/record/1704424",
            "Abstract": "The high performance multi-core 2D pixel clustering FPGA implementation used for the input system of the ATLAS Fast TracKer (FTK) processor is presented. The input system for the FTK processor will receive data from the Pixel and micro-strip detectors read out drivers (RODs) at 760Gbps, the full rate of level 1 triggers. Clustering is required as a method to reduce the high rate of the received data before further processing, as well as to determine the cluster centroid for obtaining obtain the best spatial measurement. Our implementation targets the pixel detectors and uses a 2D-clustering algorithm that takes advantage of a moving window technique to minimize the logic required for cluster identification. The design is fully generic and the cluster detection window size can be adjusted for optimizing the cluster identification process. Τhe implementation can be parallelized by instantiating multiple cores to identify different clusters independently thus exploiting more FPGA resources. This flexibility makes the implementation suitable for a variety of demanding image processing applications. The implementation is robust against bit errors in the input data stream and drops all data that cannot be identified. In the unlikely event of missing control words, the implementation will ensure stable data processing by inserting the missing control words in the data stream. The 2D pixel clustering implementation is developed and tested in both single flow and parallel versions. The first parallel version with 16 parallel cluster identification engines is presented. The input data from the RODs are received through S-Links and a single data stream is also required …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:1qzjygNMrQYC",
            "Publisher": "ATL-COM-DAQ-2014-046"
        },
        {
            "Title": "http://ballade. cs. ucla. edu http://ballade. cs. ucla. edu",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777009/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です（11/11(水\n)-12/23(水)） CiNii Researchプレ版の公開について <no title> 被引用文献: 1件 著者 収録刊行物 \nhttp://ballade.cs.ucla.edu http://ballade.cs.ucla.edu 被引用文献: 1件中 1-1件を 表示 1 A Novel \nFPGA Architecture and an Integrated Framework of CAD Tools for Implementing Applications \nSIOZIOS Konstantinos , KOUTROUMPEZIS George , TATAS Konstantinos , VASSILIADIS \nNikolaos , KALENTERIDIS Vasilios , POURNARA Haroula , PAPPAS Ilias , SOUDRIS Dimitrios \n, THANAILAKIS Antonios , NIKOLAIDIS Spiridon , SISKOS Stilianos IEICE transactions /…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Description of the software power estimation framework",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=10145521953182732737&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IST-2000-30093/EASY Project, Deliverable 24, February 2003, Available: http://electronics. physics. auth. gr/easy"
        },
        {
            "Title": "Input mapping algorithm for parallel transistor structures",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cta.522",
            "Abstract": "A new algorithm for mapping every possible input pattern of a parallel transistor structure to an equivalent set of normalized inputs (having the same starting and ending point) is introduced. This algorithm is based on the analysis of the operation of the transistor structure and can be used for the development of analytical timing models for CMOS circuits. Simulation results show a very good accuracy of the algorithm. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:35N4QoGY0k4C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Modified Printed Bow-Tie Antenna for RF Energy Harvesting Applications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9245049/",
            "Abstract": "As the power requirements of electronic systems in wireless sensor networks are progressively reducing, radio frequency (RF) energy harvesting (EH) technique is becoming increasingly interesting during the last years. In this paper, we design and optimize a modified printed bow-tie antenna, operating in the frequency band of 5G NR mobile communication networks. For the optimization process, we have selected the Monarch Butterfly Algorithm that combines swarm intelligence and evolutionary characteristics. Computed results exhibit a quite acceptable performance of the optimized antenna as an RF energy harvester in the desired frequency band.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Ri6SYOTghG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "‘Circuit-level low-power design",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13778333223008004787&hl=en&oi=scholarr",
            "Abstract": "It is in the nature of digital design that any logic function can be implemented by different transistor structures. These alternatives present different characteristics in terms of speed and power dissipation, depending on the capacitance at the internal nodes, the fan-in requirements, the operating conditions and the structure itself. Speed and low power dissipation are in the most cases contradictory factors but there are also exceptions, where design for high speed results in low power circuits. Circuit designers have to be aware of this diversity of structures and the available possibilities that can be exploited to optimally correlate high speed and low power dissipation.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Taylor & Francis US"
        },
        {
            "Title": "A multi-core FPGA-based 2D-clustering implementation for real-time image processing",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6949160/",
            "Abstract": "A multi-core FPGA-based 2D-clustering implementation for real-time image processing is presented in this paper. The clustering algorithm is using a moving window technique to reduce the time and data required for the cluster identification process. The implementation is fully generic, with an adjustable detection window size. A fundamental characteristic of the implementation is that multiple clustering cores can be instantiated. Each core can work on a different identification window that processes data of independent “images” in parallel, thus, increasing performance by exploiting more FPGA resources. The algorithm and implementation are developed for the Fast TracKer processor for the trigger upgrade of the ATLAS experiment but their generic design makes them easily adjustable to other demanding image processing applications that require real-time pixel clustering.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A parallel FPGA implementation for real-time 2D pixel clustering for the ATLAS Fast Tracker Processor",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1748-0221/9/10/C10018/meta",
            "Abstract": "The parallel 2D pixel clustering FPGA implementation used for the input system of the ATLAS Fast TracKer (FTK) processor is presented. The input system for the FTK processor will receive data from the Pixel and micro-strip detectors from inner ATLAS read out drivers (RODs) at full rate, for total of 760Gbs, as sent by the RODs after level-1 triggers. Clustering serves two purposes, the first is to reduce the high rate of the received data before further processing, the second is to determine the cluster centroid to obtain the best spatial measurement. For the pixel detectors the clustering is implemented by using a 2D-clustering algorithm that takes advantage of a moving window technique to minimize the logic required for cluster identification. The cluster detection window size can be adjusted for optimizing the cluster identification process. Additionally, the implementation can be parallelized by instantiating multiple …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:a0OBvERweLwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "High performance median FPGA implementation for machine vision applications",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6815382/",
            "Abstract": "This paper presents a high performance median implementation targeting detection of microfluidic flows on Lab-on-Chips on a real-time machine vision implementation. We propose and implement a novel architecture which calculates the 2D median coordinates of a set of “active pixels” in a detection window of generic size. The proposed implementation takes full advantage of the FPGA's characteristics to achieve full performance and is part of a machine vision system which achieves real-time microfluidic flow detection on 1Mpixel input videos at 60fps. The median module itself is flexible and generic and can be used for numerous machine vision applications achieving a median calculation in a very small number of clock cycles with an operational frequency of 204MHz.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction-level power measurement methodology",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=6765692806451006559&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fine-Grain reconfigurable platform: FPGA hardware design and software toolset development",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/086/meta",
            "Abstract": "A complete system for the implementation of digital logic in a fine-grain reconfigurable platform is introduced. The system is composed of two parts. The fine-grain reconfigurable hardware platform (FPGA) on which the logic is implemented and the set of CAD tools for mapping logic to the FPGA platform. A novel energy-efficient FPGA architecture is presented (CLB, interconnect network, configuration hardware) and simulated in STM 0.18 μm CMOS technology. Concerning the tool flow, each tool can operate as a standalone program as well as part of a complete design framework, composed by existing and new tools.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Dealing with stochastic signals and physical phenomena impacting pipeline leak localization accuracy",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9459830/",
            "Abstract": "Leak localization in pipelines is a subject frequent in the literature, with most studies focusing either on the errors in the acquisition process, e.g. what types of sensors to use, or on the weak points of the signal processing methods utilized for this matter, how to deal with these vulnerabilities and improve the accuracy of those methods etc. However, another important factor that needs to be considered is the presence of several physical phenomena that take place in a pipeline and affect the creation and propagation of acoustic waves. Such phenomena like the acoustic dispersion, the frequency dependent attenuation and the resonances are studied in this paper, based on synthesized signals, and their influence on the leak localization accuracy is discussed. Furthermore, a leak localization method combining the cross-correlation technique with temporal and spectral segmentation of the acoustic signals is proposed …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:FAceZFleit8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Highly parallelized pattern matching execution for the ATLAS experiment",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7581789/",
            "Abstract": "The Associative Memory (AM) system of the Fast TracKer (FTK) processor has been designed to perform pattern matching using as input the data from the silicon tracker in the ATLAS experiment. The AM is the primary component of the FTK system and is designed using ASIC technology (the AM chip) to execute pattern matching with a high degree of parallelism. The FTK system finds track candidates at low resolution that are seeds for a full resolution track fitting. The AM system implementation is named “Serial Link Processor” and is based on an extremely powerful network of 2 Gb/s serial links to sustain a huge traffic of data. This paper reports on the design of the Serial Link Processor consisting of two types of boards, the Little Associative Memory Board (LAMB), a mezzanine where the AM chips are mounted, and the Associative Memory Board (AMB), a 9U VME motherboard which hosts four LAMB …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware support for arbitrarily complex loop structures in embedded applications",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1395732/",
            "Abstract": "The program control unit of an embedded RISC processor is enhanced with a novel zero-overhead loop controller (ZOLC) supporting arbitrary loop structures with multiple-entry/exit nodes. The ZOLC has been incorporated to an open RISC processor core to evaluate the performance of the proposed unit for alternative configurations of the selected processor. It is proven that speed improvements of 8.4% to 48.2% are feasible for the used benchmarks.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An automated development framework for a RISC processor with reconfigurable instruction set extensions",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1639476/",
            "Abstract": "By coupling a reconfigurable hardware to a standard processor, high levels of flexibility and adaptability are achieved. However, this approach requires modifications to the compiler of the processor to take into account reconfigurable aspects. In this paper, a development framework for a RISC processor with reconfigurable instruction set extensions is presented. The framework is fully automated, hiding all reconfigurable related issues from the user and can be used for both program and fine-tune the architecture at design time. We demonstrate the above issues using a set of benchmarks. Experimental results show an x2.9 average speedup in addition to potential energy reduction",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The ARISE reconfigurable instruction set extensions framework",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4285746/",
            "Abstract": "In this paper, we introduce the ARISE framework for the systematic extension of typical processors with the necessary infrastructure to support arbitrary number and type of reconfigurable hardware units. ARISE extends the micro-architecture of the processor with an interface to allow the coupling of the hardware units. Furthermore, the instruction set of the processor is extended with instructions which expose to the programmer/compiler the full control of the interface. This control includes the configuration of operations on the hardware units, execution of these operations, and communication of data between the processor and the units. The new instructions are incorporated without the need to redesign the processor instruction set architecture. To evaluate our proposal a model of an ARISE extended MIPS processor has been designed. Using a turbodecoder algorithm as benchmarking application a simulation of …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application analysis with integrated identification of complex instructions for configurable processors",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30205-6_65",
            "Abstract": "An extensible and configurable processor is a programmable platform offering the possibility to customize the instruction set and/or underlying microarchitecture. Efficient application analysis can identify the application parameters and instruction extensions that would influence processor performance. An application characterization flow is presented and demonstrated on the Wavelet/Scalar Quantization image compression application. In this context, novel application metrics are identified as the percentage cover, maximum cycle gain for each basic block and candidate-induced application speedup due to possible complex instructions. Furthermore, evaluating the instruction candidates during application analysis is proposed in order to establish a link with subsequent design space exploration steps.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Novel Design Framework for Dual-Band Frequency Selective Surfaces Using Multi-Variant Differential Evolution",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2227-7390/9/19/2381",
            "Abstract": "Frequency Selective Surfaces (FSSs) have become increasingly popular during the last years due to their combined characteristics, which meet, in general, the requirements of the next-generation wireless communication networks. In this work, a cross-platform design framework for FSS structures is presented and evaluated by utilizing a recently introduced evolutionary optimization algorithm, namely, the Multi-Variant Differential Evolution (MVDE). To the best of the authors knowledge, this is the first time that the MVDE algorithm is applied to a design problem in Electromagnetics. The proposed design framework is described in detail and the utilized evolutionary algorithm is assessed in terms of its performance by applying several benchmark functions. In this context, the MVDE is comparatively evaluated against other popular evolutionary algorithms. Moreover, it is applied to the design and optimization of two different representative examples of FSS structures based on three use cases of unit cell geometry. Optimization results indicate the efficacy of the proposed framework by quantifying the performance of the designed FSS structures in terms of several system metrics. The optimized FSS structures exhibit dual-band operation and quite acceptable results in the ISM frequency bands of 2.45 GHz and 5.8 GHz.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:0izLItjtcgwC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "The ATLAS Fast Tracker Processing Units-input and output data preparation",
            "Publication year": 2016,
            "Publication url": "https://cds.cern.ch/record/2233075",
            "Abstract": "The ATLAS Fast TracKer (FTK) is a custom hardware system for fast, associative memory based track reconstruction. It will provide tracking information within the full acceptance of the inner tracking detectors to the high level trigger at a rate of up to 100 kHz.%, thus allowing for a refined and more efficient event selection at the trigger level. At the first stage of the FTK the Data Formatter subsystem clusters inner detector hits and organizes them into 64- trigger regions. At the last stage, the FTK to Level-2 Interface Cards repackage track records and send them to the high level trigger computing farm. This report aims to give an overview over the functionality of the two systems, their hardware implementation in the Advanced Telecommunications Computing Architecture standard, and the status of their integration into ATLAS.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:evX43VCCuoAC",
            "Publisher": "ATL-COM-DAQ-2016-156"
        },
        {
            "Title": "Pass transistor operation modeling for nanoscale technologies",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24154-3_6",
            "Abstract": "This paper studies the operation of the pass transistor structure taking into account secondary effects which become intense in nanoscale technologies. The different regions of operation are determined and the differential equation which describes the pass transistor operation is solved analytically. Appropriate approximations about the current waveforms are used simplifying the modeling procedure without significant influence on the accuracy. The evaluation of the model was made through comparison with HSpice simulation results and by using three different technologies: CMOS 65 nm, CMOS 32 nm and CMOS 32nm with high-K dielectric.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:JQOojiI6XY0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "In-chip configuration for monitoring power consumption in micro-processing systems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4062113/",
            "Abstract": "A power measurement technique is presented in this work. The problem addressed is the development of a circuit for accurate measurement of power consumption in micro-processing systems, by means of current sensing. Energy measurements performed over a time period of several clock cycles determine the hardware-software related power parameters of specific groups of instructions. Moreover, this information is useful in power optimization procedures. The proposed configuration can be integrated in the system as a peripheral unit for the evaluation of the core and of the system's peripherals, offering also built-in self test ability to the low power system.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum Allocation in Next Generation Radio Networks using Emerging Nature-inspired Algorithms",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8471797/",
            "Abstract": "The key task of a cognitive radio network (CRN) is the effective allocation of spectrum resources according to user needs and requirements. In order to maximize the utilization of the available spectrum, a dynamic allocation of available channels to secondary users is needed. This problem is known as the spectrum allocation problem and it is a combinatorial optimization problem. A possible optimization algorithm that can be applied is chaotic biogeography-based optimization (CBBO). In this paper, a thorough assessment of CBBO is performed in the sense of comparing CBBO with other popular algorithms. According to the simulation results, the CBBO algorithm outperforms competing algorithms in terms of average convergence rate and accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:FPJr55Dyh1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The associative memory serial link processor for the Fast TracKer (FTK) at ATLAS",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1748-0221/9/11/C11006/meta",
            "Abstract": "The Fast TracKer (FTK) is an extremely powerful and very compact processing unit, essential for efficient Level 2 trigger selection in future high-energy physics experiments at the LHC. FTK employs Associative Memories (AM) to perform pattern recognition; input and output data are transmitted over serial links at 2 Gbit/s to reduce routing congestion at the board level. Prototypes of the AM chip and of the AM board have been manufactured and tested, in preparation of the imminent design of the final version.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:olpn-zPbct0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Application of the power contributors method for the AOI22 CMOS cell",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8742028/",
            "Abstract": "The prediction of the static power consumption and the leakage currents, flowing in CMOS cells, is a very important task. This task has to be completed early in the design cycle. Moreover, it is time consuming, because it must be repeated for all cells that comprise a design library and also for all input combinations of them. However, the Power Contributors Method has been proposed in order to facilitate this procedure. Any cell into a datum input state can be decomposed into elementary structures, called Power Contributors where the leakage currents that flow in them are modeled. Thereafter, these structures are combined in order to provide accurate expressions for the leakage currents and static power consumption of the initial cells. The derived models are functions of temperature, supply voltage and transistor width. This method has been applied into an AOI22 cell from NanGate Open Cell library, giving very …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Section on Recent Advances in Circuits and Systems--Part 1-Programmable Logic, VLSI, CAD and Layout-A Novel FPGA Architecture and an Integrated Framework of CAD Tools for Implementing",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=157745220629093530&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Tokyo, Japan: Institute of Electronics, Information and Communication Engineers, c1992-"
        },
        {
            "Title": "The AMDREL Project in Retrospective",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Vasilis-Kalenteridis/publication/255910966_The_AMDREL_Project_in_Retrospective/links/02bfe5134a4ed0adaf000000/The-AMDREL-Project-in-Retrospective.pdf",
            "Abstract": "The design of an novel embedded fine-grain reconfigurable hardware architecture (FPGA) is introduced. The architecture features a number of circuit-level low-power techniques, since power consumption was considered as a primary design goal. Additionally, EX-VPR and DAGGER software tools (part from the MEANDER framework) were presented. The developed tool set design flow is used for mapping logic to the FPGA platform. The novel energy-efficient FPGA architecture was implemented in 0.18 μm STM CMOS technology. The efficiency of the entire system (FPGA and tools) was proven by comparisons with the existing contemporary commercial and academic FPGA systems.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Instruction-level energy characterization of an ARM processor",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=16588676319109779736&hl=en&oi=scholarr",
            "Abstract": "➢ The ARM7TDMI processor placed on the Integrator/CM7TDMI product of the ARM Ltd was used for the instruction-level power models➢ This chip has separated power supply pins for the processor core➢ The board provides the opportunity to drive the processor core from external supply and measuring device➢ This is done by removing a resistor and connecting this device at a test point of the board",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Variability of nanoscale triple gate FinFETs: prediction and analysis method",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7050084/",
            "Abstract": "Our analytical compact drain current model for undoped or lightly doped nanoscale FinFETs has been successfully used to predict variability in the electrical characteristics of FinFETs. A simplified version of the model behaves almost as good as the analytical model but is more computational time efficient. Implementation of the models in verilog-A can be used to predict variability in circuits such as the inverter.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A flexible instruction generation framework for extending embedded processors",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1653052/",
            "Abstract": "Modern platform-based design involves the domain-specific extension of embedded processors to fit customer requirements. To accomplish this task, the possibilities offered by recent extensible processors for their instruction set and microarchitectural customization have to be exploited. In this paper, a design approach that encapsulates automated workload characterization and highly-controllable instruction and application-specific functional unit (AFU) generation is utilized for fast extension space exploration of embedded processors. It is proved that a relatively small number of unique AFUs is needed in order to support embedded applications from the MiBench and Powerstone suites. It is possible to achieve 1.8times to 6.8times performance improvements although further possibilities such as subword parallelization are not currently regarded",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart Irrigation System for Precision Agriculture-The AREThOU5A IoT Platform",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9239397/",
            "Abstract": "Agriculture 4.0, as the future of farming technology, includes several key enabling technologies towards sustainable agriculture. The use of state-of-the-art technologies, such as the Internet of Things, transform traditional cultivation practices, like irrigation, to modern solutions of precision agriculture. In this paper, we present in detail the subsystems and the architecture of an intelligent irrigation system for precision agriculture, the AREThOU5A IoT platform. We describe the operation of the IoT node that is utilized in the platform. Moreover, we apply the radiofrequency energy harvesting technique to the presented IoT platform, as an alternative technique to deliver power to the IoT node of the platform. To this end, we fabricate and validate a rectenna module for radiofrequency energy harvesting. Experimental results of the fabricated rectenna exhibit a satisfactory performance as a harvester of ambient sources in an …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:YohjEiUPhakC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The ATLAS Fast TracKer-input and output data preparation",
            "Publication year": 2016,
            "Publication url": "https://s3.cern.ch/inspire-prod-files-b/bbdc4a86aec6db569e89d09a88ca295f",
            "Abstract": "As an integral part of the upgrades to the ATLAS detector [1] trigger system for the ongoing LHC Run 2, the Fast TracKer [2](FTK) will provide hardware based tracking at the trigger level. It is designed to reconstruct tracks above a transverse momentum threshold of 1 GeV in the full acceptance of the tracking detectors for all events accepted by the hardware based Level-1 Trigger (L1) at a rate of up to 100kHz. The FTK tracks are then to be provided to the software based High Level Trigger (HLT) with a latency below 100 µs. Full tracking information is expected to boost the performance of many HLT algorithms, in particular for b-tagging and τ-identification. The ATLAS trigger layout is illustrated in Figure 1 (left). calo/muon pixel/SCT other",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using distributed ledger technology to democratize neural network training",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10489-021-02340-3",
            "Abstract": "Artificial Intelligence has regained research interest, primarily because of big data. Internet expansion, social networks and online sensors led to the generation of an enormous amount of information daily. This unprecedented data availability boosted Machine Learning. A research area that has greatly benefited from this fact is Deep Neural Networks. Nowadays many use cases require huge models with millions of parameters and big data are proven to be essential to their proper training. The scientific community has proposed several methods to generate more accurate models. Usually, these methods need high performance infrastructure, which limits their applicability to large organizations and institutions that have the required funds. Another source of concern is privacy; anyone using the leased processing power of a remote data center, must trust another entity with their data. Unfortunately, in many cases …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Reducing power consumption in memories",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=9943421875101725797&hl=en&oi=scholarr",
            "Abstract": "Memory circuits which form an integral part of every digital system, consume often significant power compared to processing units, especially in embedded systems for data-intensive applications. Power reduction techniques for SRAM and DRAM memories, address three key issues that affect energy consumption: static current, supply voltage and charging/discharging capacitance. Past efforts have resulted in continuous power reduction for each memory generation; however, future research has to deal with tradeoffs arising from performance degradation for lower supply voltage and standby power dissipation due to subthreshold leakage currents.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Leak Detection Algorithm for Pipelines in Noisy Environments",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9140558/",
            "Abstract": "Many methods have been proposed for leak detection in pipelines. The method based on the acoustic signals created by the leakage is a non-destructive method and has presented reliable results. However, applying such a method in noisy environments is still a challenge. In this paper, a leak detection method applied in pipes which are located in a highly noise environment of the process area of an oil refinery is introduced. The proposed detection algorithm takes into account the frequency contents of the noise and the signals of the leaks as well as some statistical characteristics of the noise. Processing of measurements in time windows of 1s are found enough for decision making, keeping the response time of leakage detection very low. Results have shown reliable detection of leaks in sufficient distances without false alarms while there is the ability for the discrimination of some accidental or periodic events …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:ClCfbGk0d_YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Future evolution of the Fast TracKer (FTK) processing unit",
            "Publication year": 2014,
            "Publication url": "https://inspirehep.net/files/11f39ebf77a92415007c1da64c4ab101",
            "Abstract": "The Fast TracKer (FTK) processor [1] for the ATLAS experiment [2] is a processing unit that increases efficiency in the software-based High Level Triggers (HLT) selection, by offering fast track reconstruction [3]. The algorithm is split in two parts; the first part performs pattern recognition on a lower resolution representation of the detector data; the second part computes linear fits of the tracks found in the matched patterns, using the full resolution version of the detector hits. The Fast TracKer system comprises a set of boards, two of which implement the main functionality. One is called Associative Memory Board (AMB), and mounts 4 Local Associative Memory Boards (LAMB), which in turn feature 16 Associative Memory Chips each; the pattern matching operation is performed in that board [4]. To each AMB, another board called the Auxilliary Board (AUX) is connected. Its main components are 4 FPGA units, corresponding to one LAMB each. They perform functions of data storage and the Track Fitting computations. The goal is to integrate each Associative Memory Chip with its own FPGA device and an auxilliary RAM memory die into a single package which will be called AMSiP, essentially miniaturizing the FTK system. In that way, much more track fitting performance is available per pattern and much smaller latency figures are possible. The target of the upgraded system will be tracking to assist in first level (L1) trigger selection [5, 6]. As a first stage, the current FTK detector layout is chosen for the structural parameters of the architecture for reasons of practicality, but the resulting system will be parametric and possible to target to other applications …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:XiSMed-E-HIC",
            "Publisher": "ATL-COM-DAQ-2014-066"
        },
        {
            "Title": "FPGA-based Canny Edge Detection for Real-Time Applications",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Abdoul-Rjoub/publication/239735539_FPGA-based_Canny_Edge_Detection_for_Real-Time_Applications/links/5817af5608aeb720f689b13a/FPGA-based-Canny-Edge-Detection-for-Real-Time-Applications.pdf",
            "Abstract": "Real-time video applications are becoming very popular in the recent years. Their implementations vary greatly from multimedia and security applications to medical imaging. One of the most common and fundamental algorithms used in these applications is edge detection. However, edge detection is a time and resource consuming process and extra effort is required for reaching the necessary speed for real-time response. The hardware design of such algorithms is becoming more and more complex by the ever increasing demand for higher resolution image processing. In this paper an FPGA-based Canny edge detector design is proposed that takes advantage of a four-pixel parallel implementation. The characteristics of the design effectively reduce the computational time without increasing the need for available memory space. The proposed work targets high definition real-time video applications and achieves very high frames per second rate.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Current variations measurements for the estimation of software-related power consumption",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1007205/",
            "Abstract": "A current measurement configuration for the estimation of the power consumption of low-power processing systems is presented in this work. The problem addressed is to measure the current variations of digital circuits (and especially of embedded processing circuits) and try to identify from these measurements the energy consumption variations associated with certain tasks performed by the system software. Accurate monitoring of the instantaneous variations of the power supply current may provide the appropriate information for the estimation of the power consumption at different operating situations of the processor (core) and of the overall processing system as well (consumption of peripheral units). The proposed instantaneous current measuring approach, along with the execution of special test programs for analysis of inter-instruction effects, is expected to provide clear information of the power behavior of …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analytical delay model for reram memory cells",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8106961/",
            "Abstract": "In this paper, we present a simple analytical delay model for memristive memory cells. The output voltage evolution is obtained analyzing the charge-flux dynamics when a voltage ramp is applied to the input. From this evolution, the propagation delay is calculated. The model is validated using the VTEAM memristor model for different input rise time values of the applied ramp. The proposed model can be used for accurate estimations of the dynamic behavior of huge ReRAM circuits when included in event-driven simulators.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Serial Link Processor for the Fast TracKer (FTK) processor at ATLAS",
            "Publication year": 2014,
            "Publication url": "https://cds.cern.ch/record/1702399",
            "Abstract": "The Associative Memory (AM) system of the FTK processor has been designed to perform pattern matching using the hit information of the ATLAS silicon tracker. The AM is the heart of the FTK and it finds track candidates at low resolution that are seeds for a full resolution track fitting. To solve the very challenging data traffic problems inside the FTK, multiple designs and tests have been performed. The currently proposed solution is named the “Serial Link Processor” and is based on an extremely powerful network of 2 Gb/s serial links. This paper reports on the design of the Serial Link Processor consisting of the AM chip, an ASIC designed and optimized to perform pattern matching, and two types of boards, the Local Associative Memory Board (LAMB), a mezzanine where the AM chips are mounted, and the Associative Memory Board (AMB), a 9U VME board which holds and exercises four LAMBs. Special relevance will be given to the AMchip design that includes two custom cells optimized for low consumption. We report also on the performance of a first prototype based on the use of a min@ sic AM chip, a small but complete version of the final AM chip, built to test the new and fully serialized I/O. A dedicated LAMB prototype, named miniLAMB, with reduced functionalities, has been produced to test the mini@ sic. The serialization of the AM chip I/O significantly simplified the LAMB design. We report on the characterization of the min@ sic chip, the tests and performance of the integrated system mini@ sic, miniLAMB and AMB.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:uLbwQdceFCQC",
            "Publisher": "ATL-COM-DAQ-2014-025"
        },
        {
            "Title": "Modeling leakage currents of different CMOS cells by the power contributors method",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801976",
            "Abstract": "This paper illustrates the Power Contributors method into modeling of leakage currents and static power consumption for different CMOS cells from the NanGate OpenCell library. These cells are decomposed into Power Contributors, and all the leakage currents which run through their terminals, are modeled in a systematic way. The results prove that this method facilitates the modeling procedures, without sacrificing their accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of an Artificial Neural Network Approach for Timing Modeling of CMOS Gates",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8464162/",
            "Abstract": "The development of reliable and fast timing models for CMOS logic gates is a significant task for the IC technology. Analytical approaches have been proposed to accelerate timing analysis while keeping the accuracy in acceptable levels. However, the complexity of the analytical modeling procedure increases as we are moving towards new technology nodes influencing mostly the provided accuracy. The artificial neural network (ANN) approach could be a solution to this complexity. In this paper, the use of ANNs for timing modeling of CMOS gates is evaluated. Several different ANNs schemes are developed, optimized and studied regarding their accuracy, resource requirements and speed. Moreover, we design a new training method by combing the Particle Swarm Optimization (PSO) a meta-heuristic algorithm in conjunction with the Levenberg-Marquardt (LM) backpropagation algorithm. The outcomes show …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scalable register bypassing for FPGA-based processors",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933109000714",
            "Abstract": "In this paper, a scalable scheme, configurable via register-transfer level parameters, for full register bypassing in a modern embedded processor architecture, termed ByoRISC, is presented. The register bypassing specification is parameterized regarding the number of homogeneous register file read and write ports and the number of pipeline stages of the processor. The performance characteristics (cycle time, chip area) of the proposed technique have been evaluated for FPGA target implementations of the synthesizable ByoRISC model. It is proved that, a full bypassing network is a viable solution for the elimination of data hazards when servicing instructions with multiple read and write operands. While the maximum clock frequency is reduced by 17.9% in average, when using partial versus full forwarding, the positive effect of custom computation eliminates this effect by providing cycle speedups of 3.9× to 5.5× …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:ldfaerwXgEUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Pipeline Leak Detection in Noisy Environment",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741673/",
            "Abstract": "One of the safest ways for transporting fluid materials, such as natural gas, petroleum products, water etc., is the use of pipelines. However, a major problem in pipeline systems is the occurrence of leaks, which result in many environmental problems, dangerous accidents and financial loss. For this reason, many leak detection techniques have been developed over the past years. In this paper, an Acoustic Emission (AE) method for the detection and localization of a leak in a pipeline is presented. The AE method employs the use of acoustic sensors mounted on the external surface of the pipeline, which receive acoustic signals created due to the existence of a leak. The localization of the leak can be achieved by determining the time difference between the moments that such an acoustic signal arrives to two adjacent sensors. Two ways for calculating this time difference are presented in this paper: the Threshold …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:k8Z6L05lTy4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multi-core FPGA-based 2D-clustering algorithm for high-throughput data intensive applications",
            "Publication year": 2014,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814603164_0123",
            "Abstract": "A multi-core FPGA-based clustering algorithm for high-throughput data intensive applications is presented. The algorithm is optimized for data with two dimensional organization (e.g. image processing, pixel detectors for high energy physics experiments etc.). It uses a moving window of generic size to adjust to the application's processing requirements (the cluster sizes and shapes that appear in the input data sets). One or more windows (cores) can be used to identify clusters in parallel, allowing for versatility to increase performance or reduce the amount of used resources. In addition to the inherent parallelism the algorithm is executed in a pipeline, thus allowing for readout to be performed in parallel with the cluster identification.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysing the operation of the basic pass transistor structure",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cta.371",
            "Abstract": "Pass transistor logic has become important for the design of low‐power high‐performance digital circuits due to the smaller node capacitances and reduced transistors count it offers. However, the acceptance and application of this logic depends on the availability of supporting automation tools, e.g. timing simulators, that can accurately analyse the performance of large circuits at a speed, significantly faster than that of SPICE based tools. In this paper, a simple and robust modelling technique for the basic pass transistor structure is presented, which offers the possibility of fast timing analysis for circuits that employ pass transistors as controlled switches. The proposed methodology takes advantage of the physical mechanisms in the pass transistor operation. The obtained accuracy compared to SPICE simulation results is sufficient for a wide range of input and circuit parameters. Copyright © 2006 John Wiley & …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:4TOpqqG69KYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Energy-aware system-on-chip for 5 GHz wireless LANs",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11556930_18",
            "Abstract": "This paper presents the realization of an energy-aware system-on-chip that implements the baseband processing as well as the medium access control and data link control functionalities of a 5 GHz wireless system. It is compliant with the HIPERLAN/2 standard, but it also covers critical functionality of the IEEE 802.11a standard. Two embedded processor cores, dedicated hardware, on-chip memory elements, as well as advanced bus architectures and peripheral inter-faces were carefully combined and optimized for the targeted application, leading to a proper trade-off of silicon area, flexibility and power consumption. A system-level low-power design methodology has been used, due to the fact that power consumption is the most critical parameter in electronic portable system design. The 17.5 million-transistor solution was implemented in a 0.18 μm CMOS pro-cess and performs baseband processing at …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Energy-Aware SYstem-on-chip design of the HIPERLAN/2 standard IST-2000-30093",
            "Publication year": 2003,
            "Publication url": "http://electronics.physics.auth.gr/easy/deliverables/Deliverable_24.pdf",
            "Abstract": "In this report the design and implementation of a software power estimation framework is described. The developed software estimates the energy consumption for the ARM7TDMI processor based on the instruction-level energy models that have been derived. The kernel of the program, which receives as input the trace file of executed assembly instructions, contains the physical measurements that have been performed and calculates the base and inter-instruction energy cost of a given program. The software takes also into account all other factors influencing the total power consumption. The kernel is coupled with a Graphical User Interface that enables easy access to the energy results. The source code for the kernel is written in the C programming language while the Graphical User Interface in Java.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A portable specification of zero-overhead looping control hardware applied to embedded processors.",
            "Publication year": 2006,
            "Publication url": "http://www.nkavvadias.com/publications/kavvadias_iscas06_cr.pdf",
            "Abstract": "Looping operations impose a significant bottleneck to achieving better computational efficiency for embedded applications. To confront this problem on embedded RISC processors, an architectural modification involving the integration of a zerooverhead loop controller (ZOLC) has been suggested, supporting arbitrary loop structures with multiple-entry and multiple-exit nodes. In this paper, a graph formalism is introduced for representing the loop structure of application programs, which can assist in ZOLC code synthesis. Also, a portable description of a ZOLC component is given in detail, which can be exploited in the scope of RTL synthesis, compiler optimizations or assembly level transformations for enabling its utilization. This description is designed to be easily retargetable to single-issue RISC processors, requiring only minimal effort for this task.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A counter architecture for reducing hot-carrier induced transistor aging effects",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495154/",
            "Abstract": "In many cases transistor aging may lead to the failure of a digital system before its designated lifetime requirement. The continuous stressing of transistors during operation affects their operational characteristics, degrading the performance of the circuits. The threshold voltage gradually increases and thus provoking the decrease of the driving ability of the transistors. This leads to a gradual degradation of the operating frequency making the system impossible to meet hard real time requirements after a certain time. New architectures have to be proposed for circuits which are mostly exposed to the aging phenomenon. In this paper, an alternative architecture for the counter unit is proposed which balances the transition activity through the circuit. The number of transitions at critical nodes of the circuit is reduced and thus the rate of performance degradation decreases.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measurements analysis of the software-related power consumption in microprocessors",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1315991/",
            "Abstract": "In this paper the measurements taken for the development of instruction-level energy models for microprocessors are presented and analyzed. An appropriate measuring environment and a suitable measuring methodology were developed for taking the necessary measurements. The energy of an instruction is defined as a sum of three components, which are the pure base energy cost, the interinstruction cost, and the effect of the energy-sensitive factors (instruction parameters). These components are characterized for each instruction of the ARM7TDMI embedded processor, and their values are analyzed. Using the resulting models, estimates of the energy consumption of real software kernels with up to only 6% error were determined.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-Efficiency Triple-Band RF-to-DC Rectifier Primary Design for RF Energy-Harvesting Systems",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1221562",
            "Abstract": "Radio Frequency (RF) energy harvesting has been emerged as a potentially reliable method to replace the costly and difficult to maintain source of low-power wireless sensor networks. A plethora of dual-band rectifier designs has been proposed in the literature operating in various frequency bands. In this paper, a triple-band RF-to-DC rectifier that operates in the frequency bands of LoRaWAN, GSM-900, and WiFi 2.4 GHz is presented. The system is composed of an impedance-matching circuit, an RF-to-DC rectifier, that converts the ambient RF energy into DC voltage able to feed low-power devices, and an output load. The proposed system resonates at three different frequencies of 866 MHz, 948 MHz and 2423 MHz, which fall within the aforementioned frequency bands of interest. The feasible solution of the proposed system was based on a dual-band rectifier operating in the frequency bands of LoRaWAN and GSM-900. A series of shunt stubs was utilized in the initial design to form the feasible solution of the proposed system. The proposed triple-band rectifier was optimized using a powerful optimization algorithm, i.e., the genetic algorithm. The overall system exhibited improved characteristics compared to the initial design in terms of its resonance. Numerical results demonstrated that the overall system exhibited an efficiency of 81% with 3.23 V of the output voltage, for an input power of 0 dBm and a load of 13 kOhm.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:anf4URPfarAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Dual-Band RF-to-DC Rectifier with High Efficiency for RF Energy Harvesting Applications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9200262/",
            "Abstract": "Radio Frequency (RF) energy harvesting is emerging as a potentially reliable method to replace the costly and, difficult to maintain, source of low-power wireless sensors networks. In this paper, a dual-band RF-to-DC rectifier, that operates at LoRaWAN and GSM-900 cellular communication frequency bands, is presented. The system is composed of an impedance matching circuit, an RF-to-DC rectifier, that converts the ambient RF energy into DC voltage able to feed low power devices, and an output load. The proposed system resonates at two different frequencies of 866 MHz and 937 MHz. Numerical results demonstrate that the overall system exhibits an efficiency of 80% with 4.32 V of output voltage at 0 dBm of input power.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:PVjk1bu6vJQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parametric architecture for implementing multimedia algorithms",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028322/",
            "Abstract": "Multimedia applications are characterized by high computational demands related to data transfer and storage operations. Multimedia algorithms in their majority consist of regular repetitive loop constructs. In this paper, a novel control architecture for implementing such loop intensive algorithms is described. The proposed control unit takes advantage of the regularity of computations in order to serve as high performance parametric controller of multimedia datapaths. The control unit cooperates with datapath modules and their corresponding controlling FSM. Algorithmic flow dependencies which determine the appropriate loop sequencing are mapped on a LUT. For another algorithm to execute, LUT context and FSM configurations only have to be reprogrammed. Thus, partial reconfiguration possibilities for implementing multimedia algorithms on programmable platforms can be exploited. For demonstration …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated instruction-set extension of embedded processors with application to MPEG-4 video encoding",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1540378/",
            "Abstract": "A recent approach to platform-based design involves the use of extensible processors, offering architecture customization possibilities. Part of the designer responsibilities is the domain-specific extension of the baseline processor to fit customer requirements. Key issues of this process are the automated application analysis and candidate instruction identification/selection for implementation as application-specific functional units (AFUs). In this paper, a design approach that encapsulates automated workload characterization and instruction generation is utilized for extending processors to efficiently support embedded application sets. The method used for instruction generation is a highly parameterized adaptation of the MaxMISO technique, which allows for fast design space exploration. It is proven that only a small number of AFUs are needed in order to support the algorithms of interest (MPEG-4 encoding …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A study for replacing CMOS gates by equivalent inverters",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7169014/",
            "Abstract": "Analysis of the operation of CMOS gates is a complicated procedure. These gates can be replaced by equivalent inverters and therefore the expressions for the inverters are used to determine the electrical characteristics of the gates. In this paper, the equivalent inverter approach for replacing CMOS gates is evaluated. The NAND gate is used for this evaluation. Parametric expressions are created to determine the transistors widths of the equivalent inverter. A systematic method is used for incorporating the parameter dependencies in the expressions. Results verify the accuracy of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Memory hierarchy exploration for low power architectures in embedded multimedia applications",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958117/",
            "Abstract": "Multimedia applications are characterized by an increased number of data transfer and storage operations due to real time requirements. Appropriate transformations can be applied at the algorithmic level to improve crucial implementation characteristics. The effect of the data-reuse transformations on power consumption, area and performance of multimedia applications realized on embedded cores is examined. As demonstrators, widely applicable video processing algorithmic kernels, namely the row-column decomposition DCT and its fast implementation found in MPEG-X, are used. Experimental results prove that significant improvements in power consumption can be achieved without performance degradation by the application of data-reuse transformations in combination with the use of a custom memory hierarchy.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast leak localization based on acoustic signal attenuation for pipelines in high-noise environment",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9218320/",
            "Abstract": "Pipeline networks are being used worldwide for a variety of reasons. A major problem that poses an obstacle to the safe and normal operation of a pipeline network is the occurrence of leaks. In the past years a large number of leak localization methods have been developed and they have presented appreciable accuracy in the estimation of the leak position. However, apart from the accuracy of such a method, another important factor is the amount of time needed for a system implementing this method to provide results, which is a topic rarely encountered in the literature. In this article a leak localization method based on the attenuation of acoustic leak signals propagating in a pipeline is presented. The minimum duration of the measurements needed for avoiding accuracy degradation is determined. By this approach accurate results in shorter time than the traditional time-delay estimation methods are achieved …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:86PQX7AUzd4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy consumption estimation in embedded systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4426072/",
            "Abstract": "This paper presents an energy consumption modeling technique for embedded systems based on a microcontroller. The software tasks that run on the embedded system are profiled, and their characteristics are analyzed. The type of executed assembly instructions, as well as the number of accesses to the memory and the analog-to-digital converter, is the required information for the derivation of the proposed model. An appropriate instrumentation setup has been developed for measuring and modeling the energy consumption in the corresponding digital circuits.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pass transistor operation for rising ramps in both terminal inputs",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/65486407/Pass_transistor_operation_for_rising_ram20210122-12109-1fmec5o.pdf",
            "Abstract": "In this paper the operation of the pass transistor for rising ramp signals in both terminal inputs, is analyzed. The differential equation of the circuit structure is solved, making the appropriate approximations, and analytical formulas for the output voltage is derived. Second order effects for nanoscale devices are taking into account. Comparison results with SPICE simulations are shown for various circuit configurations. The proposed model presents very good accuracy for 90nm and 65mn technologies.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:N5tVd3kTz84C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Improving the Evaluation of the Period and Amplitude of a Signal for Visually Impaired Individuals",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741874/",
            "Abstract": "The purpose of this paper is to describe an assistive technology solution to the problem of allowing visually impaired individuals to use an oscilloscope to determine the period and amplitude of a signal in an electronics laboratory setting. The proposed solution includes the utilization of an electronic stylus device that the user can use to initially identify the waveform's shape and then measure its properties. While the identification process can be easily implemented with the combination of a photocell and a tone buzzer to indicate where there's light present on the screen, the measurement of the period and the amplitude can be more challenging and requires a certain degree of accuracy and reliability. A previous design involved the mechanical rotation of a wheel, which was not satisfactory enough. The present design and realization are based on the optical motion sensor which resolves many of the problems …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:M7yex6snE4oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction level power models for embedded processors",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=12205861604980827165&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Equivalent inverter-based characterization tool for nano-scale CMOS digital cells: Non-linear-delay-models evaluation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376622/",
            "Abstract": "Fast and sufficiently accurate modeling of timing/power characteristics of CMOS logic cells facilitates significantly the design phase of integrated circuits. Recently, we presented an equivalent inverter-based modeling tool where an analytical inverter model with appropriate transistor widths provided accelerated (relative to conventional SPICE simulators) timing/power table-based characterizations for the combinational cells consisted in a nano-scale CMOS cell library. Here, we validate the NLDM models exported by our characterization tool in a benchmark circuit which consists of different CMOS gates connected in series. The reported errors further verify this modeling approach.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:BwyfMAYsbu0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Track Finding Mezzanine for Level-1 triggering in HL-LHC experiments",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937676/",
            "Abstract": "The increase of the luminosity in the High Luminosity upgrade of the CERN Large Hadron Collider (HL-LHC) will require the use of Tracker information in the evaluation of the Level-1 trigger in order to keep the trigger rate acceptable (i.e.: <;1MHz). In order to extract the track information within the latency constraints (<;5μs), a custom real-time system is necessary. We developed a prototype of the main building block of this system, the Pattern Recognition Mezzanine (PRM) that combines custom Associative Memory ASICs with modern FPGA devices. The architecture, functionality and test results of the PRM are described in the present work.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variability analysis—Prediction method for nanoscale triple gate FinFETs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6842095/",
            "Abstract": "We expanded our analytical compact model for the drain current of undoped or lightly doped nanoscale FinFETs, in order to predict and decompose variability in the electrical characteristics of FinFETs. The model has been evaluated by comparison to TCAD simulated devices with predefined variability. Successful application to experimental data of FinFETs with fin width W fin = 15 nm, gate length L G  =30 nm, equivalent gate oxide thickness t ox  = 1.7 nm and fin height H fin = 65 nm, has attributed their behavior to geometrical variations (of L G , W fin ) and variability in the metal gate work function (Φ m ). Furthermore, variability of FinFETs having different number of fins (2-50) and fin's pitch (200-1000 nm) has been investigated.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design space exploration tools for the ByoRISC configurable processor family",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1403.6632",
            "Abstract": "In this paper, the ByoRISC (Build your own RISC) configurable application-specific instruction-set processor (ASIP) family is presented. ByoRISCs, as vendor-independent cores, provide extensive architectural parameters over a baseline processor, which can be customized by application-specific hardware extensions (ASHEs). Such extensions realize multi-input multi-output (MIMO) custom instructions with local state and load/store accesses to the data memory. ByoRISCs incorporate a true multi-port register file, zero-overhead custom instruction decoding, and scalable data forwarding mechanisms. Given these design decisions, ByoRISCs provide a unique combination of features that allow their use as architectural testbeds and the seamless and rapid development of new high-performance ASIPs. The performance characteristics of ByoRISCs, implemented as vendor-independent cores, have been evaluated for both ASIC and FPGA implementations, and it is proved that they provide a viable solution in FPGA-based system-on-a-chip design. A case study of an image processing pipeline is also presented to highlight the process of utilizing a ByoRISC custom processor. A peak performance speedup of up to 8.5 can be observed, whereas an average performance speedup of 4.4 on Xilinx Virtex-4 targets is achieved. In addition, ByoRISC outperforms an experimental VLIW architecture named VEX even in its 16-wide configuration for a number of data-intensive application kernels.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "http://search. cpan. org/~ gslondon/Hardware-Vhdl-Parser-0.12 http://search. cpan. org/~ gslondon/Hardware-Vhdl-Parser-0.12",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777025/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文を\nさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて \n本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ \n出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施\n中です（11/11(水)-12/23(水)） CiNii Researchプレ版の公開について <no title> 被引用文献: 1件 \n著者 収録刊行物 http://search.cpan.org/〜gslondon/Hardware-Vhdl-Parser-0.12 http://search.cpan.org/〜gslondon/Hardware-Vhdl-Parser-0.12 \n被引用文献: 1件中 1-1件を 表示 1 A Novel FPGA Architecture and an Integrated Framework \nof CAD Tools for Implementing Applications SIOZIOS Konstantinos , KOUTROUMPEZIS \nGeorge , TATAS Konstantinos , VASSILIADIS Nikolaos , KALENTERIDIS Vasilios , \nPOURNARA Haroula , PAPPAS Ilias , SOUDRIS Dimitrios , Antonios , (…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-level safety mechanisms for safety-critical application-specific low power devices",
            "Publication year": 2005,
            "Publication url": "http://www.wseas.us/e-library/conferences/2005athens/cscc/papers/497-779.doc",
            "Abstract": "The introduction of high-level sophisticated mechanisms can bridge the gap in the field of safety-critical applications design and the low-power design. Two modified mechanisms that allow event driven operation with respect to safety requirements and on-line testing are presented. An optimized instruction-opcode mapping algorithm for application specific capable processing units is also introduced to assist the above mechanisms. The whole work has been applied to a commercial product and a 40% of power saving has been achieved.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparison of Time Delay Estimation Methods Used for Fast Pipeline Leak Localization in High-Noise Environment",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/716238",
            "Abstract": "Pipeline networks are one of the most efficient and extensively used means for transporting fluid products. However, they suffer from a serious problem that threatens their normal and secure operation, which is the occurrence of leaks. In this article, an acoustic technique for the localization of leaks in pipelines placed in the high-noise environment of an oil refinery is described. This technique is based on the estimation of the time delay between the moments at which an acoustic signal produced by a leak reaches two sensors mounted on the external surface of the pipeline at a certain distance between them. For this reason, three different time delay estimation methods, based on the cross-correlation procedure, are studied in this article. These methods are tested for their accuracy in the estimation of the leak position, as well as for their ability to work with measurements of short duration and the results are compared. This is important because the acquisition duration affects directly the response time of the leak localization system, which is a crucial parameter for the targeted applications. Finally, an algorithm for fast and accurate identification of the leak point is proposed. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A complete platform and toolset for system implementation on fine-grain reconfigurable hardware",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933104001395",
            "Abstract": "In this paper a complete system for the implementation of digital logic in a fine-grain reconfigurable platform is introduced. The system is composed of two parts: the fine-grain reconfigurable hardware platform (FPGA) on which the logic is implemented and the set of CAD tools for mapping logic to the FPGA platform. It is the first such complete academic system. The novel energy efficient FPGA architecture was designed and simulated in STM 0.18 μm CMOS technology. The detailed design and circuit characteristics of the Configurable Logic Block as well as the interconnection network are determined and evaluated for energy, delay and area. Concerning the tool flow, each tool can operate as a standalone program as well as part of a complete design framework, composed by existing and new tools.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A highly parallel FPGA implementation of a 2D-clustering algorithm for the ATLAS Fast TracKer (FTK) processor",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7097431/",
            "Abstract": "The highly parallel 2D-clustering FPGA implementation used for the input system of the Fast TracKer (FTK) processor for the ATLAS experiment of the Large Hadron Collider (LHC) at CERN is presented. The LHC after the 2013-2014 shutdown periods is planned to have increased luminosity, which will make it more difficult to have efficient online selection of rare events due to the increase of the overlapping collisions. FTK is a highly-parallelized hardware system that improves the online selection by executing real time track finding using the information from the silicon inner detector. The FTK system requires fast and robust clustering of the hits retrieved from the silicon detector on FPGA devices. We show the development of the original input boards and the implemented clustering algorithm. For the complicated 2D-clustering, a moving window technique is used to minimize the use of FPGA resources. The …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AMDREL: On Designing Reconfigurable Embedded Structures for the Future Reconfigurable SoC for Wireless Communication Applications.",
            "Publication year": 2002,
            "Publication url": "http://ikee.lib.auth.gr/record/249838/files/Nikolaidis%20et%20al.pdf",
            "Abstract": "The objective of the AMDREL (Architectures and Methodologies for Dynamic Reconfigurable Logic) project is to develop methodologies, tools and intellectual property blocks to be integrated in a partly dynamically reconfigurable System-on-Chip (SoC) implementation platform for the efficient realization of wireless communications systems. The proposed tools, reusable intellectual property blocks and the mixed granularity reconfigurable blocks will be used for the development of systems from the wireless communication domain including critical paths of wireless LAN systems (eg HIPERLAN/2, IEEE 802.11 a).The developed blocks and tools will be integrated as a System-on-Chip. There are three types of reconfigurable hardware involved: i) coarse-grain reconfigurable hardware (ie multipliers with reconfigurable wordlength, radix etc.) with power dissipation being an important consideration, ii) fine-grain reconfigurable hardware (FPGA-like structures). Also, the tools for mapping logic to these reconfigurable blocks and iii) reconfigurable interconnect for the blocks mentioned above. AMDREL offers significant innovations in all the above areas of reconfigurable computing.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodology for calculating the undetectable double-faults in self-checking circuits",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126603000854",
            "Abstract": "In this paper, a methodology for the calculation of the undetectable  double-faults in self-checking circuits with  bit-sliced architecture is introduced. This methodology is based  on a systematic exploration of the combinations of nodes where  undetectable double-faults can arise. The self-checking  n-bit 2-to-1 multiplexer coded by parity is  used as a test vehicle for the presentation of the methodology and the  number of the undetectable double-faults is given in a parametric  way. The proposed methodology can easily be applied to other  bit-sliced circuits. Common self-checking circuits are  implemented for different coding schemes and are using standard cell  technology to verify the proposed methodology. The effectiveness of  these implementations in fault detection as well as their requirements  in hardware and power are also investigated.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:tOudhMTPpwUC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Enhancing a reconfigurable instruction set processor with partial predication and virtual opcode support",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11802839_30",
            "Abstract": "A previously proposed Reconfigurable Instruction Set Processor (RISP) architecture, which tightly couples a coarse-grain Reconfigurable Functional Unit (RFU) to a RISC processor, is considered. Two architectural enhancements, namely partial predicated execution and virtual opcode are presented. An automated development framework for the introduced architecture is proposed. In order to evaluate both the architecture and the development framework a complete MPEG-2 encoder application is used. The efficiency of the predicated execution is proved and impressive speedup of the application is produced. Also, the use of virtual opcode to alleviate the opcode space explosion is demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "IEEE: Highly parallelized pattern matching execution for the ATLAS experiment",
            "Publication year": 2016,
            "Publication url": "https://cds.cern.ch/record/2263725",
            "Abstract": "The Associative Memory (AM) system of the Fast TracKer (FTK) processor has been designed to perform pattern matching using as input the data from the silicon tracker in the ATLAS experiment. The AM is the primary component of the FTK system and is designed using ASIC technology (the AM chip) to execute pattern matching with a high degree of parallelism. The FTK system finds track candidates at low resolution that are seeds for a full resolution track fitting. The AM system implementation is named “Serial Link Processor” and is based on an extremely powerful network of 2 Gb/s serial links to sustain a huge traffic of data. This paper reports on the design of the Serial Link Processor consisting of two types of boards, the Little Associative Memory Board (LAMB), a mezzanine where the AM chips are mounted, and the Associative Memory Board (AMB), a 9U VME motherboard which hosts four LAMB daughterboards. We also report on the performance of the prototypes (both hardware and firmware) produced and tested in the global FTK integration, an important milestone to be satisfied before the FTK production.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:g3aElNc5_aQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An integrated FPGA design framework: Custom designed FPGA platform and application mapping toolset development",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1303112/",
            "Abstract": "Summary form only given. A complete system for the implementation of digital logic in a fine-grain reconfigurable platform is introduced. The system is composed of two parts: The fine-grain reconfigurable hardware platform (FPGA) on which the logic is implemented and the set of CAD tools for mapping logic to the FPGA platform. The novel energy-efficient FPGA architecture was designed and simulated in STM 0.18/spl mu/m CMOS technology. Concerning the tool flow, each tool can operate as a standalone program as well as part of a complete design framework, composed by existing and new tools.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying One Class Classification for Leak Detection in Noisy Industrial Pipelines",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9493355/",
            "Abstract": "In this work, a machine learning approach is proposed for the problem of leak detection in noisy industrial pipelines. The traditional multi-class or binary classification approaches depend on the fact that real training data are required. However, in real pipeline scenarios the data generation for the leak class relies on measurements of artificially generated leaks which are different in nature than actual ones. Also, some pipelines are not equipped with the components to generate these leaks and in some cases, it is difficult to acquire a large and balanced leak dataset. Thus, in this paper, a set of one class classification models are applied that do not require training with real leak data. In this study's case, four one class classification models are trained on a single class representing the pipeline's normal operating noise. Seven time and frequency domain features are extracted from the raw acoustic data acquired by a …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:LO7wyVUgiFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A compact delay model for otft switches",
            "Publication year": 2015,
            "Publication url": "http://mocast.physics.auth.gr/images/NewPapers/PAPER_27F.pdf",
            "Abstract": "In this paper we present a compact delay model for single switches made using organic transistors. We have started by using a compact model for OTFTs, and we’ve used the nth-Power law approach to develop our compact model. Simulations results show a mean error below 3%.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the Effect of Data-Reuse Transformations on Processor Power Consumption",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Spyridon-Nikolaidis/publication/27377876_Evaluating_the_Effect_of_Data-Reuse_Transformations_on_Processor_Power_Consumption/links/545e82320cf2c1a63bfc1f44/Evaluating-the-Effect-of-Data-Reuse-Transformations-on-Processor-Power-Consumption.pdf",
            "Abstract": "Processor power savings that can be obtained by the application of data-reuse transformations on multimedia applications are discussed in this paper. Data Transfer and Storage Exploration methodologies primarily aim at memory related power reduction by moving data accesses to smaller memories, which are less power costly. However, it is shown that the applied code transformations have also a significant effect on the processor power consumption. Physical measurements of the average current drawn by instruction sequences provide a way to evaluate the processor power consumption of alternative code implementations. Simulation results prove that code transformations based on memory hierarchy exploration can have a significantly larger impact on power than existing software energy optimizing methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "COSAFE: efficient safety-critical portable system design approach",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1454160/",
            "Abstract": "Safety-critical systems are becoming quite common nowadays, especially in medical and transportation applications. The targeted safe operation levels of this type of systems are fully defined by the international standards. Low safe-operation levels are met in most medical devices. In this paper, a decentralized design approach is proposed that mimics human body's nervous system structure. This approach allows the achievement of high safe-operation levels that were not targeted before due to the high design complexity and the significant cost increase. A microcontroller was developed and served as the evaluation vehicle of the proposed approach. It was embedded in a commercial volumetric pump as the main core, resulting in a 99.9% and a 98%, permanent and transient fault cover respectively. Furthermore, an extension of the device's autonomy by 36% was achieved.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying the Power Contributors Method in a complex CMOS cell",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9200265/",
            "Abstract": "The evaluation of a circuit library in terms of leakage currents and static power consumption is obligatory for low power designs. It has to be done early in the design process and it requires significant time effort. Both the leakage currents and the static power consumption depend on many parameters, such as: process, dimensions, temperature, cell’s input state and power supply voltage. In order to speed up the evaluation procedure, the Power Contributors method has been introduced. According to this method, any cell for any input state can be split up into elementary sub-circuits. By modeling all the leakages flowing onto these sub-circuits, expressions can be derived by just adding each contribution from each sub-circuit. This method has been applied here on an OAI22_X1 complex CMOS cell from NanGate library. Results are promising, since the mean relative error between the derived models and the results …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:hCrLmN-GePgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design of Interconnection Networks for Programmable Logic Design of Interconnection Networks for Programmable Logic, 2004",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777038/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 <no title> \nLEMIEUM H. 被引用文献: 1件 著者 LEMIEUM H. 収録刊行物 Design of Interconnection Networks \nfor Programmable Logic Design of Interconnection Networks for Programmable Logic, 2004 \nKluwer Academic Publishers 被引用文献: 1件中 1-1件を 表示 1 A Novel FPGA Architecture and \nan Integrated Framework of CAD Tools for Implementing Applications SIOZIOS Konstantinos \n, KOUTROUMPEZIS George , TATAS Konstantinos , VASSILIADIS Nikolaos , KALENTERIDIS \nVasilios , POURNARA Haroula , PAPPAS Ilias , SOUDRIS Dimitrios , THANAILAKIS , , on ()…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Static gate power consumption model based on power contributors",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7035531/",
            "Abstract": "Accurate and fast estimation of the static power consumption in various design corners for nanoscale integrated circuits is a very important task since it facilitates power and noise analysis procedures. The power contributor approach which is based on the separability of the power components can be used for this purpose. In this paper, parametric models for the power contributor currents are produced for the cells of an industry oriented library. Using these models, the power contributor method is evaluated for the estimation of the total static power consumption of the library cells. The models produced are expressed as a function of the power supply voltage, temperature and the transistor width. Results show that the proposed model estimations present an average error of about 0.4% while the maximum error remains less than 2% for all the design corners of the tested cells.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software design for a sound processing embedded system",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376565/",
            "Abstract": "A very popular way of implementing electronic systems that perform a particular function or a field of functions is the use of embedded systems. These systems show many advantages, like their versatility and their flexibility which are very useful for the designer. In this paper, the implementation of a sound processing embedded system is described. This system receives a musical sound and then it identifies the note which is heard, as well as the musical instrument that this note comes from. The number of the musical instruments that this system can identify is two, but this number can be easily increased. Furthermore, some results concerning the function of the system are presented as well.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Elimination of overhead operations in complex loop structures for embedded microprocessors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4358242/",
            "Abstract": "Looping operations impose a significant bottleneck in achieving better computational efficiency for embedded applications. In this paper, a novel zero-overhead loop controller (ZOLC) supporting arbitrary loop structures with multiple-entry and multiple-exit nodes is described and utilized to enhance embedded RISC processors. A graph formalism is introduced for representing the loop structure of application programs, which can assist in ZOLC code synthesis. Also, a portable description of a ZOLC component which can be exploited in the scope of register transfer level (RTL) synthesis for enabling its utilization is given in detail. This description is designed to be easily retargetable to single-issue RISC processors, requiring only minimal effort for this task. The ZOLC unit has been incorporated into different RISC processor models and research ASIPs at different abstraction levels (RTL VHDL and ArchC) to provide …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A data-driven verilog-a reram model",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8252766/",
            "Abstract": "The translation of emerging application concepts that exploit resistive random access memory (ReRAM) into large-scale practical systems requires realistic yet computationally efficient device models. Here, we present a ReRAM model, where device current-voltage characteristics and resistive switching rate are expressed as a function of: 1) bias voltage and 2) initial resistive state (RS). The model versatility is validated on detailed characterization data, for both filamentary valence change memory and nonfilamentary ReRAM technologies, where device resistance is swept across its operating range using multiple input voltage levels. Furthermore, the proposed model embodies a window function which features a simple mathematical form analytically describing RS response under constant bias voltage as extracted from physical device response data. Its Verilog-A implementation captures the ReRAM memory …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:35r97b3x0nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Coprocessor for the Fast Tracker Simulation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7889049/",
            "Abstract": "The Fast Tracker (FTK) executes real-time tracking for online event selection in the ATLAS experiment. Data processing speed is achieved by exploiting pipelining and parallel processing. Track reconstruction is executed in two stages. The first stage, implemented on custom application-specific integrated circuit (ASICs) called associative memory (AM) chips, performs pattern matching (PM) to identify track candidates in low resolution. The second stage, implemented on field programmable gate arrays (FPGAs), builds on the PM results, performing track fitting in full resolution. The use of such a parallelized architecture for real-time event selection opens up a new, huge computing problem related to the analysis of the acquired samples. Millions of events have to be simulated to determine the efficiency and the properties of the reconstructed tracks with a small statistical error. The AM chip emulation is a …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:z_wVstp3MssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Fast TracKer Processing Unit future evolution",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014tipp.confE.209G/abstract",
            "Abstract": "The Fast TracKer Processing Unit future evolution - NASA/ADS Now on home page ads icon \nads Enable full ADS view NASA/ADS The Fast TracKer Processing Unit future evolution \nGentsos, C. ; Crescioli, F. ; Giannetti, P. ; Magalotti, D. ; Nikolaidis, S. Abstract Publication: \nProceedings of Technology and Instrumentation in Particle Physics 2014 (TIPP2014). 2-6 June \n2014. Amsterdam Pub Date: 2014 Bibcode: 2014tipp.confE.209G full text sources Publisher | © \nThe SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by \nthe Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A \nNASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS \nSocial @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) \nSmithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of Use Smithsonian …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time canny edge detection parallel implementation for FPGAs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724558/",
            "Abstract": "Edge detection is one of the most fundamental algorithms in digital image processing. The Canny edge detector is the most implemented edge detection algorithm because of its ability to detect edges even in images that are intensely contaminated by noise. However, this is a time consuming algorithm and therefore its implementations are difficult to reach real time response speeds. Especially nowadays where the demand for high resolution image processing is constantly increasing, the need for fast and efficient edge detector implementations is ever so present. A new parallel Canny edge detector FPGA implementation is proposed in this paper to answer this demand. This design takes advantage of 4-pixel parallel computations to achieve high throughput without increasing the on-chip memory demands. Synthesis and simulation results are presented to prove the design's efficiency and high frames per second …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Methodology for Calculating the Undetactable Double-Faults in Self-Checking Circuits",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=15786994171496809053&hl=en&oi=scholarr",
            "Abstract": "In this paper, a methodology for the calculation of the undetectable double-faults in self-checking circuits with bit-sliced architecture is introduced. This methodology is based on a systematic exploration of the combinations of nodes where undetectable double-faults can arise. The self-checking n-bit 2-to-1 multiplexer coded by parity is used as a test vehicle for the presentation of the methodology and the number of the undetectable double-faults is given in a parametric way. The proposed methodology can easily be applied to other bit-sliced circuits. Common self-checking circuits are implemented for different coding schemes and are using standard cell technology to verify the proposed methodology. The effectiveness of these implementations in fault detection as well as their requirements in hardware and power are also investigated.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:kuK5TVdYjLIC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Energy-Aware SYstem-on-chip design of the HIPERLAN/2 standard IST-2000-30093",
            "Publication year": 2002,
            "Publication url": "http://electronics.physics.auth.gr/easy/deliverables/Deliverable_15.pdf",
            "Abstract": "In this report the amounts of the energy consumed during the execution of the instructions of the ARM7TDMI processor, used in the EASY project, are presented. The selected development board for the processor is presented. The followed modeling technique for the estimation of the energy consumption of the software in embedded processors is analysed. Measurements and calculations of the base and inter-instruction energy costs according to the proposed methodology are provided. Results defining the dependency of the instruction level energy consumption on the instruction parameters are also given.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Zero-overhead loop controller that implements multimedia algorithms",
            "Publication year": 2005,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-cdt_20041187",
            "Abstract": "Multimedia algorithms generally consist of regular repetitive loop constructs. The authors present a novel control unit design for implementing such loop intensive algorithms. The proposed architecture, termed a zero-overhead loop controller (ZOLC) exploits the regularity of computations, which is a common characteristic of multimedia algorithms, in order to efficiently support the corresponding datapaths. The ZOLC controls the operations in datapath modules by activating/deactivating their corresponding controlling FSMs. Algorithmic flow dependencies, which determine the appropriate loop sequencing, are mapped onto a look-up table (LUT). For another algorithm to execute, only the LUT context and the FSM configurations have to be reprogrammed, assuming a generic datapath. Thus, partial reconfiguration possibilities to implement multimedia algorithms on programmable platforms can be exploited. As proof …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Architecture and CAD for Deep-Submicron FPGAs Architecture and CAD for Deep-Submicron FPGAs, 1999",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777011/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です\n（11/11(水)-12/23(水)） CiNii Researchプレ版の公開について <no title> BETZ V. 被引用文献: 1件 \n著者 BETZ V. 収録刊行物 Architecture and CAD for Deep-Submicron FPGAs Architecture and \nCAD for Deep-Submicron FPGAs, 1999 Kluwer Academic Publishers 被引用文献: 1件中 1-1件を \n表示 1 A Novel FPGA Architecture and an Integrated Framework of CAD Tools for Implementing \nApplications SIOZIOS Konstantinos , KOUTROUMPEZIS George , TATAS Konstantinos , \nVASSILIADIS Nikolaos , KALENTERIDIS Vasilios , POURNARA Haroula , PAPPAS Ilias , , , , …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acoustic leak localization method based on signal segmentation and statistical analysis",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9493349/",
            "Abstract": "One of the most serious problems occurring in a pipeline network is the appearance of leaks. The process of detecting and localizing leaks in pipeline systems concerns a very extensive field of signal processing methods employed for this matter. In this paper a leak localization method combining the segmentation of acoustic leak signals, both in the time and in the frequency domain, with a statistical algorithm needed for dealing with the non-deterministic (stochastic) nature of these signals is proposed. This algorithm involves the use of cross-correlation techniques along with the grouping of the time-delay data in a histogram and selecting the bin with the largest number of elements as the one that provides the correct answer. The successful detection of the leak position requires the knowledge of the acoustic wave velocity in the pipe. In the present paper the calculation of the acoustic velocity is performed by the …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:8d8msizDQcsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Approach for Modeling CMOS Gates",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.663.3293&rep=rep1&type=pdf",
            "Abstract": "A modeling approach for CMOS gates is presented based on the use of the equivalent inverter. A new model for the inverter has been developed using a simplified transistor current model which incorporates the nanoscale effects for the planar technology. Parametric expressions for the output voltage are provided as well as the values of the output and supply current to be compatible with the CCS technology. The model is parametric according the input signal slew, output load, transistor widths, supply voltage, temperature and process. The transistor widths of the equivalent inverter are determined by HSPICE simulations and parametric expressions are developed for that using a fitting procedure. Results for the NAND gate shows that the proposed approach offers sufficient accuracy with an average error in propagation delay about 5%.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementation Strategy and Results of an Energy-Aware System-on-Chip for 5 GHz WLAN Applications",
            "Publication year": 2006,
            "Publication url": "https://www.ingentaconnect.com/contentone/asp/jolpe/2006/00000002/00000001/art00004",
            "Abstract": "In this paper we present the implementation strategy and results of an energy-aware system-on-chip (SoC) that covers the baseband processing as well as the medium access control and data link control functionalities of a 5 GHz wireless system. It is compliant with the HIPERLAN/2 standard, but it also implements critical functionality of the IEEE 802.11a standard. Two embedded processor cores, dedicated hardware, on-chip memory elements, as well as advanced bus architectures and peripheral interfaces were carefully combined and optimized for the targeted application, resulting in a proper trade-off of silicon area, flexibility and power consumption. A system-level low-power design methodology has been used, due to the fact that power consumption is the most critical parameter in electronic portable system design. The 17.5 million-transistor solution was implemented in a 0.18 micron CMOS process and …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:D03iK_w7-QYC",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "The future evolution of the Fast Tracker processing unit",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7581783/",
            "Abstract": "Real time tracking is a key ingredient for online event selection at hadron colliders. The Silicon Vertex Tracker at the CDF experiment and the Fast Tracker at ATLAS are two successful examples of the importance of dedicated hardware to reconstruct full events at hadron colliders. We present the future evolution of this technology, for applications to the High Luminosity runs at the Large Hadron Collider where Data processing speed will be achieved with custom VLSI pattern recognition and linearized track fitting executed inside modern FPGAs, exploiting deep pipelining, extensive parallelism, and efficient use of available resources. In the current system, one large FPGA executes track fitting in full resolution inside low resolution candidate tracks found by a set of custom ASIC devices, called Associative Memories. The FTK dual structure, based on the cooperation of VLSI AM and programmable FPGAs, will remain …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling CMOS gates using equivalent inverters",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7195682/",
            "Abstract": "In this paper a complete approach for timing and power modeling and characterization of the CMOS gates is proposed. At first, a simplified but still accurate transistor current model is proposed taking into account the nanoscale effects which have a countable effect on the circuit behavior. Using the expressions of the transistor current, the differential equation which describes the operation of the CMOS inverter is solved analytically and expressions for the output voltage and supply current and thus for propagation delay and the power consumption are derived. These expressions are parametric according the input signal slew, output load, transistor widths, supply voltage, temperature and process. Complex gates are replaced by equivalent inverters with similar behavior and the expressions developed for the inverter are employed. Parametric expressions are derived for the transistor widths of the equivalent …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Privacy preserving distributed training of neural networks",
            "Publication year": 2020,
            "Publication url": "https://ruomo.lib.uom.gr/handle/7000/721",
            "Abstract": "LEARNAE is a system aiming to achieve a fully distributed way of neural network training. It follows a ‘‘Vires in Numeris’’ approach, combining the resources of commodity personal computers. It has a full peer-to-peer model of operation; all participating nodes share the exact same privileges and obligations. Another significant feature of LEARNAE is its high degree of fault tolerance. All training data and metadata are propagated through the network using resilient gossip protocols. This robust approach is essential in environments with unreliable connections and frequently changing set of nodes. It is based on a versatile working scheme and supports different roles, depending on processing power and training data availability of each peer. In this way, it allows an expanded application scope, ranging from powerful workstations to online sensors. To maintain a decentralized architecture, all underlying tech should be fully distributed too. LEARNAE’s coordinating algorithm is platform agnostic, but for the purpose of this research two novel projects have been used: (1) IPFS, a decentralized filesystem, as a means to distribute data in a permissionless environment and (2) IOTA, a decentralized network targeting the world of low energy ‘‘Internet of Things’’ devices. In our previous work, a first approach was attempted on the feasibility of using distributed ledger technology to collaboratively train a neural network. Now, our research is extended by applying LEARNAE to a fully deployed computer network and drawing the first experimental results. This article focuses on use cases that require data privacy; thus, there is only exchanging of model weights …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:XoXfffV-tXoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Evaluating Power Efficient Data-Reuse Decisions for Embedded Multimedia Applications: An Analytical Approach",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218126604001313",
            "Abstract": "Power consumption of multimedia applications executing on embedded cores is heavily dependent on data transfers between system memory and processing units. The purpose of this paper is to extend an existing power optimizing methodology based on data-reuse decisions, in order to determine the optimal solution in a rapid and reliable way. An analytical approach is proposed by extracting expressions for the number of accesses to each memory layer. Moreover, the design space is further reduced since these analytical expressions are calculated only for a subset of all transformations. The results concerning the power efficiency of data-reuse transformations are in agreement to those in previous studies. However, the exploration time of the design space is significantly reduced. The proposed methodology is also applied to the case of multiple parallel processing cores, proving that the relative effect of each …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Efficient output waveform evaluation of a CMOS inverter based on short‐circuit current prediction",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cta.207",
            "Abstract": "A novel approach for obtaining the output waveform, the propagation delay and the short‐circuit power dissipation of a CMOS inverter is introduced. The output voltage is calculated by solving the circuit differential equation only for the conducting transistor while the effect of the short‐circuit current is considered as an additional charge, which has to be discharged through the conducting transistor causing a shift to the output waveform. The short‐circuit current as well as the corresponding discharging current are accurately predicted as functions of the required time shift of the output waveform. A program has been developed that implements the proposed method and the results prove that a significant speed improvement can be gained with a minor penalty in accuracy. Copyright © 2002 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The impact of low-power techniques on the design of portable safety-critical systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30205-6_52",
            "Abstract": "The application of typical low-power techniques on safety-critical systems may result in degradation of crucial safety properties of the system. However, existing techniques to address this impact, considered that low-power mode is applied for short time intervals. Thus, addressing degradation of the safety properties only on checkers was considered sufficient. A novel approach is introduced that considers both requirements for safe operation and low-power dissipation. The benefits of this approach are exhibited and a comparison to alternative approaches is offered.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Smart sensor system for leakage detection in pipes carrying oil products in noisy environment: The ESTHISIS Project",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8862111/",
            "Abstract": "The presented initiative aims at the development of a low cost and low energy wireless sensor system for the immediate detection of leaks in metallic piping systems for the transport of liquid and gaseous petroleum products in a noisy industrial environment. The method to be followed will be based on processing the changes monitored in the acoustic spectrum of sound signals appearing in the pipeline walls due to a leakage effect and will aim at minimal interference in the piping system. It is intended to use low frequencies to detect and characterize leakage in order to increase the range of sensors and thus to reduce cost. The method will focus only on the sounds produced during the leakage while intermittent processing will be applied with the potential to further reduce energy consumption and increase leakage detection reliability in a noisy environment.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:S16KYo8Pm5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum allocation in cognitive radio networks using chaotic biogeography-based optimisation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/iel7/6072580/8444517/08444565.pdf",
            "Abstract": "Cognitive radio networks are a promising technology for the improvement of the spectrum utilisation. The basic idea is to maximise the utilisation of the available spectrum by dynamically assigning available channels to secondary users. This problem known as the spectrum allocation problem is non-deterministic polynomial-time hard (NP-hard). Chaotic biogeography-based optimisation (CBBO) is a recently proposed evolutionary algorithm that can be applied to the above-mentioned problem. The authors compare CBBO with other popular algorithms in different spectrum allocation problem cases. The results show that CBBO performs in general better or similar to the other algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:URolC5Kub84C",
            "Publisher": "IET"
        },
        {
            "Title": "Low-Energy FPGAs-Architecture and Design Low-Energy FPGAs-Architecture and Design, 2001",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777010/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です\n（11/11(水)-12/23(水)） CiNii Researchプレ版の公開について <no title> VARGHESE G. 被引用文献\n: 1件 著者 VARGHESE G. 収録刊行物 Low-Energy FPGAs-Architecture and Design Low-Energy \nFPGAs-Architecture and Design, 2001 Kluwer Academic Publishers 被引用文献: 1件中 1-1件を \n表示 1 A Novel FPGA Architecture and an Integrated Framework of CAD Tools for Implementing \nApplications SIOZIOS Konstantinos , KOUTROUMPEZIS George , TATAS Konstantinos , \nVASSILIADIS Nikolaos , KALENTERIDIS Vasilios , POURNARA Haroula , PAPPAS Ilias , (…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cache activity profiling tool for the LEON4 processor",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937660/",
            "Abstract": "The performance of modern systems depends significantly on the cache activity. Hence, tools that monitor the cache performance are very useful for optimization of the software or even, whenever this is possible, the hardware, of a system. In this paper, a tool that provides statistics about the cache activity of the LEON4-N2X embedded system is discussed. The tool analyzes the memory access trace of a program executed bare metal and calculates, with the use of the reuse distance, the latency added by the cache activity. Furthermore, the tool measures all the misses occurred and classifies them per their cause.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analytical model for the CMOS inverter",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6951894/",
            "Abstract": "A new analytical model for the CMOS inverter is introduced. This model results by solving analytically the differential equation which describes the inverter operation. It uses new simplified transistor current expressions which are developed taking into account the nanoscale effects and also considering temperature as a parameter. Expressions for the output voltage are derived, which are then used for capturing the output and supply currents, making the model compatible with CCS technology requirements. The proposed model is parametric according to the input signal slew, output load, transistor widths, supply voltage, temperature and process parameters. It presents an average error less than 3% for the typical case.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling CMOS gates driving RC interconnect loads",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/933808/",
            "Abstract": "The problem of estimating the performance of CMOS gates driving RC interconnect loads is addressed in this paper. The widely accepted /spl pi/-model is used for the representation of an interconnect line that is driven by an inverter. The output waveform and the propagation delay of the inverter are analytically calculated taking into account the coupling capacitance between input and output and the effect of the short-circuit current. In addition, short-circuit power dissipation is accurately estimated. Once the voltage waveform at both the beginning and the end of an interconnect line are obtained, a simple method is employed in order to calculate the voltage waveform at each point of the line.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power exploration of parallel embedded architectures implementing data-reuse transformations",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957591/",
            "Abstract": "Efficient use of data-reuse transformations combined with a custom memory hierarchy that exploits the temporal locality of data related memory accesses can have a significant impact on system power consumption, especially in data dominated applications e.g. multimedia processing. In this paper the effect of data-reuse decisions on power consumption, area and performance of multimedia applications implemented on uni- and dual-processor embedded cores is explored. By this work it is clarified that conclusions for the transformations effect on multi-processor architectures can be extracted by the corresponding effect on the uniprocessor architecture. In this way the exploration space can be significantly reduced. A motion estimation algorithm, namely the two-dimensional logarithmic search, and a discrete cosine transform (DCT) algorithm are used as demonstrator applications.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Associative Memory System Infrastructures for the ATLAS Fast Tracker",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7927452/",
            "Abstract": "The associative memory (AM) system of fast tracker (FTK) processor has been designed for the tracking trigger upgrade to the ATLAS detector at the Conseil Europeen Pour La Recherche Nucleaire large hadron collider. The system performs pattern matching (PM) using the detector hits of particles in the ATLAS silicon tracker. The AM system is the main processing element of FTK and is mainly based on the use of application-specified integrated circuits (ASICs) (AM chips) designed to execute PM with a high degree of parallelism. It finds track candidates at low resolution which become seeds for a full resolution track fitting. The AM system implementation is based on a collection of large 9U Versa Module Europa (VME) boards, named “serial link processors” (AMBSLPs). On these boards, a huge traffic of data is implemented on a network of 900 2-Gb/s serial links. The complete AM-based processor consumes …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The ByoRISC configurable processor family",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Kavvadias/publication/228981540_The_ByoRISC_configurable_processor_family/links/58abf5e7aca27206d9bf82a5/The-ByoRISC-configurable-processor-family.pdf",
            "Abstract": "Customizable/extensible processors can be tuned to exploit applications of interest in modern platform-based design. However, in most cases they are implemented as extensions of legacy architectures, a policy that poses significant limitations to achieving high performance improvements. In this paper, the paradigm of the contemporary ByoRISC processor family is presented. The ByoRISC specification provides an extensive set of architectural parameters that can be applied to a baseline processor, that can be extended by application-specific hardware extensions (ASHEs) in the form of either custom instruction units or locally-interfaced coprocessors. Such ASHEs can implement multi-input multi-output (MIMO) computations with local state that may have an arbitrary number and combination of load/store accesses to the data memory. The performance characteristics of the proposed processors have been evaluated for both FPGA and ASIC implementations, proving that ByoRISC is a viable solution in present-day SoC design. A case study of an image processing pipeline is also presented to highlight the process of utilizing a ByoRISC-based custom processor.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design space exploration for FPGA-based multiprocessing systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724724/",
            "Abstract": "In modern multimedia applications there is a constant increase of the need for more computational power, flexibility and memory availability. The answer for this demand comes from MPSoC platforms implemented on powerful FPGA devices, where high performance and a vast system architecture design flexibility is offered. Whilst many groups are targeting their research on developing automated tools for reducing the total time needed from designing to implementing an MPSoC platform on an FPGA, there is insufficient information on how to explore and determine the optimum memory architecture for such systems. This paper presents a design space exploration for FPGA-based multiprocessing systems using the Powerstone JPEG decoding algorithm as a case study. We explore algorithm partitioning and system architectures for exploitation of both data and task-level parallelism and we include in our study the …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring opportunities to improve the performance of a reconfigurable instruction set processor",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210701292829",
            "Abstract": "In this paper, at a reconfigurable instruction set processor (RISP) is targeted, which tightly couples a coarse-grain reconfigurable functional unit (RFU) to a RISC processor. Furthermore, the architecture is supported by a flexible development framework. By allowing the definition of alternate architectural parameters, the framework can be used to explore the design space and fine-tune the architecture at design time. Initially, two architectural enhancements, namely partial predicated execution and virtual opcode are proposed and the extensions performed in the architecture and the framework to support them, are presented. To evaluate these issues, kernels from the multimedia domain are considered and an exploration to derive an appropriate instance of the architecture is performed. The efficiency of the derived instance and the proposed enhancements are evaluated using an MPEG-2 encoder application.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:maZDTaKrznsC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Technical Design Report for the Phase-I Upgrade of the ATLAS TDAQ System",
            "Publication year": 2013,
            "Publication url": "https://eprints.gla.ac.uk/199418/",
            "Abstract": "The Phase-I upgrade of the ATLAS Trigger and Data Acquisition (TDAQ) system is to allow the ATLAS experiment to efficiently trigger and record data at instantaneous luminosities that are up to three times that of the original LHC design while maintaining trigger thresholds close to those used in the initial run of the LHC.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Society of Photo-optical Instrumentation Engineers"
        },
        {
            "Title": "Tradeoffs in the Design Space Exploration of Application-Specific Processors.",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Nikolaos-Kavvadias/publication/220886083_Tradeoffs_in_the_Design_Space_Exploration_of_Application-Specific_Processors/links/0912f50fa5d82a81f7000000/Tradeoffs-in-the-Design-Space-Exploration-of-Application-Specific-Processors.pdf",
            "Abstract": "An application-specific instruction set processor (ASIP) design methodology can exploit special characteristics of applications to meet the performance and time-to-market requirements. In this paper, tradeoffs encountered in the design of application-specific processors targeting embedded applications are discussed. The exploration of the architecture design space is a crucial step to effective instruction set generation as well as micro-architecture design. In this context, we identify operation pattern matching and hardware module allocation possibilities that should be accounted in hardware generation frameworks. For this reason, such modifications are applied on a pipelined processor model and their effect on execution performance and energy dissipation is measured via cycle-accurate simulations. As proof-of-concept, a real application, namely the full-search motion estimation algorithm used in video coding, is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "THE EFFECT OF DATA-REUSE TRANSFORMATIONS ON MULTIMEDIA APPLICATIONS FOR APPLICATION SPECIFIC PROCESSORS",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/48718224/The_Effect_of_Data-Reuse_Transformations20160909-22862-1xu8bem.pdf",
            "Abstract": "Multimedia applications are characterized by a high number of data transfers and storage operations. Appropriate transformations can be applied at the algorithmic level to improve crucial implementation characteristics. In this paper, the effect of data-reuse transformations on power consumption and performance of multimedia applications, realized on an Application Specific Instruction set Processor (ASIP), is examined. An ASIP for multimedia applications designed based on a complete methodology is used to evaluate this effect. Results prove the efficiency of the ASIP solution and indicate benefits from the use of the data-reuse transformations in terms of energy consumption and performance. Also, preliminary results from the exploitation of instruction buffering technique to reduce the energy consumption of the ASIP are presented.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Instruction level energy modeling for pipelined processors",
            "Publication year": 2005,
            "Publication url": "https://content.iospress.com/articles/journal-of-embedded-computing/jec00035",
            "Abstract": "A new method for creating instruction level energy models for pipelined processors is introduced. This method is based on measuring the instantaneous current drawn by the processor during the execution of the instructions. An appropriate instrumentation set up was established for this purpose. According to the proposed method the energy costs (base and inter-instruction costs) are modeled in relation to a reference instruction (eg NOP). These costs incorporate inter-cycle energy components, which cancel each other when they are summed to produce the energy consumption of a program resulting in estimates with high accuracy. This is confirmed by the results. Also the dependencies of the energy consumption on the instruction parameters (eg operands, addresses) are studied and modeled in an efficient way.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Enhancing embedded processors with specific instruction set extensions for network applications",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4062120/",
            "Abstract": "The bandwidth explosion of last years and its dropping cost have resulted in bandwidth-hungry and computationally intensive applications. To effectively handle current and future applications, networks will need to support new protocols that should include differentiated services, security, and various network management functions. In order to satisfy the new requirements, an application specific instruction set processor (ASIP), derived from the extension of a popular MIPS embedded processor, is proposed in this paper. An efficient instruction set extended properly for network applications is introduced. Experimental results on Netbench, a benchmarking suite for network applications, prove that the proposed instruction set presents remarkable performance and power improvements over the ARM7TDMI and MIPS processors.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SIS: A system for sequential circuit synthesis SIS: A system for sequential circuit synthesis, 1992",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777032/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です（11/11(水\n)-12/23(水)） CiNii Researchプレ版の公開について <no title> SENTOVICH M. 被引用文献: 1件 \n著者 SENTOVICH M. 収録刊行物 SIS : A system for sequential circuit synthesis SIS : A system \nfor sequential circuit synthesis, 1992 被引用文献: 1件中 1-1件を 表示 1 A Novel FPGA \nArchitecture and an Integrated Framework of CAD Tools for Implementing Applications SIOZIOS \nKonstantinos , KOUTROUMPEZIS George , TATAS Konstantinos , VASSILIADIS Nikolaos , \nKALENTERIDIS Vasilios , POURNARA Haroula , PAPPAS Ilias , SOUDRIS Dimitrios , , , on ()…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-state memristive nanocrossbar for high-radix computer arithmetic systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388682/",
            "Abstract": "The recent discovery of memristor, a device able to store multi-bit values in a single cell, has renewed the interest for fast arithmetic operations via high-radix numeric systems. This work presents a conceptual solution for CMOS-compatible, high-radix memristive arithmetic logic units (ALUs). The latter, combine CMOS circuitry for data processing with a reconfigurable, multi-level, memristive nanocrossbar memory, which allows the compact, high-radix storage of numbers. Certain modifications introduced to the typical crossbar topology permit the parallel creation of partial products for faster multiplication. High-radix to binary data conversion is performed via a network of comparators. A simulation-based validation of read/write operations from/to a multi-level memristive crossbar was performed using SPICE and a threshold-type model of a voltage-controlled bipolar memristor.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advancing Rational Exploitation of Water Irrigation Using 5G-IoT Capabilities: The AREThOU5A Project",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8862146/",
            "Abstract": "Water scarcity and desertification are considered to be among the greatest challenges of humanity over the coming decades. Worldwide, agriculture accounts to 69% of total water usage, while industry accounts for 23%, and urban use to 8%. In Greece, a rural development model and poor farming practices have resulted in an overwhelming 83% of total water consumption to be directed to farming uses. Furthermore, excessive use of water in agriculture combined with existing pesticides and fertilizers usage levels creates exponential problems in the water cycle in Greece. Taking into account the above challenges, the AREThOU5A Project aims to exploit the state-of-the-art technologies and, in particular, the emerging developments in the field of Internet of Things (IoT) as a means to promote rational use of water resources in agriculture. In particular, AREThOU5A Project aims at accelerating penetration of low …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Defining thresholds for leak detection parameters through statistical analysis of the noise in water/gas pipelines",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9128847/",
            "Abstract": "In this paper, a method for leak detection in industrial pipelines during normal operation, is proposed. An accelerometer set on the surface of the pipe was used for the data acquisition. The system, via adapting filtering detects the frequency bands containing most of the noise’s power. From the filtered data, some computationally inexpensive, time and frequency-domain features are extracted to be used for the leak detection process. By statistically analyzing the statistical distribution of these parameters and by selecting a confidence level of 99.7%, the appropriate thresholds are defined. To test the effectiveness of this method, two scenarios were examined. The former includes an easily detectable leak that can be detected in real time. The latter case includes a low-power leak that the system can detect by examining the parameter values over a longer time frame. With the proposed method, leaks from a 4 mm …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:0N-VGjzr574C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction level power measurements and analysis",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=3032609768482143232&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of the interconnection architecture on the FPGA performance and energy consumption",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1346811/",
            "Abstract": "A systematic exploration of the effect of the interconnection network on the performance and power consumption of the FPGA is performed. Island style FPGA architecture and an efficient configurable logic block are adopted. Exploration is performed for various parameters of the interconnection network. Alternative interconnection architectures are obtained by combining these parameters. Several benchmark circuits are mapped on the alternative architectures and their implementations are evaluated. Results demonstrate the efficiency of each solution towards the FPGA characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Incentivizing Participation to Distributed Neural Network Training",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-80568-5_30",
            "Abstract": "During the last years a vast number of online sensors continuously generate data that can be utilized to create novel deep learning applications. Training very large models requires enormous processing power; thus, the evident way to follow is to lease the power of a corporate data center. But the diffusion of Artificial Intelligence to an always increasing number of human activities, constantly attracts new researchers who wish to train and test their models. Our work on LEARNAE is a proposal for a purely distributed neural network training, based on a peer-to-peer and permissionless architecture. LEARNAE allows individual researchers to join forces, in order to collaboratively train a model. The process utilizes modern Distributed Ledger Technology and it is fully democratized, prioritizing decentralization, fault tolerance and privacy. In this paper we add another piece to the puzzle: A method for incentivizing peers to …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:GtLg2Ama23sC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "IEEE: Track finding mezzanine for Level-1 triggering in HL-LHC experiments",
            "Publication year": 2017,
            "Publication url": "https://cds.cern.ch/record/2306350",
            "Abstract": "The increase of the luminosity in the High Luminosity upgrade of the CERN Large Hadron Collider (HL-LHC) will require the use of Tracker information in the evaluation of the Level-1 trigger in order to keep the trigger rate acceptable (ie:<; 1MHz). In order to extract the track information within the latency constraints (<; 5μs), a custom real-time system is necessary. We developed a prototype of the main building block of this system, the Pattern Recognition Mezzanine (PRM) that combines custom Associative Memory ASICs with modern FPGA devices. The architecture, functionality and test results of the PRM are described in the present work.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evaluation of the equivalent inverter modeling approach",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00034-017-0692-5",
            "Abstract": "Accurate modeling of CMOS logic gates for timing and power characterization is a very important task in integrated circuits technology since it facilitates significantly the design phase. Parametric models provide flexibility in determining the circuit performance in various design corners. However, the direct analysis of a complex CMOS gate aiming in an analytical and parametric model is a difficult and cumbersome task. An alternative way to model these gates is by using the equivalent inverter approach. According to this, an inverter with appropriate transistor widths is defined in order to present the same response with the complex gate it models. The challenge with this approach is to propose a simple method to predict the appropriate transistor widths of the equivalent inverter. Then, an analytical model for the CMOS inverter can be used to provide estimates for the complex gates. In this paper, a macro …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:ipzZ9siozwsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The ATLAS Trigger/DAQ Authorlist",
            "Publication year": 2015,
            "Publication url": "https://cds.cern.ch/record/2017301",
            "Abstract": "The ATLAS Trigger/DAQ Authorlist - CERN Document Server CERN Accelerating science \nSign in Directory CERN Document Server Access articles, reports and multimedia content in \nHEP Main menu Search Submit Help Personalize Your alerts Your baskets Your comments \nYour searches Home > Articles & Preprints > CERN Notes > ATLAS Notes > The ATLAS \nTrigger/DAQ Authorlist Information Discussion (0) Files ATLAS Note Report number ATL-DAQ-PUB-2015-001 \nTitle The ATLAS Trigger/DAQ Authorlist Author(s) ATLAS TDAQ Collaboration ; Achenbach, R \n(Kirchhoff-Institut f\\\"{u}r Physik) ; Adelman, J (Northern Illinois University) ; Aielli, G (INFN \nRoma Tor Vergata and Universita' di Roma Tor Vergata, Dipartimento di Fisica) ; Aleksandrov, \nIN (Joint Institute for Nuclear Research) ; Alexandrov, E (Joint Institute for Nuclear Research) \n; Alison, J (University of Chicago, Enrico Fermi Institute) ; Allbrooke, BMM (of ) ; , (' …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:kzcrU_BdoSEC",
            "Publisher": "ATL-COM-DAQ-2015-068"
        },
        {
            "Title": "ARISE machines: extending processors with hybrid accelerators",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-78610-8_20",
            "Abstract": "ARISE introduces a systematic approach to extend once a processor to support thereafter the coupling of an arbitrary number of Custom Computing Units (CCUs). A CCU, hardwired or reconfigurable, can be utilized in a hybrid, tight and/or loose, model of computation. By selecting the appropriate model for each part of the application, the complete application space can be considered for acceleration, resulting to significant performance improvements. To support these features ARISE proposes: i) a machine organization, ii) a set of Instruction Set Extensions (ISEs), and iii) a micro-architecture. To evaluate our proposal, a MIPS processor is extended with the ARISE infrastructure and implemented on an FPGA. Results show that the ARISE infrastructure can easily fit into the timing model of the processor. A set of benchmarks is mapped on the evaluation machine and it is proved that exploiting the hybrid …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An efficient model of the CMOS inverter for nanometer technologies",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6815335/",
            "Abstract": "In this paper, an approach for modeling the output waveform and the propagation delay of the CMOS inverter in nanometer technologies is introduced. An initial output waveform is calculated by solving the corresponding differential equations of the circuit only for the conducting transistor. The effect of the short-circuit current is treated as an additional charge that has to be discharged through the conducting transistor thus causing a time-shift of the initial output waveform. The dynamic behavior of the loading transistor is analyzed and the current due to its bulk-to-drain coupling capacitance is taken into account. Also, sub-threshold current is taken into account where significant.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analytical exploration of power efficient data-reuse transformations on multimedia applications",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/941129/",
            "Abstract": "Power savings that can be achieved by data-reuse decisions targeting at a custom memory hierarchy for multimedia applications executing on embedded cores are examined in this paper. Exploiting the temporal locality of memory accesses in data-intensive applications a set of data-reuse transformations on a typical motion estimation algorithm is determined. The aim is to reduce data related power consumption by moving background memory accesses to smaller foreground memories, which are less power costly. The impact of these transformations on power, performance and area is evaluated both for application specific circuits and general purpose processors. The number of data and instruction memory accesses is analytically calculated, enabling a fast exploration of the design space by varying algorithmic parameters.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware building blocks of a mixed granularity reconfigurable system-on-chip platform",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30205-6_63",
            "Abstract": "Due to the combination of flexibility and realization efficiency, reconfigurable hardware has become a promising implementation alternative. In the context of the IST-AMDREL project, a mixed granularity reconfigurable SoC platform targeting wireless communication systems has been developed. The platform’s main building blocks are presented, including coarse grain reconfigurable unit, embedded FPGA, interconnection network and application specific reusable blocks. The combination of these blocks in platform instances is expected to lead to a good balance between implementation efficiency and flexibility. An AMDREL platform based reconfigurable SoC for a multi-mode wireless networking system is currently under development.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "http://vlsi. ee. duth. gr/AMDREL http://vlsi. ee. duth. gr/AMDREL",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777016/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学\n図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて \n本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 \n年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です（11/11(水)-12/23(水)） \nCiNii Researchプレ版の公開について <no title> 被引用文献: 1件 著者 収録刊行物 \nhttp://vlsi.ee.duth.gr/AMDREL http://vlsi.ee.duth.gr/AMDREL 被引用文献: 1件中 1-1件を 表示 1 A \nNovel FPGA Architecture and an Integrated Framework of CAD Tools for Implementing \nApplications SIOZIOS Konstantinos , KOUTROUMPEZIS George , TATAS Konstantinos , \nVASSILIADIS Nikolaos , KALENTERIDIS Vasilios , POURNARA Haroula , PAPPAS Ilias , \nSOUDRIS Dimitrios , THANAILAKIS Antonios , NIKOLAIDIS Spiridon , SISKOS Stilianos IEICE on (/…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A unified CMOS inverter model for planar and FinFET nanoscale technologies",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6868799/",
            "Abstract": "In this paper, a new analytical model for describing the output waveform of the CMOS inverter for planar and FinFET nanoscale technologies, is introduced. A modified expression for the transistor current is adopted taken into account nano-scale effects like DIBL, CLM and NWE. The sub-threshold current of both transistors as well as their drain-to-bulk capacitances, which influence significantly the accuracy, are also considered. Results for 32nm planar and 20nm FinFET technologies validate the proposed model.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The arise approach for extending embedded processors with arbitrary hardware accelerators",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4738458/",
            "Abstract": "ARISE introduces a systematic approach for extending once an embedded processor to support thereafter the coupling of an arbitrary number of custom computing units (CCUs). A CCU can be a hardwired or a reconfigurable unit, which can be utilized following a tight and/or loose model of computation. By selecting the appropriate model of computation for each part of the application, the complete application space is considered for acceleration, resulting in significant performance improvements. Also, ARISE offers modularity and scalability and is not restricted by the opcode space and operands limitation problems that exist in such type of machines. To support these features we introduce a machine organization that allows the cooperation of a processor and a set of CCUs. To control the CCUs we extend once the instruction set of the processor with eight instructions. To efficiently incorporate these features to an …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A TiO2 ReRAM parameter extraction method",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8050789/",
            "Abstract": "In this work, we present a parameter extraction method for TiO 2  memristive devices that applies on a resistive switching rate model which embodies only four parameters for each voltage biasing polarity. The simple form of the model functions allows the derivation of a predictive analytical resistive state response expression under constant bias voltage. By employing corresponding experimental testing on the devices, we fit such constant bias responses exhibited by physical memristor samples on this analytical expression. Next, we apply a simple algorithm that extracts the suitable model parameters that capture the switching rate behavior of the characterized device in its voltage range of operation.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction-level power consumption estimation of embedded processors for low-power applications",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548902000089",
            "Abstract": "A power consumption measurement configuration for embedded processing systems is presented in this work. Given an assembly or machine level program as input to this setup, the energy consumption of the specific program in the specific processing systems can be estimated. The instruction level power models are derived based on the power supply current measurement technique. The instantaneous variations of the power supply current provide the appropriate information for the accurate estimation of the power consumption at different operating situations of the processor (core) and of the overall processing system as well (consumption of peripheral units). The proposed instantaneous current measuring approach, along with the execution of special test programs for analysis of inter-instruction effects provides a clear insight information of the power behavior of embedded processing systems.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:9yKSN-GCB0IC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Real-time machine vision FPGA implementation for microfluidic monitoring on lab-on-chips",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6544300/",
            "Abstract": "A machine vision implementation on a field-programmable gate array (FPGA) device for real-time microfluidic monitoring on Lab-On-Chips is presented in this paper. The machine vision system is designed to follow continuous or plug flows, for which the menisci of the fluids are always visible. The system discriminates between the front or “head” of the flow and the back or “tail” and is able to follow flows with a maximum speed of 20 mm/sec in circular channels of a diameter of 200 μm (corresponding to approx. 60 μl/sec). It is designed to be part of a complete Point-of-Care system, which will be portable and operate in non-ideal laboratory conditions. Thus, it is able to cope with noise due to lighting conditions and small LoC displacements during the experiment execution. The machine vision system can be used for a variety of LoC devices, without the need for fiducial markers (such as redundancy patterns) for its …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "YARDstick: Automation tool for custom processor development",
            "Publication year": 2007,
            "Publication url": "http://www.nkavvadias.com/yardstick/yardstick_date07_abstract.pdf",
            "Abstract": "YARDstick is a building block for ASIP development, integrating application analysis, custom instruction generation, selection and synthesis with user-defined compiler intermediate representations.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of bit-level transition activity in data-paths based on word-level statistics and conditional entropy",
            "Publication year": 2002,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-cds_20020423",
            "Abstract": "Accurate models for the calculation of bit-level switching activity from word-level statistics are presented. The dual-bit type (DBT) model is combined with an entropy-based transition activity calculation. Assuming that the input signal of a DSP system is described by a random Gaussian process, the conditional entropy per bit is estimated by means of a novel sigmoidal model. An accurate polynomial approximation to the conditional entropy of the sign bits has been developed permitting the direct calculation of the switching activity. The propagation of signals through common data-path operators is studied. A triple-bit type (TBT) model is introduced to accurately describe the three activity regions of the multiplier output. Moreover, the proposed model is applied for the estimation of the switching activity at the nodes of a multiply–accumulate (MAC) architecture implementing a 24-tap FIR filter, for both synthetic and real …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "The FTK: A Hardware Track Finder for the ATLAS Trigger",
            "Publication year": 2014,
            "Publication url": "https://cds.cern.ch/record/1710769",
            "Abstract": "The ATLAS experiment trigger system is designed to reduce the event rate, at the LHC design luminosity of 1034 cm-2 s-1, from the nominal bunch crossing rate of 40 MHz to less than 1 kHz for permanent storage. During Run 1, the LHC has performed exceptionally well, routinely exceeding the design luminosity. From 2015 the LHC is due to operate with higher still luminosities. This will place a significant load on the High Level Trigger system, both due to the need for more sophisticated algorithms to reject background, and from the larger data volumes that will need to be processed. The Fast TracKer is a hardware upgrade for Run 2, consisting of a custom electronics system that will operate at the full rate for Level-1 accepted events of 100 kHz and provide high quality tracks at the beginning of processing in the High Level Trigger. This will perform track reconstruction using hardware with massive parallelism using associative memories and FPGAs. The availability of the full tracking information will enable robust trigger selection within the affordable latency available at the High Level Trigger, with only a limited degradation in performance arising from the additional pileup from higher luminosity running.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:bnK-pcrLprsC",
            "Publisher": "ATL-COM-DAQ-2014-062"
        },
        {
            "Title": "Learnae: Distributed and Resilient Deep Neural Network Training for Heterogeneous Peer to Peer Topologies",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20257-6_24",
            "Abstract": "Learnae is a framework proposal for decentralized training of Deep Neural Networks (DNN). The main priority of Learnae is to maintain a fully distributed architecture, where no participant has any kind of coordinating role. This solid peer-to-peer concept covers all aspects: Underlying network protocols, data acquiring/distribution and model training. The result is a resilient DNN training system with no single point of failure. Learnae focuses on use cases where infrastructure heterogeneity and network unreliability result to an always changing environment of commodity-hardware nodes. In order to achieve this level of decentralization, new technologies had to be utilized. The main pillars of this implementation are the ongoing projects of IPFS and IOTA. IPFS is a platform for a purely decentralized filesystem, where each node contributes local data storage. IOTA aims to be the networking infrastructure of the …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Power reduction for multimedia applications through data-reuse memory exploration",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957675/",
            "Abstract": "Power consumption of multimedia applications executing on embedded cores is heavily dependent on data transfers between system memory and processing units. In this paper, a power optimizing methodology based on data-reuse decisions and the development of a custom memory hierarchy is extended in order to determine the optimal solution in a rapid and reliable way. Data-reuse transformations are applied on a typical motion estimation algorithm in order to reduce the data-related power consumption by moving background memory accesses to smaller foreground memories, which are less power costly. Fast exploration of the design space is achieved by extracting analytical expressions for the number of accesses to data and instruction memories.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developing an environment for embedded software energy estimation",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548905000188",
            "Abstract": "The paper presents the results of a novel method for the instruction-level energy consumption measurement and the corresponding modeling approach for embedded microprocessors. According to the proposed method the base and inter-instruction energy costs of the ARM7TDMI embedded processor as well as the energy cost due to different values in the instruction parameters are modeled. These models can be used in the estimation of the energy consumed by the processor to execute real software programs. A software tool has been developed to automate energy estimation.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:IWHjjKOFINEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Energy complexity of software in embedded systems",
            "Publication year": 2005,
            "Publication url": "https://arxiv.org/abs/nlin/0505007",
            "Abstract": "The importance of low power consumption is widely acknowledged due to the increasing use of portable devices, which require minimizing the consumption of energy. The energy in a computational system depends heavily on the software being executed, since it determines the activity in the underlying circuitry. In this paper we introduce the notion of energy complexity of an algorithm for estimating the required energy consumption. As test vehicle we employ matrix multiplication algorithms and from the results it can be observed that energy complexity in combination with computational complexity, provides an accurate estimation for the energy consumed in the system.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiobjective Ant Lion Approaches Applied to Electromagnetic Device Optimization",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2227-7080/9/2/35",
            "Abstract": "Nature-inspired metaheuristics of the swarm intelligence field are a powerful approach to solve electromagnetic optimization problems. Ant lion optimizer (ALO) is a nature-inspired stochastic metaheuristic that mimics the hunting behavior of ant lions using steps of random walk of ants, building traps, entrapment of ants in traps, catching preys, and re-building traps. To extend the classical single-objective ALO, this paper proposes four multiobjective ALO (MOALO) approaches using crowding distance, dominance concept for selecting the elite, and tournament selection mechanism with different schemes to select the leader. Numerical results from a multiobjective constrained brushless direct current (DC) motor design problem show that some MOALO approaches present promising performance in terms of Pareto-optimal solutions. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:9pM33mqn1YgC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Dual-band single-layered modified e-shaped patch antenna for RF energy harvesting systems",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9218354/",
            "Abstract": "Radio Frequency Energy Harvesting (RF EH) is an alternative, yet well-promising technique to deliver power in electronic circuits of wireless sensor networks that require small amounts of energy. The design of the receiving module (antenna) in RF EH systems is a demanding and, in most cases, a complex task. As a result, an optimization method is often required. In this paper, we apply The Salp Swarm Algorithm to design and optimize a receiving module (dual-band modified E-shaped antenna) for RF EH systems. The proposed antenna operates in the frequency bands of LTE-2600 and 5G NR mobile communication networks. Numerical results exhibit a satisfactory operation of the optimized antenna as a receiving module in an RF EH system.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:_axFR9aDTf0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hot carrier degradation modeling of short-channel n-FinFETs suitable for circuit simulators",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026271415302171",
            "Abstract": "The hot-carrier (HC) degradation of short-channel n-FinFETs is investigated. The experiments indicate that interface trap generation over the entire channel length, which is enhanced near the drain region, is the main degradation mechanism. The relation of the hot-carrier degradation with stress time, channel length, fin width and bias stress voltages at the drain and gate electrodes is presented. A HC degradation compact model is proposed, which is experimentally verified. The good accuracy of the degradation model makes it suitable for implementation in circuit simulation tools. The impact of the hot-carriers on a CMOS inverter is simulated using HSPICE.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "http://opensource. ethz. ch/emacs/vhdl93_syntax. html http://opensource. ethz. ch/emacs/vhdl93_syntax. html",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777026/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文を\nさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて \n本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ \n出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施\n中です（11/11(水)-12/23(水)） CiNii Researchプレ版の公開について <no title> 被引用文献: 1件 \n著者 収録刊行物 http://opensource.ethz.ch/emacs/vhdl93_syntax.html http://opensource.ethz.ch/emacs/vhdl93_syntax.html \n被引用文献: 1件中 1-1件を 表示 1 A Novel FPGA Architecture and an Integrated Framework \nof CAD Tools for Implementing Applications SIOZIOS Konstantinos , KOUTROUMPEZIS \nGeorge , TATAS Konstantinos , VASSILIADIS Nikolaos , KALENTERIDIS Vasilios , \nPOURNARA Haroula , PAPPAS Ilias , SOUDRIS Dimitrios , THANAILAKIS Antonios , , on ()…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Serial Link Processor for the Fast TracKer (FTK) processor at ATLAS",
            "Publication year": 2015,
            "Publication url": "https://air.unimi.it/handle/2434/671693",
            "Abstract": "The trigger system of a detector installed at a hadron collider must have high efficiency for the interesting physics processes and it must suppress the enormous QCD backgrounds. A multilevel trigger [1] is an effective solution for this task. The ATLAS trigger system [2, 3, 4] is organized in three levels. The hardware Level-1 Trigger quickly locates the regions of interest in the calorimeter and the muon system, operating with output event rates up to 100 KHz. The subsequent trigger levels, Level-2 and the Event Filter are collectively known as the high-level trigger. They consist of software algorithms running on a farm of commercial CPUs. In the current ATLAS trigger, the information that comes from the silicon detectors are not used at Level-1 and only late and locally at Level-2. Early reconstructed tracks increase the performance of the system. The Fast TracKer processor (FTK)[5] is a hardware-based system designed for track reconstruction in the silicon detectors with offline quality and in time for Level-2 selections.The FTK processor is highly parallel. The detector is segmented into η− φ towers, each one processed by its own tracking processor. Each processor covers one sixteenth of the detector in φ (22.5, plus 10 overlap to maintain high efficiency) while the η range of each region is divided into four overlapping intervals, for a total of 64 η− φ towers. Consequently, a tower receives only a fraction of the silicon hits, and a track reconstruction processor has substantially fewer candidates to process. Within each tower, we distribute the silicon data on 12 parallel buses at the full 100 KHz Level-1 output rate.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:XiVPGOgt02cC",
            "Publisher": "Scuola Internazionale Superiore di Studi Avanzati (SISSA)"
        },
        {
            "Title": "ARISE machines",
            "Publication year": 2008,
            "Publication url": "http://ikee.lib.auth.gr/record/250318",
            "Abstract": "ARISE introduces a systematic approach to extend once a processor to support thereafter the coupling of an arbitrary number of Custom Computing Units (CCUs). A CCU, hardwired or reconfigurable, can be utilized in a hybrid, tight and/or loose, model of computation. By selecting the appropriate model for each part of the application, the complete application space can be considered for acceleration, resulting to significant performance improvements. To support these features ARISE proposes: i) a machine organization, ii) a set of Instruction Set Extensions (ISEs), and iii) a micro-architecture. To evaluate our proposal, a MIPS processor is extended with the ARISE infrastructure and implemented on an FPGA. Results show that the ARISE infrastructure can easily fit into the timing model of the processor. A set of benchmarks is mapped on the evaluation machine and it is proved that exploiting the hybrid model of …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:rmuvC79q63oC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "A low-power CMOS-VLSI circuit for signal conditioning in integrated capacitive sensors",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1426136/",
            "Abstract": "Capacitive sensor manufacturing processes are rarely compatible with CMOS technologies and, thus, monolithic integration of sensing device and signal-conditioning IC is often not possible. Multi-chip packaging and wire bonding is employed instead, to interconnect sensor and IC dies. In such cases, sensor capacitance is comparable or even smaller than the parasitic interconnection capacitance, while interconnection parasitic resistance inserts additional signal distortion. The signal-conditioning IC must be designed to compensate for these parasitic effects. Switched-capacitor ICs may fulfil such specifications but the use of several operational amplifiers and intricate clocking schemes increase design complexity, die-size, and power consumption, which is inappropriate for wireless applications. In this work a low-power switched-capacitor IC for sub-fF capacitance measurements is presented. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The effect of data-reuse transformations on multimedia applications for different processing platforms",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30205-6_61",
            "Abstract": "Multimedia applications are characterized by an increased number of data transfers and storage operations. Appropriate transformations can be applied at the algorithmic level to improve crucial implementation characteristics. In this paper, the effect of data-reuse transformations on power consumption and performance of multimedia applications, realized on General Purpose (GPP) and Application Specific Instruction set Processors (ASIP), is examined. An ASIP for multimedia applications, designed based on a complete methodology, and the ARM9TDMI are used to evaluate this effect. Results prove the efficiency of the ASIP solution and indicate that both GPP and ASIP approaches can benefit, from such transformations, in terms of energy consumption and performance.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design of a hardware track finder (Fast TracKer) for the ATLAS trigger",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1748-0221/9/01/C01045/meta",
            "Abstract": "The ATLAS Fast TracKer is a custom electronics system that will operate at the full Level-1 accept trigger rate, 100 kHz, to provide high quality tracks as input to the high level trigger. The event reconstruction is performed in hardware, thanks to the massive parallelism of associative memories and FPGAs. We present the advantages for the physics goals of the ATLAS experiment at LHC as well as the recent results on the design, technological advancements and test of some of the core components used in the processor.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:p2g8aNsByqUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A Voltage-Controlled Window Function Approach",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8576704/",
            "Abstract": "In this paper we propose a simple method that modifies the mathematical structure of behavioral memristor models by inducing a voltage dependency in the window functions which are normally expressed as solely state dependent. This empirical method is based on the assumption that the resistive states of analog memristor devices saturate at well-defined resistive levels under constant bias voltage application, which is supported by corresponding experimental data extracted from a wide range of analog memristor devices. As the vast majority of the simplified models published to date are constructed to fit hysteretic current-voltage characteristics of practical devices, the proposed transformation is applied to render empirical models more suitable for memristor-based analog applications where the memristor resistance is configured multiple times.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:EYYDruWGBe4C",
            "Publisher": "VDE"
        },
        {
            "Title": "Modelling the operation of pass transistor and CPL gates",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210110066185",
            "Abstract": "Pass transistor logic and complementary pass-transistor logic (CPL) are becoming increasingly important in the design of a specific class of digital integrated circuits owing to their speed and power efficiency as compared with conventional CMOS logic. In this paper, a simple and very accurate technique for the timing analysis of gates that involve pass transistor logic is presented. This investigation offers for the first time the possibility of simulating pass transistor and CPL gates by partitioning the behaviour of complex structures into well defined subcircuits whose interaction is studied separately. Using the proposed analysis, which is validated by results for two submicron technologies, most pass-transistor logic styles can be modelled efficiently. Consequently, a significant speed advantage can be gained compared with simulation tools that employ numerical methods such as SPICE.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Hot carrier degradation modeling of short-channel n-FinFETs suitable for circuit applications",
            "Publication year": 2015,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02051771/",
            "Abstract": "Archive ouverte HAL - Hot carrier degradation modeling of short-channel n-FinFETs \nsuitable for circuit applications Accéder directement au contenu Accéder directement à la \nnavigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails \nAURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers \ndépôts Par type de publication Par discipline Par année de publication Par structure de \nrecherche Les portails de l'archive Recherche Documentation hal-02051771, version 1 \nCommunication dans un congrès Hot carrier degradation modeling of short-channel n-FinFETs \nsuitable for circuit applications I. Messaris 1 TA Karatsori 2 Nikolaos Fasarakis 1 S. \nNikolaidis 1 Gérard Ghibaudo 2 CA Dimitriadis 1 Détails 1 Aristotle University of \nThessaloniki, Department of Physics 2 IMEP-LAHC - Institut de …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "http://direct. xilinx. com/bvdocs/publications/ds003. pdf http://direct. xilinx. com/bvdocs/publications/ds003. pdf",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10016777006/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文を\nさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて \n本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ \n出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施\n中です（11/11(水)-12/23(水)） CiNii Researchプレ版の公開について <no title> 被引用文献: 1件 \n著者 収録刊行物 http://direct.xilinx.com/bvdocs/publications/ds003.pdf http://direct.xilinx.com/bvdocs/publications/ds003.pdf \n被引用文献: 1件中 1-1件を 表示 1 A Novel FPGA Architecture and an Integrated Framework \nof CAD Tools for Implementing Applications SIOZIOS Konstantinos , KOUTROUMPEZIS \nGeorge , TATAS Konstantinos , VASSILIADIS Nikolaos , KALENTERIDIS Vasilios , \nPOURNARA Haroula , PAPPAS Ilias , SOUDRIS Dimitrios , THANAILAKIS Antonios , , on (/…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:gsN89kCJA0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for estimating adulteration of virgin olive oil with soybean oil using image analysis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937672/",
            "Abstract": "This paper describes the development of an image processing algorithm, which can estimate the amount of adulteration of olive oil with soybean oil from a captured photo. This algorithm is intended to be implemented into an application for modern smartphones, where the user can measure the quality of a sample of olive oil, only by taking photos from the sample. The determination of the adulteration percentage is done by separating the captured image into two regions: one that contains only the oil sample and another one, which contains the rest of the image. The colour difference between these two regions, for known adulteration percentages is used to determine the appropriate model that combines these quantities. Then, any other mixture of these oils, can be identified using the derived model and the methodology that is described in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:9Nmd_mFXekcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integer linear programming model for mapping applications on hybrid systems",
            "Publication year": 2009,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-cdt_20080003",
            "Abstract": "An integer linear programming (ILP) model for mapping applications on HW platforms that consist of µPs, ASICs and FPGAs is proposed. The introduced model solves the assignment and scheduling problems taking into consideration the time required to reconfigure the FPGAs. Specifically, the type of the tasks that are executed on the FPGAs is taken into account, so that tasks which perform the same function are scheduled consecutively. In that way the number of the FPGAs' reconfigurations is reduced and the performance is improved. Also, the configuration of the FPGAs is hidden because it happens, if it is possible, in the time intervals that the FPGAs are idle. Thus, the execution time of the task mapped on the FPGA does not increase due to reconfiguration time and performance is improved. Moreover, the memory requirements for storing the program and configuration codes of the tasks that are executed on …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:isC4tDSrTZIC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Study of the acoustic noise in pipelines carrying oil products in a refinery establishment",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3368640.3368685",
            "Abstract": "The monitoring of pipeline networks in utility or industrial distribution installations for fault detection (eg leaks in water or hydrocarbon pipelines) is important for economical and environmental reasons and critical from the health hazard perspective. Significant focus has been attracted over the years on the implementation of passive and active methods for the fault source localization, based on acoustic signal processing. The knowledge of the acoustic noise background's stochastic characteristics, that is inherent in such installations due to electronic or mechanical machinery induced interference is crucial for designing and deploying an efficient, acoustic signal based, fault detection and localization system. In this paper, time and frequency domain algorithmic approaches are presented for estimating the lower and higher order statistical parameters of the signals of interest, as well as power spectrum and correlation …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Serial Link Processor for the Fast TracKer (FTK) at ATLAS",
            "Publication year": 2014,
            "Publication url": "https://cds.cern.ch/record/1706060",
            "Abstract": "The Associative Memory (AM) system of the FTK processor has been designed to perform pattern matching using the hit information of the ATLAS silicon tracker. The AM is the heart of the FTK and it finds track candidates at low resolution that are seeds for a full resolution track fitting. To solve the very challenging data traffic problem inside the FTK, multiple designs and tests have been performed. The currently proposed solution is named the “Serial Link Processor” and is based on an extremely powerful network of 2 Gb/s serial links. This paper reports on the design of the Serial Link Processor consisting of the AM chip, an ASIC designed and optimized to perform pattern matching, and two types of boards, the Local Associative Memory Board (LAMB), a mezzanine where the AM chips are mounted, and the Associative Memory Board (AMB), a 9U VME board which holds and exercises four LAMBs. We report also on the performance of a first prototype based on the use of a min@ sic AM chip, a small but complete version of the final AM chip, built to test the new and fully serialized I/O. Also a dedicated LAMB prototype, named miniLAMB, with reduced functionalities, has been produced to test the mini@ sic. The serialization of the AM chip I/O significantly simplified the LAMB design. We report on the tests and performance of the integrated system mini@ sic, miniLAMB and AMB.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Tiz5es2fbqcC",
            "Publisher": "ATL-COM-DAQ-2014-043"
        },
        {
            "Title": "A multi-core FPGA-based clustering algorithm for real-time image processing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6829740/",
            "Abstract": "A multi-core FPGA-based 2D-clustering algorithm for real-time image processing is presented. The algorithm uses a moving window technique adjustable to the cluster size in order to minimize the FPGA resources required for cluster identification. The window size is generic and application dependent (size/shape of clusters in the input images). A key element of this algorithm is the possibility to instantiate multiple clustering cores working on different windows that can be used in parallel to increase performance exploiting more resources on the FPGA device. In addition to the offered parallelism, the algorithm is executed in a pipeline, thus allowing the cluster readout to be performed in parallel with the cluster identification and the data pre-processing. The algorithm is developed for the Fast Tracker processor for the trigger upgrade of the ATLAS experiment but is easily adjustable to other image processing …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Output waveform evaluation of basic pass transistor structure",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45716-X_23",
            "Abstract": "Pass transistor logic is a promising alternative to conventional CMOS logic for low-power high-performance applications due to the decreased node capacitance and reduced transistor count it offers. However, the lack of supporting design automation tools has hindered the widespread application of pass transistors. In this paper, a simple and robust modeling technique for the timing analysis of the basic pass transistor structure is presented. The proposed methodology is based on the actual phenomena that govern the operation of the pass transistor and enables fast timing simulation of circuits that employ pass transistors as controlled switches without significant loss of accuracy, compared to SPICE simulation.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Instrumentation set-up for instruction level power modeling",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45716-X_8",
            "Abstract": "Energy constraints form an important part of the design specification for processors running embedded applications. For estimating energy dissipation early at the design cycle, accurate power consumption models characterized for the processor are essential. A methodology and the corresponding instrumentation setup for taking current measurements to create high quality instruction level power models, are discussed in this paper. The instantaneous current drawn by the processor is monitored at each clock cycle. A high performance instrumentation setup has been established for the accurate measurement of the processor current, which is based on a current sensing circuit, instead of the conventional solution of a series resistor.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design of a hardware track finder (Fast Tracker) for the ATLAS trigger",
            "Publication year": 2016,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1748-0221/11/02/C02056/meta",
            "Abstract": "The use of tracking information at the trigger level in the LHC Run II period is crucial for the trigger and data acquisition system and will be even more so as contemporary collisions that occur at every bunch crossing will increase in Run III. The Fast TracKer is part of the ATLAS trigger upgrade project; it is a hardware processor that will provide every Level-1 accepted event (100 kHz) and within 100μs, full tracking information for tracks with momentum as low as 1 GeV. Providing fast, extensive access to tracking information, with resolution comparable to the offline reconstruction, FTK will help in precise detection of the primary and secondary vertices to ensure robust selections and improve the trigger performance.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Amdrel: a novel low-energy fpga architecture and supporting cad tool design flow",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1466599/",
            "Abstract": "The design of a novel embedded FPGA reconfigurable hardware architecture is introduced. The architecture features a number of circuit-level low-power techniques, since power consumption is considered a primary concern. Additionally, a complete set of tools facilitating implementation of applications on the proposed FPGA was presented, starting from an RTL description and producing the actual configuration bit stream. The designed full-custom FPGA is under fabrication in 0.18/spl mu/m STM CMOS technology. The prototype supports partial and dynamic reconfiguration. The efficiency of the entire system (FPGA and tools) was proven by comparisons with commercial systems.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Development of a customized processor architecture for accelerating genetic algorithms",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933106001529",
            "Abstract": "In this paper, a new programmable RISC processor architecture named VGP-I is proposed, aiming to the acceleration of genetic algorithms in embedded systems. Compared to other GA engines, the VGP-I specification defines a compact instruction set supporting multiple operator types, with scalable instruction encodings, programmer-visible and auxiliary registers and optional extensions. Apart from the programmable accelerator approach, VGP-I instructions have been tightly integrated to the Nios II soft-core processor as well. For performance assessment, a cycle-accurate reference VGP-I model has been developed while VGP-I subsets have been realized on a prototype microarchitecture and as Nios II custom instructions, both verified on programmable logic. Performance improvements on the execution of genetic operators are typically at the level of two orders of magnitude with application kernels written in …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "V. CONCLUSION",
            "Publication year": 2001,
            "Publication url": "https://scholar.archive.org/work/kw7rrgcbybcfdp34xlpfubiz2y/access/wayback/http://users.uom.gr:80/~achat/papers/casii01.pdf",
            "Abstract": "With continuously decreasing device dimensions, the effect of the interconnect lines on the overall performance of digital integrated cir-",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Machine Learning Model Comparison for Leak Detection in Noisy Industrial Pipelines",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9200261/",
            "Abstract": "In this paper, two machine learning techniques are applied and compared in order to model leak detection in pipelines in noisy environments. A set of accelerometers, mounted on the surface of the pipes, was deployed for the data acquisition process. Measurements of noise during normal operating conditions were recorded as well as measurements of leaks, generated on various distances from the sensors. Using these measurement data, a training set was created from their time-domain and frequency-domain features. The leak detection process is then modeled as a binary classification problem (leak detection or not). For this problem, two machine learning classification techniques were evaluated, the support vector machines and the decision trees. The results for each learner are compared with the original data from the test dataset using representative performance indicators and, overall, high levels of …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:5qfkUJPXOUwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Low-Energy FPGA Architecture and Supporting CAD Tool Design Flow",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=BzA3fLQZBfkC&oi=fnd&pg=PA150&dq=info:Yyxu4wO3W9oJ:scholar.google.com&ots=LGmF9RLyg7&sig=SjvX3U9vm0zKkOUZFQ12Uy15OEI",
            "Abstract": "Additionally, a complete tool framework for the implementation of digital logic circuits in FPGA platforms is introduced. The framework is composed of i) nonmodified academic tools, ii) modified academic tools and iii) new tools. The developed tool framework supports a variety of FPGA architectures. Qualitative and quantitative comparisons with existing academic and commercial architectures and tools are provided, yielding promising results.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "FPGA-based machine vision implementation for Lab-on-Chip flow detection",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6271683/",
            "Abstract": "This paper presents an FPGA-based machine vision implementation for flow detection on Lab-on-Chip (LoC) experiments. The proposed machine vision system is designed to provide real-time information to the LoC user about the state of the flows (flow coordinates and points of interest) as well as input to the LoC controller. It is uniquely designed to compensate noise in the input video originating from non ideal lighting conditions or LoC movement. This machine vision implementation achieves real time response for input videos of 1Mpixel resolution and frame-rates exceeding 60fps for microfluidic flows with a maximum speed of 20mm/sec.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VLSI Design 2005 Conference Awards",
            "Publication year": 2005,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/icvd/2006/01581403/12OmNyQ7G04",
            "Abstract": "VLSI Design 2005 Conference Awards IEEE.org Help Cart Jobs Board Create Account Toggle \nnavigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press \nRoom Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer \nSociety Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center \nPress Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover \nImage Download 1.Home 2.Proceedings 3.icvd 2006 VLSI Design 2005 Conference Awards \n2006, pp. xxxi-xxxii, DOI Bookmark: 10.1109/VLSID.Keywords Awards, Authors VLSI Design \n2005 Conference Awards ,18,th, International Conference on VLSI Design and 4,th, International \nConference on Embedded ,Systems,Jan 3-7, 2005 ,Arun Kumar Choudhury Best ,“A -…",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel FPGA architecture and an integrated framework of CAD tools for implementing applications",
            "Publication year": 2005,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e88-d_7_1369",
            "Abstract": "A complete system for the implementation of digital logic in a Field-Programmable Gate Array (FPGA) platform is introduced. The novel power-efficient FPGA architecture was designed and simulated in STM 0.18 µm CMOS technology. The detailed design and circuit characteristics of the Configurable Logic Block, the interconnection network, the switch box and the connection box were determined and evaluated in terms of energy, delay and area. A number of circuit-level low-power techniques were employed because power consumption was the primary concern. Additionally, a complete tool framework for the implementation of digital logic circuits in FPGA platforms is introduced. Having as input VHDL description of an application, the framework derives the reconfiguration bitstream of FPGA. The framework consists of: i) non-modified academic tools, ii) modified academic tools and iii) new tools. Furthermore, the …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:kNdYIx-mwKoC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "An RMS-based Approach for Leak Monitoring in Noisy Industrial Pipelines",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9460014/",
            "Abstract": "A method for leak monitoring of noisy industrial pipelines is proposed in this work. This method is based on evaluating a single feature, the root mean square of the acquired acoustic signal of a pipeline and relies on defining updateable thresholds based on the previously acquired values. If at any point, these values increase above the active threshold, a check routine is performed to identify if that event was transient and short-term. The presence of a leak can be modeled through this procedure as a long-term increase in the acquired rms values. The algorithm behind the operation is associated with a set of parameters, that are adjustable in such a way that the system can adapt to the transient noise characteristics of the pipeline under inspection. These parameters can be fine-tuned based only on noise measurements without the need for a training phase with artificially generated leaks. The algorithm can begin …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measurement of current variations for the estimation of software-related power consumption [embedded processing circuits]",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232369/",
            "Abstract": "A current measurement configuration for the estimation of the power consumption of processing systems is presented in this work. The problem addressed is to measure the variations of the power supply current of digital circuits (and especially of embedded processing circuits) and to calculate from these measurements the energy consumption variations associated with certain tasks performed by the system software. Accurate monitoring of the instantaneous variations of the power supply current provides the appropriate information for the estimation of the power consumption at different operating situations of the processor (core) and of the overall processing system, as well (consumption of peripheral units). The proposed instantaneous current measuring approach, along with the execution of special test programs for analysis of inter-instruction effects, is expected to provide clear information of the power …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy efficient fine-grain reconfigurable hardware",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1346810/",
            "Abstract": "In this paper a novel energy efficient FPGA architecture was designed and simulated in STM 0.18/spl mu/m CMOS technology. The parameters of the configurable logic block architecture have been determined in order to minimize energy consumption. Circuit level low power design techniques are also applied for further reducing energy consumption. In addition, an exploration for the optimum, in terms of energy, delay and area, interconnection routing switches size has been performed.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An application development framework for ARISE reconfigurable processors",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1575779.1575784",
            "Abstract": "Coupling reconfigurable hardware accelerators with processors is an effective way to meet the performance and flexibility required to cope with modern embedded applications. The ARISE framework provides a systematic approach to extend a processor once. It will thereafter support the coupling of arbitrary hardware accelerators. The accelerators can be coupled as coprocessors or functional units of the processor’s datapath, and therefore exploited as a hybrid, which includes both loose and tight computational models. This article presents a complete framework for developing applications on such hybrid reconfigurable ARISE machines. The framework integrates the automatic identification of custom instructions and the semiautomatic/profiling-driven identification of coprocessors supporting the hybrid computational model. Moreover, it supports a modular design approach where the software and the hardware …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:GnPB-g6toBAC",
            "Publisher": "ACM"
        },
        {
            "Title": "A digital nonautonomous chaotic oscillator suitable for information transmission",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6654269/",
            "Abstract": "In this brief, an all-digital chaotic operating electronic circuit, which is suitable for information modulation and chaotic transmission, is introduced. The chaotic oscillating circuit is a nonautonomous one, and it is designed in such a way that signals at all stages are digital ones. No analog subcircuit is involved in generating chaos. Oscillator design and experimental demonstration of its chaotic behavior are provided, together with the evaluation of the chaotic properties that it possesses, employing established nonlinear dynamics tools.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The ATLAS fast tracker processor design",
            "Publication year": 2015,
            "Publication url": "https://cds.cern.ch/record/2159195",
            "Abstract": "The extended use of tracking information at the trigger level in the LHC is crucial for the trigger and data acquisition (TDAQ) system to fulfill its task. Precise and fast tracking is important to identify specific decay products of the Higgs boson or new phenomena, as well as to distinguish the contributions coming from the many collisions that occur at every bunch crossing. However, track reconstruction is among the most demanding tasks performed by the TDAQ computing farm; in fact, complete reconstruction at full Level-1 trigger accept rate (100 kHz) is not possible. In order to overcome this limitation, the ATLAS experiment is planning the installation of a dedicated processor, the Fast Tracker (FTK), which is aimed at achieving this goal. The FTK is a pipeline of high performance electronics, based on custom and commercial devices, which is expected to reconstruct, with high resolution, the trajectories of charged-particle tracks with a transverse momentum above 1 GeV, using the ATLAS inner tracker information. Pattern recognition and the track parameter extraction are expected to be performed in roughly 100 ms, allowing all the high level trigger selections to use the tracks provided by FTK in order to build high quality and robust triggering.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:edDO8Oi4QzsC",
            "Publisher": "SISSA"
        },
        {
            "Title": "Highly parallelized pattern matching execution for atlas event real time reconstruction",
            "Publication year": 2016,
            "Publication url": "https://agenda.infn.it/event/9251/contributions/78179/attachments/56651/66875/ATL-COM-DAQ-2015-004.pdf",
            "Abstract": "In this paper a high performance\" pattern matching\" system is presented. The system is based on the concept of Associative Memory (AM), designed to solve the track finding problem that is typical of high energy physics experiments executed in hadron colliders. It is powerful enough to process data produced from 80 overlapping proton-proton collisions at a 100 kHz rate, in a time span of a few microseconds, even very high multiplicity events. The AM is designed for massive parallelism in data correlation searches. This system is implemented as a large array of custom VLSI chips (AM chips), based on Content Address Memory (CAM). All the chips are identical and each one of them stores a preset number of “patterns”. All the patterns in all the chips are compared in parallel to the incoming data from the detector while the detector is being read out. Data are distributed to the AM chips through a huge network of high speed serial links. The complexity of the\" pattern matching\" problem is one that increases exponentially when CPU-based algorithms are used. With the proposed system the complexity increase is reduced to linear and the problem is solved by the time data are loaded in the system.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Effect of Data-Reuse Transformations on Multimedia Applications for Application Specific Processors",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4062117/",
            "Abstract": "Multimedia applications are characterized by an increased number of data transfers and storage operations. Appropriate transformations can be applied at the algorithmic level to improve crucial implementation characteristics. In this paper, the effect of data-reuse transformations on power consumption and performance of multimedia applications, realized on application specific instruction set processors (ASIP), is examined. An ASIP for multimedia applications, designed based on a complete methodology is used to evaluate this effect. Results prove the efficiency of the ASIP solution and indicate that this approach can benefit, from such transformations, in terms of energy consumption and performance.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Confronting violations of the TSCG (T) in low-power design",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1010453/",
            "Abstract": "The degradation of the Totally Self-Checking Goal (TSCG) on Totally Self-Checking (TSC) units caused by the application of low-power techniques is explored. The function TSCG(t) is used as a vehicle to study the effect of the input activity on the network of the TSC checkers. In the design process of a system embedding concurrent on-line testing techniques, the degradation of TSC property can be fatal for further operation (i.e. space electronics, medical devices). An on-line testing architecture is offered that adjusts the input activity, when low-power management is activated. This architecture tolerates possible degradation of the terms that contribute to the calculation of the TSCG(t). The n-variable two-rail checker is used as an example vehicle to prove that TSCG(t) is maintained in acceptable levels.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimation of signal transition activity in FIR filters implemented by a MAC architecture",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/822629/",
            "Abstract": "A novel method for the accurate calculation of the transition activity at the nodes of a multiplier-accumulator (MAC) architecture implementing finite impulse response filters is proposed in this paper. The method is developed for input signals, which can be described by a stationary Gaussian process. The transition activity per bit of a signal word is modeled according to the dual-bit-type (DBT) model and it is described as a function of the signal statistics. An efficient analytical method has been developed for the determination of the signal statistics at each node of the MAC architecture. It is based on the mathematical formulation of the multiplexing in time of signal sequences with known statistics. The effect of the multiplexing mechanism on the breakpoints of the DBT model, which influences significantly the accuracy of the method, is also determined. Several experiments both with synthetic and real data have been …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High speed FPGA implementation of Hough transform for real-time applications",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6219060/",
            "Abstract": "Hough Transform (HT) is a popular line detection algorithm in image processing and machine vision applications, favored for its tolerance to noise and partial occlusion. However, due to its computational complexity, software and hardware implementations for real-time video processing are usually limited to low resolutions and frame rates. We propose a novel architecture that exploits modern FPGA inherent parallelism capabilities, combined with efficient resource utilization and deep pipelining to enable real-time processing of high resolution, high frame rate videos.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Amdrel",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4020-6505-7_3.pdf",
            "Abstract": "Additionally, a complete tool framework for the implementation of digital logic circuits in FPGA platforms is introduced. The framework is composed of i) nonmodified academic tools, ii) modified academic tools and iii) new tools. The developed tool framework supports a variety of FPGA architectures. Qualitative and quantitative comparisons with existing academic and commercial architectures and tools are provided, yielding promising results.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Fine-grain reconfigurable platform",
            "Publication year": 2005,
            "Publication url": "http://ikee.lib.auth.gr/record/249200",
            "Abstract": "A complete system for the implementation of digital logic in a fine-grain reconfigurable platform is introduced. The system is composed of two parts. The fine-grain reconfigurable hardware platform (FPGA) on which the logic is implemented and the set of CAD tools for mapping logic to the FPGA platform. A novel energy-efficient FPGA architecture is presented (CLB, interconnect network, configuration hardware) and simulated in STM 0.18 μm CMOS technology. Concerning the tool flow, each tool can operate as a standalone program as well as part of a complete design framework, composed by existing and new tools.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Instruction level energy modeling for pipelined processors",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39762-5_34",
            "Abstract": "A new method for creating instruction level energy models for pipelined processors is introduced. This method is based on measuring the instantaneous current drawn by the processor during the execution of the instructions. An appropriate instrumentation set up was established for this purpose. According to the proposed method the energy costs (base and inter-instruction costs) are modeled in relation to a reference instruction (e.g. NOP). These costs incorporate inter-cycle energy components, which cancel each other when they are summed to produce the energy consumption of a program resulting in estimates with high accuracy. This is confirmed by the results. Also the dependencies of the energy consumption on the instruction parameters (e.g. operands, addresses) are studied and modeled in an efficient way.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Single transistor primitive for timing and power modelling of CMOS gates",
            "Publication year": 2000,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/002072100415675",
            "Abstract": "An accurate and efficient method for modelling CMOS gates by a single equivalent transistor is introduced in this paper. The output waveform of a CMOS inverter is obtained by solving the circuit differential equation considering only the conducting transistor of the inverter. The effect of the short-circuiting transistor is incorporated as a differentiation of the width of the conducting transistor. The proposed model is the simplest primitive that can be used in order to obtain the propagation delay and short-circuit power dissipation of CMOS gates. Consequently, it can offer significant speed improvement to existing dynamic timing and power simulators while maintaining a sufficient level of accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Efficient design of high-level mechanisms for hard safety-critical low-power devices",
            "Publication year": 2005,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13959",
            "Abstract": "The introduction of high-level sophisticated mechanisms can bridge the gap in the field of safety-critical applications design and the low-power design. Two modified mechanisms that allow event driven operation with respect to safety requirements and on-line testing are presented. An optimized instruction-opcode mapping algorithm for application specific capable processing units is also introduced to assist the above mechanisms. The whole work has been applied to a commercial product and a 40% of power saving has been achieved.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "WSEAS"
        },
        {
            "Title": "High-speed FPGA-based flow detection for microfluidic Lab-on-Chip",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6265840/",
            "Abstract": "Machine vision algorithms provide significant benefits for Lab-on-Chip (LoC) systems by automating the experimental process. This paper presents an FPGA-based machine vision flow detection implementation for microfluidic Lab-on-Chip (LoC) experiments. We propose and implement a novel architecture that exploits modern FPGA parallelism capabilities and makes efficient use of device resources to achieve real-time data collection in megapixel resolutions, at rates exceeding 30000 frames per second.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA architecture design and toolset for logic implementation",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39762-5_67",
            "Abstract": "In this paper, the design of an embedded FPGA architecture (i.e. configurable logic blocks) is presented and a complete tool-supported design flow starting from architecture level (i.e. RT-level) and ending with the derivation of the reconfiguration bitstream for the FPGA programming is introduced. The proposed design flow consists of new and modified and extended academic tools. In particular, new tools were developed in order to complement certain critical steps in the implementation flow, since existing academic tools do not combine for a cohesive and complete flow. The remaining design steps are implemented by modified existing academic tools. The FPGA architecture and the tool development is an interactive task, depending on what architectures can be supported by the tools. Using this design support tool set, we designed and simulated in 0.18 TSMC technology an FPGA architecture. More …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Measurement of power consumption in digital systems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1703914/",
            "Abstract": "A study on different measurement configurations for the estimation of power consumption of processing systems is presented. The problem addressed is to measure the energy consumed by a digital system during a number of clock cycles and to assign this consumption to a specific group of instructions. This kind of energy measurement provides the information needed for determining the energy consumption of specific software routines that run on digital processing systems. The proposed configuration is expected to provide clear information about the power behavior of single-chip processing systems as it may monitor the energy consumption during different tasks of operation. Furthermore, it may be integrated in the same chip as a peripheral unit that may be turned on periodically as the front-end circuit of an accurate built-in self-test configuration",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-Power co-design flow supported by the established environment",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=5073470500469251177&hl=en&oi=scholarr",
            "Abstract": "In the context of CoSafe, a low-power co-design environment is established, based on a low-power co-design methodology. The co-design environment, as any other available to the market, supports co-design for lowpower dissipation and reusability of the results. It also, supports open architecture for embedding any required add-ons. The main features of the co-design environment are the specification and partitioning of the system operations (tasks), based on power characterization of each task in software (power dissipated in each microcontroller instruction) and hardware (high level estimations). The hardware/software co-verification and the area and power optimization, dominant characteristics of the low-power co-design methodology, complete the environment’s features.At the first step of the methodology, the targeted application and the system’s algorithm must be specified as well as constraints …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new current-programmed pixel design for AMOLED displays implemented with organic thin-film transistors",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6222800/",
            "Abstract": "A new current-programmed pixel design for AMOLED displays is presented in this manuscript. The proposed pixel is designed by using organic thin-film transistors and it exhibits high immunity to the threshold voltage variations of the transistors threshold voltage shift, caused by the bias stress and the intrinsic properties of the organic materials. The pixel's main advantages are the fact that it can be designed by using entirely n- type or p-type TFTs meaning that all the organic TFTs technologies can be applied and the small settle time. Therefore, the proposed pixel can be used in high performance displays with high refresh rate.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A RISC architecture extended by an efficient tightly coupled reconfigurable unit",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210600565127",
            "Abstract": "In this paper, the architecture of an embedded processor extended with a tightly-coupled coarse-grain reconfigurable functional unit (RFU) is proposed. The efficient integration of the RFU with the control unit and the datapath of the processor eliminate the communication overhead between them. To speed up execution, the RFU exploits instruction level parallelism (ILP) and spatial computation. Also, the proposed integration of the RFU efficiently exploits the pipeline structure of the processor, leading to further performance improvements. Furthermore, a development framework for the introduced architecture is presented. The framework is fully automated, hiding all reconfigurable hardware related issues from the user. The hardware model of the architecture was synthesized in a 0.13 µm process and all information regarding area and delay were estimated and presented. A set of benchmarks is used to evaluate …",
            "Abstract entirety": 0,
            "Author pub id": "CeK-UugAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "V. CONCLUSION",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/53926456/43.82262920170720-2828-nlr1i0.pdf",
            "Abstract": "A novel method for the accurate calculation of the transition activity at the nodes of a multiplier-accumulator (MAC) architecture implementing finite impulse response filters is proposed in this paper. The method is developed for input signals, which can be described by a stationary Gaussian process. The transition activity per bit of a signal word is modeled according to the dual-bit-type (DBT) model and it is described as a function of the signal statistics. An efficient analytical method has been developed for the determination of the signal statistics at each node of the MAC architecture. It is based on the mathematical formulation of the multiplexing in time of signal sequences with known statistics. The effect of the multiplexing mechanism on the breakpoints of the DBT model, which influences significantly the accuracy of the method, is also determined. Several experiments both with synthetic and real data have been conducted. The numerical results produced by the proposed models are in very good agreement with the measured values of the transition activity.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pass transistor driving RC loads in nanoscale technologies",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6196384/",
            "Abstract": "In this paper the operation of the pass transistor driving RC loads is investigated for nanoscale technologies. The widely accepted CRC π-model is used for the representation of RC loads. The different operational conditions of the circuit are determined and the differential equations which describe its operation are solved analytically. Appropriate approximations are used for the current waveforms to simplify the modeling procedure without significant influence in the accuracy. The evaluation of the model is made through comparisons with HSpice simulation results and by using three different technologies: CMOS 65 nm, 32nm and 32 nm with high-k dielectric.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating the starting point of conduction in nanoscale CMOS gates",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6463502/",
            "Abstract": "In this paper a method for calculating the starting point of conduction of parallel and serial transistor structures in CMOS gates for the nanoscale regime is introduced. The calculation of the starting point is necessary for modeling the operation of complex gates. The influence of the parasitic capacitances is determined and the subthreshold and conducting behavior of the transistors are considered for the analysis of the operation of the serial transistor structure. Appropriate assumptions are used for modeling the circuit operation whose efficiency is determined by the accuracy of the results compared to HSPICE simulations. The overall accuracy of the proposed method is verified through HSPICE simulations for 32nm high k dielectric PTM technology.",
            "Abstract entirety": 1,
            "Author pub id": "CeK-UugAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        }
    ]
}]