[{
    "name": "Antonis Kakas",
    "romanize name": "Antonis Kakas",
    "School-Department": "Πληροφορικής",
    "University": "University of Cyprus",
    "Rank": "Καθηγητής",
    "Apella_id": 1421,
    "Scholar name": "Antonis Kakas",
    "Scholar id": "PrU4wEsAAAAJ",
    "Affiliation": "University of Cyprus",
    "Citedby": 6589,
    "Interests": [
        "Artificial Intelligence",
        "Abductive Reasoning",
        "Argumentation"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=PrU4wEsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "1 Department of Computer Science, University of Cyprus antonisQucy. ac. cy School of Library, Archive and Information Studies, University College London, UK rsmQucl. ac. uk",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/30739472/GetTRDoc.pdf#page=266",
            "Abstract": "The language£ for reasoning about actions and change can be translated into an argumentation framework. In this paper, we extend this translation of the basic language and show how it can, together with methods from abduction, form the basis for a principled implementation of£. The extension we have considered concerns the addition of new type of sentences in the language as well as allowing theories where the narrative of events given is incomplete. A system, called£-RES, is developed within the argumentation framework of Logic Programming without Negation as Failure (LPwNF). This can support directly a variety of modes of common sense reasoning such as: default persistence in credulous or sceptical form, assimilation of observations and their diagnosis possibly under incomplete information, as well as combinations of these. To improve the efficiency of the system we have considered the integration of a SAT solver within the LPwNF computation, to carry out the of validating the time universal constraints imposed by ramification statements.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Abduction and Induction: Essays on their relation and integration",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=E7fnCAAAQBAJ&oi=fnd&pg=PR13&dq=info:RMbW5m442-IJ:scholar.google.com&ots=eDKwbJB8FO&sig=4nGXGoVoZvUNiv5hoinYkyTmQYk",
            "Abstract": "From the very beginning of their investigation of human reasoning, philosophers have identified two other forms of reasoning, besides deduction, which we now call abduction and induction. Deduction is now fairly well understood, but abduction and induction have eluded a similar level of understanding. The papers collected here address the relationship between abduction and induction and their possible integration. The approach is sometimes philosophical, sometimes that of pure logic, and some papers adopt the more task-oriented approach of AI. The book will command the attention of philosophers, logicians, AI researchers and computer scientists in general.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "ACLP: Abductive constraint logic programming",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743106699000758",
            "Abstract": "This paper presents the framework of Abductive Constraint Logic Programming (ACLP), which integrates Abductive Logic Programming (ALP) and Constraint Logic Programming (CLP). In ACLP, the task of abduction is supported and enhanced by its non-trivial integration with constraint solving. This integration of constraint solving into abductive reasoning facilitates a general form of constructive abduction and enables the application of abduction to computationally demanding problems. The paper studies the formal declarative and operational semantics of the ACLP framework together with its application to various problems. The general characteristics of the computation of ACLP and of its application to problems are also discussed. Empirical results based on an implementation of the ACLP framework on top of the CLP language of ECLiPSe show that ACLP is computationally viable, with performance …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Electronic roads: intelligent navigation through multi-contextual information",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-003-0090-0",
            "Abstract": "This paper proposes a model for intelligent navigation through multi-contextual information that could form electronic roads in the information society. This paper aims to address the problem of electronic information roads, define their notion and the technical form they can take as well as present the tools developed for implementing such a system. The main objective of the proposed model is to give the traveler the capability of exploring the information space in a natural way where the information offered will remain continuously interesting. The system offers links to information in a dynamic and adaptive way. This is achieved by employing intelligent navigation techniques, which combine user profiling and meta-data. Electronic roads emphasize the presentation of multi-contextual information, i.e., information that is semantically related but of different nature at different locations and time. An electronic road …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Abduction in logic programming",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45628-7_16",
            "Abstract": "Abduction in Logic Programming started in the late 80s, early 90s, in an attempt to extend logic programming into a framework suitable for a variety of problems in Artificial Intelligence and other areas of Computer Science. This paper aims to chart out the main developments of the field over the last ten years and to take a critical view of these developments from several perspectives: logical, epistemological, computational and suitability to application. The paper attempts to expose some of the challenges and prospects for the further development of the field.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The KGP model of agency",
            "Publication year": 2004,
            "Publication url": "http://ftp.cs.rhul.ac.uk/~kostas/pubs/kakas04kgp.pdf",
            "Abstract": "This paper presents a new model of agency, called the KGP (Knowledge, Goals and Plan) model. This draws from the classic BDI model and proposes a hierarchical agent architecture with a highly modular structure that synthesises various reasoning and sensing capabilities of the agent in an open and dynamic environment. The novel features of the model include: its innovative use of Computational Logic (CL) in a way that facilitates both the formal analysis of the model and its computational realisability directly from the high-level specification of the agents (a first prototype for the development of KGP agents exists, based upon a correct computational counterpart of the model), the modular separation of concerns and flexibility afforded by the model in designing heterogeneous agents and in developing independently the various components of an agent, and the declarative agent control provided through a context-sensitive cycle CL theory component that regulates the agent’s operational behaviour, according to the current circumstances of operation, thus breaking away from the conventional one-size-fits-all control of operation.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A logic-based approach to model computees",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.8415",
            "Abstract": "a computational logic model for the description, analysis and verification of global and open societies of heterogeneous computees IST-2001-32530 Deliverable D4: A logic-based approach to model computees Project number:",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ELEVENTH PANHELLENIC LOGIC SYMPOSIUM (PLS 11, 2017) CO-SPONSORED BY THE ASSOCIATION FOR SYMBOLIC LOGIC Delphi, Greece July 12–16, 2017",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=8870549653748495910&hl=en&oi=scholarr",
            "Abstract": "The 11th Panhellenic Logic Symposium 2017 (PLS 11) was held in Delphi, Greece, July 12–16th, organized by the National and Kapodistrian University of Athens and the National Technical University of Athens. The University of Cyprus helped in the organization. The scientific program of the symposium consisted of hour-long invited talks, tutorials, special sessions, and presentations of accepted contributed papers and posters. It was the eleventh in this series of biennial scientific events that began in 1997, with the aim to promote interaction and cross-fertilization among different areas of logic. Originally conceived as a way to bring together the many logicians of Hellenic descent throughout the world, the PLS has evolved into an international forum for the communication of state-of-the-art advances in logic. The workshop had the scientific sponsorship of the Association for Symbolic Logic (ASL), the European …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "CAMBRIDGE UNIVERSITY PRESS FOR AND ON BEHALF OF THE ASSOCIATION OF SYMBOLIC LOGIC"
        },
        {
            "Title": "Reasoning about actions and change in argumentation",
            "Publication year": 2015,
            "Publication url": "https://content.iospress.com/articles/argument-and-computation/1123774",
            "Abstract": "This paper studies how logic-based reasoning about actions and change (RAC) with its problems of temporal projection and qualification can be formalised in terms of argumentation. In particular, we extend earlier work of translating the language E for RAC into a logic-based argumentation framework, by introducing new types of arguments for (i) backward persistence and (ii) persistence from observations. This forms a conservative extension of the language E that gives a semantic meaning to domains that cannot be interpreted under E thus addressing further the frame and (exogenous) qualification problems. As such the paper strengthens the link between argumentation theory and RAC in artificial intelligence.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Argumentation: reconciling human and automated reasoning",
            "Publication year": 2016,
            "Publication url": "https://openreview.net/pdf?id=Bk4yC7zdZS",
            "Abstract": "We study how using argumentation as an alternative foundation for logic gives a framework in which we can reconcile human and automated reasoning. We analyse this reconciliation between human and automated reasoning at three levels:(1) at the level of classical, strict reasoning on which, till today, automated reasoning and computing are based,(2) at the level of natural or ordinary human level reasoning as studied in cognitive psychology and which artificial intelligence, albeit in its early stages, is endeavouring to automate, and (3) at the level of the recently emerged cognitive computing paradigm where systems are required to be cognitively compatible with human reasoning based on common sense or expert knowledge, machine-learned from unstructured data in corpora over the web or other sources.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pre-Proceedings of the 2007 International Workshop on Abduction and Induction in Artificial Intelligence (AIAI’07)",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/30957993/10.1.1.110.4883.pdf",
            "Abstract": "Abduction and induction are forms of logical reasoning that are used in many applications of Artificial Intelligence (AI). Individually, abduction reasons from effects to possible causes, while induction learns general rules for particular observations. In combination, abduction and induction can be integrated within an iterative cycle of knowledge development. But, recent attempts to such hybrid methods in tasks that require spatio-temporal learning and reasoning, have begun to reveal a need for more expressive formalisms and inference mechanisms than offered by existing systems.This workshop will focus on expressive methodologies and applications of logic-based abduction and induction. To provide a concrete application domain, the AIAI’07 workshop will be co-located with the 1st Franco-Japanese Symposium on Knowledge Discovery in Systems Biology. The aims of the workshop are to investigate need for expressive logical formalisms in bioinformatics and other areas of AI, to idendity the state-of-the-art inference techniques for handling such formalisms, and to encourage interaction between biologists and logicians by discussing potential application areas and suggesting possible solutions.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gorgias-c: Extending argumentation with constraint solving",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-04238-6_54.pdf",
            "Abstract": "GORGIAS-C is a system implementing a logic programming framework of argumentation that integrates together preference reasoning and constraint solving.The framework of argumentation with preference reasoning [1,2] was first implemented in the GORGIAS system which hasmainly been used in the multi-agent domain [2,3,4], medical informatics [5] and network security [6].",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computational logic: logic programming and beyond: essays in honour of Robert A. Kowalski",
            "Publication year": 2002,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54308",
            "Abstract": "Computational logic : logic programming and beyond : essays in honour of Robert A. Kowalski \nToggle navigation English Ελληνικά English English Ελληνικά Login Toggle navigation View \nItem Home Δημοσιεύσεις ΠΚ / UCY Publications 002 Σχολή Θετικών και Εφαρμοσμένων \nΕπιστημών / Faculty of Pure and Applied Sciences Τμήμα Πληροφορικής / Department of \nComputer Science View Item Home Δημοσιεύσεις ΠΚ / UCY Publications 002 Σχολή Θετικών \nκαι Εφαρμοσμένων Επιστημών / Faculty of Pure and Applied Sciences Τμήμα Πληροφορικής / \nDepartment of Computer Science View Item Book Computational logic : logic programming and \nbeyond : essays in honour of Robert A. Kowalski Thumbnail Date 2002 Author Kowalski, Robert \nORCID logo Kakas, Antonis C. Sadri, Fariba 1956- ISBN 3-540-43960-9 Publisher Springer \nPlace of publication Berlin London Google Scholar check Keyword(s): Logic Automatic ://.…",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:0N-VGjzr574C",
            "Publisher": "Springer"
        },
        {
            "Title": "Abductive logic programming in the clinical management of hiv/aids",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qNTvAgAAQBAJ&oi=fnd&pg=PA437&dq=info:_N_3RsX8wwwJ:scholar.google.com&ots=QV6bLlAa2D&sig=PFDP-OsYi_QvBFJtmxMPicakDYM",
            "Abstract": "This paper presents a new Abductive Logic Programming (ALP) approach for assisting clinicians in the selection of antiretroviral drugs for patients infected with Human Immunodeficiency Virus (HIV). The approach is comparable to laboratory genotypic resistance testing in that it aims to determine which viral mutations a patient is carrying and predict which drugs they are most likely resistant to. But, instead of genetically analysing samples of the virus taken from patients–which is not always practicable–our approach infers likely mutations using the patient’s full clinical history and a model of drug resistance maintained by a leading HIV research agency. Unlike previous applications of abduction, our approach does not attempt to find the” best” explanations, as we can never be absolutely sure which mutations a patient is carrying. Rather, the intrinsic uncertainty of this domain means that multiple alternative explanations are inevitable and we must seek ways to extract useful information from them. The computational and pragmatic issues raised by this approach have led us to develop a new ALP methodology for handling numerous explanations and for drawing predictions with associated levels of confidence. We present our in-Silico Sequencing System (iS3) for reasoning about HIV drug resistance as a concrete example of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:k_IJM867U9cC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Abductive and inductive reasoning: essays on their relation and integration",
            "Publication year": 2000,
            "Publication url": "https://research.rug.nl/en/publications/abductive-and-inductive-reasoning-essays-on-their-relation-and-in",
            "Abstract": "Abductive and Inductive Reasoning: Essays on their Relation and Integration — the University \nof Groningen research portal Skip to main navigation Skip to search Skip to main content the \nUniversity of Groningen research portal Logo Help & FAQ English Nederlands Home Profiles \nResearch Units Research output Projects Datasets Prizes Activities Press / Media Search by \nexpertise, name or affiliation Abductive and Inductive Reasoning: Essays on their Relation and \nIntegration P Flach, A Kakas University of Groningen Research output: Book/Report › Book › \nAcademic Overview Original language Dutch Place of Publication Dordrecht/Boston/London \nPublisher Kluwer Academic Publishers Publication status Published - 2000 Cite this APA \nAuthor BIBTEX Harvard Standard RIS Vancouver Flach, P., & Kakas, A. (2000). Abductive \nand Inductive Reasoning: Essays on their Relation and Integration. Kluwer Academic . , P ; /…",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Rule extraction in the assessment of brain MRI lesions in multiple sclerosis: preliminary findings",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-89128-2_27",
            "Abstract": "Various artificial intelligence (AI) algorithms have been proposed in the literature, that are used as medical assistants in clinical diagnostic tasks. Explainability methods are lighting the black-box nature of these algorithms. The objective of this study was the extraction of rules for the assessment of brain magnetic resonance imaging (MRI) lesions in Multiple Sclerosis (MS) subjects based on texture features. Rule extraction of lesion features was used to explain and provide information on the disease diagnosis and progression. A dataset of 38 subjects diagnosed with a clinically isolated syndrome (CIS) of MS and MRI detectable brain lesions were scanned twice with an interval of 6–12 months. MS lesions were manually segmented by an experienced neurologist. Features were extracted from the segmented MS lesions and were correlated with the expanded disability status scale (EDSS) ten years after the …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:OTTXONDVkokC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the semantics of abstract argumentation",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/logcom/article-abstract/23/5/991/941885",
            "Abstract": "Arguments need to be judged against other arguments. The decision to accept or reject an argument is generally a global decision that involves examining the same question for other arguments that oppose or can defend the argument in question. This article presents the acceptability semantics for abstract argumentation that through a recursive definition gives a global assignment of the acceptable and non-acceptable subsets of arguments. This semantics stems from the aim to formalize directly the generally accepted intuition that: ‘An argument can be accepted if and only if all its challenging arguments can be rejected.’ The acceptability semantics tightly integrates the notion of defending against a challenging argument by counter-attacking it with the notion of self-defeating (or self-rejecting) arguments that (help to) bring about their own non-acceptability. The proposal is motivated by earlier studies of the …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:08ZZubdj9fEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "An abductive-based scheduler for air-crew assignment",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08839510151063299",
            "Abstract": "This article presents the design and implementation of an air-crew assignment system, for producing and refining a solution to this problem, based on the artificial intelligence principles and techniques of abductive reasoning as captured by the framework of abductive logic programming (ALP). The system offers a high level of flexibility in addressing both the tasks of crew scheduling and rescheduling. Itcan be used to generate a valid and good quality initial solution and then help the human operators adjust and refine further this solution in order to meet extra requirements of the problem. These additional needs can arise either due to new foreseen requirements that the company wants to have or experiment with for a particular period in time, or due to unexpected events that have occurred while the solution (crew-roster) is in operation. This work shows the ability and flexibility of abduction, and, more specifically …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:TQgYirikUcIC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "WinoFlexi: a crowdsourcing platform for the development of Winograd schemas",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-35288-2_24",
            "Abstract": "The Winograd Schema Challenge, the task of resolving pronouns in certain carefully-structured sentences, has received considerable interest in the past few years as an alternative to the Turing Test. Systems developed to tackle this challenge have typically been evaluated on a small set of hand-crafted collections of sentences, since the development of new sentences by individuals is itself a rather challenging task, requiring care and creativity. In this paper we approach the problem of developing Winograd schemas via the introduction of WinoFlexi, a flexible online crowdsourcing system. Our empirical evaluation of the system’s performance suggests that WinoFlexi allows crowdworkers to develop Winograd schemas of quality similar to that of most typical existing collections.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Cognitive Argumentation and the Suppression Task",
            "Publication year": 2020,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2020arXiv200210149D/abstract",
            "Abstract": "This paper addresses the challenge of modeling human reasoning, within a new framework called Cognitive Argumentation. This framework rests on the assumption that human logical reasoning is inherently a process of dialectic argumentation and aims to develop a cognitive model for human reasoning that is computational and implementable. To give logical reasoning a human cognitive form the framework relies on cognitive principles, based on empirical and theoretical work in Cognitive Science, to suitably adapt a general and abstract framework of computational argumentation from AI. The approach of Cognitive Argumentation is evaluated with respect to Byrne's suppression task, where the aim is not only to capture the suppression effect between different groups of people but also to account for the variation of reasoning within each group. Two main cognitive principles are particularly important to capture …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ARNI: Abductive inference of complex regulatory network structures",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-40708-6.pdf#page=251",
            "Abstract": "Physical network inference methods use a template of molecular interaction to infer biological networks from high throughput datasets. Current inference methods have limited applicability, relying on cause-effect pairs or systematically perturbed datasets and fail to capture complex network structures. Here we present a novel framework, ARNI, based on abductive inference, that addresses these limitations.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer"
        },
        {
            "Title": "The Cycle of Abductive and Inductive Knowledge Development",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.58.2345&rep=rep1&type=pdf",
            "Abstract": "Abduction and Induction have existed mostly as separate subjects in Artificial Intelligence and other disciplines. They have each been studied as central inference mechanisms in order to tackle a set of particular but largely different problems. Abduction is mainly used to address problems of diagnosis and planning whereas induction is primarily used in the problem of machine learning. Within the wider context of the formation and the development of a knowledge theory, however, these two forms of reasoning interact and can be integrated together in a cooperative and enhancing way. In this paper we study this possibility of integration between abduction and induction and present a cycle of knowledge development based on this integration. This paper is a summary of part of the introductory chapter of a recent book [5] which addresses more generally the issues of the relation and integration between abduction and induction.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A unified argumentation-based framework for knowledge qualification",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/SSS/SSS11/paper/viewPaper/2464",
            "Abstract": "Among the issues faced by an intelligent agent, central is that of reconciling the, often contradictory, pieces of knowledge—be those given, learned, or sensed—at its disposal. This problem, known as knowledge qualification, requires that pieces of knowledge deemed reliable in some context be given preference over the others. These preferences are typically viewed as encodings of reasoning patterns; so, the frame axiom can be encoded as a preference of persistence over spontaneous change. Qualification, then, results by the principled application of these preferences. We illustrate how this can be naturally done through argumentation, by uniformly treating object-level knowledge and reasoning patterns alike as arguments that can be defeated by other stronger ones. We formulate an argumentation framework for Reasoning about Actions and Change that gives a semantics for Action Theories that include a State Default Theory. Due to their explicit encoding as preferences, reasoning patterns can be adapted, when and if needed, by a domain designer to suit a specific application domain. Furthermore, the reasoning patterns can be defeated in lieu of stronger external evidence, allowing, for instance, the frame axiom to be overridden when unexpected sensory information suggests that spontaneous change may have broken persistence in a particular situation.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A/B Testing",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Jon-Timmis/publication/316113768_Artificial_Immune_Systems/links/5a85a6800f7e9b1a95481ff5/Artificial-Immune-Systems.pdf",
            "Abstract": "Anomalies correspond to the behavior of a system which does not conform to its expected or normal behavior. Identifying such anomalies from observed data, or the task of anomaly detection, is an important and often critical analysis task. This includes finding abnormalities in a medical image, fraudulent transactions in a credit card history, or structural defects in an aircraft’s engine. The importance of this problem has resulted in a large body of literature on this topic. However, given that the definition of an anomaly is strongly tied to the underlying application, the existing research is often embedded in the application domains, and it is unclear how methods developed for one domain would perform in another. The goal of this article is to provide a general introduction of the anomaly detection problem. We start with the basic formulation of the problem and then discuss the various extensions. In particular, we discuss the challenges associated with identifying anomalies in structured data and provide an overview of existing research in this area. We hope that this article will provide a better understanding of the different directions in which research has been done on this topic, and how techniques developed in one area can be applied in domains for which they were not intended to begin with.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "odular- ε: An Elaboration Tolerant Approach to the Ramification and Qualification Problems",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11546207_17",
            "Abstract": "We describe odular-ε (), a specialized, model-theoretic logic for narrative reasoning about actions, able to represent non-deterministic domains involving concurrency, static laws (constraints) and indirect effects (ramifications). We give formal results which characterize ’s high degree of modularity and elaboration tolerance, and show how these properties help to separate out, and provide a principled solutions to, the endogenous and exogenous qualification problems. We also show how a notion of (micro) processes can be used to facilitate reasoning at the dual levels of temporal granularity necessary for narrative-based domains involving “instantaneous” series of indirect and knock-on effects.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Declarative agent control",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11533092_6",
            "Abstract": "In this work, we extend the architecture of agents (and robots) based upon fixed, one-size-fits-all cycles of operation, by providing a framework of declarative specification of agent control. Control is given in terms of cycle theories, which define in a declarative way the possible alternative behaviours of agents, depending on the particular circumstances of the (perceived) external environment in which they are situated, on the internal state of the agents at the time of operation, and on the agents’ behavioural profile. This form of control is adopted by the KGP model of agency and has been successfully implemented in the PROSOCS platform. We also show how, via cycle theories, we can formally verify properties of agents’ behaviour, focusing on the concrete property of agents’ interruptibility. Finally, we give some examples to show how different cycle theories give rise to different, heterogeneous agents …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Abductive and inductive reasoning: background and issues",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-0606-3_1",
            "Abstract": "This collection is devoted to the analysis and application of abductive and inductive reasoning in a common context, studying their relation and possible ways for integration. There are several reasons for doing so. One reason is practical, and based on the expectation that abduction and induction are sufficiently similar to allow for a tight integration in practical systems, yet sufficiently complementary for this integration to be useful and productive.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "The KGP model of agency for global computing: Computational model and prototype implementation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-31794-4_18",
            "Abstract": "We present the computational counterpart of the KGP (Knowledge, Goals, Plan) declarative model of agency for Global Computing. In this context, a computational entity is seen as an agent developed using Computational Logic tools and techniques. We model a KGP agent by relying upon a collection of capabilities, which are then used to define a collection of transitions, to be used within logically specified, context sensitive control theories, which we call cycle theories. In close relationship to the declarative model, the computational model mirrors the logical architecture by specifying appropriate computational counterparts for the capabilities and using these to give the computational models of the transitions. These computational models and the one specified for the cycle theories are all based on, and are significant extensions of, existing proof procedures for abductive logic programming and logic …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Argumentative agent deliberation, roles and context",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1571066104805875",
            "Abstract": "This paper presents an argumentation based framework to support an agent's deliberation process for drawing conclusions under a given policy. The argumentative policy of the agent is able to take into account the roles agents can have within a context pertaining to an environment of interaction. The framework uses roles and context to define policy preferences at different levels of deliberation allowing a modular representation of the agent's knowledge that avoids the need for explicit qualification of the agent's decision rules. We also employ a simple form of abduction to deal with the incompleteness and evolving nature of the agent's knowledge of the external environment and illustrate how an agent's self deliberation can affect the mode of interaction between agents. The high degree of modularity of the framework gives it a simple computational model in which the agent's deliberation can be naturally …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Argumentation with abduction",
            "Publication year": 2003,
            "Publication url": "http://www.cs.ucy.ac.cy/~nkd/gorgias/docs/pls2003.pdf",
            "Abstract": "This paper presents a general approach to combining argumentation and abduction where the different uses of argumentation for preference reasoning and abduction for reasoning under incomplete information are synthesized together in an enhancing way. This integrated approach of argumentation and abduction can form the basis for encoding adaptable preference policies in the face of incomplete information from dynamic and evolving environments. The paper shows how this integration can be achieved within a suitable logic based framework and studies a simple computational model to capture the combined form of reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of abductive ILP to learning metabolic network inhibition from temporal data",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s10994-006-8988-x",
            "Abstract": "In this paper we use a logic-based representation and a combination of Abduction and Induction to model inhibition in metabolic networks. In general, the integration of abduction and induction is required when the following two conditions hold. Firstly, the given background knowledge is incomplete. Secondly, the problem must require the learning of general rules in the circumstance in which the hypothesis language is disjoint from the observation language. Both these conditions hold in the application considered in this paper. Inhibition is very important from the therapeutic point of view since many substances designed to be used as drugs can have an inhibitory effect on other enzymes. Any system able to predict the inhibitory effect of substances on the metabolic network would therefore be very useful in assessing the potential harmful side-effects of drugs. In modelling the phenomenon of inhibition in …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:ufrVoPGSRksC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Abduction and induction for modelling inhibition in metabolic networks",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Antonis-Kakas/publication/4230163_Abduction_and_induction_for_learning_models_of_inhibition_in_metabolic_networks/links/54316b790cf27e39fa9f91f3/Abduction-and-induction-for-learning-models-of-inhibition-in-metabolic-networks.pdf",
            "Abstract": "This paper describes the use of a mixture of abduction and induction for the problem of identifying the effects of toxins in metabolic networks. Background knowledge is used which describes network topology and functional classes of enzymes. This background knowledge, which represents the present state of understanding, is incomplete. In order to overcome this incompleteness hypotheses are entertained which consist of a mixture of specific inhibitions of enzymes (ground facts) together with general rules which predict classes of enzymes likely to be inhibited by the toxin (nonground). The foreground examples were derived from in vivo experiments involving NMR analysis of time-varying metabolite concentrations in rat urine following injections of toxin. Hypotheses about inhibition are built using Progol5. 0 and predictive accuracy is assessed for both the ground and the non-ground cases.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation logic as an anhomomorphic logic",
            "Publication year": 2015,
            "Publication url": "http://www.doc.ic.ac.uk/~ft/PAPERS/AL-Quantum-9(CR).pdf",
            "Abstract": "Recent work proposed Anhomomorphic Logic, characterized in algebraic terms via answering maps on a Boolean algebra of propositions, as a logical framework appropriate for physics, including both classical and quantum theory. In this paper we study how another type of logic, called Argumentation Logic, generalizing classical logic to accommodate various forms of commonsense reasoning, exhibits properties of Anhomomorphic Logic.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive argumentation for human syllogistic reasoning",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s13218-019-00608-y",
            "Abstract": "This paper brings together work from the psychology of reasoning and computational argumentation in AI to propose a cognitive computational model for human reasoning and in particular for human syllogistic reasoning. The model is grounded in the formal framework of argumentation in AI with its dialectic semantics for the quality of arguments. Arguments for logical conclusions are constructed via a set of proposed argument schemes, chosen for their cognitive validity, as supported by studies in cognitive psychology. The proposed model with its cognitive principles of argumentation can encompass together in a uniform way both formal and informal logical reasoning, capturing well the empirical data of human syllogistic reasoning in the recent Syllogism Challenge 2017 on cognitive modeling. The paper also argues that the proposed approach could be applied more generally to other forms of high-level …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:SpbeaW3--B0C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Narrative text comprehension: From psychology to ai",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Irene-Anna-Diakidoy/publication/282211092_Narrative_Text_Comprehension_From_Psychology_to_AI/links/5607b52d08aea25fce39a1e7/Narrative-Text-Comprehension-From-Psychology-to-AI.pdf",
            "Abstract": "This paper brings together the theory of Argumentation in AI with the Psychology of Story Comprehension to develop a KRR framework for Narrative Text Comprehension. The proposed framework is based on a computational understanding of the general psychological principles of coherency and cognitive economy for text comprehension. In this first part of the study the work concentrates on the central problem of integration (or elaboration) of the explicit information from the text with the implicit (in the reader’s mind) common sense world knowledge pertaining to the topic (s) of the story given in the text. We show how the major challenges for a successful story comprehension are closely related to those of NMR, as found in Default Reasoning and Reasoning about Action and Change and the specific problems of Knowledge Qualification and Revision within these areas and, how an appropriate formulation through argumentation can give a basis for automating the construction and revision of a coherent comprehension model of a narrative. We report on a first set of empirical experiments to harness the implicit world knowledge used by humans reading a story to guide the background knowledge given as input to our framework and present a prototype system that is used to evaluate the ability of our approach to capture both the majority and the variability of understanding of a story by the human readers in the experiment. The strong inter-disciplinary nature of our work can help us to examine closely and improve our understanding of the computational nature of common sense knowledge while at the same time offering a concrete and important …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive Argumentation and the Suppression Task",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2002.10149",
            "Abstract": "This paper addresses the challenge of modeling human reasoning, within a new framework called Cognitive Argumentation. This framework rests on the assumption that human logical reasoning is inherently a process of dialectic argumentation and aims to develop a cognitive model for human reasoning that is computational and implementable. To give logical reasoning a human cognitive form the framework relies on cognitive principles, based on empirical and theoretical work in Cognitive Science, to suitably adapt a general and abstract framework of computational argumentation from AI. The approach of Cognitive Argumentation is evaluated with respect to Byrne's suppression task, where the aim is not only to capture the suppression effect between different groups of people but also to account for the variation of reasoning within each group. Two main cognitive principles are particularly important to capture human conditional reasoning that explain the participants' responses: (i) the interpretation of a condition within a conditional as sufficient and/or necessary and (ii) the mode of reasoning either as predictive or explanatory. We argue that Cognitive Argumentation provides a coherent and cognitively adequate model for human conditional reasoning that allows a natural distinction between definite and plausible conclusions, exhibiting the important characteristics of context-sensitive and defeasible reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational Logic: Logic Programming and Beyond: Essays in Honour of Robert A. Kowalski Part I",
            "Publication year": 2002,
            "Publication url": "https://lib.hpu.edu.vn/handle/123456789/32312",
            "Abstract": "Alan Robinson This set of essays pays tribute to Bob Kowalski on his 60th birthday, an anniversary which gives his friends and colleagues an excuse to celebrate his career as an original thinker, a charismatic communicator, and a forceful intellectual leader. The logic programming community hereby and herein conveys its respect and thanks to him for his pivotal role in creating and fostering the conceptual paradigm which is its raison d’Œtre. The diversity of interests covered here reflects the variety of Bob’s concerns. Read on. It is an intellectual feast. Before you begin, permit me to send him a brief personal, but public, message: Bob, how right you were, and how wrong I was. I should explain. When Bob arrived in Edinburgh in 1967 resolution was as yet fairly new, having taken several years to become at all widely known. Research groups to investigate various aspects of resolution sprang up at several institutions, the one organized by Bernard Meltzer at Edinburgh University being among the first. For the half-dozen years that Bob was a leading member of Bernard’s group, I was a frequent visitor to it, and I saw a lot of him. We had many discussions about logic, computation, and language.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "Information integration and computational logic",
            "Publication year": 2001,
            "Publication url": "https://arxiv.org/abs/cs/0106025",
            "Abstract": "Information Integration is a young and exciting field with enormous research and commercial significance in the new world of the Information Society. It stands at the crossroad of Databases and Artificial Intelligence requiring novel techniques that bring together different methods from these fields. Information from disparate heterogeneous sources often with no a-priori common schema needs to be synthesized in a flexible, transparent and intelligent way in order to respond to the demands of a query thus enabling a more informed decision by the user or application program. The field although relatively young has already found many practical applications particularly for integrating information over the World Wide Web. This paper gives a brief introduction of the field highlighting some of the main current and future research issues and application areas. It attempts to evaluate the current and potential role of Computational Logic in this and suggests some of the problems where logic-based techniques could be used.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Abduction and induction in artificial intelligence",
            "Publication year": 2009,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/abduction-and-induction-in-artificial-intelligence",
            "Abstract": "Abduction and induction are two forms of reasoning with incomplete information that are appropriate for many tasks in Artificial Intelligence (AI). To a first approximation, abduction reasons from effects to possible causes, while induction learns general rules to account for particular observations. As our logical and philosophical understanding of these two forms of reasoning continues to grow, and our computational techniques are steadily improved, evidence accumulates that there are potentially significant benefits to be gained from integrating abduction and induction, in a cooperative way, within an incremental cycle of knowledge development. Different conceptual models for integrating abduction and induction are emerging which seem particularly promising for application to scientific modelling such as in the area of Systems Biology. Recent work in Machine Learning and Scientific Discovery is now demonstrating the viability of such an integrated approach by providing the first tentative applications of frameworks and systems designed to exploit the combination of abductive and inductive reasoning. This special issue reports on such recent developments focusing on expressive methodologies for logic-based abduction and induction. The volume grew out of the AIAI'07 workshop on Abduction and Induction in Artificial Intelligence and Bioinformatics, which took place on September 15th, 2007 in Aix-en-Provence, France. This workshop followed the series of workshops on abduction and induction that took place in the 1990s, culminating in the edited volume Abduction and Induction: Essays on their Relation and Integration (Kluwer, 2000); and …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Elsevier BV"
        },
        {
            "Title": "Anti-Cancer Activity and Phenolic Content of Extracts Derived from Cypriot Carob (Ceratonia siliqua L.) Pods Using Different Solvents",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1420-3049/26/16/5017",
            "Abstract": "Extracts derived from the Ceratonia siliqua L. (carob) tree have been widely studied for their ability to prevent many diseases mainly due to the presence of polyphenolic compounds. In this study, we explored, for the first time, the anti-cancer properties of Cypriot carobs. We produced extracts from ripe and unripe whole carobs, pulp and seeds using solvents with different polarities. We measured the ability of the extracts to inhibit proliferation and induce apoptosis in cancer and normal immortalized breast cells, using the MTT assay, cell cycle analysis and Western Blotting. The extracts’ total polyphenol content and anti-oxidant action was evaluated using the Folin–Ciocalteu method and the DPPH assay. Finally, we used LC-MS analysis to identify and quantify polyphenols in the most effective extracts. Our results demonstrate that the anti-proliferative capacity of carob extracts varied with the stage of carob maturity and the extraction solvent. The Diethyl-ether and Ethyl acetate extracts derived from the ripe whole fruit had high Myricetin content and also displayed specific activity against cancer cells. Their mechanism of action involved caspase-dependent and independent apoptosis. Our results indicate that extracts from Cypriot carobs may have potential uses in the development of nutritional supplements and pharmaceuticals.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Abduction, induction, and the logic of scientific knowledge development",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/46012052/AIAI06.pdf#page=25",
            "Abstract": "In this paper we outline some recent developments in the study of abduction and induction and their role in scientific modelling and knowledge refinement. We also describe a central challenge that appears to be emerging from this study: namely, the problem of developing practical approaches for exploiting abduction and induction, of formally characterising the limitations of such approaches, and of identifying the classes of real-world problems to which they can be usefully applied.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation-Based Security for Social Good Erisa Karafili",
            "Publication year": 2018,
            "Publication url": "https://www.doc.ic.ac.uk/~afr114/explainAI/talks/erisa.pdf",
            "Abstract": "Argumentation-Based Security for Social Good Erisa Karafili Page 1 Argumentation-Based \nSecurity for Social Good Erisa Karafili Imperial College London April 25, 2018 Erisa Karafili, \nAntonis C. Kakas, Nikolaos I. Spanoudakis, Emil C. Lupu “AF-Cyber: Logic-based \nAttribution and Forensics in Cyber Security” Funded from the EU’s Horizon 2020 under the \nMarie Sk lodowska-Curie grant agreement No 746667. Page 2 Agenda 1 Introduction 2 \nSecure Data Sharing with Argumentation 3 Attribution Problem in Cyber Attacks 4 \nConclusions Erisa Karafili ExplAIn 2018 Argumentation-Based Security for Social Good \nApril 25, 2018 2 / 25 Page 3 1 Introduction 2 Secure Data Sharing with Argumentation 3 \nAttribution Problem in Cyber Attacks 4 Conclusions Erisa Karafili ExplAIn 2018 \nArgumentation-Based Security for Social Good April 25, 2018 3 / 25 Page 4 Introduction to \nthe Solution Two important problems in “social ” can -…",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Logical modeling of cancer and chemoprevention",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/David-Bohan/publication/236625409_Towards_automatic_construction_and_corroboration_of_food_webs/links/004635188d9eed032d000000/Towards-automatic-construction-and-corroboration-of-food-webs.pdf#page=40",
            "Abstract": "Logical modeling of cell biological phenomena has the potential to facilitate both the understanding of the mechanisms that underly the phenomena as well as the process of experimentation undertaken by the biologist.In this paper, starting from the general hypotheses that Scientific Modeling is inextricably linked to abductive reasoning, we aim to develop a general logical model of cell signalling within the framework of Abductive Logic Programming and to provide based on this automated help to the biologists in thinking about their experiments and their possible further investigation of the phenomena they are studying. We present a system, called ApoCelSys, that provides an automated analysis of experimental results and support to a biology laboratory that is studying Cancer and Chemoprevention. The development of the ApoCelSys system is currently at a preliminary stage and further experimentation with it is required for it to meet fully its objective of being an automated scientific assistant.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ACLP: integrating abduction and constraint solving",
            "Publication year": 2000,
            "Publication url": "https://arxiv.org/abs/cs/0003020",
            "Abstract": "ACLP is a system which combines abductive reasoning and constraint solving by integrating the frameworks of Abductive Logic Programming (ALP) and Constraint Logic Programming (CLP). It forms a general high-level knowledge representation environment for abductive problems in Artificial Intelligence and other areas. In ACLP, the task of abduction is supported and enhanced by its non-trivial integration with constraint solving facilitating its application to complex problems. The ACLP system is currently implemented on top of the CLP language of ECLiPSe as a meta-interpreter exploiting its underlying constraint solver for finite domains. It has been applied to the problems of planning and scheduling in order to test its computational effectiveness compared with the direct use of the (lower level) constraint solving framework of CLP on which it is built. These experiments provide evidence that the abductive framework of ACLP does not compromise significantly the computational efficiency of the solutions. Other experiments show the natural ability of ACLP to accommodate easily and in a robust way new or changing requirements of the original problem.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conflicts resolution with the SoDA methodology",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57285-7_6",
            "Abstract": "This paper studies the application of argumentation theory and methods from Artificial Intelligence to the problem of conflict resolution. It shows how the decision theories of each of the parties involved in a conflict can be captured and formalized within a framework of preference-based argumentation. In particular, it studies how the SoDA methodology and its support tool, Gorgias-B for developing argumentation software, facilitate the elucidation of each party’s preferences over their available options for addressing the conflict, and, through this, the construction of appropriate argumentation theories corresponding to the decision theories of the parties involved. These argumentation theories are generated automatically and can be executed directly to find out the position of each party at any particular stage of the negotiation process. This connection between argumentation and conflict resolution is illustrated …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:35r97b3x0nAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Abductive concept learning",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/BF03037531.pdf",
            "Abstract": "We investigate how abduction and induction can be integrated into a common learning framework. In particular, we consider an extension of Inductive Logic Programming (ILP) for the case in which both the background and the target theories are abductive logic programs and where an abductive notion of entailment is used as the basic coverage relation for learning. This extended learning framework has been called Abductive Concept Learning (ACL). In this framework, it is possible to learn with incomplete background information about the training examples by exploiting the hypothetical reasoning of abduction. We also study how the ACL framework can be used as a basis for multiple predicate learning.An algorithm for ACL is developed by suitably extending the top-down ILP method: the deductive proof procedure of Logic Programming is replaced by an abductive proof procedure for Abductive …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Knowledge Activation in Story Comprehension",
            "Publication year": 2017,
            "Publication url": "https://cognition.ouc.ac.cy/loizos/papers/Diakidoy.etal_2017_KnowledgeActivation.pdf",
            "Abstract": "The purpose of this study was to provide behavioral data regarding the world knowledge that readers activate during story comprehension with a view to inform the development of formal and computational representation of knowledge for automated comprehension. The focus of the study was on the amount, the structural aspects, and the coherence function of the activated knowledge. In a knowledge elicitation task, undergraduate students recorded the knowledge they deemed necessary for understanding each sentence in a set of four short stories in the form of property and causal knowledge rules. Results indicated the activation of a limited amount of knowledge that maintained both situational and conceptual connections with input. Situational inferencing and continuity (ie, carrying over of previously activated ideas) were positively associated and varied as a function of story part. Findings are discussed in relation to dominant theoretical models of narrative comprehension and for their implications regarding the computational representation of knowledge in automated story comprehension.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Abduction and induction for learning models of inhibition in metabolic networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1607456/",
            "Abstract": "This paper describes the use of a mixture of abduction and induction for the temporal modeling of the effects of toxins in metabolic networks. Background knowledge is used which describes network topology and functional classes of enzymes. This background knowledge, which represents the present state of understanding, is incomplete. In order to overcome this incompleteness hypotheses are considered which consist of a mixture of specific inhibitions of enzymes (ground facts) together with general (non-ground) rules which predict classes of enzymes likely to be inhibited by the toxin. The foreground examples were derived from in vivo experiments involving NMR analysis of time-varying metabolite concentrations in rat urine following injections of toxin. Hypotheses about inhibition are built using the inductive logic programming system Progol5.0 and predictive accuracy is assessed for both the ground and the …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "New Trends in Constraints: Joint ERCIM/Compulog Net Workshop Paphos, Cyprus, October 25-27, 1999 Selected Papers",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Rfzl7yIfJgMC&oi=fnd&pg=PP4&dq=info:WZ95Bz32w7YJ:scholar.google.com&ots=VrSKTZeZW4&sig=GmQCYFS65yE0vEdsAQqR-yVK_k8",
            "Abstract": "This book constitutes the thoroughly refereed post-proceedings of the Joint ERCIM/Compulog-Net Workshop on New Trends in Constraints held in Paphos, Cyprus, Greece in October 1999. The 12 revised full research papers presented together with four surveys by leading researchers were carefully reviewed. The book is divided in topical sections on constraint propagation and manipulation, constraint programming, and rule-based constraint programming.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Reasoning about actions and change in answer set programming",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24609-1_8",
            "Abstract": "This paper studies computational issues related to the problem of reasoning about actions and change (RAC) by exploiting its link with the Answer Set Programming paradigm. It investigates how increasing the expressiveness of a RAC formalism so that it can capture the three major problems of frame, ramification and qualification, affects its computational complexity, and how a solution to these problems can be implemented within Answer Set Programming. Our study is carried out within the particular language ε. It establishes a link between ε and Answer Set Programming by presenting encodings of different versions of this language into logic programs under the answer set semantics. This provides a computational realization of solutions to problems related to reasoning about actions and change, that can make use of the recent development of effective systems for Answer Set Programming.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Adaptive agent negotiation via argumentation",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1160633.1160701",
            "Abstract": "In this paper, we study how argumentation can be used as a basis for negotiation between autonomous agents, where negotiation strategies of the different parties are represented as argumentation theories within their knowledge. We propose an argumentation based negotiation protocol in which offers by the negotiating parties are linked to different arguments that they can build according to their individual negotiation strategy. This protocol is able to take into account the different roles of agents and context of interaction, where the strength of the arguments supporting an offer can depend on these factors. The agents can adapt their negotiation strategies and offers, as their environment changes, in particular during the course of the negotiation as they exchange information. In addition, using abduction alongside with argumentation, agents can find negotiating conditions to support an argument for an offer, thus …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Layered strategies and protocols for argumentation-based agent interaction",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-32261-0_5",
            "Abstract": "Communication between agents needs to be flexible enough to encompass together a variety of different aspects such as, conformance to society protocols, private tactics of the individual agents, strategies that reflect different classes of agent types (or personal attitudes) and adaptability to the particular external circumstances at the time when the communication takes place. In this paper we propose an argument-based framework for representing communication theories of agents that can take into account in a uniform way these different aspects. We show how this approach can be used to realize existing types of dialogue strategies and society protocols in a way that facilitates their modular development and extension to make them more flexible in handling different or special circumstances.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automated scientific assistant for Cancer and Chemoprevention",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_11",
            "Abstract": "Logical modeling of cell biological phenomena has the potential to facilitate both the understanding of the mechanisms that underly the phenomena as well as the process of experimentation undertaken by the biologist. Starting from the general hypotheses that Scientific Modeling is inextricably linked to abductive reasoning, we aim to develop a general logical model of cell signalling and to provide an automated scientific assistant for the biologists to help them in thinking about their experimental results and the possible further investigation of the phenomena of interest. We present a first such system, called ApoCelSys, that provides an automated analysis of experimental results and support to a biology laboratory that is studying Cancer and Chemoprevention.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:olpn-zPbct0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Cognitive Argumentation and the Selection Task",
            "Publication year": 2021,
            "Publication url": "https://escholarship.org/uc/item/4n0867c7",
            "Abstract": "This paper presents a study of the selection task based on Cognitive Argumentation (CA), a computational framework for dialectic argumentation-based reasoning. CA is built from a theoretical framework of argumentation in AI which is then grounded via cognitive principles from Cognitive Science. The aim is to understand the selection task variations by studying how argumentative reasoning is suitably flexible to uniformly capture the differences among the individuals' selections, the canonical groups and the shifts within the different contexts in which the experiment is carried out. Our approach is assessed with respect to the developed criteria within the meta-analysis of Ragni and Johnson-Laird in 2018.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:IRz6iEL74y4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Workshop on Abduction and Induction in AI and Scientific Modelling",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.99.8993&rep=rep1&type=pdf",
            "Abstract": "Abduction and Induction are forms of logical reasoning with incomplete information that have many applications in AI. Abduction reasons from effects to possible causes and has been used in tasks such as planning and diagnosis. Induction learns general rules for observed data and is typically used for classification and knowledge acquisition.This Workshop investigates the claim that Abduction and Induction play fundamental roles in the process of scientific knowledge development and that these these complementary forms of reasoning can be profitably integrated in an automated cycle of theory refinement. The contributed papers examine these issues from philosophical, cognitive and practical points of view.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation based decision making for autonomous agents",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/860575.860717",
            "Abstract": "This paper presents an argumentation based framework to support the decision making of an agent within a modular architecture for agents. The proposed argumentation framework is dynamic, with arguments and their strength depending on the particular context that the agent finds himself, thus allowing the agent to adapt his decisions in a changing environment. In addition, in order to enable the agent to operate within an open environment where the available information may be incomplete we have integrated abduction within this argumentation framework. This is particular useful when the agent finds himself in a dilemma and hence needs additional information to resolve this. We have also developed, motivated by work in Cognitive Psychology, within the same framework an argumentation based personality theory for agents thus incorporating a dimension of individuality in the decisions of the agent.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational logic foundations of KGP agents",
            "Publication year": 2008,
            "Publication url": "http://www.jair.org/index.php/jair/article/view/10575",
            "Abstract": "This paper presents the computational logic foundations of a model of agency called the KGP (Knowledge, Goals and Plan model. This model allows the specification of heterogeneous agents that can interact with each other, and can exhibit both proactive and reactive behaviour allowing them to function in dynamic environments by adjusting their goals and plans when changes happen in such environments. KGP provides a highly modular agent architecture that integrates a collection of reasoning and physical capabilities, synthesised within transitions that update the agent's state in response to reasoning, sensing and acting. Transitions are orchestrated by cycle theories that specify the order in which transitions are executed while taking into account the dynamic context and agent preferences, as well as selection operators for providing inputs to transitions.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the qualification problem and elaboration tolerance",
            "Publication year": 2003,
            "Publication url": "https://www.aaai.org/Papers/Symposia/Spring/2003/SS-03-05/SS03-05-013.pdf",
            "Abstract": "In this paper we study the qualification problem in theories of reasoning about actions and change and the link of this problem to properties of representation for expressing such theories. We examine the interaction of the qualification problem with the frame and ramification problems and show how an integrated solution to these problems can be developed where the frame persistence and constraint satisfaction qualify implicitly the action effect laws of the theory. We compare the two approaches of implicit and explicit qualification of the effects laws and argue that from the point of view of knowledge representation the former has better properties pertaining to elaboration tolerance.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation for Propositional Logic and Nonmonotonic Reasoning.",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.644.449&rep=rep1&type=pdf",
            "Abstract": "Argumentation has played a significant role in understanding and unifying under a common framework different forms of defeasible reasoning in AI. Argumentation is also close to the original inception of logic as a framework for formalizing human argumentation and debate. In this context, the purpose of this paper is twofold: to draw a formal connection between argumentation and classical reasoning (in the form of Propositional Logic) and link this to support defeasible, Non-Monotonic Reasoning in AI. To this effect, we propose Argumentation Logic and show properties and extensions thereof.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Informalizing formal logic",
            "Publication year": 2019,
            "Publication url": "https://www.erudit.org/en/journals/informallogic/1900-v1-n1-informallogic04674/1060943ar/abstract/",
            "Abstract": "This paper presents a way in which formal logic can be understood and reformulated in terms of argumentation that can help us unify formal and informal reasoning. Classical deductive reasoning will be expressed entirely in terms of notions and concepts from argumentation so that formal logical entailment is equivalently captured via the arguments that win between those supporting concluding formulae and arguments supporting contradictory formulae. This allows us to go beyond Classical Logic and smoothly connect it with human reasoning, thus providing a uniform argumentation-based view of both informal and formal logic.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Informal Logic"
        },
        {
            "Title": "Rule extraction in the assessment of alzheimer’s disease based on brain mri imaging",
            "Publication year": 2020,
            "Publication url": "https://www.embec2020.org/wp-content/uploads/2020/11/EMBEC2020_Book_of_Abstracts.pdf#page=310",
            "Abstract": "Motivation and Objective: Although a plethora of machine learning and deep learning methods were used for the assessment of Alzheimer Disease (AD) MRI structural changes, the main drawback of these models is that they are regarded as black-box models and even though the results obtained are highly satisfactory, they lack an explicit declarative knowledge representation, and thus we have difficulty in generating the underlying explanatory imaging structures. The objective of this study was to investigate the usefulness of rule extraction in the assessment of AD using decision trees and random forests algorithms. Material and Methods: The decision trees and random forests algorithms were applied on brain MRI images acquired from normal controls (NC)(N= 114), Mild Cognitive Impairment (MCI)(N= 129) and AD (N= 69). These images were downloaded from the Alzheimer’s Disease Neuroimaging Initiative (ADNI) dataset. All the subjects had a standardized protocol on 1.5-T MRI units (typically 1.25× 1.25× 1.25 mm3 voxels) according to an ADNI protocol. Regions of interest (ROI) segmentation was performed using the Freesurfer v6. 0 software. The following MRI brain features were extracted when a subject was diagnosed from the hippocampus: volume (HipVol) and texture features (Angular Second Moment, Contrast, Correlation, Sum Average, Entropy and Cluster Shade). The KNIME analytics platform was used to compute the decision trees. Results: The overall accuracy achieved for the NC versus AD models was in the region of 90%, whereas the overall accuracy achieved for the NC versus MCI models was in the region of 65 …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentative deliberation for autonomous agents",
            "Publication year": 2002,
            "Publication url": "http://cmna.csc.liv.ac.uk/CMNA2/CMNA2-proceedings.pdf#page=65",
            "Abstract": "This paper presents an argumentation based framework, developed as an extension of an existing framework for nonmonotonic reasoning, in order to support an agent’s self deliberation process. The framework allows the agent to draw conclusions taking into account in a natural way a given preference policy. After developing the argumentation framework we examine two general cases of such argumentative deliberation:(a) under a preference policy that takes into account the roles agents can have within a context pertaining to an environment of interaction and (b) under a preference policy for the current needs of the agent emerging from his profile. In the first case we apply the argumentative deliberation model within a simple agent interaction scenario where each agent’s selfdeliberation determines, according to his own policy, his position at each step of the interaction process. In the second case we apply the framework to model motivational factors that apparently drive human behaviors and therefore can define agent personalities. Agents will thus similarly, as it is claimed in psychological literature for human beings, chose at any moment to pursue, those goals that are most compatible with their current motivations. The proposed argumentation framework allows us to define policy preferences at different levels of deliberation resulting in modular representations of the agent’s knowledge or personality profile. This high degree of modularity gives a simple computational model in which the agent’s deliberation can be naturally implemented.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A-system: Problem solving through abduction",
            "Publication year": 2001,
            "Publication url": "https://lirias.kuleuven.be/1567726?limo=0",
            "Abstract": "This paper presents a new system, called the A-System, performing abductive reasoning within the framework of Abductive Logic Programming. It is based on a hybrid computational model that implements the abductive search in terms of two tightly coupled processes: a reduction process of the high-level logical representation to a lower-level constraint store and a lower-level constraint solving process. A set of initial\" proof of principle\" experiments demonstrate the versatility of the approach stemming from its declarative representation of problems and the good underlying computational behaviour of the system. The approach offers a general methodology of declarative problem solving in AI where an incremental and modular refinement of the high-level representation with extra domain knowledge can improve and scale the computational performance of the framework.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Morgan Kaufmann"
        },
        {
            "Title": "Programming cognitive",
            "Publication year": 2015,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54544",
            "Abstract": "The widespread access to computing-enabled devices and the World Wide Web has, in a sense, liberated the ordinary user from reliance on technically-savvy experts. To complete this emancipation, a new way of interacting with, and controlling the behavior of, computing-enabled devices is needed. This position paper argues for the adoption of cognitive programming as the paradigm for this user-machine interaction, whereby the machine is no longer viewed as a tool at the disposal of the user, but as an assistant capable of being supervised and guided by the user in a natural and continual manner, and able to acquire and employ common sense to help the user in the completion of everyday tasks. We argue that despite the many challenges that the proposed paradigm presents, recent advances in several key areas of Artificial Intelligence, along with lessons learned from work in Psychology, give reasons for optimism.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:XoXfffV-tXoC",
            "Publisher": "CEUR-WS"
        },
        {
            "Title": "On the relation between abduction and inductive learning",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-1733-5_1",
            "Abstract": "This Handbook volume is devoted to abduction and learning as they appear in various subfields of artificial intelligence. Broadly speaking, abduction aims at finding explanations for, or causes of, observed phenomena or facts. Learning occurs when an agent adapts its state or behaviour on the basis of experience. Both processes have a number of common characteristics. They both aim at improving their picture or model of the universe of discourse; they are both hypothetical, in the sense that the results may be wrong; and they can both be seen as reasoning processes, with the observations and the current knowledge of the world as input statements and the learned or abduced hypotheses as output statements.1 In the case of learning from examples, which is the most common form of learning studied in artificial intelligence, this form of reasoning is called induction, and that is the term we will be mostly …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "E-RES: a system for reasoning about actions, events and observations",
            "Publication year": 2000,
            "Publication url": "https://arxiv.org/abs/cs/0003034",
            "Abstract": "E-RES is a system that implements the Language E, a logic for reasoning about narratives of action occurrences and observations. E's semantics is model-theoretic, but this implementation is based on a sound and complete reformulation of E in terms of argumentation, and uses general computational techniques of argumentation frameworks. The system derives sceptical non-monotonic consequences of a given reformulated theory which exactly correspond to consequences entailed by E's model-theory. The computation relies on a complimentary ability of the system to derive credulous non-monotonic consequences together with a set of supporting assumptions which is sufficient for the (credulous) conclusion to hold. E-RES allows theories to contain general action laws, statements about action occurrences, observations and statements of ramifications (or universal laws). It is able to derive consequences both forward and backward in time. This paper gives a short overview of the theoretical basis of E-RES and illustrates its use on a variety of examples. Currently, E-RES is being extended so that the system can be used for planning.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation and Temporal Persistence.",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.295.4044&rep=rep1&type=pdf#page=38",
            "Abstract": "We study how the problem of temporal projection can be formalized in terms of argumentation. In particular, we extend earlier work of translating the language E for Reasoning about Actions and Change into a Logic Programming argumentation framework, by introducing new types of arguments for (i) backward persistence and (ii) persistence from observations. This forms a conservative extension of the language E that gives semantic meaning to domains that cannot be interpreted in the language E.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation-based security for social good",
            "Publication year": 2017,
            "Publication url": "https://www.aaai.org/ocs/index.php/FSS/FSS17/paper/viewPaper/15928",
            "Abstract": "The increase of connectivity and the impact it has in every day life is raising new and existing security problems that are becoming important for social good. We introduce two particular problems: cyber attack attribution and regulatory data sharing. For both problems, decisions about which rules to apply, should be taken under incomplete and context dependent information. The solution we propose is based on argumentation reasoning, that is a well suited technique for implementing decision making mechanisms under conflicting and incomplete information. Our proposal permits us to identify the attacker of a cyber attack and decide the regulation rule that should be used while using and sharing data. We illustrate our solution through concrete examples.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "2 Description of the System",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Nicola-Leone-3/publication/2524959_Optimizing_the_Computation_of_Heuristics_for_Answer_Set_Programming_Systems/links/0fcfd5110ce39cf256000000/Optimizing-the-Computation-of-Heuristics-for-Answer-Set-Programming-Systems.pdf#page=405",
            "Abstract": "The. 4-system is a declarative problem solving environment. It allows us to specify the problem domain in a well structured way in terms of an abductive logic program (ALP). A problem specification consists of two parts of information: definitional knowledge and assertional knowledge or integrity constraints. In the definitional part predicates are defined in a (constraint) logic program by specifying the rules embodying all the information known of these predicates. In a planning domain example the predicate holds_at (P, T) is defined as:* http://www. cs. kuleuven. ac. be/-dtai/kt",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From Natural Language to Argumentation and Cognitive Systems.",
            "Publication year": 2017,
            "Publication url": "http://ceur-ws.org/Vol-2052/paper14.pdf",
            "Abstract": "This paper reports on a program for the development of cognitive systems based on user specifications expressed in Natural Language in the form of high-level guidelines for the desired behaviour of those systems. Language analysis from existing NLP tools is used to generate scenarios based on the users’ description of their preferences in the provision of the service by the system. These scenarios are combined with the SoDA Methodology to develop and generate an argumentation theory that captures the guidelines of operation given in the natural language description of the user. The intended architecture of a fully automated system that generates argumentation based cognitive systems from natural language is presented, together with a first analysis of the challenges posed and evaluation of progress in addressing them. This system is called Gorgias-NL, reflecting the central task of the approach to provide a natural language interface to the Gorgias argumentation system.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:EYYDruWGBe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation and the event calculus",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29414-3_7",
            "Abstract": "We study how the problem of temporal projection can be formalized in terms of argumentation. In particular, we extend earlier work of translating the language  for Reasoning about Actions and Change into a Logic Programming argumentation framework, by introducing new types of arguments for (i) backward persistence and (ii) persistence from observations. The paper discusses how this extended argumentation formulation is close to the original Event Calculus proposed by Kowalski and Sergot in 1986.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Logics in Artificial Intelligence",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-48758-8.pdf",
            "Abstract": "These are the proceedings of the 15th European Conference on Logics in Artificial Intelligence (JELIA 2016), held during November 9–11, 2016, in Larnaca, Cyprus, and organized by the University of Cyprus and the Open University of Cyprus. The European Conference on Logics in Artificial Intelligence (or Journées Européennes sur la Logique en Intelligence Artificielle—JELIA) began back in 1988, as a workshop, in response to the need for a European forum for the discussion of emerging work in this field. Since then, JELIA has been organised biennially, with proceedings published in the Springer series Lecture Notes in Artificial Intelligence. Previous meetings took place in Roscoff, France (1988), Amsterdam, The Netherlands (1990), Berlin, Germany (1992), York, UK (1994), Évora, Portugal (1996), Dagstuhl, Germany (1998), Málaga, Spain (2000), Cosenza, Italy (2002), Lisbon, Portugal (2004), Liverpool …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:fEOibwPWpKIC",
            "Publisher": "Springer International Publishing AG"
        },
        {
            "Title": "Agent planning, negotiation and control of operation",
            "Publication year": 2004,
            "Publication url": "http://www.lia.deis.unibo.it/Staff/PaoloTorroni/Publications/ecai2004.pdf",
            "Abstract": "This paper presents a framework that integrates three aspects of agency: planning, for proactive behaviour, negotiation, for social behaviour and resource achievement, and control of operation, for reconciling rationality with reactivity. Agents are designed and programmed in a computational logic-based language where these aspects are accommodated in a declarative and modular way. We show how this framework can be applied to agent problems requiring negotiation and resource achievement and present some of its formal properties. The framework can be implemented based on a communication platform for agent interaction and on well-established logic programming technologies for agent reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using argumentation logic for firewall policy specification and analysis",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11907466_16",
            "Abstract": "Firewalls are important perimeter security mechanisms that imple-ment an organisation’s network security requirements and can be notoriously difficult to configure correctly. Given their widespread use, it is crucial that network administrators have tools to translate their security requirements into firewall configuration rules and ensure that these rules are consistent with each other. In this paper we propose an approach to firewall policy specification and analysis that uses a formal framework for argumentation based preference reasoning. By allowing administrators to define network abstractions (e.g. subnets, protocols etc) security requirements can be specified in a declarative manner using high-level terms. Also it is possible to specify preferences to express the importance of one requirement over another. The use of a formal framework means that the security requirements defined can be automatically …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Argumentation based modelling of embedded agent dialogues",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11794578_11",
            "Abstract": "This paper presents a novel approach to modelling embedded agent dialogues. It proposes a specific structure for the supporting information accompanying the arguments that agents exchange during a dialogue, it defines formally how this information relates to the agent theory, and assigns to it semantics that is associated to each of the atomic dialogue types of the Walton-Krabbe typology. This allows the formal definition of necessary and sufficient initiation and acceptance conditions of licit dialectical shifts that are necessary for the modelling of embedded agent dialogues.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "New Trends in Constraints: Joint ERCIM/Compulog Net Workshop [the Workshop was the Third in a Row in a Series of Joint Annual Workshops]: Paphos, Cyprus, 25-27.10. 1999: Selected Papers",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15188254174496280598&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:FAceZFleit8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Inference of gene relations from microarray data by abduction",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11546207_33",
            "Abstract": "We describe an application of Abductive Logic Programming (ALP) to the analysis of an important class of DNA microarray experiments. We develop an ALP theory that provides a simple and general model of how gene interactions can cause changes in observable expression levels of genes. Input to the procedure are the observed microarray results; output are hypotheses about possible gene interactions that explain the observed effects. We apply and evaluate our approach on microarray experiments on M. tuberculosis and S. cerevisiae.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Argumentation and propositional logic",
            "Publication year": 2013,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.431.1037&rep=rep1&type=pdf",
            "Abstract": "Argumentation has played a significant role in understanding and unifying under a common framework different forms of defeasible reasoning in Artificial Intelligence (AI). Argumentation is also close to the original inception of logic as a framework for formalizing human debate and dialogue. The purpose of this paper is to draw a formal connection between argumentation and classical reasoning, as supported by Propositional Logic. To this effect, we propose Argumentation Logic and show properties thereof.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PROSOCS: a platform for programming software agents in computational logic",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.6.1885",
            "Abstract": "We present the design and implementation of PROSOCS, a platform supporting the programming of software agents that have a {\\em mind} and a {\\em body}. The mind reasons autonomously and logically via a collection of logic theories with generic functionality, developed using various extensions of logic programming, and controls the overall behaviour of the agent via a {\\em cycle theory} that specifies preferred patterns of operation. The body, on the other hand, provides sensors and effectors for the mind to be able to access and change the environment in which the agent is situated. PROSOCS has been developed using Prolog-to program the functionality of the mind, Java-to program the functionality of the body, and the Peer-to-Peer system JXTA-to provide the functionality required for agent bodies to communicate and interact in an open distributed environment.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Abduction and argumentation for explainable machine learning: a position survey",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2010.12896",
            "Abstract": "This paper presents Abduction and Argumentation as two principled forms for reasoning, and fleshes out the fundamental role that they can play within Machine Learning. It reviews the state-of-the-art work over the past few decades on the link of these two reasoning forms with machine learning work, and from this it elaborates on how the explanation-generating role of Abduction and Argumentation makes them naturally-fitting mechanisms for the development of Explainable Machine Learning and AI systems. Abduction contributes towards this goal by facilitating learning through the transformation, preparation, and homogenization of data. Argumentation, as a conservative extension of classical deductive reasoning, offers a flexible prediction and coverage mechanism for learning -- an associated target language for learned knowledge -- that explicitly acknowledges the need to deal, in the context of learning, with uncertain, incomplete and inconsistent data that are incompatible with any classically-represented logical theory.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:0izLItjtcgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Story Comprehension through Argumentation.",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=T53YBAAAQBAJ&oi=fnd&pg=PA31&dq=info:wiO3M4HywFsJ:scholar.google.com&ots=7-9JUf8uB8&sig=Q18_vJuOOseEmJiWfpQO6oyDROA",
            "Abstract": "This paper presents a novel application of argumentation for automated Story Comprehension (SC). It uses argumentation to develop a computational approach for SC as this is understood and studied in psychology. Argumentation provides uniform solutions to various representational and reasoning problems required for SC such as the frame, ramification, and qualification problems, as well as the problem of contrapositive reasoning with default information. The grounded semantics of argumentation provides a suitable basis for the construction and revision of comprehension models, through the synthesis of the explicit information from the narrative in the text with the implicit (in the reader’s mind) common sense world knowledge pertaining to the topic (s) of the story given in the text. We report on the empirical evaluation of the approach through a prototype system and its ability to capture both the majority and the variability of understanding of stories by human readers. This application of argumentation can provide an important test-bed for the more general development of computational argumentation.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electronic roads in the information society: social, educational and technological aspects",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64602",
            "Abstract": "In this paper we present the major technological challenges to the formation of the Information Society and the ways in which social and pedagogical restrictions can serve to influence the outcome of those challenges from the design phase. We define the notion of electronic information roads and explore the form which these roads can take. Electronic roads can serve to define a new type of social group based on inherently different relationships centered around intellectual and other interests rather than the proximity of physical contact and direct communication. The implementation of electronic roads will require advancements in digital libraries, advanced networks and distributed systems programming.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:N5tVd3kTz84C",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Fred meets tweety",
            "Publication year": 2008,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-58603-891-5-747",
            "Abstract": "We propose a framework that brings together two major forms of default reasoning in Artificial Intelligence: applying default property classification rules in static domains, and default persistence of properties in temporal domains. Particular attention is paid to the central problem of qualification. We illustrate how previous semantics developed independently for the two separate forms of default reasoning naturally lead to the integration that we propose, and how this gives rise to domains where different types of knowledge interact and qualify each other while preserving elaboration tolerance.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:hMod-77fHWUC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Practice and Theory of Automated Timetabling III: Third International Conference, PATAT 2000 Konstanz, Germany, August 16-18, 2000 Selected Papers",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=WMNrCQAAQBAJ&oi=fnd&pg=PR3&dq=info:bICvgsVVYq4J:scholar.google.com&ots=9KWxf_wVRJ&sig=WIseEEtOmoqqNIP2v6ugg0AiUGI",
            "Abstract": "This volume is the third in an ongoing series of books that deal with the state of the art in timetabling research. It contains a selection of the papers presented at the 3rd International Conference on the Practice and Theory of Automated Timetabling (PATAT 2000) held in Constance, Germany, on August 16 {18th, 2000. The conference, once again, brought together researchers, practitioners, and vendors from all over the world working on all aspects of computer-aided timetable generation. The main aim of the PATAT conference series is to serve as an international and inter-disciplinary forum for new timetabling research results and directions. The conference series particularly aims to foster mul-disciplinary timetabling research. Our eld has always attracted scientists from a number of traditional domains including computer science and operational-search and we believe that the cross-fertilisation of ideas from di erent elds and disciplines is a very important factor in the future development of timetabling research. The Constance conference certainly met these aims. As can be seen from the selection of papers in this volume, there was a wide range of interesting approaches and ideas for a variety of timetabling application areas and there were delegates from many di erent disciplines. It is clear that while considerable progress is being made in many areas of timetabling research, there are a number of important issues that researchers still have to face. In a contribution to the previous PATAT conference, George M.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Mojj43d5GZwC",
            "Publisher": "Springer"
        },
        {
            "Title": "Modeling data access legislation with Gorgias",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-60045-1_34",
            "Abstract": "This paper uses argumentation as the basis for modeling and implementing the relevant legislation of an EU country relating to medical data access. Users can consult a web application for determining their allowed level of access to a patient’s medical record and are offered an explanation based on the relevant legislation. The system can also advise a user on what additional information is required for a higher access level. The system is currently in the process of an extensive evaluation through a pilot trial with a special focus group of medical professionals. The development methodology that we have used is generally applicable to any other similar cases of decision making based on legislative regulations. The main advantage of using argumentation is the ability to explain the solutions drawn and the high modularity of software facilitating the extension and adaptation of the system when new …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A-system: Declarative programming with abduction",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45402-0_29",
            "Abstract": "The A-system [4] is a new system for performing abductive reasoning within the framework of Abductive Logic Programming (ALP). The principles behind the system are founded by work on two earlier systems ACLP [2],[3] and SLDNFA(C) [1],[6]. The basic inference mechanism of the system combines abductive logicp rogramming and constraint logicp rogramming. In its computation it reduces the high level specification of the problem and goal at hand to a lower level constraint store. This constraint store is managed by an efficient constraint solver returning information to the abductive reduction process in order to help this in its search for a solution.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Helping forensic analysts to attribute cyber-attacks: an argumentation-based reasoner",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-03098-8_36",
            "Abstract": "Discovering who performed a cyber-attack or from where it originated is essential in order to determine an appropriate response and future risk mitigation measures. In this work, we propose a novel argumentation-based reasoner for analyzing and attributing cyber-attacks that combines both technical and social evidence. Our reasoner helps the digital forensics analyst during the analysis of the forensic evidence by providing to the analyst the possible culprits of the attack, new derived evidence, hints about missing evidence, and insights about other paths of investigation. The proposed reasoner is flexible, deals with conflicting and incomplete evidence, and was tested on real cyber-attacks cases.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Planning with incomplete information",
            "Publication year": 2000,
            "Publication url": "https://arxiv.org/abs/cs/0003049",
            "Abstract": "Planning is a natural domain of application for frameworks of reasoning about actions and change. In this paper we study how one such framework, the Language E, can form the basis for planning under (possibly) incomplete information. We define two types of plans: weak and safe plans, and propose a planner, called the E-Planner, which is often able to extend an initial weak plan into a safe plan even though the (explicit) information available is incomplete, e.g. for cases where the initial state is not completely known. The E-Planner is based upon a reformulation of the Language E in argumentation terms and a natural proof theory resulting from the reformulation. It uses an extension of this proof theory by means of abduction for the generation of plans and adopts argumentation-based techniques for extending weak plans into safe plans. We provide representative examples illustrating the behaviour of the E-Planner, in particular for cases where the status of fluents is incompletely known.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The scientific contribution of marek sergot",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29414-3_2",
            "Abstract": "Marek Sergot’s technical contributions range over different subjects. He has developed a series of novel ideas and formal methods bridging different research domains, such as artificial intelligence, computational logic, philosophical logic, legal theory, artificial intelligence and law, multi-agent systems and bioinformatics.By combining his background in logic and computing with his interest in the law, deontic logic, action, and related areas, and applying to all his capacity to understand the subtleties of social interactions and normative reasoning, Marek has been able to open new directions of research, and has been a reference, an inspiration, and a model for many researchers in the many fields in which he has worked.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Integrating machine learning with symbolic reasoning to build an explainable AI model for stroke prediction",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8941679/",
            "Abstract": "Despite the recent recognition of the value of Artificial Intelligence and Machine Learning in healthcare, barriers to further adoption remain, mainly due to their \"black box\" nature and the algorithm's inability to explain its results. In this paper we present and propose a methodology of applying argumentation on top of machine learning to build explainable AI (XAI) models. We compare our results with Random Forests and an SVM classifier that was considered best for the same dataset in [1].",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:5qfkUJPXOUwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A psychology-inspired approach to automated narrative text comprehension",
            "Publication year": 2014,
            "Publication url": "https://www.aaai.org/ocs/index.php/KR/KR14/paper/viewPaper/8023",
            "Abstract": "We report on an ongoing research program to develop a formal framework for automated narrative text comprehension, bringing together know-how from research in Artificial Intelligence and the Psychology of Reading and Comprehension. It uses argumentation to capture appropriate solutions to the frame, ramification, and qualification problems, and their generalizations as required for text comprehension. In this first part of the study we concentrate on the central problem of integration of the explicit information from the text narrative with the reader's implicit commonsense world knowledge, and the associated tasks of elaboration and revision.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling complex domains of actions and change",
            "Publication year": 2002,
            "Publication url": "https://arxiv.org/abs/cs/0207056",
            "Abstract": "This paper studies the problem of modeling complex domains of actions and change within high-level action description languages. We investigate two main issues of concern: (a) can we represent complex domains that capture together different problems such as ramifications, non-determinism and concurrency of actions, at a high-level, close to the given natural ontology of the problem domain and (b) what features of such a representation can affect, and how, its computational behaviour. The paper describes the main problems faced in this representation task and presents the results of an empirical study, carried out through a series of controlled experiments, to analyze the computational performance of reasoning in these representations. The experiments compare different representations obtained, for example, by changing the basic ontology of the domain or by varying the degree of use of indirect effect laws through domain constraints. This study has helped to expose the main sources of computational difficulty in the reasoning and suggest some methodological guidelines for representing complex domains. Although our work has been carried out within one particular high-level description language, we believe that the results, especially those that relate to the problems of representation, are independent of the specific modeling language.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cognitive Systems: Argument and Cognition.",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Loizos-Michael/publication/316279611_Cognitive_Systems_Argument_and_Cognition/links/58f92e254585152edecb1a5f/Cognitive-Systems-Argument-and-Cognition.pdf",
            "Abstract": "Developing systems that are aware of, and accommodate for, the cognitive capabilities and limitations of human users is emerging as a key characteristic of a new paradigm of cognitive computing in Artificial Intelligence. According to this paradigm, the behavior of such cognitive systems is modeled on the behavior of human personal assistants, able to understand the motivations and personal likings/affinities of their interlocutors, while also being able to explain, and ultimately persuade the latter about, their computed solution (eg, a proposed action) to a problem. This paper examines the link between argument and cognition from the psychological and the computational perspectives, and investigates how the synthesis of work on reasoning and narrative text comprehension from Cognitive Psychology and of work on computational argumentation from AI can offer a scientifically sound and pragmatic basis for building human-aware cognitive systems for everyday tasks. The paper aims, thus, to reveal how argumentation can form the science of common sense thought on which new forms of cognitive systems can be engineered.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "abductive logic programming-Guest editors' introduction",
            "Publication year": 2000,
            "Publication url": "https://lirias.kuleuven.be/retrieve/414287",
            "Abstract": "Declarative problem solving attempts to tackle problems using a high-level representation of the expert knowledge on the problem at hand. In a logical setting such a declarative representation would employ an alphabet of constants, functions and predicate symbols that naturally represent objects, functions and relationships between these objects in the domain of discourse. In a truly declarative representation of the problem, the logic theory contains knowledge known to be true about the problem domain rather than information on how to solve tasks, ie it does not contain definitions of concepts describing problem solving methods. In such a setting, problem solving in many cases consists simply in filling in missing information. This could for example be finding the extension of a predicate or some logical relation between existing predicates.In such cases, therefore, problem solving with a declarative representation consists of extending the existing description (eg, logical theory) of the problem to a new one such that the problem goal is satisfied in this extended description. This process is otherwise known by the name of abduction. In this logical setting, abduction as a problem solving method assumes that the general data structure for the solution to a problem (or solution carrier) is at the predicate level and hence a solution is described in the same terms and level as the problem itself. In artificial intelligence a prototypical problem where abduction is used is that of diagnosis. Here abduction is employed to produce an explanation for the observed, often faulty, behavior of the system in terms of primitive causes according to some theory describing …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier science inc"
        },
        {
            "Title": "ABA: Argumentation based agents",
            "Publication year": 2010,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-60750-606-5-1005",
            "Abstract": "Many works have identified the potential benefits of using argumentation to address a large variety of multiagent problems. In this paper we take this idea one step further and develop the concept of a fully integrated argumentation-based agent architecture that allows us to develop agents that are coherently designed on an underlying argumentation based foundation. Under this architecture, an agent is composed of a collection of modules each of which is equipped with a local argumentation theory. Similarly, the intra-agent control of the agent is governed by local argumentation theories that are sensitive to the current situation of the agent through dynamically enabled feasibility arguments.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:YohjEiUPhakC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Software Anatomy of a KGP Agent.",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.216.2262&rep=rep1&type=pdf",
            "Abstract": "While there is much work in the literature on agent component technologies, there are comparatively few results on the engineering issues arising from the integration of these technologies into a complete and coherent agent architecture. This paper addresses these issues from both implementation and general architectural design point of view. The KGP (Knowledge, Goals and Plan) agent model developed in the EU SOCS project (IST-2001 32530) is used as an example to illustrate these engineering issues.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modular representation of agent interaction rules through argumentation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s10458-005-2176-4",
            "Abstract": "Communication between agents needs to be flexible enough to encompass together a variety of different aspects such as, conformance to society protocols, private tactics of the individual agents, strategies that reflect different classes of agent types (or personal attitudes) and adaptability to the particular external circumstances at the time when the communication takes place. In this paper, we propose an argument-based framework for representing communication theories of agents that can take into account in a uniform way these different aspects. We show how this approach can be used to realize existing types of dialogue strategies and society protocols in a way that facilitates their modular development and extension to make them more flexible in handling different or special circumstances.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "E-RES: Reasoning about Actions, Events and",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=5640209906412520004&hl=en&oi=scholarr",
            "Abstract": "The language for reasoning about actions and change can be translated into an argumentation framework. In this paper, we extend this translation of the basic language and show how it can, together with methods from abduction, form the basis for a principled implementation of E. The extension we have considered concerns the addition of new type of sentences in the language as well as allowing theories where the narrative of events given is incomplete. A system, called E-RES, is developed within the argumentation frame-work of Logic Programming without Negation as Failure (LPwNF). This can support directly a variety of modes of common sense reasoning such as: default persistence in credulous or sceptical form, assimilation of ob-servations and their diagnosis possibly under incomplete information, as well as combinations of these. To improve the efficiency of the system we have considered the integration of a SAT solver within the LPwNF computation, to carry out the of validating the time universal constraints imposed by ramification statements.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:a9-T7VOCCH8C",
            "Publisher": "MIT Press"
        },
        {
            "Title": "Extracting Explainable Assessments of Alzheimer’s disease via Machine Learning on brain MRI imaging data",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9288036/",
            "Abstract": "A plethora of machine learning and deep learning methods are used for the assessment of Alzheimer’s Disease (AD) from brain structural changes as seen in Magnetic Resonance Imaging (MRI) with highly satisfactory results. However, these models are black-box and lack an explicit declarative knowledge representation and thus there is a difficulty in generating the underlying explanatory imaging structures. The objective of this study was to investigate the usefulness of rule extraction in the assessment of AD using decision trees (DT) and random forests (RF) algorithms and integrating the extracted rules within an argumentation-based reasoning framework in order to make the results easy to interpret and explain. The DT and RF algorithms were applied on brain MRI images acquired from normal controls (NC) and AD subjects. The KNIME analytics platform was used to compute the DT and the R project was …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:HtEfBTGE9r8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Flexible agent dialogue strategies and societal communication protocols",
            "Publication year": 2004,
            "Publication url": "http://helios.mi.parisdescartes.fr/~moraitis/webpapers/Moraitis-AAMAS04.pdf",
            "Abstract": "We propose an argumentation-based framework for representing communication theories of agents that can take into account dialogue strategies and society protocols in a way that facilitates their modular development and extension. The proposed framework is flexible in handling context dependent strategies and protocols that can also include special circumstances.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ProLogICA: a practical system for Abductive Logic Programming",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/30838229/10.1.1.230.4166.pdf#page=306",
            "Abstract": "This paper presents a new system called ProLogICA for Abductive Logic Programming (ALP) with Negation as Failure (NAF) and Integrity Constraints (ICs). The system builds upon existing ALP techniques but includes several optimisations and extensions necessitated by recent applications in computational biology, temporal reasoning and machine learning. Unlike some other ALP systems that support non-ground abduction through the integrated use of constraint solving, we adopt a more lightweight approach which avoids this complexity at the expense of only computing ground hypotheses. We argue our approach is suited to a wide class of real-world problems and demonstrate the effectiveness of ProLogICA on three non-trivial applications.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modelling inhibition in metabolic pathways through abduction and induction",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30109-7_23",
            "Abstract": "In this paper, we study how a logical form of scientific modelling that integrates together abduction and induction can be used to understand the functional class of unknown enzymes or inhibitors. We show how we can model, within Abductive Logic Programming (ALP), inhibition in metabolic pathways and use abduction to generate facts about inhibition of enzymes by a particular toxin (e.g. Hydrazine) given the underlying metabolic pathway and observations about the concentration of metabolites. These ground facts, together with biochemical background information, can then be generalised by ILP to generate rules about the inhibition by Hydrazine thus enriching further our model. In particular, using Progol 5.0 where the processes of abduction and inductive generalization are integrated enables us to learn such general rules. Experimental results on modelling in this way the effect of Hydrazine in a real …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Abductive concept learning (vol 18, pg 243, 2000)",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=11306520736848997113&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:1qzjygNMrQYC",
            "Publisher": "SPRINGER-VERLAG"
        },
        {
            "Title": "STAR: A system of argumentation for story comprehension and beyond",
            "Publication year": 2015,
            "Publication url": "https://www.aaai.org/ocs/index.php/SSS/SSS15/paper/viewPaper/10301",
            "Abstract": "This paper presents the STAR system, a system for automated narrative comprehension, developed on top of an argumentation-theoretic formulation of defeasible reasoning, and strongly following guidelines from the psychology of comprehension. We discuss the system's use in psychological experiments on story comprehension, and our plans for its broader use in empirical studies concerning wider issues of commonsense reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Argumentation Logic.",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=T53YBAAAQBAJ&oi=fnd&pg=PA345&dq=info:l9bJE4ZzT8EJ:scholar.google.com&ots=7-9JUf8uBa&sig=n1QQy3LhPlr3-F5CuAb9iKTFeDA",
            "Abstract": "We propose a novel logic-based argumentation framework, called Argumentation Logic (AL), built upon a restriction of classical Propositional Logic (PL) as its underlying logic. This allows us to control the application of Reduction ad Absurdum (RA). In the case of classically consistent theories, AL and PL are equivalent, and RA is recovered through a notion of (non-) acceptability of arguments. In the case of classically inconsistent theories, AL is an extension of PL that does not trivialize, enjoying good logic-based argumentation and general logical properties.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Informatics: 8th Panhellenic Conference on Informatics, PCI 2001. Nicosia, Cyprus, November 8-10, 2001, Revised Selected Papers",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=AlluCQAAQBAJ&oi=fnd&pg=PA19&dq=info:MlKMsrt1xfUJ:scholar.google.com&ots=AE1x_RdSSV&sig=pnbJCO107C3o2HdpeOuc3nCHwNE",
            "Abstract": "This book constitutes the thoroughly refereed post-proceedings of the 8th Panhellenic Conference on Informatics, PCI 2001, held in Nicosia, Cyprus in November 2001. The 31 revised full papers presented were carefully selected and improved during two months of reviewing from 104 conference papers. The papers cover the areas of databases, data mining and intelligent systems, e-learning, human computer interaction, image processing, networks and systems, software and languages, and theoretical computer science.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer"
        },
        {
            "Title": "On argumentation logic and propositional logic",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11225-017-9736-x",
            "Abstract": "This paper studies the relationship between Argumentation Logic (AL), a recently defined logic based on the study of argumentation in AI, and classical Propositional Logic (PL). In particular, it shows that AL and PL are logically equivalent in that they have the same entailment relation from any given classically consistent theory. This equivalence follows from a correspondence between the non-acceptability of (arguments for) sentences in AL and Natural Deduction (ND) proofs of the complement of these sentences. The proof of this equivalence uses a restricted form of ND proofs, where hypotheses in the application of the Reductio of Absurdum inference rule are required to be “relevant” to the absurdity derived in the rule. The paper also discusses how the argumentative re-interpretation of PL could help control the application of ex-falso quodlibet in the presence of inconsistencies.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Modeling the effects of toxins in metabolic networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/iel5/51/4135784/04135799.pdf",
            "Abstract": "Inhibition is important from the therapeutic point of view since many substances designed to be used as drugs against some diseases can eventually have an inhibitory side effect on other enzymes. For example, Paracetamol is an inhibitor COX-3 cyclo-oxygenase [20], preventing the formation of arachidonic acid into prostaglandins, which are involved in pain and fever process. Paracetamol is transformed by the cytochrome P450 dependent enzymes producing N-acetyl-p-benzo-quinone imine (NAPQI), which is normally conjugated with glutathione for renal elimination. In case of overdose the glutathione production pathways are not able to produce enough glutathione and NAPQI, which is very reactive, accumulates in the liver leading to its failure [21]. Hence, any system able to predict the inhibitory effect of substances on the metabolic network would be useful in assessing the potential harmful side effects of drugs.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE; 1999"
        },
        {
            "Title": "Modular-E and the role of elaboration tolerance in solving the qualification problem",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370210000445",
            "Abstract": "We describe M odular-E (ME), a specialized, model-theoretic logic for reasoning about actions. ME is able to represent non-deterministic domains involving concurrency, static laws (constraints), indirect effects (ramifications), and narrative information in the form of action occurrences and observations along a time line. We give formal results which characterize ME's high degree of modularity and elaboration tolerance, and show how these properties help to separate out, and provide principled solutions to, different aspects of the qualification problem. In particular, we identify the endogenous qualification problem as the problem of properly accounting for highly distributed, and potentially conflicting, causal knowledge when reasoning about the effects of actions. We show how a comprehensive solution to the endogenous qualification problem helps simplify the exogenous qualification problem—the problem of …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Generic Programming: International Seminar on Generic Programming Dagstuhl Castle, Germany, April 27-May 1, 1998, Selected Papers",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UqmqCAAAQBAJ&oi=fnd&pg=PA1&dq=info:FDvRyrlnY5UJ:scholar.google.com&ots=g-mKGcJ_Nz&sig=7m-uFywYxatJ6nKydvM1siDuY78",
            "Abstract": "This book constitutes the thoroughly refereed post-proceedings of the International Seminar on Generic Programming held in Dagstuhl Castle, Germany in April/May 1998. The 20 revised full papers were carefully reviewed for inclusion in the book. As the first book entirely devoted to the new paradigm of generic programming, this collection offers topical sections on foundations and methodology comparisons, programming methodology, language design, and applications.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer"
        },
        {
            "Title": "Using argumentation logic for firewall configuration management",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5188808/",
            "Abstract": "Firewalls remain the main perimeter security protection for corporate networks. However, network size and complexity make firewall configuration and maintenance notoriously difficult. Tools are needed to analyse firewall configurations for errors, to verify that they correctly implement security requirements and to generate configurations from higher-level requirements. In this paper we extend our previous work on the use of formal argumentation and preference reasoning for firewall policy analysis and develop means to automatically generate firewall policies from higher-level requirements. This permits both analysis and generation to be done within the same framework, thus accommodating a wide variety of scenarios for authoring and maintaining firewall configurations. We validate our approach by applying it to both examples from the literature and real firewall configurations of moderate size (ap 150 rules).",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "1 Abduction",
            "Publication year": 2017,
            "Publication url": "https://helios.mi.parisdescartes.fr/~moraitis/webpapers/Abduction-ML.pdf",
            "Abstract": "Abduction is a form of reasoning, sometimes described as” deduction in reverse”, whereby given a rule that” A follows from B” and the observed result of” A” we generate as a fact the condition” B” of the rule so that the observation follows deductively from the rule and the fact. We think of” B” as a possible explanation for the observation according to the given theory that contains our rule. This new information and its consequences (or ramifications) according to the given theory can be considered as the result of a (or part of a) learning process based on the given theory and driven by the observations that are explained by abduction. Abduction can be combined with induction in different ways to enhance this learning process.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic Representation and Inference of Regulatory Network Structures",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781119005223.ch1",
            "Abstract": "This chapter presents a general logic‐based framework, called Abductive Regulatory Network Inference (ARNI), where it formalize the network extraction problem as an abductive inference problem. A general logical model is provided that integrates prior knowledge on molecular interactions and other information for capturing signal‐propagation principles and compatibility with experimental data. Solutions to the abductive inference problem define signed‐directed networks that explain how genes are affected during the experiments. Using in‐silico datasets provided by the dialogue for reverse engineering assessments and methods (DREAM) consortium, the chapter demonstrates the improved predictive power and complexity of the inferred network topologies compared with those generated by other non‐symbolic inference approaches. It also explores how the improved expressiveness together with the …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:9vf0nzSNQJEC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Computational logic: Logic programming and beyond",
            "Publication year": 2002,
            "Publication url": "http://www.microlinkcolleges.net/elib/files/undergraduate/Mathematics/Computational%20Logic:%20Logic%20Programming%20and%20Beyond.pdf",
            "Abstract": "Bob Kowalski together with Alain Colmerauer opened up the new field of Logic Programming back in the early 1970s. Since then the field has expanded in various directions and has contributed to the development of many other areas in Computer Science. Logic Programming has helped to place logic firmly as an integral part of the foundations of Computing and Artificial Intelligence. In particular, over the last two decades a new discipline has emerged under the name of Computational Logic which aims to promote logic as a unifying basis for problem solving. This broad role of logic was at the heart of Bob Kowalski‘s work from the very beginning as expounded in his seminal book—Logic for Problem Solving.“He has been instrumental both in shaping this broader scientific field and in setting up the Computational Logic community.This volume commemorates the 60th birthday of Bob Kowalski as one of the founders of and contributors to Computational Logic. It aspires to provide a landmark of the main developments in the field and to chart out its possible future directions. The authors were encouraged to provide a critical view of the main developments of the field together with an outlook on the important emerging problems and the possible contribution of Computational Logic to the future development of its related areas.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Gorgias-B: Argumentation in Practice.",
            "Publication year": 2016,
            "Publication url": "http://www.cs.cf.ac.uk/caf2016/assets/submissions/Spanoudakis.pdf",
            "Abstract": "Gorgias-B is a new tool that supports a methodology for the development of real life applications. It can be used by nonargumentation experts generating and testing automatically the target argumentation theory in Gorgias.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ε-RES: Reasoning about Actions, Events and Observations",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45402-0_19",
            "Abstract": "The language ε for reasoning about actions and change can be translated into an argumentation framework. In this paper, we extend this translation of the basic language and showh ow it can, together with methods from abduction, form the basis for a principled implementation of ε. The extension we have considered concerns the addition of new type of sentences in the language as well as allowing theories where the narrative of events given is incomplete.A system, called ε-RES, is developed within the argumentation framework of Logic Programming without Negation as Failure (LPωNF). This can support directly a variety of modes of common sense reasoning such as: default persistence in credulous or sceptical form, assimilation of observations and their diagnosis possibly under incomplete information, as well as combinations of these. To improve the efficiency of the system we have …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "GORGIAS: Applying argumentation",
            "Publication year": 2019,
            "Publication url": "https://content.iospress.com/articles/argument-and-computation/aac181006",
            "Abstract": "This paper presents the past and present efforts of developing real-life applications of argumentation with the Gorgias preference-based structured argumentation framework of Logic Programming with Priorities. Since its free availability on the web in 2003, the Gorgias system has been used by different groups in a variety of real-life applications in areas such as medical support, network security, business computing, ambient intelligence and, recently, in the area of cognitive personal assistants. We briefly review the Gorgias framework and its past applications and present an emerging general methodological approach for developing “decision making” applications of argumentation. This approach allows the development of real world applications directly from their high-level requirements expressed in the language of the application without the need for familiarity with the underlying technical details of …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:gsN89kCJA0AC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Modular-E: an elaboration tolerant approach to the ramification and qualification problems-preliminary report",
            "Publication year": 2005,
            "Publication url": "https://www.ucl.ac.uk/infostudies/rob-miller/modular-e/cs05long.pdf",
            "Abstract": "We describe Modular-E (ME), a specialized, model-theoretic logic for narrative reasoning about actions, able to represent non-deterministic domains involving concurrency, static laws (constraints) and indirect effects (ramifications). We give formal results which characterize ME’s high degree of modularity and elaboration tolerance, and show how these properties help to separate out, and provide a principled solutions to, the endogenous and exogenous qualification problems. We also show how a notion of (micro) processes can be used to facilitate reasoning at the dual levels of temporal granularity necessary for narrative-based domains involving “instantaneous” series of indirect and knock-on effects.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cultural journeys in the information society",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/880451/",
            "Abstract": "This paper describes the Cultural Journeys in the Information Society (CJIS) project. CJIS project is an INCO project (973324) funded by the ECC and its aims to address the problem of electronic information roads at various levels and to develop a prototype system of such roads. The prototype will concentrate at first on cultural and historical information and the social relevance of such roads in education and training. This paper defines the notion of electronic information roads and explores the technical form which these roads can take. An electronic road is the user's navigation path through a multimedia environment. More precisely, it is a series of links to the system's information units (IU) the user chooses to follow through. IUs are the building blocks of the available information content and consist of the actual data (e.g. segment of video, image, sound or text) with an attached metadata index (semantic or system …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the 6th Annual Workshop of the ERCIM Working Group on Constraints",
            "Publication year": 2001,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00872902/",
            "Abstract": "Archive ouverte HAL - Proceedings of the 6th Annual Workshop of the ERCIM Working \nGroup on Constraints Accéder directement au contenu Accéder directement à la navigation \nToggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL \nAPI Data Documentation Episciences.org Episciences.org Revues Documentation \nSciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de \npublication Par discipline Par année de publication Par structure de recherche Les portails \nde l'archive Recherche Documentation hal-00872902, version 1 Direction d'ouvrage, \nProceedings, Dossier Proceedings of the 6th Annual Workshop of the ERCIM Working \nGroup on Constraints S. Brand 1 KR Apt 1 A. Kakas Eric Monfroy 1 Francesca Rossi 2 \nDétails 1 CWI - Centrum Wiskunde & Informatica 2 Dipartimento di Matematica Pura e \nApplicata [Padova] Type de document : d', , : [cs[…",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Computing Research Repository"
        },
        {
            "Title": "New trends in constraints: joint ERCIM/Compulog net workshop [the workshop was the third in a row in a series of joint annual workshops (1999)",
            "Publication year": 2000,
            "Publication url": "https://www.narcis.nl/publication/RecordID/oai:cwi.nl:10523",
            "Abstract": "New trends in constraints : joint ERCIM/Compulog net workshop [the... (2000) | www.narcis.nl \nKNAW KNAW Narcis Back to search results CWI Publication New trends in constraints : joint \nERCIM/Compulog net workshop [the... (2000) Pagina-navigatie: Main Save publication Save as \nMODS Export to Mendeley Save as EndNote Export to RefWorks Title New trends in constraints \n: joint ERCIM/Compulog net workshop [the workshop was the third in a row in a series of joint \nannual workshops (1999) Series Lecture notes in artificial intelligence Author KR Apt \n(Krzysztof); AC Kakas; EBG Monfroy; F. Rossi Supporting host Networks and Optimization Date \nissued 2000-01-01 Access Closed Access Language English Type Book Publisher Springer \nPublication https://ir.cwi.nl/pub/10523 Persistent Identifier urn:NBN:nl:ui:18-10523 Metadata \nXML Source CWI Go to Website Navigation: Home about narcis login Nederlands Anna …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:P5F9QuxV20EC",
            "Publisher": "Springer"
        },
        {
            "Title": "Frame consistency: computing with causal explanations.",
            "Publication year": 2004,
            "Publication url": "http://groups.di.unipi.it/~braccia/DATA/MY_PAPERS/NMR_04.pdf",
            "Abstract": "This paper presents a computational model for reasoning with causal explanations of observations within the framework of Abductive Event Calculus (AEC). The model is based on abductive reasoning based on the notions of” deserts” and” oases” on the time line. Our work is motivated from the need to recover from the inconsistency that can arise when observations of fluents are added to the narrative of a domain description. We study how such observations can be assimilated via abductive explanations in order to render the domain frame consistent. Typically, such explanations would involve non-ground events whose time of occurrence can only be constraint within some interval. We present some notions of minimal commitment for such explanations and study how we can reason and compute with these explanations once they have been chosen and added to the theory. The computational model proposed can be readily implemented by exploiting, in a modular way, any of the different computational models for Abductive Logic Programming or for Answer Set Programming, augmented, again in a modular way, by suitable forms of temporal constraint solving.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crafting the mind of PROSOCS agents",
            "Publication year": 2006,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08839510500479496",
            "Abstract": " PROSOCS agents are software agents that are built according to the KGP model of agency. KGP is used as a model for the mind of the agent, so that the agent can act autonomously using a collection of logic theories, providing the mind's reasoning functionalities. The behavior of the agent is controlled by a cycle theory that specifies the agent's preferred patterns of operation. The implementation of the mind's generic functionality in PROSOCS is worked out in such a way so it can be instantiated by the platform for different agents across applications. In this context, the development of a concrete example illustrates how an agent developer might program the generic functionality of the mind for a simple application.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Cognitive Programming",
            "Publication year": 2015,
            "Publication url": "https://openreview.net/pdf?id=LLcMY6QcCNB",
            "Abstract": "The widespread access to computing-enabled devices and the World Wide Web has, in a sense, liberated the ordinary user from reliance on technically-savvy experts. To complete this emancipation, a new way of interacting with, and controlling the behavior of, computing-enabled devices is needed. This position paper argues for the adoption of cognitive programming as the paradigm for this user-machine interaction, whereby the machine is no longer viewed as a tool at the disposal of the user, but as an assistant capable of being supervised and guided by the user in a natural and continual manner, and able to acquire and employ common sense to help the user in the completion of everyday tasks. We argue that despite the many challenges that the proposed paradigm presents, recent advances in several key areas of Artificial Intelligence, along with lessons learned from work in Psychology, give reasons for optimism.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ABA: Argumentation based agents",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33152-7_2",
            "Abstract": "Many works have identified the potential benefits of using argumentation in multiagent settings, as a way to implement the capabilities of agents (eg. decision making, communication, negotiation) when confronted with specific multiagent problems. In this paper we take this idea one step further and develop the concept of a fully integrated argumentation-based agent architecture. Under this architecture, an agent is composed of a collection of modules each of which is responsible for a basic capability or reasoning task of the agent. A local argumentation theory in the module gives preferred decision choices for the module’s task in a way that is sensitive to the way the agent is currently situated in its external environment. The inter-module coordination or intra-agent control also relies on a local argumentation theory in each module that defines an internal communication policy between the modules. The …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Knowledge qualification through argumentation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04238-6_19",
            "Abstract": "We propose a framework that brings together two major forms of default reasoning in Artificial Intelligence: default property classification in static domains, and default property persistence in temporal domains. Emphasis in this work is placed on the qualification problem, central when dealing with default reasoning, and in any attempt to integrate different forms of such reasoning.Our framework can be viewed as offering a semantics to two natural problems: (i) that of employing default static knowledge in a temporal setting, and (ii) the dual one of temporally projecting and dynamically updating default static knowledge.The proposed integration is introduced through a series of example domains, and is then formalized through argumentation. The semantics follows a pragmatic approach. At each time-point, an agent predicts the next state of affairs. As long as this is consistent with the available …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computational Logic: Logic Programming and Beyond: Essays in Honour of Robert A. Kowalski, Part II",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=wQVqCQAAQBAJ&oi=fnd&pg=PP3&dq=info:cd5E7E25dHIJ:scholar.google.com&ots=gor38y9NX_&sig=HLoPj9nnOiGrOdxOsr0e9xKuwsA",
            "Abstract": "Alan Robinson This set of essays pays tribute to Bob Kowalski on his 60th birthday, an anniversary which gives his friends and colleagues an excuse to celebrate his career as an original thinker, a charismatic communicator, and a forceful intellectual leader. The logic programming community hereby and herein conveys its respect and thanks to him for his pivotal role in creating and fostering the conceptual paradigm which is its raison d’Œtre. The diversity of interests covered here reflects the variety of Bob’s concerns. Read on. It is an intellectual feast. Before you begin, permit me to send him a brief personal, but public, message: Bob, how right you were, and how wrong I was. I should explain. When Bob arrived in Edinburgh in 1967 resolution was as yet fairly new, having taken several years to become at all widely known. Research groups to investigate various aspects of resolution sprang up at several institutions, the one organized by Bernard Meltzer at Edinburgh University being among the first. For the half-dozen years that Bob was a leading member of Bernard’s group, I was a frequent visitor to it, and I saw a lot of him. We had many discussions about logic, computation, and language.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Computational Logic: Logic Programming and Beyond, Parts 1 and 2",
            "Publication year": 2002,
            "Publication url": "https://ci.nii.ac.jp/naid/10011086177/",
            "Abstract": "CiNii 論文 - Computational Logic : Logic Programming and Beyond, Parts 1 and 2 CiNii 国立\n情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士\n論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 \n著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 \nCiNii窓口業務の再開について Computational Logic : Logic Programming and Beyond, Parts 1 and \n2 KAKAS AC 被引用文献: 1件 著者 KAKAS AC 収録刊行物 Lecture Notes in Artificial Intelligence \nLecture Notes in Artificial Intelligence 2407 and 2408, 2002 被引用文献: 1件中 1-1件を 表示 \n1 Semantics of Normal Goals as Acquisitors Caused by Negation as Failure YAMASAKI \nSusumu IEICE transactions on information and systems 86(6), 993-1000, 2003-06-01 \n参考文献25件 Tweet 各種コード NII論文ID(NAID) 10011086177 資料種別 雑誌論文 CJP/…",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modular-ε: An elaboration tolerant approach to the ramification and qualification problems-Preliminary report",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/54141",
            "Abstract": "We describe Modular-ε (ME), a specialized, model-theoretic logic for narrative reasoning about actions, able to represent non-deterministic domains involving concurrency, static laws (constraints) and indirect effects (ramifications). We give formal results which characterize ME's high degree of modularity and elaboration tolerance, and show how these properties help to separate out, and provide a principled solutions to, the endogenous and exogenous qualification problems. We also show how a notion of (micro) processes can be used to facilitate reasoning at the dual levels of temporal granularity necessary for narrative-based domains involving \"instantaneous\" series of indirect and knock-on effects.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:q3CdL3IzO_QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applications of argumentation: The SoDA methodology",
            "Publication year": 2016,
            "Publication url": "https://ebooks.iospress.nl/pdf/doi/10.3233/978-1-61499-672-9-1722",
            "Abstract": "The area of argumentation is now at a stage that it can benefit from the study of systematic methodologies for building applications of argumentation. Herein, we present such a systematic argumentation software methodology, called SoDA (Software Development for Argumentation), that facilitates the principled modeling of real life problems, and the Gorgias-B tool that supports it. Gorgias-B builds on the system Gorgias that implements the theoretical framework proposed in [1]. SoDA and Gorgias-B built on the successful use of Gorgias during the last ten years by different users for developing real life applications (see http://gorgiasb. tuc. gr/Apps. html).",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:vDijr-p_gm4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Towards multipolicy argumentation",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201032",
            "Abstract": "In this paper, we develop a novel computational argumentation framework for resolving conflicts that arise in a community of multiple stakeholders where each one of them bears a private policy/strategy for shared and inter-related decisions. Decisions taken individually by stakeholders can be contradicting, so there is a need for an arbitration service that will resolve the conflict and conclude on a single decision. Centralized mediation approaches gather all relevant context information and decide on the prevailing decision option as suggested individually by multiple stakeholders. There is high complexity on resolving all possible competing option conflicts among all competing stakeholders, thus, usually centralized solutions do not scale. Our approach avoids this complexity because it is based on defining an arbitration meta-policy for deciding on the priorities among stakeholders, which are few, and not among …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic representation and inference of regulatory networks: uncovering mechanosensitive gene networks",
            "Publication year": 2014,
            "Publication url": "https://www.atherosclerosis-journal.com/article/S0021-9150(14)01517-2/abstract",
            "Abstract": "Methods: We present a novel approach, named ARNI (Adductive Regulatory Network Inference), to logically model and automatically construct through abductive reasoning, regulatory gene networks from experimental data. The model is driven by signal propagation principles and biological information on molecular interactions and gene functions integrated within the inference procedure.Results: Using in-silico datasets provided by the dialogue for reverse engineering assessments and methods (DREAM)) consortium, we demonstrated the improved predictive power and complexity of our inferred network topologies compared with those generated by other non-symbolic inference approaches, showing the suitability of our approach for computing complete realistic networks. We next applied our inference method to study mechanosensitive networks active in endothelial cells and we were able to uncover a KLF2 …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "New Trends in Constraints, Lecture Notes in Artificial Intelligence 1865",
            "Publication year": 2000,
            "Publication url": "https://dare.uva.nl/record/1/177808",
            "Abstract": "New Trends in Constraints, Lecture Notes in Artificial Intelligence 1865 University of Amsterdam \nUniversity of Amsterdam UvA Terms of use Contact UvA-DARE (Digital Academic Repository) \nHome Advanced Search Browse My selection Search UvA-DARE Author KR Apt AC Kakas E. \nMonfroy F. Rossi Year 2000 Title New Trends in Constraints, Lecture Notes in Artificial \nIntelligence 1865 Publisher Berlin: Springer Verlag Document type Book editing Faculty \nInterfacultary Research Institutes Institute Institute for Logic, Language and Computation (ILLC) \nLanguage Undefined/Unknown Persistent Identifier https://hdl.handle.net/11245/1.177808 \nDisclaimer/Complaints regulations If you believe that digital publication of certain material \ninfringes any of your rights or (privacy) interests, please let the Library know, stating your reasons. \nIn case of a legitimate complaint, the Library will make the material inaccessible and/or it . , …",
            "Abstract entirety": 0,
            "Author pub id": "PrU4wEsAAAAJ:M05iB0D1s5AC",
            "Publisher": "BerlinSpringer Verlag"
        },
        {
            "Title": "Non-Monotonic Reasoning and Story Comprehension",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1407.3832",
            "Abstract": "This paper develops a Reasoning about Actions and Change framework integrated with Default Reasoning, suitable as a Knowledge Representation and Reasoning framework for Story Comprehension. The proposed framework, which is guided strongly by existing knowhow from the Psychology of Reading and Comprehension, is based on the theory of argumentation from AI. It uses argumentation to capture appropriate solutions to the frame, ramification and qualification problems and generalizations of these problems required for text comprehension. In this first part of the study the work concentrates on the central problem of integration (or elaboration) of the explicit information from the narrative in the text with the implicit (in the readers mind) common sense world knowledge pertaining to the topic(s) of the story given in the text. We also report on our empirical efforts to gather background common sense world knowledge used by humans when reading a story and to evaluate, through a prototype system, the ability of our approach to capture both the majority and the variability of understanding of a story by the human readers in the experiments.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational Logic Foundations of KGP Agents",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014arXiv1401.3443K/abstract",
            "Abstract": "This paper presents the computational logic foundations of a model of agency called the KGP (Knowledge, Goals and Plan model. This model allows the specification of heterogeneous agents that can interact with each other, and can exhibit both proactive and reactive behaviour allowing them to function in dynamic environments by adjusting their goals and plans when changes happen in such environments. KGP provides a highly modular agent architecture that integrates a collection of reasoning and physical capabilities, synthesised within transitions that update the agents state in response to reasoning, sensing and acting. Transitions are orchestrated by cycle theories that specify the order in which transitions are executed while taking into account the dynamic context and agent preferences, as well as selection operators for providing inputs to transitions.",
            "Abstract entirety": 1,
            "Author pub id": "PrU4wEsAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        }
    ]
}]