[{
    "name": "Athanasios Manikas",
    "romanize name": "Athanasios Manikas",
    "School-Department": "Electrical and Electronic Engineering",
    "University": "Imperial College",
    "Rank": "Professor",
    "Apella_id": 6500,
    "Scholar name": "athanassios manikas",
    "Scholar id": "294QJkAAAAAJ",
    "Affiliation": "Professor of Electrical & Electronic Engineering, Imperial College London",
    "Citedby": 1966,
    "Scholar url": "https://scholar.google.com/citations?user=294QJkAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Existence and uniqueness of hyperhelical array manifold curves",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6497479/",
            "Abstract": "A number of significant problems, arising frequently in array signal processing, have been successfully tackled using methods based on the concept of the array manifold. These approaches take advantage of the inherent information about the array system which is encapsulated in the geometry of the array manifold. Array ambiguities, array uncertainties, array design and performance characterization are just some of the areas that have benefited from this approach. However, the investigation of the geometry of the array manifold itself for most array geometries has been proven to be a complex problem, especially when higher order geometric properties need to be calculated. Nevertheless, special array geometries have been identified, for which the array manifold curve assumes a specific “hyperhelical” shape. This property of the array manifold greatly simplifies its geometric analysis and, consequently, the …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast root-MUSIC for arbitrary arrays",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/document/5399195/",
            "Abstract": "By using the manifold separation techniques, root-MUSIC designed for uniform linear arrays has been extended to arbitrary geometries at the cost of increased computational complexity. A fast algorithm is proposed that exploits the Laurent structure of the polynomial to conduct fast spectral factorisation via the Schur algorithm. Then Arnoldi iteration is employed to compute only a few of the largest eigenvalues. This implies that a large number of the unwanted eigenvalues (or roots) are exempt from the calculation and therefore the computational complexity is reduced significantly.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:aqlVkmm33-oC",
            "Publisher": "IET"
        },
        {
            "Title": "Multi Direction-of-Arrival Tracking using Rigid and Flexible Antenna Arrays",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9463756/",
            "Abstract": "This paper is concerned with the problem of simultaneously tracking the direction-of-arrival (DOA) of far-field multiple moving sources/users in wireless communications using the vector-signal received by an antenna array of N elements. The antenna array can be rigid (fixed array locations) or flexible (time-varying array locations), and it is used in conjunction with a manifold extender, a spatiotemporal state-space model and a Kalman-type tracking approach for non-stationary wireless channels. In particular, two tracking approaches are proposed. The first is based on an arrayed Extended Kalman Filter (arrayed-EKF) algorithm and the second on an arrayed Unscented Kalman Filter (arrayed-UKF) algorithm. Furthermore, if the array is rigid the spatiotemporal state-space model incorporates the DOAs and the angular velocities of the sources, while if it is flexible it also includes the array locations in the set of state …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towed arrays: Channel estimation, tracking and beamforming",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781783262755_0006",
            "Abstract": "Ocean towed arrays find applications in a variety of areas such as defence, oil and gas exploration and geological and marine life studies. The elements/ sensors of the towed arrays are usually hydrophones that receive acoustic energy which characterise the feature or environment being monitored. This acoustic energy may be generated by the feature under study itself (such as a marine animal) or be a reflected signal emitted by an acoustic source (such as a sparker or boomer). The major challenge in towed array processing is the receiver positional uncertainties resulting from the array's flexible structure in combination with the ship's turning maneuvers or water currents. These uncertainties can cause a significant reduction in the performance of the receiver array of hydrophones. Initially, in this chapter, we briefly explore and classify prevalent towed array signal processing techniques developed to address …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Joint transmitter–receiver optimization in multitarget mimo radar",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7979540/",
            "Abstract": "Although a significant attention has been drawn to the concept of multiple-input multiple-output (MIMO) radar and in particular on the transmit beamforming design and multitarget localization, the cooperation between the transmitter (Tx) and the receiver (Rx) has been rarely investigated. In this paper, a novel joint Tx and Rx optimization approach for localization is proposed for MIMO radar, where the transmit beamforming design and the estimation of the target's complex path gain are jointly derived by solving an optimization problem that takes account various target parameters. Moreover, the proposed transmit beamforming design controls the power distribution per individual target. The performance of the proposed method is evaluated using computer simulation studies and compared with techniques which simply combine Tx beamforming design with multitarget localization methods.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Code reuse DS-CDMA-a space time approach",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5745104/",
            "Abstract": "The conventional short code CDMA system has a user capacity that is constrained to the short code spreading gain. In order to overcome this limitation, in this paper we propose a blind asynchronous single-user code reuse direct sequence CDMA array receiver, which is based on a novel multipath joint space-time channel estimation technique. The proposed near-far resistant architecture is appropriate for the uplink. Unlike existing multipath receivers, such as the Space-Time Decorrelating Detector and the Space-Time MMSE Receiver, the proposed receiver is tolerant to incomplete channel estimation. The theoretical framework is supported by computer simulations.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacity loss and antenna array geometry",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7996615/",
            "Abstract": "The impact of antenna array geometry on its ability to mitigate interference, and hence the channel capacity, is a topic that is seldom studied and is crucial for future systems that will employ large arrays. In this paper, for the worst-case scenario where interferers are located spatially close to the desired user, the “capacity loss” is defined and expressed as a function of the array geometry and propagation environment. Based on the analytical results, simulation studies of the capacity loss are presented for different array geometries and various key insights on antenna array design are highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Star Receiver in MIMO-CDMA Multipath Channels",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4217688/",
            "Abstract": "This paper is concerned with the investigation of a MIMO-CDMA communication system which is based on the concept of spatiotemporal array (STAR) manifold for handling multipath fading channels. Firstly a MIMO frequency selective channel is modelled as a function of both transmitter's and receiver's antenna-array manifold vectors. Then, assuming knowledge of the channel parameters of the desired user, two linear receivers are proposed. The proposed receivers are `near-far' resistant and expressed in terms of the STAR manifold vector of the desired user. The investigation is supported by computer simulation studies where the performance of the proposed receivers is compared to the performance of conventional MMSE and RAKE receivers which have been also extended in order to be expressed in terms of the STAR manifold vectors.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DOA and Range Estimation of Multiple Sources under the Wideband Assumption",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7841748/",
            "Abstract": "In this paper, two novel channel parameter estimation algorithms are proposed under the \"wideband assumption\" (WBA), where a wavefront varies significantly when traversing through the sensors of an array. The first is a covariance-based algorithm that utilizes the cross-covariance matrix between two subvectors of the received signal vector and its singular value decomposition to reconstruct the parameter-dependent signal subspace. The second employs the rotation of the array reference point to transform the WBA problem to its \"narrowband assumption\" (NBA) counterpart so that estimation techniques under the NBA are readily applicable. Through computer simulation studies, the two proposed approaches are shown to successfully estimate the channel parameters under the WBA with outstanding accuracy in terms of the root mean squared error.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Geometric properties of 3D array systems",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.523.1591&rep=rep1&type=pdf",
            "Abstract": "The analysis of the performance of antenna array systems has been mainly focused to arrays of elements with linear or planar array geometries. However, in many modern array applications, antenna array geometries may span the full 3D space, and may be used in scenarios where signals are impinging from any direction in that space. In this paper, new theoretical tools for analysing the detection and resolution capabilities of 3D arrays are developed based on the geometric properties of the array manifold. Furthermore, a new type of ambiguities for 3D arrays is presented, complementing the introduction to the analysis of the most general case of array systems.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extended array manifolds: Functions of array manifolds",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5739117/",
            "Abstract": "The response of an array processing system has been widely modelled using the concept of the array manifold. The conventional array manifold is a function of the geometry of the array, the carrier frequency and the directions of arrival (DOAs) of the sources only. However, the emergence of more sophisticated array systems, for instance antenna array communication systems, dictates the extension of this array manifold into various new types of manifolds that incorporate additional system and channel parameters, such as the code-division multiple access (CDMA) (spreading and scrambling) codes, the lack of synchronization, Doppler effects, polarization parameters, subcarriers, etc. This paper is concerned with the definition and geometric investigation of a generic model for these new manifolds that can be expressed as functions of the conventional array manifolds and, hence, are defined herein as extended …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Source localization using sparse large aperture arrays",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6255799/",
            "Abstract": "In this paper, a novel source/target localization approach is proposed using a number of sensors (surrounding or not surrounding one or more sources) to form a sparse large aperture array of known geometry. Under a large array aperture, the array response (manifold vector) obeys a spherical wave rather than a plane wave propagation model. By rotating the array reference point to be at each of the array sensors, a number of covariance matrices are constructed. It is shown that the eigenvalues of these covariance matrices are related to the source location with respect to the array reference point. The proposed approach is robust to channel fading and considers both wideband and narrowband assumptions. The performance of the proposed approach is evaluated via simulations as a function of array geometry, number of snapshots ( L ) and signal to noise ratio (SNR) and is shown to exceed existing techniques.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direction-of-Arrival Tracking of Multiple Fast-Moving Sources in Antenna Array based Access Networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9148870/",
            "Abstract": "This paper is concerned with the problem of simultaneously tracking the direction-of-arrival (DOA) of multiple fast moving sources using the vector-signal received by a small aperture antenna array of N elements. The antenna array may be located at the Node-B, eNode-B or gNode-B of an access network and is used in conjunction with a novel trajectory tracking algorithm. The proposed algorithm incorporates a “manifold extender” together with a state space model and an arrayed extended Kalman filter (EKF). These provide a spatiotemporal tracking approach of the DOAs and angular velocities of multiple fast moving sources snapshot-by-snapshot. Furthermore, two different manifold extenders are employed in the proposed algorithm and their performance is evaluated using computer simulation studies and is compared with the case where the proposed algorithm is implemented without a “manifold extender”.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital Beamforming for Synthetic Aperture Radar",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781783262755_0003",
            "Abstract": "Synthetic aperture radar (SAR) has all weather capabilities, which gives it an advantage over optical instruments for remote sensing during the night or cloudy weather. SAR also has the ability to detect targets hidden below foliage. An effectively long aperture, which would otherwise be impractical to build, is created due to SAR's method of moving along a flight path during data collection. This allows the creation of higher resolution images when compared to real aperture radar (RAR), where the radar system is stationary during data collection. Therefore, SAR has been used in many remote sensing applications including geographic mapping, ocean surveillance and ground moving target indication (GMTI), to name but a few. However, with conventional SAR data collection using a single transmitter and receiver beam there is a trade-off between resolution and the dimensions of the imaged area, in particular …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Near-far field multipath spatial-temporal localisation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7962797/",
            "Abstract": "In this paper, a passive array processing algorithm is proposed for localising the near-far field multipaths of the desired signal in the presence of co-channel interference. By expressing the unknown path delay as a function of the path's range, the proposed spatiotemporal localisation algorithm estimates the locations of all the multipath reflectors of the desired signal source using a subspace-type cost function. The performance of the proposed algorithm is evaluated through computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diversely polarised arrays in DS-CDMA: A space-time channel estimation approach",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5745184/",
            "Abstract": "In this paper we propose the use of diversely polarised arrays in joint space-time channel estimation for DS-CDMA systems. The purpose is to utilise the polarisation information inherent in the received signal to improve the accuracy and resolution of the estimation and enhance its detection capability. To alleviate the need for searching in the 2D polarisation space, a computationally efficient subspace-based algorithm is proposed which provides a joint space-time estimate of the desired user in an asynchronous multipath environment. Its polarisation parameters, if required, can also be estimated analytically.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental comparison of localisation techniques in the presence of array uncertainties",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7928257/",
            "Abstract": "In this paper, the performance of two source localization (range and azimuth) approaches are studied experimentally using multiple off-the-shelf Universal Software Radio Peripheral (USRP) hardware boards forming a circular antenna array of nine elements operating in the presence of a source located in the near-far field of the array. In particular, the effects of gain and phase array uncertainties on these localization approaches are presented and their experimental accuracy is examined in terms of both range and direction RMSE.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diversity reception for OFDM systems using antenna arrays",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1613651/",
            "Abstract": "Orthogonal frequency division multiplexing (OFDM) is a multicarrier modulation scheme that achieves high spectral efficiency by using minimally densely spaced orthogonal subcarriers without increasing the transmitter and receiver complexities. Antenna arrays are a powerful means to exploit the spatial domain to provide an extra layer of co-channel interference cancellation and new ways of handling unwanted channel effects for more efficient utilization of spectrum and space at any time. An array-OFDM system integrates OFDM and antenna array technology to harness the spatial signatures of received signals. This provides space diversity in multipath channels, making it possible to realize high transmission rates envisioned for the next generation wireless communications. In this paper, a diversity reception algorithm is proposed for post-FFT OFDM systems employing an antenna array at the receiver …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Array of sensors: A spatiotemporal-state-space model for target trajectory tracking",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7569756/",
            "Abstract": "In this paper, with the objective of tracking the trajectory of multiple mobile targets, a novel spatiotemporal-state-space model is introduced for an array of sensors distributed in space. Under the wideband assumption, the proposed model incorporates the array geometry in conjunction with crucial target parameters namely (i) ranges, (ii) directions, (iii) velocities and (iv) associated Doppler effects. Computer simulation studies show some representative examples where the proposed model is utilised to track the locations of sources in space with a very high accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diffused Multipath Vector Channels for Arrayed MC-CDMA Communication Systems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4362278/",
            "Abstract": "Multi-carrier code division multiple access (MC-CDMA) is a modulation scheme that combines the advantages of OFDM and CDMA to provide robustness against frequency selectivity in wireless channels. Arrayed MC-CDMA systems combine MC-CDMA and antenna array technology to harness the spatial and temporal 'signatures' of received signals, thus making it possible to realize high transmission rates envisioned for next generation wireless communications. Localized scattering, which occurs for each multipath, motivates the frequency selective wireless channel to be modelled as a diffused vector channel. In this paper, space-time diffused vector channels for arrayed MC-CDMA systems are modelled and analyzed. Simulation studies show that the use of this diffused channel modelling in arrayed MC-CDMA receivers yields better bit error rate (BER) performance than receivers that ignore the presence of …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An IDFT-based root-MUSIC for arbitrary arrays",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5496270/",
            "Abstract": "Root-MUSIC algorithm, designed for uniform linear arrays, has been extended to arrays of arbitrary geometry by means of manifold separation techniques but at the cost of increased computational complexity. In this paper, an inverse discrete Fourier transform (IDFT)-based method is proposed in which polynomial rooting is avoided. The proposed method asymptotically exhibits the same performance as the extended root-MUSIC, implying that it outperforms the conventional MUSIC in terms of resolution ability. A remarkable property of this algorithm is that it has a computationally efficient implementation because a finite number of IDFT operations can run in parallel.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Superresolution multitarget parameter estimation in MIMO radar",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6392934/",
            "Abstract": "This paper is concerned with a multiple-input-multiple-output (MIMO) radar operating in an environment with two or more closely located targets. In this scenario, mutual target interference is a serious problem for multitarget parameter estimation, reducing the performance of existing methods such as least squares, Capon, and amplitude and phase estimation. In contrast to previous methods where the overall effect of mutual target interference is treated as “noise,” in this paper, two methods for suppressing this interference are proposed. The first is based on a constrained optimization problem that provides an iterative method. The second involves a novel nonlinear optimization based on a cost function of targets' directions which is solved using the biogeography-based-optimization algorithm. The performances of both the proposed approaches are evaluated via computer simulation studies and shown to …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multisource Spatiotemporal Tracking Using Sparse Large Aperture Arrays",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7849234/",
            "Abstract": "In this paper, a multisource tracking technique is proposed using a sparse large aperture array of passive sensors of known geometry. First, a novel spherical-spatiotemporal-state-space model is introduced incorporating target ranges, directions, and Doppler effects in conjunction with the array geometry. Subsequently, this array of sensors is integrated with an extended Kalman filter (EKF), defined as the arrayed EKF, to track the trajectory of multiple mobile sources. In addition, a recursive lower bound on the performance of the proposed tracking method is obtained based on the posterior Cramer-Rao bound. Computer simulation studies show that the proposed approach can track the locations of sources, as these move in space, with a very high accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatio-temporal Array (STAR) DS-CDMA systems: Localized scattering channel estimation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1188109/",
            "Abstract": "This paper is concerned with the problem of channel estimation for asynchronous DS-CDMA systems in the presence of local scattering of the multipaths. Based on a first order Taylor series expansion, the manifold vector associated with a locally scattered multipath is formulated and a new channel estimation algorithm is proposed. The proposed algorithm hinges on the spatio-temporal array (STAR) manifold concept and is a joint spread angle and delay estimator (SADE) of the locally scattered multipaths of the desired user. Simulation studies indicate that the proposed technique estimates the mean direction-of-arrival more closely than methods that ignore local scattering effects.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Arrayed MIMO radar: Multi-target parameter estimation for beamforming",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781783262755_0004",
            "Abstract": "Arrayed multiple-input multiple-output (MIMO) radar [1,2] offers enhanced resolution and improved estimation accuracy compared to conventional radar. Consequently, significant research attention has been drawn to the field of MIMO radar. An arrayed MIMO radar is a radar system which employs two antenna arrays: one to transmit and one to receive. For each of these arrays, the antenna elements are distributed in three-dimensional real space about a common reference point. This chapter is concerned with the task of exploiting the arrays' geometries (antenna locations) in both the transmitter and receiver in order to detect, resolve and estimate the various parameters of multiple radar targets. Thus, amongst various conventional and nonconventional MIMO radar approaches presented in this chapter, an alternative representation of the arrayed MIMO radar system — namely, its equivalent virtual SIMO (single …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatiotemporal-MIMO channel estimator and beamformer for 5G",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7571183/",
            "Abstract": "With requirements of spiraling data rates and limited spectrum availability, there is an increased interest in mm-wave beamformer-based communications for 5G. For upcoming cellular networks, the critical point is to exploit the increased number of employable antennas at both Tx and Rx to: 1) combat increased path loss; 2) tackle higher interference due to higher user density; and 3) handle multipath effects in frequency selective channels. Toward this, a multi-beam spatiotemporal superresolution beamforming framework is proposed in this paper as a promising candidate to design beampatterns that mitigate/suppress co-channel interference and deliver massive gain in the desired directions. Initially, channel and signal models suitable for the mm-wave MIMO system are presented using the manifold vectors of both Tx and Rx antenna arrays. Based on these models, a novel subspace-based channel estimator is …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Array formation in arrayed wireless sensor networks",
            "Publication year": 2006,
            "Publication url": "https://skynet.ee.ic.ac.uk/papers/2005_J_HERMIS_Array_Formation_In_AWSN.pdf",
            "Abstract": "An Arrayed Wireless Sensor Network (AWSN) comprises of a large number of small self-contained packages (nodes) that contain a bank of various environmental sensors, a power and a communications module equipped with a microstrip antenna array and an array processor. Although nodes have fixed positions, they may group together under specific rules to form dynamic entities, called wireless arrays, that operate as integral communication modules. Wireless arrays are the main building blocks of the AWSN and network performance highly depends upon their capability to suppress interference, localise nodes and act as message forwarding agents. This paper is concerned with the selection of nodes for the formation of wireless arrays. This selection of nodes, determines the wireless array geometry which greatly affects the wireless array capabillities and consequently the overall performance of the AWSN.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Positioning architectures in wireless networks",
            "Publication year": 2006,
            "Publication url": "https://skynet.ee.ic.ac.uk/notes2009/MSc%20C5%20Arch%202005%20-%20Positioning%20Architectures%20in%20Wireless%20Networks.pdf",
            "Abstract": "Locating and Tracking energy emitters or reflecting sources with emphasis given to applications in the area of wireless communications.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Beamforming: Sensor Signal Processing for Defence Applications",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zM63CgAAQBAJ&oi=fnd&pg=PR7&dq=info:M6wRouvkhB0J:scholar.google.com&ots=CIwwl3L7GS&sig=J3J90w-8Y2YjCGZakwoK1Hnf3BQ",
            "Abstract": "Beamforming: Sensor Signal Processing for Defence Applications presents a range of important research contributions concerned with sensor array signal processing and, in particular, with the superresolution beamformers fundamental to many civilian and defence applications. Both space and space-time (STAP) beamforming algorithms and their application to radar systems are considered with emphasis given to'look-down'airborne radars, synthetic aperture radar (SAR), arrayed MIMO radar and a number of common wake-wave detection algorithms for two-dimensional SAR imagery. Furthermore, ocean towed arrays, which find applications in a variety of areas such as defence, oil and gas exploration, and geological and marine life studies, are also considered paying particular attention to receiver positional uncertainties resulting from the array's flexible structure. Array geometrical and electrical uncertainties, design of auto-calibration algorithms, beamforming'pointing'error uncertainties and robustification issues are also presented. This book is self-contained and unified in its presentation, and comprehensively covers some of the classic and fundamental models of beamforming for sensor signal processing. It is suitable as an advanced textbook for graduate students and researchers in the area of signal processing, as well as a reference book for engineers in the defence industry.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:t6usbXjVLHcC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "The figure of merit 'C' for comparing superresolution direction-finding algorithms",
            "Publication year": 2010,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/ic.2010.0239",
            "Abstract": "In this paper, the parameter C is introduced as a figure of merit for comparing the performances of practical direction-finding (DF) algorithms in terms of their superresolution capabilities. C takes values between 0 and 1, with higher values indicating better resolving capability and C = 1 denotes an algorithm with the theoretically ideal resolution performance. Analytical expressions for C can be derived for a number of DF algorithms. In this paper, three such expressions are derived for MUSIC, optimal' Beamspace MUSIC and Minimum Norm. It is found that optimal beamspace MUSIC yields the smallest resolution separation, which can approach the ideal when incident signals have equal powers. (5 pages)",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:TQgYirikUcIC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Space-doppler parameter estimation for space-time-doppler reception in time-varying multipath ds-cdma systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028334/",
            "Abstract": "We propose a joint space-Doppler parameter estimation algorithm for fast-fading multipath DS-CDMA communication systems. The Doppler shifts induced by the relative motion between the transmitter and the receiver, together with the associated direction-of-arrival (DOA), are jointly estimated by a semi-blind subspace-type method. The Doppler effect is successfully eliminated by a space-time-Doppler receiver after the directional and Doppler parameters are estimated.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Array uncertainties and auto-calibration",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781783262755_0007",
            "Abstract": "In this chapter, an array auto-calibration approach is described which is capable of estimating geometrical (array shape), gain and phase uncertainties associated with an array of sensors. As opposed to other data-based array calibration techniques in the literature, no transmitting sources are required (either pilot sources or sources of opportunity). Instead, elements in the array operate as transceivers which are utilised to auto-calibrate the array. Hence, unlike in the case of pilot calibration approaches, all elements are at unknown locations. Under this scenario, the distance of the transmitting elements from the array is small compared to the aperture of the Rx-array formed by the remaining elements. Hence, the standard plane wave propagation assumption used in array processing is no longer valid and a spherical wave propagation model should be considered. Monte-Carlo simulations are used to analyse the …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparative study of 2D grid antenna array geometries for massive array systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7414059/",
            "Abstract": "In upcoming trends of wireless communications, such as massive MIMO, the number of antennas at the transmitter(TX) and receiver (RX) are expected to increase dramatically, aiming to provide a substantial improvement in system performance and spectral efficiency. However, an increase in the number of antennas also results in an increase in hardware, computational complexity and energy dissipation of the MIMO system. Therefore, the antenna array geometry plays a crucial role in the overall system performance. This paper is concerned with planar antenna array geometries with emphasis given to the family of 2D \"grid\" arrays and presents an insight into the relation between the array geometry and various performance metrics, such as detection, resolution and data-rate maximization, that may be used in different applications.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Global calibration of CDMA-based arrays",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071518/",
            "Abstract": "In this paper, a calibration approach capable of handling simultaneously location, gain and phase uncertainties, as well as mutual coupling (global calibration), is proposed for asynchronous CDMA-based antenna arrays in the presence of multipath. The manifold vector is modelled based on a first order Taylor series expansion, to encompass the errors. The calibration technique involves a hybrid combination of pilot calibration and self calibration techniques, and requires the code sequence of a reference user. This method employs the concept of the STAR (Spatio-Temporal ARray) manifold vector and a subspace type preprocessor to provide estimates of the path delays and directions, as well as estimating the array manifold, location, gain and phase errors taking mutual coupling effects into consideration.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint space-time transmitter-receiver beamforming",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5683732/",
            "Abstract": "Joint transmitter-receiver beamforming is a powerful approach that has been considered for the downlink DS-CDMA system over frequency-selective channels and much recent effort is devoted to its integration with spatio-temporal (ST) processing. In the DS-CDMA system, the ST processing has been employed at the receiver, however, with the transmitter based on spatial-only processing (S-ST). In this paper antenna arrays with ST integration are employed at both transmitter and receiver (ST-ST) aiming at further improving the performance over S-ST in frequency-selective channels. The joint optimization problem is solved by an iterative method and a closed-form method respectively. The mean square error (MSE) of ST-ST and S-ST is derived using the closed-form solution which can be considered as an upper bound when the system is lightly loaded.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless array based sensor relocation in mobile sensor networks",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1582379.1582560",
            "Abstract": "Mobility enables numerous functionalities in wireless sensor networks (WSN's) including coverage optimization, network self-healing and adaptive resource management. In this paper, a novel wireless array-based sensor relocation (WA-SR) algorithm is proposed based on the cooperative sensing model, WA-CSM, presented in [4]. The WA-CSM model improves the network sensing coverage by utilizing closely located sensors upon deployment to form wireless arrays (WA's). A Local Detection Diagram (LDD) is introduced as an important tool for local coverage hole detection. To increase the coverage, WA's relocate the redundant nodes located within their coverage to suitable positions, while other sensors autonomously determine their own moving strategies. The proposed algorithm runs iteratively and in a distributed fashion. It terminates naturally when the optimum coverage is achieved within the maximum …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A polynomial rooting approach to super-resolution array design",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/845915/",
            "Abstract": "This paper is concerned with the design of super-resolution direction finding (DF) arrays that satisfy prespecified performance levels, such as detection-resolution thresholds and Cramer-Rao bounds on error variance. The sensor placement problem is formulated in the framework of subspace-based DF techniques and a novel polynomial rooting approach to the design problem, based on the new concept of the \"sensor locator polynomial (SLP),\" is proposed. This polynomial is constructed using the prespecified performance levels, and its roots yield the sensor locations of the desired array. The distinguishing feature of the proposed technique is that it hinges on the properties of the array manifold, which plays a central role in all subspace-based DF algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust space-time multi-user receiver for asynchronous DS-CDMA",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/891954/",
            "Abstract": "An integrated space-time multi-user array receiver for asynchronous direct sequence code division multiple access (DS-CDMA) is proposed that is robust to errors in the estimation of multipath arrival times. The method presented here is valid for more than one path per user and is also near-far resistant in the presence of such timing uncertainty. This is unlike the decorrelating and minimum mean square error (MMSE) detectors that are only near-far resistant in the absence of timing errors.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Crossed-dipole arrays for asynchronous DS-CDMA systems",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1268308/",
            "Abstract": "In this paper, the use of a crossed-dipole array is proposed in joint space-time channel estimation for asynchronous multipath direct sequence code division multiple access (DS-CDMA) systems. The polarization diversity offered by such an array, unlike linearly polarized arrays, is able to detect and estimate any arbitrary completely polarized signal path. By utilizing the polarization information inherent in the received signal to construct the polar-spatio-temporal array (polar-STAR) manifold vector, the accuracy and resolution of the polar-STAR parameters' estimation are significantly improved, and its signal detection capability is enhanced. To alleviate the need for a multidimensional search in the polarization space, a computationally efficient joint polarization-angle-delay channel parameter estimation algorithm is proposed for a \"desired user\" that operates in an asynchronous multiuser and multipath environment …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polarisation-angle-delay estimation using crossed-dipole array for DS-CDMA systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027883/",
            "Abstract": "In this paper the use of a crossed-dipole array is proposed in joint space-time channel estimation for asynchronous multipath DS-CDMA systems. The polarisation diversity offered by such an array, unlike linearly polarised arrays, is shown to provide a better and more consistent estimation which is less sensitive to the signal polarisation. By utilising the polarisation information inherent in the received signal, the accuracy and resolution of the estimation is also significantly improved. To avoid a multidimensional search into the polarisation space, a computationally efficient polarisation-angle-delay estimation (PADE) algorithm is also presented, where the polarisation parameters, if required, can be obtained by solving a set of analytical equations.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A space-time channel estimator and single-user receiver for code-reuse DS-CDMA systems",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1145705/",
            "Abstract": "A blind asynchronous single-user code-reuse direct sequence code division multiple access (CDMA) array receiver is proposed for the uplink. By assigning each short PN-code more than once, code reuse allows the number of active users to be increased beyond the spreading gain. The proposed receiver is based on a blind single-code multipath joint space-time channel estimation technique that utilizes the concept of the spatio-temporal array manifold, in conjunction with a novel preprocessor, to deal with the multipath problem. From the estimated space-time channel parameters of a particular active code, the subset of parameters of a specific co-code user is then identified, and a single-user receiving weight vector is finally formed. The proposed approach is a subspace type method, and therefore, it is \"near-far\" resistant. Furthermore, in contrast to existing receivers such as the space-time decorrelating detector …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Superresolution Wide Null Beamformer for Undersampled Signal Reconstruction in SIMO SAR.",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7181634/",
            "Abstract": "With single-input single-output (SISO) SAR systems, employing a single transmitter and receiver beam, there exists a high resolution, wide swath contradiction. However, by using multiple receiver beams and employing array processing techniques, this contradiction can be overcome, allowing greater flexibility and a wider range of application requirements to be met. In this paper the use of single-input multiple-output (SIMO) SAR systems for overcoming this contradiction is of interest, and a novel beamformer is proposed for processing in the cross-range direction. In order to fully describe the system, the array manifold vector is utilized, which is a key concept in the design of the beamformer. In particular, this beamformer is a superresolution beamformer capable of forming wide nulls using subspace based approaches and allows the suppression of ambiguities in multiple sets of received undersampled SAR data in …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Space-time block coding based mimo array receiver",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1407268/",
            "Abstract": "In this paper, a blind near-far resistant MIMO array receiver incorporated with either space-time transmit diversity (STTD) or space-time spreading (STS) schemes is proposed for time-varying multipath DS-CDMA systems, Many reported research works on MIMO, including the conventional STTD and STS schemes, often assume that the channel is flat fading and is known. However, the MIMO array receiver proposed in this study is based on a subspace-type joint space-time estimation algorithm, which does not need any power control or channel information. Furthermore, it is robust to channel estimation errors in the event of any unidentified or erroneous channel parameter. The effectiveness of the proposed approach is supported by representative examples and computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A wireless array based cooperative sensing model in sensor networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4697803/",
            "Abstract": "In wireless sensor network (WSN), the performance and effectiveness of the network is highly dependant on its geographical coverage. However, in many applications the actual coverage cannot be guaranteed to meet the requirement due to the random sensor deployment. While existing methods tend to exploit mobility to relocate all the sensors to be evenly distributed, a wireless array-based cooperative sensing model (WA-CSM) that makes use of a wireless group of densely located nodes, namely wireless array (WA), is proposed in this paper to improve the initial network coverage. A distributed WA formation algorithm is derived to group together the overly clustered nodes to jointly sense the environment without moving them apart. In addition, the nodes that are located within the cooperative sensing range of other WA's are identified as redundant nodes. As a result, a better coverage can be achieved with less …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The effect of uncertainties on the performance of array systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394039/",
            "Abstract": "This paper aims to investigate the effects of uncertainties present in an antenna array system by employing elements of differential geometry based on the concept of the array manifold. This study is mainly focused on uncertainties on the positions of the antenna array elements, which also reflect uncertainties in the carrier frequency. Such uncertainties are inherent in the manufacturing process of antenna arrays and can greatly impact on system performance. Their effects on various performance measures such as the accuracy of channel parameter estimation and signal-to-noise ratio (SNR) at the output of a number of receivers that employ antenna arrays is studied. The results of the study are particularly applicable to array design and calibration methods.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind asynchronous MIMO CDMA receiver with transmit diversity",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/document/1715202/",
            "Abstract": "A blind near-far resistant MIMO array receiver, incorporating the concept of orthogonal transmit diversity, is proposed for asynchronous multipath DS-CDMA systems. With the integration of the antenna-array technology, the receiver does not need any power control and requires only knowledge of the desired user's spreading code sequence",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IET"
        },
        {
            "Title": "Digitising the wireless MRI link: a space-time CDMA approach",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/974044/",
            "Abstract": "In this paper an approach for digitising the wireless MRI unit to data processing unit link is presented. The proposed method is able to support multiple medical imaging devices functioning in a low signal to noise ratio environment. The architecture utilises the short code CDMA signalling format since this offers a number of advantages, and a novel joint-space time remote array receiver. The receiver output can be used to make reliable data symbol decisions even in conditions of low input Signal to Noise ratio. The theoretical framework is supported by computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Direction-of-departure estimation using cooperative beamforming",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5624303/",
            "Abstract": "In this paper a novel approach is proposed for estimating the direction-of-departure (DOD) in a frequency-selective multipath channel, where both the transmitter (Tx) and receiver (Rx) employ an antenna array. In particular, the proposed approach exploits the cooperation between the Tx and Rx beamformers, such that the Tx beamformer rotates its mainlobe in a synchronized manner that is known to the Rx. This operation allows the DODs of the multiple paths to be estimated at the Rx by making a set of power measurements. The performance of the proposed approach is investigated using computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind single-user array receiver for MAI cancellation in multipath fading DS-CDMA channels",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075445/",
            "Abstract": "In this paper, a blind subspace-type single-user array direct-sequence code division multiple access (DS-CDMA) receiver is proposed based on a new joint space-time channel estimation technique for frequency-selective channels. In the proposed approach, the spatio-temporal multipath channel parameters associated with the desired user are jointly estimated with the number of identifiable paths not limited by the number of antennas. Then these estimated parameters are employed to efficiently combine the desired multipath rays while, at the same time, (asymptotically) complete MAI cancellation is achieved.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint transmitter-receiver beamforming in downlink cyclic prefix-free spatio-temporal MC-CDMA",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5199126/",
            "Abstract": "The problem of jointly optimizing the transmitter and receiver beamforming weights in the downlink of a cyclic prefix-free MC-CDMA system over multipath fading channels is addressed in this paper. Both the base station and user terminals are equipped with antenna arrays to leverage on the spatial information provided by the antenna arrays. The preceding and equalization matrices are designed with the aim of minimizing the overall mean-squared-error (MSE) of the system subject to a power constraint for each transmitter antenna, which has the additional benefit of reducing the probability of clipping of the transmitted signals from the transmitter. This is highly favorable for a MC-CDMA system due to the multi- carrier modulation involved. The performance of the optimization process is supported by simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "STAR channel estimation in DS-CDMA communication systems",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/document/1335440/",
            "Abstract": "A novel blind DS-CDMA array channel estimator is presented which is capable of handling severe frequency-selective channels, where the multipath delay spread can be comparable with the data symbol period. By employing the concept of the spatiotemporal array (STAR) manifold, a subspace-type estimation algorithm is proposed, in conjunction with an one-dimensional temporal smoothing procedure, to jointly estimate the spatiotemporal multipath-channel parameters associated with the desired user. Close examination of the proposed STAR channel estimator reveals that it is 'near-far' resistant and the total number of signal paths can be more than the number of antenna elements. The effectiveness of the proposed approach is supported by computer simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IET"
        },
        {
            "Title": "OFDM-CDMA array system for interference cancellation",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/A-Manikas/publication/242674565_OFDM-CDMA_array_system_for_interference_cancellation/links/00b7d52e95f9b9b414000000/OFDM-CDMA-array-system-for-interference-cancellation.pdf",
            "Abstract": "In this paper, an arrayed OFDM-CDMA system is modelled and studied in a frequency-selective environment. A blind near-far resistent channel estimator is devised which provides the joint angle, delay, and channel frequency offset (CFO) as well as the complex fading coefficients estimation. With the estimator integrated as the front-end, a subspace-based zero forcing receiver is used for frequency offset compensation and interference cancellation. The effectiveness of the proposed approach is demonstrated even in the presence of strong interferences by computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ambiguities in statistical signal processing",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075436/",
            "Abstract": "This paper is concerned with the ambiguity problem which is of major concern in a number of statistical signal processing applications. Initially, the concept of ‘hyperhelical’ parameterisation is presented and then a compact algorithm for the classification and calculation of ambiguities is proposed, in conjunction with two application areas: the array processing and the harmonic retrieval problem. Furthermore, it is demonstrated that in the harmonic retrieval problem, under certain conditions, the sampling rate can even be lower than the Nyquist rate.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint multipath delay and direction tracking for CDMA array systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1002687/",
            "Abstract": "A novel H /sup /spl infin// type approach is proposed for tracking the time varying multipath uplink spatio-temporal channel of an asynchronous direct sequence CDMA array system. The proposed approach utilises a bank of novel spatio-temporal preprocessors to deal with the problem of coherent multipath. The signal vector at the output of each of these pre-processors is partitioned into two sub vector signals which provide the starting point for the formation of a parallel bank of 'state-space' H/sup /spl infin// type linear combiner matrices. These linear combiner matrices can then be used to obtain estimates of the transformed noise subspaces, upon which the evaluation of a MUSIC-type cost function can be used. This cost function employs the transformed spatio-temporal manifold vectors, and provides jointly the delays and directions of the incident multipath rays associated with the desired user. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensor locator polynomial: A differential geometry approach to linear array design.",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.589.6698&rep=rep1&type=pdf",
            "Abstract": "It is well-known that the sensor characteristics and their physical arrangement place fundamental limitations on the ultimate capabilities of an array system. In this paper, the design of linear arrays, tailored to the so-called direction-finding (DF) algorithms, is considered. The proposed design approach is superresolution based on the differential geometry of the. The novel concept of a is array manifold sensor locator polynomial presented and its properties are investigated. Then it is shown how this concept can be applied to the design of a linear array with prespecified Cramer-Rao bounds on the azimuth estimates, without recourse to optimisation.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diffused channel estimation and reception for cyclic prefix-free mc-cdma arrayed-mimo communication systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10776-008-0080-y.pdf",
            "Abstract": "An arrayed-MIMO communication system, which employs antenna arrays at both ends of the wireless link is proposed to leverage upon spatial information such as directions-of-arrival to achieve an improvement in performance. This is in contrast with conventional MIMO systems, which typically assume multiple independent antenna elements at the transmitters and receivers. This paper focuses on an arrayed-MIMO communication system operating over a frequency selective fading channel and employs MC-CDMA as the modulation technique. However, in a departure from conventional MC-CDMA systems, cyclic prefixes or guard intervals are not used for the MC-CDMA system employed here so that valuable bandwidth is not wasted on cyclic prefixes or guard intervals. Localized scattering is assumed to occur for each multipath; hence the wireless channel is modelled as a diffused vector channel. A …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Joint transmitter-receiver beamforming over space-time fading channels",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4289482/",
            "Abstract": "The problem of joint transmitter and receiver beam- forming in the downlink DS-CDMA over multipath fading channels is considered in this paper. The proposed investigation is based on the array manifold concept and thus, the space-time properties of the channel can be fully exploited, playing a crucial role in the operation of blind channel estimation and interference suppression techniques. The beamforming weights are designed to minimise the overall mean-squared-error (MSE) of the system. An iterative solution to the optimisation problem is firstly proposed under the system framework. A closed-form solution based on channel eigendecomposition is then proposed. The convergence of the iterative method to the closed-form solution and the equivalence of the two methods are verified through numerical simulations. The performance of the proposed approach is also supported by some illustrative examples.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensitivity analysis of manifold surfaces in the presence of array uncertainties",
            "Publication year": 2001,
            "Publication url": "https://skynet.ee.ic.ac.uk/papers/2001_C_SEE_Manifold_Sensitivity.pdf",
            "Abstract": "The array manifold is a key component in the modelling of antenna array systems. Its properties are entirely dependent on the locations of the array sensors and their electrical characteristics. In this paper, the manifold of a planar array, as a function of the surface azimuth and elevation angles is considered. The effects of array geometrical uncertainties on the manifold surface are investigated by studying the variations in its shape through differential geometry. This leads to the identification of the array sensor locations which are least/most significant in the geometry and eventually to array design.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of 3D array systems",
            "Publication year": 2006,
            "Publication url": "https://skynet.ee.ic.ac.uk/papers/2006_C_WSEAS_Analysis_3D.pdf",
            "Abstract": "The analysis of the performance of antenna array systems has been mainly focused to arrays of elements with linear or planar array geometries. However, in many modern array applications, antenna array geometries may span the full 3D space, and may be used in scenarios where signals are impinging from any direction in that space. In this paper, new theoretical tools for analysing the detection and resolution capabilities of 3D arrays are developed based on the geometric properties of the array manifold. Furthermore, a new type of ambiguities for 3D arrays is presented, complementing the introduction to the analysis of the most general case of array systems.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:M05iB0D1s5AC",
            "Publisher": "WSEAS PRESS"
        },
        {
            "Title": "MIMO array DS-CDMA system: a blind space-time-Doppler estimation/reception",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1326263/",
            "Abstract": "A blind near-far resistant MIMO array receiver is proposed for time-varying asynchronous multipath DS-CDMA systems. Unlike many other MIMO works, the proposed receiver is built on array-antenna technology which is commonly used in applications such as the well-known 'smart antenna' system. Hence, a novel space-time-Doppler estimation algorithm is devised which provides the joint angle and delay, as well as the Doppler shift frequency estimation. With the estimator integrated as the front-end, the proposed MIMO array receiver requires no knowledge of the channel and is insusceptible to near-far problems. Furthermore it is robust to channel estimation errors in the event of any unidentified or erroneous channel parameter.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrated Multiuser Reception & Vector Channel Estimation",
            "Publication year": 2002,
            "Publication url": "https://skynet.ee.ic.ac.uk/projects/imrvce/InterimReport1.pdf",
            "Abstract": "In this report the use of a crossed-dipole array is proposed in joint space-time channel estimation for asynchronous multipath DS-CDMA systems. The polarisation diversity offered by such an array, unlike linearly polarised arrays, is able to detect and estimate any arbitrary polarised signal path. By utilising the polarisation completely information inherent in the received signal to construct the polar-spatio-temporal array (polar-STAR) manifold vector, the accuracy and resolution of the polar-STAR parameters' estimation are significantly improved, and its signal detection capability is enhanced. To alleviate the need for a multidimensional search in the polarisation space, a computationally efficient joint polarisation-angle-delay channel parameter estimation algorithm is proposed for a'desired user'that operates in an asynchronous multi-user and multipath environment. The proposed algorithm, which can be seen as an application of MUSIC-type techniques, is based on combining a two-dimensional STAR-Subspace type technique with a set of analytical equations and is supported by representative examples and computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game theory H/sub/spl infin//approach to robust direction finding",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/893525/",
            "Abstract": "In this paper a novel robust technique for uncalibrated, or partially calibrated, direction finding array systems is proposed to cope with noise of unknown statistics and with array electrical and geometrical uncertainties. The proposed technique is based on robust H/sub /spl infin// estimation in a game theory framework and requires the design of a new state-space model for the array output signal. This model incorporates the array uncertainties explicitly as system disturbances rather than lump them into the noise terms. The described theoretical formulation is supported by a number of computer simulation studies that certify the robustness of the proposed technique.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind multiuser vector channel estimation for space-time diffused signals",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/861183/",
            "Abstract": "A near-far resistant channel estimation technique is proposed for DS-CDMA signals transmitted over a multiuser frequency-selective fading channel. The spatially and temporally diffuse rays for a particular user are considered to arrive in clusters, separated in time and/or space. The proposed technique estimates the DOA mean and variance, and the time delay offset and decay factor for each cluster. The technique is shown to effectively resolve sources even where they are closely located in time and space. Furthermore, unlike many DS-CDMA channel estimators, the technique also performs well in the presence of co-code interferers.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of three-parameter diversely polarized array manifold",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4699499/",
            "Abstract": "An investigative study of three-parameter diversely polarized array manifold is presented in this paper. With a polarization diversity, an extra degree of signal discrimination is provided to an array system allowing the multipath fading to be mitigated and the performance of a communication system to be significantly enhanced. The main objective in this work is to use differential geometry as a tool to analyze the array manifold of this type. A new mathematical framework based on the study of three-parameter array manifold is proposed in conjunction with an analysis of diversely polarized manifold. Various intrinsic parameters such as arclength, area, and volume are defined to provide a fundamental understanding of the geometrical properties and local behavior of the manifold.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Differential geometry in array processing, Athanassios Manikas, Imperial College Press, London, UK, 2004, 240 pages, ISBN 1‐86094‐422‐1,(hard back) US 58/£43,ISBN1‐86094‐423‐X(paperback)US 34/£ 25",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jnm.587",
            "Abstract": "The concept of the array manifold and its subsequent analysis will not be immediately easy to grasp for many engineers, although many of the fundamentals will be well known to those with a mathematical background. This research monograph makes a very strong case for developing an understanding of the manifold and emphasizes the relevance of differential geometry to the design and analysis of arrays.The array manifold is defined by the author as ‘the locus of all response vectors of the array over the feasible set of source/signal parameters’. This locus (a curve or surface) is formed by considering the manifold vectors as a function of direction. Many will be familiar with the analysis of surfaces and curves in three or more dimensions in Cartesian (real) space, however for an array having N sensors the manifold itself exists in N-dimensional complex space and its analysis requires careful treatment. The book …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:eMMeJKvmdy0C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Blind reception of multicarrier DS-CDMA using antenna arrays",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1244800/",
            "Abstract": "An asynchronous, multicarrier direct-sequence code-division multiple-access (DS-CDMA) array receiver is proposed based upon blind, composite channel vector estimation. Due to the fact that the combined effect of all received paths is estimated, the total number of paths can be greater than the number of antennas in the receiver array. Furthermore, the proposed approach is not limited by multipath coherency. The receiver is classified as an interference cancelling zero-forcing receiver, and multicarrier operation in a frequency-selective channel means that its performance can exceed that of a single-carrier array DS-CDMA. The effectiveness of the proposed approach, even in the presence of strong interference, is demonstrated by computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual SIMO radar modelling in arrayed MIMO radar",
            "Publication year": 2012,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/ic.2012.0121",
            "Abstract": "In this paper, an equivalent `virtual' SIMO (Single Input Multiple Output) radar representation of the MIMO radar system is established which enables the analysis of the full MIMO system geometry. Analytical expressions are derived to describe the key geometrical properties of the virtual array's manifold, which fully characterises the entire transmit-receive system geometry. A new family of subarrayed collinear MIMO array structures is presented for obtaining uniform linear virtual arrays. It is shown that this reduces the required radar platform size by up to a half, compared to popular existing methods, without reducing virtual array aperture. (6 pages)",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "An investigative study of cyclic prefix-free MC-CDMA Arrayed-MIMO Communication Systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4147022/",
            "Abstract": "An arrayed-MIMO communication system, which employs antenna arrays at both ends of the wireless link, is proposed to leverage upon spatial information such as directions-of-arrival for achieving an improvement in performance. This is in contrast with conventional MIMO systems, which typically assume multiple independent antenna elements at the transmitters and receivers. This paper focuses on an arrayed-MIMO communication system operating over a frequency-selective fading channel and employs MC-CDMA as the modulation scheme. However, in a departure from conventional MC-CDMA systems, cyclic prefixes or guard intervals are not used for the MC-CDMA system employed here so that valuable bandwidth is not wasted on cyclic prefixes or guard intervals. The feasibility of the proposed system is supported by simulation results.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind estimation of diffused multipath vector channels for DS-CDMA systems",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1407205/",
            "Abstract": "In the antenna array wideband DS-CDMA systems, the propagation medium is a vector channel. Moreover the multipaths that define the channel are spatially and temporally diffused such that each multipath appears as a cluster rather than a point like signal source. Hence, channel estimation techniques that do not exploit the structure of the vector channel become inefficient. In this context, a subspace approach to estimate the diffused vector channels for multi-user wideband DS-CDMA systems is being proposed. The diffused vector channel is parameterized in terms of multipath directions and times of arrival. Then, by employing the structure of the developed diffused vector channel, a powerful blind near-far resistant channel estimation algorithm is derived. Simulation results are provided to illustrate the efficiency of the algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MMSE multiuser detection for array multicarrier DS-CDMA in fading channels",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1453768/",
            "Abstract": "Reception of asynchronous, multicarrier direct-sequence-code division multiple access (DS-CDMA) in time-varying, multipath radio channels with use of a receiving antenna array is investigated. Interference reducing minimum mean squared error (MMSE) receivers are discussed, and by considering the time-variation of the channel, a modified structure is derived which is efficient for channels experiencing small-scale fading. A blind implementation of this receiver is then proposed. Subspace concepts are applied to formulate a tracking, composite channel vector estimator which operates effectively in fading situations, even when high levels of interference are present. Both the modified MMSE weight matrix and diversity combining weights are generated from these channel estimates. Simulations of the proposed receiver show it to have superior performance over a standard MMSE receiver which is periodically re …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Antenna array manifold: a simplified representation",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/861209/",
            "Abstract": "The array manifold vector is one of the most important parameters of an array system. For a general non-linear array of sensors, (i.e. a two or three dimensional array geometry), the locus of the manifold vectors is a hypersurface embedded in a multidimensional complex space, with parameters of interest the azimuth and elevation angles. In this paper, a simplified representation of this complex hypersurface on a real two-dimensional plane is presented. This simplification/mapping, using concepts from differential geometry, maintains the main characteristics of the original array manifold surface and has the potential of providing new grounds for design and analysis of array systems. In this study, both planar and three-dimensional arrays of omnidirectional sensors are considered.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MIMO Radar With Array Manifold Extenders",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8930007/",
            "Abstract": "This article is concerned with the problem of multitarget parameter estimation in arrayed multiple-input multiple-output (MIMO) radar. In particular, the radar operates in the presence of moving targets, where the parameters of interests to be estimated for each target are the relative delay, Doppler frequency, direction-of-arrival (DOA) and complex path coefficients (or target's radar cross section). Using the novel concept of “array manifold extender,” the dimensionality of the observation space increases from N to NN ext , making the radar more powerful than conventional MIMO radar systems by handling more complex targets and estimating their parameters with increased accuracy. Two “manifold extenders” are proposed in this article in conjunction with a novel spatiotemporal subspace-type framework for estimating the target parameters. The performance of proposed framework is examined using computer …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semi-blind spatio-temporal channel estimation for CDMA systems",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/891658/",
            "Abstract": "In this paper two semi-blind channel estimation techniques are proposed for synchronous DS-CDMA signals transmitted over a multiuser multipath channel. An initial channel estimate is obtained, then statistical techniques are used to enhance the quality of this estimate. In the first technique the channel parameters are estimated first and then used to construct the signal subspace. This information is then used to form an improved channel estimate. The second technique is similar, but uses an adaptive structure to obtain the signal subspace directly. The performance of the techniques is evaluated and compared through analysis and simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Manifold studies of nonlinear antenna array geometries",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/905865/",
            "Abstract": "The manifold of a general two- or three-dimensional (2-D or 3-D) array of sensors is studied using differential geometry. By considering the azimuth and elevation angles as the parameters of interest, a manifold surface is formed embedded in a multidimensional complex space, initially, this surface is investigated by establishing a number of differential geometry parameters associated with the array manifold. Then, the concept of development is proposed for mapping manifold surfaces (embedded in a multidimensional complex space) on the real 2-D parameter plane. The proposed mapping preserves certain differential geometry characteristics of the manifold surface and provides a simplified representation for the analysis. The potential benefits of this mapping, as well as of the proposed parameters, are demonstrated in the analysis of 3-D and planar arrays of omnidirectional sensors and in a number of potential …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Differential geometry in array processing, Athanassios Manikas, Imperial College Press, London, UK, 2004, 240 pages, ISBN 1‐86094‐422‐1,(hard back) US 58/£43,ISBN1‐86094‐423‐X(paperback)US 34/£ 25",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jnm.587",
            "Abstract": "The concept of the array manifold and its subsequent analysis will not be immediately easy to grasp for many engineers, although many of the fundamentals will be well known to those with a mathematical background. This research monograph makes a very strong case for developing an understanding of the manifold and emphasizes the relevance of differential geometry to the design and analysis of arrays.The array manifold is defined by the author as ‘the locus of all response vectors of the array over the feasible set of source/signal parameters’. This locus (a curve or surface) is formed by considering the manifold vectors as a function of direction. Many will be familiar with the analysis of surfaces and curves in three or more dimensions in Cartesian (real) space, however for an array having N sensors the manifold itself exists in N-dimensional complex space and its analysis requires careful treatment. The book …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:HE397vMXCloC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Arrayed MC‐CDMA reception in space‐time diffused multipath vector channels",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.570",
            "Abstract": "Multi‐Carrier Code Division Multiple Access (MC‐CDMA) is a modulation scheme that combines the advantages of OFDM and CDMA to provide robustness against frequency selectivity in wireless channels. Arrayed MC‐CDMA systems combine MC‐CDMA and antenna array technology to harness the spatial and temporal ‘signatures’ of received signals, thus making it possible to realize high transmission rates envisioned for next generation wireless communications. Localized scattering, which occurs for each multipath, motivates the frequency selective wireless channel to be modelled as a diffused vector channel. In this paper, space‐time diffused vector channels for arrayed MC‐CDMA systems are modelled and analysed. Simulation studies show that the use of this diffused channel modelling in arrayed MC‐CDMA receivers yields better Bit Error Rate (BER) and SNIRout performance than receivers that …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:g5m5HwL7SMYC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Localization and array shape estimation using software defined radio array testbed",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6882372/",
            "Abstract": "The emergence of software defined radio (SDR) aims to increase flexibility as well as reduce cost, size, weight and power (SWAP) inherent in traditional hardware radios. This paper is concerned with addressing issues associated with the formation of an array system from multiple SDR boards where each has an independent local oscillators (LO) in a multi-antenna system using representative examples such as localization and array shape estimation. In particular, practical experimental results are initially presented for estimating the unknown location of a single source using an SDR array of known array geometry. Furthermore, in the case that the SDR array geometry is unknown, a novel array shape estimation algorithm is proposed. The proposed algorithm estimates the antenna locations without requiring any external sources. This is achieved by allowing the array elements operate as transceivers.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sequential wireless sensor network discovery using wide aperture array signal processing",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6334201/",
            "Abstract": "In this paper, a novel wireless sensor network discovery algorithm is presented which estimates the locations of a large number of low powered, randomly distributed sensor nodes. Initially, all nodes are at unknown locations except for a small number which are termed the “anchor” nodes. The remaining nodes are to be located as part of the discovery procedure. As the locations of sensor nodes are estimated, they can be used in the localization of other nodes. The locations of transmitting nodes are estimated in a decentralized manner by using a set of receiving sensor nodes at known or estimated locations within its coverage area to form an array. Initially a coarse localization of all nodes is performed to identify their approximate positions. A fine grained localization procedure then follows for enhancement. This paper will focus on the coarse localization approach. Simulations demonstrate the effectiveness of the …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Array shape calibration using a single multi-carrier pilot",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6253429/",
            "Abstract": "In this paper, a novel single pilot array shape calibration algorithm is proposed for an arbitrary planar array. The method requires a single multi-carrier pilot operating at a known location with respect to the arbitrary array reference point. Typically two or more sources are required to calibrate the shape of a planar array. However, by exploiting the difference in the array response model when the source operates in the \"near-far\" and \"far\" field of the array, it is shown how this can be reduced to just one. Simulation results exhibiting the performance of the proposed method are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IET"
        },
        {
            "Title": "Joint linear precoder-decoder optimization over mimo-cdma multipath channels",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394041/",
            "Abstract": "This paper addresses the problem of joint transmitter-receiver optimization in the downlink multiple input multiple output (MIMO) DS-CDMA systems over multipath fading channels. Both the transmitter and the receivers are equipped with antenna arrays and the precoding/decoding matrices can be designed to minimize the overall mean-squared-error (MSE) of the system subject to power constraint. The study is based on the spatio-temporal array (STAR) manifold concept. The performance of the proposed algorithm is supported by numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polarisation-sensitive array in blind MIMO CDMA system",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/document/1500290/",
            "Abstract": "A blind near-far resistant MIMO array receiver employing diversely polarised array is proposed for asynchronous multipath DS-CDMA systems. By means of polarisation multiplexing, the proposed MIMO system is applicable in (i) data rate, (ii) diversity, or (iii) combinatorial maximisation schemes, without exhausting the limited spreading codes available.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IET"
        },
        {
            "Title": "Parameter estimation: the ambiguity problem",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/870151/",
            "Abstract": "In a statistical signal processing parameter estimation problem, ambiguities are generated when there is not a one to one mapping between the object space and the measurement space. The ambiguity problem is investigated using differential geometry concepts and a theoretical framework is proposed for the classification, identification and calculation of ambiguities, associated with two application areas, that is in array processing and in the harmonic retrieval problem.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DOA and DOD Channel Estimation in MIMO Access Networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8761924/",
            "Abstract": "This paper is concerned with MIMO techniques for 5G+ Access Networks. In particular, a joint Direction-of-Arrival (DOA) and Direction-of-Departure (DOD) estimation approach is proposed for MIMO systems that employ antenna arrays of N-elements at the transmitter (Tx) and N-elements at the receiver (Rx), both of known geometries. In the proposed system, a weight-vector of N orthogonal binary signals of length Nc is employed on the Tx-array, and then used at the Rx-array to extend the observation space of the received signals from N to NN. In the extended observation space the manifold vectors are functions of both the DOA and DOD. The proposed approach uses these extended manifold vectors, in conjunction with a superresolution subspace approach, to find the DOA and DOD of all the multipaths of the desired user in the presence of other multiple-access users, considering that all users transmit at the …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Subspace receiver techniques for DS-CDMA systems in space diffused vector channels.",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.565.5095&rep=rep1&type=pdf",
            "Abstract": "This work is motivated by the fact that basestation receiver performance degrades significantly in spatially diffused multipath channels. Herein, this problem is addressed for array DS-CDMA systems in spatially diffused vector channels. Firstly, multipath spatial diffusion is cast as a signal model perturbation problem and then two subspace based receiver techniques are proposed that effectively remove this perturbation. Both approaches give superior performance compared to similar receivers that ignore the spatial spread. Computer simulation results are presented to corroborate the claim.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Target tracking with a flexible UAV cluster array",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7849056/",
            "Abstract": "Unmanned aerial vehicle (UAV) cluster applications, for tasks such as target localisation and tracking, are required to collect and utilise the data received on \"flexible\" sensor arrays, where the sensors, i.e. UAVs in this scenario, have time-variant positions. In this paper, using a parametric channel model, a UAV cluster mobility model and a kinematic model of the targets, an extended Kalman based state space model is proposed that tracks the unknown UAV positions and target parameters snapshot by snapshot. Simulation studies illustrating the tracking capabilities of the proposed technique have been presented.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ambiguities in the harmonic retrieval problem using non-uniform sampling",
            "Publication year": 2001,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-rsn_20010619",
            "Abstract": "Harmonic retrieval is an important problem in signal processing and has received a lot of attention. However, solutions to the problem are generally based on uniform sampling with a rate equal to or greater than the Nyquist rate, in order to avoid certain overlapping (ambiguities) of the spectrum. An investigation is carried out for the detection and estimation of ambiguities in the harmonic retrieval problem, in the case of non-uniform sampling at a rate lower than the Nyquist rate, using differential geometry. An approach for the calculation of the maximum number of ambiguous generator sets of frequencies, associated with a given non-uniform sampling, is also presented and it is then used for identifying unambiguous groups of irregular samples.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:TFP_iSt0sucC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Preprocessing algorithm for source localisation in a multipath environment",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6882333/",
            "Abstract": "Several methods have been developed which allow the estimation of the location of an existing source with considerable accuracy in the absence of multipaths. However, if, in addition to the Line-of-Sight (LOS) path, non-LOS (NLOS) paths are also present, then all existing localisation algorithms dramatically fail to estimate the location of the source. In this paper, a passive array processing algorithm is proposed, which, if used prior to a localisation approach, suppresses all the multipath contributions in the received signal except for that of the LOS path. The performance of the proposed algorithm is evaluated through computer simulation studies.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance comparison of localization techniques for sequential WSN discovery",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6552188/",
            "Abstract": "In this paper, the performance of different localization algorithms are compared in the context of the sequential Wireless Sensor Network (WSN) discovery problem. Here, all sensor nodes are at unknown locations except for a very small number of so called anchor nodes at known locations. The locations of nodes are sequentially estimated such that when the location of a given node is found, it may be used to localize others. The underlying performance of such an approach is largely dependent upon the localization technique employed. In this paper, several well-known localization techniques are presented using a united notation. These methods are time of arrival (TOA), time difference of arrival (TDOA), received signal strength (RSS), direction of arrival (DOA) and large aperture array (LAA) localization. The performance of a sequential network discovery process is then compared when using each of these …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:ldfaerwXgEUC",
            "Publisher": "IET"
        },
        {
            "Title": "Guest Editorial Special Issue on Green Communications, Computing, and Systems",
            "Publication year": 2017,
            "Publication url": "https://eprints.whiterose.ac.uk/123403/1/Special%20Issue%20on%20Green%20Communications.pdf",
            "Abstract": "The convergence of computing and communications, a recognized phenomenon since 1996 (“The Convergence of Communications and Computing: What are the Implications Today?,” PROCEEDINGS OF THE IEEE, 1996), has accelerated in recent years. Computing technologies are used extensively in network systems, such as cloud computing and grid computing, and the Internet is the most well-known and widely used network infrastructure for computing. Networked software and hardware applications, especially wireless and mobile ones, have been made remarkable and fast increasing impacts on society development and human lives. They touch a great number of the human population in the world through ubiquitous mobile phones and devices. Computing and communications are indispensable components in many diverse systems. All these systems have energy issues. Their increasing spread, particularly with the emergence of the Internet of Things, is a great challenge to a world seeking to reduce its reliance on fossil fuels and address global climate changes. At the same time, although energy concerns are one of the dominant “green” topics, the green issues could be more generally defined as those making the world and the components of man-made systems both sustainable and friendly in an environmental, economic, social, and/or technical sense (“Big Data Meet Green Challenges: Greening Big Data,” IEEE SYSTEMS JOURNAL, 2016). In this sense, the word “green,” includes not only the sustainability objectives but also the “most positive and friendly” characteristics concerning human environments and societies. This …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Differential Geometry in Array Processing,",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=6Z0UPauwFCYC&oi=fnd&pg=PR7&dq=info:BuqFKMI5V5wJ:scholar.google.com&ots=HAJdunO2KH&sig=hTyPd2A7FpsdhQjo78COzZEtr8U",
            "Abstract": "In view of the significance of the array manifold in array processing and array communications, the role of differential geometry as an analytical tool cannot be overemphasized. Differential geometry is mainly confined to the investigation of the geometric properties of manifolds in three-dimensional Euclidean space R3 and in real spaces of higher dimension. Extending the theoretical framework to complex spaces, this invaluable book presents a summary of those results of differential geometry which are of practical interest in the study of linear, planar and three-dimensional array geometries.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resolving manifold ambiguities in direction finding systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7098771/",
            "Abstract": "The issue of resolving manifold ambiguities in subspace-based Direction Finding (DF) systems is investigated in this paper. The cause of manifold ambiguities is due to linear dependence amongst manifold vectors. When an ambiguous situation occurs, subspace-based DF techniques fail to correctly identify a unique set of Directions-of-Arrival (DOA). This causes a performance degradation due to unreliable estimates of the parameters. In spite of the fact that there are infinitely many ambiguous scenarios in an array system, the problem in resolving manifold ambiguities has received very little attention. In this paper, two novel techniques are proposed, aiming at improving the DOA identification capability, while maintaining a minimum computational complexity. The proposed techniques adopt a beamforming class based on the Minimum Variance Distortionless Response (MVDR) criterion to estimate signal power …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual linear array modelling of a planar array",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.667.5307&rep=rep1&type=pdf",
            "Abstract": "In this paper, a novel transformation connecting an arbitrary Planar Array to a virtual Uniform Linear Array (ULA) with a larger number of sensors is proposed. The array orientation, number of sensors and phase characteristics of the virtual array are a function of the array shape of the planar array. The two parameter manifold (azimuth, elevation) of a planar array of N sensors is a conoid surface embedded into an N-dimensional complex space which can be described by two families of curves (θ-curves and φ-curves). While the family of φ-curves have hyperhelical shape, the family of θcurves do not. The proposed transformation will allow the θcurves to be transformed to the manifold of a virtual ULA that has hyperhelical shape. This will allow a planar array system to be analysed or designed by analysing or designing simple hyperhelical curves associated with the virtual linear array.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigation of array robustness to sensor failure",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0016003204001103",
            "Abstract": "The presence of uncertainties in the array response, due to sensors operational malfunctions and environmental effects, results in a performance degradation often greater than the application requirements can afford. Various attempts have been made to measure the effect of the presence of uncertainties on the performance of direction-finding (DF) algorithms and, moreover, several methods have been developed to either detect or partly rectify the resulting defects in performance and hence improve the robustness of the array system. However, the impact of sensor response uncertainties on the ultimate array DF capabilities, as they are determined by the array manifold characteristics, has not been considered thoroughly. In this paper, the sensitivity of array DF capabilities to sensor response errors is first formulated and investigated. Robustness and reliability measures are then proposed. Such measures can be …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Robust Beamforming to Pointing Errors",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781783262755_0008",
            "Abstract": "A ubiquitous task with array signal processing and wireless communications is interference cancellation. This can be achieved by using a beamformer which places nulls in the interference directions while maintaining relatively high gain in the direction of the desired signal. However, when pointing errors occur, the performance of the traditional Wiener–Hopf beamformer (or Capon beamformer) may deteriorate significantly. In this chapter, a robust array processor is presented which not only reduces the effect of pointing errors but also offers asymptotically complete interference cancellation. Prior to the beamforming, a linear subspace can easily be found using the knowledge of the nominal manifold vector. Then it is shown that the manifold vector corresponding to the desired signal can be obtained by using this linear subspace and the signal subspace together. To eliminate much of the pointing error effects, the …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correction to “Extended array manifolds: functions of array manifolds”[Jul 11 3272-3287]",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5978837/",
            "Abstract": "The author presents revisions to various equations and formulas from the above-named article.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Arrayed space optical communications: Localization of the ground station",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7996947/",
            "Abstract": "In this paper, a novel ground station localization algorithm is proposed for space optical communications using array processing and a set of celestial objects of known locations in the global coordinate system. First, the ground station estimates the directions of this set of celestial objects relative to its local coordinate system using the sunlight reflected by these celestial objects. Then, the ranges of the celestial objects and the location and orientation of the ground station are estimated by solving systems of nonlinear and linear equations. The performance of the proposed approach is assessed through computer simulation studies. It is shown to estimate the location and orientation of the ground station successfully with excellent accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of the spatio-temporal array manifold of linear arrays using differential geometry",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4128886/",
            "Abstract": "This paper is concerned with the study of linear array systems, operating in an asynchronous, multipath/multiple-access environment. In the modeling and analysis of array systems, the array manifold vector is being widely used, providing the spatial information of the signal environment. Recently, because of the inherent limitations of the array manifold to accurately model a multiple-access/multipath signal environment, the concept of the spatio-temporal array (STAR) manifold has been introduced, which extends the conventional - spatial array manifold by incorporating both temporal information and the distinct \"signature\" of each user/target/path. The properties of the array manifold have already been extensively studied and the aim of this paper is to examine the corresponding properties of the STAR manifold. It is shown that there is a direct relationship between these two manifolds and that the characteristics of …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A space-diffused spatial-temporal array (star) receiver for ds-cdma system",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/A-Manikas/publication/266583612_A_Space-Diffused_Spatial-Temporal_ARray_STAR_Receiver_for_DS-CDMA_System/links/553bc01d0cf29b5ee4b87ca7/A-Space-Diffused-Spatial-Temporal-ARray-STAR-Receiver-for-DS-CDMA-System.pdf",
            "Abstract": "In this paper, a blind space-time receiver is proposed to handle point and diffused sources for asynchronous multipath DS-CDMA systems. The receiver is based on a computationally efficient subspace-type algorithm for its joint space-time channel estimation which is insusceptible to near-far problems. The coherency between the sources is removed by a novel temporal smoothing technique operating in the transformed domain. Unlike many conventional DS-CDMA receivers, the proposed formulation and approach is applicable even with the presence of co-code interferers. Furthermore it is robust to channel estimation errors in the event of any unidentified (incomplete) or erroneous (incorrect) channel parameter.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Positioning in wireless sensor networks using array processing",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4698596/",
            "Abstract": "In this paper, a novel positioning approach for wireless sensor networks (WSNs) is proposed. The approach locates a given target node by using a number of surrounding anchor nodes as an array of large aperture with known geometry. The approach uses the concept of the array manifold vector based on spherical wave propagation. The position of the target is estimated as the intersection point of three circular loci, the centres and radii of which are calculated from the signal eigenvalues of the covariance matrices corresponding to a number of reference points. A number of simulation results show that the proposed approach can estimate a target location with exceptional accuracy even for low SNR in , x (observation-interval). Analytical expressions are also provided for the estimation error due to the finite averaging effects, as a function of the locations of the anchor nodes and the SNR in .",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interference cancellation beamforming robust to pointing errors",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/document/6545029/",
            "Abstract": "The conventional Wiener-Hopf beamformer is subject to substantial performance degradation in the presence of steering vector pointing errors. By removing the effects of the desired signal, the modified Wiener-Hopf beamformer avoids this problem but allows cochannel interferences to pass through in order to maximise the signal-to-noise ratio. In this study, a novel array beamformer is proposed, which not only reduces the effect of pointing errors, but also asymptotically provides complete interference rejection. In particular, the proposed beamformer utilises a vector space projection method and employs a one-step computation for the desired signal power. Using this, the effects of the desired signal can be extracted to form the desired-signal-absent covariance matrix. Thus, a weight vector orthogonal with the interference subspace can be constructed. Numerical results demonstrate the superior performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:XiSMed-E-HIC",
            "Publisher": "IET"
        },
        {
            "Title": "Multi-carrier CDMA MIMO in arrayed wireless sensor networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1547748/",
            "Abstract": "Arrayed wireless sensor networks are a novel type of wireless sensor networks involving a very large number of wireless nodes that are randomly distributed in a 3-dimensional space at unknown locations and are used for monitoring events of interest. When such events occur, some nodes are automatically self organized and grouped together to form wireless arrays of suitable, although random, geometries and then an ad-hoc wireless network of arrays operating in an infrastructureless environment. This paper focuses on the communication links involved in the operation of the arrayed wireless sensor network based on a multicarrier CDMA MIMO architecture",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diffused channel framework for blind space-time DS-CDMA receiver",
            "Publication year": 2003,
            "Publication url": "https://skynet.ee.ic.ac.uk/papers/2003_C_HERCMA_Diffused_Ch_Framework_Blind_ST_DSCDMA_Rx.pdf",
            "Abstract": "In this paper, a blind space-time receiver is proposed to handle point and diffused sources for asynchronous multipath DS-CDMA systems. The receiver is based on a computationally efficient subspace-type algorithm for its joint space-time channel estimation which is insusceptible to near-far problems. The coherency between the sources is removed by a novel temporal smoothing technique operating in the transformed domain. Unlike many conventional DS-CDMA receivers, the proposed formulation and approach is applicable even with the presence of co-code interferers. Furthermore it is robust to channel estimation errors in the event of any unidentified (incomplete) or erroneous (incorrect) channel parameter.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Array calibration in the presence of unknown sensor characteristics and mutual coupling",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075441/",
            "Abstract": "In this paper, a method that is capable of handling simultaneously gain, phase and location as well as mutual coupling uncertainties is proposed for calibrating a planar array of general geometry. The proposed technique assumes that the array gain and phase errors are non-directional and that three time-disjoint pilot sources are available. The efficiency and the potential benefits of the proposed pilot calibration method are illustrated by a number of representative examples.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A blind array calibration algorithm using a moving source",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606911/",
            "Abstract": "This paper is concerned with the problem of antenna array calibration in a non-stationary signal environment. In detail, this study focuses on calibration of the antenna array geometry by employing properties of the differential geometry of the array manifold vector. The proposed algorithm is totally blind, since the only available information to the array system is the received signal emitted by a moving source of unknown characteristics. The only assumption made is that the movement of the source has an angular component and that the position of one sensor with regards to the reference point is known. It is shown through Monte Carlo simulations that this method significantly improves the ability of the array system to estimate characteristics of the moving source, such as its direction of arrival (DOA), in addition to reducing the positioning errors of the array elements.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Array manifold curves in C^N and their complex cartan matrix",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blind array receiver for multicarrier DS-CDMA in fading channels",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/document/1192228/",
            "Abstract": "A modified MMSE receiver for multicarrier DS-CDMA operating in fading, multipath radio channels is presented. This structure is computationally efficient when the channel is rapidly time-varying. Subspace concepts are applied in a proposed blind implementation and simulations show that the new receiver can produce enhanced performance.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:70eg2SAEIzsC",
            "Publisher": "IET"
        },
        {
            "Title": "Super-resolution broad null beamforming for cochannel interference cancellation in mobile radio networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/845085/",
            "Abstract": "An innovative beamforming-type approach for suppressing cochannel interference in mobile radio networks is introduced. This approach combines a super-resolution direction and power profile finding algorithm, together with a signal subspace-type broad null beamformer which can steer both sharp and controlled broad nulls in the appropriate directions. The latter property makes the beamformer ideal for mobile communication systems where the angular spread of the incoming rays from a cochannel interfering mobile station is often too large to be eliminated by a sharp null, resulting in a significant degradation in the performance of a conventional system.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Array robustness to sensor failure",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/858935/",
            "Abstract": "The presence of uncertainties in the array response results in a performance degradation often greater than the application requirements can afford. Although various attempts have been made to measure the effect of uncertainties on direction finding algorithm performance, the impact of sensor response uncertainties on the ultimate array DF capabilities has not been considered thoroughly. In this paper, the sensitivity of an array's DF capabilities to sensor response errors is formulated. Robustness and reliability measures are proposed, which can be used as tools for the evaluation of each sensor's importance within the array geometry and as criteria for the comparison of a number of array geometries.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The impact of sensor positioning on the array manifold",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1229891/",
            "Abstract": "A framework is presented in this study which analyzes the importance of each sensor in an antenna array based on its location in the overall geometry. Moving away from the conventional methods of measuring sensor importance by means of application-specific criteria, a new approach, based on the array manifold and its differential geometry, is used to measure the significance of each sensor's position in an array. By considering two-dimensional manifolds (function of azimuth and elevation angles) of planar arrays of isotropic sensors, and by using previously established results on the differential geometry of such manifolds, a sensitivity analysis is performed which leads to characterization and quantification of sensor location importance in an array geometry. Based on this framework, a criterion is developed for assessing an overall geometry. This criterion may be used as a figure of merit for comparing diverse …",
            "Abstract entirety": 0,
            "Author pub id": "294QJkAAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reduction of intracell and intercell interference for array MC-DS-CDMA",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1258619/",
            "Abstract": "The paper is concerned with asynchronous, multicarrier DS-CDMA communications using a receiver with an antenna array. An estimator is proposed to find the composite channel vector for each-intracell user; the only prerequisite being that each user's spreading sequence is available at the receiver. In the uplink, the base station typically does not have knowledge of the spreading sequences active in neighbouring cells, so that intercell interference must be blindly suppressed. Consequently, an implementation of the whitening zero-forcing receiver that reduces both intracell and intercell interference is proposed which only requires knowledge of the intracell users' spreading sequences. The effectiveness of this receiver is demonstrated by computer simulations.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest editorial broadband wireless communications for high speed vehicles",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6180089/",
            "Abstract": "The 15 papers in this special issue are divided into four categories: challenges in broadband wireless communications; physical layer techniques; radio resource management techniques; and field measurement and channel modeling.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Source localization using large aperture sparse arrays",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.799.6708&rep=rep1&type=pdf",
            "Abstract": "In this paper, a novel source/target localization approach is proposed using a number of sensors (surrounding or not surrounding one or more sources) to form a large aperture sparse array of known geometry. Under a large array aperture, the array response (manifold vector) obeys a spherical wave rather than a plane wave propagation model. By rotating the array reference point to be at each of the array sensors, a number of covariance matrices are constructed. It is shown that the eigenvalues of these covariance matrices are related to the source location with respect to the array reference point. The proposed approach is robust to channel fading and considers both wideband and narrowband assumptions. The performance of the proposed approach is evaluated via simulations as a function of array geometry, number of snapshots (L) and Signal to Noise Ratio (SNR) and shown to exceed existing techniques.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatiotemporal arrayed MIMO radar: Joint doppler, delay and DoA estimation",
            "Publication year": 2012,
            "Publication url": "https://skynet.ee.ic.ac.uk/~hcommin/comminmanikas13.pdf",
            "Abstract": "In this paper, a new method is presented for the estimation of radial velocities, relative path delays, Directions of Arrival (DOAs) and complex path fading coefficients in Multiple Input Multiple Output (MIMO) radar. In order to fully exploit the arrayed MIMO configuration, a ‘virtual’array approach is taken, whereby the combined transmit-receive MIMO geometry is expressed as an equivalent Single Input Multiple Output (SIMO) radar system. Contrary to existing descriptions of the virtual array, the model derived in this paper does not rely upon the use of a specific algorithm at the receiver and is valid for non-stationary targets whose echoes arriving from different ranges are unsynchronised. As such, this model is more general and a number of results are presented detailing the fundamental performance capabilities of the virtual SIMO system.A space-time receiver architecture is proposed which exploits the virtual SIMO structure as part of a subspace-based parameter estimation framework. Due to the great computational burden of an exhaustive 3-parameter search, the joint Dopplerdelay-DOA estimation is partitioned into an equivalent two-stage algorithm. The proposed approach is evaluated via computer simulation studies and shown to outperform existing methods.",
            "Abstract entirety": 1,
            "Author pub id": "294QJkAAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        }
    ]
}]