[{
    "name": "Charalambos Vrasidas",
    "romanize name": "Charalambos Vrasidas",
    "School-Department": "School of Education",
    "University": "Cardet - University of Nicosia, Cyprus",
    "Rank": "Καθηγητής",
    "Apella_id": 3266,
    "Scholar name": "Charalambos Vrasidas",
    "Scholar id": "bcAshfkAAAAJ",
    "Affiliation": "CARDET - University of Nicosia",
    "Citedby": 4410,
    "Interests": [
        "e-learning",
        "professional-development",
        "design-based research",
        "design thinking",
        "social justice"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=bcAshfkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Work based learning opportunities for lifelong earning (21-22 November; Intercollege, Cyprus): conference proceedings.",
            "Publication year": 2003,
            "Publication url": "https://eprints.mdx.ac.uk/id/eprint/2459",
            "Abstract": "Work based learning opportunities for lifelong earning (21-22 November; Intercollege, \nCyprus): conference proceedings. - Middlesex University Research Repository Skip to \ncontent Middlesex University Middlesex University Research Repository Research work by \nMiddlesex University staff and alumni Home Latest additions Usage statistics Search: \nsimple / advanced Browse by Year Research area Author Theses Help How do I add my \nwork? Repository FAQs Repository policies Copyright Contact us Login (Middlesex \nUniversity staff only) Work based learning opportunities for lifelong earning (21-22 \nNovember; Intercollege, Cyprus): conference proceedings. Costley, Carol and Vrasidas, \nCharalambos (2003) Work based learning opportunities for lifelong earning (21-22 \nNovember; Intercollege, Cyprus): conference proceedings. Middlesex University. . Full text \nis not in this repository. Official URL: http://www.mdx.ac.////…",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:isC4tDSrTZIC",
            "Publisher": "Middlesex University"
        },
        {
            "Title": "Learning Authentically through HIPON Platform",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=5-fVCgAAQBAJ&oi=fnd&pg=PA76&dq=info:ntc2xpvUQN8J:scholar.google.com&ots=p0tBpn8xfK&sig=2bVO0DqaNoueIZ5UhpwB3MFFykU",
            "Abstract": "Today’s global educational environment is rapidly changing. Our perspective with regard to the future of medical education is experiential learning. Learning authentically implies that learners, simulating their present or future professional practice, gain medical experience in the process of diagnosing human diseases. This challenge is linked with a main educational task undertaken, ie, structuring an inter-active e-learning platform in the context of a novel teaching strategy. The relevant project entitled “ICT emodules on HistoPathology: a valuable online tool for students, researchers and professionals–HIPON”, and co-financed by the Lifelong Learning Program of the Education, Audiovisual and Culture Executive Agency, The Commission of the European Union, has been launched at the beginning of 2013. The project has resulted in an autonomous well-structured and user friendly, multi-language e-learning platform, specifically focused on histopathology, which provides a valuable teaching tool for students, researchers and professionals.The modern technologies’ fast progress in recent years brings about the development of new teaching tools. The implementation of e-learning programs has progressively increased in medical education. Our up-to-date platform combines a virtual portfolio, a list of resources and links and, most importantly, characteristic case studies, presented on such a basis that way of thinking and experience is conveyed and acquired, instead of mere information. The basic concept underlying HIPON’s methodology is to follow mixed learning pathways based on case studies, always taking",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:u9iWguZQMMsC",
            "Publisher": "libreriauniversitaria. it Edizioni"
        },
        {
            "Title": "The nature of technology‐mediated interaction in globalized distance education",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1046/j.1360-3736.2003.00186.x",
            "Abstract": "The purpose of this paper is to discuss technology‐mediated communication and interaction in globalized distance education. We will briefly present the context, methods, findings, and implications of a research and development program we have been running for the last five years at Western Illinois University in collaboration with other institutions in the US, Mexico, and Cyprus (Intercollege). The emphasis will be on discussing the differences between face‐to‐face (F2F) and technology‐mediated interaction. Online interaction may be slower and ‘lacking’ in continuity, richness, and immediacy, when compared to F2F interaction; however, in some ways online interaction may be as good as or even superior to F2F interaction. We will use selected findings from our work to theorize the nature of interaction in online distance education in a globalized world. Our argument is that despite differences between F2F and …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Blackwell Publishing Ltd."
        },
        {
            "Title": "Achieving technology integration in classroom teaching",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Vrasidas-Charalambos-2/publication/292797733_Achieving_technology_integration_in_classroom_teaching/links/59420d18a6fdcc13d688d281/Achieving-technology-integration-in-classroom-teaching.pdf",
            "Abstract": "Despite the increasing availability of technology to schools, research evidence indicates that teachers do not use it as expected. Studies have identified several obstacles to technology use in the classroom. Among them are the culture of schooling and resistance to change, the lack of teacher technology and pedagogical skills, the lack of technologies specifically designed to serve the needs of teachers and students, the lack of teacher support, curriculum constraints, education policy, and problems in the area of assessment.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:70eg2SAEIzsC",
            "Publisher": "Information Age Publishing"
        },
        {
            "Title": "Teachers’ Practice as a Marginalization Factor in the Process for Inclusive Education in Cyprus",
            "Publication year": 2007,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11935",
            "Abstract": "In recent years there is an intense effort around the world for integrating children considered as having special needs in their neighborhood schools. The function of special education in Cyprus has been criticized as failing because it failed to include all children in teaching by providing them with equal opportunities to learning. In this paper, using the interpretive model of research we studied teachers’ practices as a factor of marginalization of certain children, how they marginalize their pupils, and attempted to understand how marginalization, a result of teachers’ practice, works. Through data analysis it indicated that some teachers marginalize children considered as having special needs.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Listening for silence in text‐based, online encounters",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/01587910701305285",
            "Abstract": "This article addresses the ways in which learners’ silence plays out within asynchronous and synchronous text‐based, online communication. Our study takes an ethnographic perspective in examining how learners and instructors in two online courses use and interpret silence. The ways in which those learners and instructors eventually integrated silence into their online communication were interpreted as non‐participation, confusion, marginalization, and thoughtful reflection. These findings have implications that are relevant to instructors’ efforts to create constructive online learning environments and view silence as an important aspect of social presence. We thus propose the need for the development of a deeper analysis—both empirical and theoretical—on the notions of online silence, social presence, and communication.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Science fiction in education: Case studies from classroom implementations",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2015.1075102",
            "Abstract": "This manuscript reports on findings from the implementation of the EU project “Science Fiction in Education” (Sci-Fi-Ed). The project provides teachers with tools, training, and guidance that will assist them in enhancing their teaching, making science more attractive to students, connecting it with real-life issues such as the environment, and providing girls and other marginalised groups with access to science resources, material, and learning opportunities. The central project idea is to achieve this by incorporating science fiction (Sci-Fi) in science teaching. The aim of this paper is to present the framework and the lessons learned from designing and implementing the project. We focus on the following topics: (1) theoretical and empirical underpinnings of Sci-Fi narratives in education: the importance of narratives in education, their benefits, and challenges; (2) interdisciplinary teaching and learning: the …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:WbkHhVStYXYC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Developing Teacher Knowledge and Skills in Teaching with Technology",
            "Publication year": 2011,
            "Publication url": "https://core.ac.uk/download/pdf/43418225.pdf#page=102",
            "Abstract": "Teacher Training programs do not have a history of success in equipping teachers to integrate 21st century technology into their classroom instruction. The following paper addresses the question,―How do we best develop the knowledge and skills of teachers to empower them to integrate technology effectively into their classroom teaching?‖ This paper is expanded in the full panel session where each presenter details the strengths and weaknesses of specific approaches to helping teachers to integrate information and communication technologies (ICT) into their curricula for developing knowledge building strategies among their students.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital, Responsible Citizenship (DRC) Heroes: An innovative gamified application for young learners",
            "Publication year": 2019,
            "Publication url": "https://pure.unic.ac.cy/en/publications/digital-responsible-citizenship-drc-heroes-an-innovative-gamified",
            "Abstract": "Digital, Responsible Citizenship (DRC) Heroes: An innovative gamified application for young \nlearners — UNIC | Research Portal Skip to main navigation Skip to search Skip to main content \nUNIC | Research Portal Home UNIC | Research Portal Logo Home Profiles Research Units \nResearch output Projects Search by expertise, name or affiliation Digital, Responsible \nCitizenship (DRC) Heroes: An innovative gamified application for young learners Efi A. \nNisiforou, C Vrasidas School of Education Department of Education Research output: Chapter in \nBook/Report/Conference proceeding › Conference contribution › peer-review Overview Original \nlanguage English Title of host publication Proceedings of the 3rd International Conference \nLiteracy and Contemporary Society: Identities, Texts, Institutions Publication status Published \n- 2019 Event 3rd International Conference Literacy and Contemporary Society: Identities, , - , /…",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A working typology of intentions driving face-to-face and online interaction in a graduate teacher education course",
            "Publication year": 2002,
            "Publication url": "https://www.learntechlib.org/p/15110/",
            "Abstract": "The study examined the intentions driving face-to-face and online interaction in a graduate online course from the meaning perspectives of the teacher and students. Participants in the study were eight students and the teacher of a graduate teacher education course at a southwestern university. The theoretical framework of the study was based on symbolic interactionism and the methodological approach was based on the canons of interpretive research as Erickson (1986) laid them out. Data analysis identified several intentions driving interaction. These included discussing and exchanging ideas, negotiating aspects of the course, providing feedback, gaining access and status in a setting, and socializing. The discussion and data excerpts clearly illustrate that underneath the surface of what, appear as ordinary day-to-day interaction, there are multiple meanings that are constructed and assigned when …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Society for Information Technology & Teacher Education"
        },
        {
            "Title": "Electronic European Language Portfolio",
            "Publication year": 2005,
            "Publication url": "https://air.unimi.it/handle/2434/10817",
            "Abstract": "This is a proposal of digital implementation of a European Language Portfolio (ELP), useful for learners of foreign languages. The Council of Europe has recently stated that language teaching and learning are key elements towards European integration and mobility. This firm belief is at the root of the Common European Framework of Reference for languages (2001). One important aspect underlined by the Framework is the need for the European citizen to have a personal document describing all his/her linguistic experiences and certifications. This document is called the European Language Portfolio-ELP. At present many European Institutions have already accepted the suggestions given by the Framework and have created different paper versions of the Portfolio adapting the European ELP format to their specific needs. However the paper editions present some limits that may be overcome by a digital version of the ELP. We aim at creating a digital ELP for university students which would bring many advantages in terms of ODL.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Komplexitäten in der Auswertung von Distance Education und virtueller Schulung",
            "Publication year": 2003,
            "Publication url": "https://pure.unic.ac.cy/en/publications/complexities-in-the-evaluation-of-distance-education-and-virtual-",
            "Abstract": "The purpose of this paper is to discuss the complexities and issues involved in the evaluation of distance education and virtual schooling. In order to provide an anchor to the issues involved in evaluating online projects we first present the evaluation design of a virtual high school project. Then, the emphasis of the paper is on the goals of the evaluation, stakeholder analysis, evaluator role, data collection, and data analysis. Finally, we discuss the need for evaluation of distance education and the ethical responsibility of the evaluators involved..",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:ye4kPcJQO24C",
            "Publisher": "Routledge"
        },
        {
            "Title": "E-moderating: the key to online teaching and learning",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2013.843834",
            "Abstract": "Online moderation and facilitation are skills that every teacher working with new technologies should have. Quality online learning relies heavily on good learning design and online facilitation skills. This book provides a proven model for teaching online and facilitating online learning. Professor Gilly Salmon has achieved continuity and provides new insights to her five-stage model, together with new research-based developments. Her work and the five-stage model have been adopted by researchers and practitioners around the globe. It provides an updated version of the model which consists of the following stages:(1) Access and information,(2) Online socialization,(3) Information exchange,(4) Knowledge construction, and (5) Development. The book covers a broad range of topics. In Part 1 Concepts and Cases, Salmon provides an overview of e-moderating, examines and revisits the five-stage model in …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Routledge"
        },
        {
            "Title": "The use of handhelds in school science: A water quality study",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/28941/",
            "Abstract": "This paper presents findings from a qualitative case study which investigates the use of handheld technologies as a means to support inquiry-based science learning within the context of the elementary school classroom. The context of this study was defined by a fifth grade elementary school classroom which engaged in a water quality study of a local lake. Analysis of the collected data (video-taped interactions and interviews) illustrated that the handhelds appeared to be supportive of the task of the outdoor environmental study, particularly because of the fact that the students were able to concurrently gather, report and organize the data collected at the site.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Technologies challenging literacy: Hypertext, community building, reflection, and critical literacy",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/technologies-challenging-literacy/20919",
            "Abstract": "This chapter describes how new technologies are challenging the traditional concept of literacy and redefining its meaning. New genres of texts change conceptualizations of literacy development and present new challenges for reading and writing. Important consequences for instruction, especially how teachers and students exploit new forms of literacy to enhance teaching and learning, are presented and discussed. A particular emphasis is placed on the role of technology for community building, reflection, and teacher learning. Deconstructing notions of how technology shapes society and the role of critical emotional literacy are also explored.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:dhFuZR0502QC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Reflection, and Critical Literacy",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=o678mxnRwlsC&oi=fnd&pg=PA21&dq=info:tE1sUYpHbo0J:scholar.google.com&ots=dm3UPw0bJR&sig=XehEy5Emr6gzvBrJ0SnClfUFXlw",
            "Abstract": "This chapter describes how new technologies are challenging the traditional concept of literacy and redefining its meaning. New genres of texts change conceptualizations of literacy development and present new challenges for reading and writing. Important consequences for instruction, especially how teachers and students exploit new forms of literacy to enhance teaching and learning, are presented and discussed. A particular emphasis is placed on the role of technology for community building, reflection, and teacher learning. Deconstructing notions of how technology shapes society and the role of critical emotional literacy are also explored.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Why Don't Teachers Adopt Technology? A Survey of Teachers' Use of ICT in the Republic of Cyprus",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1754326.1785590",
            "Abstract": "Public education is compulsory in Cyprus and is under the auspices of the country's Ministry of Education and Culture (MOEC). The majority of re-service teacher education is provided by local universities, while in-service public school teacher training is provided by the Cyprus Pedagogical Institute and other public and private agencies. This article contains information from a survey in which teacher in Cyprus gave reasons for not adopting technology.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:YFjsv_pBGBYC",
            "Publisher": "ACM"
        },
        {
            "Title": "MAKING THE FAMILIAR STRANGE—AND INTERESTING—AGAIN",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=11075249391143335072&hl=en&oi=scholarr",
            "Abstract": "The purpose of this chapter is to discuss the methodological and theoretical assumptions of interpretive research as proposed by Erickson (1986), bases! on the premises that Blunter (1989) posed for symbolic interactionism. A specific example of a conceptual framework for studying the major theoretical constructs identified in distance education research will be presented. Although this framework was initially developed for studying distance education and online learning environments, methodological and theoretical assumptions will be discussed as they relate to the general field of educational technology. Issues such as the kinds of research questions that artappropriate for interpretive research and the possible goals of inquiry will be discussed in detail and concrete examples will be presented. The emphasis of the discussion will be on the interplay among the researcher's conceptual framework, role, data collection procedures, data, analysis, and issues of validity, reliability, and generalizability.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IAP"
        },
        {
            "Title": "Qualitative evaluation in e-learning",
            "Publication year": 2014,
            "Publication url": "https://pure.unic.ac.cy/en/publications/qualitative-evaluation-in-e-learning",
            "Abstract": "The purpose of this chapter is to discuss the methodological and theoretical assumptions of qualitative evaluation of e-learning. We will begin by discussing the need for evaluation of e-learning and the complexities behind the process. We will then discuss the theoretical foundations of objectivist-quantitative and constructivist-qualitative paradigms. We will examine the kinds of situations in which qualitative approaches to evaluation are more appropriate. The key message is that both quantitative and qualitative models have substantial contributions to make to e-learning evaluation. Issues such as types of research questions that are appropriate for qualitative evaluation will be discussed in detail and concrete examples will be presented. The discussion will address the interplay among the evaluator role, data collection procedures, data analysis, and standards of rigor in e-learning evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:Mojj43d5GZwC",
            "Publisher": "Nova Science Publishers, Inc."
        },
        {
            "Title": "Understanding teachers’ role as a factor of marginalisation for children with special needs",
            "Publication year": 2004,
            "Publication url": "https://pure.unic.ac.cy/en/publications/understanding-teachers-role-as-a-factor-of-marginalisation-for-ch",
            "Abstract": "Understanding teachers’ role as a factor of marginalisation for children with special needs — \nUNIC | Research Portal Skip to main navigation Skip to search Skip to main content UNIC | \nResearch Portal Logo Home Profiles Research Units Research output Projects Search by \nexpertise, name or affiliation Understanding teachers’ role as a factor of marginalisation for \nchildren with special needs Panayiotis Angelides, C. Charalambous, Charalambos Vrasidas \nDepartment of Education Research output: Contribution to journal › Article › peer-review \nOverview Original language Greek Pages (from-to) 80-93 Journal Sygxroni Ekpaideysi Volume \n138 Publication status Published - 2004 Cite this APA Author BIBTEX Harvard Standard RIS \nVancouver Angelides, P., Charalambous, C., & Vrasidas, C. (2004). Understanding teachers’ \nrole as a factor of marginalisation for children with special needs. Sygxroni Ekpaideysi, 138, 80-. '…",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-Learning, Multiple Intelligences Theory (MI) And Learner-Centred Instruction: Adapting MI Learning Theoretical Principles To The Instruction Of Health And Safety To Construction Managers",
            "Publication year": 2009,
            "Publication url": "https://www.clutejournals.com/index.php/TLC/article/view/1172",
            "Abstract": "This paper describes an ongoing EU project concerned with developing an instructional design framework for virtual classes (VC) that is based on the theory of Multiple Intelligences (MI)(1983). The psychological theory of Multiple Intelligences (Gardner 1983) has received much credence within instructional design since its inception and has been implemented successfully in a wide array of traditional educational settings. Nonetheless, very little research has been carried out on developing frameworks for elevating MI into an e-learning environment. Specifically, the project hopes to adapt and utilize MI theoretical learning principles to create a virtual class specifically designed for instructing health and safety to construction managers. This paper explores the emerging principles from both theory and practice in order to identify the appropriate methodology for the successful incorporation of MI based instructional techniques in the virtual class design. Guidelines are provided on how the MI concept of ‘entry points’ can best be adapted for the specific learners (in this case construction managers) and class content (in this case health and safety). Of particular concern to this papers examination of ‘entry points’ is the potential for the deployment of intelligence profiling research to create a class tailor-made for construction managers while simultaneously adaptive to each learners individual needs. Emerging from this analysis, the paper will provide core recommendations including how to create problem based instructional activities that are directly related to both the participant’s intelligence strengths and to the class content.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emergency remote teaching during COVID-19 pandemic: lessons learned from Cyprus",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2021.1930484",
            "Abstract": "The world’s education systems made extra efforts to respond to school closures and the consequences of the pandemic. This brief case study investigates the implementation of distance education in Cyprus K-12 schools during the pandemic. Teachers, learners, and parents encountered several challenges. The paper highlights critical issues that should be considered in policy and practice of distance education in Cyprus and other countries with similar context.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Routledge"
        },
        {
            "Title": "The delivery of health and safety training applying multiple intelligences using virtual classes",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Vrasidas-Charalambos-2/publication/266890645_Wall_THE_DELIVERY_OF_HEALTH_AND_SAFETY_TRAINING_APPLYING_MULTIPLE_INTELLIGENCES_USING_VIRTUAL_CLASSES/links/5468bdcb0cf2397f782d69d3/Wall-THE-DELIVERY-OF-HEALTH-AND-SAFETY-TRAINING-APPLYING-MULTIPLE-INTELLIGENCES-USING-VIRTUAL-CLASSES.pdf",
            "Abstract": "The construction industry is a challenging mix of traditional hazards, on standard repetitive construction projects coupled with complex one off landmark projects. There is a compelling moral and business case for training and learning resources addressing health and safety training in the construction industry. A network of educational institutions within Europe have undertaken an initiative that addresses the delivery of health and safety training, using e-learning, on a pan European basis in the construction industry sector. An established training need module, based on an analysis of UK, Irish and Turkish health and safety statistics has been identified. The research work proposes to use the theory of multiple intelligences (MI) which postulates that there are several independent ability areas which individuals possess. The pilot material will be delivered using falls from heights as the subject matter. The development and refinement of the resources will take an action research methodology approach. The expected impact of this initiative is to develop a new innovative framework and educational resource using multiple intelligences that is directly focused on health and safety in the construction industry.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interpretivism and symbolic interactionism:“Making the familiar strange and interesting again” in educational technology research",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15539506206638246669&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:roLk4NBRz8UC",
            "Publisher": "Information Age Publishing, Inc"
        },
        {
            "Title": "Emotion, Reason, and Information and Communication Technologies in Education: some issues in a post-emotional society",
            "Publication year": 2004,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.2304/elea.2004.1.1.2",
            "Abstract": "In this article, the authors work across issues of information and communication technologies (ICT) in education to explore the meaning of emotional experience in the context of online learning. In light of Mestrovic's (1997) notion of a ‘post-emotional’ society and the increasing role of ICT in education, it is argued that educators need to rethink, modify, or extend some of the assumptions made about the relationship between emotion and reason (e.g. as these assumptions are expressed in the traditional binaries between body and mind, and emotion and reason). The argument put forward is that opportunities and consequent decisions and actions about particular pedagogical practices and philosophies must engage with an analysis of the meaning and implications of these assumptions for learning and learners.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:Zph67rFs4hoC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "A conceptual framework for studying distance education",
            "Publication year": 2002,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vvsnDwAAQBAJ&oi=fnd&pg=PA31&dq=info:k9KGnzzHrx0J:scholar.google.com&ots=4WpGU5O3ng&sig=JUZHQj-AzP8BtWrHiAnJmHnSg3A",
            "Abstract": "The field of distance education has changed dramatically over the last 30 years. Technological developments have enabled interaction and collaboration among multiple users at a scale never imagined. As the field of distance education grows and expands, so does the need to re-examine its fundamental assumptions and perspectives. Interaction has been identified as one of the major constructs in distance education research. Seen through a symbolic interactionist lens, interaction is defined as reciprocal action between two or more actors within a given context. This chapter will present a symbolic interactionist conceptual framework for studying distance education and distributed learning environments, discuss findings of research studies",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Information Age Publishing"
        },
        {
            "Title": "Complexities in the evaluation of distance education and virtual schooling",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0952398032000113112",
            "Abstract": "Distance education as a field has grown from simple correspondence education to a highly sophisticated, distributed interactive learning experience (Vrasidas, 2000; Vrasidas & Glass, 2002). One of the trends in the field of distance education is the development of virtual high schools. Virtual high schools are offering alternative solutions to educating K-12 students who are not well served otherwise. The Virtual High School is a consortium of high schools, which offers online courses taught by consortium teachers for students in participating schools. During the academic year 2000–2001, it offered more than 200 high school courses to nearly 4,000 students in 350 schools in 30 states in the US (Kozma et al., 2000). Virtual high schools are developed and are in operation in several states including Kentucky, Florida, New Mexico, Illinois, and Michigan.The Center for the Application of Information Technologies (CAIT …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "International Council for Educational Media"
        },
        {
            "Title": "An examination of the PISA database to explore the relationship between computer use and science achievement",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13803610500254824",
            "Abstract": "The purpose of this study was to compare the relationships that exist between computer use and science achievement for 15-year-old students in the USA and Germany, based on data from the Program for International Student Assessment (PISA). The results of this study show that what has an effect on science achievement is the way in which computers are used. The results indicated that students who used computers frequently at home, including for writing papers, tended to have higher science achievement. Students who had frequent availability of computers at school, who used them at that location, and who frequently used computers for programming had lower levels of science achievement.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:5nxA0vEk-isC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Abstracting & Indexing",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/35422323/A3_Kumtepe-libre.pdf",
            "Abstract": "ELBEP (Eliminating Language Barriers in European Prisons Through Open and Distance Education Technology) is a multilateral project funded by the European Union (EU) Lifelong Learning, Grundtvig (Adult Education) Programme. It aims to overcome language/communication problems between prison staff and foreign inmates at European prisons via online language teaching programs for the staff. This paper discusses the rationale and application of the project with an eye to the related literature and theoretical background. The project outcomes and findings can serve as an example for similar research studies.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educational technology in Cyprus and strategies for higher education",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523980210153462",
            "Abstract": "Information and communication technologies have a major impact on education and training around the world. Telecommunication technologies used in distance education can cut the costs of education, improve access to education and provide time exibility for learners by creating both synchronous and asynchronous learning environments (Mason, 1994; Owston, 1997). The rapid transformation manifested as a result of technology advances has an impact on education, training, and on the administration and organization of educational",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Technologies challenging literacy",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=4197057950053459848&hl=en&oi=scholarr",
            "Abstract": "This chapter describes how new technologies are challenging the traditional concept of literacy and redefining its meaning. New genres of texts change conceptualizations of literacy development and present new challenges for reading and writing. Important consequences for instruction, especially how teachers and students exploit new forms of literacy to enhance teaching and learning, are presented and discussed. A particular emphasis is placed on the role of technology for community building, reflection, and teacher learning. Deconstructing notions of how technology shapes society and the role of critical emotional literacy are also explored.© 2006, Idea Group Inc.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online professional development: Lessons from the field",
            "Publication year": 2004,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/00400910410555231/full/html",
            "Abstract": "This paper discusses the lessons learned from applying a theoretical framework for the professional development of teachers. This framework draws three interrelated theoretical areas: constructivism, situated and distributed cognition, and communities of practice. We first present the theoretical ideas on which this framework is based and discuss two projects that were developed following the framework. We then discuss the lessons learned and present the implications for the design of online professional development. The values of commitment, innovation, assessment, evaluation, communication, and interaction that underpins successful online professional development projects are highlighted. It is argued that using technology by itself does not support professional development; however, using technology in ways that are consistent with constructivist learning, and recognizing that online professional …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Contributions to the mosaic describing learners’ experiences with open online learning",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2015.1053285",
            "Abstract": "While individual offerings of massive open online courses (MOOCs) differ in significant ways (Bayne & Ross, 2014), exuberant authors in the mass media in 2012–2013 proclaimed that MOOCs were going to revolutionize education. In 2013–2014, anti-MOOC sentiments rose amidst concerns pertaining to completion rates, sustainable business models, and pedagogical effectiveness, and by 2015, mass media attention had largely waned (Kovanović, Joksimović, Gašević, Siemens, & Hatala, 2015). While there continues to be “no shortage of prophecies about [MOOC’s] potential impact”(Breslow et al., 2013) and research into the behaviors and activities of learners enrolled in MOOCs continues unabated, the academic community has yet to develop an in-depth and multidimensional understanding of learner experiences in these courses and the scholarly community still has “an incomplete mosaic of students …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:XiSMed-E-HIC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Implementation of experiential learning in pathology: impact of HIPON project concept and attainment",
            "Publication year": 2015,
            "Publication url": "http://imed.pub/ojs/index.php/iam/article/view/1333",
            "Abstract": "Background: In pathology training, one of the current, hardest and most important tasks is the conversion of the extensive amount of available data into medical experience. This challenge is linked with an innovative project entitled “ICT emodules on HistoPathology: a valuable online tool for students, researchers and professionals-HIPON”.Aim & Objectives: The project has resulted in a multi-language elearning platform which aims to imprint professional experience in a way that medical students, researchers and professionals can develop their own necessary practical dexterities in the huge field of modern Pathology.Methods: The basic concept underling HIPON’s methodology is the introduction of experiential learning based on real cases. Experiential learning is a process through which students develop knowledge, skills, and values from direct experiences; the key element is the student, and knowledge is gained as a result of being personally involved in the pedagogical approach.Results: By implementing experiential learning, there is a move to a more student-centered view of learning. The educator’s most important responsibility becomes to search out and construct meaningful educational experiences that allow students to solve real-world problems; the result is that any abstract, inert knowledge that students used to memorize from dusty textbooks comes alive as they participate in the practical application of knowledge.Conclusion: HIPON provides an innovative platform which introduces medical experience in diagnostic practical issues of Pathology. Experiential learning offers rich opportunities for learning for participants and teachers …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Globalization, information and communication technologies, and the prospect of a ‘global village’: promises of inclusion or electronic colonization?",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0022027032000190687",
            "Abstract": "This paper discusses the reciprocal relationships among globalization, information and communication technologies (ICT), and the prospect of a ‘global village’. The current metaphor of a ‘global village’ (regardless of physical access to ICT) is problematic, and can be interpreted as a form of electronic colonization. However, through such concepts as blurred identity, nomadism, and hybridity, a distinctly (post‐modern) ICT landscape can be redrawn in a way that accepts the global identity of the ICT, but denies the colonial erasure associated with the global‐village narrative. ICT, in themselves, cannot serve as an end in education, but the demand for critical education involving ICT is pressing as the effects of globalization are experienced. Three methods of promoting decolonizing criticality are proposed: critical emotional literacy, collective witnessing, and collective intelligence.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Taylor & Francis Ltd"
        },
        {
            "Title": "Educating Educators about Virtual Reality in Virtual Reality: Effective Learning Principles Operationalized in a VR Solution",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Kosmas/publication/355760389_Educating_Educators_about_Virtual_Reality_in_Virtual_Reality_Effective_Learning_Principles_Operationalized_in_a_VR_Solution/links/61823a5beef53e51e120c3f5/Educating-Educators-about-Virtual-Reality-in-Virtual-Reality-Effective-Learning-Principles-Operationalized-in-a-VR-Solution.pdf",
            "Abstract": "Virtual Reality (VR) is transforming organizational training as users are immersed in realistic situations that may not exist yet in the physical world. The theoretical principles that make VR effective for learning in an immersive way are emerging in literature but remain poorly understood in practice nor have they been articulated in available VR solutions. This study demonstrates an IT artifact that is targeted at educators in companies and in higher education. The study synthesizes the key principles that make VR environments effective for learning, derives design principles for a corresponding artifact and demonstrates a VR solution that enables educators to absorb the principles of the power of VR by experiencing them first hand. Creating this artifact and delivering it to educators is important as they are responsible for diffusing VR to current employees in companies and future workforce in higher education.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Las TICs como herramienta para la educación al medio ambiente, a la paz ya la reconciliación",
            "Publication year": 2007,
            "Publication url": "https://pure.unic.ac.cy/en/publications/ict-as-a-tool-for-environmental-education-peace-and-reconciliatio",
            "Abstract": "In this paper we describe a project that emanates from a conception of environmental education as peace education and utilizes ICT as a tool for bringing communities together and enriching ways of communication. We present the theoretical framework of the project, the dilemmas of peace education in light of the conflict in Cyprus, and then reflect on the lessons learned from the use of technology as a tool to address issues relating to environmental education and peace. We argue that such efforts are of particular importance because they aim at legitimizing a process of ongoing interaction. Thus, issues of interpersonal friendships, general beliefs in peace, and attitude change assume an interesting role in establishing communication channels that eventually aim at acknowledging each other’s collective narratives. The obstacles on the road to peace in Cyprus are numerous; however, through the critical use of ICT each community’s experiences of suffering may enhance its capacity to form wise and compassionate responses to the suffering of the other community. Les TICE, un outil pour l’éducation à l’environnement, à la paix et à la réconciliation Dans le présent article, nous décrivons un projet dans lequel on a conçu l’éducation à l’environnement comme une éducation pour la paix et où on utilise les TICE comme un outil susceptible de rapprocher les communautés et d’enrichir les formes de communication. Nous présentons le cadre théorique du projet, le dilemme de l’éducation pour la paix à la lumière du conflit chypriote puis nous réfléchissons sur les leçons tirées de l’usage de la technologie comme instrument servant à répondre aux …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Teacher professional development and ICT: Strategies and models",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/50634632/Teacher_Professional_Development_and_ICT20161130-3047-1upqorb.pdf",
            "Abstract": "The continuous striving for better teachers and better schools has taken many different paths. One such path involves the use of Information and Communication Technologies (ICT) in teaching and learning. It is clear that ICT is increasing access to information, inspiring new developments in teaching, and allowing individuals and communities to interact at any time. Debates between technology supporters and skeptics about the use of ICT in classroom teaching have been growing. Although disputes over the value of using ICT in education are one factor, the lack of availability of ICT in schools is another reason its use is limited. Other dynamics include the realities and culture of the typical classroom and teachers’ knowledge, skills, beliefs, and expertise (CEO Forum on Educational Technology, 2000; Cuban, 2001; Moursund & Bielefeldt, 1999; Vrasidas & Glass, 2005), and particularly the lack of teacher professional development.Attempts to integrate ICT into the classroom are influenced by such things as the availability of the necessary technology infrastructure, support for teachers, accessible change models, teachers’ practices, curriculum constraints, assessment practices, education policies, and professional development. Education reform efforts have emphasized the importance of integrating ICT in the classroom, citing these factors, and the need for quality teacher professional development to do so (Donnelly, Dove, Tiffany-Morales, Adelman, & Zucker, 2002; McIntyre & Byrd, 1998). Preservice teacher education programs are by no means sufficient to prepare teachers to be effective users of ICT in",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Blackwell Publishing Inc"
        },
        {
            "Title": "Concepts to Consider when Studying",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9010943144472489530&hl=en&oi=scholarr",
            "Abstract": "This paper presents a conceptual framework for studying in-teraction in online environments. The theoretical underpinnings of the framework will be presented as well as the results from studies that led to the development and refinement of the framework will be discussed. This framework is based on symbolic interactionist ideas and extensive research in the areas of computer-mediated communication and distance education. The framework consists of the following categories: context, learner control, social presence, structure, feedback, dialogue, and interaction. The categories of the conceptual framework are characterized by a reciprocal determinism, and they are all parts of a broader system. The implications of this framework and the research that will be presented will be discussed in detail as they relate to the design and study of online learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Teacher Professional Development for Twenty-First Century Literacies",
            "Publication year": 2018,
            "Publication url": "https://www.igi-global.com/chapter/teacher-professional-development-for-twenty-first-century-literacies/195278",
            "Abstract": "Preparing teachers to effectively integrate ICT in their literacies teaching, requires well-designed professional development based on sound learning design. This chapter presents the component of teacher professional development based on a blended mode of training through the integration of online tools, as it was designed and implemented in three European-funded projects that dealt with the promotion of literacies. The authors present the projects, their synergies, discuss lessons learnt and provide recommendations on how teacher professional development can be enhanced, so that teachers can be better prepared to address the evolving trends of ICT in teaching and learning.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Pedagogy for autonomy and teacher education-putting teachers centre-stage Flávia Vieira, University of Minho, Portugal",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=v_g_BYo8goYC&oi=fnd&pg=PA15&dq=info:b5ze6wn7VYkJ:scholar.google.com&ots=u0V2Ntb4JR&sig=1fxCjTfIy_8nuxb00hyJu2aU99I",
            "Abstract": "Can teacher education promote pedagogy for autonomy in schools without enhancing teacher empowerment? This question is dealt with in this chapter in the light of my experience as a language teacher educator, particularly within EuroPAL', a project aiming to promote pedagogy for autonomy in language education in Europe. Our team spent considerable time discussing and writing about learner and teacher autonomy and the connection between them. Actually, this has probably been the most challenging and controversial issue in our work, since it relates to the ideological underpinnings of pedagogy and teacher education, an area where disagreement is most likely to emerge. It is, however, a crucial issue if we do not want pedagogy for autonomy to be just one more methodological trend in the language teaching scenario.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:5awf1xo2G04C",
            "Publisher": "Peter Lang"
        },
        {
            "Title": "Perspectives on E-learning: Case studies from Cyprus",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/49997468/Perspectives_on_e-learning_Case_studies_20161031-23436-ue6nf.pdf",
            "Abstract": "INTRODUCTION uring the past decade there has been tremendous progress in the advancement of educational technology, making innovative learning solutions such as e-learning and online education increasingly more feasible in many educational settings. In several countries, the use of e-learning has now begun to noticeably contribute to economic growth. In Cyprus, an island in the Mediterranean Sea located at the crossroads of Europe, Asia, and Africa, many large-scale e-learning initiatives are currently being undertaken by both public and private organizations, establishing the country as a center for education in the region.Between the 1960s and 1990s, educational technology efforts in Cyprus schools were limited to the use of traditional audiovisual equipment and a few educational radio and television programs produced by the government. In recent years, however, considerable efforts have been devoted to promoting lifelong learning and integrating information and commu-",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Information Age Publishing"
        },
        {
            "Title": "Foundations of educational technology: integrative approaches and interdisciplinary perspectives",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2012.703430",
            "Abstract": "Theoretical foundations of learning environments provides students, faculty, and instructional designers with an introduction to the major pedagogical and psychological theories and their implications for the design of new learning environments. The application of these theories can be of great help across contexts including k-12 education, higher education, and professional education. The 13 chapters of the book are written by experts in their respective areas who present in detail the most important contemporary theories that form the foundation of the conception and design of student-centered learning environments and applications of e-learning. During the last three decades, there has been an increased interest in studentcentered learning, constructivist, and related theories. The view of learning has changed from the simple traditional transmissive view to a view of learning that is more social, conversational …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:35N4QoGY0k4C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Leveraging the Power of Stories as a Pedagogical Tool in e-Learning Environments",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=369hHqvVGWIC&oi=fnd&pg=PA257&dq=info:cViaoSj95GIJ:scholar.google.com&ots=REOG6XZ81Z&sig=OUval3f0S-3O8LEz-P9ka6jLjyQ",
            "Abstract": "This paper 1 reports the use of managerial stories in an online course for SME managers on learning “how to learn” in the workplace in order that managers can respond more effectively to the ever increasing challenges of the modern day workplace. It describes the process that was used to locate and develop these stories and explains how they were integrated within the online course environment. It concludes by offering findings from an evaluation of the pilot course with 120 participants in which the use of stories was shown to have led to personal learning.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Academic Conferences Limited"
        },
        {
            "Title": "Constructivism versus objectivism: Implications for interaction, course design, and evaluation in distance education",
            "Publication year": 2000,
            "Publication url": "https://www.vrasidas.com/wp-content/uploads/2007/07/continuum.pdf",
            "Abstract": "This paper discusses the basic philosophical assumptions of objectivism and constructivism including their implications for course design, interaction, and evaluation in distance education. First, I provide a brief overview of the construct of interaction as it is used in the field of distance education. Second, I address the major philosophical ideas of objectivism and constructivism as they relate to education. Third, I discuss how curriculum designers from each paradigm design a distance education course. Finally, I compare and contrast the two approaches to distance education course design and provide suggestions for practitioners.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICT for education, development, and social justice",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=AfwnDwAAQBAJ&oi=fnd&pg=PA85&dq=info:BHnSSXf-CbAJ:scholar.google.com&ots=RaGZCCKNZX&sig=DUMe17yrP5TWStyRysYlJHw2KL0",
            "Abstract": "This volume provides examples of current developments on the role of ICT for education, development, and social justice within an international context. Chapters draw on advanced contemporary thinking from scholars and practitioners in the field to present case studies of how ICT can be used to promote sustainable development and social justice. Social justice is understood in a wide sense as the pursuit of democracy, justice and development in the struggle against any form of oppression; it is within this context that ICT is explored as a tool for social change. The objectives of this book are: To analyze the philosophical, historical, political, and cultural backgrounds and contexts that are constitutive of contemporary challenges and tensions in the role of ICT for education, development, and social justice around the world; To appreciate the contextual and international dimensions of the tensions and challenges faced by educators around the world and contribute to ongoing efforts to sketch a vision for addressing their needs; To explore ways in which ICT in education can promote social justice and contribute toward sustaining communities around the world",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IAP"
        },
        {
            "Title": "Acquiring diagnostic experience in renal neoplastic pathology through HIPON web course",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=9104590630891788919&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "SPRINGER"
        },
        {
            "Title": "Reexamining patterns of negative computer-use and achievement relationships. Where and why do they exist?",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.640.4733&rep=rep1&type=pdf",
            "Abstract": "A close examination of the Third International Mathematics and Science Study (TIMSS) 1995 results showed that fourth grade students in Cyprus, Hong Kong and the USA who used computers most frequently in the classroom were the students with the lowest achievement in their countries. Previous studies we conducted showed similar results for 15-year-old students in various countries that took part in the Program for International Student Assessment (PISA). The purpose of this study was to look more closely at the computer use and achievement relationships to determine if similar patterns continue to exist in the TIMSS-R database. The results of this study did find similar types of relationships. More specifically, 15-year-old students in Cyprus who frequently used the Internet to communicate with other students, and who had teachers who frequently used computers in their classrooms tended to have lower scores than other students with fewer such opportunities. Similar results were found for science and mathematics. Finally, a non-surprising result of this study was that the students who own computers in their homes tend to have higher academic achievement than the students who do not have them.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teachers' Practice as a Marginalization Factor in the Process for Inclusive Education in Cyprus.",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/56639897/JIASE_2007.pdf#page=22",
            "Abstract": "In recent years there is an intense effort around the world for integrating children considered as having special needs in their neighborhood schools. The function of special education in Cyprus has been criticized as failing because it failed to include all children in teaching by providing them with equal opportunities to learning. In this paper, using the interpretive model of research we studied teachers’ practices as a factor of marginalization of certain children, how they marginalize their pupils, and attempted to understand how marginalization, a result of teachers’ practice, works. Through data analysis it indicated that some teachers marginalize children considered as having special needs.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Creating engaging online instruction",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/49997444/Creating_engaging_online_instruction20161030-23436-nu9w7d.pdf",
            "Abstract": "Increased use of technology and the Internet are beginning to blur the line between traditional face-to-face and distance education. Schools of all levels are recognizing the power of the Internet and are exploring ways to make education available to students of all ages. However, one of the criticisms that often come up in discussions of online learning is that it is passive and not as valuable as learning that takes place in face-to-face classrooms. Another criticism of online education is that instruction delivered via text-based computer conferencing lacks the visual and audible cues of communication that are present in face-to-face situations. Therefore, according to critics, online education cannot be as effective and efficient as education offered in face-to-face classroom settings.During this presentation we will illustrate different strategies that can be employed in creating engaging online classes. We will use concrete examples from online classes we developed for high school students as well as for undergraduate and graduate level college audiences. Particular emphasis will be placed on how to transform online learning from “text on the screen” to a powerful engaging and interactive learning experience. Educators and instructional designers need to understand the capabilities and limitations of the web environment and the process that needs to be followed to successfully adapt existing curricula to the online environment.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distance education and distributed learning",
            "Publication year": 2002,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vvsnDwAAQBAJ&oi=fnd&pg=PR7&dq=info:G3NSY4v2A8kJ:scholar.google.com&ots=4WpGU5O3ni&sig=Qq5liv-a8LJ4xwA3uFdcNOavKTQ",
            "Abstract": "Education Network exists today as a department within CAIT serving nearly 100 Illinois K-12 schools and nearly 1000 nationwide. In July 1996, the Illinois Board of Higher Education formally approved the creation of CAIT in the College of Education and Human Services at Western Illinois University. One of CAIT's major goals is to promote the integration of a broad array of advanced information and communication technologies into education and training settings. In 1998, CAIT received an unprecedented third United States Department of Education five-year Star Schools Grant ($9.8 million). In 2000, CAIT received its fourth Star Schools grant ($10 million). These grants position CAIT and the College of Education and Human Services among the leaders in education and applied information technology. One of CAIT's objectives is to conduct and disseminate research on the value and efficacy of using information and communication technologies to improve education and training. CAIT researchers have been conducting research and evaluation on several projects developed and implemented by CAIT. The findings of our work were published in books, journals, and presented at national and international conferences. In an attempt to establish another forum for sharing our findings and making contributions to the body of knowledge in the field of educational technology, we announce a series of volumes titled “Current Perspectives on Applied Information Technologies.” This series will provide a forum for researchers at CAIT and others around the world to share their knowledge and expertise with the general education community. For more …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:ufrVoPGSRksC",
            "Publisher": "IAP"
        },
        {
            "Title": "Preparing teachers to teach with technology. Current perspectives on applied information technologies",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=1590519738037749836&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Information Age"
        },
        {
            "Title": "When computer use is associated with negative science achievement",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64576",
            "Abstract": "One surprising result of the Third International Mathematics and Science Study (TIMSS) is that computer use in the classroom was negatively associated with high student achievement in Cyprus, Hong Kong and the USA. The students from all three countries who indicated that they use computers in the classroom most frequently, were those with the lowest achievement on the TIMSS in 1995. For the purpose of this study, a similar comparison was made for 15-year-old USA students, based on the data from the Program for International Student Assessment (PISA). The results of this study are clearer, however, since they show that it is not computer use itself that has a positive or negative effect on the science achievement of students, but the way in which computers are used. For example in this study, after controlling for the student’s socioeconomic status in the USA, the results indicated that the students who used computers frequently at home including for the purpose of writing papers tended to have higher science achievement. However, the results of this study also show that science achievement was negatively related to the use of certain types of educational software. This indicates a result similar to that found in the TIMSS data, which might reflect the fact that teachers assign the use of the computer and of the educational software to the lower achieving students more frequently, so that these students can obtain more personal and direct feedback through educational software. It should be emphasized that this does not imply that computer use is the cause of the low science achievement for these students.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:yD5IFk8b50cC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Issues of pedagogy and design in e-learning systems",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.968086",
            "Abstract": "The purpose of this paper is to discuss some pedagogical issues surrounding e-learning systems. We have been involved in distance education and e-learning for the last 15 years and developed education and training delivered to a wide range of audiences. Based on our experiences, results from evaluation studies we conducted, and the literature in the field we provide a constructive critique of LMS and discuss some guidelines for future developments of e-learning systems. The emphasis will be on the needs of the online teacher and how these needs can best be supported by the design of appropriate technologies.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Language learning and user-centered design",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=2222312764410657730&hl=en&oi=scholarr",
            "Abstract": "This chapter will discuss the rationale behind the development of the electronic version of the European Language Portfolio (ELP), its technological and pedagogical aspects, and its advantages over print-based counterparts. The electronic European Language Portfolio (e-ELP) has been developed following a user-centered design (UCD) framework. This framework will be discussed in detail. The e-ELP is part of a Minerva project funded by the European Union (EU) with the main goal to adapt the paperbased ELP in an electronic format. Some ELPs have already been validated and edited in a hardcopy format. These hardcopy editions present several limitations, such as maintenance and long-term updating. In this chapter, emphasis will be placed on discussing the affordances of the electronic environment in supporting language teaching and learning and the user-centered approach in developing the prototype.© 2006, Idea Group Inc.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teacher use of ICT: Challenges and opportunities",
            "Publication year": 2010,
            "Publication url": "https://www.lancaster.ac.uk/fss/organisations/netlc/past/nlc2010/abstracts/PDFs/Vrasidas.pdf",
            "Abstract": "This paper presents the summary of findings from large-scale evaluations of ICT-related teacher professional development programs run by the Cyprus Ministry of Education and Culture, the Cyprus Pedagogical Institute, and the Centre for the Advancement of Research and Development in Educational Technology (CARDET). More than eleven thousand teachers participated in professional development programs, which focused among others on computer literacy skills, pedagogical knowledge needed for technology integration, infusing technology-based activities in the curriculum, and online learning. In addition to a large-scale survey conducted, twenty-four case studies were developed in order to examine in depth the effectiveness of teacher professional development and the challenges faced by practicing teachers with respect to the integration of Information and Communication Technologies (ICT) in the curricula. This paper discusses findings from the large scale survey and enriches the findings with qualitative data from the ethnographic case studies to illustrate insights on effective practices of ICT integration in Cyprus education. The findings presented in this paper shed light to the complexities of integrating ICT in teaching and learning. The research reported is the first of its kind to be conducted in the Cyprus context. Findings reveal that teachers are willing to integrate technology into their teaching practices. However, even though they realize the benefits of ICT integration, a lot of teachers today seem resistant to integrating technologies and using online learning environments. Data collected and analyzed, illustrate that this is due to …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing design principles for an e‐learning programme for SME managers to support accelerated learning at the workplace",
            "Publication year": 2005,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/13665620510606788/full/html",
            "Abstract": "This paper reports on the development of a workplace‐based e‐learning programme for small and medium enterprise (SME) managers in five European countries. The course is designed to address the specific needs of SME managers who, it has been noted, represent a significant proportion of the EU workforce but often experience difficulty in finding time or resources to undertake relevant training. The aim of this paper is to present the design principles developed to underpin the programme. These principles were developed specifically to address the need for greater pedagogic structure in the design of e‐learning courses.The course design was informed by a literature review of e‐learning and management learning and by a set of focus groups conducted to identify the specific concerns of SMEs with regard to accelerating their learning in the workplace. The course …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Online professional development for teachers",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TfwnDwAAQBAJ&oi=fnd&pg=PR1&dq=info:65gAp6OjCXUJ:scholar.google.com&ots=QV9SWREGJS&sig=YI-_yn1dXhplqgnqxsaWZFDfXwc",
            "Abstract": "The Center for the Application of Information Technologies (CAIT) began operations in 1988 in the College of Education at Western Illinois University. CAIT's original mission was to provide instructional and in-service resources to Illinois K-12 teachers and students. In July 1996, the Illinois Board of Higher Education chartered CAIT in the Col-lege of Education and Human Services at Western Illinois University. One of CAIT's major goals was to promote the integration of a broad array of advanced information and communication technologies into education and training settings. Also part of this new and expanded mission was to create and foster partnerships between public and private entities. Since 1988, CAIT has received over $45 million in competitive grants and contracts. These grants have positioned CAIT and the College of Education and Human Services among the leaders in education and applied information technology.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:WF5omc3nYNoC",
            "Publisher": "IAP"
        },
        {
            "Title": "Digital alphabet books for early language awareness: the AlphaEU project",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2015.1013326",
            "Abstract": "The Alphabets of Europe (AlphaEU) project focuses on the European Commission’s priority of ‘Promoting early language education.’The project is implemented by CARDET, the International Council for Educational Media and partners from six countries. The project aims to promote the acquisition of multilingual awareness and language skills of preschoolers in various European countries, by developing, piloting, and implementing digital alphabet books and alphabet-related games and interactive activities. Targeted alphabets/languages include: English, German, Greek, Italian, Portuguese, and Romanian. Bringing young children into contact with foreign languages may result in faster language learning, improved mother tongue skills, and better performance in other areas. The Barcelona European Council of March 2002 calls for action ‘to improve the mastery of basic skills, in particular by teaching at least two …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:KxtntwgDAa4C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Unterrichtstechnologien auf zypern und strategien innerhalb der höheren schulbildung",
            "Publication year": 2002,
            "Publication url": "https://pure.unic.ac.cy/en/publications/educational-technology-in-cyprus-and-strategies-for-higher-educat",
            "Abstract": "This paper provides an overview of the status of educational technology in Cyprus. Recent developments and efforts in technology integration in Cyprus public schools and public and private higher education institutions will be presented and discussed. The emphasis of the discussion will be on the vision for establishing Cyprus as a regional education centre with the use of distance learning technologies. Issues such as the need for restructuring the education system to eliminate the lengthy bureaucratic procedures needed for implementing innovations, the need for teacher continuous support and professional development, and the need for evaluating, accrediting and supporting private higher education institutions will be presented. The role of these institutions will be discussed and concrete proposals will be presented on how these institutions can take the lead in establishing technology strategies to shape education in Cyprus and the region. Several of the issues raised and discussed in this article can transfer to other countries and similar contexts. La Technologie de l'Education À Chypre et les Stratégies pour l'Enseignement Supérieur. Cet article propose une vue d'ensemble de la technologie de l'éducation À Chypre. Les développements récents et les efforts dans l'intégration de la technologie À Chypre sont présentés et discutés. L'essentiel À la discussion porte sur l'établissement À Chypre d'un centre régional faisant recours aux technologies d'enseignement À distance. Les problèmes tels que le besoin de restructuer le système éducatif pour éliminer les longues procédures bureaucratiques utilisées pour soutenir les innovations, le …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Evaluating the Learning Effectiveness of Collaborative Problem Solving in Computer-Mediated Settings",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/knowledge-networks-social-software-perspective/25452",
            "Abstract": "here is a growing need for systematic evaluations of computer-supported collaborative learning environments. The present chapter focuses on the evaluation of the learning effectiveness of the interactions that take place in computer-supported problem solving environments. This chapter emphasizes the need for supporting evaluators of such environments with holistic evaluation conceptual frameworks and tools that can facilitate the analysis of data gathered during the evaluation process. We discuss in detail such a holistic framework which has been tested through a primary education case-study.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:blknAaTinKkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Skills and Competencies of Trainers in E-Learning",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/28884/",
            "Abstract": "During the past few years there have been strides in the advancement of technology that make feasible innovative learning possibilities, such as e-learning. In response to this call for documentation of such skills, the aim of this paper is to specify the skills and competencies of e-trainers in e-learning as well as to create a questionnaire that could help in systematically diagnosing a trainer’s existing skills and competencies. This is significant given the need to prepare educators and instructional designers to act as online trainers and deliver instruction via e-learning. The target audience of this paper is teachers/trainers in colleges/Universities and in Vocational Educational training organizations (VET) organizations and, in general, organizations that offer, as a part of their business or for internal use, training services.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:RGFaLdJalmkC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Reflections on the Application of a Gamified Environment to Foster Young​​ Learners’ Digital Competencies",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-76986-4_11",
            "Abstract": "The interest in game-based learning (GBL) is continuously growing worldwide. This chapter sheds light on the design and development of a smart learning environment in the context of digital citizenship to promote smart pedagogy. A compendium of terms, definitions, and key concepts is provided. It aims to reflect on the potential of DRC-Heroes’ application to cultivate young learners’ digital competencies through an attractive educational setting. The five digital competencies of the European Digital Competence Framework (DigComp) were gamified to develop the proposed game, including essential gamification elements. Overall, students and teachers valued the user-friendly and stimulating environment of the application by reporting on authentic problem-based scenarios, ease of use, real time, and real-time feedback that stimulates learners’ engagement. It foresees to inspire primary school teachers …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The e-Reflect Project: Empowering pupils to become change agents",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Vasilios-Zorbas/publication/323535556_Identity_in_Times_of_Crisis_Globalization_and_Diversity_Practice_and_Research_Trends/links/5a9aa50caca2721e3f2f4190/Identity-in-Times-of-Crisis-Globalization-and-Diversity-Practice-and-Research-Trends.pdf#page=371",
            "Abstract": "In times of national, European and world crises on environmental, financial, societal and political levels, the e-Reflect project brings together teachers from all over Europe to collaborate and jointly design educational interventions focusing on empowering school children to fully participate in society change initiatives. The e-Reflect project is an Erasmus+ project, which embraces the European Commission's invitation towards Member States to push forward educational reforms in adult learning. Through the agency of a school (1st Primary School of Rafina-Greece), Higher Education institutions (Bath Spa University-UK, Turku University-Finland, Aegean University-Greece), and a European NGO (Centre for the Advancement of Research and Development in Educational Technology-Cyprus), the e-Reflect project seeks to develop and implement a high quality continuing professional development e-course, fusing design thinking and multi-literacies to stimulate active citizenship education for teachers and professionals working with children. The e-course focuses on introducing school educators to a rich technological environment for the implementation of the Reflect Approach in contemporary school settings, stimulating a structured, democratic and participative learning process, which draws upon the need for reflect and action for social change. Preliminary data of the e-course evaluation are presented.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acquiring experience in pathology predominantly from what you see, not from what you read: The HIPON e-learning platform",
            "Publication year": 2015,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4467664/",
            "Abstract": "It is indisputable that nowadays one of the hardest and most important tasks in medicine and especially in medical education, is the conversion of the extensive amount of available data, into medical experience, after a proper analysis. A project under the title “ICT (Information and Communication Technology) eModules on HistoPathology: a useful online tool for students, researchers and professionals–HIPON”, co-financed by the Lifelong Learning Program of the Education, Audiovisual and Culture Executive Agency (EACEA), The Commission of the European Union, has been launched at the beginning of 2013. HIPON’s purpose is not to provide just another pathology website atlas, but to convey professional experience and thinking in pathology. HIPON has resulted in a well-structured and user-friendly, open resource, multi-language, e-learning platform which, taking advantage of modern image technology …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:p2g8aNsByqUC",
            "Publisher": "Dove Press"
        },
        {
            "Title": "Principles of pedagogy and evaluation for web-based learning",
            "Publication year": 2000,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/095239800410405",
            "Abstract": "The authors have designed a number of courses at Arizona State University, which were delivered on the internet and supported with computer conferencing software. In this paper the authors will present an online course, discuss issues relating to online learning environments, reflect on their experiences from teaching online and discuss the findings of the course evaluation. Emphasis of the discussion will be on the pedagogical principles for effective teaching and evaluation of learning in an online environment.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Theoretical foundations of learning environments",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2012.703429",
            "Abstract": "Theoretical foundations of learning environments provides students, faculty, and instructional designers with an introduction to the major pedagogical and psychological theories and their implications for the design of new learning environments. The application of these theories can be of great help across contexts including k-12 education, higher education, and professional education. The 13 chapters of the book are written by experts in their respective areas who present in detail the most important contemporary theories that form the foundation of the conception and design of student-centered learning environments and applications of e-learning. During the last three decades, there has been an increased interest in studentcentered learning, constructivist, and related theories. The view of learning has changed from the simple traditional transmissive view to a view of learning that is more social, conversational …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Routledge"
        },
        {
            "Title": "The Digital European Language Portfolio",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/49997450/proposal.pdf",
            "Abstract": "The digital European Language Portfolio (ELP) is part of a Minerva project funded by the EU with main goal to adapt the ELP in an electronic format. Recent EU policies promote the language teaching and learning as a key element for European integration and mobility. EU underlines the necessity of a sort of language passport, called European Language Portfolio-ELP, which would be a personal document of the European citizen illustrating a detailed picture of all his/her language experiences and certifications. So far some ELPs has been validated and edited in a hardcopy format. These hardcopy editions present several limitations such as maintenance and long term updating. This paper will discuss the rationale behind the development of the digital version of the ELP, its technological and pedagogical aspects, and its advantages over print-based counterparts. Prototype examples of the digital ELP will be presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICT as a tool for environmental education, peace, and reconciliation",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523980701295125",
            "Abstract": "In this paper we describe a project that emanates from a conception of environmental education as peace education and utilizes ICT as a tool for bringing communities together and enriching ways of communication. We present the theoretical framework of the project, the dilemmas of peace education in light of the conflict in Cyprus, and then reflect on the lessons learned from the use of technology as a tool to address issues relating to environmental education and peace. We argue that such efforts are of particular importance because they aim at legitimizing a process of ongoing interaction. Thus, issues of interpersonal friendships, general beliefs in peace, and attitude change assume an interesting role in establishing communication channels that eventually aim at acknowledging each other’s collective narratives. The obstacles on the road to peace in Cyprus are numerous; however, through the critical use of …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Theoretical foundations of social computing and virtual communities",
            "Publication year": 2009,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420090437-6/theoretical-foundations-social-computing-virtual-communities-charalambos-vrasidas-george-veletsianos",
            "Abstract": "Using a symbolic interactionist framework, interaction is defined as the reciprocal actions of two or more actors within a given context (Vrasidas and Glass, 2002). Interaction is an ongoing process that resides in a context and also creates context. Context is crucial in examining human activity in a sociotechnological environment. Context is provided by the history of the situation, past interaction sequences, and the anticipation of future interaction sequences. There is a reflexive relationship between context and interaction that prevents us from isolating the two. To examine human activity, it is important to carefully study the context and the moment-to-moment events that lead to further interaction among people. Human beings are active, meaning-making living organisms. Social interaction is an ongoing process that shapes human conduct as actors fit their actions with one another and form a continuous flow of …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Acquiring diagnostic experience in placenta pathology through HIPON web course",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031302516314180",
            "Abstract": "The correct evaluation of microscopic features, a mandatory step for the correct pathologic diagnosis, reflects professional experience well worth acquiring by trainees in Pathology. This is the target of HIPON, a project co-financed by the Lifelong Learning Program of the EACEA, EU Commission.We present our educational strategy as already implemented on the HIPON online chapter of placenta pathology. The diagnoses and differential diagnoses of representative cases of vascular and inflammatory placenta diseases are analysed step by step through microscopic images. A virtual slide of a placenta section with typical maternal and fetal vascular changes is available to the user.After becoming familiar with the principles of placental pathology, the user learns to identify the basic entities related to vascular and inflammatory placental disease. This knowledge is consolidated by an image …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:abG-DnoFyZgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Teachers’ struggles to use technology in career magnet schools",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64499",
            "Abstract": "Do teachers expect the learning environment to change in response to new technology? Or do they expect the technology to adapt to their routine classroom practices? Or is it a combination of both? Underlying these questions are teachers’ views of what they teach and how it should be taught. This paper discusses our work with a group of teachers at a Mid-western, suburban vocational school to implement a computer-based approach in teaching integrated curricular units. We examined the ways in which technology was used to help enhance instruction in the core areas of mathematics and science within career-centered classrooms. We found that teachers were reluctant to change their curricula and instead expected technology to adapt to their current teaching methods. These teaching methods reflected a static view of curriculum and the learning environment. Data were collected from interviews, email, and classroom observations of three teachers. We discuss the complex interactions among teacher attitudes, core content, technology, and career concerns that curriculum developers may face while engaging in technology-based reform efforts.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:SP6oXDckpogC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Systematic approach for designing hypermedia environments for teaching and learning",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/49997430/hypermedia.pdf",
            "Abstract": "This paper will present a systematic approach for designing hypermedia environments for online learning. First, I will discuss distance education, online courses, and general considerations for designing online learning environments. Second, I will present the history and definition of hypermedia, its attributes, and theoretical background. Third, I will present and discuss a systems approach to developing hypermedia to be used as part of courses and learning environments delivered on the World Wide Web. Issues relating to structuring of the information, branching and interactivity, user interface, and navigation will be discussed in detail.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:lSLTfruPkqcC",
            "Publisher": "Westwood Press, Inc."
        },
        {
            "Title": "Making the familiar strange-and interesting-again: Interpretivism and symbolic interactionism in educational technology research",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/49997471/Making_the_familiar_strange-and_interest20161031-1037-12brimy.pdf",
            "Abstract": "The purpose of this chapter is to discuss the methodological and theoretical assumptions of interpretive research as proposed by Erickson (1986), based on the premises that Blumer (1969) posed for symbolic interactionism. A specific example of a conceptual framework for studying the major theoretical constructs identified in distance education research will be presented. Although this framework was initially developed for studying distance education and online learning environments, methodological and theoretical assumptions will be discussed as they relate to the general field of educational technology. Issues such as the kinds of research questions that are appropriate for interpretive research and the possible goals of inquiry will be discussed in detail and concrete examples will be presented. The emphasis of the discussion will be on the interplay among the researcher’s conceptual framework, role, data collection procedures, data analysis, and issues of validity, reliability, and generalizability.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applying a multiple intelligences instructional design framework in the delivery of health and safety learning in construction",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=12387907240771046110&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "EDITORIAL E-Learning Machines",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=6626330468393817890&hl=en&oi=scholarr",
            "Abstract": "I am delighted to write this editorial for the inaugural issue of E-Learning. It is an exciting first issue with articles from a range of experts who analyse and discuss in critical and constructive terms some fundamental aspects of e-learning–a concept whose time has come. Yet it has passed almost silently into the language of education without much critical thought. It is as though the addition of ‘e’–with a hyphen–indicates simply a change of medium as though it was ‘business as usual’, except we experience the substitution of an electronic medium for classroom ‘talk’or other structured educational media instruction. It was Marshall McLuhan, the Canadian media philosopher, who first taught us to look at the deep structure of media when he stated ‘the medium is the message’, the title of his famous book, later changing it to The Medium is the Massage (McLuhan, 1967). McLuhan, we must remember was educated at …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EmpowerICT: In-Service Teacher's Learning to Teach with Technology",
            "Publication year": 2005,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=5823301",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:J-pR_7NvFogC",
            "Publisher": "Assumption University"
        },
        {
            "Title": "Studi sul portfolio europeo delle lingue digitale: contributi alla giornata di studio Portfolio europeo delle lingue digitale: proposte e prospettive: Università degli studi di Milano, 28 gennaio 2005",
            "Publication year": 2005,
            "Publication url": "https://www.torrossa.com/gs/resourceProxy?an=4742324&publisher=FM4862",
            "Abstract": "Developments in new technologies and their affordances require that educators rethink their fundamental assumptions about teaching and learning (Vrasidas & Glass, 2002a). Technology affordances played a major role in reshaping teaching and assessment and have revolutionized the use of portfolios as a pedagogical, reflective, and assessment tool (Mason, 2002; Vrasidas & Glass, 2004). International organizations such as the International Society for Technology in Education, UNESCO, and the European Commission (EC), have established guides, plans, and standards for the use of technology in education and training. In light of these developments brought about by rapid technology growth and use in education, the digital European Language Portfolio (e-ELP) was developed to examine the ways in which technology can support reflection and language learning. One of the main objectives of this project is …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:_B80troHkn4C",
            "Publisher": "LED"
        },
        {
            "Title": "Preparing teachers to teach with technology",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=RfonDwAAQBAJ&oi=fnd&pg=PR7&dq=info:MIfIil75zP8J:scholar.google.com&ots=i7Fggr-Joq&sig=pc_sADihQ3P6Askd-x-Nu3ZboZM",
            "Abstract": "Teacher preparation programs in the United States and around the world have finally begun to address this deficiency in their programs. The realization that technology is a powerful driving force in education coupled with a renewed emphasis on teacher preparation by governments have resulted in some dramatic changes in teacher preparation programs. I believe that we have just begun to see changes in teacher preparation and that the pace of change will continue to accelerate. This volume covers some of the more exciting developments in the field, including the emergence of wireless computing in the classroom and the preparation of teachers in an online environment. In short, I am optimistic. For those of you who are also in the field, I think you will agree. For those who are just entering the field, this book is a great place to start as you change education. Finally, while this book is the last book of the three part series that we at CAIT conceptualized with Charalambos Vrasidas and Gene Glass, it is also the beginning of a new relationship. We are excited to join with a new partner, CARDET, to present this book. Over many years in the education and R&D field, I have come to realize the value of partnerships and relationships. I want to thank both Charalambos and Gene for making this series a reality and such a success. We are looking forward to working with them and CARDET in the near future.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IAP"
        },
        {
            "Title": "Teacher professional development",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TfwnDwAAQBAJ&oi=fnd&pg=PA1&dq=info:Pl1vfmu2YBQJ:scholar.google.com&ots=QV9SWREGJT&sig=Chs5GHM1Y8BRARNgGvpsXb8fx54",
            "Abstract": "Recent education reform efforts have emphasized teacher professional development and continuing education, and it is widely accepted that a teacher's development spans an entire career (McIntyre & Byrd, 1998). Among the forces driving a renewed interest in teacher professional development are the use of technology for teaching and learning, a shift of pedagogical approaches toward constructivism, an emphasis on standardsdriven education, and systems thinking as it applies to career-long teacher education (Means, 1994; Sparks & Hirsh, 1997).",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The design, development, and implementation of LUDA Virtual High School",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1300/J025v20n03_03",
            "Abstract": "The purpose of this paper is to present the Large Unit District Association virtual high school (LUDA-VHS) project and discuss its design, development, and implementation. A model developed at the Center for the Application of Information Technologies for designing online classes will be presented and discussed. The focus of the paper will be to present the lessons learned and provide practical recommendations on how to design successful online programs. Issues to be discussed include the following: recruiting, training, and compensating teachers; selecting and supporting students; developing instructional strategies for online learning; building a sense of community; educating the public on the benefits of online education; providing equal access; building quality assurance mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Height Safety Training using Virtual Classes. 8th BuHu International Postgraduate Research Conference, 29th-30th January 2009, Prague, Czech Republic. University of Salford",
            "Publication year": 2008,
            "Publication url": "https://repository.wit.ie/1043/",
            "Abstract": "In the 2006 construction and housing in Ireland report from the central statistics office revealed that 280,000 people worked in the construction sector. This represents 13% of total employment and is the highest in the European Union. The same report identifies the construction sector as containing the highest rate of fatalities accounting for one third of all work place related deaths. As a result, it is imperative to address health and safety issues in the construction sector. The research looks at providing innovative health and safety training through virtual classes that apply the principles of multiple intelligence (MI). It is proposed that two phases of virtual classes are developed, focusing on the risk of falls from height in the construction sector. These phases will be deployed using an action research approach to further refine and develop each phase. The use of a virtual classroom environment and the application of MI theory represent unique opportunities and challenges. Based on a literature review of current best practice in virtual classes, a survey has been developed to focus on understanding and measuring the user experience, and relating this to student usage of the system as a whole. It is anticipated that the framework developed for these virtual classes as well as the research findings will be hosted on a dedicated website. The website will act as a repository for developed content and virtual classes, as well as facilitating dissemination of the project outcomes. The outcome of the research is the development of an educational resource using MI theory that is directly focused on health and safety in the construction industry.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The rhetoric of reform and teachers' use of ICT",
            "Publication year": 2015,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/bjet.12149",
            "Abstract": "During the last two decades, the Cyprus Education System has been undergoing systematic reform efforts. Within the spirit of change, efforts have been made to equip all public schools with computers and provide them with access to the internet. Compared with other European Union countries, Cyprus infrastructure is one of the most developed. However, as our research shows, the adoption of technology does not match the rhetoric of reform that dominates education discourse. In order to examine the challenges and opportunities primary school teachers face in efforts to integrate technology in the classroom, four in‐depth case studies of schools were developed and a large scale survey was conducted across public schools. This paper discusses the method, the design and the results from our research, drawing on both survey findings and rich qualitative data. Theoretical discussions provide further empirical …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "OF NOMADS, POLYGLOTS, AND GLOBAL VILLAGERS",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=16852554486271434164&hl=en&oi=scholarr",
            "Abstract": "In this chapter, we discuss the reciprocal relationships among the forces of globalization, information technologies, and education, and we critically examine the role of distance education in. the 21st century. We argue that",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IAP"
        },
        {
            "Title": "Using on-line technologies and handhelds to scaffold students’ argumentation in science",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/29097/",
            "Abstract": "The purpose of this paper is to present an innovative research project, Technoskepsi, that is using both on-line technologies and handheld computers in order to scaffold students while they work in groups, both indoors and outdoors, to construct arguments. Firstly we describe the technologies used in Technoskepsi, and the theoretical underpinnings that have guided the design of the project. Finally we describe the learning environment, presenting some of the activities and providing screenshots. The project will be implemented with 28, 10-12 year students early in January, and preliminary results from the implementation will be available at the presentation. However it is important to note that our research efforts are focused on addressing current gaps in the literature of mobile learning by exemplifying the theoretical aspects of design frameworks associated with mobile science learning, and characterizing the …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "HIPON Project: Acquiring Medical Experience through an E-learning Platform. A New Perspective in Pathology Education",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=hoftCgAAQBAJ&oi=fnd&pg=PA197&dq=info:PL8kBJOgiUwJ:scholar.google.com&ots=Ylw89i_lfq&sig=qXQ3C-Jjrw_-7eZf36_hf588Phk",
            "Abstract": "Pathology is a major field in modern medicine; it is linked with a number of distinct but inter-related medical specialties which diagnose diseases mostly through the analysis of biological samples. The pathologist’s interpretation of a biopsy is critical to establish the final diagnosis and therefore to estimate patients’ prognosis and best treatment. In the immense field of modern pathology, an extensive amount of data is available; as many practical skills as possible are requested to be developed by future or present medical professionals. It is a common idea that achieving excellence in students once they enter clinical medicine practice, poses a challenge in education [1]. To achieve this goal in medical education, the prospect of illustrating professional experience through an e-learning toolkit is here proposed as a new teaching strategy. An educational project on histopathology entitled “ICT e Modules on HistoPathology: a useful online tool for students, researchers and professionals–HIPON”, co-financed as a Key activity 3/ICT project of the Lifelong Learning Program of the European Commission Education, Audiovisual and Culture Executive Agency (EACEA)(Reference Number: 531203-LLP-1-2012-1-GR-KA3-KA3MP) has been launched at the beginning of 2013.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:UxriW0iASnsC",
            "Publisher": "libreriauniversitaria. it Edizioni"
        },
        {
            "Title": "Why Don't Teachers Adopt Technology",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=7733123789617039234&hl=en&oi=scholarr",
            "Abstract": "The Republic of Cyprus, an EU member state since 2004, spends approximately 7 percent of its GDP on education, the third-largest amount of education spending in the European Union (Denmark and Sweden are first and second, respectively).quote from article Cyprus is a small island in the Mediterranean. Following an invasion and occupation of the island by the Turkish Armed Forces in 1974, the jurisdiction of the Republic, including its public education system, is confined to the southern 60 percent of the island, populated by approximately 750,000 Greek-speaking Cypriots, many of whom also speak English.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Language learning and user-centered design: The development of the electronic European language portfolio",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/user-centered-computer-aided-language/30653",
            "Abstract": "This chapter will discuss the rationale behind the development of the electronic versionof the European Language Portfolio (ELP), its technological and pedagogical aspects, and its advantages over print-based counterparts. The electronic European LanguagePortfolio (e-ELP) has been developed following a user-centered design (UCD) framework. This framework will be discussed in detail. The e-ELP is part of a Minervaproject funded by the European Union (EU) with the main goal to adapt the paper-based ELP in an electronic format. Some ELPs have already been validated and editedin a hardcopy format. These hardcopy editions present several limitations, such asmaintenance and long-term updating. In this chapter, emphasis will be placed ondiscussing the affordances of the electronic environment in supporting languageteaching and learning and the user-centered approach in developing the prototype.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Kids and credibility: an empirical examination of youth, digital media use, and information credibility",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2012.703433",
            "Abstract": "Children today are born and nurtured in a highly technological environment. They play games and surf the Internet like never before. One of the key driving questions of this publication was “how well do children navigate the ocean of information that is available online?” Debates over the information available on the Internet often focus on its accuracy and credibility. The vast amount of online resources available today represents both opportunities and challenges for Internet-savvy kids. However, how do kids perceive the credibility of these resources? This book reports on the first large-scale survey to examine children’s online information-seeking strategies and their beliefs about the credibility of that information. Data were collected using a web-based survey of 2747 children, aged 11–18 (and their parents). The research confirms children’s heavy reliance on the Internet. The majority of children begin using the …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Analysing interaction behaviour in network supported collaborative learning environments: a holistic approach",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2007.016705",
            "Abstract": "In a Network Supported Collaborative Learning (NSCL) environment, the teacher needs to be able to conduct a similar analysis and learner evaluation as in traditional settings. However, recording, analysing and interpreting learners' interactions during a NSCL process is an open research issue. This paper proposes a conceptual framework for interaction analysis which is accompanied by a set of evaluation techniques such as descriptive statistics, log file analysis and social network analysis. Our main goal is the in-depth understanding of the nature of learners' interactions within NSCL environments in order to help teachers get a holistic picture of the learning process. We applied the proposed framework in a pilot study where primary school children attended a NSCL course on Mathematics in order to augment their self-regulative problem-solving skills. The findings from this study seem promising while at the …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Flow and the pedagogical affordances of computer games: a case study",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2015.1101223",
            "Abstract": "Drawing on the theories of symbolic interactionism, social constructivism, and flow, this research examines the integration of the electronic game of the World Food Programme of the UN “Food Force” in a unit on active citizenship and poverty eradication. The research was conducted in two ninth-grade classes of an urban high school in Cyprus. Data were collected from interviews with students and teachers (before and after the implementation), observations in the classroom, the reflective diary of the researcher, and two questionnaires for the students (before and after the implementation). Data analysis showed, among others, that the integration of the game reinforced the active participation of students in the course by evoking their interest and the creation of a “flow” state while using the game. Moreover, the game emerged as a tool for constructing an engaging learning experience through the interactions it …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:738O_yMBCRsC",
            "Publisher": "Routledge"
        },
        {
            "Title": "ICT for development: Challenges and possibilities",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=15105915793152107869&hl=en&oi=scholarr",
            "Abstract": "In recent years there has been an increased interest in exploring the role of Information Communication Technologies (ICTs) in education in relation to development and social justice. Issues such as human rights, the eradication of poverty, freedom of speech, and equality are continuing discourses among international organizations, scholars, governments, and activists. Social and economic inequalities and injustices are evident in all countries, in all spheres of life. According to UN reports, we live longer than ever, and yet, life expectancy statistics show major differences from country to country. Poverty, famine, disease, and climate change are causing irreparable harm across the developing world. Although discussions of the use of ICTs for education reflect mixed sentiments among supporters and critics,",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile Games for Negotiated-Play and Decision-Making in Health Literacy.",
            "Publication year": 2020,
            "Publication url": "https://eric.ed.gov/?id=EJ1272175",
            "Abstract": "The purpose of this qualitative case study study is to examine the ways in which mobile videogames can be used in non-formal educational environments, to support students to develop decision-making skills through negotiated play. In the context of this study, the health literacy mobile videogame, PlayForward: Elm City Stories developed at Yale University was implemented in an afterschool setting in southern Europe. In this study we explored how secondary school students negotiate meaning, make decisions, and interpret the consequences in a non-formal education context, through an interpretive symbolic-interactive framework. The data included individual interviews with students, field-notes, and video-based student-groups’ interactions. These were analyzed with the use of open coding techniques. The analysis of the data resulted in the following three assertions:(a) The technical affordances of the game such as sound, usability, rating system, and visuals, are vital features that defined the quality of play and learning experience;(b) The narrative of the game guided the learning game-play experience of the students; and,(c) Students perceived that their engagement in the game facilitated their collaboration and decision-making. These are discussed alongside recommendations for game design for supporting negotiated play and decision-making.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Modestum. No: 1 Windrush Road, Hilton Derbyshire, DE65 5LB, UK"
        },
        {
            "Title": "EmpowerICT: eLearning for in-service teacher education and support",
            "Publication year": 2004,
            "Publication url": "http://www.ijcim.th.org/past_editions/2004V12N2(SP)/pdf/p81-86-vrasidas-EmpowerICT.pdf",
            "Abstract": "The goal of this paper is to discuss the theoretical framework behind empowerICTTM. EmpowerICTTM is a professional development program that focuses on integrating ICT in teaching and learning in primary and secondary education. It consists of teacher training modules, support documents, suggested activities integrating ICT in education, outcomes based assessment, an online portal, and ongoing support. The vision behind this project is to develop a community of teachers integrating ICT in their classrooms in which they will share expertise and support each other in the Asia Pacific region. The project has been launched as a pilot in Thailand and Philippines in collaboration with the local Ministries of Education.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Concepts to consider when studying computer-mediated communication and online learning",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-38076-0_16",
            "Abstract": "This paper presents a conceptual framework for studying interaction in online environments. The theoretical underpinnings of the framework will be presented as well as the results from studies that led to the development and refinement of the framework will be discussed. This framework is based on symbolic interactionist ideas and extensive research in the areas of computer-mediated communication and distance education. The framework consists of the following categories: context, learner control, social presence, structure, feedback, dialogue, and interaction. The categories of the conceptual framework are characterized by a reciprocal determinism, and they are all parts of a broader system. The implications of this framework and the research that will be presented will be discussed in detail as they relate to the design and study of on- line learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Factors influencing interaction in on online course",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9724342892203259097&hl=en&oi=scholarr",
            "Abstract": "This study examines the nature of interaction in an online course from both teacher and student perspectives. Major components of a conceptual framework to identify interaction were identified. Data analysis suggested that the structure of the course, class size, feedback, and prior experience with computer-mediated communication all influenced interaction.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Pennsylvania State University"
        },
        {
            "Title": "Can computer use hurt science achievement? The USA results from PISA",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1025093225753",
            "Abstract": "A surprising result of the Third International Mathematics and Science Study (TIMSS) is that computer use was negatively associated with high student achievement in some countries. More specifically, the students from all three countries who indicated that they use computers in the classroom most frequently were those with the lowest achievement on the TIMSS in 1995. For the purpose of this study, a similar comparison was made for 15-year-old U.S.A. students, based on the data from the Program for International Student Assessment (PISA). The results of this study show that it is not computer use itself that has a positive or negative effect on the science achievement of students, but the way in which computers are used. For example, after controlling for the student's socioeconomic status in the United States of America, the results indicated that the students who used computers frequently at home …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "Telecommunications technologies and Curriculum development: the case of a virtual High school project",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64565",
            "Abstract": "In this paper we present the lessons we learned from developing online classes for a virtual high school (LUDAVHS) project and discuss the implications for teaching science using telecommunication technologies. Emphasis will be placed on presenting an online Health Education class, the model and process followed for developing the class, and briefly discuss implications for policy and curriculum development.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:P5F9QuxV20EC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Reflections on policy and practice of inclusive education in pre‐primary schools in Cyprus",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08856250410001678496",
            "Abstract": "In July 1999 the House of Parliament in Cyprus passed the Education Act for Children with Special Needs, according to which all children have the right to be educated in their neighbouring regular school together with their age‐mates. An important component of this law is that it introduces, for the first time, inclusive education into pre‐primary education. A child can be considered as having special needs only when he/she has attained the age of 3 years or older. The purpose of this paper is to examine how the policy of inclusive education is implemented in pre‐primary schools in Cyprus, to investigate whether some children are still marginalized (after the implementation of the new law) and, if they are, to identify factors influencing marginalization or acting as a barrier to inclusion. We also briefly present the results from a study we conducted that supports the discussion of the issues raised in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:UebtZRa9Y70C",
            "Publisher": "Taylor and Francis Ltd"
        },
        {
            "Title": "Using educational design research methods to examine the affordances of online games for teacher learning",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2013.839151",
            "Abstract": "The purpose of this research was to examine the affordances and opportunities from using online games in teacher professional development. Following an educational design research approach, we developed an environment to provide opportunities for in-service teachers to engage in-game-based activities. Our work presented in this manuscript was of exploratory nature. The basic questions that guided our inquiry were as follows: (1) What affordances do online game environments provide for teacher professional development? (2) What opportunities and challenges arise from the implementation of games for teacher learning? Data were collected from online design sessions, semi-structured interviews with all participants, online and face-to-face observations, focus group discussions, and artifact review. Findings showed that online games provide great opportunities for learner engagement and teacher …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:rO6llkc54NcC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Yearbook of the National Society for the Study of Education. Volume 106, Issue 2",
            "Publication year": 2007,
            "Publication url": "https://www.learntechlib.org/p/68414/",
            "Abstract": "There is little dispute that technology has transformed people's everyday lives. People shop online, download news in their iPods, communicate via text and video, take digital photos, and conduct all manner of personal and professional business via the Internet. While these technologies have afforded new opportunities to improve efficiency, exponentially increase access to information, and expand the notion of global citizenship, they have also caused many researchers and educators to rethink what it means to be literate in this post-typographic world. It is not enough for citizens in the 21st century to know how to decode and comprehend information as they have in the past. They are also now responsible for efficiently and effectively finding and evaluating information as well as quickly adapting personal learning goals in response to the varied structures and complexities of these technology-enhanced …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Challenges to delivering safety training through virtual classes",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Lucile-Chanquoy/publication/266460465_Challenges_to_delivering_safety_training_through_virtual_classes/links/54d31fe20cf2501791817272/Challenges-to-delivering-safety-training-through-virtual-classes.pdf",
            "Abstract": "In the 2006 construction and housing in Ireland report from the central statistics office revealed that 280,000 people worked in the construction sector. This represents 13% of total employment and is the highest in the European Union. The same report identifies the construction sector as containing the highest rate of fatalities accounting for one third of all work place related deaths. As a result, it is imperative to address health and safety issues in the construction sector. The research looks at providing innovative health and safety training through virtual classes that apply the principles of multiple intelligence (MI). It is proposed that two phases of virtual classes are developed, focusing on the risk of falls from height in the construction sector. These phases will be deployed using an action research approach to further refine and develop each phase. The use of a virtual classroom environment and the application of MI theory represent unique opportunities and challenges. Based on a literature review of current best practice in virtual classes, a survey has been developed to focus on understanding and measuring the user experience, and relating this to student usage of the system as a whole. It is anticipated that the framework developed for these virtual classes as well as the research findings will be hosted on a dedicated website. The website will act as a repository for developed content and virtual classes, as well as facilitating dissemination of the project outcomes. The outcome of the research is the development of an educational resource using MI theory that is directly focused on health and safety in the construction industry.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating technology in teaching and teacher education: Implications for policy and curriculum reform",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523980110041944",
            "Abstract": "This paper discusses technology integration in teaching and teacher education. Emphasis is placed on policy and curriculum reform as they relate to the use of information technologies for teacher education. Particular reference is made to the situation in Cyprus public schools. It is argued that for successful technology integration, there needs to be a shift in pedagogical approaches and reform of teacher education programmes. Concluding, suggestions are provided on how information technologies can best be integrated in pre-service teacher education and in-service teacher professional development. Intégration des technologies dans l’enseignement et la formation des enseignants: quelles implications",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Levinas and the “inter‐face”: The ethical challenge of online education",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1741-5446.2005.0005a.x",
            "Abstract": "The capacity of online education to produce learning environments that are supportive of hybrid identities, complex discourses, and multiple relations among learners raises questions about the ethical response of online educators. To investigate the ethics of online education, we discuss two questions: How are identity and communication constituted in online education? What are the features of an ethical pedagogy in online education? Such questions help us think in alternative ways about the ethical dimensions of online education. We argue that Emmanuel Levinas's views on ethics and otherness can overcome some of the ethical challenges inherent in online education by helping educators and learners become more aware of how they respond to the Other and consider their ethical responsibility to the Other's multiple and complex identities. An ethical pedagogy for online education that takes seriously the …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Blackwell Publishing Ltd/Inc."
        },
        {
            "Title": "Technological nature: adaptation and the future of human life",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/09523987.2012.703431",
            "Abstract": "Our ancestors had a close connection with the natural world. Nowadays we are increasingly experiencing technological nature. Children and youth grow up digital; they use mobile devices, play games, and watch television for several hours a day. They spend hours in virtual worlds exploring and interacting with avatars and peers from around the world. Peter Kahn argues that the fact that the majority of our interaction is mediated with technology, impacts our experience and our well-being. He draws from a series of studies his team conducted over a period of seven years during which they investigated the ways in which children and adults experience different kinds of technological nature.His research team installed “technological nature windows”(50 ″plasma screens showing high-definition broadcasts of real-time local nature views) in offices on his university campus and assessed the physiological and …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Learning how to become a more effective SME manager–design principles for a work-based e-learning course",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12728568818639972285&hl=en&oi=scholarr",
            "Abstract": "This paper reports how previous research is being used to develop an e-learning course aimed at improving the learning capability of SME managers. The course has been designed at a time when SME managers are experiencing considerable performance pressures which impose time constraints on engagement in formal training processes. Some managers engage less in management development than their counterparts in larger organisations. E-learning, despite presenting the possibility of just-in-time training at any time and in any place, will not readily engage SME managers unless much care and attention is given to design.Based on a review of literature supported by focus groups, this paper presents the key issues identified by the project team in gaining the commitment of SME managers to the e-learning process, the background research which has informed the course design and the rationale being …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Promises of electronic forms of data representation and scholarly publication",
            "Publication year": 2000,
            "Publication url": "https://www.tcrecord.org/books/Content.asp?ContentID=10546",
            "Abstract": "The first scholarly journal, Journal des sçavans, appeared in January 1665 in France. A few months later the same year, the second scholarly journal came into being, the Philosophical Transactions of the Royal Society in England (Gaines, 1996; Guédon, 1996). Since the conception of paper scholarly journals, very little has changed about the way researchers and scientists report their work. As Glass (1999) argued,\" a reader in the year 2000 browsing a scientific journal from the year 1910 will find the environs thoroughly familiar.\"Paper journals have been used for scholarly communication and research reporting. Nevertheless, because of the delays in publishing and the exponential growth of knowledge and information, paper journals have become ineffective in promoting communication among the academic community. Interaction among scholars rarely takes place via paper journals.",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IMPLEMENTATION OF EXPERIENTIAL LEARNING IN HISTOPATHOLOGY AND CYTOPATHOLOGY: THE HIPON E-LEARNING PLATFORM",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=16526744544637656236&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "bcAshfkAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Innovative Construction Manager Training: A case study",
            "Publication year": 2007,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01130400/",
            "Abstract": "Université Paris 8 - Innovative Construction Manager Training: A case study Accéder \ndirectement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL \nHALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org \nEpisciences.org Revues Documentation Sciencesconf.org Support Université Paris 8 HAL - \nhal.archives-ouvertes.fr Accueil Dépôt Consultation Par auteur Par laboratoire Par année de \npublication Par type de publication Par domaine Par collection Recherche Tutoriels Qu'est-ce \nque HAL ? FAQ Questions juridiques liées au dépôt Comment déposer un fichier dans HAL ? \nComment ajouter le texte intégral à une notice existante ? Quelles métadonnées renseigner \npar type de document ? Comment saisir les données auteur(s) et les affiliations ? Comment \ncréer son IdHAL ? Documentation HAL hal-01130400, version 1 Communication dans un : …",
            "Abstract entirety": 0,
            "Author pub id": "bcAshfkAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        }
    ]
}]