[{
    "name": "Dimitri  Ioannou",
    "romanize name": "Dimitri  Ioannou",
    "School-Department": "ECE ",
    "University": "George Mason University, VA, USA",
    "Rank": "Καθηγητής",
    "Apella_id": 5548,
    "Scholar name": "Dimitris Ioannou",
    "Scholar id": "MP4yuEAAAAAJ",
    "Affiliation": "Professor of Electrical Engineering, George Mason University",
    "Citedby": 2563,
    "Interests": [
        "Semiconductors"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=MP4yuEAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "High-Performance Molecular FLASH Memory With Redox-Active Molecules",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2013-02/27/2017/meta",
            "Abstract": "The dimensional scaling of microelectronics to improve the performance of the central process unit (CPU) is facing fundamental and physical challenges. The current solution is to increase the cache memory–static random access memory (SRAM).[1] However, this will decrease CPU information throughput because SRAM is volatile and occupies a large floor space. Therefore, developing high-performance non-volatile memory as local memory in CPU will bring a revolutionary impact to microelectronics which increasingly demands stand-alone and embedded memory for portable electronics.[1] Floating-gate non-volatile memory (NVM) is compatible with CMOS integration. However, the traditional floating gate materials, such as poly-Si/SiO2 and oxynitride, require large Program/Erase (P/E) voltage and endure only 106 P/E cycles [2]. Therefore the conventional floating-gate NVM cannot be used for local memory …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Design, fabrication and characterization of High-Performance silicon nanowire transistor",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4617139/",
            "Abstract": "We report the fabrication and characterization of double-gated Si nanowire field effect transistors with excellent current-voltage characteristics, low subthreshold slope ~85 mV/dec and high on/off current ratio ~10 6 . The Si nanowire devices are fabricated by using a self-aligned technique with standard photolithographic alignment and metal lift-off processes, enabling the large-scale integration of high-performance nanowire devices. We have also studied the effect of device structure and forming gas rapid thermal annealing on the nanowire transistor's electrical properties. We conclude that the self-aligned fabrication and non-overlapped gate-source/drain structure combined with appropriate post annealing leads to the excellent observed device performance.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High performance topological insulator nanowire field-effect transistors",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6628080/",
            "Abstract": "We show experimentally that single-crystal nanowires of the topological insulator Bi 2 Se 3  can be used as the conduction channel in high-performance field effect transistor, a basic circuit building block. The current-voltage characteristics are superior to many of those reported for semiconductor nanowire transistors. The metallic electron transport at the surface with good mobility can be effectively separated from the bulk conduction and adjusted by field effect at a small gate voltage. These properties open up a many potential applications in nanoelectronics and spintronics.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:ipzZ9siozwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Double gate (dg) soi ratioed logic with intrinsically on symmetric dg-mosfet load",
            "Publication year": 2007,
            "Publication url": "https://patents.google.com/patent/US7180135B1/en",
            "Abstract": "Disclosed is a Silicon-On-Insulator (SOI) Metal-Oxide Semiconductor Field-Effect Transistor (MOSFET) logic family composed of ratioed logic with intrinsically “on” symmetric fully depleted double-gate (DG) SOI MOSFET load (s) and asymmetric fully depleted double gate MOSFET driver (s).",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Double gate (DG)-SOI ratioed logic with symmetric DG load––a novel approach for sub 50 nm low-voltage/low-power circuit design",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S003811010400142X",
            "Abstract": "In this paper we introduce a novel logic gate family based on Double Gate (DG) SOI MOSFETs for low voltage/low power circuits. The logic gates are based on ratioed logic with depletion-mode (i.e., intrinsically on) Symmetric DG (SDG) load transistors and inversion-mode Asymmetric DG (ADG) driver transistors. Using this technique a basic inverter was designed, with better performance compared to “classical” CMOS DG design. This technique was extended to create a complete set of basic logic gates including NOR2, NAND2 and XOR2 gates.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Characterization of high-k/metal gate stack breakdown in the time scale of ESD events",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5488720/",
            "Abstract": "Catastrophic gate oxide breakdown of MOSFETs with high-k gate was characterized under ESD-like pulsed stress. It was found that the excessive gate current after gate oxide failure may result in a loss of gate contact and form a resistive path between the drain and source. Using constant voltage stress (CVS) method, the gate oxide breakdown voltages (V BD ) of NMSOFETs and PMOSFETs were extracted. NMOSFETs under positive stress were found to have the smallest VBD, while the V BD  of the PMOSFETs under positive stress were significantly increased due to the well resistance. Compared to that measured using the CVS method, the V BD  from the transmission line pulse method (TLP) was smaller by only less than 10%. Despite the cumulative damages caused by the TLP method, the result is a conservative estimation of the breakdown voltage. The VBD corresponding to the failure time of 1-ns measured …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "“Gated-diode” configuration in SOI MOSFET’s: A sensitive tool for evaluating the quality and reliability of the buried  interface",
            "Publication year": 2001,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.1354402",
            "Abstract": "A “gated-diode” configuration in SOI MOSFET’s is described, which is particularly suitable and easy to use for characterizing the buried oxide interface. This new approach becomes possible by taking advantage of the front gate, which is biased to inversion (NMOSFET’s) or accumulation (BC-PMOSFET’s) during the measurement. As a result, the drain merges with the inversion or accumulation layer and “extends” under the entire gate, forming a “horizontal” p-n junction with the channel. The drain-to-body diode is then forward-biased by a small voltage, and the back gate voltage is scanned such that it brings the back interface to depletion, a condition that is at the center of all gated-diode techniques and required to activate the interface states and start the recombination/generation processes. The mid-channel interface state density is obtained from the peak of the measured current vs. back gate voltage curves, and …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:eMMeJKvmdy0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Silicon nanowire memory application using hafnium oxide charge storage layer",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4422492/",
            "Abstract": "This paper discusses about SiNW-based non-volatile memory based on self-aligned CVD-grown SiNWs and a HfO 2  charge storage layer. With double gates and surrounding top gate high-k dielectric stacks, the SiNWs memory devices operates with a small program/erase voltage and low power consumption. Compared to previous work on SiNW SONOS memory devices, structures that use HfO 2  as a top gate surrounding dielectric exhibit better gate control, a larger memory window, and a higher ON/OFF current ratio. Additionally, this self-aligned method of integrating SiNWs into memory devices is more practical for large-scale fabrication.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scaling limits and reliability of SOI CMOS technology",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/001/meta",
            "Abstract": "As bulk and PD-SOI CMOS approach their scaling limit (at gate length of around 50 nm), there is a renewed interest on FD-SOI because of its potential for continued scalability beyond this limit. In this review the performance and reliability of extremely scaled FD transistors are discussed and an attempt is made to identify critical areas for further research.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:maZDTaKrznsC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Device physics considerations for SOI domino circuit design",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110102001387",
            "Abstract": "A feasibility study of domino circuits using partially depleted SOI technology is conducted by focusing on the OR structure, known to be particularly sensitive to current leakage. By contrast to previous belief, the simulation results indicated that for the 0.145 μm technology node, the circuit could be destabilized by the floating body effects enhanced (channel) off current rather than parasitic BJT current. It was observed that current spiking also played a major role in discharging the pre-charge node during operation. It was found that this overall leakage (discharging) limited the number of input transistors on the OR circuit. It was therefore deemed necessary to make the level-restoring transistor stronger and/or limit the number of inputs to keep the circuit robust during operation. Keeping the body grounded was found to be an alternative solution to both of these leakage problems.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Quantitative measurement of channel temperature of GaAs devices for reliable life-time prediction",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1044347/",
            "Abstract": "The channel temperature of Gallium Arsenide (GaAs) devices was quantitatively measured using scanning thermal microscopy (SThM), which is a variation of atomic force microscopy (AFM). The temperature of the devices was also characterized by infrared (IR) imaging and thermal modeling. The measured SThM temperature values were close to the calculated values from the model, and were higher than those found by IR, as predicted. In contrast to most published AFM results which have reported only qualitative and indirect semi-quantitative thermal information about the sample, the results presented here can be used directly to determine accurately the device-temperature. These results are useful to the reliability community in that they help to predict a more accurate semiconductor device lifetime. By careful calibration of an AFM thermistor probe tip, a quantitative temperature measurement of the channel …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Channel-width dependence of floating body effects in STI-and LOCOS-isolated MOSFETS",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931701006621",
            "Abstract": "The narrow-channel effects (NCE) and their impact on the floating body effects (FBEs) are investigated by various static and dynamic measurements in both LOCOS and STI isolated devices. It is found that FBEs are reduced in narrow channel devices for both isolation technologies. Two possible mechanisms are found to be consistent with our results: a carrier lifetime degradation on the sidewalls or an increase of the source/body junction leakage on the edges. Both mechanisms are discussed on the basis of our experimental results and on previous studies in bulk or SOI devices.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Nanowire Non-volatile Memory with Silicon Nitride Charge Trapping Layer",
            "Publication year": 2007,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2007APS..MARU39013L/abstract",
            "Abstract": "We present the fabrication and characterization of Si nanowire field effect transistors with silicon nitride as a charge trapping layer for non-volatile memory application. The Si nanowires were grown by chemical vapor deposition on defined location on a 60 nm Si nitride which was deposited on a 20 nm thermal grown oxide (blocking oxide). The source/drain electrodes were formed by using photolithographic alignment and metal lift-off processes. The nanowires were then covered with sputtering oxide at room temperature to be isolated from the external environment. We have observed a large threshold voltage shift window (8 V) at 10 V write/erase voltage and non-volatile on/off current states, which is attributed to the small radius (̃ 10 nm) and intrinsic doping of the Si nanowire. The dynamics of the nanowire/nitride charge exchange, and its effect on threshold voltage and memory retention have been studied.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The large-scale integration of high-performance silicon nanowire field effect transistors",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/20/41/415202/meta",
            "Abstract": "In this work we present a CMOS-compatible self-aligning process for the large-scale-integration of high-performance nanowire field effect transistors with well-saturated drain currents, steep subthreshold slopes at low drain voltage and a large on/off current ratio (> 10 7). The subthreshold swing is as small as 45 mV/dec, which is substantially beyond the thermodynamic limit (60 mV/dec) of conventional planar MOSFETs. These excellent device characteristics are achieved by using a clean integration process and a device structure that allows effective gate–channel–source coupling to tune the source/drain Schottky barriers at the nanoscale.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Glassy-Electret Random Access Memory–A naturally Nanoscale Memory Concept",
            "Publication year": 2018,
            "Publication url": "https://www.nist.gov/publications/glassy-electret-random-access-memory-150-naturally-nanoscale-memory-concept",
            "Abstract": "Self-heating is a serious issue in state-of-the-art MOSFET technology. Much efforts are currently being made to combat this problem to enable further scaling. In this work, self-heating in nanoscale MOSFET is leveraged and enhanced to enable a new memory concept that can potentially meet the requirement of an universal memory.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:XoXfffV-tXoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fabrication, characterization and simulation of high performance Si nanowire-based non-volatile memory cells",
            "Publication year": 2011,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/21548734",
            "Abstract": "We report the fabrication, characterization and simulation of Si nanowire SONOS-like non-volatile memory with HfO{sub 2} charge trapping layers of varying thicknesses. The memory cells, which are fabricated by self-aligning in situ grown Si nanowires, exhibit high performance, i.e. fast program/erase operations, long retention time and good endurance. The effect of the trapping layer thickness of the nanowire memory cells has been experimentally measured and studied by simulation. As the thickness of HfO{sub 2} increases from 5 to 30 nm, the charge trap density increases as expected, while the program/erase speed and retention remain the same. These data indicate that the electric field across the tunneling oxide is not affected by HfO{sub 2} thickness, which is in good agreement with simulation results. Our work also shows that the Omega gate structure improves the program speed and retention time for memory applications.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "\" Gated-diode\" in SOI MOSFETs: a sensitive tool for characterizing the buried Si/SiO/sub 2/interface",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/915689/",
            "Abstract": "A \"gated diode\" technique is described for the measurement of the interface state density of the silicon film/buried oxide interface of SOI MOSFETs. This approach becomes possible by taking advantage of the front gate, which is biased to inversion (NMOSFET) or accumulation (BC-PMOSFET) during the measurement, while scanning the back interface through depletion. Using this technique the estimated value of the buried interface state density of typical low dose SIMOX MOSFETs was slightly over 10/sup 11//cm/sup 2/.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the T-RAM and FED-RAM memory mechanism",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7333510/",
            "Abstract": "We take a closer look on the memory mechanism (“store”) of the T-RAM and FED-RAM memory cells, with the help of extensive numerical simulations. The resulting carrier profiles demonstrate that the accepted interpretation of the memory mechanism as the accumulation (“1”) or depletion (“0”) of holes, under the gate above the p-base, is incorrect. Instead, it is the state (equilibrium or not) of the depletion regions on the sides of the p-base, that determine the stored state of the cell.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Silicon nanowire nonvolatile-memory with varying HfO2 charge trapping layer thickness",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5378132/",
            "Abstract": "The authors have fabricated silicon nanowire (SiNW) based Al 2 O 3 /HfO 2 /SiO 2  nonvolatile-memory (NVM) cells with varying HfO 2  trapping layer thickness have been fabricated by using self-aligning approach. The cells exhibit excellent characteristics such as fast programming/erasing (P/E) speeds, good endurance and excellent retention. The P/E speed is not sensitive to the HfO 2  layer thickness. The magnitude of the achievable memory window on the other hand is larger for the cells with thicker HfO 2  layers. These results are all in good agreement with the TCAD simulation analysis.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and optimization of the SOI field effect diode (FED) for ESD protection",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110108002244",
            "Abstract": "A thorough investigation is carried out by numerical simulations of the field effect diode (FED) with the aim to explore its potential for ESD protection applications in silicon on insulator (SOI) technologies. It is shown that the carrier lifetime value has an important impact on the device operation. By careful sizing and doping, FED devices with reasonable breakdown voltage values can be achieved but at rather high gate voltage values. Better results are achieved by modifying the doping profile to resemble a PNPN structure with two gates.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Time dependent dielectric breakdown in high quality SiC MOS capacitors",
            "Publication year": 2016,
            "Publication url": "https://www.scientific.net/MSF.858.615",
            "Abstract": "In this paper we report TDDB results on SiO 2/SiC MOS capacitors fabricated in a matured production environment. A key feature is the absence of early failure out of over 600 capacitors tested. The observed field accelerations and activation energies are higher than what is reported on SiO 2/Si of similar oxide thickness. The great improvement in oxide reliability and the deviation from typical SiO 2/SiC observations are explained by the quality of the oxide in this study.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:tuHXwOkdijsC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Low voltage/low power sub 50 nm double gate SOI ratioed logic",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1242942/",
            "Abstract": "In this paper, we show how the approach can also be used to built NAND and XOR gates to create a complete logic family. This is the first report that proposes a unique building block for a comprehensive DG-SOI logic design style along with a gain in number of devices used without compromising the performance superiority. All simulations are done for 50 nm gate length devices using SILVACO tools.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measurements for the reliability and electrical characterization of semiconductor nanowires",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4558860/",
            "Abstract": "Nanoelectronic devices based upon self-assembled semiconductor nanowires are excellent research tools for investigating the behavior of structures with sub-lithographic features as well as a promising basis for future information processing technologies. We describe two unique approaches to successfully fabricate nanowire devices, one based upon harvesting and positioning nanowires and one based upon the direct growth of nanowires in predefined locations. Test structures are fabricated and electronically characterized to probe the fundamental properties of chemical-vapor-deposition grown silicon nanowires. Important information about current transport and fluctuations in materials and devices can be derived from noise measurements, and low frequency 1/f noise has traditionally been utilized as a quality and reliability indicator for semiconductor devices. Both low frequency 1/f noise and random …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Realization of Negative Capacitance with Topological Insulator Based MOS Capacitor",
            "Publication year": 2013,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2013APS..MAR.R4005Y/abstract",
            "Abstract": "Negative capacitance is one of way to achieve steep subthreshold slope exceeding its thermal limit in metal-oxide-semiconductor field effect transistor (MOSFET). The common materials under study for negative capacitance are ferroelectric thin films. However, the integration of regular ferroelectric materials (eg, PZT) into semiconductor based devices is usually difficult due to the high temperature required for crystallization and precise control of oxygen percentage in ferroelectric materials. In this work, we found that negative capacitance can be achieved by introducing a topological insulator interlayer into a conventional MOS capacitor. Three-dimensional topological insulators inherently contain a insulator/semiconductor bulk and a gapless conducting surface. When an electric field is added to topological insulator interlayer, imbalanced charge carriers (electrons and holes) would be generated and then …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SOI field-effect diode DRAM cell: Design and operation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6544600/",
            "Abstract": "A dynamic RAM cell based on the field-effect diode (FED) is presented, and its operation is described and explained with the help of numerical device simulations. This new cell resembles the thin capacitively coupled thyristor (TCCT) cell in concept and operation, however it has important advantages. These advantages derive from the fact that the thyristor-like mode of operation of the FED is gate induced, whereas the TCCT is an actual, built-in thyristor. High read 0/1 current margin, fast write/read time, good retention, and densely packed cells are obtained.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:yB1At4FlUx8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Physics and design of a SOI field-effect-diode memory cell",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6404395/",
            "Abstract": "A new family of well behaved memory cells based on the SOIFED has been described and their operation explained. Their operation relies on modifying the conductivity of the SOI film locally by suitably biasing the gates. They are easier to fabricate and their performance is excellent.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-performance room-temperature TiO2-functionalized GaN nanowire gas sensors",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5116677",
            "Abstract": "Hybrid gas sensors based on TiO2 functionalized gallium nitride nanowires have been prepared by nanofabrication and comprehensively studied for high-responsivity applications. The devices exhibited a high responsivity (25%) to 500 ppm NO2 assisted with ultraviolet illumination at room temperature. The thickness and doping concentration of TiO2 were engineered to improve the transducer function. The result indicated that an excellent n-type response can be stably obtained for a doping range from 1 × 1017 cm−3 to 1 × 1019 cm−3. The TiO2 thickness and doping concentration can be further fine-tuned to achieve optimal performance. In addition, a comprehensive device simulation was carried out to understand the device operation and gain insight for optimizing the device performance.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Interaction between electrostatic discharge and electromigration on copper interconnects for advanced CMOS technologies",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1493069/",
            "Abstract": "The effects of electrostatic discharge (ESD), electromigration (EM) and their interdependence on Cu interconnects are studied in this work. Transmission line pulse (TLP) stress verified that metal lines fail when they are Joule heated up to a critical temperature (T/sub crit/). Failure analysis (FA) showed the gradual growth of failure sites appearing above the Cu melting point (T/sub m/=1084/spl deg/C) and leading the metal line to open failure when T/sub crit/ is reached. The pulse width dependence was investigated and the new data starting from 1.5 ns showed agreement with the theoretical model and supported the existence of non-sharp transitions between the three main regimes in the Wunch-Bell like curve (adiabatic, thermal diffusion and steady state). It was shown for the first time that the latent damage caused by TLP could degrade EM lifetime, depending on the wafer temperature and the applied current …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and optimization of the SOI field effect diode (FED)",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4422443/",
            "Abstract": "This article deals with the importance of the structure of FED, that lies in the fact that by appropriately biasing it, its operation can be switched between SCR-like and diode-like. For devices with p-type body doping the depletion of electrons beneath G1 imposes an upper limit to the breakdown voltage. This paper proposes to use n-type body doping instead to achieve high breakdown voltage and reduce the gate length for higher turn-on speed and lower on-resistance.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Beta engineering and circuit styles for SEU hardening PD-SOI SRAM cells",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110104001820",
            "Abstract": "SOI technologies have long been used for SEU-hardened SRAMs and other radiation-hard circuits. However, to maintain their advantages in the submicron regime, it is essential that the strength of the floating body effects (FBE) and the role of the parasitic bipolar transistor (PBJT) should be minimized. In this work these are achieved by reducing the gain β of the PBJT by controlling the carrier recombination lifetime of the SOI film. Two sets of devices (A and B) were fabricated on 0.35 μm PD SOI technology, where Device A underwent a lifetime “killing”-processing step to control the single event upset (SEU) vulnerability. These devices were experimentally characterized and simulated and the results verified the benefits of lifetime “killing”. Additional SEU control was achieved by optimizing the circuit design of the cell through the incorporation of suitable delay elements.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:TFP_iSt0sucC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Christophe Tretz Electrical and Computer Engineering Department",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=fpZ7MZ2lnBgC&oi=fnd&pg=PA313&dq=info:0J6kMTIF5SYJ:scholar.google.com&ots=TiPab3pCj_&sig=T_onSnawUvBWLcoDl3-QsNUlNfM",
            "Abstract": "Charge pump circuits are used to produce voltages higher than the regular supply voltage on chip. They are essential for single-power nonvolatile memories such as EEPROMS and Flash memories [1]. However, the pumping gain and efficiency for bulk circuits are severely limited by the threshold voltage drop and the body effect. Due to the pass transistor effect there is a loss of voltage equivalent to Vī (threshold voltage) on the output of each stage. This problem is made even more severe by the fact that Vt goes up with increasing Vse (the source to body bias), thus reducing the output voltage of the pump circuit drastically. Various techniques have been proposed in the past to alleviate this problem [1],[2]. One of the obvious solutions to overcome the problem of body effect and the threshold voltage drop is to keep the body floating. However, due to technological reasons, making a floating body in bulk is not trivial. The implementation of the pump circuit on partially depleted (PD) SOI automatically takes care of this problem. This becomes possible due to the fact that SOI is naturally a floating body device. However, leaving the body floating complicates the circuit behavior by introducing various effects unique to PD SOI known as floating body effects (FBE)[4]. These SOI-specific properties such as parasitic BJT current, hysteresis, and unstable threshold voltage etc., can significantly alter the circuit performance, depending on circuit topology (5). Therefore, to have an optimum design one needs to carefully examine the impact of FBE on a given circuit.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:a9-T7VOCCH8C",
            "Publisher": "The Electrochemical Society"
        },
        {
            "Title": "Physics and Design of Nanoscale Field Effect Diodes for Memory and ESD Protection Applications",
            "Publication year": 2013,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118678107.ch4",
            "Abstract": "This chapter combines the strengths of the thin capacitively‐coupled thyristor (TCCT) with the strengths of the nanoscale field effect diode (FED) to design, fabricate and test new memory cells. This is in response to the widely recognized and urgent need for progress in memory technology, as is abundantly demonstrated, for example, by the large number of dedicated technical sessions recently in many prestigious international conferences such as IEDM, ESSDERC, ISSCC, etc. Field effect diodes involve demanding device physics and nano‐fabrication technology, and the author explores their design space in order to establish the most appropriate structures and operation conditions for new types of memory cells. In addition, FED structures have shown promise and are further explored for application as electrostatic discharge (ESD) protection devices.electrostatic discharge; field …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Deposition Of Uniform Size Metallic Nanoparticles For Use In Non Volatile Memories",
            "Publication year": 2007,
            "Publication url": "https://www.cambridge.org/core/journals/mrs-online-proceedings-library-archive/article/deposition-of-uniform-size-metallic-nanoparticles-for-use-in-non-volatile-memories/EE0DF4467F7A7B117E9B09334C0AAD59",
            "Abstract": "In this work we investigate the non-volatile memory behavior of Ni nanoparticles embedded within an insulating matrix. Nickel nanoparticles are deposited at room temperature by a new high-vacuum technique over a 4 nm tunneling thermal SiO2 layer followed by the deposition of HfO2 as a control insulator. Memory windows of ∼1.5V are observed in MOS capacitors at gate pulse voltages of 8V. Charge retention for write and erase state clearly indicate long time charge storage behavior.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:8d8msizDQcsC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "ESD performance of 65 nm partially depleted n and p channel SOI MOSFETs",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110109003736",
            "Abstract": "A study on the electrostatic discharge (ESD) behaviors of silicide blocked (Sblk) n and p channel MOSFETs is presented for a state-of-the-art 65 nm SOI technology. It is observed that the charge in the floating body SOI MOSFETs helps to improve their ESD characteristics over the grounded body devices. The ESD behavior of the thin-oxide pMOSFETs shows failure current similar to the corresponding nMOSFETs but at the expense of higher power dissipation and higher parasitic bipolar transistor (pBJT) turn-on voltages. The study of gate-silicided (GS) and gate-non-silicided (GNS) nMOSFETs show that the GNS devices exhibit approximately 30% higher failure current than the similar sized GS devices. Transmission line pulsing (TLP) measurement with different stress pulse widths reveals that the self-heating effects are more pronounced in the GNS devices than the similar sized GS devices. The analytical thermal …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:eflP2zaiRacC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Explaining the reduced floating body effects in narrow channel SOI MOSFETs",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957967/",
            "Abstract": "We focus on the floating body effects (FBEs) in narrow channel SOI MOSFETs such as saturation subthreshold swing, breakdown voltage and single transistor latch-up. We find that all improve as the channel width decreases and examine the mechanisms causing this improvement. We demonstrate experimently and by simulation, that the reduced FBEs in narrow channel devices are caused by dopant outdiffusion and lifetime reduction along the channel edges.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electrostatic discharge induced oxide breakdown characterization in a 0.1/spl mu/m CMOS technology",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996631/",
            "Abstract": "Historically, the failure mode of the NMOS/lateral NPN (Lnpn) due to electrostatic discharge (ESD) is source-to-drain filamentation as the temperature exceeds the melting temperature of silicon. However, as the oxide thickness shrinks, the ESD failure is instead due to oxide breakdown. In this paper, transmission line pulse (TLP) testing of the NMOS/Lnpn device is used to characterize the failure mode for a 0.1 /spl mu/m NMOS. The channel length and non-silicided source contact-to-gate spacing (SCG) are the main parameters in determining ESD protection capability. Using Id-Vg measurements, we show how oxide degradation before failure is detected with the leakage current failure criteria used. The latent effects of oxide degradation on the second breakdown current (It2) of the NMOS/Lnpn are identified. As the ultra-thin oxide (15 A) device ages from an oxide perspective, its ESD protection capabilities decrease.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Highly Efficient Rapid Annealing of Thin Polar Polymer Film Ferroelectric Devices at Sub‐Glass Transition Temperature",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201704165",
            "Abstract": "An unexpected rapid anneal of electrically active defects in an ultrathin (15.5 nm) polar polyimide film at and below glass transition temperature (Tg) is reported. The polar polymer is the gate dielectric of a thin‐film‐transistor. Gate leakage current density (Jg) through the polymer initially increases with temperature, as expected, but decreases rapidly at Tg − 60 °C. After ≈2 min at Tg, the leakage is reduced by nearly three orders of magnitude. A concomitant observation is that the drain current (Id)–gate voltage (Vg) hysteresis decreases with temperature, reaching zero at nearly the same temperature at which Jg collapses. As Jg drops further, the drain current hysteresis increases again but in the opposite direction. This combination strongly supports the interpretation of rapid defect annealing.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Silicon nanowire NVM with high-k gate dielectric stack",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931709002688",
            "Abstract": "Three flash memory cell structures with silicon nanowire channels and high-k dielectric stacks were fabricated with a “self-aligning” process and their characteristics are reported and compared in this paper: a Metal/SiO2/HfO2/SiO2/Si (MOHOS) cell with a SiO2 blocking layer and two Metal/Al2O3/HfO2/SiO2/Si (MAHOS) cells with Al2O3, all with HfO2 as the charge trapping layer. Compared to (control) planar cells, all three operate at higher speeds, attributed to the enhanced electric field across the tunneling oxide surrounding the channel. The MAHOS cells (Al2O3 blocking layer) outperform the MOHOS cells (SiO2 blocking layer) and both have large memory window, fast operation speed, good endurance and retention.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Non-volatile memory with self-assembled ferrocene charge trapping layer",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4817009",
            "Abstract": "A metal/oxide/molecule/oxide/Si capacitor structure containing redox-active ferrocene molecules has been fabricated for non-volatile memory application. Cyclic voltammetry and X-ray photoelectron spectroscopy were used to measure the molecules in the structure, showing that the molecules attach on SiO2/Si and the molecules are functional after device fabrication. These solid-state molecular memory devices have fast charge-storage speed and can endure more than 109 program/erase cycles. This excellent performance is derived from the intrinsic properties of the redox-active molecules and the hybrid Si-molecular device structure. These molecular devices are very attractive for future high-level non-volatile memory applications.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:0KyAp5RtaNEC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Gated-diode characterization of the back-channel interface on irradiated SOI wafers",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/983186/",
            "Abstract": "A silicon-on-insulator (SOI) MOSFET-based \"gated-diode\" technique has been applied to study the Si-film/buried-oxide interface of devices that were fabricated on a SIMOX wafer. Since the gated-diode technique is sensitive to recombination current caused by the presence of interface states, the samples were exposed to 10 keV X-ray irradiation to enhance the development of SOI back-channel interface states. The measured peak in the gated-diode current curve was observed to increase in magnitude and move in voltage as a function of exposure to radiation in a manner consistent with increasing interface states and increasing trapped oxide charge. Using a two-dimensional numerical simulator, with a single acceptor interface trap at 0.7 eV, the gated-diode current was modeled as a function of 10 keV X-ray exposure.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the interaction of ESD, NBTI and HCI in 65nm technology",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4227603/",
            "Abstract": "A comprehensive study on the interaction between ESD, NBTI and HCI on silicide blocked (SBLK) PFET devices is presented for a state-of-the-art 65nm bulk technology. ESD behavior of thin and thick oxide devices are shown to have opposite channel length dependence. The study of NBTI-ESD interaction on thin oxides devices shows that non-destructive ESD pre-stressing worsens the NBTI degradation. On the other hand NBTI pre-stressed thick oxide devices show high on-resistance during ESD characterization. It is shown that in thin oxide long channel length devices at high temperature pure NBTI is the worst case degradation mode whereas in short channel length devices combined \"HC-NBTI\" degradation dominates. Furthermore, we observed that while a SBLK PFET is HC stressed at high temperature then NBTI also takes place simultaneously, resulting in \"HC-NBTI\" co-activation, which is found to be …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High Performance Silicon Nanowire Field Effect Transistor",
            "Publication year": 2008,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2008APS..MARB35006L/abstract",
            "Abstract": "We report the fabrication and characterization of double-gated Si nanowire field effect transistors with excellent electrical characteristics and a small subthreshold slope:∼ 85 mv/dec. The Si nanowires were grown by chemical vapor deposition at pre-defined location on a 50 nm thermal SiO 2 (bottom gate oxide). The source/drain electrodes (Al) were formed by using photolithographic alignment and metal lift-off processes. The nanowires were then covered with HfO 2 via atomic layer deposition. A thin layer of SiO 2 was deposited on the HfO 2 as a buffer layer before the top gate electrode formation (Al, using photolithographic and lift-off processes). This self-aligned process enables the integration of a large number of high-quality nanowire transistors for electronic circuitry. We have investigated the effect of device structure and annealing conditions on the final device performance, and developed theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exposing Glazing Assemblies to Firebrand Showers",
            "Publication year": 2011,
            "Publication url": "https://tsapps.nist.gov/publication/get_pdf.cfm?pub_id=908072",
            "Abstract": "An experimental campaign was undertaken to determine vulnerabilities of glazing assemblies to firebrand bombardment using the NIST Dragon installed in the Building Research Institute’s Fire Research Wind Tunnel Facility (FRWTF). Results of these experiments are presented.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SCR Device With Double-Triggered Technique for On-Chip ESD Protection in Sub-Quarter-Micron Silicided CMOS Processes............................................................. M.-D. Ker and K.-C. Hsu 58 Nondestructive Void Size Determination in Copper Metallization Under Passivation... Z. Gan, CM Tan, and G. Zhang 69 ESD-Induced Oxide Breakdown on Self-Protecting GG-nMOSFET in 0.1-m CMOS Technology................",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/iel5/7298/27563/x0693134.pdf",
            "Abstract": "This TRANSACTIONS is jointly sponsored by the IEEE Electron Devices Society and the IEEE Reliability Society. The on-line version of the TRANSACTIONS is available to all IEEE members at http://www. ieee. org/ieeexplore/. For information on receiving this TRANSACTIONS write to IEEE at the address below. Prospective authors should read the Information for Authors section on the inside back cover or on-line at http://www. ieee. org/tdmr/emanuscript.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scaling and reliability of deeply scaled SOI CMOS",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1272132/",
            "Abstract": "This paper presents the latest results from the literature, concerning the performance and reliability of extremely scaled FD transistors. Numerical simulations showed that scalability of FD-SOI is achievable by using exotic gate materials to control the threshold voltage and lowly doped/undoped channels and thinning the silicon film and buried oxide to control the short channel effects. As the film thickness is reduced the effective junction depth is reduced which strengthens the front gate control of the back surface potential and improves the short channel effects. The hot carrier reliability of SOI CMOS was unknown as carriers can get hot at very low voltages and channel coupling and floating body complicates the effects of the induced degradation.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-Reactive Graphene and Metal Oxide Sensors for Gas Discrimination",
            "Publication year": 2019,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2019-02/30/1331/meta",
            "Abstract": "  Discriminating similar molecules remains a very challenging problem for semiconductor gas sensors. Here, we report a method to achieve precise gas discrimination of similar chemical vapors (mesitylene, o-xylene, and toluene) by using cross-reactive arrays consisting of metal oxide semiconductor and graphene sensors. It is difficult to identify these three chemicals as they have very similar responses to these sensors. Through a cross-reactive Principal Component Analysis (PCA) of the sensor response features, however, the discrimination accuracy improved from about 70% with a single gas sensor to almost 100% with the cross-reactive sensor array. Such a precise discrimination and the low-cost planar process make this approach a very attractive candidate for smart gas sensing and for future Internet of Things (IoT) applications.  ",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:GtLg2Ama23sC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A DATA FLOW IMPLEMENTATION OF AGENT-BASED DISTRIBUTED GRAPH SEARCH",
            "Publication year": 2009,
            "Publication url": "https://tsapps.nist.gov/publication/get_pdf.cfm?pub_id=903955",
            "Abstract": "Biological ants organize themselves into forager groups that converge to shortest paths to and from food sources. This has motivated development a large class of biologically inspired agent-based graph search techniques, called Ant Colony Optimization, to solve diverse combinatorial problems. Our approach to parallel graph search uses multiple ant agent populations distributed across processors and clustered computers to solve large-scale graph search problems. We discuss our implementation using the NIST Data Flow System II, and show good scalability of our parallel search algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Engineering Dielectric Stacks for Charge-Trapping Non-Volatile Memory",
            "Publication year": 2012,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2012-02/37/2851/meta",
            "Abstract": "During the recent decade, silicon-oxide-nitrideoxide-silicon (SONOS) like charge trapping based nonvolatile memory has been receiving considerable interest as one of the most promising candidates to replace the conventional floating-gate memory, due to their prominent scalability, simple structure, lower power consumption, less sensitivity to the stress-induced leakage current (SILC), and operation versatility in sub-100 nm technology.[1, 2]New high-k materials, such as HfO2, used as chargetrapping layer, replacing the silicon nitride have been reported to have enhanced performance as compared with conventional SONOS memory devices. Based on these innovative materials, different stacking engineering approaches have also been proposed for better memory characteristics. For example, symmetric (low-k/highk/low-k) or asymmetric (low-k/high-k) tunnel layer stack has been proved to show either lower …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:1qzjygNMrQYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Influence of Metal–MoS2 Interface on MoS2 Transistor Performance: Comparison of Ag and Ti Contacts",
            "Publication year": 2015,
            "Publication url": "https://pubs.acs.org/doi/abs/10.1021/am506921y",
            "Abstract": "In this work, we compare the electrical characteristics of MoS2 field-effect transistors (FETs) with Ag source/drain contacts with those with Ti and demonstrate that the metal–MoS2 interface is crucial to the device performance. MoS2 FETs with Ag contacts show more than 60 times higher ON-state current than those with Ti contacts. In order to better understand the mechanism of the better performance with Ag contacts, 5 nm Au/5 nm Ag (contact layer) or 5 nm Au/5 nm Ti film was deposited onto MoS2 monolayers and few layers, and the topography of metal films was characterized using scanning electron microscopy and atomic force microscopy. The surface morphology shows that, while there exist pinholes in Au/Ti film on MoS2, Au/Ag forms a smoother and denser film. Raman spectroscopy was carried out to investigate the metal–MoS2 interface. The Raman spectra from MoS2 covered with Au/Ag or Au/Ti film …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:vbGhcppDl1QC",
            "Publisher": "American Chemical Society"
        },
        {
            "Title": "Self-assembled nanowire array capacitors: capacitance and interface state profile",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/25/13/135201/meta",
            "Abstract": "Direct characterization of the capacitance and interface states is very important for understanding the electronic properties of a nanowire transistor. However, the capacitance of a single nanowire is too small to precisely measure. In this work we have fabricated metal–oxide–semiconductor capacitors based on a large array of self-assembled Si nanowires. The capacitance and conductance of the nanowire array capacitors are directly measured and the interface state profile is determined by using the conductance method. We demonstrate that the nanowire array capacitor is an effective platform for studying the electronic properties of nanoscale interfaces. This approach provides a useful and efficient metrology for the study of the physics and device properties of nanoscale metal–oxide–semiconductor structures.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Methods to Characterize the Electrical and Mechanical Properties of Si Nanowires",
            "Publication year": 2007,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2799417",
            "Abstract": "We report metrology methods to characterize nanowires. In this work, representative devices and test structures, including nanoelectromechanical switches, non‐volatile nanowire memory devices with SONOS structure, and both transfer‐length‐method and Kelvin test structures, have been developed to investigate the electrical and mechanical properties of the silicon nanowires. These methods and test structures can be readily applied to other (non‐Si) semiconductor nanowires/nanotubes.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:olpn-zPbct0C",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "NBTI in SOI p-channel MOS field effect transistors",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1609554/",
            "Abstract": "In this paper we describe NBTI tests and report results for partially depleted (PD) SOI MOSFETs selected from 0.35 and 0.15 /spl mu/m technologies for harsh environment (i.e., space, high temperature, etc.) applications. When studying \"pure\" NBTI degradation, we find that the results are similar to bulk technologies, and in good agreement with the standard reaction-diffusion (R-D) theory of NBTI. However, when both gate and drain are biased as in a hot carrier injection (HCI) degradation situation, an interesting interaction of HCI and NBTI is observed, which leads to the resolution of the question of worst case HCI stress conditions for p-channel SOI MOSFETs with thin gate oxides.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pseudo-nMOS revisited: impact of SOI on low power, high speed circuit design",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/892752/",
            "Abstract": "Bulk pseudo-nMOS (i.e. CMOS with grounded pMOS pullup device) circuits have been quite popular in the past because they are fast, small and pMOS devices are good pullup resistive loads. A pseudo-nMOS gate with a fan-in of N requires only N+1 transistors (as opposed to 2N for standard CMOS), resulting in smaller area as well as smaller parasitic capacitances, whereas each input connects to only one transistor, presenting a smaller load to the preceding gate. Since these advantages come at the expense of static power consumption, pseudo-nMOS circuits have often lost their appeal for large circuits, even though they are frequently used in some critical path elements when speed and area are at a premium (Weste and Eshraghian, 1993). If a weaker pMOS load transistor could be used without sacrificing speed, for example by reducing the load on the dotted node (either due to smaller devices in the …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Field effect diode (FED): A novel device for ESD protection in deep sub-micron SOI technologies",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4154406/",
            "Abstract": "In this paper the authors present the field effect diode (FED) as a novel device with a new approach for ESD protection in SOI. Device parameters are identified and optimized to achieve optimum ON and OFF behavior. Furthermore, the authors present two ways the FED can be used in an ESD protection scheme: in I/O clamping and in a high-voltage supply clamp",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-Performance Topological Insulator Bi2Se3 Nanowire Field Effect Transistors",
            "Publication year": 2013,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2013APS..MART13013Z/abstract",
            "Abstract": "Single crystal topological insulator Bi 2 Se 3 nanowires were synthesized by Vapor-Liquid-Solid (VLS) mechanism. Bi 2 Se 3 NW field-effect transistors were fabricated by using self-alignment method with HfO 2 as the gate dielectric. Bi 2 Se 3 NWFETs were measured in vacuum at different temperatures. Excellent MOSFET characteristics were achieved: smooth and well-saturated output characteristics, large On/Off ratio (10 7), zero Off-state current and good subthreshold slope in transfer characteristics. We have observed linear behavior of the saturation current extracted from the Id s-V ds curves as a function of the overthreshold voltage (V g-V th), which indicated the main role of the metallic surface conduction at Bi 2 Se 3 nanowire channel. Both effective mobility and field-effect mobility have been extracted. Very good effective mobility (> 5000 cm 2 V-1 s-1 at 77 K) was obtained under a low gate voltage. From off …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ESD time-domain characterization of high-k gate dielectric in a 32 nm CMOS technology",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5340124/",
            "Abstract": "Gate dielectric breakdown measurements were performed on high-k/metal gate and SiON/polysilicon gate NMOSFETs down to the ESD time domain. Measurements indicate that, for a given NMOSFET on-state performance level, high-k transistors have increased robustness to ESD compared to SiON transistors.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Single-Nanowire CMOS Inverter Based on Ambipolar Si Nanowire FETs",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1149/05006.0151ecst/meta",
            "Abstract": "We have successfully fabricated an inverter based on ambipolar Si nanowire FETs. The inverter is consisted of two identical nanowire FETs on a single Si nanowire. The engaged FETs showed asymmetric ambipolar characteristics under positive and negative gate bias. A CMOS-like inverter can be realized on the single nanowire, where one of the devices behaves as an nMOSFET and the other behaves as a pMOSFET.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Pseudomorphic high electron mobility transistor monolithic microwave integrated circuits reliability study",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026271401000828",
            "Abstract": "Accelerated high temperature RF life testing was used to investigate the reliability of two-stage GaAs monolithic microwave integrated circuit (MMIC) power amplifiers based on 0.25 μm pseudomorphic high electron mobility transistor technology. Life testing was performed at elevated baseplate temperatures with MMICs operating at typical dc bias conditions and large signal RF drive levels of two dB compression. The resulting failure distribution was log normal and the estimated median life time extrapolated to a channel temperature of 140° C was 2.3× 10 6 h with an activation energy of 1.1 eV.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Two-dimensional hybrid layered materials: strain engineering on the band structure of MoS2/WSe2 hetero-multilayers",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6528/aa7a34/meta",
            "Abstract": "In this paper, we report a comprehensive modeling and simulation study of constructing hybrid layered materials by alternately stacking MoS 2 and WSe 2 monolayers. Such hybrid MoS 2/WSe 2 hetero-multilayers exhibited direct bandgap semiconductor characteristics with bandgap energy (E g) in a range of 0.45–0.55 eV at room temperature, very attractive for optoelectronics (wavelength range 2.5–2.75 μm) based on thicker two-dimensional (2D) materials. It was also found that the interlayer distance has a significant impact on the electronic properties of the hetero-multilayers, for example a five orders of magnitude change in the conductance was observed. Three material phases, direct bandgap semiconductor, indirect bandgap semiconductor, and metal were observed in MoS 2/WSe 2 hetero-multilayers, as the interlayer distance decreased from its relaxed (ie, equilibrium) value of about 6.73 Å down to 5.50 Å …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:-FonjvnnhkoC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Design and Fabrication of TaO  Stacks for Discrete Multibit Memory Application",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6600817/",
            "Abstract": "In this paper, tantalum pentoxide (Ta 2 O 5 ) has been investigated as the charge-storage dielectric for discrete, multibit memory applications. Two Ta 2 O 5  containing dielectric stacks, Al 2 O 3 /Ta 2 O 5 /SiO 2  and Al 2 O 3 /Ta 2 O 5 /Al 2 O 3 /Ta 2 O 5 /SiO 2 , have been fabricated and measured. Both structures exhibited excellent nonvolatile memory characteristics: fast program/erase speed with significant flat-band voltage shift at 1 μs, long retention, and good endurance. Interesting multiple staircase memory characteristics observed in the devices with two layers of Ta 2 O 5  exhibit multiple, discrete charge-storage states. Such an integration of multibit in one cell is very attractive for developing high-density nonvolatile memory.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "LP/LV ratioed DG-SOI logic with (intrinsically on) symmetric DG-MOSFET load",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=15530664",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pulsed gate dielectric breakdown in a 32 nm technology under different ESD stress configurations",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5623726/",
            "Abstract": "We report pulsed high-k gate dielectric breakdown in various configurations emulating ESD stress in real input/output circuits. The stress on the receiver is of greater concern than is stress on the driver due to different gate oxide areas under stress. Methods to improve pad voltage tolerance for gate oxide breakdown are proposed.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characterization and investigation of the interaction between hot electron and electrostatic discharge stresses using NMOS devices in 0.13/spl mu/m CMOS technology",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/922905/",
            "Abstract": "In this paper, the high-current characteristics encountered during electrostatic discharge (ESD) events using NMOS/Lnpn protection devices in a 0.13 /spl mu/m CMOS technology are investigated for different device parameters. The effects of silicide blocking and hot electron (HE) shifts on the second breakdown current of the NMOS devices are studied. The impact of nondestructive ESD stressing on HE shifts is also studied for both silicided and nonsilicided devices.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and Fabrication of SOI Field-Effect-Diode Memory Cells",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2011-01/23/1433/meta",
            "Abstract": "Memory arrays consume a very large area in chip designs; yet memory cell scaling lags significantly transistor scaling. With transistor channel lengths in the nanoscale regime, the six transistor static random access memory cell (6T-SRAM) and the single transistor dynamic memory (DRAM) cell both suffer from excessive leakage current. Consequently, there is a widely recognized need for urgent progress in memory technology. The Thin Capacitively Coupled Thyristor (TCCT) based memory cell (T-RAM) approach is a most promising, CMOS compatible alternative to the “standard” cell both for SRAM [1] and DRAM cell [2] designs. However, the T-RAMs demand the precise control of doping profiles of the pn junctions involved in order to achieve correct breakdown characteristics. To address this difficulty, we explore here, the possibility of replacing the thyristor with a suitable Field Effect Diode (FED). The FED …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:0izLItjtcgwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Narrow-channel effects and their impact on the static and floating-body characteristics of STI-and LOCOS-isolated SOI MOSFETs",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110102001478",
            "Abstract": "Narrow-width effects are investigated in LOCOS and STI-isolated silicon-on-insulator (SOI) MOSFETs. With width as a parameter, variations in threshold voltage, mobility, subthreshold swing and drain-induced barrier lowering are analyzed in relationship with the other transistor dimensions (i.e. channel length, and film thickness). For both isolation techniques, a strong dependence of the threshold voltage with the channel width as well as the SOI silicon film thickness are observed while narrow and short-channel effects are not found to be correlated. Following this, it is shown through saturation subthreshold swing, latch-up and breakdown voltage measurements, that the floating-body effects (FBEs) are reduced in narrow-channel devices. Specific experiments (current transients, source–body junction current…) and simulations were conducted to reveal the mechanisms responsible for the observed weakening of …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:ufrVoPGSRksC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "SOI FED-SRAM Cell: Structure and Operation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7161315/",
            "Abstract": "A static memory cell (SRAM) based on the field-effect diode (FED) is presented, and its operation is explained with the help of numerical device simulations. Although this new cell resembles the thin-capacitively coupled-thyristor (TCCT) SRAM cell in concept and operation, it is nevertheless characterized by significant advantages. These advantages derive from the fact that the thyristorlike mode of operation of the FED is gate induced, whereas the TCCT is an actual built-in thyristor. The operation of the cell is explained with the help of suitable timing diagrams, and the mechanisms of storing 1 and 0 are analyzed with detailed numerical simulations. In one operation scheme (where the cell could better be termed quasi-SRAM), a sequence of restore pulses is periodically applied after the cell is put on Hold, which ensures that the stored data remain valid for as long as the cell is powered ON. High read 0/1 current …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Silicon nanowire on oxide/nitride/oxide for memory application",
            "Publication year": 2007,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/18/23/235204/meta",
            "Abstract": "We report the fabrication and characterization of Si nanowire memory devices with oxide/nitride/oxide stacked layers as the gate dielectrics and charge storage media. The devices were fabricated by using photolithography to pattern the metal contacts to the Si nanowires grown on pre-defined locations. A large memory window with high on/off-state current ratio due to the small radius and intrinsic doping of the Si nanowire is obtained. In addition, the simple reversible write/read/erase operations have been implemented with these memory devices. The dynamics of the nanowire/nitride charge exchange and its effect on the threshold voltage and memory retention have been investigated.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:qjMakFHDy7sC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Metrology for the electrical characterization of semiconductor nanowires",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4668556/",
            "Abstract": " Nanoelectronic devices based upon self-assembled semiconductor nanowires are excellent research tools for investigating the behavior of structures with sublithographic features as well as a promising basis for future information processing technologies. New test structures and associated electrical measurement methods are the primary metrology needs necessary to enable the development, assessment, and adoption of emerging nanowire electronics. We describe two unique approaches to successfully fabricate nanowire devices: one based upon harvesting and positioning nanowires and one based upon the direct growth of nanowires in predefined locations. Test structures are fabricated and electronically characterized to probe the fundamental properties of chemical-vapor-deposition-grown silicon nanowires. Important information about current transport and fluctuations in materials and devices can be derived …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimizing the Floating Body induced SEU sensitivity in a 0.35 µ SOI SRAM cell through recombination lifetime control",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=8834585851662134328&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Silicon nanowire on oxide/nitride/oxide for memory application",
            "Publication year": 2007,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/20931393",
            "Abstract": "We report the fabrication and characterization of Si nanowire memory devices with oxide/nitride/oxide stacked layers as the gate dielectrics and charge storage media. The devices were fabricated by using photolithography to pattern the metal contacts to the Si nanowires grown on pre-defined locations. A large memory window with high on/off-state current ratio due to the small radius and intrinsic doping of the Si nanowire is obtained. In addition, the simple reversible write/read/erase operations have been implemented with these memory devices. The dynamics of the nanowire/nitride charge exchange and its effect on the threshold voltage and memory retention have been investigated.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:umqufdRvDiIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Some issues of hot-carrier degradation and negative bias temperature instability of advanced SOI CMOS transistors",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110107000147",
            "Abstract": "Some interesting observations of hot carrier stress induced aging effects across various SOI CMOS technologies are reported in this paper. First, the influence of the floating-body strength on the hot-carrier induced degradation in N-channel 90 nm partially depleted SOI MOSFETs is investigated. Enhanced hot-carrier degradation with increasing floating-body strength is observed and possible physical mechanisms to explain the obtained results are suggested. A channel width dependent degradation mechanism, arising from the SOI nature is observed: lower degradation obtained for the narrower channels is attributed to the weakening of floating-body effect with decreasing channel width. In addition, measured data provide experimental evidence of a shift in the location of the damage in the channel further away from the drain at elevated temperatures which may be responsible for the enhanced saturation current …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Fabrication, characterization and simulation of high performance Si nanowire-based non-volatile memory cells",
            "Publication year": 2011,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-4484/22/25/254020/meta",
            "Abstract": "We report the fabrication, characterization and simulation of Si nanowire SONOS-like non-volatile memory with HfO 2 charge trapping layers of varying thicknesses. The memory cells, which are fabricated by self-aligning in situ grown Si nanowires, exhibit high performance, ie fast program/erase operations, long retention time and good endurance. The effect of the trapping layer thickness of the nanowire memory cells has been experimentally measured and studied by simulation. As the thickness of HfO 2 increases from 5 to 30 nm, the charge trap density increases as expected, while the program/erase speed and retention remain the same. These data indicate that the electric field across the tunneling oxide is not affected by HfO 2 thickness, which is in good agreement with simulation results. Our work also shows that the Omega gate structure improves the program speed and retention time for memory applications.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:Zph67rFs4hoC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Precise gas discrimination with cross-reactive graphene and metal oxide sensor arrays",
            "Publication year": 2018,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5063375",
            "Abstract": "Discriminating similar molecules remains a very challenging problem for semiconductor gas sensors. Here, we report a method to achieve precise gas discrimination of similar chemical vapors (mesitylene, o-xylene, and toluene) by using cross-reactive arrays consisting of metal oxide semiconductor and graphene sensors. It is difficult to identify these three chemicals as they have very similar responses to these sensors. Through cross-reactive Principal Component Analysis of the sensor response features, however, the discrimination accuracy improved from about 70% with a single gas sensor to almost 100% with the cross-reactive sensor array. Such a precise discrimination and the low-cost planar process make this approach a very attractive candidate for smart gas sensing and for future Internet of Things applications.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:FPJr55Dyh1AC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "The large-scale integration of high-performance silicon nanowire field effect transistors",
            "Publication year": 2009,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/21489563",
            "Abstract": "In this work we present a CMOS-compatible self-aligning process for the large-scale-integration of high-performance nanowire field effect transistors with well-saturated drain currents, steep subthreshold slopes at low drain voltage and a large on/off current ratio (>10{sup 7}). The subthreshold swing is as small as 45 mV/dec, which is substantially beyond the thermodynamic limit (60 mV/dec) of conventional planar MOSFETs. These excellent device characteristics are achieved by using a clean integration process and a device structure that allows effective gate-channel-source coupling to tune the source/drain Schottky barriers at the nanoscale.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gate assisted Kelvin test structure to measure the electron and hole flows at the same nanowire contacts",
            "Publication year": 2014,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4897008",
            "Abstract": "A gate assisted Kelvin test structure based on Si nanowire field effect transistors has been designed and fabricated for the characterization of the transistor source/drain contacts. Because the Si nanowire field effect transistors exhibit ambipolar characteristics with electron current slightly lower than the hole current, we can select the type of carriers (electrons or holes) flowing through the same contacts and adjust the current by the applied gate voltage. In this way, we are able to measure the characteristics of the same contact with either pure electron or hole flow. In addition, we found that the nanowire contacts behave very differently depending on the current flow directions. This indicates that the source and drain contact resistance can be dramatically different. Such a gate assisted Kelvin Test structure will lead to future metrology and applications in nanoelectronics.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:p__nRnzSRKYC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "New insights on the hot-carrier characteristics of 55 nm PD SOI MOSFETs",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1391618/",
            "Abstract": "We report hot-carrier degradation results for a 90 nm technology (L/sub poly/ = 55 nm) partially depleted (PD) SOI MOSFETs with electrical gate oxide thickness (Inversion mode) down to 19.5 /spl Aring/. In addition, this work investigates the effect of time dependent dielectric breakdown (TDDB) pre-stressing on the hot carrier behavior of these devices.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The rules of the resistive switching operation parameters based on Ta/Ta2O5 RRAM device",
            "Publication year": 2013,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2013APS..MARC21012L/abstract",
            "Abstract": "The resistive switching (RS) of the TaO x based RRAM has been widely studied due to its excellent endurance and thermal stability. The RS mechanism is generally understood as the formation and dissolution of nanometer-size conductive filament (CF) formed in set and reset process, respectively. However the exact process of dielectric break down remains unknown. In this work we studied the RS of the Ta/Ta 2 O 5 based RRAM devices from the dependences of operation parameters Vse t, IC C, Vrese t, and Irese t on device resistance. From statistical analysis of variation in the threshold parameters, we found that the set process is mainly determined by the voltage stress on the device, instead of current. The first forming process is different from the following set process. The forming voltage exponentially depends on the pristine resistance. The forming process gives a smallest low resistance (RLR S) for each …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emerging Reliability Issues of Nano-Scale SOI Technology",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1596051/",
            "Abstract": "In this review, the following reliability concerns: hot carrier reliability, negative-bias temperature instability (NBTI), time depended dielectric breakdown (TDDB) and electrostatic discharge, are discussed individually, and recognizing that the responsible mechanisms quite often are active simultaneously, their interdependence and interaction is also discussed",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Narrow-channel effects in LOCOS-isolated SOI MOSFETs with variable thickness",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/892772/",
            "Abstract": "The continuous trend towards smaller geometries implies the analysis of both short- and narrow-channel effects. Although the narrow channels are of high interest in low-power/low-voltage applications, relatively few and rather contrasting results have, in the past, been reported (Kuo et al, 1995; Fung et al, 1998; Wang et al, 2000; Cristoloveanu and Li, 1995; Zhao and Ioannou, 1999). The narrow-channel effects depend on the isolation technology (MESA, LOCOS, STI), wafer origin (SIMOX, Unibond, etc.), device architecture (fullyor partially depleted MOSFETs) and film thickness. In this paper, we attempt to elucidate the narrow-channel effects in fully depleted, LOCOS isolated n-MOSFETs as well as their relationship with other key dimensional effects (short channels and ultra-thin films).",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Worst case stress conditions for hot carrier induced degradation of p-channel SOI MOSFETs",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110106001997",
            "Abstract": "In this paper a comprehensive study of the worst case hot carrier stress conditions for p-channel partially depleted SOI MOSFETs is carried out. It is found that while stress at maximum gate current results to the conventional PMOSFET degradation mechanism (i.e., electron trapping in the gate oxide on the drain side), significant damage is also introduced following stress at the high gate/high drain voltage (VG = VD) condition. A series of experiments unambiguously demonstrate that this damage is not caused by hot hole injection and that device degradation mechanism at VG = VD stress condition (formation of interface states and positive oxide charges) is in fact due to negative bias temperature instability which is activated because of the self-heating effect. In addition, stress at high temperature is found to result in a shift of the worst case stress condition from maximum gate current to VG = VD.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Silicon Nanowire-Based Nonvolatile Memory Cells: Progress and Prospects",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=sZyKK_9gRC8C&oi=fnd&pg=PA201&dq=info:XS4gBwvAxtMJ:scholar.google.com&ots=a6KmsxlA_S&sig=JbJxbSaySj5kXjQweH28B-uBikM",
            "Abstract": "There is a widely recognized need for urgent progress in nonvolatile memory (NVM) technology, l driven by the exponential market growth of the ubiquitous portable and mobile electronics, such as cell phones, music players, USB and memory cards, etc. Commensurate with this demand, intensive research is carried out around the world to improve present technologies and invent new ones: for example, no fewer than eight (out of a total of 31) dedicated technical sessions at the IEDM 2007 meeting2 and one3 out of three plenary talks at the IEDM 2008 meeting ‘were dedicated on memory cell technology. To meet this demand and enable continued scaling (Moore's Law), NOR ﬂash memory is been replaced (where possible) with the much denser NAND technology, but the industry consensus is that fundamentally new innovations must be introduced beyond the 45-nm lithography node ‘generation. 3 One such innovation actively pursued by many research groups around the world is to design NVM cells based on silicon nanowires (SiNWs). 5There are several important reasons why SiNW NVM cells are expected to outperform a conventional (planar) 6 silicon NVM cell. First, because of the cylindrical symmetry, for the same value of the control gate voltage the electric ﬁeld across the tunneling oxide is bigger than in comparable conventional cells, leading to either higher performance (faster program/erase or P/E), or same performance at a lower power operation. Second, the cylindrical symmetry is particularly suitable for sealing NVM cells, where as short a channel length as possible is desired without reducing the gate oxide thickness too …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:_B80troHkn4C",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "Comparative thermal characterizations of GaAs and SiC devices",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/995723/",
            "Abstract": "The thermal characteristics of S-band silicon carbide monolithic microwave integrated circuits (MMICs) have been investigated and compared with GaAs devices. It was found that high resolution atomic force thermal microscopy measurements and accurate finite element simulations show a much higher thermal response than that predicted by first order thermal calculations and infrared measurements which give generally better agreement for the GaAs devices. This difference may be explained by an increase in the lateral heat spreading on the device due to the improved thermal conductivity of the silicon carbide. These results can have a major effect on device reliability and packaging.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study of Metal Gates on HfO2 Using Si Nanowire Field Effect Transistors as Platform",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1149/05004.0267ecst/meta",
            "Abstract": "In this work, we present an experimental study on the effect of metal gates/high-k dielectrics stacks on threshold voltage and carrier mobility in nanowire field effect transistors. The difference between effective mobility and field effect mobility of nanowire FETs has been first demonstrated. The interface states and effective work functions of the engaged metals can also be extracted by studying various metal gates.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Anomalous behaviors of FeFETs based on polar polymers with high glass temperature (Conference Presentation)",
            "Publication year": 2017,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/10365/103650Y/Anomalous-behaviors-of-FeFETs-based-on-polar-polymers-with-high/10.1117/12.2274201.short",
            "Abstract": "The low processing temperature of polymeric materials and their wide range of applications make polar polymer based ferroelectric memory very promising and attractive. The typical configuration of the ferroelectric memory cell is the FeFET (Ferroelectric field-effect-transistor) with the polar polymer incorporated in the gate dielectric stack. The memory effect in these devices originates from the polarization of the ferroelectric polymer film and results in a hysteresis of the Id-Vg characteristics. In this study, we fabricated FeFETs based on ultrathin poly-Si channel and CP1- polymer (glass-transition temperature (Tg ~260 C) as the gate dielectric.  We investigated the hysteresis of the Id-Vg curves over a wide range of temperatures and frequencies. We observed the effects of thermocycling on the device, such as the change of the hysteresis loop direction at temperatures close to Tg (associated with the change of the …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:SpbeaW3--B0C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "On the Nature of the Memory Mechanism of Gated-Thyristor Dynamic-RAM Cells",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7273751/",
            "Abstract": "With the help of numerical simulations, we revisit the operation of dynamic thin-capacitively-coupled-thyristor RAM (TRAM) and field effect diode-RAM cells and clarify the memory mechanism. The resulting carrier profiles demonstrate that the recently advanced interpretation of the physical memory (i.e., store) mechanism, as the accumulation (“1”) or depletion (“0”) of holes in the p-base (under the gate), is incorrect. Instead, it turns out that it is the presence (“0”) or absence (“1”) of deeply depleted regions within the TRAM structure, associated with the two p-n junctions on the sides of the p-base that determines the stored state of the cell.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:gsN89kCJA0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hot carrier (HC) and bias-temperature-instability (BTI) degradation of MuGFETs on silicon oxide and silicon nitride buried layers",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5331453/",
            "Abstract": "The results are reported of an experimental study of the hot carrier (HC) and bias-temperature-instability (BTI) reliability of MuGFETS, fabricated on SOI wafers with silicon oxide and silicon nitride buried layers. N- and P-channel devices of 65 nm long and 42 nm or 32 nm wide channels were stressed and measured at room temperature and at 125degC. A complicated picture emerges: HC degradation is dominant in n-MuGFETs whereas both HC and BTI mechanisms are active concurrently in p-MuGFETs under hot carrier stress. When HC degradation dominates, the wider fin devices tend to degrade more than the narrower; the reverse is generally true for BTI degradation.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unusual bias temperature instability in SiC DMOSFET",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6804166/",
            "Abstract": "We observe an unusual instability in the SiC DMOSFET transistor characteristics. From a series of bias conditions at elevated temperatures, we conclude that a high density of hole traps in the oxide near the SiO 2 /SiC interface are responsible.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PIN germanium photodetector fabrication issues and manufacturability",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5467161/",
            "Abstract": "We have designed and fabricated high-performance germanium vertical and lateral PIN photodetectors which can be integrated into electronic-photonic circuits and manufactured in a standard CMOS foundry. The performance of these devices will be reported in another paper. This paper describes production process issues and manufacturability. The intent of this paper is to provide solutions to fabrication process issues, to provide methods of cutting costs by simplifying fabrication processes, and to improve yield by widening the process tolerance windows. This paper discusses all the process issues encountered and provides solutions for each of them.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reduced floating body effects in narrow channel SOI MOSFETs",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/974811/",
            "Abstract": "An experimental demonstration is given of the reduction of floating body effects in narrow channel SOI MOSFETs, as manifested by the saturation region subthreshold characteristics, latch-up, and breakdown voltage. The mechanisms responsible for this reduction are explained by original experiments and simulations. These are a deterioration of the carrier lifetime near the channel edges caused by local stress and defects, and a lowering of the source-body built-in potential barrier, resulting from dopant outdiffusion/segregation into the isolation oxide.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Concurrent HCI-NBTI: worst case degradation condition for 65 nm p-channel SOI MOSFETs",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931707003668",
            "Abstract": "Concurrent HCI-NBTI is observed to lead to worst case degradation for the Input/Output (I/O) and core logic/high speed (HS) SOI p-channel MOSFETs from 65nm technology. HC stress degradation at room temperature in I/O PMOSFET devices shows NBTI-like behavior at higher stress voltages and “combined” HCI-NBTI at lower stress voltages. On the other hand, in HS PMOSFET devices, HC degradation is shown to be induced by a combination of HCI and NBTI across the whole stress bias voltage range. Additionally, in both I/O and HS devices, higher degradation is observed for floating-body (FB) devices at high stress voltages, which becomes comparable to body-contacted (BC) devices at lower stress voltages. It is also shown that externally applied body bias plays an important role in enhancing the degradation in I/O devices but has little effect on HS devices.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:70eg2SAEIzsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Transient thermal simulations of a three-dimensional unit cell in power control systems and high-power microwave devices",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110101002040",
            "Abstract": "Detailed numerical assessment is given supporting the need to go beyond two-dimensions for numerically analyzing the electrothermal characteristics of power control devices employed in high-performance paralleling layout topology, and high-power microwave devices in monolithic microwave integrated circuits (MMIC). An accurate understanding of transient thermal characteristics, particularly the transient power-overload failure mechanism, is needed and requires the use of three-dimensional (3-D) transient electrothermal simulations. This will enable the design optimization of these power control devices for hardening against failure due to external fault conditions. We have compared the characteristic thermal speed response of Si, SiC, and GaN power control devices under short-circuit conditions, using 3-D time-dependent simulations. Such improved thermal simulation is also very important for high-power …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The role of externally applied body-bias on the hot-carrier degradation of Partially Depleted SOI N-MOSFETs",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958017/",
            "Abstract": "No significant variations of the hot-carrier degradation of partially depleted SOI N-MOSFETs were found under the effect of an externally applied body-bias. This very interesting feature was attributed to the weak secondary impact ionization in thin film SOI. As a consequence, the reliability of such SOI devices is substantially improved as compared to bulk ones under the presence of body-bias.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nickel nanoparticle deposition at room temperature for memory applications",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167931707004297",
            "Abstract": "In this work we investigate the non-volatile memory behavior of Ni nanoparticles embedded within an insulating matrix. Nickel nanoparticles are deposited at room temperature by a new high-vacuum technique over a 4 nm tunneling thermal SiO2 layer followed by the deposition of HfO2 as a control insulator. Memory windows of ∼1.5V are observed in MOS capacitors at gate pulse voltages of 8V. Charge retention for write and erase state clearly indicate long time charge storage behavior.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AN ANALYSIS PROCEDURE FOR QUANTIFYING THE FRAGMENTATION BEHAVIOR OF 2-D MULTI-FIBER ARRAYS",
            "Publication year": 2007,
            "Publication url": "https://tsapps.nist.gov/publication/get_pdf.cfm?pub_id=903969",
            "Abstract": "With composite materials being targeted for use in structural applications, concerns have increased about their long-term structural integrity, since conventional sub-critical flaw detection methodologies are generally not effective for composites. Furthermore, concerns about composite failure models that are typically used to predict failure behavior of composites in lieu of testing have also increased due to the 1995 research of Li et al. and the 2004 research of Kim et al. These research results employing micromechanics tests on multi-fiber microcomposites indicate that the underlying shear-lag models typically used to predict composite failure behavior show an increase in fiber-flaw density along the length of a composite fiber rather than the experimentally observed decrease. More recently Kim et al. have shown that the multiple fiber fracture process observed in a single fiber composite can be captured by statistical models based on lifetime analyses. The output parameters from these analyses may provide a basis for quantifying the fiber failure process in different composite materials. To test the validity of this method, the lifetime analyses approach is extended in this report to the fiber-fracture process in multi-fiber microcomposites.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effect of floating-body and stress bias on NBTI and HCI on 65-nm SOI pMOSFETs",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4441941/",
            "Abstract": "Grounded-body (GB) core-logic/high-speed (HS) and input/output (I/O) silicon-on-insulator pMOSFETs from 65-nm technology are shown to degrade more than floating-body (FB) devices under negative bias temperature instability (NBTI) stress. However, in both cases, worst case degradation occurs when stressed under equal gate and drain voltages (V g  = V d ), whereby degradation is simultaneously induced by both NBTI and hot carrier injection (HCI) simultaneously (\"concurrent HCI-NBTI\"), the relative importance of each mechanism depending on the type of device and the bias level. The degradation of I/O pMOSFETs stressed under V g  = V d  at room temperature shows predominantly NBTI-like behavior at higher stress voltages, whereas it shows concurrent HCI-NBTI behavior at lower stress voltages. By contrast, the degradation of HS pMOSFETs stressed under V g  = V d  shows concurrent HCI-NBTI …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Control of SEU in SOI SRAMs through carrier lifetime engineering",
            "Publication year": 2003,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16546000",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D03 Electronics/001D03F Semiconductor electronics. Microelectronics. Optoelectronics. Solid state devices/001D03F06 Integrated circuits/001D03F06B Integrated circuits by function (including memories and processors)",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ferroelectricity in Polar Polymer‐Based FETs: A Hysteresis Analysis",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201705250",
            "Abstract": "There is an increasing number of reports on polar polymer‐based ferroelectric field effect transistors (FeFETs), where the hysteresis of the drain current–gate voltage (Id–Vg) curve is investigated as the result of the ferroelectric polarization effect. However, separating ferroelectric effect from many of the factors (such as charge injection/trapping and the presence of mobile ions in the polymer) that confound interpretation is still confusing and controversial. This work presents a methodology to reliably identify the confounding factors which obscure the polarization effect in FeFETs. Careful observation of the Id–Vg curves, as well as monitoring the Id–Vg hysteresis and flat band voltage shift as a function of temperature and sweep frequency, identifies the dominant mechanism. This methodology is demonstrated by using 15 nm thick high glass transition temperature polar polymer‐based FeFETs. In these devices, room …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced Capacitance Metrology for Nanoelectronic Device Characterization",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3251244",
            "Abstract": "We designed and fabricated a test chip (consisting of an array of metal‐oxide‐semiconductor (MOS) capacitors and metal‐insulator‐metal (MTM) capacitors ranging from 0.3 fF to 1.2 pF) for use in evaluating the performance of new measurement approaches for small capacitances. The complete array of capacitances was measured to obtain a “fingerprint” of capacitance values. After correcting these data for pad and other stray capacitances, such data can be used to evaluate the relative accuracy and sensitivity of a capacitance measurement instrument or circuit. This test chip was used to assess the capabilities of two different capacitance measurement approaches: an LCR meter, and a capacitance bridge. A silicon‐nanowire based capacitance test structure was fabricated and characterized by using the optimized capacitance measurement methods developed with the MOS/MIM test chip.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "A novel sub 50 nm DG-SOI self-restoring ratioed domino logic",
            "Publication year": 2005,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=17153368",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and analysis of multi-gate field-effect-diodes for embedded memory",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6135246/",
            "Abstract": "Memory arrays consume a very large area in chip designs; yet memory cell scaling lags significantly transistor scaling. With transistor channel lengths in the nanoscale regime, the six transistor static random access memory cell (6T-SRAM) and the single transistor dynamic memory (DRAM) cell both suffer from excessive leakage current. Consequently, there is a widely recognized need for urgent progress in memory technology.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling the gated-diode response of an irradiated SOI back-channel interface",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958019/",
            "Abstract": "In this work the gated-diode technique has been applied to n-channel SOI MOSFETs that were part of a test vehicle used for a 0.25 /spl mu/m SOI CMOS product development. We have shown that the gated-diode technique is a powerful technique for the evaluation of the Si-film/buried-oxide interface, and that the technique is simple in measurement configuration. Our 2D numerical simulation of the SOI back-channel gated-diode results indicates that the back-channel radiation-induced interface state concentration can be modeled as an acceptor interface state at an energy of 0.7eV.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bias temperature instability in High-κ/metal gate transistors-Gate stack scaling trends",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6241838/",
            "Abstract": "With the introduction of High-k, metal gates and alternate substrates into the gate-stack at the 45nm and 32nm technology nodes, Bias Temperature Instability (BTI) phenomena have had to be included into the chip design modeling. In this paper, we explore BTI trends with High-k transistors in manufacturing ready CMOS processes with gate last and gate first type process flows. In both flows, Positive Bias Temperature Instability (PBTI) is a strong function of the interface and High-k thickness, with aggressive interface scaling having significant adverse reliability implications. Negative Bias Temperature Instability, on the other hand, is strongly dependent on the quality of the interface and its nitrogen content. The introduction of germanium into the Si channel is found to significantly improve NBTI. With recovery effects being strong in both NBTI and PBTI, AC BTI models in realistic circuit designs are critical to accurately …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ESD-induced oxide breakdown on self-protecting GG-nMOSFET in 0.1-/spl mu/m CMOS technology",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1229718/",
            "Abstract": "Historically, the failure mode of the nMOS/lateral n-p-n (L/sub npn/) bipolar junction transistor (BJT) due to electrostatic discharge (ESD) is source-to-drain filamentation, as the temperature exceeds the melting temperature of silicon. However, as the gate-oxide thickness shrinks, the ESD failure changes over to oxide breakdown. In this paper, transmission line pulse (TLP) testing is combined with measurements of various leakage currents and numerical simulations of the electric field to examine the failure mode of an advanced 0.1-/spl mu/m CMOS technology, which is shown to be through gate-oxide breakdown. It is also shown by I/sub D/-V/sub G/ and I/sub G/-V/sub G/ measurements that the application of nondestructive ESD pulses causes gradual degradation of the oxide well before failure is reached, under the (leakage current) failure criteria used. Finally, the latent effects of stress-induced oxide degradation …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "One application of SOI memory cell-memory array",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/838731/",
            "Abstract": "A way of designing a flash memory array is illustrated. We explain the general principles of operation of a SOI flash memory cell which uses the standard way to write information and a novel method to erase information. Performances obtained by this analysis are applied to a simple memory array. An example of a layout design of 16/spl times/16 memory chip is included.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Novel sub 50nm DG-SOI Self-restoring Domino Logic",
            "Publication year": 2006,
            "Publication url": "https://iopscience.iop.org/article/10.1149/MA2005-01/12/537/meta",
            "Abstract": "Multi-gate SOI MOSFETs have been receiving increasing attention recently [1] as they are thought to be the most promising device architecture for enabling non-classical, nano-scale CMOS (beyond the 50 nm node). Among the various possibilities, the most investigated and best understood are the Symmetric Double Gate (SDG) and the Asymmetric Double Gate (ADG) structures, where for the former both gates are made of the same material, whereas in latter the two gates are made of different materials.“Fine-tuning” of the threshold voltage through the use of “exotic” non-poly gate materials is been thought necessary before these can be adopted for future CMOS circuits. To circumvent such complicated and expensive processing, we proposed in our earlier work [2] to design “pseudo-nMOS”-like, ratioed logic circuits using SDG loads and ADG drivers, and presented a family of logic elements: NOR gate, NAND …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:LO7wyVUgiFcC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Unexpected effect of thermal storage observed on SiC power DMOSFET",
            "Publication year": 2014,
            "Publication url": "https://www.scientific.net/MSF.778-780.529",
            "Abstract": "In this paper we report an unexpected improvement in the SiC DMOSFET transistor characteristics after a long temperature treatment at 150 C. The evolution of the device characteristics during a TDDB stress is compared to that after an elevated temperature treatment. The improvement in characteristics after storage at high temperature is believed to be due to instabilities caused by the quality of the SiO 2/SiC interface and its large density of defects.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Massively parallel TDDB testing: SiC power devices",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7437075/",
            "Abstract": "This paper presents a novel experimental setup to perform wafer level TDDB testing. The massively parallel reliability system is capable of testing a total of 3000 probes simultaneously. The system can perform tests at temperatures up to 400 °C for high temperature applications (SiC). We also present TDDB results of SiO2 on SiC showing higher TDDB lifetime and field acceleration compared to SiO2 on Si.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:b1wdh0AR-JQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scaling of the SOI field effect diode (FED) for memory application",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5378045/",
            "Abstract": "Memory arrays consume a very large area in chip designs, yet memory cell scaling lags significantly transistor scaling. With transistor channel lengths in the nanoscale regime, the six transistor static random access memory cell (6T-SRAM) and the (one transistor/one capacitor) dynamic memory (DRAM) both suffer from excessive leakage current. Consequently, there is a widely recognized need for urgent progress in memory technology. The thin capacitively coupled thyristor (TCCT) based memory cell (T-RAMs) approach is a most promising, CMOS compatible alternative to the standard cell both for SRAM and DRAM cell designs. However, the T-RAMs demand the precise control of doping profiles of the p-n junctions so as to achieve correct breakdown characteristics. To address these difficulties, the authors explored the possibility of replacing the thyristor with a suitable field effect diode (FED), which displays …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Steep subthreshold slope nanowire FETs with gate-induced Schottky-barrier tunneling",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5354865/",
            "Abstract": "We report Schottky-barrier (S-B) nanowire field effect transistors (NW FETs) with high-performance characteristics brought about by gate-induced Schottky-barrier tunneling. The devices exhibit sharp subthreshold slopes (as small as 45 mV/dec), well-saturated inversion-mode I DS -V DS  characteristics, and large on/off current ratios. The excellent device properties are attributed to: (i) the enhancement of tunneling through the NW FET S-B by the gate-channel-source coupling which results in sharp subthreshold slope, (ii) the clean, CMOS-compatible fabrication of NW FET leading to a high-quality dielectric/nanowire interface, and (iii) the good quality S/D barriers and low S/D series resistance associated with them. Previous studies have demonstrated high-performance nanowire and nanotube FETs with on/off current ratios ¿105 and subthreshold swings (SS's) ¿ 100 mV/dec. The sharpness of the SS is a critical …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "NBTI and concurrent HCI-NBTI degradation of 65 nm SOI PMOSFETs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4357862/",
            "Abstract": "Body contacted (BC) core logic/high speed (HS) and input/output (I/O) SOI PMOSFETs from 65 nm technology are shown to have higher degradation than the counterpart floating body (FB) devices under NBTI stress. It is also observed that concurrent HCI-NBTI (hot-carrier injection-negative bias temperature instability) leads to worst case degradation for the I/O and HS SOI p-channel MOSFETs. I/O PMOS devices stressed under HCI conditions at room temperature show NBTI-like behavior at higher stress voltages and combined HCI-NBTI behavior at lower stress voltages. HS PMOS devices stressed under HCI conditions show a combined HCI and NBTI degradation behavior across the entire stress bias range. Both HS and I/O devices degrade more when HCI stressed with FB at high stress voltages; however the degradation becomes comparable to BC devices at lower stress voltages.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling early breakdown failures of gate oxide in SiC power MOSFETs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7513406/",
            "Abstract": "One of the most serious technology roadblocks for SiC DMOSFETs is the significant occurrence of early failures in time-dependent-dielectric-breakdown testing. Conventional screening methods have proved ineffective, because the remaining population is still plagued with poor reliability. The traditional local thinning model for extrinsic (early) failures, which guides the screening through burn-in measures, simply does not work. The fact that improved cleanliness control in the fabrication process does little to reduce early failures also suggests that local thinning due to contamination is not the root cause. In this paper, we propose a new lucky defect model where bulk defects in the gate oxide, introduced during growth, are responsible for the early failures. We argue that a local increase in leakage current via trap-assisted tunneling leads to early oxide breakdown. This argument is supported with oxide breakdown …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:lmc2jWPfTJgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Degradation of High-/Metal Gate nMOSFETs Under ESD-Like Stress in a 32-nm Technology",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5661814/",
            "Abstract": "The degradation of nMOSFETs induced by nondestructive electrostatic discharge-like (ESD-like) stress in a 32-nm bulk CMOS technology was studied using  I -  V  characteristics and charge pumping measurements. The impact of stress on drain saturation current ( I dsat ), threshold voltage ( Vt ), transconductance peak ( gm ), and subthreshold swing (SS) is reported. For ESD stress applied on the drain, little degradation was observed until the device failed by drain-to-source filamentation. In contrast, for stress applied on the gate, positive ESD-like stress decreases  I dsat  and increases  Vt  of the nMOSFETs significantly, and the degradation increases with the effective gate oxide thickness. Different from positive bias temperature instability (PBTI) stress, the  Vt  shift depends on temperature rather weakly, which indicates a new dominant charge-trapping mechanism on the time scale of ESD events. In addition to …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Field effect diode memory cell: physics and design",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6628083/",
            "Abstract": "A dynamic memory cell (DRAM) based on the Field-Effect-Diode (FED) is presented, and with the help of the underlying device physics its operation is explained and guidelines for its design are presented. This cell is characterized by fast operation speed, wide read 0/1 margin, long retention time and it is compatible with CMOS technology.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Isolation techniques, parasitic sidewall conduction and narrow channel effects on SOI MOSFET’s",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=7132456560260345760&hl=en&oi=scholarr",
            "Abstract": "This paper is a review of narrow channel effects in SOI MOSFET’s, and the influence that the various isolation technologies have on these effects. First a review of the state of the art of the three basic isolation technologies LOCOS, MESA, and STI as applied to SOI will be given from the processing viewpoint. Then the possible parasitic sidewall conduction mechanisms and their control will be described and explained, with illustrations from the literature. Finally, the narrow channel effects on device parameters, reliability and leakage current will be considered. These narrow channel effects will be found to depend on the SOI silicon film and buried oxide thickness and the transistor channel length, as well as on whether the body of the transistor is floating or grounded/tied to the source. Equally importantly, the narrow channel effects will be found to depend strongly on the particular isolation technology used for the …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "NMOSFET ESD self-protection strategy and underlying failure mechanism in advanced 0.13-/spl mu/m CMOS technology",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1014666/",
            "Abstract": "In this paper, the high current characteristics encountered during electrostatic discharge (ESD) stress using nMOS/L/sub npn/ protection devices in a 0.13-/spl mu/m CMOS technology are investigated for different device parameters: channel length, channel width, gate-oxide thickness, and drain/source contact to gate (DCG/SCG) spacing. From leakage current measurements following ESD stress, it is concluded that the shorter (0.13 /spl mu/m) devices fail because of source/drain filamentation, whereas longer (0.3 /spl mu/m) devices with thin (22 /spl Aring/) oxide gate fail because of oxide breakdown. This conclusion is consistent with and supported by numerical simulations of the electric field. It is also supported by the observed effect of hot carrier stress on I/sub t2/. Hot carrier stress experiments additionally revealed that ESD stress can and does affect subsequent hot carrier degradation of the device.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Silicon nanowire NVM cell using high-k dielectric charge storage layer",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016793170800422X",
            "Abstract": "Si nanowire (SiNW) channel non-volatile memory (NVM) cells were fabricated by a “self-alignment” process. First, a layer of thermal SiO2 was grown on a silicon wafer by dry oxidation, and the SiNWs were then grown by chemical vapor deposition in pre-defined locations. This was followed by depositing the gate dielectric, which almost surrounds the nanowire and consists of three stacked layers: SiO2 blocking layer, HfO2 charge-storing layer and a thin tunneling oxide layer. Source/drain and gate electrodes were formed by photolithography and lift-off, and the devices were electrically tested. As expected from this fabrication process and the enhanced electrostatic control of the “surrounding” gate, excellent cell characteristics were obtained.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "DG-SOI ratioed logic with symmetric DG load-a novel approach for sub 50 nm LV/LP circuit design",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1272149/",
            "Abstract": "This paper investigates the possibility of using SDG (symmetric double gate) device intrinsically on structure as a load device for DG-SOI based ratioed logic, To establish the feasibility and superiority of this approach an inverter and a NOR gate were designed, which exhibits considerable advantages. The work is then extented to show how the approach can also be used to built NAND and XOR gates to create a complete logic family. All the simulations are done for 50 nm gate length devices using SILVACO tools. Voltage transfer characteristics are studied for both SDG load and ADG (asymmetric double gate) inverter. The transient characteristics obtained with a 1.25 GHz pulse on the n/sup +/-poly gate and a 500 MHz on the p/sup +/-poly gate are also studied.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An ESD protection circuit for SOI technology using gate-and body-biased MOSFET’s",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1044410/",
            "Abstract": "An ESD input/output protection circuit for 0.35 /spl mu/m PDSOI technology was designed, fabricated and tested. The design is such that bias is applied simultaneously but independently on the protection device body and gate during the ESD events, but not during normal operation. There is significant ESD protection capability (/spl sim/60%) improvement following moderate X-ray irradiation.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Topological insulator Bi 2 Se 3 nanowire high performance field-effect transistors",
            "Publication year": 2013,
            "Publication url": "https://www.nature.com/articles/srep01757",
            "Abstract": "Topological insulators are unique electronic materials with insulating interiors and robust metallic surfaces. Device applications exploiting their remarkable properties have so far been hampered by the difficulty to electrically tune the Fermi levels of both bulk and thin film samples. Here we show experimentally that single-crystal nanowires of the topological insulator Bi 2 Se 3 can be used as the conduction channel in high-performance field effect transistor (FET), a basic circuit building block. Its current-voltage characteristics are superior to many of those reported for semiconductor nanowire transistors, including sharp turn-on, nearly zero cutoff current, very large On/Off current ratio and well-saturated output current. The metallic electron transport at the surface with good FET effective mobility can be effectively separated from the conduction of bulk Bi 2 Se 3 and adjusted by field effect at a small gate voltage. This …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:z_wVstp3MssC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "AR1. 2-Cross-reactive graphene and ZnO chemical vapor sensors for precise discrimination",
            "Publication year": 2018,
            "Publication url": "https://www.ama-science.org/proceedings/details/2967",
            "Abstract": "We report a study of cross-reactive analysis based on graphene and ZnO chemical vapor sensors for precise discrimination. Transient features were extracted by exponential fitting to the sensor response curve at room temperature. Three fitting parameters were extracted for each adsorption/desorption process. A classification method based on two sets of transient features was utilized to improve the selectivity and accuracy of chemical sensing. The algorithm was first verified in the monolayer graphene sensor. The results indicated that the chemical discrimination can be significantly improved by the transient feature analysis. To further improve the performance, two different gas sensors (monolayer graphene and ZnO thin film) were prepared to perform the transient feature analysis. Consequently, two sets of testing results were obtained and the extracted transient features were applied in a cross-reactive analysis …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "\" Gated diode\" characterization of hot carrier induced interface state and oxide charge lateral profiles in SOI MOSFET's",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/892759/",
            "Abstract": "The quality and the degradation (induced by hot carriers, irradiation, etc.) of the Si-SiO/sub 2/ interfaces remains an important issue in the development of SOI CMOS technologies, and continues to be difficult to measure and characterize. We previously described (Zhao and Ioannou, 1999) a \"gated-diode\" (Speckbacher et al, 1995; Okhonin et al, 1996) based approach to measure the interface state densities of both front and back interfaces in n- and p-channel SOI MOSFETs. To measure a particular interface, the forward drain-to-body diode current is measured while scanning the corresponding gate voltage from accumulation, through depletion, to inversion. Complicated, but information-rich current curves result that contain a narrow peak, from which the interface state density can be obtained. The purpose of this paper is to incorporate opposite channel based charge injection (Ioannou et al, 1998) in the …",
            "Abstract entirety": 0,
            "Author pub id": "MP4yuEAAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Nanowire field effect junction diode",
            "Publication year": 2011,
            "Publication url": "https://patents.google.com/patent/US7989800B2/en",
            "Abstract": "FIG. 4 shows a cross section of a nanowire field effect junction diode through a Voltage gate as per an aspect of an embodiment of the present invention. FIG. 5 shows a top down view of an embodiment where the anode and cathode are constructed on top of the gate oxide layer as per an aspect of an embodiment of the present inven tion.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of ALD High-k Dielectric Films as Charge Storage Layer and Blocking Oxide in Nonvolatile Memories",
            "Publication year": 2009,
            "Publication url": "https://iopscience.iop.org/article/10.1149/1.3206647/meta",
            "Abstract": "ALD high-k dielectric films of HfO2 were utilized for the charge trapping layer and Al2O3 for the blocking oxide layer during fabrication of several Metal/Al2O3/HfO2/SiO2/Si (MAHOS) non-volatile memory (NVM) cells based on Si nanowire channel. Si nanowires grown from predefined Au catalysts were integrated into memory devices by using a self-aligning approach. For benchmarking and comparison a different Metal/SiO2/HfO2/SiO2/Si (MOHOS) nonvolatile memory cell with a SiO2 blocking layer was also processed. All the Si nanowire nonvolatile memory cells show a large memory window, good endurance and retention, however, the MAHOS cells with Al2O3 blocking layers outperform the MOHOS cell with SiO2 blocking layer.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Single event effects in PDSOI 4 M SRAM fabricated in UNIBOND",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1263847/",
            "Abstract": "Heavy ion and proton single event upsets of 4 M SOI SRAM with a hardened delay element in each memory cell were evaluated. These 4 M SRAM were fabricated in UNIBOND substrates using a radiation hardened partially depleted silicon-on-insulator CMOS technology. Limiting heavy ion upset cross-section of 1.2/spl times/10/sup -10/ cm/sup 2//bit has been achieved. Limiting proton upset cross-section of 1.1/spl times/10/sup -17/ cm/sup 2//bit has also been obtained.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Self-aligned multi-channel silicon nanowire field-effect transistors",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0038110112001955",
            "Abstract": "Si nanowire field effect transistors (SiNW FETs) with multiple nanowire channels and different gate lengths have been fabricated by using a directed assembly approach combined with a standard photolithographic process. The electrical characteristics of SiNW FETs containing different numbers of nanowire channels were measured and compared. The multi-channel SiNW FETs show excellent performance: small subthreshold slope (≈75 mV/dec), large ON/OFF ratio (≈108), good break-down voltage (>30 V) and good carrier mobility (μp ≈ 100 cm2 V−1s−1). These excellent device properties were achieved by using a clean self-alignment process and an improved device structure with Schottky barriers at the source and drain contacts. Such high-performance multi-nanowire FETs are attractive for logic, memory, and sensor applications.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:t6usbXjVLHcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Stress-induced defect generation in HfO2/SiO2stacks observed by using charge pumping and low frequency noise measurements",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4558905/",
            "Abstract": "The technique of combining the low frequency drain current noise and the frequency-dependent charge pumping techniques has been employed to extract the trap densities in both the interfacial SiO 2  layer and high-k layer in the n-type MOSFETs with HfO 2 /SiO 2  stacks. It is found that positive bias stress creates more traps in the gate dielectric stack near the gate electrode while negative stress increases the density of traps generated in the proximity of the Si substrate. The results show that under electrical stress new traps are predominantly created close to the anode side and the degree of asymmetry is surprisingly large.",
            "Abstract entirety": 1,
            "Author pub id": "MP4yuEAAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        }
    ]
}]