[{
    "name": "George Karakostas",
    "romanize name": "George Karakostas",
    "School-Department": " Computing & Software",
    "University": "McMaster University",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 6849,
    "Scholar name": "George Karakostas",
    "Scholar id": "qaT9cxAAAAAJ",
    "Affiliation": "Associate Professor of Computing & Software, McMaster University",
    "Citedby": 1751,
    "Interests": [
        "Algorithms",
        "algorithmic game theory"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=qaT9cxAAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Maximizing throughput in queueing networks with limited flexibility",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221707003785",
            "Abstract": "We study a queueing network where customers go through several stages of processing, with the class of a customer used to indicate the stage of processing. The customers are serviced by a set of flexible servers, i.e., a server is capable of serving more than one class of customers and the sets of classes that the servers are capable of serving may overlap. We would like to choose an assignment of servers that achieves the maximal capacity of the given queueing network, where the maximal capacity is λ∗ if the network can be stabilized for all arrival rates λ < λ∗ and cannot possibly be stabilized for all λ > λ∗. We examine the situation where there is a restriction on the number of servers that are able to serve a class, and reduce the maximal capacity objective to a maximum throughput allocation problem of independent interest: the total discrete capacity constrained problem (TDCCP). We prove that solving TDCCP …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:Se3iqnhoufwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Equilibrium Flows and Path Dilation for a Network Forwarding Game",
            "Publication year": 2014,
            "Publication url": "http://www.cas.mcmaster.ca/~gk/papers/Karakostas_Viglas_forwarding_experiments_JIT.pdf",
            "Abstract": "In network routing problems, assuming that packet transmission incurs costs, the optimal solution would chose to route all flow along shortest paths. Intermediate nodes will need to relay the flow in most cases and therefore will require some sort of payment, if the flow they are asked to relay does not bring any utility to them. We consider such a forwarding game on directed graphs where nodes need to send certain amount of flow (packets) to specific destinations, possibly through several relay nodes. All nodes in the network act selfishly and will forward packets only if it is to their benefit. The model assumes that each node receives some utility from sending its flow to the predetermined destinations and from receiving flow. However each node has to decide whether to relay flow as an intermediate node from other sources, as relaying has an associated cost. This model assumes that there is no payment scheme. Somewhat surprisingly, this game has possibly several strategies that allow a significant amount of the flow to be routed while all nodes have a positive outcome, which suggests that in this model the nodes have indeed incentives to relay flow even if payments are not explicitly allocated. Previous theoretical work establishes the existence of these strategies (Nash equilibrium solutions). In this work we simplify the original network model, and provide the first experimental evaluation of these equilibria for different classes of graphs. We provide clear evidence that these equilibrium solutions are indeed significant and establish how these equilibria depend on various properties of the network such as average degrees and flow demand …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "General pseudo-random generators from weaker models of computation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10631-6_110",
            "Abstract": "The construction of pseudo-random generators (PRGs) has been based on strong assumptions like the existence of one-way functions or exponential lower bounds for the circuit complexity of Boolean functions. Given our current lack of satisfactory progress towards proving these assumptions, we study the implications of constructing PRGs for weaker models of computation to the derandomization of general classes like BPP. More specifically, we show how PRGs that fool monotone circuits could lead to derandomization for general complexity classes, and how the Nisan-Wigderson construction could use hardness results for monotone circuits to produce pseudo-random strings.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Downlink traffic scheduling in green vehicular roadside infrastructure",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6352937/",
            "Abstract": "In this paper we consider the problem of scheduling for energy-efficient roadside infrastructure. In certain scenarios, vehicle locations can be predicted with a high degree of accuracy, and this information can be used to reduce downlink infrastructure-to-vehicle energy communication costs. Offline scheduling results are first presented that provide lower bounds on the energy needed to satisfy arriving vehicular communication requirements. We show that the packet-based scheduling case can be formulated as a generalization of the classical single-machine job scheduling problem with a tardiness penalty, which is referred to as α-Earliness-Tardiness. A proof is given that shows that even under a simple distance-dependent exponential radio path loss assumption, the problem is NP-complete. The remainder of the paper then focuses on timeslot-based scheduling. We formulate this problem as a Mixed-Integer …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Practical issues and algorithms for analyzing terrorist networks",
            "Publication year": 2002,
            "Publication url": "http://www.cas.mcmaster.ca/~gk/papers/wmc2002.pdf",
            "Abstract": "In social network analysis, graphs are used to model relationships between actors or participants in a social setting. Each node or vertex in the graph represents a participant or actor. Each link or edge represents a connection or relationship between two participants. A variety of graph algorithms have been developed to analyze the structure of social networks and to assess the roles or importance of the individual players. Since the September 11 bombing of the World Trade Center, social network analysis has emerged as a potential vehicle for modeling and analyzing the structure of terrorist networks [10, 15].There are a variety of measures to assess the “importance” or centrality of each actor in a social network [16]. The most popular of these centrality measures require the computation or enumeration of shortest paths between all pairs of nodes in the graph. Such computations can be time consuming in large graphs. Moreover, they may become problematic even in more moderately-sized networks when changing data or “what-if” scenario analysis warrant frequent recomputation.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vehicle-to-vehicle forwarding in green roadside infrastructure",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7038154/",
            "Abstract": "Smart scheduling can be used to reduce infrastructure-to-vehicle energy costs in delay-tolerant vehicular networks. In this paper, we show that, by combining this with vehicle-to-vehicle (V2V) forwarding, downlink (DL) traffic schedules can be generated, whose energy costs are lower than that in the single-hop case. This is accomplished by having the roadside units (RSUs) dynamically forward packets through vehicles, which are in energy-favorable locations. This paper considers both constant bit rate (CBR) and variable bit rate (VBR) air-interface options. We first derive offline schedulers for the DL RSU energy usage when V2V forwarding is added to RSU-to-vehicle communication. Both in-channel and off-channel forwarding cases are considered. The CBR and VBR cases are obtained using integer linear programming (ILP) and time-expanded graph (TEG) formulations, respectively. These schedulers provide …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:DrR-2ekChdkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure and trusted partial grey-box verification",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10207-019-00431-4",
            "Abstract": "A crucial aspect in the development of software-intensive systems is verification. This is the process of checking whether the system has been implemented in compliance with its specification. In many situations, the manufacture of one or more components of the system is outsourced. We study the case of how a third party (the verifier) can verify an outsourced component effectively, without access to all the details of the internal design of that component built by the developer. We limit the design detail that is made available to the verifier to a diagram of interconnections between the different design units within the component, but encrypt the design details within the units and also the intermediate values passed between the design units. We formalize this notion of limited information using tabular expressions to describe the functions in both the specifications and the design. The most common form of …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:zdjWy_NXXwUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Preemptive Mobile Computation Offloading With Hard Deadlines and Concurrent Local Execution",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9360656/",
            "Abstract": "This paper considers Preemptive Mobile Computation Offloading when concurrent local execution (CLE) is used to guarantee task execution time constraints. By allowing simultaneous local and remote execution, CLE ensures that job deadlines are always satisfied in the face of unforeseen wireless channel conditions. In the preemptive offloading case, at the start of each time slot, a decision is made to either continue or temporarily interrupt the offload. This mechanism allows the system to adapt when channel conditions change. The paper considers the case for homogeneous Markovian wireless channels. Using Markovian decision process stopping theory, an online energy-optimal computation offloading algorithm is formulated for preemptive offloading, referred to as Optimal Preemptive Offloading (OPO). Since the computational complexity of OPO can be prohibitive, the paper introduces three computationally …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:L_l9e5I586QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An FPTAS for the minimum total weighted tardiness problem with a fixed number of distinct due dates",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02882-3_24",
            "Abstract": "Given a sequencing of jobs on a single machine, each one with a weight, processing time, and a due date, the tardiness of a job is the time needed for its completion beyond its due date. We present an FPTAS for the basic scheduling problem of minimizing the total weighted tardiness when the number of distinct due dates is fixed. Previously, an FPTAS was known only for the case where all jobs have a common due date.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optimal mobile computation offloading with hard deadline constraints",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8730426/",
            "Abstract": "This paper considers mobile computation offloading where task completion times are subject to hard deadline constraints. Hard deadlines are difficult to meet in conventional computation offloading due to the stochastic nature of the wireless channels involved. Rather than using binary offload decisions, we permit concurrent remote and local job execution when it is needed to ensure task completion deadlines. The paper addresses this problem for homogeneous Markovian wireless channel models. An online energy-optimal computation offloading algorithm, OnOpt, is proposed. Its energy optimality is shown by constructing a time-dilated absorbing Markov process and applying dynamic programming. Closed form results are derived for general Markovian processes, and the Gilbert-Elliott channel model is used to show how the particular structure of the Markov chain can be exploited in computing optimal offload …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:eGYfIraVYiQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal multi-part mobile computation offloading with hard deadline constraints",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366419316792",
            "Abstract": "This paper considers mobile computation offloading when concurrent local execution (CLE) is used to enforce task execution time constraints. This mechanism can ensure that hard task deadlines are satisfied regardless of any randomness induced by the wireless channel, network or cloud servers. In this type of system, mobile device energy may be reduced by segmenting a task upload into multiple parts, rather than doing a conventional contiguous task upload. The paper uses this mechanism to adapt to changes in channel conditions during the offload. Unlike the contiguous task offload case however, the upload initiation times of each part must be determined dynamically. This is done while ensuring that hard task deadlines are always satisfied. In this paper, the multi-part computation offloading case is considered. In multi-part offloading, the task to be offloaded is partitioned into K upload parts before any …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:C33y2ycGS3YC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Approximation schemes for minimum latency problems",
            "Publication year": 2003,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/S0097539701399654",
            "Abstract": "The minimum latency problem, also known as the traveling repairman problem, is a variant of the traveling salesman problem in which the starting node of the tour is given and the goal is to minimize the sum of the arrival times at the other nodes. We present a quasi-polynomial time approximation scheme (QPTAS) for this problem when the instance is a weighted tree, when the nodes lie in  for some fixed d, and for planar graphs. We also present a polynomial time constant factor approximation algorithm for the general metric case. The currently best polynomial time approximation algorithm for general metrics, due to Goemans and Kleinberg, computes a 3.59-approximation.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Practical LFU implementation for web caching",
            "Publication year": 2000,
            "Publication url": "ftp://ftp.cs.princeton.edu/reports/2000/622.ps.gz",
            "Abstract": "Web caches can achieve high hit rates through exploitation of the properties of object access distribution, which is governed by Zipf’s law, in general. Web caches need to store the most popular objects and typically employ the Least Frequently Used (LFU) replacement policy, which achieves high cache hit rates, and often the highest hit rate. Correct implementation of LFU requires that replacement decisions are made based on frequency access information (popularity), for all the objects accessed since the beginning of a cache’s operation. The immensely large number of such objects renders the implementation of LFU impractical in many environments. In this paper, we introduce an alternative implementation of LFU, the Window-LFU policy, which makes replacement decisions based on access frequency measurements in a recent past, called time-window. Window-LFU achieves cache hit rates equivalent to those of LFU, but with access information from a shorter history, leading to high performance at a low cost (significantly lower than that of LFU). We provide analytical results which enable one to estimate the appropriate window size, in order to achieve the target cache hit rate of LFU. Furthermore, we present simulation results using actual traces, which indicate that the proposed Window-LFU policy behaves as expected and in some configurations it leads to better results than theoretically expected, due to dependencies between successive Web objects requests in real environments. Our∗ Research supported by NSF CAREER award NSF CCR-9502747, an Alfred Sloan Fellowship, and a Packard Fellowship.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On/off sleep scheduling in energy efficient vehicular roadside infrastructure",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655611/",
            "Abstract": "Smart downlink scheduling can be used to reduce infrastructure-to-vehicle energy costs in delay tolerant roadside networks. In this paper we incorporate this type of scheduling into ON/OFF roadside unit sleep activity, to further reduce infrastructure power consumption. To achieve significant power savings however, the OFF-to-ON sleep transitions may be very lengthy, and this overhead must be taken into account when performing the ON state scheduling. We first incorporate the OFF/ON sleep transitions into a lower bound on energy usage that can be computed for given input sample functions. An online scheduling algorithm referred to as the Flow Graph Sleep Scheduler (FGS) is then introduced, which makes locally optimum decisions about when to initiate new ON/OFF cycles. This is done by computing an estimate of the energy needed to fulfill known vehicle communication requirements with and without the …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selfish routing in the presence of side constraints",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/George-Karakostas-2/publication/279174114_Selfish_routing_in_the_presence_of_side_constraints/links/558afe6108aee99ca9ca3baa/Selfish-routing-in-the-presence-of-side-constraints.pdf",
            "Abstract": "The natural approach for describing network flow problems is to introduce side constraints that capture restrictions of a logical or technological nature, eg, capacity or budgetary constraints. We study the traffic equilibria arising from selfish routing of individual users in networks with side constraints. For the problem without side constraints the classic Wardrop principle suggests that in equilibrium for each origin-destination pair the latency on all the used routes is equal or less to the latency on all unused routes. In this paper we use a natural extension of the Wardrop principle [13] in order to obtain results on selfish routing with side constraints. The extended Wardrop principle suggests that in equilibrium flow is routed along paths of minimal latency according to a modified function that essentially incorporates penalty terms for the side constraints. This approach provides a basis for the systematic application of relevant optimization theory to selfish routing problems.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Equilibria for networks with malicious users",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10107-006-0015-2",
            "Abstract": "We consider the problem of characterizing user equilibria and optimal solutions for selfish routing in a given network. We extend the known models by considering malicious behavior. While selfish users follow a strategy that minimizes their individual cost, a malicious user will use his flow through the network in an effort to cause the maximum possible damage to the overall cost. We define a generalized model, present characterizations of flows at equilibrium and prove bounds for the ratio of the social cost of a flow at equilibrium over the cost when centralized coordination among users is allowed.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Edge pricing of multicommodity networks for selfish users with elastic demands",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11809678_5",
            "Abstract": "We examine how to induce selfish heterogeneous users in a multicommodity network to reach an equilibrium that minimizes the social cost. In the absence of centralized coordination, we use the classical method of imposing appropriate taxes (tolls) on the edges of the network. We significantly generalize previous work [20,13,9] by allowing user demands to be elastic. In this setting the demand of a user is not fixed a priori but it is a function of the routing cost experienced, a most natural assumption in traffic and data networks.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Analysis of a forwarding game without payments",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6589361/",
            "Abstract": "We consider a forwarding game on directed graphs where nodes need to send certain amount of flow (packets) to specific destinations, possibly through several relay nodes. All nodes in the network act selfishly and will forward packets only if it is to their benefit. The model assumes that each node receives some utility from sending it flow to the predetermined destinations and from receiving flow. However each node has to decide whether to relay flow as an intermediate node from other sources, as relaying has an associated cost. This model assumes that there is no payment scheme. Somewhat surprisingly, this game has possibly several strategies that allow a significant amount of the flow to be routed while all nodes have a positive outcome, which suggest that in this model the nodes have indeed incentives to relay flow even if payments are not explicitly allocated. Although previous theoretical work establishes …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A better approximation ratio for the vertex cover problem",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11523468_84",
            "Abstract": "We reduce the approximation factor for Vertex Cover to $2 - \\theta(\\frac{1}{\\sqrt{{\\rm log} n}})$ (instead of the previous $2- \\theta(\\frac{{\\rm log log} n}{{\\rm log}\\ n})$, obtained by Bar-Yehuda and Even [3], and by Monien and Speckenmeyer[11]). The improvement of the vanishing factor comes as an application of the recent results of Arora, Rao, and Vazirani [2] that improved the approximation factor of the sparsest cut and balanced cut problems. In particular, we use the existence of two big and well-separated sets of nodes in the solution of the semidefinite relaxation for balanced cut, proven in [2]. We observe that a solution of the semidefinite relaxation for vertex cover, when strengthened with the triangle inequalities, can be transformed into a solution of a balanced cut problem, and therefore the existence of big well-separated sets in the sense of [2] translates into the existence of a big independent set.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Dynamics of a localized reputation-based network protocol",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6904247/",
            "Abstract": "We consider a type of game theoretic dynamics in a network model where all nodes act selfishly and will forward packets only if it is to their benefit. The model we present assumes that each node receives utility from successfully sending its own flow to its destination(s) and from receiving flow, while it pays a cost (e.g., battery energy) for its transmissions. Each node has to decide whether to relay flow as an intermediate node from other sources, as relaying incurs only costs. To induce nodes into acting as intermediaries, the model implements a reputation-based mechanism which punishes non-cooperative nodes by cutting off links to them, a decision that is made in a very local fashion. In our setting, the nodes know only the state of the network in their local neighborhood, and can only decide on the amount of the flow on their outgoing edges, unlike the previously considered models where users have full …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy Aware Offloading for Competing Users on a Shared Communication Channel",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7425262/",
            "Abstract": "This paper considers a set of mobile users that employ cloud-based computation offloading. In order to execute jobs in the cloud, the user uploads must occur over a base station channel that is shared by all of the uploading users. Since the job completion times are subject to hard deadline constraints, this restricts the feasible set of jobs that can be processed. The system is modelled as a competitive game in which each user is interested in minimizing its own energy consumption. The game is subject to the real-time constraints imposed by the job execution deadlines, user specific channel bit rates, and the competition over the shared communication channel. The paper shows that for a wide range of parameters, a game where each user independently sets its offloading decisions always has a pure Nash equilibrium, and a Gauss-Seidel-like method for determining this equilibrium is introduced. Results are …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:UmS_249rOGwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fractional Packing and Covering Problems.",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=13534822842511128170&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the existence of optimal taxes for network congestion games with heterogeneous users",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16170-4_15",
            "Abstract": "We consider network congestion games in which a finite number of non-cooperative users select paths. The aim is to mitigate the inefficiency caused by the selfish users by introducing taxes on the network edges. A tax vector is strongly (weakly)-optimal if all (at least one of) the equilibria in the resulting game minimize(s) the total latency. The issue of designing optimal tax vectors for selfish routing games has been studied extensively in the literature. We study for the first time taxation for networks with atomic users which have unsplittable traffic demands and are heterogeneous, i.e., have different sensitivities to taxes. On the positive side, we show the existence of weakly-optimal taxes for single-source network games. On the negative side, we show that the cases of homogeneous and heterogeneous users differ sharply as far as the existence of strongly-optimal taxes is concerned: there are parallel-link …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Selfish routing with oblivious users",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72951-8_25",
            "Abstract": "We consider the problem of characterizing user equilibria and optimal solutions for selfish routing in a given network. We extend the known models by considering users oblivious to congestion. While in the typical selfish routing setting the users follow a strategy that minimizes their individual cost by taking into account the (dynamic) congestion due to the current routing pattern, an oblivious user ignores congestion altogether. Instead, he decides his routing on the basis of cheapest routes on a network without any flow whatsoever. These cheapest routes can be, for example, the shortest paths in the network without any flow. This model tries to capture the fact that routing tables for at least a fraction of the flow in large scale networks such as the Internet may be based on the physical distances or hops between routers alone. The phenomenon is similar to the case of traffic networks where a certain percentage …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Edge pricing of multicommodity networks for selfish users with elastic demands",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-008-9181-3",
            "Abstract": "We examine how to induce selfish heterogeneous users in a multicommodity network to reach an equilibrium that minimizes the social cost. In the absence of centralized coordination, we use the classical method of imposing appropriate taxes (tolls) on the edges of the network. We significantly generalize previous work (Yang and Huang in Transp. Res. Part B 38:1–15, [2004]; Karakostas and Kolliopoulos in Proceedings of the 45th Annual IEEE Symposium on Foundations of Computer Science, pp. 268–276, [2004]; Fleischer et al. in Proceedings of the 45th Annual IEEE Symposium on Foundations of Computer Science, pp. 277–285, [2004]) by allowing user demands to be elastic. In this setting the demand of a user is not fixed a priori but it is a function of the routing cost experienced, a most natural assumption in traffic and data networks.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Energy Efficient Scheduling in Green Vehicular Infrastructure with Multiple Roadside Units",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6845370/",
            "Abstract": "In this paper, we propose low-complexity algorithms for downlink traffic scheduling in green vehicular roadside infrastructure. In multiple roadside unit (RSU) deployments, the energy provisioning of the RSUs may differ, and it is therefore desirable to balance RSU usage from a normalized min-max energy viewpoint. This paper considers both splittable RSU assignment (SRA) and unsplittable RSU asssignment (URA) scheduling. An offline integer linear programming bound is first derived for normalized min-max RSU energy usage. We then show that in the SRA case, there is a polynomial complexity 2-approximation bound for the normalized min-max energy schedule. This paper then proposes several online scheduling algorithms. The first is a greedy online algorithm that makes simple RSU selections, followed by minimum-energy time slot assignments. A normalized min-max algorithm is then proposed [2 …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Faster approximation schemes for fractional multicommodity flow problems",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1328911.1328924",
            "Abstract": "We present fully polynomial approximation schemes for concurrent multicommodity flow problems that run in time of the minimum possible dependencies on the number of commodities k. We show that by modifying the algorithms by Garg and Könemann [1998] and Fleischer [2000], we can reduce their running time on a graph with n vertices and m edges from Õ(ε−2(m2 + km)) to Õ(ε−2m2) for an implicit representation of the output, or Õ(ε−2(m2 + kn for an explicit representation, where Õ(f) denotes a quantity that is O(f logO(1)m). The implicit representation consists of a set of trees rooted at sources (there can be more than one tree per source), and with sinks as their leaves, together with flow values for the flow directed from the source to the sinks in a particular tree. Given this implicit representation, the approximate value of the concurrent flow is known, but if we want the explicit flow per commodity per edge, we …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:RJOyoaXV5v8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Edge pricing of multicommodity networks for heterogeneous selfish users",
            "Publication year": 2004,
            "Publication url": "http://www.cas.mcmaster.ca/~gk/papers/focs04.pdf",
            "Abstract": "We examine how the selfish behavior of heterogeneous users in a network can be regulated through economic disincentives, ie, through the introduction of appropriate taxation. One wants to impose taxes on the edges so that any traffic equilibrium reached by the selfish users who are conscious of both the travel latencies and the taxes will minimize the social cost, ie, will minimize the total latency. We generalize previous results of Cole, Dodis and Roughgarden that held for a single origin-destination pair to the multicommodity setting. Our approach, which could be of independent interest, is based on the formulation of traffic equilibria as a nonlinear complementarity problem by Aashtiani and Magnanti [1]. We extend this formulation so that each of its solutions will give us a set of taxes that forces the network users to conform, at equilibrium, to a certain prescribed routing. We use the special nature of the prescribed minimum-latency flow in order to reduce the difficult nonlinear complementarity formulation to a pair of primal-dual linear programs. LP duality is then enough to derive our results.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the complexity of intersecting finite state automata",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/856753/",
            "Abstract": "We consider the problem of testing whether the intersection of a collection of k automata is empty. The straightforward algorithm for solving this problem runs in time /spl sigma//sup k/ where a is the size of the automata. In this work we prove that the assumption that there exists a better algorithm solving the FSA intersection emptiness problem implies that nondeterministic time is in subexponential deterministic time and also separates NL from P. Furthermore, under a (more general) non-uniform variant of the assumption mentioned above we can prove that NL/spl ne/NP.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Combining capital and operating expenditure costs in vehicular roadside unit placement",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7845728/",
            "Abstract": "This paper considers the problem of vehicular roadside unit (RSU) placement so that the sum of capital expenditure (CAPEX) and operating expenditure (OPEX) costs is minimized. The minimum cost solution considers these two cost contributions jointly when making RSU placement decisions. The input to the placement process consists of historical vehicular traffic traces and a set of candidate site locations from which RSU placements are chosen. An integer linear program (ILP) formulation is first given that computes the minimum cost placement based on the input traffic traces and candidate locations. A practical algorithm is then introduced that solves a relaxed version of the ILP and uses a novel rounding procedure to obtain real RSU placements. The algorithm takes into account the energy costs incurred by vehicular requests when the latter are scheduled using a minimum energy online scheduler …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:silx2ntsSuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the complexity of intersecting finite state automata and NL versus NP",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397502008307",
            "Abstract": "We consider uniform and non-uniform assumptions for the hardness of an explicit problem from finite state automata theory. First we show that a small improvement in the known straightforward algorithm for this problem can be used to design faster algorithms for subset sum and factoring, and improved deterministic simulations for non-deterministic time. On the other hand, we can use the same improved algorithm for our FSA problem to prove complexity class separation results (NL is not equal to P, or NP for the non-uniform case). This result can be viewed either as a hardness result for the FSA intersection problem, or as a method for separating NL from P or NP. It is interesting to note that this approach is based on a more general method for separating two complexity classes, using algorithms rather than lower bounds.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Efficient Mobile Computation Offloading with Hard Task Deadlines and Concurrent Local Execution",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9322382/",
            "Abstract": "This paper considers the problem of algorithmic efficiency in mobile computation offloading with Concurrent Local Execution (CLE). Online energy optimal algorithms can be developed when CLE is used to guarantee hard task deadlines while offloading over Markovian wireless channels. Unfortunately, these algorithms often have a high computational complexity, which prohibits their use in online mobile implementations. Three algorithms are introduced to reduce this complexity: Markovian Compression (MC), Time Compression (TC) and Preemption Using Continuous Offloading (Preemption-CO). MC and TC reduce the state space of the offloading Markovian process, by using a novel notion of geometric similarity, or by running an optimal online offloading algorithm in periodic time steps. In Preemption-CO, while a task is offloaded preemptively, the offloading decision at every time-slot is based on non …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:tHtfpZlB6tUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Social exchange networks with distant bargaining",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397513008773",
            "Abstract": "Network bargaining is a natural extension of the classical, 2-player Nash bargaining solution to the network setting. Here one is given an exchange network G connecting a set of players V in which edges correspond to potential contracts between their endpoints. In the standard model, a player may engage in at most one contract, and feasible outcomes therefore correspond to matchings in the underlying graph. Kleinberg and Tardos [STOC'08] recently proposed this model, and introduced the concepts of stability and balance for feasible outcomes. The authors characterized the class of instances that admit such solutions, and presented a polynomial-time algorithm to compute them.In this paper, we generalize the work of Kleinberg and Tardos by allowing agents to engage into more complex contracts that span more than two agents. We provide suitable generalizations of the above stability and balance notions …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer LNCS"
        },
        {
            "Title": "On derandomization and average-case complexity of monotone functions",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397512001582",
            "Abstract": "We investigate whether circuit lower bounds for monotone circuits can be used to derandomize randomized monotone circuits. We show that, in fact, any derandomization of randomized monotone computations would derandomize all randomized computations, whether monotone or not. We prove similar results in the settings of pseudorandom generators and average-case hard functions — that a pseudorandom generator secure against monotone circuits is also secure with somewhat weaker parameters against general circuits, and that an average-case hard function for monotone circuits is also hard with somewhat weaker parameters for general circuits.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Variable-bit-rate transmission schedule generation in green vehicular roadside units",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7056494/",
            "Abstract": "Smart traffic scheduling can be used to reduce downlink roadside unit (RSU) energy use in green vehicular roadside infrastructure. In this paper, we consider the problem of downlink schedule generation when the RSU-to-vehicle radios use a variable bit rate (VBR) air interface. We first present offline scheduling formulations that provide lower bounds on the energy required to fulfill vehicle requests. An integer linear program is introduced that can be solved to find optimal offline VBR time slot schedules. We then prove that this problem is NP-complete by a reduction from the well-known Santa Claus problem. Two flow-graph-based models are then used to solve the minimum energy VBR scheduling problem. The first uses generalized flow (GF) graphs that represent time slots as individual graph nodes. The second uses time-expanded graphs (TEGs) that model the temporal evolution of the system. Both of these …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:TlpoogIpr_IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal Multi-Decision Mobile Computation Offloading with Hard Task Deadlines",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8969696/",
            "Abstract": "Multi-decision mobile computation offloading occurs when a task to be remotely executed is uploaded in separate parts. Since the upload is partitioned, separate decisions are needed to determine the best time to initiate each upload. The multi-decision problem is considered for the case where execution completion times are subject to hard deadline constraints and where task offloads occur over a Markovian wireless channel. An online energy-optimal computation offloading algorithm, Multiopt (Multi-decision online Optimum), is introduced, whose optimality is proven using Markovian stopping theory. The paper presents results using the Gilbert-Elliott channel model, where task completion time probabilities can be efficiently computed using Dynamic Programming. Although the proposed algorithm is proven to be energy optimal, its performance is also compared to four others, namely, Immediate Offloading …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:1tZ8xJnm2c8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploitation of different types of locality for web caches",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1021680/",
            "Abstract": "Object access distribution in the Web is governed by Zipf's law, in general. This property leads to effective Web caches, which store the most popular objects and typically employ the LFU replacement policy, which achieves high, and often the highest, cache hit rates. However, Web cache design based only on Zipf's law has two main disadvantages: (i) it does not exploit the temporal and spatial locality of user accesses on a per session basis, and (ii) LFU implementation is costly and impractical in many environments, because it requires statistics on all objects accessed since the beginning of a cache's operation. We consider all parameters of locality of references in the Web (temporal, spatial and popularity) and draw an analogy with processor caches. Given cache replacement policies that address different locality characteristics, we argue that there exist replacement algorithms that combine these characteristics …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Treasure evacuation with one robot on a disk",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S030439752030640X",
            "Abstract": "A robot is located at a point in the plane. A treasure and an exit, both stationary, are located at unknown (to the robot) positions both at distance one from the robot. Starting from its initial position, the robot aims to fetch the treasure to the exit. At any time the robot can move anywhere on the disk with constant speed. The robot detects an interesting point (treasure or exit) only if it passes over the exact location of that point. Given that an adversary controls the locations of both the treasure and the exit on the perimeter, we are interested in designing algorithms that minimize the treasure-evacuation time, ie the time it takes for the treasure to be discovered and brought to the exit by the robot. This seemingly simple treasure evacuation problem turns out to be surprisingly challenging. In this paper we differentiate how the robot's knowledge of the distance between the two interesting points affects the overall evacuation time …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:Wq2b2clWBLsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Using reputation instead of tolls in repeated selfish routing with incomplete information",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41392-6_10",
            "Abstract": "We study the application of reputation as an instigator of beneficial user behavior in selfish routing and when the network users rely on the network operator for information on the network traffic. Instead of the use of tolls or artificial delays, the network operator takes advantage of the users’ insufficient information, in order to manipulate them through the information he himself provides. The issue that arises then is what can the operator’s gain be, without compromising by too much the trust users put on the information provided, i.e., by maintaining a reputation for (at least some) trustworthiness. Our main contribution is the modeling of such a system as a repeated game of incomplete information in the case of single-commodity general networks. This allows us to apply known folk-like theorems to get bounds on the price of anarchy that are better in the worst-case (if that is possible at all) than the well-known …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A better approximation ratio for the vertex cover problem",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1597036.1597045",
            "Abstract": "We reduce the approximation factor for the vertex cover to 2 − Θ (1/√logn) (instead of the previous 2 − Θ ln ln n/2ln n obtained by Bar-Yehuda and Even [1985] and Monien and Speckenmeyer [1985]). The improvement of the vanishing factor comes as an application of the recent results of Arora et al. [2004] that improved the approximation factor of the sparsest cut and balanced cut problems. In particular, we use the existence of two big and well-separated sets of nodes in the solution of the semidefinite relaxation for balanced cut, proven by Arora et al. [2004]. We observe that a solution of the semidefinite relaxation for vertex cover, when strengthened with the triangle inequalities, can be transformed into a solution of a balanced cut problem, and therefore the existence of big well-separated sets in the sense of Arora et al. [2004] translates into the existence of a big independent set.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:2osOgNQ5qMEC",
            "Publisher": "ACM"
        },
        {
            "Title": "A 2+ ɛ approximation algorithm for the k-MST problem",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s10107-005-0693-1",
            "Abstract": "For any ɛ > 0 we give a (2 + ɛ)-approximation algorithm for the problem of finding a minimum tree spanning any k vertices in a graph (k-MST), improving a 3-approximation algorithm by Garg [10]. As in [10] the algorithm extends to a (2 + ɛ)-approximation algorithm for the minimum tour that visits any k vertices, provided the edge costs satisfy the triangle inequality.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:8Xgff_V0N9gC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Equilibria for networks with malicious users",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24587-2_71",
            "Abstract": "We consider the problem of characterizing user equilibria and optimal solutions for selfish routing in a given network. We extend the known models by considering malicious behaviour. While selfish users follow a strategy that minimizes their individual cost, a malicious user will use his flow through the network in an effort to cause the maximum possible damage to this cost. We define a generalized model, present characterizations of flows at Wardrop equilibrium and prove bounds for the ratio of the social cost of a flow at Wardrop equilibrium over the cost when centralized coordination among users is allowed.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Maximizing throughput in queueing networks with limited flexibility",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11682462_38",
            "Abstract": "We study a queueing network where customers go through several stages of processing, with the class of a customer used to indicate the stage of processing. The customers are serviced by a set of flexible servers, i.e., a server may be capable of serving more than one class of customer and the sets of classes that the servers are capable of serving may overlap. We would like to choose an assignment of servers that achieves the maximal capacity of the given queueing network, where the maximal capacity is λ* if the network can be stabilized for all arrival rates λ < λ* and cannot possibly be stabilized for all λ > λ*. We examine the situation where there is a restriction on the number of servers that are able to serve a class, and reduce the maximal capacity objective to a maximum throughput allocation problem of independent interest: the Total Discrete Capacity Constrained Problem (TDCCP). We …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Emergency connectivity in ad-hoc networks with selfish nodes",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-78773-0_31",
            "Abstract": "Inspired by the CONFIDANT protocol [1], we define and study a basic reputation-based protocol in multihop wireless networks with selfish nodes. Its reputation mechanism is implemented through the ability of any node to define a threshold of tolerance for any of its neighbors, and to cut the connection to any of these neighbors that refuse to forward an amount of flow above that threshold. The main question we would like to address is whether one can set the initial conditions so that the system reaches an equilibrium state where a non-zero amount of every commodity is routed. This is important in emergency situations, where all nodes need to be able to communicate even with a small bandwidth. Following a standard approach, we model this protocol as a game, and we give necessary and sufficient conditions for the existence of non-trivial Nash equilibria. Then we enhance these conditions with extra …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Results on Approximation Algorithms",
            "Publication year": 2000,
            "Publication url": "https://search.proquest.com/openview/c13cae5a13f2a28bcf20577ab1afad85/1?pq-origsite=gscholar&cbl=18750&diss=y",
            "Abstract": "This thesis presents approximation algorithms for three problems: the Minimum Latency Tour problem, the k-Minimum Spanning Tree problem on graphs and the implementation of the Perfect-LFU (Least Frequently Used) policy for Web caching.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The efficiency of optimal taxes",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11527954_2",
            "Abstract": "It is well known that the selfish behavior of users in a network can be regulated through the imposition of the so-called optimal taxes on the network edges. Any traffic equilibrium reached by the selfish users who are conscious of both the travel latencies and the taxes will minimize the social cost, i.e., will minimize the total latency.Optimal taxes incur desirable behavior from the society point of view but they cause disutility to the network users since the users’ total cost is in general increased [4]. Excessive disutility due to taxation may be undesirable from the societal perspective as well. In this work we examine the efficiency of taxation as a mechanism for achieving the desired goal of minimizing the social cost. We show that for large classes of latency functions the total disutility due to taxation that is caused to the users and/or the system is bounded with respect to the social optimum. In addition, we …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Capacity augmentation in energy-efficient vehicular roadside infrastructure",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8249032/",
            "Abstract": "This paper considers the problem of capacity augmentation in energy efficient road-side unit (RSU) deployments. RSU placements for a road network, and a set of vehicular traffic flow design traces are used as inputs. The objective is to find an RSU radio capacity assignment that minimizes the long-term operating expenditure costs subject to meeting packet deadline constraints with a given packet loss rate target. A procedure, referred to as the capacity augmentation (CA) algorithm, is proposed that iterates over the RSUs, selecting candidates for capacity augmentation based on their packet loss rate sensitivities. A variety of results are presented that characterize and compare the performance of the CA Algorithm using a greedy online packet scheduler. In particular, we show how to counterbalance the lack of causality in designing the RSU network when it is used for the online scheduling of incoming transmission …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:27LrP4qxOz0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Search-and-Fetch with 2 Robots on a Disk: Wireless and Face-to-Face Communication Models",
            "Publication year": 2019,
            "Publication url": "https://dmtcs.episciences.org/5528",
            "Abstract": "We initiate the study of a new problem on searching and fetching in a distributed environment concerning treasure-evacuation from a unit disk. A treasure and an exit are located at unknown positions on the perimeter of a disk and at known arc distance. A team of two robots start from the center of the disk, and their goal is to fetch the treasure to the exit. At any time the robots can move anywhere they choose on the disk, independently of each other, with the same speed. A robot detects an interesting point (treasure or exit) only if it passes over the exact location of that point. We are interested in designing distributed algorithms that minimize the worst-case treasure-evacuation time, i.e. the time it takes for the treasure to be discovered and brought (fetched) to the exit by any of the robots.   The communication protocol between the robots is either wireless, where information is shared at any time, or face-to-face (i.e. non-wireless), where information can be shared only if the robots meet. For both models we obtain upper bounds for fetching the treasure to the exit. Our main technical contribution pertains to the face-to-face model. More specifically, we demonstrate how robots can exchange information without meeting, effectively achieving a highly efficient treasure-evacuation protocol which is minimally affected by the lack of distant communication. Finally, we complement our positive results above by providing a lower bound in the face-to-face model.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:0aBXIfxlw9sC",
            "Publisher": "Episciences. org"
        },
        {
            "Title": "Proof for effective and efficient Web caching",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/document/1003030/",
            "Abstract": "Perfect-LFU, the optimal replacement policy for Web caches, achieves high performance (cache hit-rate) exploiting Zipf's law, but is very expensive to implement. It is proved that an alternative policy, called window-LFU, achieves equivalent performance at a significantly lower cost.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:0EnyYjriUFMC",
            "Publisher": "IET"
        },
        {
            "Title": "An FPTAS for the minimum total weighted tardiness problem with a fixed number of distinct due dates",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2344422.2344430",
            "Abstract": "Given a sequencing of jobs on a single machine, each one with a weight, processing time, and a due date, the tardiness of a job is the time needed for its completion beyond its due date. We present an FPTAS for the basic scheduling problem of minimizing the total weighted tardiness when the number of distinct due dates is fixed. Previously, an FPTAS was known only for the case where all jobs have a common due date.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "ACM"
        },
        {
            "Title": "Scheduling in green vehicular infrastructure with multiple roadside units",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655264/",
            "Abstract": "Smart scheduling can be used to reduce infrastructure energy costs in vehicular roadside networks [1]. In this paper we consider the scheduling problem when there are multiple roadside units (RSUs) in tandem. In this case it is often desirable to load balance the energy consumption across the roadside units so that energy provisioning costs can be reduced as much as possible. We first derive an integer linear programming bound on the min-max energy usage of the roadside units for a given input sample function. This bound is used for comparisons with two proposed on-line scheduling algorithms. The first is a low complexity First-Come-First-Assigned (FCFA) scheduler that makes greedy RSU selections followed by a minimum energy time slot assignment. The second algorithm, the Greedy Flow Graph Algorithm (GFGA), makes the same RSU selection but reassigns time slots whenever a new vehicle is …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Faster approximation schemes for fractional multicommodity flow problems",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:iH-uZ7U-co4C",
            "Publisher": "ACM/SIAM"
        },
        {
            "Title": "Stackelberg strategies for selfish routing in general multicommodity networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-007-9018-5",
            "Abstract": " A natural generalization of the selfish routing setting arises when some of the users obey a central coordinating authority, while the rest act selfishly. Such behavior can be modeled by dividing the users into an α fraction that are routed according to the central coordinator’s routing strategy (Stackelberg strategy), and the remaining 1−α that determine their strategy selfishly, given the routing of the coordinated users. One seeks to quantify the resulting price of anarchy, i.e., the ratio of the cost of the worst traffic equilibrium to the system optimum, as a function of α. It is well-known that for α=0 and linear latency functions the price of anarchy is at most 4/3 (J. ACM 49, 236–259, 2002). If α tends to 1, the price of anarchy should also tend to 1 for any reasonable algorithm used by the coordinator.  We analyze two such algorithms for Stackelberg routing, LLF and SCALE. For general topology networks …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A 2+ ε approximation algorithm for the k-MST problem",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/pdf/10.5555/338219.338636",
            "Abstract": "For any e> 0 we give a (2+ e)-approximation algorithm for the problem of finding a minimum tree spanning any k vertices in a graph (k-MST), improving a 3-approximation algorithm by Garg [5]. As in [5] the algorithm extends to a (2+ e)-approximation algorithm for the minimum tour that visits any k vertices, provided the edge costs satisfy the triangle inequality.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:2v_ZtQDX9iAC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Search-and-fetch with one robot on a disk",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-53058-1_6",
            "Abstract": "A robot is located at a point in the plane. A treasure and an exit, both stationary, are located at unknown (to the robot) positions both at distance one from the robot. Starting from its initial position, the robot aims to fetch the treasure to the exit. At any time the robot can move anywhere on the disk with constant speed. The robot detects an interesting point (treasure or exit) only if it passes over the exact location of that point. Given that an adversary controls the locations of both the treasure and the exit on the perimeter, we are interested in designing algorithms that minimize the treasure-evacuation time, i.e. the time it takes for the treasure to be discovered and brought to the exit by the robot.In this paper we differentiate how the robot’s knowledge of the distance between the two interesting points affects the overall evacuation time. We demonstrate sthe difference between knowing the exact value of that distance …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:k_7cPK9k7w8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Effective caching of Web objects using Zipf's law",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/871464/",
            "Abstract": "Web accesses follow Zipf's law with a good approximation, as measurements and observations indicate. This property provides an important tool in the design of Web caching architectures, because it allows designers to calculate appropriate cache sizes to achieve the desired hit ratios. The appropriate cache size combined with an LFU replacement policy achieves high cache hit rates. However, LFU replaces objects based on frequency measurements of past accesses. Thus, the system achieves high hit rates only after these measurements are reliable and converge to the final Zipf distribution. In this paper, we provide an analysis using Chernoff's bound and a calculation of an upper bound of the number of initial requests that need to be processed in order to obtain measurements of popularity with high confidence and a measured Zipf distribution which converges to the correct one.",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy efficient offloading for competing users on a shared communication channel",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7248815/",
            "Abstract": "In this paper we consider mobile users that employ computation offloading. In computational offloading, users can reduce energy consumption by executing jobs on a remote cloud server, rather than locally. In order to execute a job in the cloud, a mobile user must upload the job over a base station channel which is shared by all of the uploading users. The jobs are subject to hard deadline constraints, and since the channel quality may be different for each user, this may restrict the users ability to reduce energy usage. The system is modelled as a competitive game where each user is interested in minimizing its own energy use. The game is subject to the real-time constraints imposed by job execution deadlines, user specific channel bit rates, and the competition over the shared communication channel. The paper shows that for known classes of parameters, a game where each user independently adjusts its …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Approximation Schemes for Fractional Multicommodity Flow Problems",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "qaT9cxAAAAAJ:LXmCCkuhhTsC",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Energy Provisioning and Operating Costs in Hybrid Solar-Powered Infrastructure",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6819833/",
            "Abstract": "In this paper, we consider the operating and capital expenditure (CAPEX) costs of solar-powered additions to infrastructure that is operated from the power grid. The CAPEX costs are those associated with provisioning the solar power components, and are selected using an offline design optimization. Once the solar add-on is designed and deployed, the node incurs ongoing operating expenditure (OPEX) costs associated with the purchase of power grid energy. Lower bounds on cost are derived using a linear programming formulation, where the solar power components are sized using historical solar insolation traces and projected loading data. Different node add-on arrangements are considered, which result in various solar/battery and grid configurations. Three energy scheduling algorithms are then introduced to optimize online OPEX costs. A variety of results are presented that show the extent to which a …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Emergency connectivity in ad-hoc networks with selfish nodes",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-012-9675-x",
            "Abstract": "Inspired by the CONFIDANT protocol (Buchegger and Boudec in Proceedings of the 3rd ACM International Symposium on Mobile Ad Hoc Networking & Computing, pp. 226–236, 2002), we define and study a basic reputation-based protocol in multihop wireless networks with selfish nodes. Its reputation mechanism is implemented through the ability of any node to define a threshold of tolerance for any of its neighbors, and to cut the connection to any of these neighbors that refuse to forward an amount of flow above that threshold. The main question we would like to address is whether one can set the initial conditions so that the system reaches an equilibrium state where a non-zero amount of every commodity is routed. This is important in emergency situations, where all nodes need to be able to communicate even with a small bandwidth. Following a standard approach, we model this protocol as a game …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The effect of vehicle route uncertainty in green roadside communication",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8377106/",
            "Abstract": "This paper addresses the problem of scheduling transmission requests in vehicular networks so that long-term road side unit (RSU) energy costs are minimized. We demonstrate that knowledge of vehicular routes greatly improves the energy service costs and request drop ratio of RSU transmission. At the same time, simple and fast prediction algorithms can recover a significant portion of the loss incurred by a lack of vehicle route knowledge. The proposed algorithms use recent historical traffic data and simple calculations, such as Bayesian estimates, to predict the next few routing decisions by a vehicle, in order to load balance the scheduling of its requests over the RSU network. Our simulation results show that, while the common assumption in the literature of knowing the vehicle routes is indeed crucial for achieving good performance, simple algorithms can be used in cases where vehicle routes are not known …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:X9ykpCP0fEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the degradation of performance for traffic networks with oblivious users",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0191261510000998",
            "Abstract": "We consider the problem of characterizing user equilibria and optimal solutions for routing in a given network. We extend the known models by considering users oblivious to congestion in the following sense: While in the typical user equilibrium setting the users follow a strategy that minimizes their individual cost by taking into account the (dynamic) congestion due to the current routing pattern, an oblivious user ignores congestion altogether; instead, he or she decides his routing on the basis of cheapest routes on a network without any flow whatsoever. These cheapest routes can be, for example, the shortest paths in the network without any flow. This model tries to capture the fact that a certain percentage of travelers base their route simply on the distances they observe on a map, without thinking (or knowing, or caring) about the delays experienced on this route due to their fellow travelers. In this work we study …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Know when to persist: Deriving value from a stream buffer",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397517304607",
            "Abstract": "We consider Persistence, a new online problem concerning optimizing weighted observations in a stream of data when the observer has limited buffer capacity. A stream of weighted items arrive one at a time at the entrance of a buffer with two holding locations. A processor (or observer) can process (observe) an item at the buffer location it chooses, deriving this way the weight of the observed item as profit. The main constraint is that the processor can only move synchronously with the item stream. Persistence is the online problem of scheduling the processor movements through the buffer so that its total derived value is maximized under this constraint. We study the performance of the straight-forward heuristic Threshold, i.e., forcing the processor to “follow” an item through the whole buffer only if its value is above a threshold. We analyze both the optimal offline and Threshold algorithms in the cases where the …",
            "Abstract entirety": 0,
            "Author pub id": "qaT9cxAAAAAJ:mWEH9CqjF64C",
            "Publisher": "Elsevier"
        }
    ]
}]