[{
    "name": "George Zouridakis",
    "romanize name": "George Zouridakis",
    "School-Department": "Engineering Technology",
    "University": "University of Houston",
    "Rank": "Καθηγητής",
    "Apella_id": 10132,
    "Scholar name": "George Zouridakis",
    "Scholar id": "1tQZV14AAAAJ",
    "Affiliation": "Associate Dean for Research and Graduate Studies, University of Houston",
    "Citedby": 4489,
    "Interests": [
        "Brain Connectivity",
        "Traumatic Brain Injury",
        "Handheld Diagnostic Devices",
        "Skin Cancer"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=1tQZV14AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Functional connectivity networks in the autistic and healthy brain assessed using Granger causality",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5626702/",
            "Abstract": "In this study, we analyze brain connectivity based on Granger causality computed from magnetoencephalographic (MEG) activity obtained at the resting state in eight autistic and eight normal subjects along with measures of network connectivity derived from graph theory in an attempt to understand how communication in a human brain network is affected by autism. A connectivity matrix was computed for each subject individually and then group templates were estimated by averaging all matrices in each group. Furthermore, we performed classification of the subjects using support vector machines and Fisher's criterion to rank the features and identify the best subset for maximum separation of the groups. Our results show that a combined model based on connectivity matrices and graph theory measures can provide 87.5% accuracy in separating the two groups. These findings suggest that analysis of functional …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatiotemporal profiles of brain activation during learning and strategy formulation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4387765/",
            "Abstract": "How do humans learn complex visuomotor tasks with a strategic component? We explore this question in the context of the Naval Research Laboratories Navigation Task that is used for selecting and training future submarine pilots. About 50% of participants fail to achieve the desired competence level on the task, even after a large number of trials. A central question in this project is whether we can analyze learning failures rapidly enough to intervene during training. To this end, we set out to identify a neural signature of strategy formulation by adopting a system-of-systems approach to dynamically track the learning state of a subject using measurements of brain activity and coordinated visuomotor actions throughout the learning process. We analyzed the spatiotemporal profiles of brain activation using a coherence measure and interpreted them based on the visuomotor performance data. Our results show the …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D modeling to characterize lamina cribrosa surface and pore geometries using in vivo images from normal and glaucomatous eyes",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=boe-4-7-1153",
            "Abstract": "En face adaptive optics scanning laser ophthalmoscope (AOSLO) images of the anterior lamina cribrosa surface (ALCS) represent a 2D projected view of a 3D laminar surface. Using spectral domain optical coherence tomography images acquired in living monkey eyes, a thin plate spline was used to model the ALCS in 3D. The 2D AOSLO images were registered and projected onto the 3D surface that was then tessellated into a triangular mesh to characterize differences in pore geometry between 2D and 3D images. Following 3D transformation of the anterior laminar surface in 11 normal eyes, mean pore area increased by 5.1 ± 2.0% with a minimal change in pore elongation (mean change = 0.0 ± 0.2%). These small changes were due to the relatively flat laminar surfaces inherent in normal eyes (mean radius of curvature = 3.0 ± 0.5 mm). The mean increase in pore area was larger following 3D transformation in …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:XiSMed-E-HIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "SkinScan©: A portable library for melanoma detection on handheld devices",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5872372/",
            "Abstract": "We have developed a portable library for automated detection of melanoma termed SkinScan ©  that can be used on smartphones and other handheld devices. Compared to desktop computers, embedded processors have limited processing speed, memory, and power, but they have the advantage of portability and low cost. In this study we explored the feasibility of running a sophisticated application for automated skin cancer detection on an Apple iPhone 4. Our results demonstrate that the proposed library with the advanced image processing and analysis algorithms has excellent performance on handheld and desktop computers. Therefore, deployment of smartphones as screening devices for skin cancer and other skin diseases can have a significant impact on health care delivery in underserved and remote areas.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel tool for detecting Buruli ulcer disease based on multispectral image analysis on handheld devices",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6864298/",
            "Abstract": "In this paper, we propose a new approach for detecting Buruli ulcer disease automatically based on computerized analysis of multispectral dermoscopic images. We employ optical skin modeling to reconstruct distribution maps of physiological tissue parameters that correlate well with melanin distribution in the epidermis as well as blood volume and blood oxygenation in the dermis. Using 197 sets of multispectral images-taken under while, blue, yellow, and red light-representing 16 Buruli and 181 non-Buruli lesions, we achieved overall classification sensitivity of 90.0%, specificity of 93.3%, and receiver operator characteristic area under the curve of 97.1%. These results suggest that automated multispectral image analysis implemented on a handheld device, such as the iPhone equipped with the appropriate attachment, can provide a fast, reliable, and economical tool to screen Buruli ulcer disease that can be …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Information communication networks in severe traumatic brain injury",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10548-010-0139-9.pdf",
            "Abstract": "In this study we explored the use of coherence and Granger causality (GC) to separate patients in minimally conscious state (MCS) from patients with severe neurocognitive disorders (SND) that show signs of awareness. We studied 16 patients, 7 MCS and 9 SND with age between 18 and 49 years. Three minutes of ongoing electroencephalographic (EEG) activity was obtained at rest from 19 standard scalp locations, while subjects were alert but kept their eyes closed. GC was formulated in terms of linear autoregressive models that predict the evolution of several EEG time series, each representing the activity of one channel. The entire network of causally connected brain areas can be summarized as a graph of incompletely connected nodes. The 19 channels were grouped into five gross anatomical regions, frontal, left and right temporal, central, and parieto-occipital, while data analysis was performed …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Human learning and the neural correlates of strategy formulation",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13487539577652700618&hl=en&oi=scholarr",
            "Abstract": "The goal of this study is to arrive at an understanding of strategy formulation in the human brain. Given a complex visuomotor task, we take a tripartite approach to understanding and isolating moments of insight and learning. We analyze EEG and motor activity to capture milestones in the process of ‘learning’.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boosting instance prototypes to detect local dermoscopic features",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5626776/",
            "Abstract": "Local dermoscopic features are useful in many dermoscopic criteria for skin cancer detection. We address the problem of detecting local dermoscopic features from epiluminescence (ELM) microscopy skin lesion images. We formulate the recognition of local dermoscopic features as a multi-instance learning (MIL) problem. We employ the method of diverse density (DD) and evidence confidence (EC) function to convert MIL to a single-instance learning (SIL) problem. We apply Adaboost to improve the classification performance with support vector machines (SVMs) as the base classifier. We also propose to boost the selection of instance prototypes through changing the data weights in the DD function. We validate the methods on detecting ten local dermoscopic features from a dataset with 360 images. We compare the performance of the MIL approach, its boosting version, and a baseline method without using MIL …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Phase aspects and localization analysis of the auditory N100 component",
            "Publication year": 2005,
            "Publication url": "http://www.ijbem.org/volume7/number2/169-172.pdf",
            "Abstract": "The structure of the sources underlying surface recordings of brain activity is very complex. We have developed an iterative procedure based on independent component analysis to obtain single-trial estimates of the auditory N100 component recorded in normal subjects using a pure tone, binaural stimulation task and a wholehead, 256-channel recording system. For each channel, the processed single trials were separated into two groups, one with trials in which the N100 component had the same phase as the average response and another one with trials having the opposite phase. Our results show that the proposed method can effectively extract only the activity related to the experimental task, while removing artifacts and background activity, and that the sources of the N100 component that are typically localized on the floor of the Sylvian fissure are primarily due to in-phase responses.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic autoregressive neuromagnetic causality imaging (DANCI)",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Richard-Frye-2/publication/229013397_Dynamic_autoregressive_neuromagnetic_causality_imaging_DANCI/links/09e4150817abbe09d6000000/Dynamic-autoregressive-neuromagnetic-causality-imaging-DANCI.pdf",
            "Abstract": "This presentation provides a demonstration of how Granger causality (GC) can be applied to MEG data to visualize dynamic functional connectivity and causality between cortical regions on a millisecond time scale. GC is derived from autoregressive models and provides directionality information. We apply the GC technique to dynamic statistical parameter map source space to demonstrate that the dynamics of neural networks can visualized during a perceptual task. The results from this demonstration coincide with models of speech perception and suggest that Dynamic Autoregressive Neuromagnetic Causality Imaging (DANCI) can be used to investigate and verify theoretical neural network models of brain function.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Efficient Hair Removal Algorithm for Skin Lesion Images",
            "Publication year": 2017,
            "Publication url": "https://uh-ir.tdl.org/handle/10657/2323",
            "Abstract": "An Efficient Hair Removal Algorithm for Skin Lesion Images Toggle navigation Login Toggle \nnavigation View Item Repository Home UH Faculty, Staff, and Student Works Graduate Research \nShowcase (GRS) Projects GRS 2017 View Item Repository Home UH Faculty, Staff, and Student \nWorks Graduate Research Showcase (GRS) Projects GRS 2017 View Item An Efficient Hair \nRemoval Algorithm for Skin Lesion Images Thumbnail View/Open \nPan_Rangeet_GRaSP2017.pptx (5.695Mb) Date 2017 Author Pan, Rangeet Zouridakis, George \nMetadata Show full item record URI http://hdl.handle.net/10657/2323 Collections GRS 2017 \nDSpace software copyright © 2002-2016 DuraSpace Contact Us | Send Feedback TDL Theme by \nAtmire NV Search DSpace This Collection Browse All of DSpaceCommunities & CollectionsBy \nIssue DateAuthorsDepartmentsTitlesSubjectsThis CollectionBy Issue DateAuthorsDepartments© -…",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Differential temporal activation of oxy-and deoxy-hemodynamic signals in optical imaging using functional near-infrared spectroscopy (fNIRS)",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2202-16-S1-P245",
            "Abstract": "BackgroundOptical imaging of the brain based on near-infrared spectroscopy (NIRS) can provide real-time measurements of the hemodynamic signals that represent metabolic demands of the underlying neural tissues. Functional imaging based on NIRS (fNIRS) can detect both oxy-hemoglobin (oxy-Hb) and deoxy-hemoglobin (deoxy-Hb) levels related to neural metabolic activity, whereas BOLD fMRI (blood-oxygen-level dependent functional magnetic resonance imaging) can only detect signals related to deoxy-Hb. Thus, during task execution, only fNIRS can determine the differential temporal activation/deactivation of oxy-Hb and deoxy-Hb hemodynamic signals as the blood-oxygen demand changes. We have previously shown that as metabolic demand increases, temporal changes in oxy-Hb and deoxy-Hb levels can be temporally decoupled (ie, oxy-Hb level can decrease while deoxy-Hb level increases …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:wbdj-CoPYUoC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "A concise guide to intraoperative monitoring",
            "Publication year": 2000,
            "Publication url": "https://www.taylorfrancis.com/books/mono/10.1201/9781420041538/concise-guide-intraoperative-monitoring-george-zouridakis-andrew-papanicolaou",
            "Abstract": "Covering both the applications and the related theory, A Concise Guide to Intraoperative Monitoring provides a general but comprehensive introduction to IOM. Unlike existing texts that typically report the results of specific studies, this book presents comprehensive coverage of the entire procedure, as well as the specific protocols used in hospit",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:4TOpqqG69KYC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Single-trial analysis of the auditory N100 improves separation of normal and schizophrenia subjects",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4650047/",
            "Abstract": "The N100 component of the auditory evoked potential (EP) has been recently used to study sensory gating deficits in schizophrenia subjects compared to normal controls. Previously, we used selective averaging to show phase synchronization differences in brain activity between the two populations. In this study, we employed our recently developed iterative independent component analysis (iICA) procedure to measure single-trial EPs in the context of a double-stimulus paradigm. Using the amplitude and latency of the N100 components of the first and second stimuli responses obtained from iICA and four different classification algorithms we were able to accurately classify subjects with 100% sensitivity and 100% specificity. In contrast, the same amplitude and latency features computed from average EPs provided only 69% classification accuracy, with 63% sensitivity and 75% specificity, respectively. We …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconfiguration of dominant coupling modes in mild traumatic brain injury mediated by δ-band activity: a resting state MEG study",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306452217303664",
            "Abstract": "During the last few years, rich-club (RC) organization has been studied as a possible brain-connectivity organization model for large-scale brain networks. At the same time, empirical and simulated data of neurophysiological models have demonstrated the significant role of intra-frequency and inter-frequency coupling among distinct brain areas. The current study investigates further the importance of these couplings using recordings of resting-state magnetoencephalographic activity obtained from 30 mild traumatic brain injury (mTBI) subjects and 50 healthy controls. Intra-frequency and inter-frequency coupling modes are incorporated in a single graph to detect group differences within individual rich-club subnetworks (type I networks) and networks connecting RC nodes with the rest of the nodes (type II networks). Our results show a higher probability of inter-frequency coupling for (δ–γ1), (δ–γ2), (θ–β), (θ–γ2), (α …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:LjlpjdlvIbIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Methods and software for screening and diagnosing skin lesions and plant diseases",
            "Publication year": 2013,
            "Publication url": "https://patents.google.com/patent/WO2013149038A1/en",
            "Abstract": "Provided herein are portable imaging systems, for example, a digital processor-implemented system for the identification and/or classification of an object of interest on a body, such as a human or plant body. The systems comprise a hand-held imaging device, such as a smart device, and a library of algorithms or modules that can be implemented thereon to process the imaged object, extract representative features therefrom and classify the object based on the representative features. Also provided are methods for the identifying or classifying an object of interest on a body that utilize the algorithms and an automated portable system configured to implement the same.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A programmable DSP development platform for automated detection of melanoma",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/1931308X.2009.10644167",
            "Abstract": "A prototype of a Bluetooth-enabled handheld device, whose dimensions are comparable to that of a cell phone, is being developed to assist medical practitioners in analyzing skin lesions and detecting early melanoma. The device can capture images of lesions, process them in real-time, and indicate the probability if a lesion is malignant.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:lSLTfruPkqcC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Implementation of the 7-point checklist for melanoma detection on smart handheld devices",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6090866/",
            "Abstract": "In this paper we implement the 7-point checklist, a set of dermoscopic criteria widely used by clinicians for melanoma detection, on smart handheld devices, such as the Apple iPhone and iPad. The application developed is using sophisticated image processing and pattern recognition algorithms, yet it is light enough to run on a handheld device with limited memory and computational speed. When combined with a commercially available handheld dermoscope that provides proper lesion illumination, this application provides a truly self-contained handheld system for melanoma detection. Such a device can be used in a clinical setting for routine skin screening, or as an assistive diagnostic device in underserved areas and in developing countries with limited healthcare infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Structural organization of functional networks from EEG signals during motor learning tasks",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127410026198",
            "Abstract": "The evaluation of the topological properties of brain networks is an emerging research topic, since the estimated cerebral connectivity patterns often have relatively large size and complex structure. Since a graph is a mathematical representation of a network, the use of a theoretical graph approach would describe concisely the topological features of the functional network estimated from neuroimaging techniques. In particular, by applying the process of coherence analysis to high-density EEG recordings, rich visualizations can be developed that provide a means for spatiotemporal analysis of changes in synchronous brain activity. In the present work, we studied the changes in brain synchronization networks during performance of a complex visuomotor task with strategic components in normal subjects. In particular, we evaluated the differences in the functional network topology associated with human learning by …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:M3ejUd6NZC8C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Speech perception: Single trial analysis of the N1/P2 complex of unimodal and audiovisual evoked responses",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701590/",
            "Abstract": "Audiovisual speech integration is reflected in the electrophysiological N1/P2 complex. In this study, we analyzed recordings of electroencephalographic brain activity from 28 subjects who were presented with combinations of auditory, visual, and audiovisual stimuli, using single trial analysis based on an independent component analysis procedure. We found that, with respect to the N1/P2 complex, single trials across all subjects and all conditions could be separated into two groups, one with `typical' responses having the same polarity as the average response and another one with `aberrant' responses having opposite polarity. Furthermore, the number of aberrant responses in non-speech interpretation of auditory stimuli was significantly lower compared to speech, which may affect the N1/P2 complex in the ensemble average EP.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Imágenes de activación funcional cerebral a través de medidas de fuentes magnéticas: aplicaciones de la magnetoencefalografía a la neuropsicología",
            "Publication year": 2002,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=260171",
            "Abstract": "En esta trabajo los autores muestran el desarrollo y las aplicaciones da la magnetoencefalografía (MEO) como método da neuroimagen funcional no-invasivo. La MEG ha sufrido unA rápida evolución en las últimas décadas, especialmente debido e su alta resolución temporal que hoy no tiene rival como técnica. La MEG se presenta como el método de elección para mapeo da la corteza sensorial primaria, y de la corteza de asociación activada en el contexto da tareas cognitivas, y como un sustituto excelente da le invasiva técnica de Wada. Se presentan diversas imágenes sobre localizaciones da fuentes da actividad en pacientes epilépticos, niños disléxicos, y pacientes con trastornos del lenguaje. Se concluye que la técnica es útil pare la identificación de regiones cerebrales relacionadas con el lenguaje y la memoria, entra otras, y es de gran ayuda para el mapeo pre-quirúrgico de pacientes con tumores cerebrales, y de los pacientes epilépticos resistentes al tratamiento farmacológico.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Consejo General de Colegios Oficiales de Psicología de España"
        },
        {
            "Title": "Restoring cortical connectivity directionality and synchronization is essential to treating disorder of consciousness",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=3414752019147653511&hl=en&oi=scholarr",
            "Abstract": "The design of neurorehabilitation therapy to treat subjects with altered consciousness provides opportunities and challenges to professionals involved with the care for these severely ill patients. While there is an increased interest in determining methods to restore consciousness in these patients, the process is complex and challenging, due in part to the diverse aetiology of these states of consciousness, and also to the intricate cerebral connectivity involved in their treatment. Here, we present the CRECER Combined Method Therapy (CCMT), used in a case study of a patient who showed signs of emergence from the vegetative state after neurorehabilitation. Neurorehabilitation therapy was applied simultaneously with pharmacological treatment, stimulation, and neuroimaging techniques to help adjust drug dosage. The results of this study suggest that this combined approach to treatment promoted connectivity …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:08ZZubdj9fEC",
            "Publisher": "INFORMA HEALTHCARE"
        },
        {
            "Title": "Improved estimation of evoked potentials using an iterative independent component analysis procedure.",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/George-Zouridakis/publication/246432834_Improved_Estimation_of_Evoked_Potentials_Using_an_Iterative_Independent_Component_Analysis_Procedure/links/0f31753a528494aa11000000/Improved-Estimation-of-Evoked-Potentials-Using-an-Iterative-Independent-Component-Analysis-Procedure.pdf",
            "Abstract": "We have developed an iterative approach based on Independent Component Analysis (ICA) to obtain improved estimates of auditory evoked potentials (AEPs), which represent the electrical response of the brain to auditory stimuli. AEPs are often contaminated by artifacts which reduce the localization accuracy of the sources underlying the surface recordings. We use ICA to separate the activity of neuronal generators from the contribution of the various noise sources, under the assumption that improved AEP estimates will result in improved accuracy in source localization. Preliminary results with actual recordings from normal subjects demonstrate the feasibility of the proposed procedure.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "American Journal of Biomedical Science and Engineering",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Nicoladie-Tam/publication/321759291_Computational_Method_for_Representing_the_Simultaneous_Hemodynamic_Relationship_between_Oxy-Hemoglobin_Delivery_and_Deoxy-Hemoglobin_Extraction_in_Neural_Tissues/links/5a30cf540f7e9b0d50f8fd66/Computational-Method-for-Representing-the-Simultaneous-Hemodynamic-Relationship-between-Oxy-Hemoglobin-Delivery-and-Deoxy-Hemoglobin-Extraction-in-Neural-Tissues.pdf",
            "Abstract": "In this study, we propose the use of phase space plot analysis to characterize coupling relationships between two simultaneously recorded hemodynamic variables, ie, oxyhemoglobin (oxy-Hb) and deoxy-hemoglobin (deoxy-Hb), using functional near-infrared spectroscopy (fNIRS). To demonstrate the validity of the proposed method, we analyze hemodynamic data recorded from human subjects performing an orthogonal movement task. Our results show that phase space plots can quantify the dynamic time-varying relationships between the two variables based on the trajectory of the loci of data points in the phase space plots. In particular, the location of the phase space plots in different quadrants provides a specific coupling relationship between the two hemodynamic variables. The orientation of the loci of points characterizes further the relationship between these two variables, which can be directly or inversely proportional. The locus of the trajectory along a straight line or an elliptical path can reveal the phase relationship between the two variables. Thus, using phase space analysis on these two simultaneously recorded hemodynamic variables can uniquely identify the movement direction encoded by the motor cortex.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of Brain Responses Based on Independent Component analysis and wavelet denoising",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.85.5493&rep=rep1&type=pdf",
            "Abstract": "Analysis of brain responses on a single-trial basis allows the study of the dynamical characteristics of brain activation. However, single-trial responses are buried into the more prominent background activity, and thus advanced procedures are needed to obtain only the activity of the cortical generators that are activated by the experimental task under study. In this paper, we use simulated data and actual recordings from normal subjects to compare the effectiveness of two methods at removing extraneous activity from single-trial responses, namely, wavelet denoising and our recently proposed procedure, which is based on independent component analysis. Our results show that the new technique can separate individual components from the entire response waveform, and it can also uncover the dynamic evolution of brain responses that cannot be revealed by standard averaging techniques.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Long-range gamma-band synchronization during learning of a complex visuomotor task",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4227278/",
            "Abstract": "Brain activity synchronization is believed to play a major role in human learning, as it emerges from the integration of several brain processes that bind together different sensory inputs. In this study, we used dense-array recordings of electroencephalographic (EEG) activity during execution of a complex learning task to possibly identify patterns of brain activation that correspond to distinct phases of learning. Our results show that subjects who go through both phases of learning, namely strategy formulation and strategy implementation, exhibit very strong long-range synchronization between occipital and frontal brain regions primarily in the gamma band, while the rest of the subjects exhibit patterns of weak local synchronization in all bands.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Causal Prefrontal-Temporoparietal Interactions Correlate with Word-Rhyming Performance in Reading Disabilities",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=8791918235036025385&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "WILEY-LISS"
        },
        {
            "Title": "Computer-aided skin cancer screening: feature selection or feature combination",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=17789854799247553455&hl=en&oi=scholarr",
            "Abstract": "Feature selection is considered as an essential component for a computer-aided skin cancer screening system. Little research has been done on feature combination for automated skin cancer detection while previous systems focused on selecting the most relevant computer generated features. In this paper, we investigate whether combining features can improve the performance of the final decision and compare its performance with that of feature selection. In the biomedical application of skin cancer screening, many categories of descriptors (such as texture, color, and asymmetry) have been used to represent a skin lesion image. The feature combination approach firstly generates classifiers using each category of features alone and combines them linearly together to decide on whether the skin lesion is cancerous or not. Our experimental results show that the performance of the feature combination approach …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Single-trial analysis of the auditory N100 component",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1615465/",
            "Abstract": "We have recently developed an iterative procedure based on independent component analysis to estimate single trial evoked potentials and used the procedure to analyze data obtained from normal subjects in response to a pure tone, with a whole-head 256-channel recording system. Our results show that new methodology can effectively remove most well-defined artifacts and background activity, and also provide improved estimates of specific components of the evoked potential. With respect to the N100 component, the processed single trials could be separated into two groups, one with trials having the same phase as the average response and another one with trials having the opposite phase, while the number of trials in each group had a very consistent spatial distribution across all subjects. Finally, the sources of the N100 component were primarily due to in-phase responses, while the out-of-phase …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated segmentation of lamina cribrosa microarchitecture from in vivo adaptive optics scanning laser ophthalmoscope images",
            "Publication year": 2015,
            "Publication url": "https://iovs.arvojournals.org/article.aspx?articleID=2330675",
            "Abstract": "PurposePrevious quantifications of anterior lamina cribrosa surface (ALCS) pores from in vivo adaptive optics scanning laser ophthalmoscope (AOSLO) images were based on the subjective, manual marking of pore boundaries. We sought to develop an automated method to objectively segment and analyze ALCS pores and beams from AOSLO images.MethodsIn vivo AOSLO images of ALCS microarchitecture were acquired in 6 normal and 3 experimental glaucoma (EG) non-human primate eyes and 2 normal human eyes. ALCS pores were segmented using an automated hierarchical method that identified pore locations using a statistical region merging method and determined pore boundaries using an active contour level sets method. Pores were manually segmented in the same images and compared with pores segmented using the automated method. The sensitivity and specificity of the automated …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:eflP2zaiRacC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Altered rich-club and frequency-dependent subnetwork organization in mild traumatic brain injury: a MEG resting-state study",
            "Publication year": 2017,
            "Publication url": "https://internal-journal.frontiersin.org/articles/10.3389/fnhum.2017.00416/full",
            "Abstract": "Functional brain connectivity networks exhibit “small-world” characteristics and some of these networks follow a “rich-club” organization, whereby a few nodes of high connectivity (hubs) tend to connect more densely among themselves than to nodes of lower connectivity. Current study followed an “attack strategy” to compare the rich-club and small-world network organization models using Magnetoencephalo¬graphic (MEG) recordings from mild traumatic brain injury (mTBI) patients and neurologically intact controls to identify the topology that describes the underlying intrinsic brain network organization. We hypothesized that the reduction in global efficiency caused by an attack targeting a model’s hubs would reveal the “true” underlying topological organization. Connectivity networks were estimated using mutual information as the basis for cross-frequency coupling. Our results revealed a prominent rich-club network organization for both groups. In particular, mTBI patients demonstrated hyper-synchronization among rich-club hubs compared to controls in the δ band and the δ-γ1, θ-γ1, and β-γ2 frequency pairs. Moreover, rich-club hubs in mTBI patients were overrepresented in right frontal brain areas, from θ to γ1 frequencies, and underrepresented in left occipital regions in the δ-β, δ-γ1, θ-β, and β-γ2 frequency pairs. These findings indicate that the rich-club organization of resting-state MEG, considering its role in information integration and its vulnerability to various disorders like mTBI, may have a significant predictive value in the development of reliable biomarkers to help the validation of the recovery from mTBI. Furthermore, the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:N5tVd3kTz84C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Synchronization between the anterior and posterior cortex determines consciousness level in patients with traumatic brain injury (TBI)",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0006899312005896",
            "Abstract": "Survivors of traumatic brain injury (TBI) often suffer disorders of consciousness as a result of a breakdown in cortical connectivity. However, little is known about the neural discharges and cortical areas working in synchrony to generate consciousness in these patients. In this study, we analyzed cortical connectivity in patients with severe neurocognitive disorder (SND) and in the minimally conscious state (MCS). We found two synchronized networks subserving consciousness; one retrolandic (cognitive network) and the other frontal (executive control network). The synchrony between these networks is severely disrupted in patients in the MCS as compared to those with better levels of consciousness and a preserved state of alertness (SND). The executive control network could facilitate the synchronization and coherence of large populations of distant cortical neurons using high frequency oscillations on a precise …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optical imaging of motor cortical activation using functional near-infrared spectroscopy",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2202-13-S1-P27",
            "Abstract": "Functional near-infrared spectroscopy (fNIRS) is an optical imaging technique that allows real-time monitoring of the oxy-hemoglobin (oxy-Hb) and deoxy-hemoglobin (deoxy-Hb) levels in brain tissues in a noninvasive fashion [1, 4, 6]. The characteristic absorption spectra of oxy-Hb and deoxy-Hb recorded on the scalp can be used to detect the oxygen demands of the underlying brain tissues in the cerebral cortex. This allows real-time detection of brain activation based on metabolic events (neural hemodynamics). Brain imaging using fNIRS has many advantages over fMRI (functional magnetic resonance imaging), as it can detect changes in both oxy-and deoxy-Hb levels simultaneously, whereas an increase in fMRI BOLD (blood-oxygen level dependent) signal only accounts for a decrease in deoxy-Hb levels by an increase in regional cerebral blood volume (rCBV). Additionally, the multi-channel fNIRS signals …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Malignant melanoma detection by bag-of-features classification",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4649862/",
            "Abstract": "In this paper, we apply a Bag-of-Features approach to malignant melanoma detection based on epiluminescence microscopy imaging. Each skin lesion is represented by a histogram of codewords or clusters identified from a training data set. Classification results using Naive Bayes classification and Support Vector Machines are reported. The best performance obtained is 82.21% on a dataset of 100 skin lesion images. Furthermore, since in melanoma screening false negative errors have a much higher impact and associated cost than false positive ones, we use the Neyman-Pearson score in our model selection scheme.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling spatial relation in skin lesion images by the graph walk kernel",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5627798/",
            "Abstract": "Early skin cancer detection with the help of dermoscopic images is becoming more and more important. Previous methods generally ignored the spatial relation of the pixels or regions inside the lesion. We propose to employ a graph representation of the skin lesion to model the spatial relation. We then use the graph walk kernel, a similarity measure between two graphs, to build a classifier based on support vector machines for melanoma detection. In experiments, we compare the sensitivities and specificities of models with and without spatial information. Experimental results show that the model with spatial information performs the best in both sensitivity and specificity. Statistical test indicates that the improvement is significant.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intraoperative Neurophysiological Monitoring Part 6: Cranial Surgery",
            "Publication year": 2000,
            "Publication url": "https://journals.lww.com/jcejournal/Citation/2000/25010/TECHNICAL_NOTE__Intraoperative_Neurophysiological.12.aspx",
            "Abstract": ": Brain surgery is often performed to provide relief of symptoms and recovery of impaired neurological functions. Intraoperative electrophysiological monitoring during these procedures can significantly reduce the risk of certain complications, such as ischemia and direct insult to functionally intact neural tissue, since it provides a way to quantify the structural and functional integrity of the neuronal structures at risk. In this part of the series on intraoperative monitoring we give specific examples that demonstrate the usefulness of these procedures during the course of a variety of operations involving the brain, including tumor removal, arteriovenous malformation, aneurysm clipping, and cranial nerve surgery.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:BqipwSGYUEgC",
            "Publisher": "LWW"
        },
        {
            "Title": "Optical imaging of motor cortical hemodynamic response to directional arm movements using near-infrared spectroscopy",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/33278267/10.5923.j.ijbe.20130302.01.pdf",
            "Abstract": "This study aims at determining arm-movement directions from functional near-infrared spectroscopy (fNIRS) hemodynamic signals in order to decode intentional motor commands, originating in the motor cortices of humans, which could be implemented in neuroprosthetic assistive devices for assisting the physically disabled. Motor cortical hemodynamic responses were recorded using 64 spatially distributed optrodes from 14 normal subjects during free arm orthogonal movements in the x-and y-directions on a horizontal plane. The time course of oxy-(HbO2) and deoxy-hemoglobin (Hb), and of their summation (HbO2+ Hb) and difference (HbO2–Hb) signals, representing the hemodynamic profiles of total oxygen delivery and extraction, respectively, were computed for the localized neuronal populations in the motor cortices underlying the optrodes. Analysis of the above hemodynamic signals revealed that they could be temporally, spatially, or spatiotemporally decoupled, depending on the movement direction. Thus, by analyzing the spatiotemporal profiles of brain activation we could identify the direction of the orthogonal movements uniquely. Our findings demonstrate that movement direction, a key feature of motor commands, can be reliably extracted in real-time from surface recorded fNIRS signals, and support their viability in future noninvasive assistive devices.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:u9iWguZQMMsC",
            "Publisher": "Scientific and Academic Publishing"
        },
        {
            "Title": "A comparison of multivariate causality based measures of effective connectivity",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482511001272",
            "Abstract": "During the past several years a variety of methods have been developed to estimate the effective connectivity of neural networks from measurements of brain activity in an attempt to study causal interactions among distinct brain areas. Understanding the relative strengths and weaknesses of these methods, the assumptions they rely on, the accuracy they provide, and the computation time they require is of paramount importance in selecting the optimal method for a particular experimental task and for interpreting the results obtained. In this paper, the accuracy of the six most commonly used techniques for calculating effective connectivity are compared, namely directed transfer function, partial directed coherence, squared partial directed coherence, full frequency directed transfer function, direct directed transfer function, and Granger causality. These measures are derived from the coefficients and error terms of …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:IWHjjKOFINEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Pallidotomy: a comparison of responders and nonresponders",
            "Publication year": 2001,
            "Publication url": "https://academic.oup.com/neurosurgery/article-abstract/48/2/263/2751621",
            "Abstract": "We reviewed a prospective series of 32 unilateral, large-volume, microelectrode-guided posteroventral pallidotomies to determine the differences between responsive and nonresponsive patients.Our patients underwent extensive pre- and postoperative evaluations. One year postoperatively, we correlated the outcomes of 25 patients with their histories, physical findings, neuropsychological assessments, and lesion characteristics to further understand the indications, limitations, and pitfalls of unilateral pallidotomy. Our group judged responsiveness by comparing the preoperative total Unified Parkinson's Disease Rating Scale off-state scores with those obtained 1 year postoperatively. A score indicating greater than 20% improvement at 1-year follow-up was rated a good outcome; improvement of greater than 40% was rated an excellent outcome …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:0EnyYjriUFMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Living without frontal lobes after TBI.",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=7882195063218349501&hl=en&oi=scholarr",
            "Abstract": "Objectives: Breakdowns in cortical connectivity often lead to disorders of consciousness in survivors of traumatic brain injury (TBI). In this presentation, we analyze cortical connectivity in patients with severe neurocognitive disorder (SND) and in the minimally conscious state (MCS). Methods: Two synchronized networks were observed to subserve consciousness, one retrolandic (cognitive network) and the other frontal (executive control network).Results: The synchronization between these networks is severely impaired in patients in the MCS when compared to patients with SND, who show better levels of consciousness and a preserved state of alertness. The executive control network could facilitate the synchronization and coherence of large populations of distant cortical neurons using high frequency oscillations on a precise temporal scale. If synchrony and coherence are lost, consciousness is altered or …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:tOudhMTPpwUC",
            "Publisher": "INFORMA HEALTHCARE"
        },
        {
            "Title": "Large-scale cortical networks estimated from scalp EEG signals during performance of goal-directed motor tasks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5626710/",
            "Abstract": "The evaluation of the topological properties of brain networks is an emergent research topic, since the estimated cerebral connectivity patterns often have relatively large size and complex structure. Since a graph is a mathematical representation of a network, the use of a theoretical graph approach would describe concisely the topological features of the functional brain connectivity network estimated using neuroimaging techniques. In the present study, we analyze the changes in brain synchronization networks using high-resolution EEG signals obtained during performance of a complex goal-directed visuomotor task. Our results show that the cortical network is more stable when subjects reach the goal than when they fail by hitting an obstacle. These findings suggest the presence of a possible cerebral “marker” for motor actions that result in successful reaching of a target.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling Tumor Growth",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=1130135403275007803&hl=en&oi=scholarr",
            "Abstract": "Modeling of a growing tumor over time is extremely difficult, because of the complex biological phenomena underlying cancer proliferation. Existing models can mostly describe in vitro experiments of spherically-shaped avascular tumors, but they cannot match the highly heterogeneous and complex-shaped tumors seen in cancer patients. We propose a new time-dependent geometric deformable model that can characterize tumors of complex shape, such as vascular tumors. Preliminary result show that such a model can provide an adequate framework for analyzing and predicting the growth of tumors seen in PET images of cancer patients.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Relationship between the phase of the ongoing activity at the stimulus time and the N100 detected response using EEG recordings",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.540.6895&rep=rep1&type=pdf",
            "Abstract": "There are two main theories to explain the reason of the average response in the EP recorded with an EEG system. One of these theories affirms that the average response results from synchronous phase-resetting in the ongoing activity provoked by the stimulus. Testing the relationship between the phase in the ongoing EEG activity at the stimulus time and the response after the stimulus we pretend to find a relationship in accordance with this theory. In this study, data from 19 normal subjects were recorded using an EEG recorder system. Observing the Cz channel, the phase of the ongoing activity at the time of stimulus arrival was estimated and compared with the response obtained from the same signal after applying an iterative Independent Component Analysis algorithm. Applying this algorithm, basically two kinds of EEG responses are detected for each single trial observing the N100 peak. One response follows the same pattern as the average EP and the other response follows just the opposite one. In this paper we present the relationship found between the phase and the percentage of found trials with these two kinds of responses.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating the motion of the LAD: A simulation-based study",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45468-3_216",
            "Abstract": "In this paper, we present a simulation-based study of a motion analysis technique designed to intra-operatively estimate the motion parameters of the LAD coronary artery from endoscopic images.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Single-trial evoked potential estimation: comparison between independent component analysis and wavelet denoising",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388245706015057",
            "Abstract": "Brain responses to repeated sensory stimuli are typically buried in the more prominent background activity, and thus analysis of these responses on a single-trial basis would require advanced procedures to estimate the brain activity related only to the experimental task. Recently, we have proposed a new iterative independent component analysis (iICA) approach to estimate single-trial responses. In this paper, we compare the performance of iICA at estimating single-trial responses with ensemble averaging and wavelet transform (WT) denoising.We analyzed simulated evoked potentials (EPs) and actual recordings of the auditory N100 component from 33 normal subjects, and the performance of each method was quantified in terms of the average root-mean-square error and average correlation before and after processing.We found that WT gave a smoother overall average EP, while i …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:Se3iqnhoufwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "25th annual computational neuroscience meeting: CNS-2016",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s12868-016-0283-6",
            "Abstract": "© 2016 The Author (s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http://creativecommons. org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author (s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver (http://creativecommons. org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:Y5dfb0dijaUC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Independent component analysis of multichannel auditory evoked potentials",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1134457/",
            "Abstract": "We used independent component analysis (ICA) to extract a clean response from multichannel recordings of auditory evoked potentials (AEPs) which represent the electrical response of the brain to auditory stimuli. AEPs are often contaminated by biological noise, such as eye blinks and muscle activity, as well as by extraneous interference. ICA is used to extract the activity of neuronal generators from the noisy recordings. Simulation results show that the method can recover a variety of signals when only noise-contaminated mixtures of these signals are observed. Preliminary results with real data obtained from normal subjects demonstrate that ICA can provide a improved AEP estimate when compared to classical ensemble averaging.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating sampling strategies of dermoscopic interest points",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5872366/",
            "Abstract": "Among the most critical components of a computerized system for automated melanoma detection is image sampling and pooling of the extracted features. In this paper, we propose a new method for sampling and pooling based on a combination of spatial pooling and graph theory features. The performance of the new method is evaluated using a dataset of more than 1,500 images representing pigmented skin lesions of known pathology. In our comparisons, we include several methods ranging from simple and multi-scale sampling on a regular grid to more sophisticated approaches, such as blob and curvilinear structure detectors. Our results show that, despite its simplicity, simple sampling on a regular grid provides highly competitive performance, compared to the more sophisticated approaches, while multi-scale sampling yields only trivial improvements. However, the proposed method provides significant …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Device and software for screening the skin",
            "Publication year": 2012,
            "Publication url": "https://patents.google.com/patent/US8213695B2/en",
            "Abstract": "The present invention provides devices for screening the skin of an individual in real time using a region-fusion based segmentation with narrow band graph partitioning algorithm to analyze and classify a region of interest of the skin as benign or malignant. Also, provided is a method for screening the skin of an individual using the devices described herein. In addition the present invention provides a digital processor-implemented system for classifying a region of interest on the skin and a processor readable medium having processor-executable instructions to perform skin cancer detection.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Local syntactic violations evoke fast mismatch-related neural activity detected by optical neuroimaging",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00221-020-05922-8",
            "Abstract": "It remains to be investigated whether syntax-related mismatch activity would be evoked in event-related optical signals by syntactic violations that deviate from our language knowledge and expectations. In the current study, we have employed fast optical neuroimaging with a frequency-domain oximeter to examine whether syntactic violations of English bare infinitives in the non-finite complement clause would trigger syntax-related mismatch effects. Recorded sentences of bare or full infinitive structures (without or with the ‘to’ infinitival marker) with syntactically correct or incorrect versions and non-syntactic lexical items (verbs) were presented to native speakers of English (n = 8) during silent movie viewing as a passive oddball task. The analysis of source strength (i.e., minimum norm current amplitudes) revealed that the syntactic category violations of bare object infinitives led to significantly more robust optical …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:nrtMV_XWKgEC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Default brain connectivity network in mild traumatic brain injury—preliminary MEG results",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5752149/",
            "Abstract": "In this study, we analyzed brain connectivity profiles from mild traumatic brain injury (mTBI) patients and normal controls. We computed Granger causality measures from magnetoencephalographic (MEG) activity obtained at the resting state, in an attempt to understand how the default network is affected by mTBI. Our results show that all subjects exhibit a dense network of peripheral local connections. However, normal controls show an additional network of long-range connections that is drastically reduced mTBI patients. These findings suggest that analysis of functional connectivity patterns may provide a valuable method for early detection of mTBI.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A narrow band graph partitioning method for skin lesion segmentation",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320308003786",
            "Abstract": "Accurate skin lesion segmentation is critical for automated early skin cancer detection and diagnosis. In this paper, we present a novel multi-modal skin lesion segmentation method based on region fusion and narrow band energy graph partitioning. The proposed method can handle challenging characteristics of skin lesions, such as topological changes, weak or false edges, and asymmetry. Extensive testing demonstrated that in this method complex contours are detected correctly while topological changes of evolving curves are managed naturally. The accuracy of the method was quantified using a lesion similarity measure and lesion segmentation error ratio, Our results were validated using a large set of epiluminescence microscopy (ELM) images acquired using cross-polarization ELM and side-transillumination ELM. Our findings demonstrate that the new method can achieve improved robustness and better …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:5nxA0vEk-isC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Functional connectivity in tuberous sclerosis complex with autistic spectrum disorder preliminary findings",
            "Publication year": 2013,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/abstract/10.3233/JPN-130599",
            "Abstract": "Despite the frequent occurrence of autism spectrum disorder (ASD) in tuberous sclerosis complex (TSC), the neurophysiological factors that distinguish children with TSC from children with TSC presenting with ASD symptoms remain unspecified. Growing evidence suggests that ASD may be characterized by atypical structural and functional connectivity between specific cortical regions. In this exploratory study, we utilized magnetoencephalography to derive resting brain connectivity patterns, in an attempt to identify neurophysiological markers that may differentiate TSC children with ASD (n = 2) from TSC children without ASD (n = 2) and typically developing children (n = 2). Connectivity pattern analysis revealed that TSC children presenting with ASD symptoms can be distinguished from TSC and typically developing children by the presence of long-range, medial, anterior-posterior connections previously …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:EUQCXRtRnyEC",
            "Publisher": "Georg Thieme Verlag KG"
        },
        {
            "Title": "Examining in vivo changes in predominant lamina cribrosa beam orientation in experimental glaucoma using an automated approach",
            "Publication year": 2014,
            "Publication url": "https://iovs.arvojournals.org/article.aspx?articleid=2272423",
            "Abstract": "Purpose: The lamina cribrosa is suggested to be the initial site of damage to retinal ganglion cell axons in glaucoma. We sought to characterize changes in predominant anterior lamina cribrosa surface (ALCS) beam orientation in vivo during the progression of experimental glaucoma (EG).Methods: We analyzed adaptive optics scanning laser ophthalmoscope (AOSLO) montages of ALCS beams previously acquired in fellow eyes of 4 rhesus monkeys at multiple time-points before and after induction of unilateral experimental glaucoma. AOSLO montages were pre-processed to minimize variations in illumination using a homomorphic filter and contrast-enhanced using a contrast limiting adaptive histogram equalization technique. The predominant orientations of laminar beams throughout a montage were estimated at different overlapping local regions of interest using principal component analysis (PCA …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:eJXPG6dFmWUC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Spectral power of brain activity associated with emotion—a pilot MEG study",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12197-5_83",
            "Abstract": "In this study we analyzed broadband, whole-head MEG activity to investigate affective processing in the human brain and assess whether spectral power in nonoverlapping frequency bands correlates preferentially with specific anatomical locations and distinct emotions elicited by affective stimuli that differed in valence from unpleasant to pleasant and arousal from low to high. We analyzed recordings from 20 normal young adults using linear mixed effects models computed separately in each frequency band on a reduced set of recording sites represented by 8 principal components. Our results showed statistically significant differences between the pleasant and neutral conditions in all frequency bands and between the pleasant and unpleasant condition in the theta band.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computational tools for MRI-guided thermal therapy.",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/George-Zouridakis/publication/255639523_Computational_Tools_for_MRI-Guided_Thermal_Therapy/links/0f31753a52842a9054000000/Computational-Tools-for-MRI-Guided-Thermal-Therapy.pdf",
            "Abstract": "A graphical user interface (GUI) integrating several basic functions of an MRI-guided ablative thermal therapy procedure has been developed. The GUI features image processing and statistical analysis tools for treatment planning, target localization, continuous temperature monitoring, and verification of the procedure. An adaptive region detection algorithm is used for accurate target tracking, while thermal changes in the tissues are visualized by computing and superimposing temperature maps onto structural images. The GUI has significant potential for real-time control of thermal therapy, thus making it a safe and practical clinical tool for noninvasive treatment of soft-tissue tumors.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intraoperative Neurophysiological Monitoring Part 7: Artifacts and Troubleshooting",
            "Publication year": 2000,
            "Publication url": "https://journals.lww.com/jcejournal/Citation/2000/25030/Intraoperative_Neurophysiological_Monitoring_Part.13.aspx",
            "Abstract": ": Intraoperative electrophysiological recordings are gradually becoming part of standard medical practice because they can objectively and effectively assess the functional status of the nervous system of an anesthetized patient. However, artifactual changes can happen because of electrical noise, changes in anesthesia regime, interference from extraneous neurophysiological activity, and equipment failure. In this last paper of this series on intraoperative monitoring we present a systematic interventional strategy for recognizing various types of artifacts and for troubleshooting equipment failures as needed.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:3s1wT3WcHBgC",
            "Publisher": "LWW"
        },
        {
            "Title": "Identification of reliable spike templates in multi-unit extracellular recordings using fuzzy clustering",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260799000322",
            "Abstract": "A method for extracting single-unit spike trains from extracellular recordings containing the activity of several simultaneously active cells is presented. The technique is particularly effective when spikes overlap temporally. It is capable of identifying the exact number of neurons contributing to a recording and of creating reliable spike templates. The procedure is based on fuzzy clustering and its performance is controlled by minimizing a cluster-validity index which optimizes the compactness and separation of the identified clusters. Application examples with synthetic spike trains generated from real spikes and segments of background noise show the advantage of the fuzzy method over conventional template-creation approaches in a wide range of signal-to-noise ratios.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Estimation of individual evoked potential components using iterative independent component analysis",
            "Publication year": 2007,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0031-9155/52/17/017/meta",
            "Abstract": "Independent component analysis (ICA) has been successfully employed in the study of single-trial evoked potentials (EPs). In this paper, we present an iterative temporal ICA methodology that processes multielectrode single-trial EPs, one channel at a time, in contrast to most existing methodologies which are spatial and analyze EPs from all recording channels simultaneously. The proposed algorithm aims at enhancing individual components in an EP waveform in each single trial, and relies on a dynamic template to guide EP estimation. To quantify the performance of this method, we carried out extensive analyses with artificial EPs, using different models for EP generation, including the phase-resetting and the classical additive-signal models, and several signal-to-noise ratios and EP component latency jitters. Furthermore, to validate the technique, we employed actual recordings of the auditory N100 …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:MXK_kJrjxJIC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Brain Mapping in Functional Neurosurgery",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/brain-mapping-functional-neurosurgery/20572",
            "Abstract": "Functional brain mapping is a procedure that can be used to identify cortical areas that mediate sensorimotor and higher cognitive brain functions, such as language, attention, memory, and cognition. Clinically, it is currently used for preoperative surgical planning in patients suffering from intractable epilepsy and brain tumors, and may soon have significant applications in brain injury, stroke, dementia, and developmental disorders. Functional brain mapping is also a very powerful research tool in the area of cognitive neuroscience and, lately, in psychiatry. Recent technological advances in neuroimaging techniques, the development of large sensor arrays, the use of sophisticated computer systems and superior graphics, gradually make more apparent the relevance of this technique in providing answers to complex questions about the structural and functional connectivity of the brain, and the way it represents and …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:NhqRSupF_l8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Functional connectivity changes detected with magnetoencephalography after mild traumatic brain injury",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2213158215001710",
            "Abstract": "Mild traumatic brain injury (mTBI) may affect normal cognition and behavior by disrupting the functional connectivity networks that mediate efficient communication among brain regions. In this study, we analyzed brain connectivity profiles from resting state Magnetoencephalographic (MEG) recordings obtained from 31 mTBI patients and 55 normal controls. We used phase-locking value estimates to compute functional connectivity graphs to quantify frequency-specific couplings between sensors at various frequency bands. Overall, normal controls showed a dense network of strong local connections and a limited number of long-range connections that accounted for approximately 20% of all connections, whereas mTBI patients showed networks characterized by weak local connections and strong long-range connections that accounted for more than 60% of all connections. Comparison of the two distinct general …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Assisting main task learning by heterogeneous auxiliary tasks with applications to skin cancer screening",
            "Publication year": 2011,
            "Publication url": "http://proceedings.mlr.press/v15/situ11a.html",
            "Abstract": "In typical classification problems, high level concept features provided by a domain expert are usually available during classifier training but not during its deployment. We address this problem from a multitask learning (MTL) perspective by treating these features as auxiliary learning tasks. Previous efforts in MTL have mostly assumed that all tasks have the same input space. However, auxiliary tasks can have different input spaces, since their learning targets are different. Thus, to handle cases with heterogeneous input, in this paper we present a newly developed model using heterogeneous auxiliary tasks to help main task learning. First, we formulate a convex optimization problem for the proposed model, and then, we analyze its hypothesis class and derive true risk bounds. Finally, we compare the proposed model with other relevant methods when applied to the problem of skin cancer screening and public datasets. Our results show that the performance of the proposed method is highly competitive compared to other relevant methods.[pdf][supplementary]",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:ns9cj8rnVeAC",
            "Publisher": "JMLR Workshop and Conference Proceedings"
        },
        {
            "Title": "Assessing normal brain function with magnetoencephalography",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0531513101008354",
            "Abstract": "Magnetoencephalography (MEG) is a completely noninvasive method of functional imaging. MEG performs noninvasive functional imaging by recording the magnetic flux on the head surface associated with electrical currents in activated set of neurons, estimating the location of such sets, and projecting the location onto the MRI of the brain to identify and visualize the activated brain region. MEG has rapidly evolved in the last two decades due to the introduction of whole head systems and advances in computer technology. MEG is now the imaging modality of choice where a precise and high degree of localization is required. Ongoing studies show that it provides superior temporal and spatial resolution when compared to functional MRI. MEG is the only imaging technique that can reveal brain function over millisecond intervals. Magnetoencephalography was initially used to localize the primary sensory cortices …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:isC4tDSrTZIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Aberrant auditory evoked responses in schizophrenia: evidence from single-trial analysis",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6091093/",
            "Abstract": "The average N100 (a negative response occurring around 100 ms poststimulus) component of the auditory evoked potential (EP) has been recently used in the study of schizophrenia. Averaging, however, eliminates all temporal variability of the recorded signals and, therefore, hampers the exploration of the temporal dynamics underlying the generation of the N100 component. In this study, we analyzed EPs on a single-trial basis using an iterative independent component analysis procedure that is capable of extracting individual components out of an entire EP waveform. This approach allowed estimation of an N100 in each single trial and measurement of its morphological features such as polarity, which could be either negative (most frequently) or positive (less frequently). In the latter case, the N100 component was termed aberrant. We analyzed responses from 23 normal controls (NC) and 15 schizophrenia …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Alterations in dynamic spontaneous network microstates in mild traumatic brain injury: a MEG beamformed dynamic connectivity analysis",
            "Publication year": 2019,
            "Publication url": "https://www.biorxiv.org/content/10.1101/596155v1.abstract",
            "Abstract": "Dynamic functional connectivity (DFC) analysis has attracted interest in the last years for the characterization of brain electrophysiological activity at rest. In this work, we investigated changes in mild Traumatic Brain Injury (mTBI) patients using magnetoencephalographic (MEG) resting-state recordings and a DFC approach. The activity of several well-known brain rhythms was first beamformed using linearly constrained minimum norm variance of the MEG data to determine ninety anatomical brain regions of interest. A DFC graph was formulated using the imaginary part of phase lag value which were obtained from 30 mTBI patients and 50 normal controls. Filtering each quasi-static graph statistically and topologically, we estimated a normalized Laplacian transformation of every single quasistatic graph based on the degree of each node. Then, the related eigenvalues of the synchronization of each node were computed by incorporating the complete topology. Using the neural-gas algorithm, we modelled the evolution of the eigenvalues for each group, resulting in distinct FC microstates (FCμstates). Using the so-called chronnectomics (transition rate, occupancy time of FCμstate, and Dwell time) and complexity index over the evolution of the FCμstates, we evaluated the level of discrimination and derived statistical differences between the two groups. In both groups, we detected equal number of FCμstates with statistically significant transitions in the δ, α, β, and γlow frequency bands. The discrimination rate between the two groups was very high in the θ and γlow bands, followed by a statistically significant difference between the two groups in all …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:evX43VCCuoAC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Functional connectivity changes in mild traumatic brain injury assessed using magnetoencephalography",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219519412400064",
            "Abstract": "In this study, we analyzed brain connectivity profiles from 10 mild traumatic brain injury (mTBI) patients and 10 age- and gender-matched normal controls. We computed Granger causality measures from magnetoencephalographic (MEG) activity obtained at the resting state, in an attempt to understand how the default network is affected by mTBI. A connectivity matrix was computed for each subject individually and then group templates were estimated by averaging all matrices in each group. Furthermore, we performed classification of the subjects using support vector machines and Fisher's criterion to rank the features and identify the best subset for maximum separation of the groups. Our results show that a combined model based on connectivity matrices and graph theory measures can provide a minimum of 85% classification accuracy in separating the two groups, with a sensitivity and specificity of 90% and 80 …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:RHpTSmoSYBkC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Improving the detection of mtbi via complexity analysis in resting-state magnetoencephalography",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7738215/",
            "Abstract": "Diagnosis of mild Traumatic Brain Injury (mTBI) is difficult due to the variability of obvious brain lesions using imaging scans. A promising tool for exploring potential biomarkers for mTBI is magnetoencephalography which has the advantage of high spatial and temporal resolution. By adopting proper analytic tools from the field of symbolic dynamics like Lempel-Ziv complexity, we can objectively characterize neural network alterations compared to healthy control by enumerating the different patterns of a symbolic sequence. This procedure oversimplifies the rich information of brain activity captured via MEG. For that reason, we adopted neural-gas algorithm which can transform a time series into more than two symbols by learning brain dynamics with a small reconstructed error. The proposed analysis was applied to recordings of 30 mTBI patients and 50 normal controls in δ frequency band. Our results demonstrated …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Frequency analysis of activity suppression and cortical areas involved",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=3134900563117690710&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:P5F9QuxV20EC",
            "Publisher": "ELSEVIER SCIENCE BV"
        },
        {
            "Title": "Transillumination as a means to differentiate melanocytic lesions based on their vascularity",
            "Publication year": 2009,
            "Publication url": "https://jamanetwork.com/journals/jamadermatology/article-abstract/712172",
            "Abstract": "Methods. The study data were collected at the MD Anderson Cancer Center, Houston, Texas, where 80 patients with suspect pigmented lesions smaller than 1 cm in diameter were prospectively recruited during routine skin examinations to undergo biopsy. After a clinical diagnosis by an expert dermatologist was recorded, the Nevoscope was used to image the lesions. Punch biopsy specimens of suspect lesions were obtained, and the biopsy specimens were submitted for histopathologic diagnosis.Nevoscope Imaging. This device uses XP and TL to create dermoscopic and blood-volume images, respectively. Side-transillumination directs light into the skin at a 45 angle from the periphery of the lesion. This light, focused under the skin, behaves as a virtual light source and uniformly transilluminates a small area of the skin within the circular area defined by the fiberoptic ring light. All chromophores, including …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:ZeXyd9-uunAC",
            "Publisher": "American Medical Association"
        },
        {
            "Title": "Assessment of Sensory Gating Deficit in Schizophrenia Using a Wavelet Transform Methodology on Auditory Paired-Click Evoked Potentials",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/7657_2014_71.pdf",
            "Abstract": "Schizophrenia is a chronic mental disorder that results in various neurocognitive and emotional deficits. Among them, the auditory sensory gating deficit, which refers to the neurophysiological processes of filtering out redundant or unnecessary auditory stimuli, has been considered a leading endophenotype for the illness. Sensory gating is efficiently probed using electroencephalography (EEG) recordings in a simple paired-click auditory evoked potential paradigm. This chapter will discuss the use of EEG in the search for biomarkers of schizophrenia and more specifically, the assessment of the sensory gating process in patients with schizophrenia via time-frequency decomposition of the EEG signals. In order to study the functional abnormalities associated with schizophrenia we will focus on the oscillatory changes, spanning a wide range of frequency bands, during an auditory paired-click experiment. To …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:vRqMK49ujn8C",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "Detection of blue-whitish veil in melanoma using color descriptors",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6211628/",
            "Abstract": "Recent studies have shown a dramatic increase in the incidence of malignant melanoma. Thus, it is essential to educate the public about risk factors and augment screening for melanoma to reduce fatalities. Common diagnostic criteria used by dermatologists specialized in dermoscopy are based on the detection of certain texture and color features of a lesion. In this paper, we present a novel algorithm for detecting the socalled blue-whitish veil color feature. Our results show that when the blue-whitish veil is combined with the regression feature can provide sensitivity and specificity of 95.64% and 72.30%, respectively. Therefore detecting blue-whitish veil accurately is of paramount importance in systems for automated detection of melanoma.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic segmentation of skin lesion images using evolutionary strategy",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4379575/",
            "Abstract": "Malignant melanoma has a good prognosis if treated early. Accurate skin lesion segmentation from the background skin is important not only because the shape feature can be directly derived from the process, but also because it can provide a scope for texture analysis. In this paper, we propose an evolutionary strategy based segmentation algorithm to identify the lesion area by an ellipse. It can detect the lesion automatically without setting parameters manually. The method is validated by experiments and comparisons with manually segmentation by an expert and algorithms developed by M. Doshi, et al. (2004).",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "468. Irrelevant stimuli produce less phase resetting than relevant stimuli",
            "Publication year": 2000,
            "Publication url": "https://www.biologicalpsychiatryjournal.com/article/S0006-3223(00)00738-1/abstract",
            "Abstract": "Neuroticism is an enduring, heritable personality trait and a major risk factor for neuropsychiatric illness. Therefore, it should have a neurophysiological basis and be reflected in physiological measures. A strong magnetic pulse delivered to motor cortex produces motor evoked potentials (MEPs) in contralateral muscles. MEP amplitude is reduced when a weak conditioning pulse precedes such a stimulus by 2–5 ms. The conditioning pulse is thought to activate inhibitory GABAergic interneurons. Neuroticism is high in OCD where patients have abnormally low levels of intracortical inhibition. In a pilot study intracortical inhibition and neuroticism were inversely correlated in OCD patients and controls. Here, we studied the relationship between intracortical inhibition and NEO personality inventory neuroticism and PANAS negative emotionality in 20 male, non-patient subjects. TMS was delivered singly and in pairs 3, 4 …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Brain activation profiles in mTBI: Evidence from combined resting-state EEG and MEG activity",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7319994/",
            "Abstract": "In this study, we compared the brain activation profiles obtained from resting state Electroencephalographic (EEG) and Magnetoencephalographic (MEG) activity in six mild traumatic brain injury (mTBI) patients and five orthopedic controls, using power spectral density (PSD) analysis. We first estimated intracranial dipolar EEG/MEG sources on a dense grid on the cortical surface and then projected these sources on a standardized atlas with 68 regions of interest (ROIs). Averaging the PSD values of all sources in each ROI across all control subjects resulted in a normative database that was used to convert the PSD values of mTBI patients into z-scores in eight distinct frequency bands. We found that mTBI patients exhibited statistically significant overactivation in the delta, theta, and low alpha bands. Additionally, the MEG modality seemed to better characterize the group of individual subjects. These findings suggest …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lateralization of activity associated with language function using magnetoencephalography: a reliability study",
            "Publication year": 2000,
            "Publication url": "https://journals.lww.com/clinicalneurophys/Fulltext/2000/09000/Lateralization_of_Activity_Associated_with.00010.aspx",
            "Abstract": "This study was conducted to investigate the reliability of magnetoencephalography in lateralizing and localizing brain activity associated with receptive language function. Sixteen right-handed adults with no history of neurologic disorder engaged in a continuous recognition memory task for visually presented words in two separate sessions. The magnetic flux normal to the scalp surface was measured with a whole-head neuromagnetometer during task performance. Using the total number of acceptable activity sources as an index, overall activation was greater in the left compared with the right hemisphere for all 16 subjects in both sessions. Sources of activity were consistently found in the temporoparietal areas of the left hemisphere in all subjects. Moreover, clusters of activity sources in this region either overlapped spatially or were found in close proximity across sessions. Medial and basal temporal lobe activity …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:_FxGoFyzp5QC",
            "Publisher": "LWW"
        },
        {
            "Title": "Single-trial analysis of auditory evoked potentials improves separation of normal and schizophrenia subjects",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388245712000624",
            "Abstract": "In this study, we employed iterative independent component analysis of single-trial auditory evoked responses to identify features of the P50 and N100 components that provide maximum separation between normal controls and schizophrenia subjects and compared the results against classical ensemble averaging.We analyzed data from 13 schizophrenia and 20 normal control subjects. Responses were obtained in a paired-stimulus paradigm, in which an auditory stimulus S1 is followed by an identical S2. The amplitude and latency of the P50 and N100 components in response to the S1 and S2 stimuli were measured in each single trial and used as features to classify the responses into two groups. Several methods were used for classification, while their performance was quantified in a 10-fold stratified cross-validation approach.We found that normal controls tended to respond earlier …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Visualization during magnetic resonance imaging-guided thermal therapy",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1106341/",
            "Abstract": "A suite of computational tools in a graphic user interface (GUI) for visualization of data acquired during magnetic resonance imaging (MRI) guided ablative thermal therapy is being developed, along with an algorithm for realtime local temperature monitoring. The GUI integrates routines for treatment planning, target localization, temperature monitoring, and verification. In particular, it can visualize the treatment volume and overlay a temperature map or thermal isodose contours on the structural MRIs. The GUI has significant potential for real-time control of thermal therapy, thus making it a safe and practical clinical tool for noninvasive treatment of soft-tissue diseases.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transillumination imaging for early skin cancer detection",
            "Publication year": 2005,
            "Publication url": "https://www.uh.edu/nsm/_docs/cosc/technical-reports/2005/05_05.pdf",
            "Abstract": "Frequent screening of suspicious skin pigmentations is of paramount importance since, at an early stage, skin cancer has a high cure rate and, in most cases, requires a simple treatment. In this paper, we present a new methodology for early detection of skin cancer based on the analysis of a pair of cross-polarization and side-transillumination images to examine surface pigmentation and vascularization characteristics of a lesion. Initially, the two images are automatically segmented by three separate procedures, and then the most accurate results are selected by a scoring stage. Finally, classification of the lesion as malignant or benign is accomplished by measuring the amount of hypervascularity around the pigmented area. When applied to a set of skin lesions, the two-stage methodology provided a 93.3% success rate of correct image segmentation, and it was able to classify correctly lesions as malignant or benign with 86.9% accuracy. The automatic segmentation procedure was validated against expert manual segmentation, whereas the final lesion classification was validated against findings from pathology. These results provide strong support for the importance of transillumination imaging in the early detection of skin cancer.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Carla S. Hatten",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=15787856211401001866&hl=en&oi=scholarr",
            "Abstract": "23.3 Neurophysiological Recordings: Spontaneous Activity Electroencephalogram• Electromyogram 23.4 Neurophysiological Recordings: Evoked Potentials Somatosensory Evoked Potentials (SEPs)• Brainstem Auditory Evoked Responses (BAERs)• Visual Evoked Potentials (VEPs)• Motor Evoked Potentials (MEPs) 23.5 Application Examples EEG Burst Suppression• Ischemia• Spinal Cord Injury 23.6 Conclusions",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Consistency of the auditory evoked response: the presence of aberrant responses and their effect on N100 localization",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165027012001896",
            "Abstract": "The structure and distribution of the sources underlying the generation of evoked potentials (EPs) is often very complex. In an effort to improve localization accuracy of the auditory N100 (negative response occurring around 100 ms poststimulus) component, we analyzed 13 datasets of single-trial EPs obtained from normal subjects using an iterative independent component analysis procedure which allowed us to detect a clear N100 component in each single trial and to study gross changes in component morphology across trials. We found that single-trial N100 amplitude was most often negative in polarity, as expected, but occasionally exhibited a marked reversal to become positive. The average N100, however, showed the typical negative polarity, in all subjects.Based on this observation, we separated the processed single trials in two groups of typical and aberrant responses, and from each group, we …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:NMxIlDl6LWMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A statistical model of retinal optical coherence tomography image data",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6091513/",
            "Abstract": "Optical coherence tomography (OCT) is an important mode of biomedical imaging for the diagnosis and management of ocular disease. Here we report on the construction of a synthetic retinal OCT image data set that may be used for quantitative analysis of image processing methods. Synthetic image data were generated from statistical characteristics of real images (n = 14). Features include: multiple stratified layers with representative thickness, boundary gradients, contour, and intensity distributions derived from real data. The synthetic data also include retinal vasculature with typical signal obscuration beneath vessels. This synthetic retinal image can provide a realistic simulated data set to help quantify the performance of image processing algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mining cross-frequency coupling microstates from resting state MEG: an application to mild traumatic brain injury",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7591975/",
            "Abstract": "Recent studies have investigated the possible role of dynamic functional connectivity and the role of cross-frequency coupling (CFC) to provide the substrate for reliable biomarkers of brain disorders. In this study, we analyzed time-varying CFC profiles from resting state Magnetoencephal-ographic recordings of 30 mild Traumatic Brain Injury (mTBI) patients and 50 normal controls. Interactions among sensors at specific pairs of frequency bands were computed via estimation of phase-to-amplitude couplings. We then computed time-varying functional connectivity graphs that were described in terms of segregation (local efficiency, LE) and integration (global efficiency, GE) and mapped those graphs to time series of GE/LE estimates. The resulting dynamic network revealed transitions between a limited number of microstates for mTBI subjects compared to controls. The significant differences in transition probability …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Melanoma and other skin lesion detection using smart handheld devices",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-2172-0_30",
            "Abstract": "Smartphones of the latest generation featuring advanced multicore processors, dedicated microchips for graphics, high-resolution cameras, and innovative operating systems provide a portable platform for running sophisticated medical screening software and delivering point-of-care patient diagnostic services at a very low cost. In this chapter, we present a smartphone digital dermoscopy application that can analyze high-resolution images of skin lesions and provide the user with feedback about the likelihood of malignancy. The same basic procedure has been adapted to evaluate other skin lesions, such as the flesh-eating bacterial disease known as Buruli ulcer. When implemented on the iPhone, the accuracy and speed achieved by this application are comparable to that of a desktop computer, demonstrating that smartphone applications can combine portability and low cost with high performance …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:8AbLer7MMksC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "Source Localization of a N400-like Negativity in a Sentence-Reading Paradigm Using Evoked Magnetic Fields and Magnetic Resonance Imaging",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4612-1260-7_213",
            "Abstract": "The N400 component of the Event-Related Potential (ERP) corresponds to a negative-going deflection that peaks at approximately 400 ms after the onset of the final word in a sentence [1]. N400 amplitude is believed to be an index of the degree that a given concept is deemed “appropriate” within a particular linguistic context [2], Little is known regarding the sources of neural activity that give rise to N400-like negativities measured from the scalp. Identifying the neural substrates of N400 activity could provide important information regarding the brain structures that participate in language comprehension. Intracranial recordings have revealed sources of electrical activity, that become active at the same latency as the scalp-recorded N400 response, in paleo- and archeocortical regions as well as in neocortical areas. The former included the hippocampus and the parahippocampal gyrus [3, 4]. Potential …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Alpha desynchronization/synchronization during working memory testing is compromised in acute mild traumatic brain injury (mTBI)",
            "Publication year": 2018,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0188101",
            "Abstract": "Diagnosing and monitoring recovery of patients with mild traumatic brain injury (mTBI) is challenging because of the lack of objective, quantitative measures. Diagnosis is based on description of injuries often not witnessed, subtle neurocognitive symptoms, and neuropsychological testing. Since working memory (WM) is at the center of cognitive functions impaired in mTBI, this study was designed to define objective quantitative electroencephalographic (qEEG) measures of WM processing that may correlate with cognitive changes associated with acute mTBI. First-time mTBI patients and mild peripheral (limb) trauma controls without head injury were recruited from the emergency department. WM was assessed by a continuous performance task (N-back). EEG recordings were obtained during N-back testing on three occasions: within five days, two weeks, and one month after injury. Compared with controls, mTBI patients showed abnormal induced and evoked alpha activity including event-related desynchronization (ERD) and synchronization (ERS). For induced alpha power, TBI patients had excessive frontal ERD on their first and third visit. For evoked alpha, mTBI patients had lower parietal ERD/ERS at the second and third visits. These exploratory qEEG findings offer new and non-invasive candidate measures to characterize the evolution of injury over the first month, with potential to provide much-needed objective measures of brain dysfunction to diagnose and monitor the consequences of mTBI.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:_Ybze24A_UAC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Early diagnosis of skin cancer based on segmentation and measurement of vascularization and pigmentation in nevoscope images",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1403484/",
            "Abstract": "This work presents techniques developed for automated image segmentation and classification of skin lesions as malignant or benign based on the ground truth. For each skin lesion two images are obtained, one in each of two different modalities of epiluminescence microscopy (ELM): Side-transillumination which highlights the subsurface vasculature and surface pigmentation, and cross polarization, which only highlights the details of skin surface pigmentation. The automated procedure consists of three steps: i) Segmentation of images, using three segmentation methods; ii) Selection of the most accurate segmentation results based on a weighted scoring technique; and iii) classification of the lesion as malignant or benign by verifying the presence of a ring of hypervascularity around the lesion in the side transillumination images. The segmentation results were validated against manual segmentation by an …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lesion border detection in Buruli ulcer images",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6347210/",
            "Abstract": "Buruli ulcer, a disease caused by infection with Mycobacterium ulcerans, is one of the most neglected but treatable tropical diseases. In this paper, a novel segmentation scheme is proposed to detect the border of Buruli lesions in cross-polarization dermoscopic images that were obtained under white light illumination. The method consists of three main steps: first, segmentations in different color spaces by thresholding are fused to form an initial contour, then a level set segmentation is applied to both the luminance and color components of the image, and finally, decisions for each pixel are made by a support vector machine classifier. Experimental results with 26 images show that the proposed methodology outperforms other state-of-art segmentation approaches for Buruli images.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Topographic phase maps using iterative independent component analysis",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5946518/",
            "Abstract": "In this study, we employed our recently developed iterative independent component analysis (iICA) procedure to measure single-trial EPs from auditory N100 recordings of 21 normal subjects obtained with a whole-head, 256-channel dense-array EEG (eJEEG) scanner. To study the general applicability of the method, it was also applied to five magnetoencephalographic (MEG) datasets. For each channel, single trial responses were extracted using the iICA approach followed by separating trials into two groups one with trials having the same and the other having the opposite phase as the average response. Topographic phase maps were constructed by calculating, for each channel, the percentage of trials that go in-phase (%IP) with the average. The phase maps were found to follow a trend that was similar to amplitude distribution. With EEG, the channels with high %IP were clustered mainly along the midline …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Biomedical technology and devices handbook",
            "Publication year": 2003,
            "Publication url": "https://www.taylorfrancis.com/books/mono/10.1201/9780203491492/biomedical-technology-devices-handbook-george-zouridakis",
            "Abstract": "Concise yet comprehensive, the Biomedical Technology and Devices Handbook illuminates the equipment, devices, and techniques used in modern medicine to diagnose, treat, and monitor human illnesses. With topics ranging from the basic procedures like blood pressure measurement to cutting-edge imaging equipment, biological tests, and genetic engineeri",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:XiVPGOgt02cC",
            "Publisher": "CRC press"
        },
        {
            "Title": "Decoding movement direction using phase-space analysis of hemodynamic responses to arm movements based on functional near-infrared spectroscopy",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7591014/",
            "Abstract": "In this study we applied phase-space analysis on the hemodynamic signals recorded from the motor cortex of human subjects using functional near infrared spectroscopy (fNIRS) to decode the direction of intentional hand movements. Our goal is to develop a brain-computer-interface (BCI) based on optical imaging that can control a wheelchair. To establish the relationship between the hemodynamic response and movement direction, participants were asked to perform repetitive arm movements in two orthogonal directions (right-left and front-back) on a horizontal plane, while the time course of the oxy-hemoglobin (oxy-Hb) and deoxy-hemoglobin (deoxy-Hb) responses were recorded. We applied phase-space analysis on oxy-Hb and deoxy-Hb signals to characterize movement direction. Our results show that movement directions taken pairwise (left vs. right, and forward vs. backward) are mapped onto different …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low frequency overactivation in dyslexia: Evidence from resting state Magnetoencephalography",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7319993/",
            "Abstract": "In this study, we compared the brain activation profiles obtained from resting state Magnetoencephalographic (MEG) activity in 15 dyslexic patients with the profiles of 15 normal controls, using power spectral density (PSD) analysis. We first estimated intracranial dipolar MEG sources on a dense grid on the cortical surface and then projected these sources on a standardized atlas with 68 regions of interest (ROIs). Averaging the PSD values of all sources in each ROI across all control subjects resulted in a normative database that was used to convert the PSD values of dyslexic patients into z-scores in eight distinct frequency bands. We found that dyslexic patients exhibited statistically significant overactivation in the delta band (0.1-4 Hz) in the right temporal (entorhinal and insula), left inferior frontal (Broca's area), and right inferior frontal regions. Overactivation may be interpreted as a compensatory mechanism for …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Source connectivity analysis can assess recovery of acute mild traumatic brain injury patients",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8513045/",
            "Abstract": "In this study we investigated whether source connectivity analysis of resting-state Magnetoencephalographic (MEG) activity could separate mild traumatic brain injury (mTBI) patients from age-and sex-matched controls. For each subject, we used artifact-free data recorded on three sessions to estimate intracranial sources which were then projected onto a standardized brain atlas for common reference. The statistical and topological properties of functional brain networks, estimated using Granger causality, were analyzed using MANOVA, with group and recording session as the independent variables and number of in-going and out-going connections in each atlas region as dependent variables. Overall, mTBI subjects showed a larger number of stronger connections compared to controls. The number and topology of in-going and out-going connections were significantly different across the two groups in areas …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Statistical Model of Retinal SD-OCT Data: Preliminary Simulation and Evaluation of Denoising Performance",
            "Publication year": 2011,
            "Publication url": "https://iovs.arvojournals.org/article.aspx?articleid=2352026",
            "Abstract": "Purpose:: Post acquisition image processing is frequently used to align and denoise Spectral Domain Optical Coherence Tomography (SD-OCT) data. A standardized image database would facilitate fair and quantitative comparisons of the effects of image processing algorithms. The purpose of this study was to develop a simplified statistical model representing the main structural layers of the retina and to compare the performance of two popular algorithms for image denoising based on wavelets and curvelets.Methods:: The model developed includes 7 homogeneous regions representing distinct layers of the retina in the Brown Norway rat. An expert manually segmented each retinal layer from SD-OCT B-scans and statistical parameters for the distribution of pixel intensity were derived for each layer. Using this model, ten synthetic SD-OCT images (512x512 px) were generated and speckle noise was added to …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:BrmTIyaxlBUC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Modeling tumor growth: from differential deformable models to growth prediction of tumors detected in pet images",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1280470/",
            "Abstract": "Modeling of a growing tumor over time is extremely difficult, because of the complex biological phenomena underlying cancer proliferation. Existing models can mostly describe in vitro experiments of spherically-shaped avascular tumors, but they cannot match the highly heterogeneous and complex-shaped tumors seen in cancer patients. We propose a new time-dependent geometric deformable model that can characterize tumors of complex shape, such as vascular tumors. Preliminary result show that such a model can provide an adequate framework for analyzing and predicting the growth of tumors seen in PET images of cancer patients.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring neuroplasticity in acute mild traumatic brain injury",
            "Publication year": 2016,
            "Publication url": "http://wearablesensing.com/files/HMRI_POSTER_ICCAI_Poster_081516.pdf",
            "Abstract": "METHODS• Study participants: 13 acute mTBI patients and 7 controls (nonhead-trauma patients) recruited from the emergency department of Huntington Memorial Hospital in Pasadena, CA–Control and mTBI subjects matched on age, sex, education, and body mass index (BMI).",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:Mojj43d5GZwC",
            "Publisher": "The Federation of American Societies for Experimental Biology"
        },
        {
            "Title": "3D modeling to characterize lamina cribrosa pore geometry using in vivo images from normal And glaucomatous eyes",
            "Publication year": 2012,
            "Publication url": "https://iovs.arvojournals.org/article.aspx?articleid=2350202",
            "Abstract": "Purpose:: En face adaptive optics scanning laser ophthalmoscope (AOSLO) images of the anterior lamina cribrosa surface (ALCS) represent a 2D projected view of a 3D surface. Laminar pore parameters calculated from these 2D images do not best represent the native 3D geometry. Using images acquired in living eyes, we modeled the ALCS in 3D and transformed 2D AOSLO images onto the 3D surface to better characterize laminar pores.Methods:: AOSLO images of the ALCS were acquired in vivo in the control and glaucomatous eyes of a rhesus monkey with unilateral experimental glaucoma and were used to calculate laminar pore areas. Spectral domain optical coherence tomography (SDOCT)[Spectralis HRA+ OCT] cross-sectional radial scans (20 field, 48 B-scans) of the optic nerve head were acquired in both eyes. The ALCS was manually marked in SDOCT B-scans using a custom MATLAB program. A thin plate spline was fit to the marked points to model the ALCS in 3D. After registering and projecting the 2D AOSLO images onto the 3D surface, the surface was tessellated into a 3D triangular mesh. The 3D surface area of a given pore was calculated by adding the area of the individual triangles that formed the surface within the pore’s boundary. The differences in the area of corresponding pores in the 2D and 3D images from living eyes were compared.Results:: This modeling method was validated using synthetic data (surfaces and objects of known geometry). For example, a circular pore projected onto a hemisphere resulted in a transformed surface area within 0.7% of the theoretical value. In the monkey with experimental …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:q3oQSFYPqjQC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Comparison between ICA and wavelet-based denoising of single-trial evoked potentials",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1403097/",
            "Abstract": "Analysis of evoked potentials (EPs) on a single-trial basis allows the study of the dynamical characteristics of brain activity. However, single-trial responses are buried into the more prominent ongoing electroencephalographic (EEG) activity, and thus advanced procedures are needed to obtain the activity only of the cortical generators that are activated by the experimental task under study. We compare the effectiveness of two methods at removing extraneous activity from single-trial EPs, namely, a recently-proposed iterative procedure based on independent component analysis (ICA) and wavelet denoising, using simulated data and actual EP recordings from normal subjects, more specifically the auditory N100-P200 complex.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Magnetoencephalography reveals mismatch field enhancement from unexpected syntactic category errors in English sentences",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304394017306237",
            "Abstract": "The type of syntactic operations that increase neuronal activation in humans as a result of syntactically erroneous, unexpected lexical items in hearing sentences has remained unclear. In the present study, we used recordings of magnetoencephalographic (MEG) activity to compare bare infinitive and full infinitive constructions in English. This research aims to identify the type of syntactic deviance that may trigger an early syntax-related mismatch field (MMF) component when unexpected words appear in sentences.Six speakers of English as a first language were presented with auditory stimuli of sentences or words in a passive odd-ball paradigm while watching a silent movie. The experimental protocol included four sessions, specifically investigating the sentential (structural) versions of full (with the ‘to’ infinitival particle) and bare infinitival structures (without the particle) and the lexical (non-structure) versions of …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:1yQoGdGgb4wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Comparison of brain network models using cross-frequency coupling and attack strategies",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7320108/",
            "Abstract": "Several neuroimaging studies have suggested that functional brain connectivity networks exhibit “small-world” characteristics, whereas recent studies based on structural data have proposed a “rich-club” organization of brain networks, whereby hubs of high connection density tend to connect among themselves compared to nodes of lower density. In this study, we adopted an “attack strategy” to compare the rich-club and small-world organizations and identify the model that describes best the topology of brain connectivity. We hypothesized that the highest reduction in global efficiency caused by a targeted attack on each model's hubs would reveal the organization that better describes the topology of the underlying brain networks. We applied this approach to magnetoencephalographic data obtained at rest from neurologically intact controls and mild traumatic brain injury patients. Functional connectivity networks …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Single-Trial EP Analysis Improves Separation of Normal and Schizophrenia Subjects",
            "Publication year": 2004,
            "Publication url": "https://search.proquest.com/openview/b1f3bd388548523881a9e7f2b54a71f3/1?pq-origsite=gscholar&cbl=39840",
            "Abstract": "Methods: Data from 23 normal and 15 schizophrenia subjects were analyzed. Responses were obtained in a paired-stimulus paradigm, in which an S1 stimulus is followed by an S2, approx. 500 msec later. The intertrial interval was equal to 8 sec. For each response, we measured component amplitude and latency. A logistic model tree (LMT) scheme was then used to classify the responses of the two groups, separately on each method, while the performance of the classification procedure was quantified using 5-fold cross-validation approach.Results: We found that normal controls tended to respond earlier and individual responses had significantly increased amplitudes (p< 0.01) compared to the schizophrenia patients. Also, the normal response latencies were considerably less variable, compared to schizophrenia subjects, who exhibit widely dispersed latencies. Overall, the S1 latency was the most significant …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:Fu2w8maKXqMC",
            "Publisher": "SAGE PUBLICATIONS, INC."
        },
        {
            "Title": "Detection of Buruli ulcer disease: preliminary results with dermoscopic images on smart handheld devices",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6461311/",
            "Abstract": "Buruli ulcer (BU) disease is a devastating flesh-eating bacterial infection that each year affects thousands of people, but if detected early, it can be easily treated and cured. During the past several years, we have been developing an automated dermoscopy system for accurate analysis of skin lesions. In this paper, we describe our experience with BU detection in West Africa, and we focus on the classification and validation stages of the system. We analyzed a set of 58 skin lesions consisting of 16 confirmed BU and 42 non-BU cases. After segmentation, we extracted texture and color descriptors from all images and studied the accuracy of BU detection, using a bag-of-feature classification procedure, as well as the influence of different sampling strategies, patch size, codebook size, and kernel type. Our results show an overall 95.2% classification accuracy. These findings suggest that smart phones can be used as …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic segmentation of skin lesion images using evolution strategies",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1746809408000190",
            "Abstract": "Skin cancer is the most common form of cancer and represents 50% of all new cancers detected each year. However, if detected at an early stage, simple and economic treatments can cure most skin cancers. Accurate skin lesion segmentation is critical in automated skin cancer early detection and diagnosis systems. In this paper, we present an evolution strategy (ES) based segmentation algorithm to identify the lesion area within an ellipse. The method is applied to a set of 51 crosspolarization and 60 transillumination images segmented manually by a dermatologist, which are used as ground truth. Unlike most segmentation procedures, the proposed ES-based method can detect the lesion automatically without setting parameters and initial values by trial and error. Compared to results from our previous work, the ES-based method gives comparable accuracy for easily segmented images and much better results …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "26th annual computational neuroscience meeting (CNS* 2017): Part 3",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s12868-017-0372-1;",
            "Abstract": "Ischemic stroke is fundamentally a multiscale phenomenon [1]. Occlusion of blood vessels in the brain triggers a cascade of changes including: 1. synaptic glutamate release, related to excitotoxicity; 2. elevated extracellular potassium, leading to spreading depression; 3. cell swelling, reducing the extracellular volume and diffusion; 4. production of reactive oxygen species, which give rise to inflammation. These cascades occur over multiple time-scales, with the initial rapid changes in cell metabolism and ionic concentrations trigging several damaging agents that may ultimately leads to cell death. Tissue affected by ischemic stroke is divided into three regions; 1. a core where cells suffer irreparable damage and death, 2. a penumbra where cells may recover with reperfusion, 3. a further region of edema where spontaneous recovery is expected. Multiscale modeling and multiphysics modeling is essential to capture …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:UHK10RUVsp4C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Decoding of movement direction using optical imaging of motor cortex",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2202-14-S1-P380",
            "Abstract": "This study provides a computational scheme to decode intentional arm movement direction using optical imaging of the motor cortex for future implementation on a neuroprosthetic device that enables physically disabled patients to navigate a wheelchair using brain-derived signals. To this end, we developed a signal-processing algorithm for detecting movement direction from hemodynamic signals using functional near-infrared spectroscopy (fNIRS) recorded in human subjects during execution of a directional motor task. fNIRS has been shown to reflect hemodynamic responses in the cortex during execution of computational [1, 4, 6] and motor tasks [2], and can capture better regional cerebral blood volume (rCBV) changes [3] than blood-oxygen level dependent (BOLD) signals [5]. We used 64 spatially distributed optrodes to record from both hemispheres of motor cortices during free arm orthogonal movements in …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:p2g8aNsByqUC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Native non-prototypicality in vowel perception induces prominent neuromagnetic mismatch intensities in non-native speakers: a pilot study",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00221-020-05996-4",
            "Abstract": "Neural mismatch response resulting from the difference between prediction and observation is related to change detection and discrimination. Robust neuromagnetic brain activity of auditory mismatch-related perception occurs in response to non-prototypical vowels in across-category contrasts for first-language speakers. However, whether this non-prototypicality effect applies to within-category vowel perception remains to be elucidated. Here, healthy Japanese adults (n= 7) were subjected to magnetoencephalography (MEG) while watching a silent movie, and passively listened to synthesized English vowels/i/. We observed the source-level mismatch effect to the mid-high near-front vowel deviant [ɪ] with the most non-prototypical, unspecified feature in the participants’ native language system. The mismatch effect recruited the left posterior superior temporal sulcus with a peak latency of 225 ms post-stimulus …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A hybrid algorithm for artifact rejection in EEG recordings based on iterative ICA and fuzzy clustering",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4649088/",
            "Abstract": "Brain responses to repeated sensory stimuli are typically contaminated by extraneous activity, including background rhythms, artifacts, and interference signals. To address this issue, we have recently proposed a new iterative independent component analysis (iICA) approach that can provide reliable evoked response (ER) estimates on a single trial basis. In this paper, we present a new two-step approach that focuses on removing well-defined artifacts, such as eye movements and muscle activity, before iICA processing. Extended analyses with both simulated data and actual recordings from normal subjects demonstrate that this procedure gives better results than iICA alone. Additionally, this methodology is suitable for fast analysis of multi-electrode recordings in parallel architectures, as individual channels can be processed simultaneously on different processors, and thus, it may have a significant impact on the …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Functional Connectivity Changes Detected with Magnetoencephalography after Mild Traumatic Brain Injury",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Stavros-Dimitriadis-3/publication/282132159_Functional_connectivity_changes_detected_with_magnetoencephalography_after_mild_traumatic_brain_injury/links/5604ff2408ae5e8e3f311e22/Functional-connectivity-changes-detected-with-magnetoencephalography-after-mild-traumatic-brain-injury.pdf",
            "Abstract": "Mild traumatic brain injury (mTBI) may affect normal cognition and behavior by disrupting the functional connectivity networks that mediate efficient communication among brain regions. In this study, we analyzed brain connectivity profiles from resting state Magnetoencephalographic (MEG) recordings obtained from 31 mTBI patients and 55 normal controls. We used phase-locking value estimates to compute functional connectivity graphs to quantify frequency-specific couplings between sensors at various frequency bands. Overall, normal controls showed a dense network of strong local connections and a limited number of long-range connections that accounted for approximately 20% of all connections, whereas mTBI patients showed networks characterized by weak local connections and strong long-range connections that accounted for more than 60% of all connections. Comparison of the two distinct general patterns at different frequencies using a tensor representation for the connectivity graphs and tensor subspace analysis for optimal feature extraction showed that mTBI patients could be separated from normal controls with 100% classification accuracy in the alpha band. These encouraging findings support the hypothesis that MEG-based functional connectivity patterns may be used as biomarkers that can provide more accurate diagnoses, help guide treatment, and monitor effectiveness of intervention in mTBI.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aberrant whole-brain transitions and dynamics of spontaneous network microstates in mild traumatic brain injury",
            "Publication year": 2020,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncom.2019.00090/full?utm_source=researcher_app&utm_medium=referral&utm_campaign=RESR_MRKT_Researcher_inbound",
            "Abstract": "Dynamic Functional Connectivity (DFC) analysis is a promising approach for the characterization of brain electrophysiological activity. In this study, we investigated abnormal alterations due to mild Traumatic Brain Injury (mTBI) using DFC of the source reconstructed magnetoencephalographic (MEG) resting-state recordings. Brain activity in several well-known frequency bands was first reconstructed using beamforming of the MEG data to determine ninety anatomical brain regions of interest. A DFC graph was formulated using the imaginary part of phase-locking values, which were obtained from 30 mTBI patients and 50 healthy controls (HC). Subsequently, we estimated normalized Laplacian transformations of individual, statistically and topologically filtered quasi-static graphs. The corresponding eigenvalues of each node synchronization were then computed and through the neural-gas algorithm, we quantized the evolution of the eigenvalues resulting in distinct network microstates (NMstates). The discrimination level between the two groups was assessed using an iterative cross-validation classification scheme with features either the NMstates in each frequency band, or the combination of the so-called chronnectomics (flexibility index, occupancy time of NMstate, and Dwell time) with the complexity index over the evolution of the NMstates across all frequency bands. Classification performance based on chronnectomics showed 80% accuracy, 99% sensitivity, and 49% specificity. However, performance was much higher (accuracy: 91 - 97 %, sensitivity: 100%, and specificity: 77 – 93 %) when focusing on the microstates. Exploring the mean …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Assessing recovery of acute mild traumatic brain injury patients using diffusion tensor imaging",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=200606842208277704&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:dQ2og3OwTAUC",
            "Publisher": "TAYLOR & FRANCIS INC"
        },
        {
            "Title": "Biomedical Technology and Devices",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=8872094667766259689&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:9vf0nzSNQJEC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Brain white mater differences between normal subjects and ALS patients assessed by diffusion tensor imaging",
            "Publication year": 2007,
            "Publication url": "http://www.wseas.us/e-library/conferences/2007cscc/papers/561-524.pdf",
            "Abstract": "Amyotrophic lateral sclerosis (ALS) is characterized by progressive degeneration of motor neurons. A reliable, noninvasive, and objective imaging method of upper motor neuron involvement is critical for the early diagnosis and monitoring of disease progression in ALS patients. Magnetic resonance diffusion tensor imaging (DTI) has been used to show differences in fractional anisotropy (FA) of water diffusion in brain white matter in ALS patients compared to normal controls of the same age group. In this paper, we studied the spatial extent of the brain areas affected in ALS patients using DTI. Our preliminary results show significantly higher FA values in normal subjects compared to ALS patients localized in the left and right frontal and temporal lobes.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Temporal decoupling of oxy-and deoxy-hemoglobin hemodynamic responses detected by functional near-infrared spectroscopy (fNIRS)",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1086.3736&rep=rep1&type=pdf",
            "Abstract": "This study provides experimental evidence that there is temporal decoupling between the hemodynamic responses of oxy-and deoxy-hemoglobin (Hb) as detected by functional nearinfrared spectroscopy (fNIRS). Using 64 spatially distributed optrodes to record motor cortical activities during a free arm movement task (right-left and front-back movements), we detected that the temporal profile of oxy-and deoxy-Hb responses are desynchronized and decoupled (ie, oxy-and deoxy-Hb levels do not rise and fall at the same time). We correlated four different measures of hemodynamic profiles with the arm movements, namely, oxy-(HbO2) and deoxy-hemoglobin (Hb) and their summation (HbO2+ Hb) and difference (HbO2-Hb) signals. These measures correspond to the changes in oxygen delivery, oxygen extraction, total blood volume delivered, and total oxygenation with specific movement directions, respectively. They revealed different components of the hemodynamic response in a localized neuronal population in the motor cortex. The results suggested that, by using these four measures, oxygen delivery and oxygen extraction can be coupled in one movement direction, but decoupled in another movement direction for the same human subject executing the same movement task. Oxygen delivery and oxygen extraction do not always co-vary together temporally. Thus, using a single measure of oxygen delivery or extraction alone may not be sufficient to determine whether the cortical area is activated or deactivated. Rather, a combination of all four measures of hemodynamic signals that represent temporal coupling and decoupling of oxygen …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Alpha power during working memory is compromised in acute mild traumatic brain injury",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=10190764239131335030&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:PR6Y55bgFSsC",
            "Publisher": "TAYLOR & FRANCIS INC"
        },
        {
            "Title": "Head errors of syntactic dependency increase neuromagnetic mismatch intensities",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00221-020-05872-1",
            "Abstract": "Mismatch-related brain activation in healthy individuals is an important area of neural investigation. Previously, we evaluated sentence-level syntactic dependencies, composed of a head and a dependent between two syntactically related words in head-initial English structures. We demonstrated that prominent mismatch effects were induced by within-category dependent errors when semantic interpretation was preserved. However, the following issues were not addressed: (1) whether head errors of syntactic dependency in head-final structures would elicit large mismatch field (MMF) intensities, and (2) whether an MMF effect of syntactic errors would be seen in the left superior temporal cortex alone. In this study, auditory MMFs were obtained by magnetocephalography (MEG) from healthy Japanese adults (n = 8) who were subjected to a passive auditory oddball paradigm with syntactically legal or illegal …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:9Nmd_mFXekcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "A principal component analysis based approach to determine predominant lamina cribrosa beam orientation directly from in vivo images",
            "Publication year": 2013,
            "Publication url": "https://jov.arvojournals.org/article.aspx?articleid=2143731",
            "Abstract": "The lamina cribrosa, a 3D meshwork of collagenous beams within the optic nerve head, is suggested to be the initial site of damage to retinal ganglion cell axons in glaucoma. Previous studies that examined the predominant orientation of laminar beams in histological images have typically been performed on binary segmented raw images using techniques such as mean intercept length (MIL) and radon transform. We have developed a method based on principal component analysis (PCA) that operates directly on grayscale images without the need for binary segmentation. To validate the method, we employed synthetic images of known characteristics to estimate the predominant orientation of overlapping local regions of interest and compared the resulting estimates with the known values for different levels of noise and blur. Overall, the PCA-based method yielded estimates with smaller errors in local …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:738O_yMBCRsC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "SVM-based texture classification and application to early melanoma detection",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4462869/",
            "Abstract": "We have recently developed a decision support system for early skin cancer detection that relies on analysis of the pigmentation characteristics of a skin lesion, detected using crosspolarization imaging, and the increased vasculature associated with malignant lesions that is detected using transillumination imaging. Current system uses size difference based on lesion physiology and achieves great overall accuracy (86.9%). In this paper, we explore texture information, one of the criteria dermatologists use in the diagnosis of skin cancer, but has been found very difficult to utilize in an automatic manner. The overarching goal is to improve the overall decision support capability of the DSS. The objective is to use texture information ONLY to classify the benign and malignancy of the skin lesion. A three-layer mechanism that inherent to the support vector machine (SVM) methodology is employed to improve the …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Restoring cortical connectivity directionality and synchronization is essential to treating disorder of consciousness",
            "Publication year": 2014,
            "Publication url": "https://www.ingentaconnect.com/content/ben/cpd/2014/00000020/00000026/art00012",
            "Abstract": "The design of neurorehabilitation therapy to treat subjects with altered consciousness provides opportunities and challenges to professionals involved with the care for these severely ill patients. While there is an increased interest in determining methods to restore consciousness in these patients, the process is complex and challenging, due in part to the diverse aetiology of these states of consciousness, and also to the intricate cerebral connectivity involved in their treatment. The present case study examines a patient who showed signs of emergence from the vegetative state after neurorehabilitation using The Combined Method Therapy (CMT). In this case, neurorehabilitation therapy was applied simultaneously with pharmacological treatment, stimulation, and neuroimaging techniques to help adjust drug dosage. The results of this study suggest that this combined approach to treatment promoted connectivity …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "Methods for screening and diagnosing a skin condition",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US10593040B2/en",
            "Abstract": "Provided herein are digital-implemented methods for performing simultaneous analyses on an object on the skin of an animal body, for example, a human, to classify the object as a skin cancer, an ulcer or neither. The analyses are performed simultaneously on a hand-held imaging device.",
            "Abstract entirety": 1,
            "Author pub id": "1tQZV14AAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Working memory (WM) processing is compromised in acute mild traumatic brain injury",
            "Publication year": 2017,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-0ee3decd-34de-3bf4-8831-f809e6838abb",
            "Abstract": "Working memory (WM) processing is compromised in acute mild traumatic brain injury × Close \nThe Infona portal uses cookies, ie strings of text saved by a browser on the user's device. The \nportal can access those files and use them to remember the user's data, such as their chosen \nsettings (screen view, interface language, etc.), or their login data. By using the Infona portal \nthe user accepts automatic saving and using this information for portal operation purposes. \nMore information on the subject can be found in the Privacy Policy and Terms of Service. By \nclosing this window the user confirms that they have read the information on cookie usage, and \nthey accept the privacy policy and the way cookies are used by the portal. You can change the \ncookie settings in your browser. I accept Polski English Login or register account remember \nme Password recovery INFONA - science communication portal INFONA Search × () /…",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Schizophrenia assessment using single-trial analysis of brain activity",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/7657_2013_63.pdf",
            "Abstract": "In the quest for neurophysiological biomarkers that uniquely characterize schizophrenia subjects, auditory evoked potentials (EPs) have been extensively used during the past several decades. Typically, EPs are estimated using ensemble averaging to obtain robust components. Averaging, however, eliminates all temporal variability of the recorded signals and, therefore, hampers the study of the brain temporal dynamics underlying the generation of EP components. In this chapter, we present a methodology for analyzing EPs on a single-trial basis using an iterative independent component analysis procedure. The method is capable of identifying and measuring the amplitude, latency, and overall morphology of individual EP components in single trials and, as such, permits the study of phase characteristics among single trials while preserving known features of the average EPs. Recordings from …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:K3LRdlH-MEoC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "Altered cross-frequency coupling in resting-state MEG after mild traumatic brain injury",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167876016300198",
            "Abstract": "Cross-frequency coupling (CFC) is thought to represent a basic mechanism of functional integration of neural networks across distant brain regions. In this study, we analyzed CFC profiles from resting state Magnetoencephalographic (MEG) recordings obtained from 30 mild traumatic brain injury (mTBI) patients and 50 controls. We used mutual information (MI) to quantify the phase-to-amplitude coupling (PAC) of activity among the recording sensors in six nonoverlapping frequency bands. After forming the CFC-based functional connectivity graphs, we employed a tensor representation and tensor subspace analysis to identify the optimal set of features for subject classification as mTBI or control. Our results showed that controls formed a dense network of stronger local and global connections indicating higher functional integration compared to mTBI patients. Furthermore, mTBI patients could be separated from …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:5ugPr518TE4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Brain activation profiles in mTBI: evidence from ERP activity of working memory response",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7591083/",
            "Abstract": "In this study we analyzed event related potentials (ERPs) obtained in an N-back working memory test that varied in difficulty from 0- to 2-back. We collected 21 channels of activity from 11 mild traumatic brain injury (mTBI) patients and 7 normal controls, on three different visits, and used the amplitude and latency of the P300 component to characterize the subjects. A preprocessing procedure based on independent component analysis was used first to identify and eliminate electrophysiological noise on a single trial basis. Then to obtain more reliable statistics, the recording electrodes were lumped into five main groups corresponding roughly to frontal, central, parietal, and left and right temporal brain regions. For each subject, the P300 amplitude and latency were measured after averaging the activity of all channels in each group. Group analyses showed that latencies in the central region were significantly shorter …",
            "Abstract entirety": 0,
            "Author pub id": "1tQZV14AAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        }
    ]
}]