[{
    "name": "Konstantinos Danas",
    "romanize name": "Konstantinos Danas",
    "School-Department": "Computer Science & Mathematics",
    "University": "Kingston University, London",
    "Rank": "Καθηγητής",
    "Apella_id": 11148,
    "Scholar name": "Kostas (Konstantinos) Danas",
    "Scholar id": "0I7D4_AAAAAJ",
    "Affiliation": "Ecole Polytechnique, CNRS",
    "Citedby": 1748,
    "Interests": [
        "Solid Mechanics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=0I7D4_AAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Microstructurally-guided explicit continuum models for isotropic magnetorheological elastomers with iron particles",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020746219306067",
            "Abstract": "This work provides a family of explicit phenomenological models both in the F− H and F− B variable space. These models are derived directly from an analytical implicit homogenization model for isotropic magnetorheological elastomers (MREs), which, in turn, is assessed via full-field numerical simulations. The proposed phenomenological models are constructed so that they recover the same purely mechanical, initial and saturation magnetization and initial magnetostriction response of the analytical homogenization model for all sets of material parameters, such as the particle volume fraction and the material properties of the constituents (eg, the matrix shear modulus, the magnetic susceptibility and magnetization saturation of the particles). The functional form of the proposed phenomenological models is based on simple energy functions with small number of calibration parameters thus allowing for the …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Tailoring magneto-mechanical properties of NdFeB particle-filled soft elastomers",
            "Publication year": 2020,
            "Publication url": "https://meetings.aps.org/Meeting/MAR20/Session/B25.9",
            "Abstract": "This work investigates the possibilities of tailoring the magneto-mechanical properties of hard (permanent) magnetic NdFeB particle-filled soft magnetorheological elastomers by proposing novel microstructures. Our numerical computations for the mechanical response of various regular and chiral unit cells with a permanently magnetized elliptic inclusion show distinct features depending on the aspect ratio and the orientation of the inclusion. It is observed that the mechanical deformations are selectively preferred at certain directions, which make the magnetic inclusions align themselves along their easy axes, reducing the net magnetic moment. In particular, for the microstructural orientation angle of 30-60 degrees, the simple shear mode is observed to facilitate easy magnetic alignments and thus becomes energetically favorable over the uniaxial tension/compression mode. Moreover, the overall (effective …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:zA6iFVUQeVQC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Homogenization-based constitutive models for viscoplastic porous media with evolving microstructure",
            "Publication year": 2008,
            "Publication url": "https://search.proquest.com/openview/16a31b4ca318ff6bd83af9f07e106ca3/1?pq-origsite=gscholar&cbl=18750",
            "Abstract": "This work is concerned with the application of the\" second-order\" nonlinear homogenization procedure of Ponte Castañeda (2002) to generate estimates for the effective behavior of viscoplastic porous materials. The main concept behind this procedure is the construction of suitable variational principles utilizing the idea of a\" linear comparison composite\" to generate corresponding estimates for the nonlinear porous media. Thus, the main objective of this work is to propose a general constitutive model that accounts for the evolution of the microstructure and hence the induced anisotropy resulting when the porous material is subjected to finite deformations.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two families of explicit models constructed from a homogenization solution for the magnetoelastic response of MREs containing iron and ferrofluid particles",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020746219306237",
            "Abstract": "This work puts forth two families of fully explicit continuum or phenomenological models that are constructed by approximating an analytical (but implicit) homogenization solution recently derived for the free-energy function describing the macroscopic magnetoelastic response of two classes of MREs comprised of an isotropic incompressible elastomer filled with a random isotropic distribution of:(i) spherical iron particles and (i i) spherical ferrofluid particles. Both families are given in terms of free-energy functions W H= W H (F, H) that depend on the deformation gradient F and the Lagrangian magnetic field H and are constructed so as to agree identically with the homogenization solution for small and large applied magnetic fields, this for arbitrary finite deformations and arbitrary volume fractions c of particles in the entire physical range c∈[0, 1]. The accuracy of the proposed phenomenological models is assessed …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An explicit dissipative model for isotropic hard magnetorheological elastomers",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509621000569",
            "Abstract": "Hard magnetorheological elastomers (h-MREs) are essentially two phase composites comprising permanently magnetizable metallic inclusions suspended in a soft elastomeric matrix. This work provides a thermodynamically consistent, microstructurally-guided modeling framework for isotropic, incompressible h-MREs. Energy dissipates in such hard-magnetic composites primarily via ferromagnetic hysteresis in the underlying hard-magnetic particles. The proposed constitutive model is thus developed following the generalized standard materials framework, which necessitates suitable definitions of the energy density and the dissipation potential. Moreover, the proposed model is designed to recover several well-known homogenization results (and bounds) in the purely mechanical and purely magnetic limiting cases. The magneto–mechanical coupling response of the model, in turn, is calibrated with the aid of …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:yD5IFk8b50cC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A finite-strain model for anisotropic viscoplastic porous media: II–Applications",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753808001149",
            "Abstract": "In Part I of this work, we have proposed a new model based on the “second-order” nonlinear homogenization method for determining the effective response and microstructure evolution in viscoplastic porous media with aligned ellipsoidal voids subjected to general loading conditions. In this second part, the new model is used to analyze the instantaneous effective behavior and microstructure evolution in porous media for several representative loading conditions and microstructural configurations. First, we study the effect of the shape and orientation of the voids on the overall instantaneous response of a porous medium that is subjected to principal loading conditions. Secondly, we study the problem of microstructure evolution under axisymmetric and simple shear loading conditions for initially spherical voids in an attempt to validate the present model by comparison with existing numerical and approximate …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "HOMOGENIZATION-BASED CONSTITUTIVE MODELS FOR TWO-DIMENSIONAL VISCOPLASTIC POROUS MEDIA WITH EVOLVING MICROSTRUCTURE",
            "Publication year": 2008,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=21033098",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantifying the effect of two-point correlations on the effective elasticity of specific classes of random porous materials with and without connectivity",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020722521000677",
            "Abstract": "It is well-known by now that the Hashin–Shtrikman bounds imply that the two-point correlation functions are not in general sufficient to estimate accurately the response of composites, especially when their underlying phases exhibit infinite contrast, e.g., porous materials. Starting from this longstanding, albeit qualitative result, this work investigates quantitatively the relevance of using two-point correlations to model the effective elastic properties of specific isotropic porous materials with and without connectivity. To achieve this in an unambiguous manner, we propose three different microstructures that share almost identical two-point statistics by design but are rather different morphologically. The choice of these microstructures is driven by their wide use in several practical problems ranging from polymers to geomaterials. The first microstructure is obtained by a random sequential adsorption (RSA) of non …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Bilayer Liquid Crystal and Freedericksz Instability",
            "Publication year": 2017,
            "Publication url": "http://kostasdanas.com/kdanas_files/HALDAR_GACM_2017.pdf",
            "Abstract": "Liquid Crystal (LC) continua consist of elongated rodlike polarized molecules with a preferred average direction, known as directors. They have tremendous importance to the applications in the display technology in the form of LCDs. Responses of such materials are deeply connected with the multi-field coupling of mechanical, electrical, magnetic or thermal fields. The Twisted Nematic Device (TND) is the most widely used for LCDs, and it is the objective of the present investigation.The TND consists of a liquid-crystal layer anchored between two parallel plates. One of the plates is rotated with respect to the other by an angle∆ φ. In the absence of a transverse (ie, normal to the bounding plates) electric field, all the directors are parallel to the bounding plates and form helices that rotate the light by∆ φ, allowing its passing through the two polarized end plates. When the applied transverse electric field exceeds a critical value, the directors suddenly acquire a transverse component. This phenomenon, termed the Freedericksz transition, is responsible for the change of polarization direction in the light, which prevents its passage through the device.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two-field surface pattern control via marginally stable magnetorheological elastomers",
            "Publication year": 2017,
            "Publication url": "https://pubs.rsc.org/en/content/articlehtml/2017/sm/c7sm00996h",
            "Abstract": "The stability and post-bifurcation of a non-linear magnetoelastic film/substrate block is experimentally exploited to obtain active control of surface roughness. The non-intuitive interplay between magnetic field and elastic deformation owes to material and geometry selection, namely a ferromagnetic particle composite film bonded on a compliant passive foundation. Cooperation of the two otherwise independent loading mechanisms-mechanical pre-compression and magnetic field-allows one to bring the structure near a marginally stable state and then destabilize it with either magnetic or mechanical fields. We demonstrate for the first time that the critical magnetic field is a decreasing function of pre-compression and vice versa. The experimental results are then probed successfully with full-field finite element simulations at large strains and magnetic fields. The magnetoelastic coupling allows for reversible on/off …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Royal Society of Chemistry"
        },
        {
            "Title": "Multiscale modeling of skeletal muscle tissues based on analytical and numerical homogenization",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S175161611831049X",
            "Abstract": "A novel multiscale modeling framework for skeletal muscles based on analytical and numerical homogenization methods is presented to study the mechanical muscle response at finite strains under three-dimensional loading conditions. First an analytical microstructure-based constitutive model is developed and numerically implemented in a general purpose finite element program. The analytical model takes into account explicitly the volume fractions, the material properties, and the spatial distribution of muscle's constituents by using homogenization techniques to bridge the different length scales of the muscle structure. Next, a numerical homogenization model is developed using periodic eroded Voronoi tessellation to virtually represent skeletal muscle microstructures. The eroded Voronoi unit cells are then resolved by finite element simulations and are used to assess the analytical homogenization model. The …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:lSLTfruPkqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Acoustic Properties of Continental Carbonate Rocks-Controlling Factors, Analytical and Numerical Simulations",
            "Publication year": 2016,
            "Publication url": "https://www.earthdoc.org/content/papers/10.3997/2214-4609.201600062",
            "Abstract": "The complex nature of carbonate rocks is a major challenge when interpreting seismic data for subsurface characterization. Understanding the relations between sonic velocity and carbonate rock type is one of the keys to interpret data from seismic sections or from acoustic logs. Studies have shown that elastic properties of carbonate rocks are affected by many parameters such as dominant mineralogy, rock fabric, pore type and shape, porosity, and pore fluid, making it difficult to attribute changes in seismic expression to any one parameter. Continental carbonates gained interest following the discovery of the supergiant field in the post- and pre-salt deposits in offshore Brazil, as they account for a large portion of the deepwater production. The genesis of continental carbonates is generally associated with physico-chemical and biological precipitation of carbonates, coupled with a strong influence of clastic …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:YFjsv_pBGBYC",
            "Publisher": "European Association of Geoscientists & Engineers"
        },
        {
            "Title": "Magnetorheological elastomers",
            "Publication year": 2012,
            "Publication url": "https://core.ac.uk/download/pdf/52903437.pdf",
            "Abstract": "Magnetorheological elastomers (MREs) are a class of solids that consist of a rubber matrix filled with magnetizable particles, typically sub-micron sized iron particles (see Rigbi and Jilkén (1983) and Ginder et al.(1999)). The interest in these materials stems from their strong magnetoelastic coupling properties. The application of an external magnetic field h, tends to align the initially random magnetization vectors of the particles with the applied external field. As a result the interparticle magnetic forces result in the macroscopic magnetostriction of the MRE. Although theoretical research in general coupled field theories in mechanics was actively conducted from the early fifties to the early seventies, the attention that this area received in the next twenty years was considerably diminished, perhaps due to the absence of technologically relevant applications. One might also speculate as an additional factor the lack, at the time, of the appropriate computer hardware that is required to handle the complicated numerical calculations necessary for the solution of the resulting boundary value problems (geometric nonlinearities, coupling between mechanical and magnetic fields). The situation changed in the late nineties, due to an application-driven strong interest in MR devices (see for example Carlson and Jolly (2000)) and recent experimental investigations of Ginder et al.(1999) on MREs and their applications as well as the more recent studies of Hubert et al.(2003), Coquelle and Bossis (2006), Diguet et al (2009, 2010). From a theoretical viewpoint, the excellent monograph by Brown (1966), which was published in the mid-sixties, presents a direct …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Magnetorheological elastomers: Experimental and modeling aspects",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-21762-8_32",
            "Abstract": "Magnetorheological elastomers (MREs) are active composite materials that deform under a magnetic field because they are made of a soft elastomer matrix filled with magnetizable micrometric particles. Along with short response times and low magnetic inputs, not only do MREs alter their viscoelastic properties and stiffness in response to external magnetic fields but they can also undergo very high deformation states. While the former effect can be exploited in controllable-stiffness devices, the latter is of interest for haptic devices such as tactile interfaces for the visually impaired. In the perspective of developing a persistent tactile MRE surface exhibiting reversible and large out-of-plane deformations, the first part of this work focuses on the fabrication of MREs that can sustain large deformations. In particular, we determine the critical strain threshold up to which the interfacial adhesion between particles and …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Influence of the Lode parameter and the stress triaxiality on the failure of elasto-plastic porous materials",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768312000467",
            "Abstract": "This work makes use of a recently developed “second-order” homogenization model to investigate failure in porous elasto-plastic solids under general triaxial loading conditions. The model incorporates dependence on the porosity and average pore shape, whose evolution is sensitive to the stress triaxiality and Lode parameter L. For positive triaxiality (with overall tensile hydrostatic stress), two different macroscopic failure mechanisms are possible, depending on the level of the triaxiality. At high triaxiality, void growth induces softening of the material, which overtakes the intrinsic strain hardening of the matrix phase, leading to a maximum in the effective stress–strain relation for the porous material, followed by loss of ellipticity by means of dilatant shear localization bands. In this regime, the ductility decreases with increasing triaxiality and is weakly dependent on the Lode parameter, in agreement with earlier …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The realm of magnetorheological elastomers: experiments, theory and instabilities",
            "Publication year": 2020,
            "Publication url": "https://meetings.aps.org/Meeting/MAR20/Session/B25.6",
            "Abstract": "In this talk, I will present a broad overview of our work on magnetorheological elastomers (MREs) including experiments, theory and numerical implementation. MREs are composite materials comprising metallic soft (eg iron) or hard (eg NdFeB) magnetic micron-sized particles. The latter have been called h-MREs. Out of these materials one can devise a number of interesting meso-and macrostructures, slender or not that can lead to a number of functionalities such as surface patterning, negative or positive swelling, network activation, negative Poisson ratio, evolving anisotropic magnetic properties, hierarchical buckling and others. The main idea lies in the ability to drive the systems by using two external loads, ie mechanical and magnetic ones and in particular to harness the resulting instabilities that are natural in magnetic structures. This allows, in turn, to reach a critically stable state by applying one of the fields …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:rO6llkc54NcC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Bifurcation analysis of twisted liquid crystal bilayers",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509618305921",
            "Abstract": "This work presents a general methodology to analyze three-dimensional Freedericksz transitions in twisted-nematic liquid crystal (LC) bilayers. Using two equivalent coupled electromechanical variational formulations, the problem is treated as a bifurcation instability triggered by an externally applied electric field. Specifically, we consider LC bilayer materials anchored between two bounding plates and subjected to an electric field across the bilayer thickness. The plates are also twisted by an overall angle leading to different orientations of the directors in each layer. We first evaluate the corresponding ground state of the director field, and subsequently, we analyze the bifurcation problem by using a combined analytical-numerical method leading to a one-dimensional finite element discretization of the resulting stiffness matrix of the system. An analytical solution for the zero-twist bilayer is also obtained. The …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:GnPB-g6toBAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A Homogenization model for porous crystals comprising general ellipsoidal voids",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=13033380581708807928&hl=en&oi=scholarr",
            "Abstract": "Voids originate in the manufacturing process have an important effect on the lifetime of materials and play a important role even on metallic alloys. Indeed, as recently indicated by experimental observations (Srivastava et al.[2012]) at high enough temperatures on tensile specimens, the growth of initially present processing induced voids in a nickel based single crystal superalloy as well as in standard polycrystals played a significant role in limiting creep life. The presence of voids in metals is known to be one of the major causes of ductile failure, as addressed in pioneering works by (Mc Clintock [1968], Rice and Tracey [1969], Gurson [1977]). Most of the studies have been carried out in the case of two-phase material systems comprising an isotropic rate independent matrix phase (metal usually described by von Mises yield criterion) and a voided phase (pores of spherical, spheroidal or arbitrary ellipsoidal shapes).Far fewer results have been obtained for rate-dependent anisotropic matrix systems, generally based on a phenomenological Hill-type matrix. However, there is no damage ductile growth model for the case of porous single crystals. When these material systems are subjected to external loads impurities fail or decohere leading to the creation of pores, which in turn evolve in size, shape and orientation (Srivastava and Needleman [2012]). This complex evolution of microstructure together with the evolution of the rate-dependant matrix anisotropy is critical in the prediction of the eventual fracture of the specimen under monotonic and cyclic loading conditions.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental and theoretical inverstigation of magnetorheological elastomers",
            "Publication year": 2011,
            "Publication url": "http://documents.irevues.inist.fr/handle/2042/46656",
            "Abstract": "Magnetorheological elastomers (MREs) are ferromagnetic particle impregnated elastomers whose mechanical properties are altered by the application of external magnetic fields. Due to their magnetoelastic coupling response, MREs are finding an increasing number of engineering applications. The objective of this work is (a) the experimental study of transversely isotropic MREs (i.e., particles form chains along a certain direction) that are subjected to prestressing and arbitrary magnetic fields and (b) the continuum modeling of these materials using transversely isotropic energy functions.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:UeHWp8X0CEIC",
            "Publisher": "AFM, Maison de la Mécanique, 39/41 rue Louis Blanc, 92400 Courbevoie, France (FR)"
        },
        {
            "Title": "Constitutive Modeling of TRIP Steels",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=8754921203087024816&hl=en&oi=scholarr",
            "Abstract": "A constitutive model that describes the mechanical behavior of steels exhibiting ‘‘TRansformation Induced Plasticity’’(TRIP) during martensitic transformation is presented. Multiphase TRIP steels are considered as composite materials with a ferritic matrix containing bainite and retained austenite, which gradually transforms into martensite. The effective properties and overall behavior of TRIP steels are determined by using homogenization techniques for nonlinear composites. A methodology for the numerical integration of the resulting elastoplastic constitutive equations in the context of the finite element method is developed and the constitutive model is implemented in a general-purpose finite element program. The constitutive model is used also for the calculation of ‘‘forming limit diagrams’’for sheets made of TRIP steels; it is found that the TRIP phenomenon increases the strain at which local necking results from …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Failure of elasto-plastic porous materials due to void shape effects and void growth",
            "Publication year": 2011,
            "Publication url": "http://documents.irevues.inist.fr/handle/2042/46736",
            "Abstract": "This work makes use of the recently proposed second-order nonlinear homogenization model (SOM) for (visco)plastic porous materials to study the influence of the Lode parameter and the stress triaxiality on the failure of metallic materials. This model is based on the  second-order  or  generalized secant  homogenization method and is capable of handling general  ellipsoidal  void shapes (i.e., particulate microstructures with more general orthotropic overall anisotropy) and general three-dimensional loading conditions.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:WF5omc3nYNoC",
            "Publisher": "AFM, Maison de la Mécanique, 39/41 rue Louis Blanc, 92400 Courbevoie, France (FR)"
        },
        {
            "Title": "A homogenization model for porous ductile solids under cyclic loads comprising a matrix with isotropic and linear kinematic hardening",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768317302354",
            "Abstract": "In this work, we propose a semi-analytical micromechanical model to study the elasto-plastic response of porous materials subjected to cyclic loading with isotropic and linear kinematic hardening at finite strains. To this end, we use an approximate but numerically efficient decoupled homogenization strategy between the elastic and plastic parts. The resulting effective back stress in the porous solid, similar to the macroscopic stress and plastic strain, has non-zero hydrostatic terms and depends on the porosity, the void shape and orientation as a result of the homogenization process. Subsequently, a complete set of equations is defined to describe the evolution of the microstructure, i.e., void volume fraction (porosity), (ellipsoidal) void shape and orientation both in the elastic and the plastic regimes. The model is then numerically implemented in a general purpose user-material subroutine. Full field finite element …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Modeling and Identification of the constitutive behavior of magneto-rheological elastomers",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01899352/document",
            "Abstract": "In this paper, we study a class of active materials named magneto-rheological elastomers (MREs) with a main focus on their coupled magneto-mechanical response. Based on the theoretical framework proposed by Triantafyllidis [1], we develop the coupled magneto-mechanical constitutive laws in order to identify the corresponding model’s material parameters. The experimental data, obtained with a novel experimental setup allowing tensile tests up to large strains and under high magnetic fields, provide the constitutive parameters needed as input for subsequent numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Random 3D-printed isotropic composites with high volume fraction of pore-like polydisperse inclusions and near-optimal elastic stiffness",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645419303799",
            "Abstract": "Highly porous materials with random closed-cell architecture combine isotropy with high stiffness. Yet in practice, the complexity of their manufacturing limits the experimental exploration of these materials, for which studies of the elastic response remain to date mainly theoretical. In this study, we measure experimentally the elastic moduli of random closed-cell porous-like composites fabricated by 3D-printing. These materials contain a high volume fraction (up to 82 vol pct) of non-overlapping, polydisperse void-like spherical inclusions, which are randomly dispersed in a homogeneous polymer matrix. We first generate the virtual microstructures of these materials using a random sequential adsorption (RSA) algorithm, and then use numerical homogenization to compute the size of the material representative volume element (RVE). The latter is used to assemble the test samples, whereby the void-like inclusions …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Surface patterning and auxetic metamaterial response with magnetorheological elastomers",
            "Publication year": 2018,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2018APS..MARE48008D/abstract",
            "Abstract": "In this work, we propose the use of magnetorheological elastomers (MREs) as designer active materials or even metamaterials by proper combination of geometry, material selection and combined magnetomechanical loadings. Specifically, we study experimentally and numerically the response of an MRE film/substrate assembly subjected to transverse magnetic fields and in-plane pre-compressions. We show that a single material assembly allows for a single and/or double-period wrinkling as well as surface patterning by proper combination of magnetic and mechanical loads. In addition, we show critical magnetic field for wrinkling can be substantially reduced in the presence of compressive prestress of the assembly, thus opening the possibility of controlling haptic interfaces with low magnetic fields. Finally, we propose novel auxetic MREs by use of general numerical framework.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effects of multiaxial cyclic loading conditions on the evolution of porous defects",
            "Publication year": 2014,
            "Publication url": "https://sf2m.edpsciences.org/articles/matecconf/abs/2014/03/matecconf_jip14_08005/matecconf_jip14_08005.html",
            "Abstract": "Multiaxial loading conditions are one of the important parameters in estimating the lifetime of structure both in high and low cycle fatigue ([1 3]). In order to understand the coupling between the macroscopic multiaxial loading and the microscopic defects, we propose to investigate the evolution of an elasto-plastic porous material up to failure under low cycle fatigue conditions. The analysis is performed numerically, using finite elements, on a periodic 3D unit-cell under the assumption of finite strains and subjected to various stress triaxialities, translated as ratios between deviatoric, hydrostatic stress and Lode angles. The present discussion introduces several novel factors in the analysis: (i) 3D geometry in cyclic loading (ii) finite strains (iii) free evolving void shape (iiii) different hardening laws. That one of the important factors is the void shape and that its evolution during cyclic loading depends on its multiaxiality …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:3fE2CSJIrl8C",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "On void shape effects of periodic elasto-plastic materials subjected to cyclic loading",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753814001351",
            "Abstract": "This work investigates the effect of cyclic loading upon periodic elasto-plastic porous materials. The aim is to understand the evolution of the underlying microstructure, described here with a single void embedded in a cubic unit-cell. Periodic finite element (FEM) calculations are carried out under a finite strain deformation process keeping the absolute value of the stress triaxiality and the Lode angle constant during the cycle. As a result of the applied loading conditions, the void geometry, both volume and shape, change significantly leading to porosity and void shape ratcheting. The void shape becomes non-spherical from the very first cycle leading to a markedly asymmetric cyclic response of the material. This, in turn, results in an observed maximum stress as a function of the number of cycles. In addition, even though the average applied strains are relatively small, the local strains near the void surface increase …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Porous materials with evolving microstructure: constitutive modeling, numerical implementation and applications",
            "Publication year": 2008,
            "Publication url": "http://www.opengrey.eu/item/display/10068/821698",
            "Abstract": "Porous materials with evolving microstructure: constitutive modeling, numerical implentation and \napplications - OpenGrey fra | eng OpenGrey Open System for Information on Grey literature in \nEurope Home Search Subjects Partners Export Help Search XML To cite or link to this reference: \nhttp://hdl.handle.net/10068/821698 Title : Porous materials with evolving microstructure: \nconstitutive modeling, numerical implentation and applications Evolution de la microstructure \ndans les matériaux poreux: modélisation, implémentation numérique et applications Author : \nDANAS, Konstantinos ; Thesis advisor : PONTE CASTANEDA, Pedro ; University : École \npolytechnique, Palaiseau, Essonne ; Publication year : 2008 Language : French ; Pagination/Size \n: 1 vol.288 p., Bibliographie 153 réf. ; SIGLE classification : 20K - Solid-state physics ; \nKeyword(s) : Mechanics ; Mécanique ; Viscoplasticité ; Cavitation ; Plasticité ; Matériaux ; ; …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A homogenization-based constitutive model for isotropic viscoplastic porous media",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768308000656",
            "Abstract": "An approximate model based on the “second-order” nonlinear homogenization method is proposed to estimate the effective behavior of isotropic, viscoplastic, porous materials. The model is constructed in such a way that it reproduces exactly the behavior of a “composite-sphere assemblage” in the limit of hydrostatic loadings, and therefore coincides with the hydrostatic limit of Gurson’s criterion in the special case of ideal plasticity. As a consequence, the new model improves on earlier homogenization estimates, which have been found to be quite accurate for low triaxialities but overly stiff for sufficiently high triaxialities and nonlinearities. Additionally, the estimates delivered by the model exhibit a dependence on the third invariant of the macroscopic stress tensor, which has a nontrivial effect on the effective response of the material at moderate triaxialities. The proposed model is compared with exact results …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Bifurcation of magnetorheological film–substrate elastomers subjected to biaxial pre-compression and transverse magnetic fields",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020746220302705",
            "Abstract": "This work investigates the primary sinusoidal bifurcation wrinkling response of single- and multi-layered magnetorheological elastomer (MRE) film–substrate systems subjected to combined transverse applied magnetic fields and in-plane biaxial pre-compression. A recently proposed continuum model that includes the volume fraction of soft-magnetic particles is employed to analyze the effect of the magnetic properties upon the bifurcation response of the system. The analysis is built in a highly versatile manner using a finite-element discretization approach along the direction of the applied magnetic field and Fourier expansions along the infinite in-plane layer directions. This allows for a seamless investigation of various multi-layered structures. First, we analyze the effect of biaxial pre-compression upon the critical magnetic field for a film–substrate system and for various mechanical stiffness ratios. We observe a …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Model reduction techniques for quantitative nano-mechanical AFM mode",
            "Publication year": 2021,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6501/abf023/meta",
            "Abstract": "A recently developed atomic force microscope process, the PeakForce quantitative nanomechanical mapping (PF-QNM) mode, allows us to probe over a large spatial region surface topography together with a variety of mechanical properties (eg apparent modulus, adhesion, viscosity). The resulting large set of data often exhibits strong coupling between material response and surface topography. This letter proposes the use of a proper orthogonal decomposition (POD) technique to analyze and segment the force-indentation data obtained by the PF-QNM mode in a highly efficient and robust manner. Two examples illustrate the proposed methodology. In the first one, low-density polyethylene nanopods are deposited on a polystyrene film. The second is made of carbonyl iron particles embedded in a polydimethylsiloxane matrix. The proposed POD method permits us to seamlessly identify the underlying phase …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Magnetically triggered thin-film instabilities for surface pattern control",
            "Publication year": 2020,
            "Publication url": "https://meetings.aps.org/Meeting/MAR20/Session/B25.10",
            "Abstract": "The study under consideration is concerned with instabilities of a thin magnetic film attached to a soft (magnetic) substrate under general biaxial precompression and transverse magnetic fields leading to complex two-dimensional surface patterns. This study builds upon previous experimental work on one-dimensional surface patterns through magneto-elastic loading.Our findings contribute a key ingredient for the design of haptic displays and more general applications of surface actuation. For the characterization of the instabilities of interest we conduct numerical studies using finite-element and Fourier discretizations for a wide range of in-plane prestresses and applied magnetic field. By virtue of these results we obtain stability maps which are an important input for subsequent numerical and experimental studies in the post-buckling regime.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:u_35RYKgDlwC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "A general result for the magnetoelastic response of isotropic suspensions of iron and ferrofluid particles in rubber, with applications to spherical and cylindrical specimens",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509617302752",
            "Abstract": "This paper puts forth an approximate solution for the effective free-energy function describing the homogenized (or macroscopic) magnetoelastic response of magnetorheological elastomers comprised of non-Gaussian rubbers filled with isotropic suspensions of either iron or ferrofluid particles. The solution is general in that it applies to N= 2 and 3 space dimensions and any arbitrary (non-percolative) isotropic suspension of filler particles. By construction, it is exact in the limit of small deformations and moderate magnetic fields. For finite deformations and finite magnetic fields, its accuracy is demonstrated by means of direct comparisons with full-field simulations for two prominent cases:(i) isotropic suspensions of circular particles and (ii) isotropic suspensions of spherical particles. With the combined objectives of demonstrating the possible benefits of using ferrofluid particles in lieu of the more conventional iron …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Heterogeneous materials with evolving microstructure: constitutive modeling, numerical implementation and applications.",
            "Publication year": 2008,
            "Publication url": "https://pastel.archives-ouvertes.fr/pastel-00004107/",
            "Abstract": "Le travail de thµese porte sur l'application de la methode non-lineaire d' homogeneisation dite du second- ordre de Ponte Casta~neda (2002) pour estimer le comportement effectif des materiaux poreux viscoplastique. A titre de rappel, cette methode est basee sur la construction des principes variationnels appropries en utilisant un composite lineaire de comparaison pour produire des evaluations correspondantes µa des milieux poreux non-lineaires. Ainsi, l'objectif principal de ce travail est de proposer un modµele constitutif general qui tient compte de l' evolution de la microstructure, et par consequent, de l'anisotropie induite par l'application de deformations nies au materiau poreux. Le modele est construit pour reproduire exactement le comportement d'un assemblage de sphere composites dans la limite des chargements hydrostatiques, et concide donc avec la limite hydrostatique du critere de Gurson (1977) pour des materiaux poreux plastiques avec des microstructures isotropes. En consequence, ce nouveau modµele ameliore les estimations d'homogeneisation existantes, lesquelles sont satisfaisantes pour de faibles triaxialites mais excessivement raides pour des triaxialites et des non-linearites elevees. En outre, les estimations obtenues par le modµele dependent de la troisieme invariable du tenseur macroscopique des contraintes, lequel porte un effet non negligeable sur la reponse eective du materiau pour de moyennes et hautes triaxialites. De plus, les resultats cites ci-dessus ont ete generalises µa des microstructures anisotropes complexes (par exemple : des microstructures avec des formes et des orientations arbitraires des …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A homogenization based yield criterion for a porous Tresca material with ellipsoidal voids",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10704-015-0071-9",
            "Abstract": "This paper presents a rate-independent analytical model for porous Tresca (-dependent) materials containing general ellipsoidal voids. The model is based on the nonlinear variational homogenization method which uses a linear comparison material to estimate the response of the nonlinear porous solid and is denoted as “MVAR”. Specifically, the model is derived by an original approach starting from a novel porous single crystal model (Mbiakop et al. in Int J Solids Struct 64–65:100–119, 2015b, J Mech Phys Solids 84:436–467, 2015c) by considering the limiting case of infinite slip systems which leads readily to the corresponding Tresca criterion. The MVAR yield surface is then validated using FEM on different unit-cells and various parameters including several porosity levels, several stress triaxiality ratios, different Lode angle and general void shapes and orientations. The MVAR model is found to be in …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "A methodology for the estimation of the effective yield function of isotropic composites",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768316000846",
            "Abstract": "In this work we derive a general model for N− phase isotropic, incompressible, rate-independent elasto-plastic materials at finite strains. The model is based on the nonlinear homogenization variational (or modified secant) method which makes use of a linear comparison composite (LCC) material to estimate the effective flow stress of the nonlinear composite material. The homogenization approach leads to an optimization problem which needs to be solved numerically for the general case of a N− phase composite. In the special case of a two-phase composite an analytical result is obtained for the effective flow stress of the elasto-plastic composite material. Next, the model is validated by periodic three-dimensional unit cell calculations comprising a large number of spherical inclusions (of various sizes and of two different types) distributed randomly in a matrix phase. We find that the use of the lower Hashin …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An analytical model for porous single crystals with ellipsoidal voids",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002250961530017X",
            "Abstract": "A rate-(in)dependent constitutive model for porous single crystals with arbitrary crystal anisotropy (e.g., FCC, BCC, HCP, etc.) containing general ellipsoidal voids is developed. The proposed model, denoted as modified variational model (MVAR), is based on the nonlinear variational homogenization method, which makes use of a linear comparison porous material to estimate the response of the nonlinear porous single crystal. Periodic multi-void finite element simulations are used in order to validate the MVAR for a large number of parameters including cubic (FCC, BCC) and hexagonal (HCP) crystal anisotropy, various creep exponents (i.e., nonlinearity), several stress triaxiality ratios, general void shapes and orientations and various porosity levels. The MVAR model, which involves a priori no calibration parameters, is found to be in good agreement with the finite element results for all cases considered in the …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:4DMP91E08xMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Comment on\" Influence of the Lode parameter and the stress triaxiality on the failure of elasto-plastic porous materials\" by K. Danas and P. Ponte Castaneda Response",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=6800313686710729694&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:5nxA0vEk-isC",
            "Publisher": "PERGAMON-ELSEVIER SCIENCE LTD"
        },
        {
            "Title": "Numerically-aided 3D printed random isotropic porous materials approaching the Hashin-Shtrikman bounds",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359836818310710",
            "Abstract": "The present study introduces a methodology that allows to combine 3D printing, experimental testing, numerical and analytical modeling to create random closed-cell porous materials with statistically controlled and isotropic overall elastic properties that are extremely close to the relevant Hashin-Shtrikman bounds. In this first study, we focus our experimental and 3D printing efforts to isotropic random microstructures consisting of single-sized (i.e. monodisperse) spherical voids embedded in a homogeneous solid matrix. The 3D printed specimens are realized by use of the random sequential adsorption method. A detailed FE numerical study allows to define a cubic representative volume element (RVE) by combined periodic and kinematically uniform (i.e. average strain or affine) boundary conditions. The resulting cubic RVE is subsequently assembled to form a standard dog-bone uniaxial tension specimen, which …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:hMod-77fHWUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Programmable higher-order Euler buckling modes in hierarchical beams",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768319301246",
            "Abstract": "We present a numerical-aided experimental study on the buckling of hierarchical beams comprising multiple self-similar modules. Each module consists of multiple elemental beams and is arranged in series to form the hierarchical beam. We show, through a combination of experiments and computations, that these beams exhibit stable and realizable higher-order buckling modes. By contrast to the canonical Euler buckling problem, such modes emerge naturally in the proposed self-similar beams since they correspond to almost identical critical loads. By harnessing the imperfection sensitivity of the hierarchical structures, we 3D-print weakly imperfect polymer samples with a small geometric imperfection corresponding to the desired eigenmode. We subsequently carry out uniaxial compression experiments and show in practice that higher-order patterns can be triggered selectively upon buckling. Moreover, these …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:70eg2SAEIzsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Compliant interfaces: A mechanism for relaxation of dislocation pile-ups in a sheared single crystal",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0749641910000501",
            "Abstract": "Discrete dislocation plasticity models and strain-gradient plasticity theories are used to investigate the role of interfaces in the elastic–plastic response of a sheared single crystal. The upper and lower faces of a single crystal are bonded to rigid adherends via interfaces of finite thickness. The sandwich system is subjected to simple shear, and the effect of thickness of crystal layer and of interfaces upon the overall response are explored. When the interface has a modulus less than that of the bulk material, both the predicted plastic size effect and the Bauschinger effect are considerably reduced. This is due to the relaxation of the dislocation stress field by the relatively compliant surface layer. On the other hand, when the interface has a modulus equal to that of the bulk material a strong size effect in hardening as well as a significant reverse plasticity are observed in small specimens. These effects are attributed to the …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:qjMakFHDy7sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Deformation mechanisms of idealised cermets under multi-axial loading",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509616308146",
            "Abstract": "The response of idealised cermets comprising approximately 60% by volume steel spheres in a Sn/Pb solder matrix is investigated under a range of axisymmetric compressive stress states. Digital volume correlation (DVC) anal`ysis of X-ray micro-computed tomography scans (μ-CT), and the measured macroscopic stress-strain curves of the specimens revealed two deformation mechanisms. At low triaxialities the deformation is granular in nature, with dilation occurring within shear bands. Under higher imposed hydrostatic pressures, the deformation mechanism transitions to a more homogeneous incompressible mode. However, DVC analyses revealed that under all triaxialities there are regions with local dilatory and compaction responses, with the magnitude of dilation and the number of zones wherein dilation occurs decreasing with increasing triaxiality. Two numerical models are presented in order to clarify …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A variational principle for numerical homogenization of periodic magnetoelastic composites",
            "Publication year": 2015,
            "Publication url": "http://documents.irevues.inist.fr/handle/2042/57826",
            "Abstract": "In this study, we propose an augmented variational principle that is able to simulate the magnetoelastic response of magnetorheological elastomers (MREs). These materials are ferromagnetic particle impregnated rubbers whose mechanical properties are altered by the application of external magnetic fields. In addition, these composite materials can deform at very large strains due to the presence of the soft polymeric matrix.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:QIV2ME_5wuYC",
            "Publisher": "AFM, Association Française de Mécanique"
        },
        {
            "Title": "Numerical modeling of elasto-plastic porous materials with void shape effects at finite deformations",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359836812000029",
            "Abstract": "A new constitutive model for elasto-plastic (rate-independent) porous materials subjected to general three-dimensional finite deformations is presented. The new model results from simple modifications of an earlier model of Kailasam and Ponte Castañeda (1997, 1998) [40], [41] so that it reproduces the exact spherical and cylindrical shell solution (composite sphere and composite cylinder assemblage) under purely hydrostatic loadings, while predicting (by calibration) accurately the void shape evolution according to the recent “second-order” model of Danas and Ponte Castañeda [17]. Furthermore, the present model is based on a rigorous homogenization method which is capable of predicting both the constitutive behavior and the microstructure evolution of porous materials. The microstructure is described by voids of arbitrary ellipsoidal shapes and orientations and as a result the material exhibits deformation …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wrinkling to crinkling transitions and curvature localization in a magnetoelastic film bonded to a non-magnetic substrate",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509619306179",
            "Abstract": "This work studies experimentally and numerically the post-bifurcation response of a magnetorheological elastomer (MRE) film bonded to a soft non-magnetic (passive) substrate. The film-substrate system is subjected to a combination of an axial mechanical pre-compression and a transverse magnetic field. The non-trivial interaction of the two fields leads to a decrease of the critical magnetic field with applied pre-compression, while the observed wrinkling patterns evolve into crinkles, a bifurcation mode that is defined by the accompanied curvature localization and strong shearing of the side faces of the wrinkled geometry. Using a magneto-elastic variational formulation in a two-dimensional finite element numerical setting, we find that the crinkling is an intrinsic feature of magnetoelasticity and its presence is directly associated with the repulsive magnetic forces of the neighboring wrinkled-crinkled faces. As a result …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:ldfaerwXgEUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Cyclic behavior of elasto-plastic porous materials subjected to triaxial loading conditions",
            "Publication year": 2013,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01717094/",
            "Abstract": "This work proposes an analysis of the effect of cyclic loading of elasto-plastic porous materials upon the microstructure evolution and possible failure of the material due to low cycle fatigue. In order to investigate this effect, periodic FEM unit-cell calculations are carried out subjected to various stress triaxialities and Lode angles. The present results indicate that the absolute value of the stress triaxiality as well as of the value of the Lode angle are critical for the microstructure evolution and the subsequent material response. In addition, even though the macroscopic applied strains are relatively small, i.e., in the order of a few per cent, the local strains obtained near the pore surface can increase significantly (even more than 100%) due to significant localization of the deformation. This in turn leads to a critical evolution of the pore shape and as a consequence to porosity evolution.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Random distribution of polydisperse ellipsoidal inclusions and homogenization estimates for porous elastic materials",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045794918304565",
            "Abstract": "This work proposes an extension of the well-known random sequential adsorption (RSA) method in the context of non-overlapping random mono- and polydisperse ellipsoidal inclusions. The algorithm is general and can deal with inclusions of different size, shape and orientation with or without periodic geometrical constraints. Specifically, polydisperse inclusions, which can be in terms of different size, shape, orientation or even material properties, allow for larger volume fractions without the need of additional changes in the main algorithm. Unit-cell computations are performed by using either the fast Fourier transformed-based numerical scheme (FFT) or the finite element method (FEM) to estimate the effective elastic properties of voided particulate microstructures. We observe that an isotropic overall response is very difficult to obtain for random distributions of spheroidal inclusions with high aspect ratio. In …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:BqipwSGYUEgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Failure of elasto-plastic porous materials subjected to triaxial loading conditions",
            "Publication year": 2011,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00592693/",
            "Abstract": "This work makes use of the recently proposed second-order nonlinear homogenization model (SOM) for (visco) plastic porous materials [1] to study the influence of the Lode parameter and the stress triaxiality on the failure of metallic materials. This model is based on the\" second-order\" or\" generalized secant\" homogenization method [2] and is capable of handling general\" ellipsoidal\" microstructures (ie, particulate microstructures with more general orthotropic overall anisotropy) and general three-dimensional loading conditions. See http://hal. archives-ouvertes. fr/docs/00/59/26/93/ANNEX/r_A1B5O25U. pdf",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental homogenized elastic properties of computer-generated 3D-printed random porous material",
            "Publication year": 2018,
            "Publication url": "https://archivesic.ccsd.cnrs.fr/X-LMS/hal-01917374v1",
            "Abstract": "The present study introduces a methodology that allows for the combination of 3D-printing, experimental testing, numerical and analytical analysis of random porous materials with controlled homogenized elastic properties. These microstructures are computer-generated based on a random sequential addition algorithm with statistically controlled morphological properties such as volume fraction, shape and size of voids as well as isotropic distribution of their centers. We first focus on porous material containing single-size (monodisperse) spherical voids. The porous specimens are fabricated by 3D printing with polymer jet technology and then microstructures are aposteriori investigated by optical microscopy and SEM. The influence of the 3D printing process parameters is also experimentally assessed. An experimental protocol is developed in order to obtain the effective elastic properties of the porous specimens.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolution de la microstructure dans les matériaux poreux: modélisation, implémentation numérique et applications",
            "Publication year": 2008,
            "Publication url": "https://www.theses.fr/2008EPXX0003",
            "Abstract": "Le travail de thèse porte sur l'application de la méthode non-linéaire d'homogénéisation dite du «second-Ordre» de Ponte Castaneda (2002) pour estimer le comportement effectif des matériaux poreux viscoplastique. A titre de rappel, cette méthode est basée sur la construction des principes variationnels appropriés en utilisant un composite linéaire de comparaison pour produire des évaluations correspondantes µa des milieux poreux non-linéaires. Ainsi, l'objectif principal de ce travail est de proposer un modèle constitutif général qui tient compte de l'évolution de la microstructure, et par conséquent, de l'anisotropie induite par l'application de déformations finies au matériau poreux. Le modèle est construit pour reproduire exactement le comportement d'un assemblage de sphère composites\" dans la limite des chargements hydrostatiques, et coïncide donc avec la limite hydrostatique du critère de Gurson (1977) pour des matériaux poreux plastiques avec des microstructures isotropes. En conséquence, ce nouveau modèle améliore les estimations d'homogénéisation existantes, lesquelles sont satisfaisantes pour de faibles triaxialités mais excessivement raides pour des triaxialités et des non-linéarités élevées. En outre, les estimations obtenues par le modèle dépendent de la troisième invariable du tenseur macroscopique des contraintes, lequel porte un effet non négligeable sur la réponse effective du matériau pour de moyennes et hautes triaxialités. De plus, les résultats cités ci-dessus ont été généralisés à des microstructures anisotropes complexes (par exemple: des microstructures avec des formes et des orientations arbitraires des …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The nonlinear elastic response of suspensions of rigid inclusions in rubber: II—a simple explicit approximation for finite-concentration suspensions",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509612001925",
            "Abstract": "In Part I, an exact solution was determined for the problem of the overall nonlinear elastic response of Gaussian (or Neo-Hookean) rubber reinforced by a dilute isotropic distribution of rigid particles. Here, this fundamental result is utilized to construct an approximate solution for non-Gaussian rubber reinforced by an isotropic distribution of rigid particles at finite concentration. This is accomplished by means of two different techniques in two successive steps. First, the dilute solution is utilized together with a differential scheme in finite elasticity to generate a solution for Neo-Hookean rubber filled with an isotropic distribution of rigid particles of polydisperse sizes and finite concentration. This non-dilute result is then employed within the context of a new comparison medium method—derived as an extension of Talbot-Willis (1985) variational framework to the non-convex realm of finite elasticity—to generate in turn a …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:Se3iqnhoufwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A model for porous single crystals with cylindrical voids of elliptical cross-section",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768315001328",
            "Abstract": "This work presents a rate-dependent constitutive model for porous single crystals with arbitrary number of slip systems and orientations. The single crystal comprises cylindrical voids with elliptical cross-section at arbitrary orientations and is subjected to general plane-strain loadings. The proposed model, called modified variational model (MVAR), is based on the nonlinear variational homogenization method, which makes use of a linear comparison porous single crystal material to estimate the response of the nonlinear porous single crystal. The MVAR model is validated by periodic finite element simulations for a large number of parameters including general in-plane crystal anisotropy, general in-plane void shapes and orientations, various creep exponents (i.e., nonlinearity) and general plane strain loading conditions. The MVAR model, which at the present state involves no calibration parameters, is found to be …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Instability of MRE film–substrate block under magneto-mechanical loadings",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01926476/document",
            "Abstract": "The present study pertains to the bifurcation modes of a MRE film bonded on a non–linear elastic and highly compliant substrate. The motivation derives from the increasing development of the magneto–sensitive elastomers and the magnetically trigered instabilities, possibly applicable in actively controlled haptic systems. The present study introduces a fully featured magneto–mechanical experiment that yields different film surface patterns, being activated by low magnetic fields and proper pre–straining of the bilayer system.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ferroelasticity in magnetorheological elastomers",
            "Publication year": 2021,
            "Publication url": "https://meetings.aps.org/Meeting/MAR21/Session/J03.2",
            "Abstract": "The combined progress in the fields of magneto-elastic theory, additive manufacturing of soft materials and constitutive modeling has recently increased attention on magneto-mechanics. Departing from the study of classical magnetorheological elastomers (MREs) as bulk material, researchers started to investigate composites featuring permanently magnetic particles (h-MREs) and the stability of magneto-elastic structures. Both directions reach for applications far beyond what can be achieved with mere bulk MREs. Our contribution is inspired by experimental observations and highlights a third avenue to potential applications that is based on the physics that emerge from microstructural multistability of very soft MREs: ferroelasticity. The presentation discusses the underlying processes at microscopic scales by means of analytical considerations and representative numerical simulations. Moreover, we provide a …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:f2IySw72cVMC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Experiments and Numerical Implementation of a Boundary Value Problem Involving a Magnetorheological Elastomer Layer Subjected to a Nonuniform Magnetic Field",
            "Publication year": 2021,
            "Publication url": "https://asmedigitalcollection.asme.org/appliedmechanics/article-abstract/88/7/071004/1104292",
            "Abstract": "This study investigates experimentally and numerically the response of a magnetorheological elastomer (MRE) layer placed atop an electromagnetic coil. The MRE layer is deflected upon application of a current in the coil, which creates highly nonuniform magnetic fields. Isotropic and transversely isotropic layers (i.e., containing chains of magnetic particles) are tested experimentally, and the isotropic layer exhibits the largest deflection. To enhance the energetic efficiency of the model device, an iron core is introduced inside the electromagnetic coil, thereby leading to an increase in the resulting magnetic field near the center of the MRE layer. In parallel, the boundary value problem —including the MRE layer, the coil, the core (if present) and the surrounding air—is modeled numerically. For this, a magneto-mechanical, vector potential-based variational formulation is implemented in a standard three …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:D03iK_w7-QYC",
            "Publisher": "American Society of Mechanical Engineers"
        },
        {
            "Title": "A homogenization-based constitutive model for two-dimensional viscoplastic porous media",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1631072107001994",
            "Abstract": "An approximate model based on the so-called ‘second-order’ nonlinear homogenization method is proposed to estimate the effective behavior of viscoplastic porous materials exhibiting transversely isotropic symmetry. The model is constructed in such a way that it reproduces exactly the behavior of a ‘composite-cylinder assemblage’ in the limit of in-plane hydrostatic loading, and therefore coincides with the hydrostatic limit of Gurson's criterion for plastic porous materials. As a consequence, the new model improves on earlier ‘second-order’ homogenization estimates, which have been found to be overly stiff at sufficiently high triaxialities and nonlinearities. The proposed model is compared with exact results obtained for a special class of porous materials with sequentially laminated microstructures. The agreement is found to be excellent for the entire range of stress triaxialities, and all values of the porosity and …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:9yKSN-GCB0IC",
            "Publisher": "No longer published by Elsevier"
        },
        {
            "Title": "Second-order theory for nonlinear composites and application to isotropic constituents",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1631072106001070",
            "Abstract": "New prescriptions are proposed for the ‘reference’ fields in the context of the ‘second-order’ nonlinear homogenization method [P. Ponte Castañeda, Second-order homogenization estimates for nonlinear composites incorporating field fluctuations: I—Theory, J. Mech. Phys. Solids 50 (2002) 737–757], and are used to generate estimates for the effective behavior and first moments of the local fields in nonlinear composites. The new prescriptions yield simple, analytical expressions not only for the effective potentials, but also for the macroscopic stress-strain relation, as well as for the phase averages of the strain and stress fields. For illustrative purposes, ‘second-order’ estimates of the Hashin–Shtrikman type are provided for two-phase, transversely-isotropic composites with power-law phases, and are compared with exact results available for power-law, multiple-rank, sequential laminates. The agreement is found to …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:2osOgNQ5qMEC",
            "Publisher": "No longer published by Elsevier"
        },
        {
            "Title": "A model for ductile damage prediction at low stress triaxialities incorporating void shape change and void rotation",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768315001080",
            "Abstract": "Ductile fracture at the high triaxiality regime is well-known to be controlled by void nucleation, growth and coalescence. However, under low stress triaxiality conditions and general three dimensional finite deformations, damage is still poorly predicted due to the complex loading state and microstructural changes under such a condition. Experimental results have revealed not only void growth, but also important void shape change and void rotation under shear-dominated loading. The ability of ductile damage models to predict both void growth with shape change and void rotation is thus crucial for complex loading applications. In the present study, a Gurson-like nonlinear homogenization-based model (namely GVAR) is proposed and compared with the constitutive models for elasto-plastic porous materials developed in Kailasam and Ponte Castañeda (1998) (VAR model) and Danas and Aravas (2012) (MVAR …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:_kc_bZDykSQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Response to the comments by Hucthinson and Tvergaard",
            "Publication year": 2012,
            "Publication url": "https://www.kostasdanas.com/kdanas_files/ArDPCIJSS2012response.pdf",
            "Abstract": "Kostas Danas a,*, Pedro Ponte Castañeda b, c a Laboratoire de Mécanique des Solides, CNRS UMR7649, Ecole Polytechnique, 91128 Palaiseau Cedex, France b Department of Mechanical Engineering and Applied Mechanics, University of Pennsylvania, Philadelphia, PA 19104-6315, USA c IMDEA Materials Institute, 28040 Madrid, SpainWe agree with the criticism raised by Professors Hutchinson and Tvergaard in their comment of our recent article (Danas and Ponte Castañeda, 2012). Indeed, our model, which is based on the use of an approximate homogenization technique, can only generate estimates for the evolution of the ‘‘average’’shape of the pores, as determined by the aspect ratio of a ‘‘representative’’ellipsoidal void evolving with the average strain-rate in the vacuous phase (as predicted by the homogenization technique). On the other hand, the FEM unit-cell calculations presented by Hutchinson …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:roLk4NBRz8UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A homogenization model of the Voigt type for skeletal muscle",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022519316303836",
            "Abstract": "A three-dimensional constitutive model for skeletal muscle incorporating microstructural characteristics is developed and numerically implemented in a general purpose finite element program. The proposed model takes into account explicitly the volume fractions of muscle fibers and connective tissue by using the Voigt homogenization approach to bridge the different length scales of the muscle structure. The model is used to estimate the active and passive homogenized muscle response. Next, the model is validated by experimental data and periodic three-dimensional unit cell calculations comprising various fiber volume fractions and mechanical properties of the constituents. The model is found to be in very good agreement with both the experimental data and the finite element results for all the examined cases. The influence of fiber volume fraction and material properties of constituents on effective muscle …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:hC7cP41nSMkC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Size effects in the conical indentation of an elasto-plastic solid",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509612000981",
            "Abstract": "The size effect in conical indentation of an elasto-plastic solid is predicted via the Fleck and Willis formulation of strain gradient plasticity (Fleck, N.A. and Willis, J.R., 2009, A mathematical basis for strain gradient plasticity theory. Part II: tensorial plastic multiplier, J. Mech. Phys. Solids, 57, 1045–1057). The rate-dependent formulation is implemented numerically and the full-field indentation problem is analyzed via finite element calculations, for both ideally plastic behavior and dissipative hardening. The isotropic strain-gradient theory involves three material length scales, and the relative significance of these length scales upon the degree of size effect is assessed. Indentation maps are generated to summarize the sensitivity of indentation hardness to indent size, indenter geometry and material properties (such as yield strain and strain hardening index). The finite element model is also used to evaluate the …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Freedericksz instability for the twisted nematic device: A three-dimensional analysis",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.94.012704",
            "Abstract": "Of interest here is the fully three-dimensional analysis of the Freedericksz transition for the twisted nematic device (TND), which is widely used in liquid-crystal display monitors. Using a coupled electromechanical variational formulation, the problem is treated as a bifurcation instability triggered by an externally applied electric field. More specifically, we study a finite thickness liquid-crystal layer, anchored between two infinite parallel plates relatively rotated with respect to each other by a given twist angle and subjected to a uniform electric field perpendicular to these bounding plates. The novelty of the proposed analysis lies in the fully three-dimensional formulation of the TND problem that considers all possible bounded perturbations about the principal solution. By scanning a wide range of the liquid crystal's material parameter space, we establish whether the Freedericksz transition is global, ie, has an eigenmode …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:IWHjjKOFINEC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Instability of a magnetoelastic layer resting on a non-magnetic substrate",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509614000635",
            "Abstract": "Magnetorheological elastomers (MREs) are ferromagnetic particle impregnated rubbers whose mechanical properties are altered by the application of external magnetic fields. Due to their coupled magneto-mechanical response, MREs are finding an increasing number of engineering applications. One such application is in haptics, where the goal is to actively control surface roughness. One way to achieve this is by exploiting the unstable regime of MRE substrate/layer assemblies subjected to transverse magnetic fields. In this work, we study the response of such an assembly subjected to a transverse magnetic field and in-plane stress. The layer is made up of a transversely isotropic MRE material, whose energy density has been obtained experimentally, while the substrate is a non-magnetic isotropic pure polymer/gel. An analytical solution to this problem based on a general, finite strain, 2D continuum modeling …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:8k81kl-MbHgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Enhanced local maximum-entropy approximation for stable meshfree simulations",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045782518305346",
            "Abstract": "We introduce an improved meshfree approximation scheme which is based on the local maximum-entropy strategy as a compromise between shape function locality and entropy in an information-theoretical sense. The improved version is specifically designed for severe, finite deformation and offers significantly enhanced stability as opposed to the original formulation. This is achieved by (i) formulating the quasistatic mechanical boundary value problem in a suitable updated-Lagrangian setting, (ii) introducing anisotropy in the shape function support to accommodate directional variations in nodal spacing with increasing deformation and eliminate tensile instability, (iii) spatially bounding and evolving shape function support to restrict the domain of influence and increase efficiency, (iv) truncating shape functions at interfaces in order to stably represent multi-component systems like composites or polycrystals. The …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:RGFaLdJalmkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Influence of the internal geometry on the elastic properties of materials using 3D printing of computer-generated random microstructures",
            "Publication year": 2018,
            "Publication url": "https://library.seg.org/doi/abs/10.1190/segam2018-2998182.1",
            "Abstract": "Understanding elastic properties of rocks is a scientific challenge due to the complexity of their microstructures. This study combines the numerical tools to generate models for internal geometry of pores with the 3D printing technology in order to control the shape and size of pores as well as the distribution of pore’s network inside the sample. Accuracy of the printing has been assessed by optical microscopy. The numerical and experimental tests conducted on generated microstructures show that the elastic properties are independent of the size of the pore. In turn, the shape of the pore has a strong effect on the elastic properties. This study shows that in case of multiple pore types, the ones with small aspect ratios have a strong impact though of minor volume fraction. The methodology that is developped can be extended to investigate the influence of more parameters in case of connected porosity and tests …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Society of Exploration Geophysicists"
        },
        {
            "Title": "A finite-strain model for anisotropic viscoplastic porous media: I–Theory",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753808001150",
            "Abstract": "In this work, we propose an approximate homogenization-based constitutive model for estimating the effective response and associated microstructure evolution in viscoplastic (including ideally-plastic) porous media subjected to finite-strain loading conditions. The proposed model is based on the “second-order” nonlinear homogenization method, and is constructed in such a way as to reproduce exactly the behavior of a “composite-sphere assemblage” in the limit of hydrostatic loading and isotropic microstructure. However, the model is designed to hold for completely general three-dimensional loading conditions, leading to deformation-induced anisotropy, whose development in time is handled through evolution laws for the internal variables characterizing the instantaneous “ellipsoidal” state of the microstructure. In Part II of this study, results will be given for the instantaneous response and microstructure …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "An evolving switching surface model for ferromagnetic hysteresis",
            "Publication year": 2019,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.5051483",
            "Abstract": "We propose a thermodynamically consistent rate-independent three-dimensional model of magnetic hysteresis in terms of energetic and dissipation potentials making use of a relatively small number of model parameters that is capable of being implemented in a general incremental numerical setting. The dissipation process occurring during magnetization/demagnetization is described by a power-law potential, which leads to rate-independence at a certain limit of the rate-dependent exponent. The incorporation of isotropic hardening in the model enables us to describe phenomenologically at the macroscopic scale both nucleation and pinning type constitutive responses. We further model the symmetric and asymmetric minor loops by employing the idea of a bounding surface, which was originally introduced in the context of mechanical plasticity. Our model shows a very good agreement with experiments for …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:vV6vV6tmYwMC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Corrigendum to “A methodology for the estimation of the effective yield function of isotropic composites”[Int. J. Solids Struct. 87 (2016) 120–138]",
            "Publication year": 2016,
            "Publication url": "http://kostasdanas.com/kdanas_files/ArPDAIJSS2016Cor.pdf",
            "Abstract": "Corrigendum to •A methodology for the estimation of the effective yield function of isotropic \ncompositesŽ [Int. J. Solids Str Page 1 International Journal of Solids and Structures 102–103 \n(2016) 321–322 Contents lists available at ScienceDirect International Journal of Solids and \nStructures journal homepage: www.elsevier.com/locate/ijsolstr Corrigendum Corrigendum to “A \nmethodology for the estimation of the effective yield function of isotropic composites” [Int. J. \nSolids Struct. 87 (2016) 120–138] I. Papadiotia,b, K. Danasc,∗, N. Aravasa,d a Department of \nMechanical Engineering, University of Thessaly, 38334 Volos, GREECE b Institute for Research \nand Technology Thessaly (I.RE.TE.TH.), Center for Research and Technology - Hellas, 38333 \nVolos, GREECE c Laboratoire de Mécanique des Solides, CNRS, École Polytechnique, \nUniversity of Paris-Saclay, Palaiseau, FRANCE d International Institute for Carbon (WPI-)i…",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:qUcmZB5y_30C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Numerical and experimental study on effective elastic properties of porous materials: controlled porosity numerically generated and 3D printed",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01899277/",
            "Abstract": "This work aims to introduce a methodology for the determination of the effective properties of random heterogeneous materials. Specifically,  focus of this study are  the effective properties of  two phase porous material containing  spherical voids which are investigated both experimentally and numerically. To this end, three-dimensional porous structures, with non-overlapping porosity, are first generated by means of a random sequential algorithm. Numerical simulations are conducted on a representative volume element, whose size is first determined. Specimens are fabricated by 3D-printing of the computer-generated microstructures and tested under uniaxial loading. Good agreement of Young modulus data is found, in the case of spherical monodisperse porosity.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Plane-strain discrete dislocation plasticity with climb-assisted glide motion of dislocations",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0965-0393/21/4/045008/meta",
            "Abstract": "A small-strain two-dimensional discrete dislocation plasticity (DDP) framework is developed wherein dislocation motion is caused by climb-assisted glide. The climb motion of the dislocations is assumed to be governed by a drag-type relation similar to the glide-only motion of dislocations: such a relation is valid when vacancy kinetics is either diffusion limited or sink limited. The DDP framework is employed to predict the effect of dislocation climb on the uniaxial tensile and pure bending response of single crystals. Under uniaxial tensile loading conditions, the ability of dislocations to bypass obstacles by climb results in a reduced dislocation density over a wide range of specimen sizes in the climb-assisted glide case compared to when dislocation motion is only by glide. A consequence is that, at least in a single slip situation, size effects due to dislocation starvation are reduced. By contrast, under pure bending …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:0EnyYjriUFMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Buckling response of architectured columns: controlling instability across the scales through a rational design.",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01627528/",
            "Abstract": "In the present study, we combine numerical simulations with compressive testing of 3D printed polymer structures to investigate the buck ling response of a slender column, whose architecture employs unit-cell lattices which in turn consist of a sequence of columns uniformly spaced. The lower-scale columns are both of comparable size with the macro-geometry and a priori susceptible to buckling. Within the accuracy of data, the experimental trends are consistent with the numerical simulations and show that both the buckling and the post-buckling response at the macroscopic (i.e. continuum) level are dependent on the lower-scale microstructure.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiments and modeling of iron-particle-filled magnetorheological elastomers",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509611001736",
            "Abstract": "Magnetorheological elastomers (MREs) are ferromagnetic particle impregnated rubbers whose mechanical properties are altered by the application of external magnetic fields. Due to their coupled magnetoelastic response, MREs are finding an increasing number of engineering applications. In this work, we present a combined experimental and theoretical study of the macroscopic response of a particular MRE consisting of a rubber matrix phase with spherical carbonyl iron particles. The MRE specimens used in this work are cured in the presence of strong magnetic fields leading to the formation of particle chain structures and thus to an overall transversely isotropic composite. The MRE samples are tested experimentally under uniaxial stresses as well as under simple shear in the absence or in the presence of magnetic fields and for different initial orientations of their particle chains with respect to the mechanical …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Void shape effects and porosity ratcheting of elasto-plastic materials subjected to cyclic loading",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=14502937227708315537&hl=en&oi=scholarr",
            "Abstract": "It is a well known fact that pressure plays an important role in both high and low cycle fatigue regime [1, 2, 3]. A large amount of experimental data has shown that hydrostatic stress has a strong influence of the lifetime as a function of the loading conditions. Moreover at the microscopic level of the material one can observe an evolution of damage and defects. as the macroscopic hydrostatic stress component will induce an evolution of plasticity and of the microstructure in the presence of voids or inclusions. Although significant advances have been made in the last decades in ductile fracture under monotonic loading conditions (see for instance [4, 5]), a lot of questions remain open in the context of cyclic loading.",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effective response of classical, auxetic and chiral magnetoelastic materials by use of a new variational principle",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509616309140",
            "Abstract": "This work provides a rigorous analysis of the effective response, i.e., average magnetization and magnetostriction, of magnetoelastic composites that are subjected to overall magnetic and mechanical loads. It clarifies the differences between a coupled magnetomechanical analysis in which one applies a Eulerian (current) magnetic field and an electroactive one where the Lagrangian (reference) electric field is usually applied. For this, we propose an augmented vector potential variational formulation to carry out numerical periodic homogenization studies of magnetoelastic solids at finite strains and magnetic fields. We show that the developed variational principle can be used for bottom-up design of microstructures with desired magnetomechanical coupling by properly canceling out the macro-geometry and specimen shape effects. To achieve that, we properly treat the average Maxwell stresses arising from the …",
            "Abstract entirety": 0,
            "Author pub id": "0I7D4_AAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Magnetorheological Elastomers: Experiments and Modeling",
            "Publication year": 2011,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00592692/",
            "Abstract": "Magnetorheological elastomers (MREs) are ferromagnetic particle impregnated elastomers whose mechanical properties are altered by the application of external magnetic fields. Due to their magnetoelastic coupling response MREs are finding an increasing number of engineering applications. The objective of this work is:(a) the experimental study of transversely isotropic MREs (ie, the particles form chains along a certain direction) that are subjected to prestressing and arbitrary magnetic fields and (b), the phenomenological modeling of these materials using transversely isotropic energy functions. See http://hal. archives-ouvertes. fr/docs/00/59/26/92/ANNEX/r_NHEKI0N4. pdf",
            "Abstract entirety": 1,
            "Author pub id": "0I7D4_AAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        }
    ]
}]