[{
    "name": "Nicolas Vayatis",
    "romanize name": "Nicolas Vayatis",
    "School-Department": "\nMathematics Research Teaching ",
    "University": "ENS Cachan / CMLA",
    "Rank": "Καθηγητής",
    "Apella_id": 2897,
    "Scholar name": "Nicolas Vayatis",
    "Scholar id": "IsPkE1wAAAAJ",
    "Affiliation": "Professeur des universités, ENS Paris-Saclay",
    "Citedby": 3340,
    "Interests": [
        "machine learning"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=IsPkE1wAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On the importance of local dynamics in statokinesigram: A multivariate approach for postural control evaluation in elderly",
            "Publication year": 2018,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0192868",
            "Abstract": "The fact that almost one third of population >65 years-old has at least one fall per year, makes the risk-of-fall assessment through easy-to-use measurements an important issue in current clinical practice. A common way to evaluate posture is through the recording of the center-of-pressure (CoP) displacement (statokinesigram) with force platforms. Most of the previous studies, assuming homogeneous statokinesigrams in quiet standing, used global parameters in order to characterize the statokinesigrams. However the latter analysis provides little information about local characteristics of statokinesigrams. In this study, we propose a multidimensional scoring approach which locally characterizes statokinesigrams on small time-periods, or blocks, while highlighting those which are more indicative to the general individual’s class (faller/non-faller). Moreover, this information can be used to provide a global score in order to evaluate the postural control and classify fallers/non-fallers. We evaluate our approach using the statokinesigram of 126 community-dwelling elderly (78.5 ± 7.7 years). Participants were recorded with eyes open and eyes closed (25 seconds each acquisition) and information about previous falls was collected. The performance of our findings are assessed using the receiver operating characteristics (ROC) analysis and the area under the curve (AUC). The results show that global scores provided by splitting statokinesigrams in smaller blocks and analyzing them locally, classify fallers/non-fallers more effectively (AUC = 0.77 ± 0.09 instead of AUC = 0.63 ± 0.12 for global analysis when splitting is not used). These promising results …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:tzM49s52ZIMC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Anytime influence bounds and the explosive behavior of continuous-time diffusion networks",
            "Publication year": 2015,
            "Publication url": "http://papers.nips.cc/paper/5701-on-prior-distributions-and-approximate-inference-for-structured-variables.pdf",
            "Abstract": "The paper studies transition phenomena in information cascades observed along a diffusion process over some graph. We introduce the Laplace Hazard matrix and show that its spectral radius fully characterizes the dynamics of the contagion both in terms of influence and of explosion time. Using this concept, we prove tight non-asymptotic bounds for the influence of a set of nodes, and we also provide an in-depth analysis of the critical time after which the contagion becomes super-critical. Our contributions include formal definitions and tight lower bounds of critical explosion time. We illustrate the relevance of our theoretical results through several examples of information cascades used in epidemiology and viral marketing models. Finally, we provide a series of numerical experiments for various types of networks which confirm the tightness of the theoretical bounds.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of simultaneously sparse and low rank matrices",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1206.6474",
            "Abstract": "The paper introduces a penalized matrix estimation procedure aiming at solutions which are sparse and low-rank at the same time. Such structures arise in the context of social networks or protein interactions where underlying graphs have adjacency matrices which are block-diagonal in the appropriate basis. We introduce a convex mixed penalty which involves -norm and trace norm simultaneously. We obtain an oracle inequality which indicates how the two effects interact according to the nature of the target matrix. We bound generalization error in the link prediction problem. We also develop proximal descent strategies to solve the optimization problem efficiently and evaluate performance on synthetic and real data sets.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sequential dynamic resource allocation for epidemic control",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9029678/",
            "Abstract": "Under the Dynamic Resource Allocation (DRA) model, an administrator has the mission to allocate dynamically a limited budget of resources to the nodes of a network in order to reduce a diffusion process (DP) (e.g. an epidemic). The standard DRA assumes that the administrator has constantly full information and instantaneous access to the entire network. Towards bringing such strategies closer to real-life constraints, we first present the Restricted DRA model extension where, at each intervention round, the access is restricted to only a fraction of the network nodes, called sample. Then, inspired by sequential selection problems such as the well-known Secretary Problem, we propose the Sequential DRA (SDRA) model. Our model introduces a sequential aspect in the decision process over the sample of each round, offering a completely new perspective to the dynamic DP control. Finally, we incorporate several …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Multi-Round Sequential Selection Problem",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Argyris-Kalogeratos/publication/327763676_The_Warm-starting_Sequential_Selection_Problem_and_its_Multi-round_Extension/links/5c17bed392851c39ebf3f77b/The-Warm-starting-Sequential-Selection-Problem-and-its-Multi-round-Extension.pdf",
            "Abstract": "In the Sequential Selection Problem (SSP), immediate and irrevocable decisions need to be made while candidates from a finite set are being examined one-by-one. The goal is to assign a limited number of b available jobs to the best possible candidates. Standard SSP variants begin with an empty selection set (cold-starting) and perform the selection process once (single-round), over a single candidate set. In this paper we introduce the Multi-round Sequential Selection Problem (MSSP) which launches a new round of sequential selection each time a new set of candidates becomes available. Each new round has at hand the output of the previous one, ie its b selected employees, and tries to update optimally that selection by reassigning each job at most once. Our setting allows changes to take place between two subsequent selection rounds: resignations of previously selected subjects or/and alterations of the quality score across the population. The challenge for a selection strategy is thus to efficiently adapt to such changes. For this novel problem we adopt a cutoff-based approach, where a precise number of candidates should be rejected first before starting to select. We set a rank-based objective of the process over the final job-to-employee assignment and we investigate analytically the optimal cutoff values with respect to the important parameters of the problem. Finally, we present experimental results that compare the efficiency of different selection strategies, as well as their convergence rates towards the optimal solution in the case of stationary score distributions.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:0izLItjtcgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ranking forests",
            "Publication year": 2013,
            "Publication url": "https://www.jmlr.org/papers/volume14/clemencon13a/clemencon13a.pdf",
            "Abstract": "The present paper examines how the aggregation and feature randomization principles underlying the algorithm RANDOM FOREST (Breiman, 2001) can be adapted to bipartite ranking. The approach taken here is based on nonparametric scoring and ROC curve optimization in the sense of the AUC criterion. In this problem, aggregation is used to increase the performance of scoring rules produced by ranking trees, as those developed in Clémençon and Vayatis (2009c). The present work describes the principles for building median scoring rules based on concepts from rank aggregation. Consistency results are derived for these aggregated scoring rules and an algorithm called RANK-ING FOREST is presented. Furthermore, various strategies for feature randomization are explored through a series of numerical experiments on artificial data sets.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning laplacian matrix from graph signals with sparse spectral representation",
            "Publication year": 2021,
            "Publication url": "https://www.jmlr.org/papers/volume22/19-944/19-944.pdf",
            "Abstract": "In this paper, we consider the problem of learning a graph structure from multivariate signals, known as graph signals. Such signals are multivariate observations carrying measurements corresponding to the nodes of an unknown graph, which we desire to infer. They are assumed to enjoy a sparse representation in the graph spectral domain, a feature which is known to carry information related to the cluster structure of a graph. The signals are also assumed to behave smoothly with respect to the underlying graph structure. For the graph learning problem, we propose a new optimization program to learn the Laplacian of this graph and provide two algorithms to solve it, called IGL-3SR and FGL-3SR. Based on a 3-step alternating procedure, both algorithms rely on standard minimization methods–such as manifold gradient descent or linear programming–and have lower complexity compared to state-of-the-art algorithms. While IGL-3SR ensures convergence, FGL-3SR acts as a relaxation and is significantly faster since its alternating process relies on multiple closed-form solutions. Both algorithms are evaluated on synthetic and real data. They are shown to perform as good or better than their competitors in terms of both numerical performance and scalability. Finally, we present a probabilistic interpretation of the proposed optimization program as a Factor Analysis Model.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Évaluation de l’équilibre et prédiction des risques de chutes en utilisant une Wii board balance",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Laurent-Oudre/publication/284811069_Evaluation_de_l'equilibre_et_prediction_des_risques_de_chutes_en_utilisant_une_Wii_board_balance/links/5e614998299bf182deed5092/Evaluation-de-lequilibre-et-prediction-des-risques-de-chutes-en-utilisant-une-Wii-board-balance.pdf",
            "Abstract": "Résultats L’aire sous la courbe de spécificité représentant le score d’équilibre en fonction des chutes réelles des patients est supérieure à 0, 75, soit un résultat très significatif. Discussion—conclusion Les signaux de la Wii Board balance peuvent être traités et analysés de manière à aider à la détection de troubles de l’équilibre pouvant conduire à des chutes.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:_B80troHkn4C",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Online non-parametric change-point detection for heterogeneous data streams observed over graph nodes",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.10518",
            "Abstract": "Consider a heterogeneous data stream being generated by the nodes of a graph. The data stream is in essence composed by multiple streams, possibly of different nature that depends on each node. At a given moment , a change-point occurs for a subset of nodes , signifying the change in the probability distribution of their associated streams. In this paper we propose an online non-parametric method to infer  based on the direct estimation of the likelihood-ratio between the post-change and the pre-change distribution associated with the data stream of each node. We propose a kernel-based method, under the hypothesis that connected nodes of the graph are expected to have similar likelihood-ratio estimates when there is no change-point. We demonstrate the quality of our method on synthetic experiments and real-world applications.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Complexity versus agreement for many views",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04414-4_21",
            "Abstract": "The paper considers the problem of semi-supervised multi-view classification, where each view corresponds to a Reproducing Kernel Hilbert Space. An algorithm based on co-regularization methods with extra penalty terms reflecting smoothness and general agreement properties is proposed. We first provide explicit tight control on the Rademacher (L 1) complexity of the corresponding class of learners for arbitrary many views, then give the asymptotic behavior of the bounds when the co-regularization term increases, making explicit the relation between consistency of the views and reduction of the search space. Since many views involve many parameters, we third provide a parameter selection procedure, based on the stability approach with clustering and localization arguments. To this aim, we give an explicit bound on the variance (L 2-diameter) of the class of functions. Finally we …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Generalization error bounds for aggregation by mirror descent with averaging",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/39907188/Generalization_Error_Bounds_for_Aggregat20151111-24395-1pyryux.pdf",
            "Abstract": "We consider the problem of constructing an aggregated estimator from a finite class of base functions which approximately minimizes a convex risk functional under the ℓ1 constraint. For this purpose, we propose a stochastic procedure, the mirror descent, which performs gradient descent in the dual space. The generated estimates are additionally averaged in a recursive fashion with specific weights. Mirror descent algorithms have been developed in different contexts and they are known to be particularly efficient in high dimensional problems. Moreover their implementation is adapted to the online setting. The main result of the paper is the upper bound on the convergence rate for the generalization error.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exact rates in Vapnik–Chervonenkis bounds",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0246020302000109",
            "Abstract": "Vapnik–Chervonenkis bounds on rates of uniform convergence of empirical means to their expectations have been continuously improved over the years since the precursory work in [26]. The result obtained by Talagrand in 1994 [21] seems to provide the final word as far as universal bounds are concerned. However, in the case where there are some additional assumptions on the underlying probability distribution, the exponential rate of convergence can be fairly improved. Alexander [1] and Massart [15] have found better exponential rates (similar to those in Bennett–Bernstein inequalities) under the assumption of a control on the variance of the empirical process. In this paper, the case of a particular distribution is considered for the empirical process indexed by a family of sets, and we provide the exact exponential rate based on large deviations theorems, as predicted by Azencott [2].",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:TFP_iSt0sucC",
            "Publisher": "No longer published by Elsevier"
        },
        {
            "Title": "Statistical Approaches in Learning Theory: boosting and ranking",
            "Publication year": 2006,
            "Publication url": "https://tel.archives-ouvertes.fr/tel-00120738/",
            "Abstract": "Statistical Learning Theory has been growing rapidly the last ten years. The introduction of efficient classification algorithms, such as boosting and Support Vector Machines, coping with high-dimensional data, generated new questions that Vapnik-Chervonenkis (VC) theory could not answer. The Empirical Risk Minimization principle does not account for practical learning algorithms and the VC dimension is not the appropriate concept to explain the generalization ability of such methods. In the first chapter, we recall the interpretations of boosting algorithms as implementations of convex risk minimization principles and we study their properties under this viewpoint. In particular, we show the importance of regularization in order to obtain consistent strategies. We also develop a new class of algorithms called the Mirror Averaging Algorithm and we evaluate their performance through simulation experiments. After presenting the fundamental ideas underlying boosting, we study, in the second chapter, more advanced issues such as oracle inequalities. Thus, we propose some fine calibration of the penalty function according to the cost function being used and present non-asymptotic results on the performance of penalized boosting estimators, with refinements such as fast rates of convergence under Mammen-Tsybakov margin conditions. We also describe the approximation properties of boosting using decision stumps. The third chapter explores the ranking problem. In applications such as information retrieval or credit scoring, ranking the instances can be much more significant than simply classifying them. We propose a simple formulation of this …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectral bounds in random graphs applied to spreading phenomena and percolation",
            "Publication year": 2018,
            "Publication url": "https://www.cambridge.org/core/journals/advances-in-applied-probability/article/spectral-bounds-in-random-graphs-applied-to-spreading-phenomena-and-percolation/C8A72B14C2B5081577783AE125D3BF60",
            "Abstract": "       In this paper we derive nonasymptotic upper bounds for the size of reachable sets in random graphs. These bounds are subject to a phase transition phenomenon triggered by the spectral radius of the hazard matrix, a reweighted version of the adjacency matrix. Such bounds are valid for a large class of random graphs, called local positive correlation (LPC) random graphs, displaying local positive correlation. In particular, in our main result we state that the size of reachable sets in the subcritical regime for LPC random graphs is at most of order O(√n), where n is the size of the network, and of order O(n2/3) in the critical regime, where the epidemic thresholds are driven by the size of the spectral radius of the hazard matrix with respect to 1. As a corollary, we also show that such bounds hold for the size of the giant component in inhomogeneous percolation, the SIR model in epidemiology, as well as for the long …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Tree-structured ranking rules and approximation of the optimal ROC curve",
            "Publication year": 2008,
            "Publication url": "https://hal.archives-ouvertes.fr/docs/00/27/05/46/PDF/TreeRCOLTv3.pdf",
            "Abstract": "We consider the extension of standard decision tree methods to the bipartite ranking problem. In ranking, the goal pursued is global: define an order on the whole input space in order to have positive instances on top with maximum probability. The most natural way of ordering all instances consists in projecting the input data x onto the real line using a real-valued scoring function s and the accuracy of the ordering induced by a candidate s is classically measured in terms of the AUC. In the paper, we discuss the design of tree-structured scoring functions obtained by maximizing the AUC criterion. In particular, the connection with recursive piecewise linear approximation of the optimal ROC curve both in the L1-sense and in the L∞-sense is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gaussian process optimization with mutual information",
            "Publication year": 2014,
            "Publication url": "http://proceedings.mlr.press/v32/contal14.html",
            "Abstract": "In this paper, we analyze a generic algorithm scheme for sequential global optimization using Gaussian processes. The upper bounds we derive on the cumulative regret for this generic algorithm improve by an exponential factor the previously known bounds for algorithms like GP-UCB. We also introduce the novel Gaussian Process Mutual Information algorithm (GP-MI), which significantly improves further these upper bounds for the cumulative regret. We confirm the efficiency of this algorithm on synthetic and real tasks against the natural competitor, GP-UCB, and also the Expected Improvement heuristic.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:ZHo1McVdvXMC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Optimal Multiple Stopping Rule for Warm-Starting Sequential Selection",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8995376/",
            "Abstract": "In this paper we present the Warm-starting Dynamic Thresholding algorithm, developed using dynamic programming, for a variant of the standard online selection problem. The problem allows job positions to be either free or already occupied at the beginning of the process. Throughout the selection process, the decision maker interviews one after the other the new candidates and reveals a quality score for each of them. Based on that information, she can (re) assign each job at most once by taking immediate and irrevocable decisions. We relax the hard requirement of the class of dynamic programming algorithms to perfectly know the distribution from which the scores of candidates are drawn, by presenting extensions for the partial and no-information cases, in which the decision maker can learn the underlying score distribution sequentially while interviewing candidates.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On bootstrapping the ROC curve",
            "Publication year": 2009,
            "Publication url": "https://hal.telecom-paris.fr/hal-02107183",
            "Abstract": "This paper is devoted to thoroughly investigating how to bootstrap the ROC curve, a widely used visual tool for evaluating the accuracy of test/scoring statistics in the bipartite setup. The issue of confidence bands for the ROC curve is considered and a resampling procedure based on a smooth version of the empirical distribution called the \"smoothed bootstrap\" is introduced. Theoretical arguments and simulation results are presented to show that the \"smoothed bootstrap\" is preferable to a \"naive\" bootstrap in order to construct accurate confidence bands.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed Convolutional Sparse Coding",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Thomas-Moreau-4/publication/317229988_DICOD_Distributed_Convolutional_Coordinate_Descent_for_Convolutional_Sparse_Coding/links/5952178f458515a207f7a79b/DICOD-Distributed-Convolutional-Coordinate-Descent-for-Convolutional-Sparse-Coding.pdf",
            "Abstract": "We consider the problem of building shift-invariant representations for long signals in the context of distributed processing. We propose an asynchronous algorithm based on coordinate descent called DICOD to efficiently solve the l1-minimization problems involved in convolutional sparse coding. This algorithm leverages the weak temporal dependency of the convolution to reduce the interprocess communication to a few local messages. We prove that this algorithm converges to the optimal solution and that it scales with superlinear speedup, up to a certain limit. These properties are illustrated with numerical experiments and our algorithm is compared to the state-of-the-art methods used for convolutional sparse coding.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:e_rmSamDkqQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overlaying classifiers: a practical approach to optimal scoring",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00365-010-9084-9.pdf",
            "Abstract": "The Receiver Operating Characteristic (ROC) curve is one of the most widely used visual tools to evaluate performance of scoring functions regarding their capacities to discriminate between two populations. It is the goal of this paper to propose a statistical learning method for constructing a scoring function with nearly optimal ROC curve. In this bipartite setup, the target is known to be the regression function up to an increasing transform, and solving the optimization problem boils down to recovering the collection of level sets of the latter, which we interpret here as a continuum of imbricated classification problems. We propose a discretization approach, consisting of building a finite sequence of N classifiers by constrained empirical risk minimization and then constructing a piecewise constant scoring function s  N (x) by overlaying the resulting classifiers. Given the functional …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Multivariate two-sample hypothesis testing through AUC maximization for biomedical applications",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3411408.3411422",
            "Abstract": "Clinical datasets usually carry numerous features (biomarkers, characteristics, etc.) concerning the examined populations. This fact, although beneficial, challenges the statistical analysis via standard univariate approaches. In the two-sample setting, the majority of the clinical studies evaluate their assumptions relying on a variety of available univariate tests, such as the Student’s t-test or Mann-Whitney Wilcoxon. We developed an easy-to-use-and-interpret non-parametric two-sample hypothesis testing framework (ts-AUC) particularly using machine learning and the AUC maximization criterion. We test and verify the effectiveness of ts-AUC in real data containing posturographic features of Parkinsonian patients (PS) with and without history of falling.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:rmuvC79q63oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low Rank Activations for Tensor-Based Convolutional Sparse Coding",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9053402/",
            "Abstract": "In this article, we propose to extend the classical Convolutional Sparse Coding model (CSC) to multivariate data by introducing a new tensor CSC model that enforces sparsity and low-rank constraint on the activations. The advantages of this model are threefold. First, by using tensor algebra, this model takes into account the underlying structure of the data. Second, this model allows for complex atoms but enforces fewer activations to decompose the data, resulting in an improved summary (dictionary) and a better reconstruction of the original multivariate signal. Third, the number of parameters to be estimated are greatly reduced by the low-rank constraint. We exhibit the associated optimization problem and propose a framework based on alternating optimization to solve it. Finally, we evaluate it on both synthetic and real data.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:XoXfffV-tXoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic treatment allocation for epidemic control in arbitrary networks",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1065.7830&rep=rep1&type=pdf",
            "Abstract": "While static epidemic control, eg using vaccination, has been extensively studied for various network types, controlling epidemics dynamically remains an open issue. In this work, we first propose a general model formulation for the dynamic treatment allocation problem for the Susceptible-Infected-Susceptible diffusion model. Then, we investigate dynamic control strategies and further propose the novel Largest Reduction in Infectious Edges (LRIE) heuristic that gives priority to the treatment of nodes that have both a high dissemination rate of the infection to many healthy nodes, and low reinfection probability after recovery. Experiments on random and a real-world network show that the dynamic problem is significantly different from vaccination, since the latter strategies can lead to disastrous results, and that the proposed heuristic is an effective strategy under various initial infection conditions.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive partitioning schemes for bipartite ranking",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10994-010-5190-y.pdf",
            "Abstract": "Recursive partitioning methods are among the most popular techniques in machine learning. The purpose of this paper is to investigate how to adapt this methodology to the bipartite ranking problem. Following in the footsteps of the TreeRank approach developed in Clémençon and Vayatis (Proceedings of the 2008 Conference on Algorithmic Learning Theory, 2008 and IEEE Trans. Inf. Theory 55(9):4316–4336, 2009), we present tree-structured algorithms designed for learning to rank instances based on classification data. The main contributions of the present work are the following: the practical implementation of the TreeRank algorithm, well-founded solutions to the crucial issues related to the splitting rule and the choice of the “right” size for the ranking tree. From the angle embraced in this paper, splitting is viewed as a cost-sensitive classification task with data-dependent cost. Hence, up to …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Suppressing epidemics in networks using priority planning",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7542525/",
            "Abstract": "In this paper, we analyze a large class of dynamic resource allocation (DRA) strategies, named priority planning, that aim to suppress SIS epidemics taking place in a network. This is performed by distributing treatments of limited efficiency to its infected nodes, according to a priority-order precomputed offline. Under this perspective, an efficient DRA strategy for a given network can be designed by learning a proper linear arrangement of its nodes. In our theoretical analysis, we derive upper and lower bounds for the extinction time of the diffusion process that reveal the role of the maxcut of the considered linear arrangement. Accordingly, we highlight that the cutwidth, which is the minimum maxcut of all possible linear arrangements for a network, is a fundamental network property that determines the resource budget required to suppress the epidemic under priority planning. Finally, by making direct use of our …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Epidemic models for personalised COVID-19 isolation and exit policies using clinical risk predictions",
            "Publication year": 2020,
            "Publication url": "https://www.medrxiv.org/content/medrxiv/early/2020/05/12/2020.04.29.20084707.full.pdf",
            "Abstract": "Background: In mid April 2020, with more than 2.5 billion people in the world following social distancing measures due to COVID-19, governments are considering relaxing lock-down. We combined individual clinical risk predictions with epidemic modelling to examine simulations of  isolation and exit policies. Methods: We developed a method to include personalised risk predictions in epidemic models based on data science principles. We extended a standard susceptible-exposed-infected-removed (SEIR) model to account for predictions of severity, defined by the risk of an individual needing intensive care in case of infection. We studied example isolation policies using simulations with the risk-extended epidemic model, using COVID-19 data and estimates in France as of mid April 2020 (4 000 patients in ICU, around 7 250 total ICU beds occupied at the peak of the outbreak, 0.5% percent of patients requiring ICU upon infection).  We considered scenarios varying in the discrimination performance of a risk prediction model, in the degree of social distancing, and in the severity rate upon infection. Confidence intervals were obtained using an Approximate Bayesian Computation approach. The framework may be used with other epidemic models, with other risk predictions, and for other epidemic outbreaks. Findings: Based on the data for France as of mid April 2020, simulations indicated that an exit policy considering clinical risk predictions starting on May 11, as planned by the government, could enable to immediately relax restrictions for an extra 10% (6 700 000 people) or more of the lowest-risk population, and consequently relax the …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Cold Spring Harbor Laboratory Press"
        },
        {
            "Title": "Link prediction in graphs with autoregressive features",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1209.3230",
            "Abstract": "In the paper, we consider the problem of link prediction in time-evolving graphs. We assume that certain graph features, such as the node degree, follow a vector autoregressive (VAR) model and we propose to use this information to improve the accuracy of prediction. Our strategy involves a joint optimization procedure over the space of adjacency matrices and VAR matrices which takes into account both sparsity and low rank properties of the matrices. Oracle inequalities are derived and illustrate the trade-offs in the choice of smoothing parameters when modeling the joint effect of sparsity and low rank property. The estimate is computed efficiently using proximal methods through a generalized forward-backward agorithm.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A greedy approach for dynamic control of diffusion processes in networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7372195/",
            "Abstract": "This paper investigates the control of a diffusion process by utilizing real-time information. More specifically, we allow the network administrator to adjust the allocation of control resources, a set of treatments that increase the recovery rate of infected nodes, according to the evolution of the diffusion process. We first present a novel framework for describing a large class of dynamic control strategies. These strategies rely on sorting the nodes according to a priority score in order to treat more sensitive regions first. Then, we propose the Largest Reduction in Infectious Edges (LRIE) control strategy which is based on a greedy minimization of the cost associated to the undesired diffusion, and has the benefits of being efficient and easy to implement. Our simulations, which were conducted using a software package that we developed and made available to the community, show that the LRIE strategy substantially …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Greedy kernel change-point detection",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8907432/",
            "Abstract": "We consider the problem of detecting abrupt changes in the underlying stochastic structure of multivariate signals. A novel non-parametric and model-free off-line change-point detection method based on a kernel mapping is presented. This approach is sequential and alternates between two steps: a greedy detection to estimate a new breakpoint and a projection to remove its contribution to the signal. The resulting algorithm is able to segment time series for which no accurate model is available: it is computationally more efficient than exact kernel change-point detection and more precise than window-based approximations. The proposed method also offers some theoretical consistency properties. For the special case of a linear kernel, an even faster implementation is provided. The proposed strategy is compared to standard parametric and non-parametric procedures on a real-world data set composed of 262 …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:k8Z6L05lTy4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Bayes-risk consistency of regularized boosting methods",
            "Publication year": 2004,
            "Publication url": "https://projecteuclid.org/journals/annals-of-statistics/volume-32/issue-1/On-the-Bayes-risk-consistency-of-regularized-boosting-methods/10.1214/aos/1079120129.short",
            "Abstract": "The probability of error of classification methods based on convex combinations of simple base classifiers by \"boosting\" algorithms is investigated. The main result of the paper is that certain regularized boosting algorithms provide Bayes-risk consistent classifiers under the sole assumption that the Bayes classifier may be approximated by a convex combination of the base classifiers. Nonasymptotic distribution-free bounds are also developed which offer interesting new insight into how boosting works and help explain its success in practical classification problems.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Institute of Mathematical Statistics"
        },
        {
            "Title": "Segmentation de signaux physiologiques par optimisation globale",
            "Publication year": 2015,
            "Publication url": "https://charles.doffy.net/files/TOV-GRETSI-15.pdf",
            "Abstract": "Cet article s’ intéresse au problème concret de la segmentation de signaux physiologiques grâce à des méthodes d’optimisation globale. Plusieurs fonctions de coût, parfois inédites dans ce contexte, sont proposées pour détecter des changements dans la moyenne ou la variance, mais aussi dans la périodicité éventuelle des signaux. Ces fonctions seront évaluées et comparées dans un cadre unifié sur des signaux synthétiques et réels.In this article, we address the problem of segmentation of physiological signals through global optimization. Several cost functions are tested (some of them new in this context) in order to detect changes not only in the mean or variance but also in the periodicity of the signals. Results are provided in an unified framework on real and artificial signals.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:NJ774b8OgUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vitesses exactes dans les bornes de Vapnik-Chervonenkis",
            "Publication year": 2003,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-bd9173f5-5b4f-3b96-bd98-2c52962748f8",
            "Abstract": "Vapnik-Chervonenkis bounds on rates of uniform convergence of empirical means to their expectations have been continuously improved over the years since the precursory work in [26]. The result obtained by Talagrand in 1994 [21] seems to provide the final word as far as universal bounds are concerned. However, in the case where there are some additional assumptions on the underlying probability distribution, the exponential rate of convergence can be fairly improved. Alexander [1] and Massart [15] have found better exponential rates (similar to those in Bennett-Bernstein inequalities) under the assumption of a control on the variance of the empirical process. In this paper, the case of a particular distribution is considered for the empirical process indexed by a family of sets, and we provide the exact exponential rate based on large deviations theorems, as predicted by Azencott [2].",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approximation of the optimal ROC curve and a tree-based ranking algorithm",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87987-9_7",
            "Abstract": "We consider the extension of standard decision tree methods to the bipartite ranking problem. In ranking, the goal pursued is global: define an order on the whole input space in order to have positive instances on top with maximum probability. The most natural way of ordering all instances consists in projecting the input data x onto the real line using a real-valued scoring function s and the accuracy of the ordering induced by a candidate s is classically measured in terms of the AUC. In the paper, we discuss the design of tree-structured scoring functions obtained by maximizing the AUC criterion. In particular, the connection with recursive piecewise linear approximation of the optimal ROC curve both in the L 1-sense and in the L  ∞ -sense is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Selection of the Best Electroencephalogram Channel to Predict the Depth of Anesthesia",
            "Publication year": 2019,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncom.2019.00065/full",
            "Abstract": "Precise cerebral dynamics of action of the anesthetics are a challenge for neuroscientists. This explains why there is no gold standard for monitoring the Depth of Anesthesia (DoA) and why experimental studies may use several electroencephalogram (EEG) channels, ranging from 2 to 128 EEG-channels. Our study aimed at finding the scalp area providing valuable information about brain activity under general anesthesia (GA) to select the more optimal EEG channel to characterized the DoA. We included 30 patients undergoing elective, minor surgery under GA and used a 32-channel EEG to record their electrical brain activity. In addition, we recorded their physiological parameters and the BIS monitor. Each individual EEG channel data were processed to test their ability to differentiate awake from asleep states. Due to strict quality criteria adopted for the EEG data and the difficulties of the real-life setting of the study, only 8 patients recordings were taken into consideration in the final analysis. Using 2 classification algorithms, we identified the optimal channels to discriminate between asleep and awake states: the frontal and temporal F8 and T7 were retrieved as being the two bests channels to monitor DoA. Then, using only data from the F8 channel, we tried to minimize the number of features required to discriminate between the awake and asleep state. The best algorithm turned out to be the Gaussian Naïve Bayes (GNB) requiring only 5 features (Area Under the ROC Curve - AUC- of 0.93 +/- 0.04). This finding may pave the way to improve the assessment of DoA by combining one EEG channel recordings with a multimodal physiological …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:tuHXwOkdijsC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Method for characterising a gait",
            "Publication year": 2018,
            "Publication url": "https://patents.google.com/patent/US20180220936A1/en",
            "Abstract": "A method is provided for characterising a gait comprising steps of: receiving a signal measuring the movement of a target subject measured beforehand; comparing (204) at least one section of the measuring signal with a plurality of reference signals, the plurality of reference signals comprising at least one movement signal measured beforehand on a reference subject different from the target subject, each comparison of the measuring signal with a reference signal producing a similarity coefficient representative of a probability of similarity between the compared signals; and selecting (208) at least one local maximum of interest among the similarity coefficients produced, wherein the plurality of reference signals comprises at least one movement signal measured beforehand on a reference subject afflicted with a gait disorder, and at least one movement signal measured beforehand on a healthy reference object.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Epidemic Models for COVID-19 during the First Wave from February to May 2020: a Methodological Review",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.01450",
            "Abstract": "We review epidemiological models for the propagation of the COVID-19 pandemic during the early months of the outbreak: from February to May 2020. The aim is to propose a methodological review that highlights the following characteristics: (i) the epidemic propagation models, (ii) the modeling of intervention strategies, (iii) the models and estimation procedures of the epidemic parameters and (iv) the characteristics of the data used. We finally selected 80 articles from open access databases based on criteria such as the theoretical background, the reproducibility, the incorporation of interventions strategies, etc. It mainly resulted to phenomenological, compartmental and individual-level models. A digital companion including an online sheet, a Kibana interface and a markdown document is proposed. Finally, this work provides an opportunity to witness how the scientific community reacted to this unique situation.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:IRz6iEL74y4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sleep apnea syndrome and subthalamic stimulation in Parkinson's disease",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389945721004159",
            "Abstract": "Τhe association between Parkinson's disease (PD) and sleep apnea syndrome (SAS) is not fully elucidated and very few studies reported on SAS outcome after deep brain stimulation (DBS). Here, we compare the clinical profile of PD patients with and without SAS and assess, for the first time, the value of pre-DBS SAS as predictor of post-DBS outcome in PD.Fifty patients were grouped into PD with SAS (PD-SAS+,n = 22) and without (PD-SAS-,n = 28), based on the Apnea-Hypopnea-Index (AHI≥5) in polysomnography. We used novel multivariate statistical models to compare pre-DBS profiles and assess post-DBS motor, non-motor and quality of life (QoL) changes in both groups.In the entire cohort, 44% of patients had at least mild SAS (AHI≥5), while 22% had at least moderate (AHI≥15). Mean AHI was 11/h (NREM-AHI = 10.2/h and REM-AHI = 13.5/h). The two groups had equal …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:2VqYfGB8ITEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ranking and empirical minimization of U-statistics",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=16280252797348411827&hl=en&oi=scholarr",
            "Abstract": "The problem of ranking/ordering instances, instead of simply classifying them, has recently gained much attention in machine learning. In this paper we formulate the ranking problem in a rigorous statistical framework. The goal is to learn a ranking rule for deciding, among two instances, which one is\" better,\" with minimum ranking risk. Since the natural estimates of the risk are of the form of a U-statistic, results of the theory of U-processes are required for investigating the consistency of empirical risk minimizers. We establish in particular a tail inequality for degenerate U-processes, and apply it for showing that fast rates of convergence may be achieved under specific noise assumptions, just like in classification. Convex risk minimization methods are also studied.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:35r97b3x0nAC",
            "Publisher": "math/0603123"
        },
        {
            "Title": "Improved method for quantifying balance",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US20200375520A1/en",
            "Abstract": "The invention relates to a method for quantifying the balance of an individual to obtain a value representative of the balance of said individual, said method being implemented by a device comprising at least one data processing module, one storage means, and one classification module, said method comprising in particular the following steps:",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ranking data with ordinal labels: optimality and pairwise aggregation",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10994-012-5325-4.pdf",
            "Abstract": "The paper describes key insights in order to grasp the nature of K-partite ranking. From the theoretical side, the various characterizations of optimal elements are fully described, as well as the likelihood ratio monotonicity condition on the underlying distribution which guarantees that such elements do exist. Then, a pairwise aggregation procedure based on Kendall tau is introduced to relate learning rules dedicated to bipartite ranking and solutions of the K-partite ranking problem. Criteria reflecting ranking performance under these conditions such as the ROC surface and its natural summary, the volume under the ROC surface (VUS), are then considered as targets for empirical optimization. The consistency of pairwise aggregation strategies are studied under these criteria and shown to be efficient under reasonable assumptions. Eventually, numerical results illustrate the relevance of the methodology …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Can small islands protect nearby coasts from tsunamis? An active experimental design approach",
            "Publication year": 2014,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rspa.2014.0575",
            "Abstract": "Small islands in the vicinity of the mainland are widely believed to offer protection from wind and waves and thus coastal communities have been developed in mainland areas behind small islands. However, whether they offer protection from tsunamis is unclear. Do islands act as natural barriers? Recent post-tsunami survey data, supported by numerical simulations, reveal that the run-up on coastal areas behind small islands was significantly higher than on neighbouring locations not affected by the presence of the islands. To study the conditions of this run-up amplification, we solve numerically the nonlinear shallow water equations. We use the simplified geometry of a conical island sitting on a flat seafloor in front of a uniform sloping beach. By doing so, the experimental set-up is defined by five physical parameters, namely the island slope, the beach slope, the water depth, the distance between the island and …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:L8Ckcad2t8MC",
            "Publisher": "The Royal Society Publishing"
        },
        {
            "Title": "Nonparametric estimation of the precision-recall curve",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1553374.1553398",
            "Abstract": "The Precision-Recall (PR) curve is a widely used visual tool to evaluate the performance of scoring functions in regards to their capacities to discriminate between two populations. The purpose of this paper is to examine both theoretical and practical issues related to the statistical estimation of PR curves based on classification data. Consistency and asymptotic normality of the empirical counterpart of the PR curve in sup norm are rigorously established. Eventually, the issue of building confidence bands in the PR space is considered and a specific resampling procedure based on a smoothed and truncated version of the empirical distribution of the data is promoted. Arguments of theoretical and computational nature are presented to explain why such a bootstrap is preferable to a\" naive\" bootstrap in this setup.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AUC optimization and the two-sample problem",
            "Publication year": 2009,
            "Publication url": "http://papers.nips.cc/paper/3838-auc-optimization-and-the-two-sample-problem",
            "Abstract": "The purpose of the paper is to explore the connection between multivariate homogeneity tests and $\\auc $ optimization. The latter problem has recently received much attention in the statistical learning literature. From the elementary observation that, in the two-sample problem setup, the null assumption corresponds to the situation where the area under the optimal ROC curve is equal to 1/2, we propose a two-stage testing method based on data splitting. A nearly optimal scoring function in the AUC sense is first learnt from one of the two half-samples. Data from the remaining half-sample are then projected onto the real line and eventually ranked according to the scoring function computed at the first stage. The last step amounts to performing a standard Mann-Whitney Wilcoxon test in the one-dimensional framework. We show that the learning step of the procedure does not affect the consistency of the test as well as its properties in terms of power, provided the ranking produced is accurate enough in the AUC sense. The results of a numerical experiment are eventually displayed in order to show the efficiency of the method.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid Modelling for Lifetime Prediction",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-48021-9_43",
            "Abstract": "Asset management is a major challenge for RTE (Réseau de Transport d’Electricité), the French TSO (Transmission System Operator) since electrical grid component maintenance and renewal represent important economic issues. Thus, improved assessment of their lifetime could lead RTE to substantial savings while assuring a high quality of service. To tackle this issue, RTE has gathered large amounts of data (monitoring, material failures, asset database …) and at the same time has tried to understand the phenomena of equipment ageing that could eventually lead to failure. RTE has chosen to take advantage of these two information sources when developing a hybrid model. This model combines data analysis of the gathered data sets and numerical simulation applied to the physical modelling of the phenomena involved in the accelerated ageing of equipment. To illustrate this approach, we are going to …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:86PQX7AUzd4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mesurer la mobilité des seniors dans des ateliers de prévention à La Réunion: le programme 5P (Prestation de Parcours Participatif Personnalisé de Prévention)",
            "Publication year": 2017,
            "Publication url": "https://www.documentation.ird.fr/hor/fdi:010076858",
            "Abstract": "Mesurer la mobilité des seniors dans des ateliers de prévention à La Réunion : le programme \n5P (Prestation de Parcours Participatif Personnalisé de Prévention) - fdi:010076858 - Horizon \nHorizon / Plein textes La base de ressources documentaires de l'IRD IRD Publications des \nscientifiques de l'IRD Eychene JM, Audiffren J., De Waele C., Faraut G., Klein Armelle, \nLabourdette C., Oudre L., Vayatis N., Vidal PP, Sandron Frédéric. (2017). Mesurer la mobilité \ndes seniors dans des ateliers de prévention à La Réunion : le programme 5P (Prestation de \nParcours Participatif Personnalisé de Prévention). L'Année Gérontologique, 31 (1), 36-37. \nCongrès Francophone Fragilité des Personnes Âgées et Prévention de la Perte d'Autonomie, \n5., Paris (FRA), 2017/03/16-17. ISSN 1288-7854 Accès réservé (Intranet IRD) Demander le PDF \nEn Libre Accès sur HAL https://hal.archives-ouvertes.fr/hal-02322221v1 Titre Mesurer la des …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An automated recording method in clinical consultation to rate the limp in lower limb osteoarthritis",
            "Publication year": 2016,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0164975",
            "Abstract": "For diagnosis and follow up, it is important to be able to quantify limp in an objective, and precise way adapted to daily clinical consultation. The purpose of this exploratory study was to determine if an inertial sensor-based method could provide simple features that correlate with the severity of lower limb osteoarthritis evaluated by the WOMAC index without the use of step detection in the signal processing. Forty-eight patients with lower limb osteoarthritis formed two severity groups separated by the median of the WOMAC index (G1, G2). Twelve asymptomatic age-matched control subjects formed the control group (G0). Subjects were asked to walk straight 10 meters forward and 10 meters back at self-selected walking speeds with inertial measurement units (IMU) (3-D accelerometers, 3-D gyroscopes and 3-D magnetometers) attached on the head, the lower back (L3-L4) and both feet. Sixty parameters corresponding to the mean and the root mean square (RMS) of the recorded signals on the various sensors (head, lower back and feet), in the various axes, in the various frames were computed. Parameters were defined as discriminating when they showed statistical differences between the three groups. In total, four parameters were found discriminating: mean and RMS of the norm of the acceleration in the horizontal plane for contralateral and ipsilateral foot in the doctor’s office frame. No discriminating parameter was found on the head or the lower back. No discriminating parameter was found in the sensor linked frames. This study showed that two IMUs placed on both feet and a step detection free signal processing method could be an …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:ye4kPcJQO24C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Strong Consistency of the Bayesian Estimator for the Ornstein–Uhlenbeck Process",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-02069-3_19",
            "Abstract": "In the accompanying paper Kohatsu-Higa et al. (submitted, 2013), we have done a theoretical study of the consistency of a computational intensive parameter estimation method for Markovian models. This method could be considered as an approximate Bayesian estimator method or a filtering problem approximated using particle methods. We showed in Kohatsu-Higa (submitted, 2013) that under certain conditions, which explicitly relate the number of data, the amount of simulations and the size of the kernel window, one obtains the rate of convergence of the method. In this first study, the conditions do not seem easy to verify and for this reason, we show in this paper how to verify these conditions in the toy example of the Ornstein–Uhlenbeck processes. We hope that this article will help the reader understand the theoretical background of our previous studies and how to interpret the required hypotheses.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Tuning of a Bayesian estimator under discrete time observations and unknown transition density",
            "Publication year": 2018,
            "Publication url": "http://www.mathnet.ru/eng/thsp261",
            "Abstract": "We study the asymptotic behaviour of a Bayesian parameter estimation method on a compact one-dimensional parameter space. The estimation procedure is considered under discrete observations and unknown transition density. Here, we observe the data with constant time steps and the transition density of the data is approximated by using a kernel density estimation method applied to the Monte Carlo simulations of approximations of the theoretical random variables generating the observations. We estimate the error between the theoretical estimator, which assumes the knowledge of the transition density and its approximation which uses the simulation. We prove the strong consistency of the approximated estimator and find the order of the error. Most importantly, we give a parameter tuning result which relates the number of data, the weak error in the approximation process, the number of the Monte-Carlo …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:URolC5Kub84C",
            "Publisher": "Институт математики Национальной академии наук Украины"
        },
        {
            "Title": "Link discovery using graph feature tracking",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.231.978&rep=rep1&type=pdf",
            "Abstract": "We consider the problem of discovering links of an evolving undirected graph given a series of past snapshots of that graph. The graph is observed through the time sequence of its adjacency matrix and only the presence of edges is observed. The absence of an edge on a certain snapshot cannot be distinguished from a missing entry in the adjacency matrix. Additional information can be provided by examining the dynamics of the graph through a set of topological features, such as the degrees of the vertices. We develop a novel methodology by building on both static matrix completion methods and the estimation of the future state of relevant graph features. Our procedure relies on the formulation of an optimization problem which can be approximately solved by a fast alternating linearized algorithm whose properties are examined. We show experiments with both simulated and real data which reveal the interest of our methodology.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of simultaneously sparse and low rank matrices",
            "Publication year": 2012,
            "Publication url": "https://openreview.net/forum?id=H1-wbsW_-B",
            "Abstract": "The paper introduces a penalized matrix estimation procedure aiming at solutions which are sparse and low-rank at the same time. Such structures arise in the context of social networks or protein interactions where underlying graphs have adjacency matrices which are block-diagonal in the appropriate basis. We introduce a convex mixed penalty which involves l1-norm and trace norm simultaneously. We obtain an oracle inequality which indicates how the two effects interact according to the nature of the target matrix. We bound generalization error in the link prediction problem. We also develop proximal descent strategies to solve the optimization problem efficiently and evaluate performance on synthetic and real data sets.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:8d8msizDQcsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Use of Inertial Measurement Units for the Study of Free Living Environment Activity Assessment: A Literature Review",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/845160",
            "Abstract": "This article presents an overview of fifty-eight articles dedicated to the evaluation of physical activity in free-living conditions using wearable motion sensors. This review provides a comprehensive summary of the technical aspects linked to sensors (types, number, body positions, and technical characteristics) as well as a deep discussion on the protocols implemented in free-living conditions (environment, duration, instructions, activities, and annotation). Finally, it presents a description and a comparison of the main algorithms and processing tools used for assessing physical activity from raw signals. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Ranking multi-class data: Optimality and pairwise aggregation",
            "Publication year": 2011,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00630496/",
            "Abstract": "It is the primary purpose of this paper to set the goals of ranking in a multiple-class context rigorously, following in the footsteps of recent results in the bipartite framework. Under specific likelihood ratio monotonicity conditions, optimal solutions for this global learning problem are described in the ordinal situation, i.e. when there exists a natural order on the set of labels. Criteria reflecting ranking performance under these conditions such as the ROC surface and its natural summary, the volume under the ROC surface (VUS), are next considered as targets for empirical optimization. Whereas plug-in techniques or the Empirical Risk Maximization principle can be then easily extended to the ordinal multi-class setting, reducing the K-partite ranking task to the solving of a collection of bipartite ranking problems, following in the footsteps of the pairwise comparison approach in classification, is in contrast more challenging. Here we consider a concept of ranking rule consensus based on the Kendall distance and show that, when it exists and is based on consistent ranking rules for the bipartite ranking subproblems defined by all consecutive pairs of labels, the latter forms a consistent ranking rule in the VUS sense under adequate conditions. This result paves the way for extending the use of recently developed learning algorithms, tailored for bipartite ranking, to multi-class data in a valid theoretical framework. Preliminary experimental results are presented for illustration purpose.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning to suppress SIS epidemics in networks",
            "Publication year": 2015,
            "Publication url": "http://kalogeratos.com/psite/files/MyPapers/MCM_NetworksWorkshos_NIPS2015.pdf",
            "Abstract": "In this paper, we introduce the class of priority planning strategies for suppressing SIS epidemics taking place in a network. This is performed via dynamic allocation of treatment resources with limited efficiency to the infected nodes, according to a precomputed priority-order. Using recent theoretical results that highlight the role of the maxcut of a node ordering and the extinction time of an epidemic, we propose a simple and efficient strategy called MaxCut Minimization (MCM) that outperforms competing state-of-the-art strategies in simulated epidemic scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantify osteoarthritis gait at the doctor’s office: a simple pelvis accelerometer based method independent from footwear and aging",
            "Publication year": 2015,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02865881/",
            "Abstract": "The gold standard to evaluate the severity of  steoarthritis in  the doctor’s office remains clinical scores (Bellamy 2002). The  Western Ontario and McMaster Universities (WOMAC) oste- oarthritis index is the most largely used score in rheumatology  for lower limb osteoarthritis. It is based on clinical observation  and it assesses pain, stiffness, and physical function in patients  with hip and knee osteoarthritis. It is valid, reliable, and sen- sitive to evaluate osteoarthritis and adapted to doctor’s office  (Bellamy 2002). However, clinical scores are inherently subjective and they  depend from the patient’s impression and from the clinician’s  interpretation. Gait analysis in modern gait laboratories with  force plates and photogrammetry is a good tool to have an objec- tive, quantified, and precise insight in osteoarthritis (Astephen  et al. 2008). For practical reasons, skin-mounted inertial sensors are well  suited for investigating gait kinematics (Auvinet et al. 2002). In  accelerometer-based gait analysis, aging is also known to affect  gait parameters (Oberg et al. 1993). To have a clinical measure of  osteoarthritis, it is essential to find a technique that is independ- ent from aging. Footwear can also affect walking parameters  (Chambon et al. 2014). Since it is too time consuming to ask the  patient to take off his shoe for the measurement, it is essential to  find a method independent from the shoe type. Walking ten meters go and ten meters back on a level sur- face at comfortable walking speed is a well-suited protocol for  clinical situations. This study proposes to test a 3D pelvis accelerometer-based  measurement method on a group of 47 patients suffering from …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DenseNets for Time Series Classification: towards automation of time series pre-processing with CNNs",
            "Publication year": 2019,
            "Publication url": "https://kdd-milets.github.io/milets2019/papers/milets19_poster_4.pdf",
            "Abstract": "It is well known that data normalization is a fundamental preprocessing step for learning using Convolutional Neural Networks (CNN). Multiple normalization techniques have been proposed and finding an appropriate one is not an easy task. Motivated by applications in the energy consumption field, we study Time Series Classification (TSC) with deep learning techniques. We adapt DenseNets to a new convolutional architecture for TSC. We conduct an experimental study the impact of different data normalization techniques on this architecture. We propose a solution to mitigate different pre-processing methods and show its applicability across various fields.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:vbGhcppDl1QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A consistent strategy for boosting algorithms",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45435-7_21",
            "Abstract": "The probability of error of classification methods based on convex combinations of simple base classifiers by “boosting” algorithms is investigated. The main result of the paper is that certain regularized boosting algorithms provide Bayes-risk consistent classifiers under the only assumption that the Bayes classifier may be approximated by a convex combination of the base classifiers. Non-asymptotic distribution-free bounds are also developed which offer interesting new insight into how boosting works and help explain their success in practical classification problems.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Discussions of boosting papers, and rejoinders",
            "Publication year": 2004,
            "Publication url": "https://projecteuclid.org/journals/annals-of-statistics/volume-32/issue-1/Discussions-of-boosting-papers-and-rejoinders/10.1214/aos/1105988581.short",
            "Abstract": "Discussions of: \"Process consistency for AdaBoost\" [Ann. Statist. 32 (2004), no. 1, 13-29] by W. Jiang; \"On the Bayes-risk consistency of regularized boosting methods\" [ibid., 30-55] by G. Lugosi and N. Vayatis; and \"Statistical behavior and consistency of classification methods based on convex risk minimization\" [ibid., 56-85] by T. Zhang. Includes rejoinders by the authors.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Institute of Mathematical Statistics"
        },
        {
            "Title": "U-statistics",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=394076421365201553&hl=en&oi=scholarr",
            "Abstract": "The problem of ranking/ordering instances, instead of simply classifying them, has recently gained much attention in machine learning. In this paper we formulate the ranking problem in a rigorous statistical framework. The goal is to learn a ranking rule for deciding, among two instances, which one is\" better,\" with minimum ranking risk. Since the natural estimates of the risk are of the form of a U-statistic, results of the theory of U-processes are required for investigating the consistency of empirical risk minimizers. We establish in particular a tail inequality for degenerate U-processes, and apply it for showing that fast rates of convergence may be achieved under specic noise assumptions, just like in classication. Convex risk minimization methods are also studied.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On constructing accurate conﬁdence bands for ROC curves through smooth resampling",
            "Publication year": 2008,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00335232/",
            "Abstract": "This paper is devoted to thoroughly inves- tigating how to bootstrap the ROC curve, a widely used visual tool for evaluating the accuracy of test/scoring statistics s(X) in the bipartite setup. The issue of conﬁdence bands for the ROC curve is considered and a resampling procedure based on a smooth ver- sion of the empirical distribution called the ”smoothed bootstrap” is introduced. Theo- retical arguments and simulation results are presented to show that the ”smoothed boot- strap” is preferable to a ”naive” bootstrap in order to construct accurate conﬁdence bands.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multivariate Convolutional Sparse Coding with Low Rank Tensor",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1908.03367",
            "Abstract": "This paper introduces a new multivariate convolutional sparse coding based on tensor algebra with a general model enforcing both element-wise sparsity and low-rankness of the activations tensors. By using the CP decomposition, this model achieves a significantly more efficient encoding of the multivariate signal-particularly in the high order/ dimension setting-resulting in better performance. We prove that our model is closely related to the Kruskal tensor regression problem, offering interesting theoretical guarantees to our setting. Furthermore, we provide an efficient optimization algorithm based on alternating optimization to solve this model. Finally, we evaluate our algorithm with a large range of experiments, highlighting its advantages and limitations.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Concentration Inequalities for Two-Sample Rank Processes with Application to Bipartite Ranking",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.02943",
            "Abstract": "The ROC curve is the gold standard for measuring the performance of a test/scoring statistic regarding its capacity to discriminate between two statistical populations in a wide variety of applications, ranging from anomaly detection in signal processing to information retrieval, through medical diagnosis. Most practical performance measures used in scoring/ranking applications such as the AUC, the local AUC, the p-norm push, the DCG and others, can be viewed as summaries of the ROC curve. In this paper, the fact that most of these empirical criteria can be expressed as two-sample linear rank statistics is highlighted and concentration inequalities for collections of such random variables, referred to as two-sample rank processes here, are proved, when indexed by VC classes of scoring functions. Based on these nonasymptotic bounds, the generalization capacity of empirical maximizers of a wide class of ranking performance criteria is next investigated from a theoretical perspective. It is also supported by empirical evidence through convincing numerical experiments.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:DUooU5lO8OsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Multi-Round Sequential Selection Problem.",
            "Publication year": 2018,
            "Publication url": "https://deepai.org/publication/the-multi-round-sequential-selection-problem",
            "Abstract": "In the Sequential Selection Problem (SSP), immediate and irrevocable decisions need to be made while candidates from a finite set are being examined one-by-one. The goal is to assign a limited number of b available jobs to the best possible candidates. Standard SSP variants begin with an empty selection set (cold-starting) and perform the selection process once (single-round), over a single candidate set. In this paper we introduce the Multi-round Sequential Selection Problem (MSSP) which launches a new round of sequential selection each time a new set of candidates becomes available. Each new round has at hand the output of the previous one, ie its b selected employees, and tries to update optimally that selection by reassigning each job at most once. Our setting allows changes to take place between two subsequent selection rounds: resignations of previously selected subjects or/and alterations of the quality score across the population. The challenge for a selection strategy is thus to efficiently adapt to such changes. For this novel problem we adopt a cutoff-based approach, where a precise number of candidates should be rejected first before starting to select. We set a rank-based objective of the process over the final job-to-employee assignment and we investigate analytically the optimal cutoff values with respect to the important parameters of the problem. Finally, we present experimental results that compare the efficiency of different selection strategies, as well as their convergence rates towards the optimal solution in the case of stationary score distributions.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ADAPT: Awesome Domain Adaptation Python Toolbox",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2107.03049",
            "Abstract": "ADAPT is an open-source python library providing the implementation of several domain adaptation methods. The library is suited for scikit-learn estimator object (object which implement fit and predict methods) and tensorflow models. Most of the implemented methods are developed in an estimator agnostic fashion, offering various possibilities adapted to multiple usage. The library offers three modules corresponding to the three principal strategies of domain adaptation: (i) feature-based containing methods performing feature transformation; (ii) instance-based with the implementation of reweighting techniques and (iii) parameter-based proposing methods to adapt pre-trained models to novel observations. A full documentation is proposed online https://adapt-python.github.io/adapt/ with gallery of examples. Besides, the library presents an high test coverage.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:_5tno0g5mFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A ranking approach to global optimization",
            "Publication year": 2016,
            "Publication url": "http://proceedings.mlr.press/v48/malherbe16.html",
            "Abstract": "We consider the problem of maximizing an unknown function f over a compact and convex set using as few observations f (x) as possible. We observe that the optimization of the function f essentially relies on learning the induced bipartite ranking rule of f. Based on this idea, we relate global optimization to bipartite ranking which allows to address problems with high dimensional input space, as well as cases of functions with weak regularity properties. The paper introduces novel meta-algorithms for global optimization which rely on the choice of any bipartite ranking method. Theoretical properties are provided as well as convergence guarantees and equivalences between various optimization methods are obtained as a by-product. Eventually, numerical evidence is given to show that the main algorithm of the paper which adapts empirically to the underlying ranking structure essentially outperforms existing state-of-the-art global optimization algorithms in typical benchmarks.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:JoZmwDi-zQgC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Uncertainty quantification through a hierarchy of models-Application to the neutron cross sections evaluation",
            "Publication year": 2017,
            "Publication url": "https://inis.iaea.org/search/search.aspx?orig_q=RN:49058474",
            "Abstract": "[en] The uncertainties of parameters involved in the physical equations are not systematically due to the natural variability of random phenomena, but may be caused by a lack of knowledge. These so-called epistemic uncertainties can then be reduced by acquiring relevant information from dedicated experiments. The classical method, within the framework of probabilities, uses the Bayes theorem to get the subsequent probability of the parameters from the available information. The article presents an alternative approach derived from classification techniques based on the use of score functions measuring the adequacy of the response obtained by the candidate model to a set of experimental data. These score functions allow the prioritizing of the sets of parameters issued from a set of candidate models in order to select the best ones. This methodology has been applied to the calculation of variance-covariance matrices of neutron cross sections, which quantify the interaction between a neutron and an isotope for a given type of nuclear reaction.(authors)",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantitative assessment of consciousness during anesthesia without EEG data",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10877-020-00553-4",
            "Abstract": "Assessing the depth of anesthesia (DoA) is a daily challenge for anesthesiologists. The best assessment of the depth of anesthesia is commonly thought to be the one made by the doctor in charge of the patient. This evaluation is based on the integration of several parameters including epidemiological, pharmacological and physiological data. By developing a protocol to record synchronously all these parameters we aim at having this evaluation made by an algorithm. Our hypothesis was that the standard parameters recorded during anesthesia (without EEG) could provide a good insight into the consciousness level of the patient. We developed a complete solution for high-resolution longitudinal follow-up of patients during anesthesia. A Hidden Markov Model (HMM) was trained on the database in order to predict and assess states based on four physiological variables that were adjusted to the …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:hCrLmN-GePgC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Learning the piece-wise constant graph structure of a varying Ising model",
            "Publication year": 2020,
            "Publication url": "http://proceedings.mlr.press/v119/bars20a.html",
            "Abstract": "This work focuses on the estimation of multiple change-points in a time-varying Ising model that evolves piece-wise constantly. The aim is to identify both the moments at which significant changes occur in the Ising model, as well as the underlying graph structures. For this purpose, we propose to estimate the neighborhood of each node by maximizing a penalized version of its conditional log-likelihood. The objective of the penalization is twofold: it imposes sparsity in the learned graphs and, thanks to a fused-type penalty, it also enforces them to evolve piece-wise constantly. Using few assumptions, we provide two change-points consistency theorems. Those are the first in the context of unknown number of change-points detection in time-varying Ising model. Finally, experimental results on several synthetic datasets and a real-world dataset demonstrate the performance of our method.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:MLfJN-KU85MC",
            "Publisher": "PMLR"
        },
        {
            "Title": "An empirical comparison of learning algorithms for nonparametric scoring: the treerank algorithm and other methods",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-012-0299-1",
            "Abstract": "The TreeRank algorithm was recently proposed in [1] and [2] as a scoring-based method based on recursive partitioning of the input space. This tree induction algorithm builds orderings by recursively optimizing the Receiver Operating Characteristic curve through a one-step optimization procedure called LeafRank. One of the aim of this paper is the in-depth analysis of the empirical performance of the variants of TreeRank/LeafRank method. Numerical experiments based on both artificial and real data sets are provided. Further experiments using resampling and randomization, in the spirit of bagging and random forests are developed [3, 4] and we show how they increase both stability and accuracy in bipartite ranking. Moreover, an empirical comparison with other efficient scoring algorithms such as RankBoost and RankSVM is presented on UCI benchmark data sets.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer London"
        },
        {
            "Title": "AUC optimization and the two-sample problem",
            "Publication year": 2009,
            "Publication url": "https://hal.telecom-paris.fr/hal-02107262",
            "Abstract": "The purpose of the paper is to explore the connection between multivariate ho-mogeneity tests and AUC optimization. The latter problem has recently received much attention in the statistical learning literature. From the elementary observation that, in the two-sample problem setup, the null assumption corresponds to the situation where the area under the optimal ROC curve is equal to 1/2, we propose a two-stage testing method based on data splitting. A nearly optimal scoring function in the AUC sense is first learnt from one of the two half-samples. Data from the remaining half-sample are then projected onto the real line and eventually ranked according to the scoring function computed at the first stage. The last step amounts to performing a standard Mann-Whitney Wilcoxon test in the one-dimensional framework. We show that the learning step of the procedure does not affect the consistency of the test as well as its properties in terms of power, provided the ranking produced is accurate enough in the AUC sense. The results of a numerical experiment are eventually displayed in order to show the efficiency of the method.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Impact du programme de prévention'Atout Âge'sur le risque de chute par la mesure objective de la vitesse de marche",
            "Publication year": 2020,
            "Publication url": "https://www.documentation.ird.fr/hor/fdi:010078449",
            "Abstract": "Impact du programme de prévention 'Atout Âge' sur le risque de chute par la mesure objective \nde la vitesse de marche - fdi:010078449 - Horizon Horizon / Plein textes La base de ressources \ndocumentaires de l'IRD IRD Publications des scientifiques de l'IRD Legrand F., Eychene JM, \nNicolai A., Audiffren J., Klein Armelle, Labourdette C., Oudre L., Vayatis N., Vidal PP, Sandron \nFrédéric. (2020). Impact du programme de prévention 'Atout Âge' sur le risque de chute par \nla mesure objective de la vitesse de marche. L'Année Gérontologique, 34 (1), 20. Congrès \nFragilité du Sujet Agé : le Vieillissement en Santé. Prévention de la Perte d'Autonomie, 8., \nToulouse (FRA), 2020/03/9-10. ISSN 1288-7854 Accès réservé (Intranet IRD) Demander le \nPDF En Libre Accès sur HAL https://hal.archives-ouvertes.fr/hal-02519002v1 Titre Impact du \nprogramme de prévention 'Atout Âge' sur le risque de chute par la mesure objective de la F'…",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A regularization approach for prediction of edges and node features in dynamic graphs",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1203.5438",
            "Abstract": "We consider the two problems of predicting links in a dynamic graph sequence and predicting functions defined at each node of the graph. In many applications, the solution of one problem is useful for solving the other. Indeed, if these functions reflect node features, then they are related through the graph structure. In this paper, we formulate a hybrid approach that simultaneously learns the structure of the graph and predicts the values of the node-related functions. Our approach is based on the optimization of a joint regularization objective. We empirically test the benefits of the proposed method with both synthetic and real data. The results indicate that joint regularization improves prediction performance over the graph evolution and the node features.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information diffusion and rumor spreading",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128136775000249",
            "Abstract": "This chapter studies information cascades on social networks with a special focus on types of diffusion processes such as rumors and false news. The complex temporal dynamics of information cascades and rapid changes in user interests require flexible mathematical modeling to properly describe the diffusion dynamics. After mentioning the modeling advancements of recent decades, we get to modern models, such as the Information Cascade Model (ICM), that are indeed capable of describing such time-dependent user interests and are thus particularly suited to the analysis of information diffusion. We provide a theoretical analysis of ICM, relating the dynamics of the cascade to structural characteristics of the social network, and then use that analysis to design control policies capable of efficiently reducing the undesired diffusion. The presented framework for activity shaping is generic while enjoying a simple …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "R-implementation of the TreeRank algorithm",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=6069277160963377993&hl=en&oi=scholarr",
            "Abstract": "TreeRank is a R-package for building tree-based ranking rules through the tree induction method proposed in Clémençon and Vayatis (2009). It also comprises a list of routines for reading or visualizing ranking trees. We provide an easy-to-use GUI in order to perform model selection and interpret the results produced by this learning algorithm, specifically designed for ROC optimization.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimization for gaussian processes via chaining",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1510.05576",
            "Abstract": "In this paper, we consider the problem of stochastic optimization under a bandit feedback model. We generalize the GP-UCB algorithm [Srinivas and al., 2012] to arbitrary kernels and search spaces. To do so, we use a notion of localized chaining to control the supremum of a Gaussian process, and provide a novel optimization scheme based on the computation of covering numbers. The theoretical bounds we obtain on the cumulative regret are more generic and present the same convergence rates as the GP-UCB algorithm. Finally, the algorithm is shown to be empirically more efficient than its natural competitors on simple and complex input spaces.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Link prediction in graphs with autoregressive features",
            "Publication year": 2014,
            "Publication url": "https://www.jmlr.org/papers/volume15/richard14a/richard14a.pdf",
            "Abstract": "In the paper, we consider the problem of link prediction in time-evolving graphs. We assume that certain graph features, such as the node degree, follow a vector autoregressive (VAR) model and we propose to use this information to improve the accuracy of prediction. Our strategy involves a joint optimization procedure over the space of adjacency matrices and VAR matrices. On the adjacency matrix it takes into account both sparsity and low rank properties and on the VAR it encodes the sparsity. The analysis involves oracle inequalities that illustrate the trade-offs in the choice of smoothing parameters when modeling the joint effect of sparsity and low rank. The estimate is computed efficiently using proximal methods, and evaluated through numerical experiments.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:abG-DnoFyZgC",
            "Publisher": "JMLR. org"
        },
        {
            "Title": "Analytical calculation of failure probabilities in dynamic fault trees including spare gates",
            "Publication year": 2010,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00516893/",
            "Abstract": "This paper focuses on one of the dynamic gates which are used in Dynamic Fault Trees (DFT): the Spare gate. We provide an algebraic model which allows to determine the structure function of DFTs with Spare gates from which qualitative analysis can be performed directly. We also provide a probabilistic model allowing to determine the failure probability of Spare gates without any restriction on the failure distribution for basic events.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:8k81kl-MbHgC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "On the Simulation of Offshore Oil Facilities at the System Level",
            "Publication year": 2014,
            "Publication url": "https://2014.international.conference.modelica.org/proceedings/html/submissions/ECP14096799_CostesGhidagliaMuguerraNielsenRiouSautVayatis.pdf",
            "Abstract": "Offshore oil facilities are complex systems that involve elaborate physics combined with stochastic aspects related, for instance, to failure risk or price variation. Although there exist many dedicated software tools to simulate flows typically encountered in oil exploitations, there is still no tool that combines physical (mostly engineering fluid mechanics) and risk simulation. Such a tool could be useful to engineers or decision makers for specification, design and study of offshore oil facilities. We present a first step towards the creation of such a tool. Our current simulator is based on new Modelica components to simulate fluid flows and on stochastic simulation at a higher level, for modeling risk and costs. Modelica components implement physical models for single and two-phase flows in some typical devices of an offshore field. The risk simulation uses Markov chains and statistical indicators to assess performance and resilience of the system over several months or years of operation.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:NhqRSupF_l8C",
            "Publisher": "Linköping University Electronic Press"
        },
        {
            "Title": "Subsampling of multivariate time-vertex graph signals",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8902836/",
            "Abstract": "This article presents a new approach for processing and subsampling multivariate time-vertex graph signals. The main idea is to model the relationships within each dimension (time, space, feature space) with different graphs and to merge these structures. A new technique based on tensor formalism is provided, which aims to identify the frequency support of the graph signal in order to preserve its content after subsampling. Results are provided on real EEG data for data interpolation and reconstruction.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Avancées récentes dans le domaine de l'apprentissage d'ordonnancements",
            "Publication year": 2011,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=24318457",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An SEAIR model with personalised risk prediction scores and application to the Covid-19 epidemic",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=13075478679967599854&hl=en&oi=scholarr",
            "Abstract": "The aim of the present work is to provide an SEAIR framework which takes a personalised risk prediction score as an additional input. Each individual is categorised depending on his actual status with respect to the disease-mild or severe symptoms-, and the level of risk predicted-low or high. This idea leads to a 4-fold extension of the ODE model in classical SEAIR. This model offers the possibility for policy-makers to explore differentiated containment strategies, by varying sizes for the low risk segment and varying dates for ‘progressive release’of the population, while taking into account the discriminative capacity of the risk score through its AUC. Differential contact rates for low-risk/high-risk compartments are also included in the model. The demo allows to select contact rates and time-depending exit strategies. The hardcoded parameters correspond to the data for the Covid-19 epidemic in France, and the risk …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Bayes-risk consistency of boosting methods",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.16.3060",
            "Abstract": "This paper attempts to fill in the theoretical vacuum about consistency of boosting methods, and proposes elements of explanation for their efficiency in practice. We combine known techniques for deriving margin-based bounds with some new results to explain under which conditions minimizing a cost functional conducts to the Bayes risk, at least asymptotically. For previous work on Bayes risk consistency, we refer to Breiman [9], Bühlmann and Yu [11], Jiang [22],[23], Mannor and Meir [26], Mannor, Meir and Mendelson [27].",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "[Consistency in Boosting]: Rejoinder",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=2493969124227416183&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Institute of Mathematical Statistics"
        },
        {
            "Title": "Ranking the best instances",
            "Publication year": 2007,
            "Publication url": "https://www.jmlr.org/papers/volume8/clemencon07a/clemencon07a.pdf",
            "Abstract": "We formulate a local form of the bipartite ranking problem where the goal is to focus on the best instances. We propose a methodology based on the construction of real-valued scoring functions. We study empirical risk minimization of dedicated statistics which involve empirical quantiles of the scores. We first state the problem of finding the best instances which can be cast as a classification problem with mass constraint. Next, we develop special performance measures for the local ranking problem which extend the Area Under an ROC Curve (AUC) criterion and describe the optimal elements of these new criteria. We also highlight the fact that the goal of ranking the best instances cannot be achieved in a stage-wise manner where first, the best instances would be tentatively identified and then a standard AUC criterion could be applied. Eventually, we state preliminary statistical results for the local ranking problem.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:2osOgNQ5qMEC",
            "Publisher": "JMLR. org"
        },
        {
            "Title": "Generalization error bounds for aggregation by mirror descent with averaging",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00083573/",
            "Abstract": "Archive ouverte HAL - Generalization error bounds for aggregation by mirror descent with \naveraging Accéder directement au contenu Accéder directement à la navigation Toggle \nnavigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data \nDocumentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org \nSupport hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline \nPar année de publication Par structure de recherche Les portails de l'archive Recherche \nDocumentation hal-00083573, version 1 Communication dans un congrès Generalization error \nbounds for aggregation by mirror descent with averaging N. Vayatis 1 AB Tsybakov 1 AB Juditsky \nAV Nazin Détails 1 LPMA - Laboratoire de Probabilités et Modèles Aléatoires Type de document \n: Communication dans un congrès Domaine : Mathématiques [math] / Probabilités [.PR:…",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "Stochastic process bandits: Upper confidence bounds algorithms via generic chaining",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1602.04976",
            "Abstract": "The paper considers the problem of global optimization in the setup of stochastic process bandits. We introduce an UCB algorithm which builds a cascade of discretization trees based on generic chaining in order to render possible his operability over a continuous domain. The theoretical framework applies to functions under weak probabilistic smoothness assumptions and also extends significantly the spectrum of application of UCB strategies. Moreover generic regret bounds are derived which are then specialized to Gaussian processes indexed on infinite-dimensional spaces as well as to quadratic forms of Gaussian processes. Lower bounds are also proved in the case of Gaussian processes to assess the optimality of the proposed algorithm.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Local Assessment of Statokinesigram Dynamics in Time: An in-Depth Look at the Scoring Algorithm",
            "Publication year": 2019,
            "Publication url": "https://www.ipol.im/pub/art/2019/251/",
            "Abstract": "In this work we discuss the multidimensional scoring approach proposed by Bargiotas and al.[I. Bargiotas, J. Audiffren, N. Vayatis, PP. Vidal, S. Buffat, AP Yelnik and Damien Ricard, On the importance of local dynamics in statokinesigram: a multivariate approach for postural control evaluation in elderly, PloS one, 13 (2018)] which locally characterizes statokinesigrams-the trajectory of the center of pressure, which is highly correlated with static balance quality-on small time intervals, or blocks. This approach highlights the local dynamics of the trajectories, and we show that the resulting characterization can be used to provide a global score in order to evaluate the postural control. We evaluate our approach using the statokinesigram of 126 community-dwelling elderly, and show that it provides an efficient tool to discriminate between fallers and non-fallers.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sloshing in the LNG shipping industry: risk modelling through multivariate heavy-tail analysis",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1312.0020",
            "Abstract": "In the liquefied natural gas (LNG) shipping industry, the phenomenon of sloshing can lead to the occurrence of very high pressures in the tanks of the vessel. The issue of modelling or estimating the probability of the simultaneous occurrence of such extremal pressures is now crucial from the risk assessment point of view. In this paper, heavy-tail modelling, widely used as a conservative approach to risk assessment and corresponding to a worst-case risk analysis, is applied to the study of sloshing. Multivariate heavy-tailed distributions are considered, with Sloshing pressures investigated by means of small-scale replica tanks instrumented with d >1 sensors. When attempting to fit such nonparametric statistical models, one naturally faces computational issues inherent in the phenomenon of dimensionality. The primary purpose of this article is to overcome this barrier by introducing a novel methodology. For d-dimensional heavy-tailed distributions, the structure of extremal dependence is entirely characterised by the angular measure, a positive measure on the intersection of a sphere with the positive orthant in Rd. As d increases, the mutual extremal dependence between variables becomes difficult to assess. Based on a spectral clustering approach, we show here how a low dimensional approximation to the angular measure may be found. The nonparametric method proposed for model sloshing has been successfully applied to pressure data. The parsimonious representation thus obtained proves to be very convenient for the simulation of multivariate heavy-tailed distributions, allowing for the implementation of Monte-Carlo simulation schemes …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effects of bilateral stimulation of the subthalamic nucleus in Parkinson's disease with and without REM sleep behaviour disorder",
            "Publication year": 2019,
            "Publication url": "https://jnnp.bmj.com/content/90/12/1310.abstract",
            "Abstract": "Although rapid eye movement sleep behaviour disorder (RBD) in Parkinson’s disease (PD) is associated with increased non-motor symptoms, its impact on the deep brain stimulation (DBS) outcome remains unclear. This is the first study to compare the post-DBS outcome between PD patients with RBD (PD-RBD+) and without (PD-RBD-).We analysed data from PD patients who were treated with bilateral DBS in the nucleus subthalamicus. Assessments included night-polysomnography (only pre-DBS), and motor and non-motor assessments pre-DBS and post-DBS.Among 50 PD patients (29 males, mean age 62.5 years, 11.8 mean PD years), 24 (48%) had RBD. Pre-DBS, the two groups were equal in respect to sociodemographic features, disease duration and PD medications. A multivariate analysis showed that the clinical profile linked to motor, non-motor and quality of life features …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:ILKRHgRFtOwC",
            "Publisher": "BMJ Publishing Group Ltd"
        },
        {
            "Title": "Global optimization of lipschitz functions",
            "Publication year": 2017,
            "Publication url": "http://proceedings.mlr.press/v70/malherbe17a.html",
            "Abstract": "The goal of the paper is to design sequential strategies which lead to efficient optimization of an unknown function under the only assumption that it has a finite Lipschitz constant. We first identify sufficient conditions for the consistency of generic sequential algorithms and formulate the expected minimax rate for their performance. We introduce and analyze a first algorithm called LIPO which assumes the Lipschitz constant to be known. Consistency, minimax rates for LIPO are proved, as well as fast rates under an additional Hölder like condition. An adaptive version of LIPO is also introduced for the more realistic setup where Lipschitz constant is unknown and has to be estimated along with the optimization. Similar theoretical guarantees are shown to hold for the adaptive LIPO algorithm and a numerical assessment is provided at the end of the paper to illustrate the potential of this strategy with respect to state-of-the-art methods over typical benchmark problems for global optimization.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:UHK10RUVsp4C",
            "Publisher": "PMLR"
        },
        {
            "Title": "A Compartmental Epidemiological Model Applied to the Covid-19 Epidemic",
            "Publication year": 2021,
            "Publication url": "http://www.ipol.im/pub/art/2021/323/",
            "Abstract": "The objective of this work is to provide a sophisticated but accessible compartmental epidemic model. Our algorithm is highly inspired from the compartmental model developed by Sofonea and al. in 2020. This model has been used as a reference for several working groups in France during the Covid-19 crisis. Each individual is allocated to a compartment according to her age, her current state with respect to the disease, as well as the length of time she has been in that state. The model then reproduces the mechanisms of transition from one state to another: mathematically, this translates into a system of recurrence relations. It captures how much individuals interact with one another through a parameter that estimates compliance with hygiene measures and lifestyle habits. The present work aims to make the model implementation fully transparent as well as the corresponding code available and give control to users so that they are able to test the model in total transparency. Focus has been put on reproducibility and explanation of the various parameters. The hard-coded parameters correspond to the data for the Covid-19 epidemic in France.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian Feature Discovery for Predictive Maintenance",
            "Publication year": 2021,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03154496/",
            "Abstract": "This paper considers predictive maintenance, which is the task of predicting rare and anomalous events (typically, system failures) using event logs data, which are series of timestamped symbolic codes emitted at regular or irregular intervals by a monitored system. Our objective is to find small sets of codes (called itemsets or patterns) that occur shortly before failures. Current prediction methods either produce patterns at a high computational cost or resort to kernel approaches which are often difficult to interpret. We introduce Bayesian Pattern Feature Discovery (BPFD), a new generic algorithm for pattern discovery. Our method, based on a pattern mining technique, produces informative and explainable features and is computationally efficient. The performance of BPFD is highlighted on real-world data sets, showing that enriching the feature space with the discovered patterns improves significantly the prediction power of a broad range of predictors and offers useful insight on the predictive maintenance task.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Partial network immunization in Continuous-Time Information Cascades",
            "Publication year": 2017,
            "Publication url": "https://core.ac.uk/download/pdf/148338502.pdf#page=128",
            "Abstract": "Studying the way in which diffusion processes evolve in networks is fundamental for further understanding such complex and dynamic phenomena. In particular, being able to predict the number of nodes that will be reached at the end of the spread when that starts from a known set of initial infection seeds (ie seeds’ influence) is of broad interest. Taking preparatory measures by acting on the network, so as to reduce the reach of a possible future diffusion, is a core administration problem. Traditionally, that has been studied as a way to improve public healthcare (eg through vaccination), recently though it has attracted a lot of attention due to the concerns raised by cases of malicious information propagation in social networks (eg fake news, rumors). In the existing literature the role of the spectral radius of the adjacency matrix representing the underlying network has been largely highlighted as a quantity tightly connected with the epidemic threshold over which the reach of the diffusion explodes and becomes comparable with the network size [8, 4, 1]. Various studies have been presented for virus propagation models and influence maximization [10, 6, 5]. In this paper we present a brief overview of our recent work on partial node immunization in Continuous-Time Information Cascade Model (CT IC)[7]. CT IC [2] is a stochastic model allowing propagation rates along edges to vary in time. Relying on previous work, we use the concept of Hazard radius introduced in [4], that is highly correlated to the influence and helps us in deriving upper bounds for the influence under the CT IC. We subsequently develop the NetShape strategy that enjoys a …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonparametric markovian learning of triggering kernels for mutually exciting and mutually inhibiting multivariate hawkes processes",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44851-9_11",
            "Abstract": "In this paper, we address the problem of fitting multivariate Hawkes processes to potentially large-scale data in a setting where series of events are not only mutually-exciting but can also exhibit inhibitive patterns. We focus on nonparametric learning and propose a novel algorithm called MEMIP (Markovian Estimation of Mutually Interacting Processes) that makes use of polynomial approximation theory and self-concordant analysis in order to learn both triggering kernels and base intensities of events. Moreover, considering that N historical observations are available, the algorithm performs log-likelihood maximization in O(N) operations, while the complexity of non-Markovian methods is in O(N 2). Numerical experiments on simulated data, as well as real-world data, show that our method enjoys improved prediction performance when compared to state-of-the art methods like MMEL and …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Nonparametric Estimation of the Precision-Recall Curve",
            "Publication year": 2009,
            "Publication url": "https://pdfs.semanticscholar.org/1895/f82bd917d3b4a18ce05834acb2542fc0947f.pdf",
            "Abstract": "Nonparametric Estimation of the Precision-Recall Curve Page 1 Nonparametric Estimation of the \nPrecision-Recall Curve Nicolas Vayatis (ENS Cachan, France) ICML - June 2009 Joint work with \nStéphan Clémençon (Telecom ParisTech) Page 2 Context Problem: Bipartite ranking Assume: \nwe have designed a scoring rule for ranking new data Issue: Performance assessment Choice \nof a performance measure: Precision and Recall Page 3 Variability of a ranking performance \nmeasure Page 4 Confidence bands for Precision-Recall curves? Page 5 Previous work Some \nwork on estimation of the ROC curve: ► [Hsieh and Turnbull, AOS 1996] ► [Macskassy \nand Provost, ECAI 2004], and [M., P., and Rosset, ICML 2005] ► [Bertail, Clémençon, and \nVayatis, NIPS 2008] ► [Horvath, Horvath, and Zhou, JSPI 2008] Page 6 Previous work \nSome work on estimation of the ROC curve: ► [Hsieh and Turnbull, AOS 1996] ► [and , ]…",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An opinion paper on the maintenance of robustness: towards a multimodal and intergenerational approach using digital twins",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/agm2.12115",
            "Abstract": "The increasing number of frail elderly people in our aging society is becoming problematic: about 11% of community‐dwelling older persons are frail and another 42% are pre‐frail. Consequently, a major challenge in the coming years will be to test people over the age of 60 years to detect pre‐frailty at the earliest stage and to return them to robustness using the targeted interventions that are becoming increasingly available. This challenge requires individual longitudinal monitoring (ILM) or follow‐up of community‐dwelling older persons using quantitative approaches. This paper briefly describes an effort to tackle this challenge. Extending the detection of the pre‐frail stages to other population groups is also suggested. Appropriate algorithms have been used to begin the tracing of faint physiological signals in order to detect transitions from robustness to pre‐frailty states and from pre‐frailty to frailty states. It is …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Revealing posturographic features associated with the risk of falling in patients with parkinsonian syndromes via machine learning",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1907.06614",
            "Abstract": "Falling in Parkinsonian syndromes (PS) is associated with postural instability and consists a common cause of disability among PS patients. Current posturographic practices record the body's center-of-pressure displacement (statokinesigram) while the patient stands on a force platform. Statokinesigrams, after appropriate signal processing, can offer numerous posturographic features, which however challenges the efforts for valid statistics via standard univariate approaches. In this work, we present the ts-AUC, a non-parametric multivariate two-sample test, which we employ to analyze statokinesigram differences among PS patients that are fallers (PSf) and non-fallers (PSNF). We included 123 PS patients who were classified into PSF or PSNF based on clinical assessment and underwent simple Romberg Test (eyes open/eyes closed). We analyzed posturographic features using both multiple testing with p-value adjustment and the ts-AUC. While the ts-AUC showed significant difference between groups (p-value = 0.01), multiple testing did not show any such difference. Interestingly, significant difference between the two groups was found only using the open-eyes protocol. PSF showed significantly increased antero-posterior movements as well as increased posturographic area, compared to PSNF. Our study demonstrates the superiority of the ts-AUC test compared to standard statistical tools in distinguishing PSF and PSNF in the multidimensional feature space. This result highlights more generally the fact that machine learning-based statistical tests can be seen as a natural extension of classical statistical approaches and should be …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust Kernel Density Estimation with Median-of-Means principle",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2006.16590",
            "Abstract": "In this paper, we introduce a robust nonparametric density estimator combining the popular Kernel Density Estimation method and the Median-of-Means principle (MoM-KDE). This estimator is shown to achieve robustness to any kind of anomalous data, even in the case of adversarial contamination. In particular, while previous works only prove consistency results under known contamination model, this work provides finite-sample high-probability error-bounds without a priori knowledge on the outliers. Finally, when compared with other robust kernel estimators, we show that MoM-KDE achieves competitive results while having significant lower computational complexity.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overlaying classifiers: a practical approach for optimal ranking",
            "Publication year": 2009,
            "Publication url": "https://hal.telecom-paris.fr/hal-02107204",
            "Abstract": "ROC curves are one of the most widely used displays to evaluate performance of scoring functions. In the paper, we propose a statistical method for directly optimizing the ROC curve. The target is known to be the regression function up to an increasing transformation and this boils down to recovering the level sets of the latter. We propose to use classifiers obtained by empirical risk minimization of a weighted classification error and then to construct a scoring rule by overlaying these classifiers. We show the consistency and rate of convergence to the optimal ROC curve of this procedure in terms of supremum norm and also, as a byproduct of the analysis, we derive an empirical estimate of the optimal ROC curve.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Détection automatique des pas à partir de capteurs inertiels pour la quantification de la marche en consultation",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0987705315000866",
            "Abstract": "L’extraction automatique des caractéristiques de la marche est utile pour quantifier objectivement les troubles de la locomotion et étudier l’évolution de diverses maladies ORL, neurologiques ou orthopédiques. On utilise pour cela des centrales inertielles sans fil enregistrant les accélérations et les vitesses angulaires. Le but est d’extraire automatiquement à partir des signaux enregistrés le début et la fin de chaque pas. Une nouvelle approche est proposée afin de se soumettre aux niveaux d’exigence et de précision liés au contexte médical et de s’adapter à un large spectre de pathologies.Soixante-quatorze sujets (vingt-trois sujet sains et cinquante-et-un sujets présentant des troubles orthopédiques au genou, à la hanche ou à la cheville) ont effectué plusieurs allers/retours durant 10 m à vitesse de confort en portant un capteur inertiel attaché à chaque pied. Les signaux ont été …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Nonparametric scoring methods as a support decision tool for medical diagnosis The TreeRank algorithm and its variants",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=15526123438522273344&hl=en&oi=scholarr",
            "Abstract": "In this paper we propose to use nonparametric scoring methods based on ranking trees as a support decision tool for medical diagnosis. The proposed algorithms enable to order cohorts of patients according to the risk level of developing a particular disease. The aim of this paper is to illustrate the potential of various algorithms using ranking trees, particularly the variants with bagging-type aggregation of these trees, through numerical experiments. The main algorithms presented are: LeafRank (splitting rule), TreeRank (recursive partitioning for ranking) and Ranking Forests (agreggation of ranking trees), as well as the main state-of-the-art methods for bipartite ranking. Numerical experiments based on both artificial and real data sets are provided to discuss the performances of these algorithms-in terms of ROC curves and their summaries (AUC or local AUC)-but also their properties with respect to interpretability and robustness.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality Quantification of Evaluated Cross Section Covariances",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0090375214007121",
            "Abstract": "Presently, several methods are used to estimate the covariance matrix of evaluated nuclear cross sections. Because the resulting covariance matrices can be different according to the method used and according to the assumptions of the method, we propose a general and objective approach to quantify the quality of the covariance estimation for evaluated cross sections. The first step consists in defining an objective criterion. The second step is computation of the criterion. In this paper the Kullback-Leibler distance is proposed for the quality quantification of a covariance matrix estimation and its inverse. It is based on the distance to the true covariance matrix. A method based on the bootstrap is presented for the estimation of this criterion, which can be applied with most methods for covariance matrix estimation and without the knowledge of the true covariance matrix. The full approach is illustrated on the 85Rb …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Algorithmic Learning Theory: 23rd International Conference, ALT 2012, Lyon, France, October 29-31, 2012, Proceedings",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=To25BQAAQBAJ&oi=fnd&pg=PR2&dq=info:sffduajRATcJ:scholar.google.com&ots=-SI8y-9mek&sig=imMfr7XyUHy9sfZ4g8oThDNb5B4",
            "Abstract": "This book constitutes the refereed proceedings of the 23rd International Conference on Algorithmic Learning Theory, ALT 2012, held in Lyon, France, in October 2012. The conference was co-located and held in parallel with the 15th International Conference on Discovery Science, DS 2012. The 23 full papers and 5 invited talks presented were carefully reviewed and selected from 47 submissions. The papers are organized in topical sections on inductive inference, teaching and PAC learning, statistical learning theory and classification, relations between models and data, bandit problems, online prediction of individual sequences, and other models of online learning.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:D_sINldO8mEC",
            "Publisher": "Springer"
        },
        {
            "Title": "The complementary role of activity context in the mental workload evaluation of helicopter pilots: a multi-tasking learning approach",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-14273-5_13",
            "Abstract": "Manifestations of increasing mental demands may be related to the task’s context. Additionally, to fundamental physiological changes, the workload may be also characterized sometimes by contextual task-related elements. We aimed to investigate the workload of helicopter pilots and develop predictive models related to the tasks’ context. Eight pilots completed an unknown case-scenario (~1 h) in a helicopter simulator. The scenario included changing mission during flight and receiving/transferring an injured subject to the near hospital. We selected interesting scenario’s periods/“tasks” (e.g., searching hospital, urgent landing) where pilots gave oral evaluations (0–100). Performed tasks had various contexts. We developed a multitasking learning approach to “pool together” all tasks because some of them, although different, may carry useful information about others, so they should neither be merged nor …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Adaptive planification in active 3d object recognition for many classes of objects",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.387.7339&rep=rep1&type=pdf",
            "Abstract": "This paper focuses on active 3D object recognition by an autonomous visual agent in an unknown environment. In this problem, the central issue concerns the choice of the next viewpoint in the dynamical exploration of the object given the information collected until the present state of the agent. Numerous exploration strategies have been proposed and they were shown to outperform random viewpoint planification. Some are based on the maximization of an entropy measure which accounts for the dissimilarity between objects as in [3, 1], or they attempt to find the viewpoint the most favorable in terms of discrimination ability [4]. An agent-based approach was also proposed in the context of reinforcement learning framework [2]. The latter approach accounts for the interaction between the agent and the environment through the update of a planning function. However, these strategies are not robust with respect to the number of classes objects and they may even turn to be infeasible when there are many distinct classes. In the present paper, we propose to unify both approaches in order to deal with a very large number of classes of objects. We define a planning function based on an entropy measure which is adaptive in two senses:(i) it takes into account the knowledge acquired by the agent until its present state, and (ii) it progressively filters the classes with high confidence. We present simulation results for our adaptive exploration strategy on a car image database. These results illustrate the impact on performance with respect to both the number of classes and the duration of the exploration process.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ranking the Best Instances",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=6997164906517515857&hl=en&oi=scholarr",
            "Abstract": "We formulate a local form of the bipartite ranking problem where the goal is to focus on the best instances. We propose a methodology based on the construction of real-valued scoring functions. We study empirical risk minimization of dedicated statistics which involve empirical quantiles of the scores. We rst state the problem of nding the best instances which can be cast as a classi cation problem with mass constraint. Next, we develop special performance measures for the local ranking problem which extend the Area Under an ROC Curve (AUC/AROC) criterion and describe the optimal elements of these new criteria. We also highlight the fact that the goal of ranking the best instances cannot be achieved in a stage-wise manner where rst, the best instances would be tentatively identi ed and then a standard AUC criterion could be applied. Eventually, we state preliminary statistical results for the local ranking problem.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anomaly Ranking in a High Dimensional Space: The Unsupervised TreeRank Algorithm",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24211-8_2",
            "Abstract": "Ranking unsupervised data in a multivariate feature space  , d ≥ 1 by degree of abnormality is of crucial importance in many applications (e.g., fraud surveillance, monitoring of complex systems/infrastructures such as energy networks or aircraft engines, system management in data centers). However, the learning aspect of unsupervised ranking has only received attention in the machine-learning community in the past few years. The Mass-Volume (MV) curve has been recently introduced in order to evaluate the performance of any scoring function   with regard to its ability to rank unlabeled data. It is expected that relevant scoring functions will induce a preorder similar to that induced by the density function f(x) of the (supposedly continuous) probability distribution of the statistical population under study. As far as we know, there is no efficient algorithm to build a scoring function from …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Remark on “Recursive Aggregation of Estimators by the Mirror Descent Algorithm with Averaging” published in Probl. Peredachi Inf., 2005, no. 4",
            "Publication year": 2006,
            "Publication url": "http://www.mathnet.ru/eng/ppi57",
            "Abstract": "AB Yuditskii, AV Nazin, AB Tsybakov, N. Vayatis, “Remark on “Recursive Aggregation of \nEstimators by the Mirror Descent Algorithm with Averaging” published in Probl. Peredachi Inf., \n2005, no. 4”, Probl. Peredachi Inf., 42:3 (2006), 109; Problems Inform. Transmission, 42:3 (2006), \n262 Problemy Peredachi Informatsii RUS ENG JOURNALS PEOPLE ORGANISATIONS \nCONFERENCES SEMINARS VIDEO LIBRARY PACKAGE AMSBIB General information Latest \nissue Archive Impact factor Guidelines for authors Search papers Search references RSS \nLatest issue Current issues Archive issues What is RSS Probl. Peredachi Inf.: Year: Volume: \nIssue: Page: Find Your organisation: Google Personal entry: Login: Password: Save password \nEnter Forgotten password? Register Powered by MathJax Probl. Peredachi Inf., 2006, Volume \n42, Issue 3, Page 109 (Mi ppi57) Remark on “Recursive Aggregation of Estimators by the ” …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:t6usbXjVLHcC",
            "Publisher": "Russian Academy of Sciences, Branch of Informatics, Computer Equipment and Automatization"
        },
        {
            "Title": "Applications of concentration inequalities for statistical scoring and ranking problems",
            "Publication year": 2014,
            "Publication url": "https://www.esaim-proc.org/articles/proc/abs/2014/01/proc144405/proc144405.html",
            "Abstract": "In this overview paper, we consider the scoring approach applied to the ranking problem from a nonparametric perspective. We first focus on the problem of ROC curve optimization in terms of description of optimal elements. Then, we introduce summaries of this function-valued description of performance which are related to well-known statistics that are of higher order compared to averages of i.i.d. random variables. Eventually, we consider consistency and fast convergence results that rely on applications of concentration inequalities which involve U- and R-processes. This is a joint work with Stéphan Clémençon, Marine Depecker, Gábor Lugosi, and Sylvain Robbiano.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "ruptures: change point detection in Python",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1801.00826",
            "Abstract": "ruptures is a Python library for offline change point detection. This package provides methods for the analysis and segmentation of non-stationary signals. Implemented algorithms include exact and approximate detection for various parametric and non-parametric models. ruptures focuses on ease of use by providing a well-documented and consistent interface. In addition, thanks to its modular structure, different algorithms and models can be connected and extended within this package.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:tKAzc9rXhukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Kriging approach for the experimental cross-section covariances estimation",
            "Publication year": 2013,
            "Publication url": "https://cea-proceedings.edpsciences.org/articles/epjconf/abs/2013/03/epjconf_wond2013_07003/epjconf_wond2013_07003.html",
            "Abstract": "In the classical use of a generalized χ2 to determine the evaluated cross section uncertainty, we need the covariance matrix of the experimental cross sections. The usual propagation error method to estimate the covariances is hardly usable and the lack of data prevents from using the direct empirical estimator. We propose in this paper to apply the kriging method which allows to estimate the covariances via the distances between the points and with some assumptions on the covariance matrix structure. All the results are illustrated with the 2555Mn nucleus measurements.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:N5tVd3kTz84C",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "The golden chain-Rejoinder",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=752261153089757472&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:-_dYPAW6P2MC",
            "Publisher": "INST MATHEMATICAL STATISTICS"
        },
        {
            "Title": "Offline detection of change-points in the mean for stationary graph signals.",
            "Publication year": 2021,
            "Publication url": "https://proceedings.mlr.press/v130/concha-duarte21a.html",
            "Abstract": "This paper addresses the problem of segmenting a stream of graph signals: we aim to detect changes in the mean of the multivariate signal defined over the nodes of a known graph. We propose an offline algorithm that relies on the concept of graph signal stationarity and allows the convenient translation of the problem from the original vertex domain to the spectral domain (Graph Fourier Transform), where it is much easier to solve. Although the obtained spectral representation is sparse in real applications, to the best of our knowledge this property has not been much exploited in the existing related literature. Our main contribution is a change-point detection algorithm that adopts a model selection perspective, which takes into account the sparsity of the spectral representation and determines automatically the number of change-points. Our detector comes with a proof of a non-asymptotic oracle inequality …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:sNmaIFBj_lkC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Refined exponential rates in Vapnik–Chervonenkis inequalities",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0764444201018602",
            "Abstract": "Vapnik–Chervonenkis bounds on speeds of convergence of empirical means to their expectations have been continuously improved over the years. The result obtained by M. Talagrand in 1994 [11] seems to provide the final word as far as universal bounds are concerned. However, for fixed families of underlying probability distributions, the exponential rate in the deviation term can be fairly improved by the more adequate Cramér transform, as shown by theorems of large deviations.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:aqlVkmm33-oC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Prediction and optimization of wave energy converter arrays using a machine learning approach",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960148116304931",
            "Abstract": "Optimization of the layouts of arrays of wave energy converters (WECs) is a challenging problem. The hydrodynamic analysis and performance estimation of such systems are performed using semi-analytical and numerical models such as the boundary element method. However, the analysis of an array of such converters becomes computationally expensive, and the computational time increases rapidly with the number of devices in the system. As such determination of optimal layouts of WECs in arrays becomes extremely difficult. In this paper, a methodology involving multiple optimization strategies is presented to arrive at the solution to the complex problem. The approach includes a statistical emulator to predict the performance of the WECs in arrays, followed by an innovative active learning strategy to simultaneously explore and focus in regions of interest of the problem, and finally a genetic algorithm to …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Tight bounds for influence in diffusion networks and application to bond percolation and epidemiology",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1407.4744",
            "Abstract": "In this paper, we derive theoretical bounds for the long-term influence of a node in an Independent Cascade Model (ICM). We relate these bounds to the spectral radius of a particular matrix and show that the behavior is sub-critical when this spectral radius is lower than . More specifically, we point out that, in general networks, the sub-critical regime behaves in  where  is the size of the network, and that this upper bound is met for star-shaped networks. We apply our results to epidemiology and percolation on arbitrary networks, and derive a bound for the critical value beyond which a giant connected component arises. Finally, we show empirically the tightness of our bounds for a large family of networks.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bagging ranking trees",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5381367/",
            "Abstract": "It has recently been shown how to extend successfully decision tree induction algorithms to bipartite ranking. The major drawbacks of tree-based prediction rules, instability and lack of smoothness namely, are however exacerbated by the global nature of the ranking problem. It is the purpose of this paper to show how to adapt the ¿bagging¿ approach, originally introduced in the classification/regression context, in order to improve the performance of tree-based ranking rules with regard to these disadvantages. Whereas the notion of majority voting scheme applies to a local prediction problem such as classification or regression in a natural fashion, it is much less straightforward to determine how to average the orderings predicted by many ranking trees. Here we propose various strategies for bagging tree ranking rules inspired by recent advances in the field of rank aggregation for the Web. Strong empirical …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fall detection using smart floor sensor and supervised learning",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8037597/",
            "Abstract": "Falls are a major risk for elderly people's health and independence. Fast and reliable fall detection systems can improve chances of surviving the accident and coping with its physical and psychological consequences. Recent research has come up with various solutions, all suffering from significant drawbacks, one of them being the intrusiveness into patient's life. This paper proposes a novel fall detection monitoring system based on a sensitive floor sensor made out of a piezoelectric material and a machine learning approach. The detection is done by a combination between a supervised Random Forest and an aggregation of its output over time. The database was made using acquisitions from 28 volunteers simulating falls and other behaviours. Unlike existent fall detection systems, our solution offers the advantages of having a passive sensor (no power supply is needed) and being completely unobtrusive …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ranking and empirical minimization of U-statistics",
            "Publication year": 2008,
            "Publication url": "https://projecteuclid.org/journals/annals-of-statistics/volume-36/issue-2/----Custom-HTML----Ranking/10.1214/009052607000000910.short",
            "Abstract": "The problem of ranking/ordering instances, instead of simply classifying them, has recently gained much attention in machine learning. In this paper we formulate the ranking problem in a rigorous statistical framework. The goal is to learn a ranking rule for deciding, among two instances, which one is “better,” with minimum ranking risk. Since the natural estimates of the risk are of the form of a U-statistic, results of the theory of U-processes are required for investigating the consistency of empirical risk minimizers. We establish, in particular, a tail inequality for degenerate U-processes, and apply it for showing that fast rates of convergence may be achieved under specific noise assumptions, just like in classification. Convex risk minimization methods are also studied.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Institute of Mathematical Statistics"
        },
        {
            "Title": "A data set for the study of human locomotion with inertial measurements units",
            "Publication year": 2019,
            "Publication url": "http://www.ipol.im/pub/art/2019/265/",
            "Abstract": "This article thoroughly describes a data set of 1020 multivariate gait signals collected with two inertial measurement units, from 230 subjects undergoing a fixed protocol: standing still, walking 10 m, turning around, walking back and stopping. In total, 8.5~ h of gait time series are distributed. The measured population was composed of healthy subjects as well as patients with neurological or orthopedic disorders. An outstanding feature of this data set is the amount of signal metadata that are provided. In particular, the start and end time stamps of more than 40,000 footsteps are available, as well as a number of contextual information about each trial. This exact data set was used in [Oudre et al., Template-based step detection with inertial measurement units, Sensors 18, 2018] to design and evaluate a step detection procedure.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A machine learning approach to the analysis of wave energy converters",
            "Publication year": 2015,
            "Publication url": "https://asmedigitalcollection.asme.org/OMAE/proceedings-abstract/OMAE2015/V009T09A019/280066",
            "Abstract": "The hydrodynamic analysis and estimation of the performance of wave energy converters (WECs) is generally performed using semi-analytical/numerical models. Commercial boundary element codes are widely used in analyzing the interactions in arrays comprising of wave energy conversion devices. However, the analysis of an array of such converters becomes computationally expensive, and the computational time increases as the number of devices in the system is increased. As such determination of optimal layouts of WECs in arrays becomes extremely difficult. In this study, an innovative active experimental approach is presented to predict the behaviour of theWECs in arrays. The input variables are the coordinates of the center of the wave energy converters. Simulations for training examples and validation are performed for an array of OscillatingWave Surge Converters, using the mathematical model of …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:wbdj-CoPYUoC",
            "Publisher": "American Society of Mechanical Engineers"
        },
        {
            "Title": "Revealing posturographic profile of patients with Parkinsonian syndromes through a novel hypothesis testing framework based on machine learning",
            "Publication year": 2021,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0246790",
            "Abstract": "Falling in Parkinsonian syndromes (PS) is associated with postural instability and consists a common cause of disability among PS patients. Current posturographic practices record the body’s center-of-pressure displacement (statokinesigram) while the patient stands on a force platform. Statokinesigrams, after appropriate processing, can offer numerous posturographic features. This fact, although beneficial, challenges the efforts for valid statistics via standard univariate approaches. In this work, 123 PS patients were classified into fallers (PSF) or non-faller (PSNF) based on the clinical assessment, and underwent simple Romberg Test (eyes open/eyes closed). We developed a non-parametric multivariate two-sample test (ts-AUC) based on machine learning, in order to examine statokinesigrams’ differences between PSF and PSNF. We analyzed posturographic features using both multiple testing with p-value adjustment and ts-AUC. While ts-AUC showed significant difference between groups (p-value = 0.01), multiple testing did not agree with this result (eyes open). PSF showed significantly increased antero-posterior movements as well as increased posturographic area compared to PSNF. Our study highlights the superiority of ts-AUC compared to standard statistical tools in distinguishing PSF and PSNF in multidimensional space. Machine learning-based statistical tests can be seen as a natural extension of classical statistics and should be considered, especially when dealing with multifactorial assessments.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Données avec label binaire: avancées récentes dans le domaine de l'apprentissage statistique d'ordonnancements",
            "Publication year": 2010,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00596031/",
            "Abstract": "Données avec label binaire: avancées récentes dans le domaine de l'apprentissage \nstatistique d'ordonnancements - Institut Mines-Télécom Accéder directement au contenu \nAccéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL \nMédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org \nEpisciences.org Revues Documentation Sciencesconf.org Support IMT Archives Ouvertes : \nHAL - IMT HAL - hal.archives-ouvertes.fr Accueil Dépôt Consultation Par type de publication \nPar année de publication Par domaine Par laboratoire Par auteur Par collection Recherche \nServices Consulter les laboratoires connus de HAL hal-00596031, version 1 \nCommunication dans un congrès Données avec label binaire: avancées récentes dans le \ndomaine de l'apprentissage statistique d'ordonnancements S. Clémençon 1 Marine \nDepecker 1 N. Vayatis 2 Détails 1 LTCI - Laboratoire et l'…",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiparameter method for quantifying balance",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US20200187842A1/en",
            "Abstract": "The invention relates to a method for quantifying the balance of an individual to obtain a value representative of the balance of said individual, said method being implemented by a device comprising at least one data processing module connected to a storage means and said method comprising:",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Empirical Comparison of Learning Algorithms for Nonparametric Scoring",
            "Publication year": 2011,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00730434/",
            "Abstract": "The TreeRank algorithm was recently proposed as a scoring-based method based on recursive partitioning of the input space. This tree induction algorithm builds orderings by recursively optimizing the Receiver Operating Characteristic (ROC) curve through a one-step optimization procedure called LeafRank. One of the aim of this paper is the indepth analysis of the empirical performance of the variants of TreeRank/LeafRank method. Numerical experiments based on both artificial and real data sets are provided. Further experiments using resampling and randomization, in the spirit of bagging and random forests are developed and we show how they increase both stability and accuracy in bipartite ranking. Moreover, an empirical comparison with other efficient scoring algorithms such as RankBoost and RankSVM is presented on UCI benchmark data sets.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Étude descriptive des participants aux ateliers de prévention du\" bien vieillir atout âge\" à la Réunion [Poster]",
            "Publication year": 2019,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02530558/",
            "Abstract": "Étude descriptive des participants aux ateliers de prévention du \"bien vieillir atout âge\" à la \nRéunion [Poster] - Archive ouverte HAL Accéder directement au contenu Accéder \ndirectement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL \nListe des portails AURéHAL API Data Documentation Episciences.org Episciences.org \nRevues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les \nderniers dépôts Par type de publication Par discipline Par année de publication Par \nstructure de recherche Les portails de l'archive Recherche Documentation hal-02530558, \nversion 1 Poster Étude descriptive des participants aux ateliers de prévention du \"bien \nvieillir atout âge\" à la Réunion [Poster] F. Legrand JM Eychene A. Nicolai J. Audiffren C. \nCiman Armelle Klein 1 C. Labourdette L. Oudre N. Vayatis PP Vidal Frédéric Sandron 1 \nDétails 1 CEPED - UMR_D 196 - Centre population …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:HbR8gkJAVGIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recursive aggregation of estimators by the mirror descent algorithm with averaging",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s11122-006-0005-2",
            "Abstract": "We consider a recursive algorithm to construct an aggregated estimator from a finite number of base decision rules in the classification problem. The estimator approximately minimizes a convex risk functional under the ℓ1-constraint. It is defined by a stochastic version of the mirror descent algorithm which performs descent of the gradient type in the dual space with an additional averaging. The main result of the paper is an upper bound for the expected accuracy of the proposed estimator. This bound is of the order    with an explicit and small constant factor C, where M is the dimension of the problem and t stands for the sample size. A similar bound is proved for a more general setting, which covers, in particular, the regression model with squared loss.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:qjMakFHDy7sC",
            "Publisher": "Nauka/Interperiodica"
        },
        {
            "Title": "Adversarial weighting for domain adaptation in regression",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2006.08251",
            "Abstract": "We present a novel instance-based approach to handle regression tasks in the context of supervised domain adaptation under an assumption of covariate shift. The approach developed in this paper is based on the assumption that the task on the target domain can be efficiently learned by adequately reweighting the source instances during training phase. We introduce a novel formulation of the optimization objective for domain adaptation which relies on a discrepancy distance characterizing the difference between domains according to a specific task and a class of hypotheses. To solve this problem, we develop an adversarial network algorithm which learns both the source weighting scheme and the task in one feed-forward gradient descent. We provide numerical evidence of the relevance of the method on public data sets for regression domain adaptation through reproducible experiments.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:edDO8Oi4QzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sloshing in the shipping industry: risk modelling through multivariate heavy-tail analysis",
            "Publication year": 2012,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02286349/",
            "Abstract": "In the liquefied natural gas (LNG) shipping industry, the phenomenon of sloshing can lead to the occurrence of very high pressures in the tanks of the vessel. The issue of modelling or estimating the probability of the simultaneous occurrence of such extremal pressures is now crucial from the risk assessment point of view. In this paper, heavy-tail modelling, widely used as a conservative approach to risk assessment and corresponding to a worst-case risk analysis, is applied to the study of sloshing. Multivariate heavy-tailed distributions are considered, with Sloshing pressures investigated by means of small-scale replica tanks instrumented with d >1 sensors. When attempting to fit such nonparametric statistical models, one naturally faces computational issues inherent in the phenomenon of dimensionality. The primary purpose of this article is to overcome this barrier by introducing a novel methodology. For d-dimensional heavy-tailed distributions, the structure of extremal dependence is entirely characterised by the angular measure, a positive measure on the intersection of a sphere with the positive orthant in Rd. As d increases, the mutual extremal dependence between variables becomes difficult to assess. Based on a spectral clustering approach, we show here how a low dimensional approximation to the angular measure may be found. The nonparametric method proposed for model sloshing has been successfully applied to pressure data. The parsimonious representation thus obtained proves to be very convenient for the simulation of multivariate heavy-tailed distributions, allowing for the implementation of Monte-Carlo simulation schemes …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dicod: Distributed convolutional coordinate descent for convolutional sparse coding",
            "Publication year": 2018,
            "Publication url": "http://proceedings.mlr.press/v80/moreau18a.html",
            "Abstract": "In this paper, we introduce DICOD, a convolutional sparse coding algorithm which builds shift invariant representations for long signals. This algorithm is designed to run in a distributed setting, with local message passing, making it communication efficient. It is based on coordinate descent and uses locally greedy updates which accelerate the resolution compared to greedy coordinate selection. We prove the convergence of this algorithm and highlight its computational speed-up which is super-linear in the number of cores used. We also provide empirical evidence for the acceleration properties of our algorithm compared to state-of-the-art methods.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:fEOibwPWpKIC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Anomaly scoring/ranking in a high dimensional space: the Unsupervised TreeRank algorithm",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=12261849380619986619&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inégalités de Vapnik-Chervonenkis et mesures de complexité",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15531393012523671552&hl=en&oi=scholarr",
            "Abstract": "Dans la thèse, on se propose, d'une part, de raffiner les bornes de Vapnik-Chervonenkis de la déviation maximale, sur une famille d'ensembles, entre la moyenne empirique et son espérance, et, d'autre part, d'établir une méthode expérimentale pour établir des mesures effectives de la VC dimension. Le premier axe de recherche a été de préciser, de façon rigoureuse, les résultats classiques de Vapnik et Chervonenkis dans le cas où la distribution de probabilité sous-jacente est fixée. L'idée est de produire un taux exponentiel exact dans les vitesses de convergence, en utilisant des résultats de grandes déviations. En s' appuyant à la fois sur les idées combinatoires de Vapnik-Chervonenkis-Devroye et sur la méthode d'approximation de Pollard-Talagrand, on démontre un nouveau résultat améliorant de façon significative les bornes précédentes. Le deuxième axe de recherche porte sur la mise au point d'un protocole expérimental destiné à obtenir des valeurs empiriques de la VC dimension à travers des simulations informatiques. On identifie la queue de la distribution des déviations maximales à la formule exacte des bornes de VC. La méthode de l'échantillonnage préférentiel permet de traiter la simulation d'événements rares. On obtient alors le paramètre de complexité comme la pente d'un modèle de régression linéaire. On fournit notamment des intervalles de confiance sur cette mesure grâce à l'étude des problèmes de calibrage liés à l'estimation. Enfin, cette étude expérimentale est validée sur quelques exemples simples où l'on est conduit à considérer des éléments particuliers de la famille des ensembles qu'on désignera comme …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Remark on\" Recursive Aggregation of Estimators by the Mirror Descent Algorithm with Averaging\" published in Probl. Peredachi Inf., 2005, no. 4",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1134/S0032946006030094",
            "Abstract": "Remark on \"Recursive Aggregation of Estimators by the Mirror Descent Algorithm with \nAveraging\" published in Probl. Peredachi Inf., 2005, no. 4 | Problems of Information \nTransmission ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books \nSIGs Conferences People More Search ACM Digital Library SearchSearch Advanced \nSearch Problems of Information Transmission Periodical Home Latest Issue Archive \nAuthors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsProblems of \nInformation TransmissionVol. , No. Remark on \"Recursive Aggregation of Estimators by the \nMirror Descent Algorithm with Averaging\" published in Probl. Peredachi Inf., 2005, no. \narticle Remark on \"Recursive Aggregation of Estimators by the Mirror Descent Algorithm \nwith Averaging\" published in Probl. Peredachi Inf…",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:rO6llkc54NcC",
            "Publisher": "Plenum Press"
        },
        {
            "Title": "The warm-starting sequential selection problem and its multi-round extension",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1809.07299",
            "Abstract": "In the Sequential Selection Problem (SSP), immediate and irrevocable decisions need to be made as candidates randomly arrive for a job interview. Standard SSP variants, such as the well-known secretary problem, begin with an empty selection set (cold-start) and perform the selection process once over a single candidate set (single-round). In this paper we address these two limitations. First, we introduce the novel Warm-starting SSP (WSSP) setting which considers at hand a reference set, a set of previously selected items of a given quality, and tries to update optimally that set by (re-)assigning each job at most once. We adopt a cutoff-based approach to optimize a rank-based objective function over the final assignment of the jobs. In our technical contribution, we provide analytical results regarding the proposed WSSP setting, we introduce the algorithm Cutoff-based Cost Minimization (CCM) (and the low failures-CCM, which is more robust to high rate of resignations) that adapts to changes in the quality of the reference set thanks to the translation method we propose. Finally, we implement and test CCM in a multi-round setting that is particularly interesting for real-world application scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EpiBrainRad: an epidemiologic study of the neurotoxicity induced by radiotherapy in high grade glioma patients",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1186/s12883-015-0519-6",
            "Abstract": "Radiotherapy is one of the most important treatments of primary and metastatic brain tumors. Unfortunately, it can involve moderate to severe complications among which leukoencephalopathy is very frequent and implies cognitive deficits such as memory, attention and executive dysfunctions. However, the incidence of this complication is not well established and the risk factors and process are poorly understood. The main objective of the study is to improve knowledge on radio-induced leukoencephalopathy based on pluridisciplinar approaches combining cognitive, biologic, imagery and dosimetric investigations. The EpiBrainRad study is a prospective cohort study including newly diagnosed high grade gliomas patients treated by radiotherapy and concomitant-adjuvant temozolomide chemotherapy. Patients are included between their surgery and first day of radio-chemotherapy, and the follow-up lasts for 3 …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:XiVPGOgt02cC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "A method using pseudo-measurements and shrinkage for the estimation of cross section covariances",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0090375214001094",
            "Abstract": "In this paper a new way for the experimental cross section covariances estimation is proposed. The usual propagation error method to estimate the covariances is based on the Taylor expansion of the experimental cross section formula. However it is difficult to use in most cases and the lack of data prevents from using the direct empirical estimator. Thus an alternative method is presented which exploits a regression model of the experimental cross section to generate pseudo-measurements. Thereby this allows an estimation of experimental covariances and this estimation is then improved using shrinkage. This later improvement is pointed out on numerical examples with a toy model (whose quantities are all known) and the convenience of the method is illustrated on real cross-section data measurements.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Yoav Freund Mitsubishi Electric Research Laboratories 201 Broadway Cambridge, MA 02139 freund@ merl. com",
            "Publication year": 2004,
            "Publication url": "http://rob.schapire.net/papers/annstat-discuss-consistency.pdf",
            "Abstract": "The notion of a boosting algorithm was originally introduced by Valiant in the context of the “probably approximately correct”(PAC) model of learnability [19]. In this context boosting is a method for provably improving the accuracy of any “weak” classification learning algorithm. The first boosting algorithm was invented by Schapire [16] and the second one by Freund [2]. These two algorithms were introduced for a specific theoretical purpose. However, since the introduction of AdaBoost [5], quite a number of perspectives on boosting have emerged. For instance, AdaBoost can be understood as a method for maximizing the “margins” or “confidences” of the training examples [17]; as a technique for playing repeated matrix games [4, 6]; as a linear or convex programming method [15]; as a functional gradient-descent technique [8, 13, 14, 3]; as a technique for Bregman-distance optimization in a broader framework that includes logistic regression [1, 10, 12]; and finally as a stepwise model-fitting method for minimization of the exponential loss function, an approximation of the negative log binomial likelihood [7]. The current papers add to this list of perspectives, giving a view of boosting that is very different from its original interpretation and analysis as an algorithm for improving the accuracy of a weak learner. These many different points of view add to the richness of the theory of boosting, and are enormously helpful in the practical design of new or better algorithms for machine learning and statistical inference. Originally, boosting algorithms were designed expressly for classification. The goal in this setting is to accurately predict the classification of a …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pseudo-measurement simulations and bootstrap for the experimental cross-section covariances estimation with quality quantification",
            "Publication year": 2013,
            "Publication url": "https://www.epj-conferences.org/articles/epjconf/abs/2013/03/epjconf_wond2013_03002/epjconf_wond2013_03002.html",
            "Abstract": "The classical use of a generalized X2-distance to determine the evaluated cross section uncertainty requires the values of the experimental cross sections covariance matrix. The usual propagation error method to estimate the covariances is hardly usable and the lack of data prevents from using the direct empirical estimator. Thus we present an alternative which exploits a regression model of the experimental cross section to generate pseudo-measurements and thereby allows an estimation of experimental covariances. The problem of assessing the quality of the estimate still remains. In our approach, we propose to determine the estimation quality through the means of the bootstrap method. We show on numerical examples that the bootstrap allows to have an order of magnitude of the estimation quality through a matrix norm. All the results are illustrated with a toy model (where all quantities are known) and also …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:70eg2SAEIzsC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Method for providing with a score an object, and decision-support system",
            "Publication year": 2014,
            "Publication url": "https://patents.google.com/patent/US8738534B2/en",
            "Abstract": "The present invention is related to a decision-support system and method for providing with a score an object represented by a target item from a multidimensional space, said score being representative of the probability that the object satisfies a given binary property. The method and/or decision support-system may be performed in a computer environment comprising processing means connected to memory means.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On partitioning rules for bipartite ranking",
            "Publication year": 2009,
            "Publication url": "http://proceedings.mlr.press/v5/clemencon09a.html",
            "Abstract": "The purpose of this paper is to investigate the properties of partitioning scoring rules in the bipartite ranking setup. We focus on ranking rules based on scoring functions. General sufficient conditions for the AUC consistency of scoring functions that are constant on cells of a partition of the feature space are provided. Rate bounds are obtained for cubic histogram scoring rules under mild smoothness assumptions on the regression function. In this setup, it is shown how to penalize the empirical AUC criterion in order to select a scoring rule nearly as good as the one that can be built when the degree of smoothness of the regression function is known.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:LkGwnXOMwfcC",
            "Publisher": "PMLR"
        },
        {
            "Title": "Penalty learning for changepoint detection",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8081473/",
            "Abstract": "We consider the problem of signal segmentation in the setup of supervised learning. The supervision lies here in the existence of labelled change points in a historical database of similar signals. Typical segmentation techniques rely on a penalized least square procedure where the smoothing parameter is fixed arbitrarily. We introduce the alpin (Adaptive Linear Penalty INference) algorithm to tune automatically the smoothing parameter. ALPIN has linear complexity with respect to the sample size and turns out to be robust with respect to noise and diverse annotation strategies. Numerical experiments reveal the efficiency of ALPIN compared to state-of-the-art methods.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supervised kernel change point detection with partial annotations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8683471/",
            "Abstract": "In this article, we propose an automatic procedure to calibrate change point detection algorithms. Our approach expands on the ability of an expert to provide very rough segmentation estimates, called partial annotations, for a few signal examples. Our contribution consists in a supervised strategy to learn a kernel Mahalanobis metric, which, once combined with a detection algorithm, can replicate the expert's segmentation strategy on new signals. Contrary to previous works, our approach is non-parametric, supervised and naturally accommodates partial annotations. Experiments on real-world data show that supervision significantly improves detection performance.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Discrepancy-Based Active Learning for Domain Adaptation",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2103.03757",
            "Abstract": "The goal of the paper is to design active learning strategies which lead to domain adaptation under an assumption of covariate shift in the case of Lipschitz labeling function. Building on previous work by Mansour et al. (2009) we adapt the concept of discrepancy distance between source and target distributions to restrict the maximization over the hypothesis class to a localized class of functions which are performing accurate labeling on the source domain. We derive generalization error bounds for such active learning strategies in terms of Rademacher average and localized discrepancy for general loss functions which satisfy a regularity condition. A practical K-medoids algorithm that can address the case of large data set is inferred from the theoretical bounds. Our numerical experiments show that the proposed algorithm is competitive against other state-of-the-art active learning techniques in the context of domain adaptation, in particular on large data sets of around one hundred thousand images.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Offline detection of change-points in the mean for stationary graph signals",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2006.10628",
            "Abstract": "This paper addresses the problem of segmenting a stream of graph signals: we aim to detect changes in the mean of the multivariate signal defined over the nodes of a known graph. We propose an offline algorithm that relies on the concept of graph signal stationarity and allows the convenient translation of the problem from the original vertex domain to the spectral domain (Graph Fourier Transform), where it is much easier to solve. Although the obtained spectral representation is sparse in real applications, to the best of our knowledge this property has not been much exploited in the existing related literature. Our main contribution is a change-point detection algorithm that adopts a model selection perspective, which takes into account the sparsity of the spectral representation and determines automatically the number of change-points. Our detector comes with a proof of a non-asymptotic oracle inequality, numerical experiments demonstrate the validity of our method.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:0N-VGjzr574C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Localized Interpolation for Graph Signals",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9287493/",
            "Abstract": "Graph structure is a powerful framework for the characterization of interaction between entities. In the context of graph signal processing, interpolation methods are based on the smoothness assumption that assumes that neighboring nodes present similar values. However, in several contexts, the strong relationship between two connected nodes may express different behaviour. In this paper, we propose a graph signal interpolation algorithm that uses a graph localization penalization on the reconstruction weights. These weights are learned from the data, thus allowing the use of signal anti-correlation on connected nodes in order to perform a more robust interpolation. The results displayed in the paper show that our approach is relevant when dealing with real data, for both smooth and non-smooth signals.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:_axFR9aDTf0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gap-free bounds for stochastic multi-armed bandit",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S147466701640827X",
            "Abstract": "We consider the stochastic multi-armed bandit problem with unknown horizon. We present a randomized decision strategy which is based on updating a probability distribution through a stochastic mirror descent/exponentiated gradient type algorithm. We consider separately two assumptions: nonnegative losses or arbitrary losses with an exponential moment condition. We prove optimal (up to logarithmic factors) gap-free bounds on the excess risk of the average over time of the instantaneous losses induced by the choice of a specific action.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "CRAFT-Critical Risks Analysis by Fault Trees",
            "Publication year": 2011,
            "Publication url": "http://www.lsis.org/jdjnmacs2011/Download/peps/craft.pdf",
            "Abstract": "L’analyse qualitative et quantitative des arbres de défaillance dynamiques reste aujourd’hui un problème scientifique ouvert pour les systèmes industriels complexes. Ce projet vise à explorer une approche originale, combinant des outils et des modèles déterministes et stochastiques, qui pourrait constituer une alternative performante aux approches existantes dans ce domaine. Il s’ agit d’une part d’explorer l’apport du model-checking pour la détermination des séquences de coupes de l’arbre de défaillance, et d’autre part d’explorer comment des méthodes récentes issues de la théorie de l'apprentissage permettraient de calculer la probabilité de défaillance du système à partir de la connaissance de ces séquences de coupe et de la donnée des probabilités de défaillances des composants élémentaires.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantitative analysis of dynamic fault trees based on the coupling of structure functions and Monte Carlo simulation",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/qre.1728",
            "Abstract": "This paper focuses on the quantitative analysis of Dynamic Fault Trees (DFTs) by means of Monte Carlo simulation. In a previous article, we defined an algebraic framework allowing to determine the structure function of DFTs. We exploit this structure function and the minimal cut sequences that it allows to determine, to know the failure mode configuration of the system, which is an input of Monte Carlo simulation. We show that the results obtained are in good accordance with theoretical results and that some results, such as importance measures and sensitivity indexes, are not provided by common quantitative analysis and yet interesting. We finally illustrate our approach on a DFT example from the literature. Copyright © 2014 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:M7yex6snE4oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A statistical approach for experimental cross-section covariance estimation via shrinkage",
            "Publication year": 2015,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.13182/NSE14-07",
            "Abstract": "For evaluated nuclear cross-section uncertainties, most standard approaches are based on experimental cross-section measurements, reflecting that these measurements have uncertainty on their own and, in particular, undetermined correlations. We propose here focusing on the estimation of experimental covariances and bypassing the direct empirical estimator, which cannot be used due to the small amount of available data. Because of the nonlinearity of experimental cross sections, an alternative method to the classical propagation error formula is presented. This method exploits a regression model of the experimental cross sections to generate pseudomeasurements and thereby allows an empirical estimation of experimental covariances. Moreover, thanks to a bootstrap, a quality measure for the estimation is provided. The empirical matrix estimation is then improved with shrinkage. The validity of the …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:sSrBHYA8nusC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Tree-based ranking methods",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5208572/",
            "Abstract": "This paper investigates how recursive partitioning methods can be adapted to the bipartite ranking problem. In ranking, the pursued goal is global: based on past data, define an order on the whole input space X, so that positive instances take up the top ranks with maximum probability. The most natural way to order all instances consists of projecting the input data onto the real line through a real-valued scoring function s and use the natural order on R. The accuracy of the ordering induced by a candidate  s  is classically measured in terms of the ROC curve or the AUC. Here we discuss the design of tree-structured scoring functions obtained by recursively maximizing the AUC criterion. The connection with recursive piecewise linear approximation of the optimal ROC curve both in the L 1 -sense and in the L infin -sense is highlighted. A novel tree-based algorithm for ranking, called TreeRank, is proposed …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Graph Prediction in a Low-Rank and Autoregressive Setting",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1205.1406",
            "Abstract": "We study the problem of prediction for evolving graph data. We formulate the problem as the minimization of a convex objective encouraging sparsity and low-rank of the solution, that reflect natural graph properties. The convex formulation allows to obtain oracle inequalities and efficient solvers. We provide empirical results for our algorithm and comparison with competing methods, and point out two open questions related to compressed sensing and algebra of low-rank and sparse matrices.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Template-based step detection with inertial measurement units",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/367808",
            "Abstract": "This article presents a method for step detection from accelerometer and gyrometer signals recorded with Inertial Measurement Units (IMUs). The principle of our step detection algorithm is to recognize the start and end times of the steps in the signal thanks to a predefined library of templates. The algorithm is tested on a database of 1020 recordings, composed of healthy subjects and patients with various neurological or orthopedic troubles. Simulations on more than 40,000 steps show that the template-based method achieves remarkable results with a 98% recall and a 98% precision. The method adapts well to pathological subjects and can be used in a medical context for robust step estimation and gait characterization. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:z_wVstp3MssC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Ranking and scoring using empirical risk minimization",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11503415_1",
            "Abstract": "A general model is proposed for studying ranking problems. We investigate learning methods based on empirical minimization of the natural estimates of the ranking risk. The empirical estimates are of the form of a U-statistic. Inequalities from the theory of U-statistics and U-processes are used to obtain performance bounds for the empirical risk minimizers. Convex risk minimization methods are also studied to give a theoretical framework for ranking algorithms based on boosting and support vector machines. Just like in binary classification, fast rates of convergence are achieved under certain noise assumption. General sufficient conditions are proposed in several special cases that guarantee fast rates of convergence.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Unsupervised Multi-Source Domain Adaptation for Regression",
            "Publication year": 2020,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02543790/",
            "Abstract": "We consider the problem of unsupervised domain adaptation from multiple sources in a regression setting. We propose in this work an original method to take benefit of different sources using a weighted combination of the sources. For this purpose, we define a new measure of similarity between probabilities for domain adaptation which we call hypothesis-discrepancy. We then prove a new bound for unsupervised domain adaptation combining multiple sources. We derive from this bound a novel adversarial domain adaptation algorithm adjusting weights given to each source, ensuring that sources related to the target receive higher weights. We finally evaluate our method on different public datasets and compare it to other domain adaptation baselines to demonstrate the improvement for regression tasks.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:foquWX3nUaYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From ranking to classification: A statistical view",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-31314-1_25",
            "Abstract": "In applications related to information retrieval, the goal is not only to build a classifier for deciding whether a document x among a list χ is relevant or not, but to learn a scoring function s : χ → ℝ for ranking all possible documents with respect to their relevancy. Here we show how the bipartite ranking problem boils down to binary classification with dependent data when accuracy is measured by the A U C criterion. The natural estimate of the risk being of the form of a U-statistic, consistency of methods based on empirical risk minimization is studied using the theory of U-processes. Taking advantage of this specific form, we prove that fast rates of convergence may be achieved under general noise assumptions.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the rate of convergence of regularized boosting classifiers",
            "Publication year": 2003,
            "Publication url": "https://www.jmlr.org/papers/volume4/blanchard03a/blanchard03a.pdf",
            "Abstract": "A regularized boosting method is introduced, for which regularization is obtained through a penalization function. It is shown through oracle inequalities that this method is model adaptive. The rate of convergence of the probability of misclassification is investigated. It is shown that for quite a large class of distributions, the probability of error converges to the Bayes risk at a rate faster than n−(V+ 2)/(4 (V+ 1)) where V is the VC dimension of the “base” class whose elements are combined by boosting methods to obtain an aggregated classifier. The dimension-independent nature of the rates may partially explain the good behavior of these methods in practical problems. Under Tsybakov’s noise condition the rate of convergence is even faster. We investigate the conditions necessary to obtain such rates for different base classes. The special case of boosting using decision stumps is studied in detail. We characterize the class of classifiers realizable by aggregating decision stumps. It is shown that some versions of boosting work especially well in high-dimensional logistic additive models. It appears that adding a limited labelling noise to the training data may in certain cases improve the convergence, as has been also suggested by other authors.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive estimation of the optimal ROC curve and a bipartite ranking algorithm",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04414-4_20",
            "Abstract": "In this paper, we propose an adaptive algorithm for bipartite ranking and prove its statistical performance in a stronger sense than the AUC criterion. Our procedure builds on and significantly improves the RankOver algorithm proposed in [1]. The algorithm outputs a piecewise constant scoring rule which is obtained by overlaying a finite collection of classifiers. Here, each of these classifiers is the empirical solution of a specific minimum-volume set (MV-set) estimation problem. The major novelty arises from the fact that the levels of the MV-sets to recover are chosen adaptively from the data to adjust to the variability of the target curve. The ROC curve of the estimated scoring rule may be interpreted as an adaptive spline approximant of the optimal ROC curve. Error bounds for the estimate of the optimal ROC curve in terms of the L  ∞ -distance are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A New Framework for the Simulation of Offshore Oil Facilities at the System Level",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11617-4_4",
            "Abstract": "Offshore oil facilities are complex industrial systems: They are composed of numerous parts and involve both elaborate physics and stochastic aspects like failure risk or price variation. Several software tools are available to simulate individual components of offshore facilities, for instance to compute the flow dynamics in a particular device. There is however no tool to simulate the facility at the system level, i.e. to simulate the general behavior of the facility. The paper presents a framework for such a system-level simulator, which includes one layer for physics and one for risk simulation. The physical part uses the equation-based language Modelica[1]. Modelica components are defined to model typical devices of an installation. The risk simulation usesMarkov chains and statistical indicators to assess performance and resilience of the system. It runs with an external language (C or Scilab) and data from the …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:SP6oXDckpogC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Statistical learning to assess overhead line lifespan",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9128163/",
            "Abstract": "Assessing overhead line lifespan requires an overall knowledge of the environmental conditions that the conductors are subjected to and the correct treatment of human made observations that form the data set. These requirements have made it challenging to apply statistical learning, which calls for advanced machine learning techniques and needs to be supplied and reinforced by physical modelling. Here, we provide a methodology to assimilate data, then train and evaluate the appropriate models.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:b1wdh0AR-JQC",
            "Publisher": "IET"
        },
        {
            "Title": "The Role of Critical Sets in Vapnik-Chervonenkis Theory.",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.25.7300&rep=rep1&type=pdf",
            "Abstract": "In the present paper, we present the theoretical basis, as well as an empirical validation, of a protocol designed to obtain effective VC dimension estimations in the case of a simple pattern recognition issue. We first formulate particular (distributiondependent) VC bounds in which a special attention has been given to the exact exponential rate of convergence. We show indeed that the most significant contribution in such bounds is due to the “worst” elements of the model class (designated as the critical sets). We then explain how these results can lead to a rigorous framework for computer simulations involving speed-up techniques for rare event simulation (importance sampling) as well as parameter estimation (linear regression). We thus obtain accurate empirical estimates of the complexity measure and of the multiplicative constant in VC bounds. In particular, we develop the idea of a local complexity characterization associated to every critical set.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Risk Assessment in Sloshing: How to Deal with Multidimensional Datasets",
            "Publication year": 2014,
            "Publication url": "https://onepetro.org/ISOPEIOPEC/proceedings-abstract/ISOPE14/All-ISOPE14/ISOPE-I-14-320/14054",
            "Abstract": "In the liquefied natural gas (LNG) shipping industry, the phenomenon of sloshing can lead to the occurrence of high pressures on the tanks walls of the vessel. The issue of modelling or estimating the probability of the simultaneous occurrence of such extremal pressures is now crucial from the risk assessment point of view since the probability of failure of the system depends of the area of the sloshing impact. Multivariate heavy-tailed distributions are considered, with sloshing pressures investigated by means of small-scale replica tanks instrumented with d≥ 1 sensors. When attempting to fit such nonparametric statistical models, one naturally faces computational issues inherent in the phenomenon of dimensionality. The primary purpose of this article is to overcome this barrier by introducing a novel methodology. For d-dimensional heavy-tailed distributions, the structure of extremal dependence is entirely …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:XiSMed-E-HIC",
            "Publisher": "OnePetro"
        },
        {
            "Title": "A spectral method for activity shaping in continuous-time information cascades",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1709.05231",
            "Abstract": "Information Cascades Model captures dynamical properties of user activity in a social network. In this work, we develop a novel framework for activity shaping under the Continuous-Time Information Cascades Model which allows the administrator for local control actions by allocating targeted resources that can alter the spread of the process. Our framework employs the optimization of the spectral radius of the Hazard matrix, a quantity that has been shown to drive the maximum influence in a network, while enjoying a simple convex relaxation when used to minimize the influence of the cascade. In addition, use-cases such as quarantine and node immunization are discussed to highlight the generality of the proposed activity shaping framework. Finally, we present the NetShape influence minimization method which is compared favorably to baseline and state-of-the-art approaches through simulations on real social networks.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selective review of offline change point detection methods",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165168419303494",
            "Abstract": "This article presents a selective survey of algorithms for the offline detection of multiple change points in multivariate time series. A general yet structuring methodological strategy is adopted to organize this vast body of work. More precisely, detection algorithms considered in this review are characterized by three elements: a cost function, a search method and a constraint on the number of changes. Each of those elements is described, reviewed and discussed separately. Implementations of the main algorithms described in this article are provided within a Python package called ruptures.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "What makes a good plan? An efficient planning approach to control diffusion processes in networks",
            "Publication year": 2014,
            "Publication url": "https://arxiv.org/abs/1407.4760",
            "Abstract": "In this paper, we analyze the quality of a large class of simple dynamic resource allocation (DRA) strategies which we name priority planning. Their aim is to control an undesired diffusion process by distributing resources to the contagious nodes of the network according to a predefined priority-order. In our analysis, we reduce the DRA problem to the linear arrangement of the nodes of the network. Under this perspective, we shed light on the role of a fundamental characteristic of this arrangement, the maximum cutwidth, for assessing the quality of any priority planning strategy. Our theoretical analysis validates the role of the maximum cutwidth by deriving bounds for the extinction time of the diffusion process. Finally, using the results of our analysis, we propose a novel and efficient DRA strategy, called Maximum Cutwidth Minimization, that outperforms other competing strategies in our simulations.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A non linear scoring approach for evaluating balance: classification of elderly as fallers and non-fallers",
            "Publication year": 2016,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0167456",
            "Abstract": "Almost one third of population 65 years-old and older faces at least one fall per year. An accurate evaluation of the risk of fall through simple and easy-to-use measurements is an important issue in current clinic. A common way to evaluate balance in posturography is through the recording of the centre-of-pressure (CoP) displacement (statokinesigram) with force platforms. A variety of indices have been proposed to differentiate fallers from non fallers. However, no agreement has been reached whether these analyses alone can explain sufficiently the complex synergies of postural control. In this work, we study the statokinesigrams of 84 elderly subjects (80.3+− 6.4 years old), which had no impairment related to balance control. Each subject was recorded 25 seconds with eyes open and 25 seconds with eyes closed and information pertaining to the presence of problems of balance, such as fall, in the last six months, was collected. Five descriptors of the statokinesigrams were computed for each record, and a Ranking Forest algorithm was used to combine those features in order to evaluate each subject’s balance with a score. A classical train-test split approach was used to evaluate the performance of the method through ROC analysis. ROC analysis showed that the performance of each descriptor separately was close to a random classifier (AUC between 0.49 and 0.54). On the other hand, the score obtained by our method reached an AUC of 0.75 on the test set, consistent over multiple train-test split. This non linear multi-dimensional approach seems appropriate in evaluating complex postural control.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Empirical performance maximization for linear rank statistics",
            "Publication year": 2009,
            "Publication url": "https://hal.telecom-paris.fr/hal-02107196",
            "Abstract": "The ROC curve is known to be the golden standard for measuring performance of a test/scoring statistic regarding its capacity of discrimination between two populations in a wide variety of applications, ranging from anomaly detection in signal processing to information retrieval, through medical diagnosis. Most practical performance measures used in scoring applications such as the AUC, the local AUC, the p-norm push, the DCG and others, can be seen as summaries of the ROC curve. This paper highlights the fact that many of these empirical criteria can be expressed as (conditional) linear rank statistics. We investigate the properties of empirical maximizers of such performance criteria and provide preliminary results for the concentration properties of a novel class of random variables that we will call a linear rank process.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Strong consistency of Bayesian estimator under discrete observations and unknown transition density",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-0348-0097-6_10",
            "Abstract": "We consider the asymptotic behavior of a Bayesian parameter estimation method under discrete stationary observations. We suppose that the transition density of the data is unknown, and therefore we approximate it using a kernel density estimation method applied to the Monte Carlo simulations of approximations of the theoretical random variables generating the observations. In this article, we estimate the error between the theoretical estimator, which assumes the knowledge of the transition density and its approximation which uses the simulation. We prove the strong consistency of the approximated estimator and find the order of the error. Most importantly, we give a parameter tuning result which relates the number of data, the number of time-steps used in the approximation process, the number of the Monte Carlo simulations and the bandwidth size of the kernel density estimation.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Basel"
        },
        {
            "Title": "Dynamic Epidemic Control via Sequential Resource Allocation",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2006.07199",
            "Abstract": "In the Dynamic Resource Allocation (DRA) problem, an administrator has to allocate a limited amount of resources to the nodes of a network in order to reduce a diffusion process (DP) (e.g. an epidemic). In this paper we propose a multi-round dynamic control framework, which we realize through two derived models: the Restricted and the Sequential DRA (RDRA, SDRA), that allows for restricted information and access to the entire network, contrary to standard full-information and full-access DRA models. At each intervention round, the administrator has only access -- simultaneous for the former, sequential for the latter -- to a fraction of the network nodes. This sequential aspect in the decision process offers a completely new perspective to the dynamic DP control, making this work the first to cast the dynamic control problem as a series of sequential selection problems. Through in-depth SIS epidemic simulations we compare the performance of our multi-round approach with other resource allocation strategies and several sequential selection algorithms on both generated, and real-data networks. The results provide evidence about the efficiency and applicability of the proposed framework for real-life problems.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SEAIR framework accounting for a personalized risk prediction score: application to the Covid-19 epidemic",
            "Publication year": 2020,
            "Publication url": "http://www.ipol.im/pub/art/2020/305/",
            "Abstract": "The aim of the present work is to provide an SEAIR framework which takes a personalized risk prediction score as an additional input. Each individual is categorized depending on his actual status with respect to the disease-moderate or severe symptoms-, and the level of risk predicted-low or high. This idea leads to a 4-fold extension of the ODE model in classical SEAIR. This model offers the possibility for policy-makers to explore differentiated containment strategies, by varying sizes for the low risk segment and varying dates for'progressive release'of the population, while exploring the discriminative capacity of the risk score, for instance through its AUC. Differential contact rates for low-risk/high-risk compartments are also included in the model. The demo allows to select contact rates and time-depending exit strategies. The hard-coded parameters correspond to the data for the Covid-19 epidemic in France, and the risk refers to the probability of being admitted in ICU upon infection. Some examples of simulations are provided.",
            "Abstract entirety": 1,
            "Author pub id": "IsPkE1wAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel Gaussian process optimization with upper confidence bound and pure exploration",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40988-2_15",
            "Abstract": "In this paper, we consider the challenge of maximizing an unknown function f for which evaluations are noisy and are acquired with high cost. An iterative procedure uses the previous measures to actively select the next estimation of f which is predicted to be the most useful. We focus on the case where the function can be evaluated in parallel with batches of fixed size and analyze the benefit compared to the purely sequential procedure in terms of cumulative regret. We introduce the Gaussian Process Upper Confidence Bound and Pure Exploration algorithm (GP-UCB-PE) which combines the UCB strategy and Pure Exploration in the same batch of evaluations along the parallel iterations. We prove theoretical upper bounds on the regret with batches of size K for this procedure which show the improvement of the order of  for fixed iteration cost over purely sequential versions. Moreover, the …",
            "Abstract entirety": 0,
            "Author pub id": "IsPkE1wAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]