[{
    "name": "Panayiota Poirazi",
    "romanize name": "Panayiota Poirazi",
    "School-Department": "Ινστιτούτο Μοριακής Βιολογίας και Βιοτεχνολογίας",
    "University": "ITE",
    "Rank": "Διευθυντής Ερευνών",
    "Apella_id": 18797,
    "Scholar name": "Panayiota Poirazi",
    "Scholar id": "7IidNJMAAAAJ",
    "Affiliation": "Research Director, IMBB-FORTH",
    "Citedby": 4701,
    "Interests": [
        "Dendrites",
        "Dendritic Computation",
        "Neural Computation",
        "Computational Neuroscience"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=7IidNJMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Illuminating dendritic function with computational models",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41583-020-0301-7",
            "Abstract": "Dendrites have always fascinated researchers: from the artistic drawings by Ramon y Cajal to the beautiful recordings of today, neuroscientists have been striving to unravel the mysteries of these structures. Theoretical work in the 1960s predicted important dendritic effects on neuronal processing, establishing computational modelling as a powerful technique for their investigation. Since then, modelling of dendrites has been instrumental in driving neuroscience research in a targeted manner, providing experimentally testable predictions that range from the subcellular level to the systems level, and their relevance extends to fields beyond neuroscience, such as machine learning and artificial intelligence. Validation of modelling predictions often requires—and drives—new technological advances, thus closing the loop with theory-driven experimentation that moves the field forward. This Review features the most …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:olpn-zPbct0C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Methods for Structural Inference and Functional Module Identification in Intracellular Networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-59745-440-7_27",
            "Abstract": "The ways in which intracellular components interact in order to produce certain functions remains a mystery to the scientific community. Although parts of biological systems become more and more characterized, a more global understanding of the structure, dynamics and functionalities of complex intracellular networks is currently lacking. Systems Biology approaches aim at providing such a global picture by combining analytical and experimental techniques across several multi-disciplinary fields. In this chapter, we provide an overview of the analytical approaches and computational tools that have been applied to biological systems in order to describe them at different levels of abstraction. We start by reviewing methods that model or infer a topological map of complex biological networks (structural inference) and move on to discuss ways of discovering the functionalities of sub-network entities that …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Breast Cancer and Biomedical Informatics: The PrognoChip Project",
            "Publication year": 2005,
            "Publication url": "https://www.imbb.forth.gr/imbb-people/images/Kafetzopoulos/pdf/Conference_Proceedings/10.pdf",
            "Abstract": "Breast cancer is the most common malignancy affecting women, the life time risk being approximately 10%. Breast cancer is both genetically and histopathologically heterogeneous, and the underling development mechanisms remain largely unknown. Global expression analysis using microarrays offers unprecedented opportunities to obtain molecular signatures of the state of activity of diseased cells and patient samples. The predictive power of this approach is much greater than that of currently used approaches, but remains to be validated in prospective clinical studies. The PrognoChip project is based on the synergy between Bioinformatics and Medical Informatics, following the lines of the new raising discipline of Biomedical Informatics. In this context we are moving towards the specification and creation of an Integrated Clinico-Genomics Information Technology Environment (ICG-ITE) where, the smooth integration between the clinical and the genomics worlds as well as the intelligent processing of the underlying data, enables the identification of reliable and clinically valid (ie, in terms of prognosis) molecular (gene) markers.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distinguishing linear vs. non-linear integration in CA1 radial oblique dendrites: it’s about time",
            "Publication year": 2011,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncom.2011.00044/full",
            "Abstract": "It was recently shown that multiple excitatory inputs to CA1 pyramidal neuron dendrites must be activated nearly simultaneously to generate local dendritic spikes and superlinear responses at the soma; even slight input desynchronization prevented local spike initiation (Gasparini, 2006;Losonczy, 2006). This led to the conjecture that CA1 pyramidal neurons may only express their nonlinear integrative capabilities during the highly synchronized sharp waves and ripples that occur during slow wave sleep and resting/consummatory behavior, whereas during active exploration and REM sleep (theta rhythm), inadequate synchronization of excitation would lead CA1 pyramidal cells to function as essentially linear devices. Using a detailed single neuron model, we replicated the experimentally observed synchronization effect for brief inputs mimicking single synaptic release events. When synapses were driven instead by double pulses, more representative of the bursty inputs that occur in vivo, we found that the tolerance for input desynchronization was increased by more than an order of magnitude. The effect depended mainly on paired pulse facilitation of NMDA receptor-mediated responses at Schaffer collateral synapses. Our results suggest that CA1 pyramidal cells could function as nonlinear integrative units in all major hippocampal states.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Predictive features of persistent activity emergence in regular spiking and intrinsic bursting model neurons",
            "Publication year": 2012,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1002489",
            "Abstract": "Proper functioning of working memory involves the expression of stimulus-selective persistent activity in pyramidal neurons of the prefrontal cortex (PFC), which refers to neural activity that persists for seconds beyond the end of the stimulus. The mechanisms which PFC pyramidal neurons use to discriminate between preferred vs. neutral inputs at the cellular level are largely unknown. Moreover, the presence of pyramidal cell subtypes with different firing patterns, such as regular spiking and intrinsic bursting, raises the question as to what their distinct role might be in persistent firing in the PFC. Here, we use a compartmental modeling approach to search for discriminatory features in the properties of incoming stimuli to a PFC pyramidal neuron and/or its response that signal which of these stimuli will result in persistent activity emergence. Furthermore, we use our modeling approach to study cell-type specific differences in persistent activity properties, via implementing a regular spiking (RS) and an intrinsic bursting (IB) model neuron. We identify synaptic location within the basal dendrites as a feature of stimulus selectivity. Specifically, persistent activity-inducing stimuli consist of activated synapses that are located more distally from the soma compared to non-inducing stimuli, in both model cells. In addition, the action potential (AP) latency and the first few inter-spike-intervals of the neuronal response can be used to reliably detect inducing vs. non-inducing inputs, suggesting a potential mechanism by which downstream neurons can rapidly decode the upcoming emergence of persistent activity. While the two model neurons did not differ in the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "MiRduplexSVM: A high-Performing miRNA-duplex prediction and evaluation methodology",
            "Publication year": 2015,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0126151",
            "Abstract": "We address the problem of predicting the position of a miRNA duplex on a microRNA hairpin via the development and application of a novel SVM-based methodology. Our method combines a unique problem representation and an unbiased optimization protocol to learn from mirBase19.0 an accurate predictive model, termed MiRduplexSVM. This is the first model that provides precise information about all four ends of the miRNA duplex. We show that (a) our method outperforms four state-of-the-art tools, namely MaturePred, MiRPara, MatureBayes, MiRdup as well as a Simple Geometric Locator when applied on the same training datasets employed for each tool and evaluated on a common blind test set. (b) In all comparisons, MiRduplexSVM shows superior performance, achieving up to a 60% increase in prediction accuracy for mammalian hairpins and can generalize very well on plant hairpins, without any special optimization. (c) The tool has a number of important applications such as the ability to accurately predict the miRNA or the miRNA*, given the opposite strand of a duplex. Its performance on this task is superior to the 2nts overhang rule commonly used in computational studies and similar to that of a comparative genomic approach, without the need for prior knowledge or the complexity of performing multiple alignments. Finally, it is able to evaluate novel, potential miRNAs found either computationally or experimentally. In relation with recent confidence evaluation methods used in miRBase, MiRduplexSVM was successful in identifying high confidence potential miRNAs.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Don't use a cannon to kill the… miRNA mosquito",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/39170645/02e7e532ac647d4a73000000.pdf",
            "Abstract": "CONCLUSIONComparing against the simplest possible method as a baseline in data analysis is an important step of the analysis. Foregoing this step may result in unnecessary effort and energy spent in code developing, publishing and evaluations by future researchers, unnecessary use of computationally expensive methods and a false impression about their benefits and added value they provide in a given task. As an example we show that using the mean positions in predicting the four corners of a miRNA duplex complex outperforms some state-of-the-art methods and is on par with the rest when trying to predict the exact location of the duplex with zero tolerance.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Mature miRNA identification via the use of a Naive Bayes classifier",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696697/",
            "Abstract": "MicroRNAs (miRNAs) are small single stranded RNAs, on average 22nt long, generated from endogenous hairpin-shaped transcripts with post-transcriptional activity. Although many computational methods are currently available for identifying miRNA genes in the genomes of various species, very few algorithms can accurately predict the functional part of the miRNA gene, namely the mature miRNA. We introduce a computational method that uses a Naive Bayes classifier to identify mature miRNA candidates based on sequence and secondary structure information of the miRNA precursor. Specifically, for each mature miRNA, we generate a set of negative examples of equal length on the respective precursor(s). The true and negative sets are then used to estimate probability distributions for sequence composition and secondary structure on each position along the RNA. The distance between these distributions …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Hitchhiker’s guide to a neuroscience career",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627315003311",
            "Abstract": "Neuroscience is an exciting and vibrant field, but building an academic career is not always easy. What are critical success indicators? Which tools help talented young neuroscientists conquer the challenges? In this NeuroView, we discuss instruments and steps that can help people progress through the ranks.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:rO6llkc54NcC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Modeling of stress-induced regulatory cascades involving transcription factor dimers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5447527/",
            "Abstract": "Regulatory cascades consisting of stress-induced gene modules and their transcriptional regulators were recently identified and quantitatively modeled using Artificial Neural Networks (ANNs). Here, we extent our approach to account for regulators that consist of transcription factor dimers. The latter are frequently missed by module-finding tools since the expression profile of one of the dimers is typically un-altered while the profile of the second dimer changes significantly during the stress response. We identify two modules of stress-associated genes that are regulated by transcription factor dimers and show that ANN modeling can be used to accurately predict the expression of all genes in these modules. We also find that prediction accuracy is dependent on the specific stress category, in agreement with experimental studies where constitutively expressed transcription factors exert different regulatory actions …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introduction to the Computational Neuroscience Special Section",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Panayiota-Poirazi/publication/315612297_Computational_Neuroscience_in_the_European_Journal_of_Neuroscience/links/59e484d00f7e9b97fbf05f85/Computational-Neuroscience-in-the-European-Journal-of-Neuroscience.pdf",
            "Abstract": "Many of us played computer games during our childhood and youth, and some of us still do, while others decided to do something seemingly more useful–like trying to better understand the mammalian brain. Many computer games have a linear progression; individual levels are subdivisions of a larger, more complex world. The practical advantage of having levels is that they divide a game into manageable sections. Upon completion of the easy-to-master entry levels, difficulty and complexity increase and often, prior knowledge and acquired skills are necessary to advance further. A computer game analogy can be applied quite easily to the task of understanding the mammalian brain. Obviously, in this ‘game’, we enter a multiplayer environment; prior knowledge has been and is acquired by many ‘players’ in all areas of neuroscience. While physically coexisting within the same structure, each level presents its own themes, rewards and challenges. In the areas of molecular and cellular, cognitive, developmental, behavioural and clinical neuroscience,‘players’ progress towards prevailing milestones and research goals. In many cases, it is while we are dealing with the difficulties and specifics that come with our individual entry level that we realize for the first time the complexities and begin to grasp the dimension and complexity of the games’ world map. We find out how little we know as individuals and realize how important it is to join forces with other ‘players’ to crosslink different areas and to link different levels of understanding. This is where theory becomes important. It can provide the quantitative and intellectual framework for linking …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A biologically inspired neural network composed of dissimilar single neuron models",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1019026/",
            "Abstract": "A multilayer neural network has been developed that consists of slabs of single neuron models. Each slab is composed of a single type of neurons, which differs between the slabs. The network was trained using a biologically inspired, Hebbian-like, learning rule on EMG data and good training/testing classification performance was obtained. It was shown that the biologically inspired network, the novel architecture of which is derived from the functionally distinct hypercolumns of neurons in the brain, can be successfully applied on difficult classification tasks.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "In Vivo Imaging of Dentate Gyrus Mossy Cells in Behaving Mice",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627316309618",
            "Abstract": "Mossy cells in the hilus of the dentate gyrus constitute a major excitatory principal cell type in the mammalian hippocampus; however, it remains unknown how these cells behave in vivo. Here, we have used two-photon Ca2+ imaging to monitor the activity of mossy cells in awake, behaving mice. We find that mossy cells are significantly more active than dentate granule cells in vivo, exhibit spatial tuning during head-fixed spatial navigation, and undergo robust remapping of their spatial representations in response to contextual manipulation. Our results provide a functional characterization of mossy cells in the behaving animal and demonstrate their active participation in spatial coding and contextual representation.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Information Processing in Single Cells and Small Networks: Insights from Compartmental Models",
            "Publication year": 2009,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3117124",
            "Abstract": "The goal of this paper is to present a set of predictions generated by detailed compartmental models regarding the ways in which information may be processed, encoded and propagated by single cells and neural assemblies. Towards this goal, I will review a number of modelling studies from our lab that investigate how single pyramidal neurons and small neural networks in different brain regions process incoming signals that are associated with learning and memory. I will first discuss the computational capabilities of individual pyramidal neurons in the hippocampus [1–3] and how these properties may allow a single cell to discriminate between different memories [4]. I will then present biophysical models of prefrontal layer V neurons and small networks that exhibit sustained activity under realistic synaptic stimulation and discuss their potential role in working memory [5].",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:qUcmZB5y_30C",
            "Publisher": "AIP"
        },
        {
            "Title": "Computational modeling of the effects of amyloid-beta on release probability at hippocampal synapses",
            "Publication year": 2013,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncom.2013.00001/full",
            "Abstract": "The role of amyloid-beta (Aβ) in brain function and in the pathogenesis of Alzheimer’s disease remains elusive. Recent publications reported that an increase in Aβ concentration perturbs pre-synaptic release in hippocampal neurons. In particular, it was shown in vitro that Aβ is an endogenous regulator of synaptic transmission at the CA3-CA1 synapse, enhancing its release probability. How this synaptic modulator influences neuronal output during physiological stimulation patterns, such as those elicited in vivo, is still unknown. Using a realistic model of hippocampal CA1 pyramidal neurons, we first implemented this Aβ-induced enhancement of release probability and validated the model by reproducing the experimental findings. We then demonstrated that this synaptic modification can significantly alter synaptic integration properties in a wide range of physiologically relevant input frequencies (from 5 to 200 Hz). Finally, we used natural input patterns, obtained from CA3 pyramidal neurons in vivo during free exploration of rats in an open field, to investigate the effects of enhanced Aβ on synaptic release under physiological conditions. The model shows that the CA1 neuronal response to these natural patterns is altered in the increased-Aβ condition, especially for frequencies in the theta and gamma ranges. These results suggest that the perturbation of release probability induced by increased Aβ can significantly alter the spike probability of CA1 pyramidal neurons and thus contribute to abnormal hippocampal function during Alzheimer’s disease.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Modulatory effects of inhibition on persistent activity in a cortical microcircuit model",
            "Publication year": 2014,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncir.2014.00007/full",
            "Abstract": "Neocortical network activity is generated through a dynamic balance between excitation, provided by pyramidal neurons, and inhibition, provided by interneurons. Imbalance of the excitation/inhibition ratio has been identified in several neuropsychiatric diseases, such as schizophrenia, autism and epilepsy, which also present with other cognitive deficits and symptoms associated with prefrontal cortical (PFC) dysfunction. We undertook a computational approach to study how changes in the excitation/inhibition balance in a PFC microcircuit model affect the properties of persistent activity, considered the cellular correlate of working memory function in PFC. To this end, we constructed a PFC microcircuit, consisting of pyramidal neuron models and all three different interneuron types: fast-spiking (FS), regular-spiking (RS) and irregular-spiking (IS) interneurons. Persistent activity was induced in the microcircuit model with a stimulus to the proximal apical dendrites of the pyramidal neuron models, and its properties were analyzed, such as the induction profile, the interspike intervals (ISIs) and neuronal synchronicity. Our simulations showed that a) the induction but not the firing frequency or neuronal synchronicity is modulated by changes in the NMDA-to-AMPA ratio on FS interneuron model, b) removing or decreasing the FS model input to the pyramidal neuron models greatly limited the biophysical modulation of persistent activity induction, decreased the ISIs and neuronal synchronicity during persistent activity, c) the induction and firing properties could not be altered by the addition of other inhibitory inputs to the soma (from RS or IR models) and d …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Frontiers Media SA"
        },
        {
            "Title": "Inside the brain of a neuron",
            "Publication year": 2006,
            "Publication url": "https://www.embopress.org/doi/abs/10.1038/sj.embor.7400789",
            "Abstract": "For many decades, neurons were considered to be the elementary computational units of the brain and were assumed to summate incoming signals and elicit action potentials only in response to suprathreshold stimuli. Although modelling studies predicted that single neurons constitute a much more powerful computational entity, able to perform an array of nonlinear calculations, this possibility was not explored experimentally until the discovery of active mechanisms in the dendrites of most neuron types. Here, we review several modelling studies that have addressed information processing in single neurons, starting with those characterizing the arithmetic of different dendritic components, to those tackling neuronal integration at the cell body and, finally, those analysing the computational abilities of the axon. We present modelling predictions along with supporting experimental data in an effort to highlight the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "EMBO Press"
        },
        {
            "Title": "The road to independence: how to get funding in neuroscience",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/ejn.13169",
            "Abstract": "The Federation of European Neurosciences (FENS) and the Kavli foundation have recently founded the FENS-Kavli Network of Excellence (http://www. fens. org/Outreach/FENS-Kavli-Network-of-Excellence/), a group of young, outstanding neuroscientists dedicated to providing peer support for early career neuroscientists and serving as the voice for people at this career stage in shaping the future of neuroscience. Part of this support is this series of opinion articles whose primary goal is to provide advice about different aspects of career progression in neuroscience. The series started in August 2015 with a piece about getting hired and negotiating a group leader position (CITE) and a second article about how to build and effectively lead a research team (CITE). This article focuses on the funding opportunities for young principal investigators (PI) working in Europe and ways to maximize the possibility of funding …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Locus Coeruleus-dorsal CA1 dopaminergic circuit modulates memory linking",
            "Publication year": 2021,
            "Publication url": "https://europepmc.org/article/ppr/ppr413050",
            "Abstract": "Individual memories are often linked so that the recall of one triggers the recall of another. For example, contextual memories acquired close in time can be linked, and this is known to depend on temporary increase in excitability that drive the overlap between dorsal CA1 (dCA1) hippocampal ensembles encoding the linked memories. Here, we show that the Locus Coeruleus (LC) cells projecting to dCA1 have a key permissive role in contextual memory linking, without affecting contextual memory formation, and that this effect is mediated by dopamine and not by noradrenaline. Additionally, we found that LC to dCA1 projecting neurons modulate the excitability of dCA1 neurons, and the extent of overlap between dCA1 memory ensembles, as well as the stability of coactivity patterns within these ensembles. This discovery of a neuromodulatory system that specifically affects memory linking without affecting memory formation, reveals a fundamental separation between the brain mechanisms that modulate these two distinct processes.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contribution of apical and basal dendrites to orientation encoding in mouse V1 L2/3 pyramidal neurons",
            "Publication year": 2019,
            "Publication url": "https://www.nature.com/articles/s41467-019-13029-0",
            "Abstract": "Pyramidal neurons integrate synaptic inputs from basal and apical dendrites to generate stimulus-specific responses. It has been proposed that feed-forward inputs to basal dendrites drive a neuron’s stimulus preference, while feedback inputs to apical dendrites sharpen selectivity. However, how a neuron’s dendritic domains relate to its functional selectivity has not been demonstrated experimentally. We performed 2-photon dendritic micro-dissection on layer-2/3 pyramidal neurons in mouse primary visual cortex. We found that removing the apical dendritic tuft did not alter orientation-tuning. Furthermore, orientation-tuning curves were remarkably robust to the removal of basal dendrites: ablation of 2 basal dendrites was needed to cause a small shift in orientation preference, without significantly altering tuning width. Computational modeling corroborated our results and put limits on how orientation preferences …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:1qzjygNMrQYC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Opening up: Open access publishing, data sharing, and how they can influence your neuroscience career",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/ejn.13234",
            "Abstract": "No matter how often it might feel like it, science doesn’t happen in a bubble–the things we discover aren’t worth anything unless they influence other people. Luckily, this ability to reach others with our science is being made ever easier in the digital era. We have already moved far from the traditional model in which scientific findings were only ever presented in subscription-access, print-only journals. Nowadays there are huge opportunities to widen access, not only to complete scientific articles, but also to their underlying raw data, and there is a growing push from funders and other stakeholders to promote such openness. Here, we aim to outline these increasing demands for open access (OA) publishing and data sharing, to describe the routes available for their implementation, and to weigh up the costs and the benefits associated with such scientific openness, especially for early-career researchers.We don’t …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Neurofibromin regulates corticostriatal inhibitory networks during working memory performance",
            "Publication year": 2010,
            "Publication url": "https://www.pnas.org/content/107/29/13141.short",
            "Abstract": "Neurofibromatosis type I (NF1) is one of the most common single-gene causes of learning disabilities. Here, we use behavioral working memory probes and electrophysiological studies in a mouse model of NF1 (Nf1 heterozygous null mutants; Nf1+/−) to demonstrate that (i) Neurofibromin regulates prefrontal and striatal inhibitory networks, specifically activity-dependent GABA release and (ii) is required for working memory performance, with inhibition-dependent working memory deficits seen in Nf1+/− mice. We find that increased inhibition in medial prefrontal cortex (mPFC) is sufficient to alter persistent activity in a biophysical model of an mPFC microcircuit, suggesting a possible mechanism for Nf1+/− working memory deficits. Accordingly, working memory assays applied during functional MRI (fMRI) studies in human subjects with NF1 reveal hypoactivation of corticostriatal networks, which is associated with …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:_FxGoFyzp5QC",
            "Publisher": "National Acad Sciences"
        },
        {
            "Title": "Basal tree complexity shapes functional pathways in the prefrontal cortex",
            "Publication year": 2017,
            "Publication url": "https://journals.physiology.org/doi/abs/10.1152/jn.00099.2017",
            "Abstract": "While the morphology of basal dendritic trees in cortical pyramidal neurons varies, the functional implications of this diversity are just starting to emerge. In layer 5 pyramidal neurons of the prefrontal cortex, for example, increased basal tree complexity determines the recruitment of these neurons into functional circuits. Here, we use a modeling approach to investigate whether and how the morphology of the basal tree mediates the functional output of neurons. We implemented 57 basal tree morphologies of layer 5 prefrontal pyramidal neurons of the rat and identified morphological types that were characterized by different response features, forming distinct functional types. These types were robust to a wide range of manipulations (distribution of active ionic mechanisms, NMDA conductance, somatic and apical tree morphology, or the number of activated synapses) and supported different temporal coding schemes …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:08ZZubdj9fEC",
            "Publisher": "American Physiological Society"
        },
        {
            "Title": "Drawing inspiration from biological dendrites to empower artificial neural networks",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0959438821000544",
            "Abstract": "This article highlights specific features of biological neurons and their dendritic trees, whose adoption may help advance artificial neural networks used in various machine learning applications. Advancements could take the form of increased computational capabilities and/or reduced power consumption. Proposed features include dendritic anatomy, dendritic nonlinearities, and compartmentalized plasticity rules, all of which shape learning and information processing in biological networks. We discuss the computational benefits provided by these features in biological neurons and suggest ways to adopt them in artificial neurons in order to exploit the respective benefits in machine learning.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Elsevier Current Trends"
        },
        {
            "Title": "The dendritic spatial code: branch-specific place tuning and its experience-dependent decoupling",
            "Publication year": 2020,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.01.24.916643v1.abstract",
            "Abstract": "Dendrites of pyramidal neurons integrate different sensory inputs, and non-linear dendritic computations drive feature selective tuning and plasticity. Yet little is known about how dendrites themselves represent the environment, the degree to which they are coupled to their soma, and how that coupling is sculpted with experience. In order to answer these questions, we developed a novel preparation in which we image soma and connected dendrites in a single plane across days using in vivo two-photon microscopy. Using this preparation, we monitored spatially tuned activity in area CA3 of the hippocampus in head-fixed mice running on a linear track. We identified “place dendrites”, which can stably and precisely represent both familiar and novel spatial environments. Dendrites could display place tuning independent of their connected soma and even their sister dendritic branches, the first evidence for branch-specific tuning in the hippocampus. In a familiar environment, spatially tuned somata were more decoupled from their dendrites as compared to non-tuned somata. This relationship was absent in a novel environment, suggesting an experience dependent selective gating of dendritic spatial inputs. We then built a data-driven multicompartment computational model that could capture the experimentally observed correlations. Our model predicts that place cells exhibiting branch-specific tuning have more flexible place fields, while neurons with homogenous or co-tuned dendritic branches have higher place field stability. These findings demonstrate that spatial representation is organized in a branch-specific manner within dendrites of …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:bnK-pcrLprsC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "The role of distinct interneuron cell types in initiation and maintenance of persistent activity in a prefrontal cortical microcircuit model",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reflections on the past two decades of neuroscience",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41583-020-0363-6",
            "Abstract": "The first issue of Nature Reviews Neuroscience was published 20 years ago, in 2000. To mark this anniversary, in this Viewpoint article we asked a selection of researchers from across the field who have authored pieces published in the journal in recent years for their thoughts on notable and interesting developments in neuroscience, and particularly in their areas of the field, over the past two decades. They also provide some thoughts on current lines of research and questions that excite them.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:t6usbXjVLHcC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Dendritic Computation",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=12434631032290516897&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Dentate gyrus circuitry features improve performance of sparse approximation algorithms",
            "Publication year": 2015,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0117023",
            "Abstract": "Memory-related activity in the Dentate Gyrus (DG) is characterized by sparsity. Memory representations are seen as activated neuronal populations of granule cells, the main encoding cells in DG, which are estimated to engage 2–4% of the total population. This sparsity is assumed to enhance the ability of DG to perform pattern separation, one of the most valuable contributions of DG during memory formation. In this work, we investigate how features of the DG such as its excitatory and inhibitory connectivity diagram can be used to develop theoretical algorithms performing Sparse Approximation, a widely used strategy in the Signal Processing field. Sparse approximation stands for the algorithmic identification of few components from a dictionary that approximate a certain signal. The ability of DG to achieve pattern separation by sparsifing its representations is exploited here to improve the performance of the state of the art sparse approximation algorithm “Iterative Soft Thresholding” (IST) by adding new algorithmic features inspired by the DG circuitry. Lateral inhibition of granule cells, either direct or indirect, via mossy cells, is shown to enhance the performance of the IST. Apart from revealing the potential of DG-inspired theoretical algorithms, this work presents new insights regarding the function of particular cell types in the pattern separation task of the DG.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Finding cancer-associated miRNAs: methods and tools",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s12033-011-9416-4.pdf",
            "Abstract": "Changes in the structure and/or the expression of protein coding genes were thought to be the major cause of cancer for many decades. The recent discovery of non-coding RNA (ncRNA) transcripts (i.e., microRNAs) suggests that the molecular biology of cancer is far more complex. MicroRNAs (miRNAs) have been under investigation due to their involvement in carcinogenesis, often taking up roles of tumor suppressors or oncogenes. Due to the slow nature of experimental identification of miRNA genes, computational procedures have been applied as a valuable complement to cloning. Numerous computational tools, implemented to recognize the features of miRNA biogenesis, have resulted in the prediction of novel miRNA genes. Computational approaches provide clues as to which are the dominant features that characterize these regulatory units and furthermore act by narrowing down the search …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:IWHjjKOFINEC",
            "Publisher": "Humana Press Inc"
        },
        {
            "Title": "Classification capacity of a modular neural network implementing neurally inspired architecture and training rules",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1296687/",
            "Abstract": "A three-layer neural network (NN) with novel adaptive architecture has been developed. The hidden layer of the network consists of slabs of single neuron models, where neurons within a slab-but not between slabs- have the same type of activation function. The network activation functions in all three layers have adaptable parameters. The network was trained using a biologically inspired, guided-annealing learning rule on a variety of medical data. Good training/testing classification performance was obtained on all data sets tested. The performance achieved was comparable to that of SVM classifiers. It was shown that the adaptive network architecture, inspired from the modular organization often encountered in the mammalian cerebral cortex, can benefit classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new microRNA target prediction tool identifies a novel interaction of a putative miRNA with CCND2",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.4161/rna.21725",
            "Abstract": "Computational methods for miRNA target prediction vary in the algorithm used; and while one can state opinions about the strengths or weaknesses of each particular algorithm, the fact of the matter is that they fall substantially short of capturing the full detail of physical, temporal and spatial requirements of miRNA::target-mRNA interactions. Here, we introduce a novel miRNA target prediction tool called Targetprofiler that utilizes a probabilistic learning algorithm in the form of a hidden Markov model trained on experimentally verified miRNA targets. Using a large scale protein downregulation data set we validate our method and compare its performance to existing tools. We find that Targetprofiler exhibits greater correlation between computational predictions and protein downregulation and predicts experimentally verified miRNA targets more accurately than three other tools. Concurrently, we use primer extension …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "A simulation study on the effects of dendritic morphology on layer V PFC pyramidal cell firing behavior",
            "Publication year": 2014,
            "Publication url": "https://www.frontiersin.org/10.3389/conf.fnsys.2014.05.00023/event_abstract",
            "Abstract": "The majority of neuronal cells found in the cerebral cortex are pyramidal neurons. Their function has been associated with higher cognitive and emotional functions. Pyramidal neurons have a characteristic structure, consisting of a triangular shaped soma whereon descend two extended and complex dendritic trees, and a long bifurcated axon. All the morphological components of the pyramidal neurons exhibit significant variability across different brain areas and layers. Pyramidal cells receive numerous synaptic inputs along their structure, integration of which in space and in time generates local dendritic spikes that shape their firing pattern. In addition, synaptic integration is influenced by voltage-gated and ion channels, which are expressed in a large repertoire by pyramidal neurons. Electrophysiological categories of pyramidal cells can be established, based on the action potential frequency, generated from a …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Choice and value flexibility jointly contribute to the capacity of a subsampled quadratic classifier",
            "Publication year": 2000,
            "Publication url": "https://direct.mit.edu/neco/article-abstract/12/5/1189/6362",
            "Abstract": "Biophysical modeling studies have suggested that neurons with active dendrites can be viewed as linear units augmented by product terms that arise from interactions between synaptic inputs within the same dendritic subregions. However, the degree to which local nonlinear synaptic interactions could augment the memory capacity of a neuron is not known in a quantitative sense. To approach this question, we have studied the family of subsampled quadratic classifiers: linear classifiers augmented by the best k terms from the set of K = (d2 + d)/2 second-order product terms available in d dimensions. We developed an expression for the total parameter entropy, whose form shows that the capacity of an SQ classifier does not reside solely in its conventional weight values—the explicit memory used to store constant, linear, and higher-order coefficients. Rather, we identify a second type of parameter flexibility …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two Distinct Sets of Ca2+ and K+ Channels Are Activated at Different Membrane Potentials by the Climbing Fiber Synaptic Potential in Purkinje Neuron Dendrites.",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=8528252476554735099&hl=en&oi=scholarr",
            "Abstract": "In cerebellar Purkinje neuron dendrites, the transient depolarization associated with a climbing fiber (CF) EPSP activates voltage-gated Ca2+ channels (VGCCs), voltage-gated K+ channels (VGKCs), and Ca2+-activated SK and BK K+ channels. The resulting membrane potential (V m) and Ca2+ transients play a fundamental role in dendritic integration and synaptic plasticity of parallel fiber inputs. Here we report a detailed investigation of the kinetics of dendritic Ca2+ and K+ channels activated by CF-EPSPs, based on optical measurements of V m and Ca2+ transients and on a single-compartment NEURON model reproducing experimental data. We first measured V m and Ca2+ transients associated with CF-EPSPs at different initial V m, and we analyzed the changes in the Ca2+ transients produced by the block of each individual VGCCs, of A-type VGKCs and of SK and BK channels. Then, we constructed a …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CREB regulates excitability and the allocation of memory to subsets of neurons in the amygdala",
            "Publication year": 2009,
            "Publication url": "https://www.nature.com/articles/nn.2405",
            "Abstract": "The mechanisms that determine how information is allocated to specific regions and cells in the brain are important for memory capacity, storage and retrieval, but are poorly understood. We manipulated CREB in a subset of lateral amygdala neurons in mice with a modified herpes simplex virus (HSV) and reversibly inactivated transfected neurons with the Drosophila allatostatin G protein–coupled receptor (AlstR)/ligand system. We found that inactivation of the neurons transfected with HSV-CREB during training disrupted memory for tone conditioning, whereas inactivation of a similar proportion of transfected control neurons did not. Whole-cell recordings of fluorescently tagged transfected neurons revealed that neurons with higher CREB levels are more excitable than neighboring neurons and showed larger synaptic efficacy changes following conditioning. Our findings demonstrate that CREB modulates the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Modeling Stress-Induced Regulatory Cascades with Artificial Neural Networks",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30822193/10.1.1.193.2002.pdf",
            "Abstract": "Yeast cells live in a constantly changing environment that requires the continuous adaptation of their genomic program in order to sustain their homeostasis, survive and proliferate. Due to the advancement of high throughput technologies, there is currently a large amount of data such as gene expression, gene deletion and protein-protein interactions for S. Cerevisiae under various environmental conditions. Mining these datasets requires efficient computational methods capable of integrating different types of data, identifying inter-relations between different components and inferring functional groups or ‘modules’ that shape intracellular processes. This study uses computational methods to delineate some of the mechanisms used by yeast cells to respond to environmental changes. The GRAM algorithm is first used to integrate gene expression data and ChIP-chip data in order to find modules of coexpressed and co-regulated genes as well as the transcription factors (TFs) that regulate these modules. Since transcription factors are themselves transcriptionally regulated, a three-layer regulatory cascade consisting of the TF-regulators, the TFs and the regulated modules is subsequently considered. This three-layer cascade is then modeled quantitatively using artificial neural networks (ANNs) where the input layer corresponds to the expression of the up-stream transcription factors (TF-regulators) and the output layer corresponds to the expression of genes within each module. This work shows that (a) the expression of at least 33 genes over time and for different stress conditions is well predicted by the expression of the top layer transcription …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CoMuS: simulating coalescent histories and polymorphic data from multiple species",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/1755-0998.12544",
            "Abstract": "The simultaneous analysis of intra‐ and interspecies variation is challenging mainly because our knowledge about patterns of polymorphisms where both intra‐ and interspecies samples coexist is limited. In this study, we present CoMuS (Coalescent of Multiple Species), a multispecies coalescent software that can simulate intra‐ and interspecies polymorphisms. CoMuS supports a variety of speciation models and demographic scenarios related to the history of each species. In CoMuS, speciation can be accompanied by either instant or gradual isolation between sister species. Sampling may also occur in the past, and thus, we can study simultaneously extinct and extant species. Our software supports both the infinite‐ and the finite‐site model, with substitution rate heterogeneity among sites and a user‐defined proportion of invariable sites. We demonstrate the usage of CoMuS in various applications: species …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coding and decoding with dendrites",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0928425713000338",
            "Abstract": "Since the discovery of complex, voltage dependent mechanisms in the dendrites of multiple neuron types, great effort has been devoted in search of a direct link between dendritic properties and specific neuronal functions. Over the last few years, new experimental techniques have allowed the visualization and probing of dendritic anatomy, plasticity and integrative schemes with unprecedented detail. This vast amount of information has caused a paradigm shift in the study of memory, one of the most important pursuits in Neuroscience, and calls for the development of novel theories and models that will unify the available data according to some basic principles. Traditional models of memory considered neural cells as the fundamental processing units in the brain. Recent studies however are proposing new theories in which memory is not only formed by modifying the synaptic connections between neurons, but …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:TFP_iSt0sucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Use of artificial neural networks and a gamma-concept-based approach to model growth of and bacteriocin production by Streptococcus macedonicus ACA-DC 198 under simulated conditions of Kasseri cheese production",
            "Publication year": 2007,
            "Publication url": "https://journals.asm.org/doi/abs/10.1128/AEM.01721-06",
            "Abstract": "Growth of and bacteriocin production by Streptococcus macedonicus ACA-DC 198 were assessed and modeled under conditions simulating Kasseri cheese production. Controlled fermentations were performed in milk supplemented with yeast extract at different combinations of temperature (25, 40, and 55°C), constant pH (pHs 5 and 6), and added NaCl (at concentrations of 0, 2, and 4%, wt/vol). The data obtained were used to construct two types of predictive models, namely, a modeling approach based on the gamma concept, as well as a model based on artificial neural networks (ANNs). The latter computational methods were used on 36 control fermentations to quantify the complex relationships between the conditions applied (temperature, pH, and NaCl) and population behavior and to calculate the associated biokinetic parameters, i.e., maximum specific growth and cell count decrease rates and specific …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Society for Microbiology"
        },
        {
            "Title": "A deep learning framework for neuroscience",
            "Publication year": 2019,
            "Publication url": "https://www.nature.com/articles/s41593-019-0520-2?fbclid=IwAR1-L-MZRAuHO1YTFhAu5_zETTjgkHpEg5-HgGywEGpITbYQpU2Yld5IzrU",
            "Abstract": "Systems neuroscience seeks explanations for how the brain implements a wide variety of perceptual, cognitive and motor tasks. Conversely, artificial intelligence attempts to design computational systems based on the tasks they will have to solve. In artificial neural networks, the three components specified by design are the objective functions, the learning rules and the architectures. With the growing success of deep learning, which utilizes brain-inspired architectures, these three designed components have increasingly become central to how we model, engineer and optimize complex artificial learning systems. Here we argue that a greater focus on these components would also benefit systems neuroscience. We give examples of how this optimization-based framework can drive theoretical and experimental progress in neuroscience. We contend that this principled perspective on systems neuroscience will help …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Dendritic Self-Organizing Maps for Continual Learning",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.13611",
            "Abstract": "Current deep learning architectures show remarkable performance when trained in large-scale, controlled datasets. However, the predictive ability of these architectures significantly decreases when learning new classes incrementally. This is due to their inclination to forget the knowledge acquired from previously seen data, a phenomenon termed catastrophic-forgetting. On the other hand, Self-Organizing Maps (SOMs) can model the input space utilizing constrained k-means and thus maintain past knowledge. Here, we propose a novel algorithm inspired by biological neurons, termed Dendritic-Self-Organizing Map (DendSOM). DendSOM consists of a single layer of SOMs, which extract patterns from specific regions of the input space accompanied by a set of hit matrices, one per SOM, which estimate the association between units and labels. The best-matching unit of an input pattern is selected using the maximum cosine similarity rule, while the point-wise mutual information is employed for class inference. DendSOM performs unsupervised feature extraction as it does not use labels for targeted updating of the weights. It outperforms classical SOMs and several state-of-the-art continual learning algorithms on benchmark datasets, such as the Split-MNIST and Split-CIFAR-10. We propose that the incorporation of neuronal properties in SOMs may help remedy catastrophic forgetting.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The FENS‐Kavli Network for Excellence in Neuroscience: Advancing Science through Collaboration and Advocacy",
            "Publication year": 2017,
            "Publication url": "https://pubmed.ncbi.nlm.nih.gov/28321916/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dendrites of dentate gyrus granule cells contribute to pattern separation by controlling sparsity",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/hipo.22675",
            "Abstract": "The hippocampus plays a key role in pattern separation, the process of transforming similar incoming information to highly dissimilar, nonverlapping representations. Sparse firing granule cells (GCs) in the dentate gyrus (DG) have been proposed to undertake this computation, but little is known about which of their properties influence pattern separation. Dendritic atrophy has been reported in diseases associated with pattern separation deficits, suggesting a possible role for dendrites in this phenomenon. To investigate whether and how the dendrites of GCs contribute to pattern separation, we build a simplified, biologically relevant, computational model of the DG. Our model suggests that the presence of GC dendrites is associated with high pattern separation efficiency while their atrophy leads to increased excitability and performance impairments. These impairments can be rescued by restoring GC sparsity to …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Wiley"
        },
        {
            "Title": "Modeling regulatory cascades using Artificial Neural Networks: the case of transcriptional regulatory networks shaped during the yeast stress response",
            "Publication year": 2013,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fgene.2013.00110/full",
            "Abstract": "Over the last decade, numerous computational methods have been developed in order to infer and model biological networks. Transcriptional networks in particular have attracted significant attention due to their critical role in cell survival. The majority of network inference methods use genome-wide experimental data to search for modules of genes with coherent expression profiles and common regulators, often ignoring the multi-layer structure of transcriptional cascades. Modelling methodologies on the other hand assume a given network structure and vary significantly in their algorithmic approach, ranging from over-simplified representations (e.g. Boolean networks) to detailed -but computationally expensive-network simulations (e.g. with differential equations). In this work we use Artificial Neural Networks (ANNs) to model transcriptional regulatory cascades that emerge during the stress response in Saccharomyces cerevisiae and extend in two layers. We confine the structure of the ANNs to match the structure of the biological networks as determined by gene expression, DNA-protein interaction and experimental evidence provided in publicly available databases. Trained ANNs are able to predict the expression profile of 11 target genes across multiple experimental conditions with a Correlation Coefficient > 0.7. When time-dependent interactions between upstream transcription factors and their indirect targets are also included in the ANNs, accurate predictions are achieved for 30/34 target genes. Moreover, heterodimer formation is taken into account. We show that ANNs can be used to (a) accurately predict the expression of downstream …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:isC4tDSrTZIC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Large-Scale 3D Two-Photon Imaging of Molecularly Identified CA1 Interneuron Dynamics in Behaving Mice",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627320307133",
            "Abstract": "Cortical computations are critically reliant on their local circuit, GABAergic cells. In the hippocampus, a large body of work has identified an unprecedented diversity of GABAergic interneurons with pronounced anatomical, molecular, and physiological differences. Yet little is known about the functional properties and activity dynamics of the major hippocampal interneuron classes in behaving animals. Here we use fast, targeted, three-dimensional (3D) two-photon calcium imaging coupled with immunohistochemistry-based molecular identification to retrospectively map in vivo activity onto multiple classes of interneurons in the mouse hippocampal area CA1 during head-fixed exploration and goal-directed learning. We find examples of preferential subtype recruitment with quantitative differences in response properties and feature selectivity during key behavioral tasks and states. These results provide new insights …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:HE397vMXCloC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Towards Democratizing and Automating Online Conferences: Lessons from the Neuromatch Conferences",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1364661321000097",
            "Abstract": "Legacy conferences are costly and time consuming, and exclude scientists lacking various resources or abilities. During the 2020 pandemic, we created an online conference platform, Neuromatch Conferences (NMC), aimed at developing technological and cultural changes to make conferences more democratic, scalable, and accessible. We discuss the lessons we learned.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:PELIpwtuRlgC",
            "Publisher": "Elsevier Current Trends"
        },
        {
            "Title": "Creating and constraining compartmental models of neurons using experimental data",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-4939-3411-9_15.pdf",
            "Abstract": "In order to understand the information processing at the level of individual nerve cells, detailed information is required about the complex interactions between the anatomical structure of the neurons, their physiological properties, and synaptic input. Embodying such information in a formal theoretical model is useful as a predictor as it can simulate the electrical behavior of neurons in ways or conditions that may not be possible experimentally. In order for a model neuron to perform as closely as a real neuron, it needs to be constrained against all the available experimental data. The calibration of the parameters in each compartment requires a careful examination of the relevant literature, experimental evidence, as well as the intuition of the experimenter. However the hand tuning of model parameters can be extremely tricky due to the increased complexity of today’s compartmental neuron models …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "MatureBayes: a probabilistic algorithm for identifying the mature miRNA within novel precursors",
            "Publication year": 2010,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0011843",
            "Abstract": "Background MicroRNAs (miRNAs) are small, single stranded RNAs with a key role in post-transcriptional regulation of thousands of genes across numerous species. While several computational methods are currently available for identifying miRNA genes, accurate prediction of the mature miRNA remains a challenge. Existing approaches fall short in predicting the location of mature miRNAs but also in finding the functional strand(s) of miRNA precursors.  Methodology/Principal Findings Here, we present a computational tool that incorporates a Naive Bayes classifier to identify mature miRNA candidates based on sequence and secondary structure information of their miRNA precursors. We take into account both positive (true mature miRNAs) and negative (same-size non-mature miRNA sequences) examples to optimize sensitivity as well as specificity. Our method can accurately predict the start position of experimentally verified mature miRNAs for both human and mouse, achieving a significantly larger (often double) performance accuracy compared with two existing methods. Moreover, the method exhibits a very high generalization performance on miRNAs from two other organisms. More importantly, our method provides direct evidence about the features of miRNA precursors which may determine the location of the mature miRNA. We find that the triplet of positions 7, 8 and 9 from the mature miRNA end towards the closest hairpin have the largest discriminatory power, are relatively conserved in terms of sequence composition (mostly contain a Uracil) and are located within or in very close proximity to the hairpin loop, suggesting the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:roLk4NBRz8UC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "An Architecture for the Acceleration of a Hybrid Leaky Integrate and Fire SNN on the Convey HC-2ex FPGA-Based Processor",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7966649/",
            "Abstract": "Neuromorphic computing is expanding by leaps and bounds through custom integrated circuits (digital and analog), and large scale platforms developed by industry or government-funded projects (e.g. TrueNorth and BrainScaleS, respectively). Whereas the trend is for massive parallelism and neuromorphic computation in order to solve problems, such as those that may appear in machine learning and deep learning algorithms, there is substantial work on brain-like highly accurate neuromorphic computing in order to model the human brain. In such a form of computing, spiking neural networks (SNN) such as the Hodgkin and Huxley model are mapped to various technologies, including FPGAs. In this work, we present a highly efficient FPGA-based architecture for the detailed hybrid Leaky Integrate and Fire SNN that can simulate generic characteristics of neurons of the cerebral cortex. This architecture supports …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Memory beyond synaptic plasticity: The role of intrinsic neuronal excitability",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=WFq6CgAAQBAJ&oi=fnd&pg=PA53&dq=info:jNNuE7SbulAJ:scholar.google.com&ots=Y6yoO7nGp5&sig=-QBmWpyc_gNZIXDNj3yuwkh0ceU",
            "Abstract": "Memory is the process by which our experiences modify neurons and neuronal networks in such a way that influence future behaviour, and can be classified in two very broad categories:(a) short-term (or working) memory, referring to the temporary storage of information used to guide future actions, and (b) long-term memory, referring to more permanent information storage. Identifying the mechanisms by which memories are allocated, stored, consolidated, and retrieved within individual neurons and neuronal networks is a very exciting field of contemporary neuroscience and has provided valuable insights regarding the ways in which neurons maximize information processing and storage. Decades of research have identified different mechanisms for memory formation:(a) physiological synaptic plasticity,(b) structural plasticity, and (c) plasticity of intrinsic excitability. In this chapter, we will focus on the behavioural and activity-induced plasticity of intrinsic neuronal excitability and we will discuss how this type of excitability modulation is involved in different aspects of short-and long-term memory processes.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilization of SSCprofiler to predict a new miRNA gene",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-60761-863-8_17",
            "Abstract": "Experimental identification provides a valuable yet slow and expensive method for predicting novel miRNA genes. With the advent of computational procedures, it is now possible to capture characteristic features of miRNA biogenesis in an in silico model, resulting thereafter in the fast and inexpensive prediction of multiple novel miRNA gene candidates. These computational tools provide valuable clues to experimentalists, allowing them to narrow down their search space, making experimental verification less time consuming and less costly. Furthermore, the computational model itself can provide biological information as to which are the dominant features that characterize these regulatory units. Moreover, large-scale, high-throughput techniques, such as deep sequencing and tiling arrays, require computational methods to analyze this vast amount of data. Computational miRNA gene prediction tools are …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:4DMP91E08xMC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Improved grading and survival prediction of human astrocytic brain tumors by artificial neural network analysis of gene expression microarray data",
            "Publication year": 2008,
            "Publication url": "https://mct.aacrjournals.org/content/7/5/1013.short",
            "Abstract": "Histopathologic grading of astrocytic tumors based on current WHO criteria offers a valuable but simplified representation of oncologic reality and is often insufficient to predict clinical outcome. In this study, we report a new astrocytic tumor microarray gene expression data set (n = 65). We have used a simple artificial neural network algorithm to address grading of human astrocytic tumors, derive specific transcriptional signatures from histopathologic subtypes of astrocytic tumors, and asses whether these molecular signatures define survival prognostic subclasses. Fifty-nine classifier genes were identified and found to fall within three distinct functional classes, that is, angiogenesis, cell differentiation, and lower-grade astrocytic tumor discrimination. These gene classes were found to characterize three molecular tumor subtypes denoted ANGIO, INTER, and LOWER. Grading of samples using these subtypes agreed …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:qjMakFHDy7sC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Pyramidal neuron as two-layer neural network",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627303001491",
            "Abstract": "The pyramidal neuron is the principal cell type in the mammalian forebrain, but its function remains poorly understood. Using a detailed compartmental model of a hippocampal CA1 pyramidal cell, we recorded responses to complex stimuli consisting of dozens of high-frequency activated synapses distributed throughout the apical dendrites. We found the cell's firing rate could be predicted by a simple formula that maps the physical components of the cell onto those of an abstract two-layer “neural network.” In the first layer, synaptic inputs drive independent sigmoidal subunits corresponding to the cell's several dozen long, thin terminal dendrites. The subunit outputs are then summed within the main trunk and cell body prior to final thresholding. We conclude that insofar as the neural code is mediated by average firing rate, a two-layer neural network may provide a useful abstraction for the computing function of the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Individualized markers optimize class prediction of microarray data",
            "Publication year": 2006,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-7-345",
            "Abstract": "Identification of molecular markers for the classification of microarray data is a challenging task. Despite the evident dissimilarity in various characteristics of biological samples belonging to the same category, most of the marker – selection and classification methods do not consider this variability. In general, feature selection methods aim at identifying a common set of genes whose combined expression profiles can accurately predict the category of all samples. Here, we argue that this simplified approach is often unable to capture the complexity of a disease phenotype and we propose an alternative method that takes into account the individuality of each patient-sample. Instead of using the same features for the classification of all samples, the proposed technique starts by creating a pool of informative gene-features. For each sample, the method selects a subset of these features whose expression profiles are most likely to accurately predict the sample's category. Different subsets are utilized for different samples and the outcomes are combined in a hierarchical framework for the classification of all samples. Moreover, this approach can innately identify subgroups of samples within a given class which share common feature sets thus highlighting the effect of individuality on gene expression. In addition to high classification accuracy, the proposed method offers a more individualized approach for the identification of biological markers, which may help in better understanding the molecular background of a disease and emphasize the need for more flexible medical interventions.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:WF5omc3nYNoC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "The role of microcircuits in the pre-frontal cortex in detecting and encoding temporally patterned information",
            "Publication year": 2015,
            "Publication url": "https://bmcneurosci.biomedcentral.com/articles/10.1186/1471-2202-16-S1-P197",
            "Abstract": "Working memory is the capacity of the brain to hold information temporarily for immediate use. The neural correlate of this type of short-term memory is persistent spiking activity (PA) of both excitatory and inhibitory neurons, mainly in the pre-frontal cortex (PFC). Neurons embedded in PFC microcircuits integrate widespread information from various brain regions. PFC microcircuits of~ ten neurons are characterized by highly reciprocal connections and non-linear integration in their dendrites. Understanding how dendrites integrate information from multiple sources is crucial to explain their functional role. Spatial and temporal integration of signals occurs at dendrites before propagating to the soma, and plays a role in coding of information [1, 2]. The main question is whether and how pyramidal neurons in such circuits can detect temporally structured information in order to timely adjust behavior. Dendrites of cortical pyramidal neurons have been shown to exhibit temporal sensitivity [1]. To address this question, we constructed a detailed PFC microcircuit, implemented in the NEURON simulation environment. We used reconstructed morphologies of layer 5 PFC pyramidal neurons, validated against experimental findings. The microcircuit consisted of nine pyramidal neurons and two interneurons, all interconnected [3]. To investigate temporal coding, we delivered temporally structured input to four out of the nine pyramidal neurons and assessed, given persistent activity emergence, a) the time-to-first-spike (ttfs) of each pyramidal cell and b) the Inter-Spike Intervals (ISIs) during PA. We find that temporally patterned inputs (simulated as different …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:yD5IFk8b50cC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "PLACE CELL FORMATION BY GRID CELL CONVERGENCE IN THE DENDRITES OF A CA1 MODEL NEURON",
            "Publication year": 2014,
            "Publication url": "https://www.frontiersin.org/10.3389/conf.fnsys.2014.05.00007/event_abstract",
            "Abstract": "Place cells are pyramidal neurons in CA1 and CA3 regions of hippocampus which fire selectively when the animal is located in a particular place in space. CA1 place cells receive synaptic input from CA3 via the Schaffer collateral fibers to their proximal apical and basal dendrites and from the third layer of medial entorhinal cortex to their apical tuft dendrites. Both of these input pathways encode spatial information. Grid cells, which form the entorhinal input to CA1 cells, have a spatial firing field with multiple peaks which displays a regularly spaced, triangular grid pattern that covers the entire space of a given environment. Both grid and place cells are phase-modulated by theta rhythm and this modulation may be important for their spatial properties. Studying the formation of place cells is an important step in understanding how representation of the external environment is coded in neural networks that constitute …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emerging applications of read profiles towards the functional annotation of the genome",
            "Publication year": 2015,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fgene.2015.00188/full",
            "Abstract": "Functional annotation of the genome in various species is important to understand their phenotypic complexity. The road towards functional annotation involves several challenges ranging from experiments on individual molecules to large-scale analysis of high-throughput sequencing (HTS) data. HTS data is typically a result of the protocol designed to address specific research questions. The sequencing results in reads, which when mapped to a reference genome often leads to the formation of distinct patterns (read profiles). Interpretation of these read profiles are essential for the analysis in relation to the research question addressed. Several strategies have been employed at varying levels of abstraction ranging from a somewhat ad hoc to a more systematic analysis of read profiles. These include methods which can compare read profiles, e.g. from direct (non-sequence based) alignments to classification of patterns into functional groups. In this review, we highlight the emerging applications of read profiles for the annotation of non-coding RNA and cis-regulatory regions such as enhancers and promoters. We also discuss the biological rationale behind their formation.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Memory capacity of linear vs. nonlinear models of dendritic integration",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=A6J8kzUhCcAC&oi=fnd&pg=PA157&dq=info:c0jFTxUSbbkJ:scholar.google.com&ots=K5h20-cBZs&sig=6Nuwdi_61tijMJXtoXS-7tYALzE",
            "Abstract": "Previous biophysical modeling work showed that nonlinear interactions among nearby synapses located on active dendritic trees can provide a large boost in the memory capacity of a cell (Mel, 1992a, 1992b). The aim of our present work is to quantify this boost by estimating the capacity of (1) a neuron model with passive dendritic integration where inputs are combined linearly across the entire cell followed by a single global threshold, and (2) an active dendrite model in which a threshold is applied separately to the output of each branch, and the branch subtotals are combined linearly. We focus here on the limiting case of binary-valued synaptic weights, and derive expressions which measure model capacity by estimating the number of distinct input-output functions available to both neuron types. We show that (1) the application of a fixed nonlinearity to each dendritic compartment substantially increases the model's flexibility,(2) for a neuron of realistic size, the capacity of the nonlinear cell can exceed that of the same-sized linear cell by more than an order of magnitude, and (3) the largest capacity boost occurs for cells with a relatively large number of dendritic subunits of relatively small size. We validated the analysis by empirically measuring memory capacity with randomized two-class classifica-tion problems, where a stochastic delta rule was used to train both linear and nonlinear models. We found that large capacity boosts predicted for the nonlinear dendritic model were readily achieved in practice.* http://Inc. usc. edu",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ANN-based simulation of transcriptional networks in Yeast",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394399/",
            "Abstract": "Artificial Neural Networks (ANNs) have recently been used to quantitatively model stress-induced transcriptional changes in gene regulatory networks, based on gene expression and DNA-binding information. Here, we extend this approach to study the MSN2/4 regulatory networks in Yeast, which are known to be involved in the stress response. We also refine the ANN models by incorporating the dynamics of transcriptional regulation and test our method on three networks involving YAP1. For the latter we make an extensive search in order to identify potential latencies between transcriptional activation and corresponding changes in the expression of targeted genes. Finally, we test our model's ability to replicate gene-deletion findings in the YAP1 networks. We find that our models can accurately capture the regulatory effect of different transcription factors, under both normal and gene knockout conditions and that …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards predicting persistent activity of neurons by statistical and fractal dimension-based features",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6707083/",
            "Abstract": "Persistent activity is the prolongation of neuronal firing that outlasts the presentation of a stimulus and has been recorded during the execution of working memory tasks in several cortical regions. The emergence of persistent activity is stimulus-specific: not all inputs lead to persistent firing, only `preferred' ones. However, the features of a stimulus or the stimulus-induced response that determine whether it will ignite persistent activity remain unknown. In this paper, we propose various statistical and fractal dimension-based features derived from the activity of a detailed biophysical Prefrontal Cortex microcircuit model, for the efficient classification of the upcoming Persistent or Non-Persistent-activity state. Moreover, by introducing a novel majority voting classification framework we manage to achieve classification rates up to 92.5%, suggesting that selected features carry important predictive information that may be …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial neural networks in action for an automated cell-type classification of biological neural networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9222095/",
            "Abstract": "Identification of different neuronal cell types is critical for understanding their contribution to brain functions. Yet, automated and reliable classification of neurons remains a challenge, primarily because of their biological complexity. Typical approaches include laborious and expensive immunohistochemical analysis while feature extraction algorithms based on cellular characteristics have recently been proposed. The former rely on molecular markers, which are often expressed in many cell types, while the latter suffer from similar issues: finding features that are distinctive for each class has proven to be equally challenging. Moreover, both approaches are time consuming and demand a lot of human intervention. In this work we establish the first, automated cell-type classification method that relies on neuronal activity rather than molecular or cellular features. We test our method on a real-world dataset comprising of …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Prediction of novel microRNA genes in cancer-associated genomic regions—a combined computational and experimental approach",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/nar/article-abstract/37/10/3276/2920690",
            "Abstract": "The majority of existing computational tools rely on sequence homology and/or structural similarity to identify novel microRNA (miRNA) genes. Recently supervised algorithms are utilized to address this problem, taking into account sequence, structure and comparative genomics information. In most of these studies miRNA gene predictions are rarely supported by experimental evidence and prediction accuracy remains uncertain. In this work we present a new computational tool (SSCprofiler) utilizing a probabilistic method based on Profile Hidden Markov Models to predict novel miRNA precursors. Via the simultaneous integration of biological features such as sequence, structure and conservation, SSCprofiler achieves a performance accuracy of 88.95% sensitivity and 84.16% specificity on a large set of human miRNA genes. The trained classifier is used to identify novel miRNA gene candidates located …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Optically induced calcium-dependent gene activation and labeling of active neurons using CaMPARI and Cal-Light",
            "Publication year": 2019,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnsyn.2019.00016/full?report=reader",
            "Abstract": "The advent of optogenetic methods has made it possible to use endogeneously produced molecules to image and manipulate cellular, subcellular and synaptic activity. It has also led to the development of photoactivatable calcium-dependent indicators that mark active synapses, neurons and circuits. Furthermore, calcium-dependent photoactivation can be used to trigger gene expression in active neurons. Here we describe two sets of protocols, one using CaMPARI and a second one using Cal-Light. CaMPARI, a calcium-modulated photoactivatable ratiometric integrator, enables rapid network-wide, tunable, all-optical functional circuit mapping. Cal-Light, a photoactivatable calcium sensor, while slower to respond than CaMPARI, has the capacity to trigger the expression of genes, including effectors, activators, indicators or other constructs. Here we describe the rationale and provide procedures for using these two calcium-dependent constructs (1) in vitro in dissociated primary neuronal cell cultures (CaMPARI & Cal-Light); (2) in vitro in acute brain slices for circuit mapping (CaMPARI); (3) in vivo for triggering photoconversion or gene expression (CaMPARI & Cal-Light); and finally, (4) for recovering photoconverted neurons post-fixation with immunocytochemistry (CaMPARI). The approaches and protocols we describe are examples of the potential uses of both CaMPARI and Cal-Light. The ability to mark and manipulate neurons that are active during specific epochs of behavior has a vast unexplored experimental potential.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:eflP2zaiRacC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Modulation of excitability in CA1 pyramidal neurons via the interplay of entorhinal cortex and CA3 inputs",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231206003717",
            "Abstract": "Hippocampal CA1 pyramidal neurons receive extrahippocampal and intrahippocampal inputs. The Schaffer collateral (SC) pathway, projecting to the stratum radiatum of the CA1 field, serves as the primary excitatory input to CA1 cells. The temporoammonic pathway (TA), converging at stratum lacunosum moleculare (SLM), appears to be inhibitory. The relative temporal occurrence of the stimuli conveyed by the two pathways seems to modulate the excitability of CA1 pyramidal neurons. Specifically, the excitatory effect of SC inputs is greatly attenuated when preceded by TA stimulation within a specific time window. This phenomenon is referred to as the spike-blocking effect. Dvorak-Carbone and Schuman found that spike-blocking efficacy temporally coincide with the GABAb signalling pathway, while spike blocking was almost abolished in the presence of GABAb antagonist. In this work, we study the contribution …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A novel and simple spike sorting implementation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7784777/",
            "Abstract": "Monitoring the activity of multiple, individual neurons that fire spikes in the vicinity of an electrode, namely perform a Spike Sorting (SS) procedure, comprises one of the most important tools for contemporary neuroscience in order to reverse-engineer the brain. As recording electrodes' technology rabidly evolves by integrating thousands of electrodes in a confined spatial setting, the algorithms that are used to monitor individual neurons from recorded signals have to become even more reliable and computationally efficient. In this work, we propose a novel framework of the SS approach in which a single-step processing of the raw (unfiltered) extracellular signal is sufficient for both the detection and sorting of the activity of individual neurons. Despite its simplicity, the proposed approach exhibits comparable performance with state-of-the-art approaches, especially for spike detection in noisy signals, and paves the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Encoding of spatio-temporal input characteristics by a CA1 pyramidal neuron model",
            "Publication year": 2010,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1001038",
            "Abstract": "The in vivo activity of CA1 pyramidal neurons alternates between regular spiking and bursting, but how these changes affect information processing remains unclear. Using a detailed CA1 pyramidal neuron model, we investigate how timing and spatial arrangement variations in synaptic inputs to the distal and proximal dendritic layers influence the information content of model responses. We find that the temporal delay between activation of the two layers acts as a switch between excitability modes: short delays induce bursting while long delays decrease firing. For long delays, the average firing frequency of the model response discriminates spatially clustered from diffused inputs to the distal dendritic tree. For short delays, the onset latency and inter-spike-interval succession of model responses can accurately classify input signals as temporally close or distant and spatially clustered or diffused across different stimulation protocols. These findings suggest that a CA1 pyramidal neuron may be capable of encoding and transmitting presynaptic spatiotemporal information about the activity of the entorhinal cortex-hippocampal network to higher brain regions via the selective use of either a temporal or a rate code.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Dendritic nonlinearities reduce network size requirements and mediate ON and OFF states of persistent activity in a PFC microcircuit model",
            "Publication year": 2014,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003764",
            "Abstract": "Technological advances have unraveled the existence of small clusters of co-active neurons in the neocortex. The functional implications of these microcircuits are in large part unexplored. Using a heavily constrained biophysical model of a L5 PFC microcircuit, we recently showed that these structures act as tunable modules of persistent activity, the cellular correlate of working memory. Here, we investigate the mechanisms that underlie persistent activity emergence (ON) and termination (OFF) and search for the minimum network size required for expressing these states within physiological regimes. We show that (a) NMDA-mediated dendritic spikes gate the induction of persistent firing in the microcircuit. (b) The minimum network size required for persistent activity induction is inversely proportional to the synaptic drive of each excitatory neuron. (c) Relaxation of connectivity and synaptic delay constraints eliminates the gating effect of NMDA spikes, albeit at a cost of much larger networks. (d) Persistent activity termination by increased inhibition depends on the strength of the synaptic input and is negatively modulated by dADP. (e) Slow synaptic mechanisms and network activity contain predictive information regarding the ability of a given stimulus to turn ON and/or OFF persistent firing in the microcircuit model. Overall, this study zooms out from dendrites to cell assemblies and suggests a tight interaction between dendritic non-linearities and network properties (size/connectivity) that may facilitate the short-memory function of the PFC.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Dendritic Computing: Branching Deeper into Machine Learning",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306452221005017",
            "Abstract": "In this paper, we discuss the nonlinear computational power provided by dendrites in biological and artificial neurons. We start by briefly presenting biological evidence about the type of dendritic nonlinearities, respective plasticity rules and their effect on biological learning as assessed by computational models. Four major computational implications are identified as improved expressivity, more efficient use of resources, utilizing internal learning signals, and enabling continual learning. We then discuss examples of how dendritic computations have been used to solve real-world classification problems with performance reported on well known data sets used in machine learning. The works are categorized according to the three primary methods of plasticity used–structural plasticity, weight plasticity, or plasticity of synaptic delays. Finally, we show the recent trend of confluence between concepts of deep learning …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Panayiota Poirazi",
            "Publication year": 2021,
            "Publication url": "https://www.cell.com/neuron/pdf/S0896-6273(21)00722-4.pdf",
            "Abstract": "In this Neuron Q&A, Panayiota Poirazi reflects on this past year's lessons and shares her not-so-direct trajectory in pursuit of her passion for neuroscience. Reminding us that science is a team game, she shares actionable steps to improve representation in science.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vasoactive intestinal polypeptide-expressing interneurons in the hippocampus support goal-oriented spatial learning",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627319300108",
            "Abstract": "Diverse computations in the neocortex are aided by specialized GABAergic interneurons (INs), which selectively target other INs. However, much less is known about how these canonical disinhibitory circuit motifs contribute to network operations supporting spatial navigation and learning in the hippocampus. Using chronic two-photon calcium imaging in mice performing random foraging or goal-oriented learning tasks, we found that vasoactive intestinal polypeptide-expressing (VIP+), disinhibitory INs in hippocampal area CA1 form functional subpopulations defined by their modulation by behavioral states and task demands. Optogenetic manipulations of VIP+ INs and computational modeling further showed that VIP+ disinhibition is necessary for goal-directed learning and related reorganization of hippocampal pyramidal cell population dynamics. Our results demonstrate that disinhibitory circuits in the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Impact of Structural Plasticity on Memory Capacity",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128037843000159",
            "Abstract": "Structural plasticity refers to diverse modifications in the anatomical properties of the neural tissue, including changes in the number, location, and size of spines, filopodia, dendritic and axonal branching patterns. While such changes have been extensively documented in the developing brain and/or as a result of learning, little is known about the way they influence the brain’s capacity to form, store, or recall new memories. In this chapter, we provide an overview of the forms and conditions under which structural modifications take place and discuss theoretical approaches that try to explain how such processes may affect learning and storage in the brain. Growing evidence suggests that activity-dependent reallocation of synapses, as well as dendritic remodeling, can enhance the learning and storage capacity of the neural tissue. This enhancement results primarily from the exploitation of nonlinear dendritic …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Differential effects of corticosterone on the slow afterhyperpolarization in the basolateral amygdala and CA1 region: possible role of calcium channel subunits",
            "Publication year": 2008,
            "Publication url": "https://journals.physiology.org/doi/abs/10.1152/jn.01137.2007",
            "Abstract": "The stress hormone corticosterone increases the amplitude of the slow afterhyperpolarization (sAHP) in CA1 pyramidal neurons, without affecting resting membrane potential, input resistance, or action potential characteristics. We here examined how corticosterone affects these properties in the basolateral amygdala (BLA). In the amygdala, corticosterone does not change the AHP amplitude, nor any of the passive and active membrane properties studied. The lack of effect on the AHP is surprising since in both areas corticosterone increases high-voltage–activated sustained calcium currents, which supposedly regulate the sAHP. We wondered whether corticosterone targets different calcium channel subunits in the two areas because currents through only one of the subunits (Cav1.3) are thought to alter the AHP amplitude. In situ hybridization studies revealed that CA1 cells express Cav1.2 and Cav1.3 subunits …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synaptic plasticity in dendrites: complications and coping strategies",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0959438817300880",
            "Abstract": "The elaborate morphology, nonlinear membrane mechanisms and spatiotemporally varying synaptic activation patterns of dendrites complicate the expression, compartmentalization and modulation of synaptic plasticity. To grapple with this complexity, we start with the observation that neurons in different brain areas face markedly different learning problems, and dendrites of different neuron types contribute to the cell’s input–output function in markedly different ways. By committing to specific assumptions regarding a neuron’s learning problem and its input–output function, specific inferences can be drawn regarding the synaptic plasticity mechanisms and outcomes that we ‘ought’ to expect for that neuron. Exploiting this assumption-driven approach can help both in interpreting existing experimental data and designing future experiments aimed at understanding the brain’s myriad learning processes.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Elsevier Current Trends"
        },
        {
            "Title": "The perfect grant and how to get it",
            "Publication year": 2017,
            "Publication url": "https://www.nature.com/articles/543151a",
            "Abstract": "According to an Editorial in Nature last year:“Young scientists face a harsher, more competitive, stricter, more dispiriting workplace than their bosses and senior colleagues did at the same stages of their own careers”(Nature 538, 427; 2016). I am a ‘young’(mid-career) scientist and although I don’t feel dispirited, I recognize many of the difficulties outlined in the Editorial. So, I expect, will my colleagues across the world: they experience a toxic combination of increased pressure and expectation mixed with dwindling financial support.Those of us in Europe have an opportunity to seek change. The European Union is consulting on possible revisions to its current research and innovation programme, Horizon 2020—the largest single source of scientific grants in the world. Young scientists should make their voices heard and ask for more. What do we want? To find out, the FENS-Kavli Network of Excellence, an academy …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A computational exploration of bacterial metabolic diversity identifying metabolic interactions and growth-efficient strain communities",
            "Publication year": 2011,
            "Publication url": "https://bmcsystbiol.biomedcentral.com/articles/10.1186/1752-0509-5-167",
            "Abstract": "Metabolic interactions involve the exchange of metabolic products among microbial species. Most microbes live in communities and usually rely on metabolic interactions to increase their supply for nutrients and better exploit a given environment. Constraint-based models have successfully analyzed cellular metabolism and described genotype-phenotype relations. However, there are only a few studies of genome-scale multi-species interactions. Based on genome-scale approaches, we present a graph-theoretic approach together with a metabolic model in order to explore the metabolic variability among bacterial strains and identify and describe metabolically interacting strain communities in a batch culture consisting of two or more strains. We demonstrate the applicability of our approach to the bacterium E. coli across different single-carbon-source conditions. A different diversity graph is constructed for each growth condition. The graph-theoretic properties of the constructed graphs reflect the inherent high metabolic redundancy of the cell to single-gene knockouts, reveal mutant-hubs of unique metabolic capabilities regarding by-production, demonstrate consistent metabolic behaviors across conditions and show an evolutionary difficulty towards the establishment of polymorphism, while suggesting that communities consisting of strains specifically adapted to a given condition are more likely to evolve. We reveal several strain communities of improved growth relative to corresponding monocultures, even though strain communities are not modeled to operate towards a collective goal, such as the community growth and we identify the range …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:ZeXyd9-uunAC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Arithmetic of subthreshold synaptic summation in a model CA1 pyramidal cell",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S089662730300148X",
            "Abstract": "The rules of synaptic integration in pyramidal cells remain obscure, in part due to conflicting interpretations of existing experimental data. To clarify issues, we developed a CA1 pyramidal cell model calibrated with a broad spectrum of in vitro data. Using simultaneous dendritic and somatic recordings and combining results for two different response measures (peak versus mean EPSP), two different stimulus formats (single shock versus 50 Hz trains), and two different spatial integration conditions (within versus between-branch summation), we found that the cell's subthreshold responses to paired inputs are best described as a sum of nonlinear subunit responses, where the subunits correspond to different dendritic branches. In addition to suggesting a new type of experiment and providing testable predictions, our model shows how conclusions regarding synaptic arithmetic can be influenced by an array of …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Synaptic clustering within dendrites: An emerging theory of memory formation",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0301008214001373",
            "Abstract": "It is generally accepted that complex memories are stored in distributed representations throughout the brain, however the mechanisms underlying these representations are not understood. Here, we review recent findings regarding the subcellular mechanisms implicated in memory formation, which provide evidence for a dendrite-centered theory of memory. Plasticity-related phenomena which affect synaptic properties, such as synaptic tagging and capture, synaptic clustering, branch strength potentiation and spinogenesis provide the foundation for a model of memory storage that relies heavily on processes operating at the dendrite level. The emerging picture suggests that clusters of functionally related synapses may serve as key computational and memory storage units in the brain. We discuss both experimental evidence and theoretical models that support this hypothesis and explore its advantages for …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:ldfaerwXgEUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Contributions of active dendrites and structural plasticity to the neural substrate for learning and memory",
            "Publication year": 2000,
            "Publication url": "https://search.proquest.com/openview/05e37f5780130d328626b1565a55fa5e/1?pq-origsite=gscholar&cbl=18750&diss=y",
            "Abstract": "Accumulating evidence indicates that dendrites of many neuron types contain voltage-dependent conductances that could enable thin dendritic subtrees to behave as independently thresholded integrative units. In addition, empirical data suggest that axons and dendrites retain to a large extent their capacity for structural plasticity in the adult brain. Take together, these findings raise the possibility of a novel form of information storage in neural tissue. Our goal in the present work is to quantify the degree to which the combination of active dendritic processing and structural plasticity could contribute to the memory capacity of neural tissue, and to relate this structure-based capacity to morphological and biophysical parameters of individual neurons. We address this question in three stages.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A simple method to simultaneously detect and identify spikes from raw extracellular recordings",
            "Publication year": 2015,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnins.2015.00452/full",
            "Abstract": "The ability to track when and which neurons fire in the vicinity of an electrode, in an efficient and reliable manner can revolutionize the neuroscience field. The current bottleneck lies in spike sorting algorithms; existing methods for detecting and discriminating the activity of multiple neurons rely on inefficient, multi-step processing of extracellular recordings. In this work, we show that a single-step processing of raw (unfiltered) extracellular signals is sufficient for both the detection and identification of active neurons, thus greatly simplifying and optimizing the spike sorting approach. The efficiency and reliability of our method is demonstrated in both real and simulated data.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Computational identification of miRNAs involved in cancer",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-60761-863-8_2.pdf",
            "Abstract": "Changes in the structure and/or the expression of protein-coding genes were thought to be the major cause of cancer for many decades. However, the recent discovery of non-coding RNA (ncRNA) transcripts suggests that the molecular biology of cancer is far more complex. MicroRNAs (miRNAs) are key players of the family of ncRNAs and they have been under extensive investigation because of their involvement in carcinogenesis, often taking up roles of tumor suppressors or oncogenes. Owing to the slow nature of experimental identification of miRNA genes, computational procedures have been applied as a valuable complement to cloning. Numerous computational tools, implemented to recognize the characteristic features of miRNA biogenesis, have resulted in the prediction of multiple novel miRNA genes. Computational approaches provide valuable clues as to which are the dominant features that …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Mechanisms underlying persistent activity in a model PFC microcircuit",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2202-10-S1-P42",
            "Abstract": "PFC neurons provide the means to establish behavioral continuity over time by sustaining their firing rate throughout the delay period during working memory tasks. So far, synaptic reverberation has been proposed to underlie the persistent activity, through recurrent excitation, within a homogenous network [1]. However, electrophysiological data suggest that the pyramidal network that supports this activity exhibits biophysical heterogeneity [2]. The goal of this study is to incorporate such biophysical data in a compartmental network model of layer V PFC neurons and investigate the role of cellular mechanisms in supporting persistent activity. Toward this goal, we developed a microcircuit containing both pyramidal and interneuron models of layer V PFC cells. The pyramidal neuron model is implemented in the NEURON simulation environment [3] and is morphologically simplified; it includes modeling equations for …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:Zph67rFs4hoC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "MicroRNAs and cancer—The search begins!",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4740183/",
            "Abstract": "For almost three decades, cancer was thought to result from changes in the structure and/or expression of protein coding genes. The discovery of thousands of genes that produce noncoding RNA (ncRNA) transcripts in the past few years suggested that the molecular biology of cancer is much more complex. MicroRNAs (miRNAs), an important group of ncRNAs, have recently been associated with tumorigenesis by acting either as tumor suppressors or oncogenes. Experimental prediction of miRNA genes is a slow process, because of the difficulties of cloning ncRNAs. Complementary to experimental approaches, a number of computational tools trained to recognize features of the biogenesis of miRNAs have significantly aided in the prediction of new miRNA candidates. By narrowing down the search space, computational approaches provide valuable clues as to which are the dominant features that characterize …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A bioinformatics approach for investigating the determinants of Drosha processing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701569/",
            "Abstract": "We use a bioinformatics approach to search for the biological features that determine the cleavage site of the Microprocessor complex (or Drosha) within known miRNA hairpins. Towards this goal, we employ a previously developed methodology, termed DuplexSVM, which can accurately identify the four ends of a miRNA:miRNA* duplex. Here we use DuplexSVM to study how the Drosha determines its cleavage site. We perform in silico mutagenesis experiments on 142 hairpins by changing the distance of the Drosha site from the loop tip or the stem - single stranded tails junction by adding or removing matching nucleotides. Our results suggest that the Drosha cleavage site is mainly determined by its distance from the terminal loop tip.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Structured connectivity exploits NMDA non-linearitites to induce dimensionally diverse responses in a PFC circuit",
            "Publication year": 2019,
            "Publication url": "https://www.biorxiv.org/content/10.1101/733519v1.full",
            "Abstract": "Prefrontal Cortex (PFC) exerts control on action selection and mediates behavioral flexibility that is imperative during working memory, when integration and retention of stimuli takes place. During a working memory task, neurons of the PFC rapidly modify their response properties in a context-dependent manner. Could this flexible tuning be mediated by temporary connectivity states, supported by single-cell mechanisms? Are these states bound by the underlying network connectivity? Indeed, pyramidal neurons of the PFC are characterized by prominent non-linear dendritic responses and participate in hyper-reciprocal networks. This work probes these questions using a detailed, PFC model network equipped with nonlinear synaptic mechanisms. The model reproduces a wide range of experimental findings with respect to the response properties of individual cells and the dynamic population responses. We propose that PFC neurons dynamically form functional assemblies by transiently recruiting non-linear dendritic phenomena, shaping a robust yet flexible population response.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Dendritic action potentials and computation in human layer 2/3 cortical neurons",
            "Publication year": 2020,
            "Publication url": "https://science.sciencemag.org/content/367/6473/83.abstract",
            "Abstract": "The active electrical properties of dendrites shape neuronal input and output and are fundamental to brain function. However, our knowledge of active dendrites has been almost entirely acquired from studies of rodents. In this work, we investigated the dendrites of layer 2 and 3 (L2/3) pyramidal neurons of the human cerebral cortex ex vivo. In these neurons, we discovered a class of calcium-mediated dendritic action potentials (dCaAPs) whose waveform and effects on neuronal output have not been previously described. In contrast to typical all-or-none action potentials, dCaAPs were graded; their amplitudes were maximal for threshold-level stimuli but dampened for stronger stimuli. These dCaAPs enabled the dendrites of individual human neocortical pyramidal neurons to classify linearly nonseparable inputs—a computation conventionally thought to require multilayered networks.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:wbdj-CoPYUoC",
            "Publisher": "American Association for the Advancement of Science"
        },
        {
            "Title": "A simulation study on the effects of dendritic morphology on layer V prefrontal pyramidal cell firing behavior",
            "Publication year": 2014,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncel.2014.00287/full",
            "Abstract": "Pyramidal cells, the most abundant neurons in neocortex, exhibit significant structural variability across different brain areas and layers in different species. Moreover, in response to a somatic step current, these cells display a range of firing behaviors, the most common being (1) repetitive action potentials (Regular Spiking - RS), and (2) an initial cluster of 2-5 action potentials with short ISIs followed by single spikes (Intrinsic Bursting - IB). A correlation between firing behavior and dendritic morphology has recently been reported. In this work we use computational modeling to investigate quantitatively the effects of the basal dendritic tree morphology on the firing behavior of 112 three-dimensional reconstructions of layer V PFC rat pyramidal cells. Particularly, we focus on how different morphological (diameter, total length, volume and branch number) and passive (Mean Electrotonic Path length) features of basal dendritic trees shape somatic firing when the spatial distribution of ionic mechanisms in the basal dendritic trees is uniform or non-uniform. Our results suggest that total length, volume and branch number are the best morphological parameters to discriminate the cells as RS or IB, regardless of the distribution of ionic mechanisms in basal trees. The discriminatory power of total length, volume and branch number remains high in the presence of different apical dendrites. These results suggest that morphological variations in the basal dendritic trees of layer V pyramidal neurons in the PFC influence their firing patterns in a predictive manner and may in turn influence the information processing capabilities of these neurons.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:35N4QoGY0k4C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Co-allocation to overlapping dendritic branches in the retrosplenial cortex integrates contextual memories across time",
            "Publication year": 2021,
            "Publication url": "https://europepmc.org/article/ppr/ppr413801",
            "Abstract": "Events occurring close in time are often linked in memory, providing an episodic timeline and a framework for those memories. Recent studies suggest that memories acquired close in time are encoded by overlapping neuronal ensembles, and that this overlap is necessary for memory linking. Transient increases in neuronal excitability drive this ensemble overlap, but whether dendritic plasticity plays a role in linking memories is unknown. Here, we show that contextual memory linking is not only dependent on ensemble overlap in the retrosplenial cortex (RSC), but also on RSC branch-specific dendritic allocation mechanisms. Using longitudinal two-photon calcium imaging of RSC dendrites, we show that the same dendritic segments are preferentially activated by two linked (but not independent) contextual memories, and that spine clusters added after each of two linked (but not independent) contextual memories are allocated to the same dendritic segments. Importantly, with a novel optogenetic tool, selectively targeted to activated dendritic segments following learning, we show that reactivation of dendrites tagged during the first context exploration is sufficient to link two contextual memories. These results demonstrate a causal role for dendritic mechanisms in memory linking and reveal a novel set of rules that govern how linked, and independent memories are allocated to dendritic compartments.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "GluA2 mRNA distribution and regulation by miR-124 in hippocampal neurons",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1044743114000438",
            "Abstract": "AMPA-type glutamate receptors mediate fast, excitatory neurotransmission in the brain, and their concentrations at synapses are important determinants of synaptic strength. We investigated the post-transcriptional regulation of GluA2, the calcium-impermeable AMPA receptor subunit, by examining the subcellular distribution of its mRNA and evaluating its translational regulation by microRNA in cultured mouse hippocampal neurons. Using computational approaches, we identified a conserved microRNA-124 (miR-124) binding site in the 3′UTR of GluA2 and demonstrated that miR-124 regulated the translation of GluA2 mRNA reporters in a sequence-specific manner in luciferase assays. While we hypothesized that this regulation might occur in dendrites, our biochemical and fluorescent in situ hybridization (FISH) data indicate that GluA2 mRNA does not localize to dendrites or synapses of mouse hippocampal …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:RGFaLdJalmkC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Prediction of novel miRNAs and their gene targets with implications in tumourigenesis",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Elena-Pirogova/publication/23763853_Investigating_the_Interaction_Between_Oncogene_and_Tumor_Suppressor_Protein/links/0fcfd5103c0fe7cb1e000000/Investigating-the-Interaction-Between-Oncogene-and-Tumor-Suppressor-Protein.pdf#page=22",
            "Abstract": "BackgroundMicro-RNAs (miRNAs) belong to a recently identified group of the large family of non-coding RNAs (1). A high percentage of miRNA genes have been located in cancer-associated genomic regions (CAGRs) and fragile sites (FRA)(3), thus implicating miRNAs in tumourigenic events. An example of such a case is the report of two known miRNAs (miR-15a and miR-16a) located in chromosome 13q14, a region deleted in more than half of B cell chronic lymphocytic leukemias (4)(B-CLLs). About 30% of miRNAs are found in the introns of other genes. It is generally thought that in most cases where the miRNA lies in the same orientation; the miRNA is cotranscribed with the host gene (5). This can have obvious implications when investigating genes that are highly expressed in certain cancers, whereby the careful investigation of their intronic sequences can lead to the identification of putative, intron-residing miRNAs, with a fundamental role in cancer development.In this study we aim to implement efficient miRNA precursor and target prediction, computational tools, using Hidden Markov Models (HMM) trained to recognise existing biological features of miRNA biogenesis, and conservation. Previous prediction approaches adopt a pipeline architecture, whereby sequences are eliminated as the pipeline proceeds (6, 7). The drawback of these approaches is that they loose numerous true miRNAs along the line due to stringent cut-offs that often do not apply to all miRNAs. Other approaches use homology to detect novel miRNAs with similarity to previously identified miRNAs (8-10). This method obviously fails when scanning distantly related …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cellular and Dendritic Memory Allocation",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-8094-5_25",
            "Abstract": "The physical basis of memory storage in the brain, the memory engram, is a long-standing question in neuroscience, yet an established theory of its realization is still missing. It is only recently that advances in genetic tools and cellular imaging have allowed the visualization of cellular correlates of learning and memory, thus beginning to uncover the rules that underlie the formation of new memory engrams in the brain. As data cumulate, memory formation appears to be a complex process that spans multiple layers, from the neural network down to the subcellular level. Dendrites in particular are suggested to play a central role, not only in the localized processing of incoming signals but also in controlling, both spatially and temporally, the plasticity of their synaptic connections. In this chapter, we discuss recent evidence regarding the formation of memory traces and their properties, paying special attention …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "The making of a detailed CA1 pyramidal neuron model",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0996-1_11",
            "Abstract": "The CA1 region of the hippocampal formation plays a key role in numerous learning and memory processes including working memory (Lee, 2002, 2003, 2004; Lee et al., 2005) acquisition and retrieval of contextual fear conditioning (Lee, 2004), temporal pattern completion (Hoang, 2008), temporal processing of information (Hunsaker et al., 2008), spatial and object novelty detection (Hunsaker et al., 2007; Vago, 2008) and several others. However, despite its functional significance, the exact ways in which neurons in the CA1 region contribute to all these memory processes remain elusive. According to a number of modelling studies, the function of the CA1 region is to compare information from its two primary inputs: (a) the Schaffer collateral afferents that relay processed cortical information from layer II of the entorhinal cortex via the trisynaptic loop and (b) the temporoammonic pathway which carries …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Challenging the point neuron dogma: FS basket cells as 2-stage nonlinear integrators",
            "Publication year": 2019,
            "Publication url": "https://www.nature.com/articles/s41467-019-11537-7",
            "Abstract": "Interneurons are critical for the proper functioning of neural circuits. While often morphologically complex, their dendrites have been ignored for decades, treating them as linear point neurons. Exciting new findings reveal complex, non-linear dendritic computations that call for a new theory of interneuron arithmetic. Using detailed biophysical models, we predict that dendrites of FS basket cells in both hippocampus and prefrontal cortex come in two flavors: supralinear, supporting local sodium spikes within large-volume branches and sublinear, in small-volume branches. Synaptic activation of varying sets of these dendrites leads to somatic firing variability that cannot be fully explained by the point neuron reduction. Instead, a 2-stage artificial neural network (ANN), with sub-and supralinear hidden nodes, captures most of the variance. Reduced neuronal circuit modeling suggest that this bi-modal, 2-stage integration …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:8AbLer7MMksC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "REMOD: A Tool for Analyzing and Remodeling the Dendritic Architecture of Neural Cells",
            "Publication year": 2016,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnana.2015.00156/full",
            "Abstract": "Dendritic morphology is a key determinant of how individual neurons acquire a unique signal processing profile. The highly branched dendritic structure that originates from the cell body, explores the surrounding 3D space in a fractal-like manner, until it reaches a certain amount of complexity. Its shape undergoes significant alterations under various physiological or neuropathological conditions. Yet, despite the profound effect that these alterations can have on neuronal function, the causal relationship between the two remains largely elusive. The lack of a systematic approach for remodeling neural cells and their dendritic trees is a key limitation that contributes to this problem. Such causal relationships can be inferred via the use of large-scale neuronal models whereby the anatomical plasticity of neurons is accounted for, in order to enhance their biological relevance and hence their predictive performance. To facilitate this effort, we developed a computational tool named REMOD that allows the structural remodeling of any type of virtual neuron. REMOD is written in Python and can be accessed through a dedicated web interface that guides the user through various options to manipulate selected neuronal morphologies. REMOD can also be used to extract meaningful morphology statistics for one or multiple reconstructions, including features such as sholl analysis, total dendritic length and area, path length to the soma, centrifugal branch order, diameter tapering and more. As such, the tool can be used both for the analysis and/or the remodeling of neuronal morphologies of any type.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Pattern separation in the hippocampus through the eyes of computational modeling",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/syn.21972",
            "Abstract": "Pattern separation is a mnemonic process that has been extensively studied over the years. It entails the ability ‐of primarily hippocampal circuits‐ to distinguish between highly similar inputs, via generating different neuronal activity (output) patterns. The dentate gyrus (DG) in particular has long been hypothesized to implement pattern separation by detecting and storing similar inputs as distinct representations. The ways in which these distinct representations can be generated have been explored in a number of theoretical and computational modeling studies. Here, we review two categories of pattern separation models: those that address the phenomenon in an abstract mathematical fashion and those that delve into the underlying biological mechanisms by taking into account the anatomy and/or physiology of hippocampal circuits. We summarize the strategies, findings and limitations of these modeling …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling stress-induced adaptations in Ca2+ dynamics",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231206003584",
            "Abstract": "A hippocampal stress response is mediated by the glucocorticoid and mineralocorticoid receptors and involves primarily delayed changes in hippocampal neuronal properties. In this study, we concentrate on stress-induced effects in CA1 neurons which include an enhancement of the slow afterhypolarization (sAHP), an increase in Ca2+ currents, specifically a presumed upregulation of the Cav1.2 subunit that mediates one type of the L-type Ca2+ currents (the Ls type), and a suppression of Ca2+ extrusion mechanism, manifested as a decrease in plasma membrane Ca2+-ATPase-1. The aim of our study lies in identifying a causal relationship between either or both of the changes in the Ca2+ dynamics system and the increase in the sAHP. We used a compartmental CA1 pyramidal neuron model that included detailed structural properties and biophysical mechanisms and was implemented in the NEURON …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:UebtZRa9Y70C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "26th Annual Computational Neuroscience Meeting (CNS* 2017): Part 1",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s12868-017-0370-3;",
            "Abstract": "Perception seems so simple. I look out of the window to see houses, trees, people walking past, the sky above, the grass below. I hear birds in the trees, cars going past, the distant sound of an alarm. The world is full of objects that make their presence known to me through my senses–what could be more simple? Yet the efficacy of perceptual experience hides a host of questions for which we do not yet have the answers. Information reaching our senses is generally incomplete, ambiguous, distributed in space and time and not neatly sorted according to its source, so a key function of our perceptual systems is to discover the likely causes of our sensations. Perception as inference or hypothesis testing, formalised in the predictive coding theory, offers an attractive framework for exploring these issues. From this perspective, regularities or patterns provide perceptual systems with some traction, allowing the formation …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:vRqMK49ujn8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Linking Memories across Time via Neuronal and Dendritic Overlaps in Model Neurons with Active Dendrites",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2211124716314012",
            "Abstract": "Memories are believed to be stored in distributed neuronal assemblies through activity-induced changes in synaptic and intrinsic properties. However, the specific mechanisms by which different memories become associated or linked remain a mystery. Here, we develop a simplified, biophysically inspired network model that incorporates multiple plasticity processes and explains linking of information at three different levels: (1) learning of a single associative memory, (2) rescuing of a weak memory when paired with a strong one, and (3) linking of multiple memories across time. By dissecting synaptic from intrinsic plasticity and neuron-wide from dendritically restricted protein capture, the model reveals a simple, unifying principle: linked memories share synaptic clusters within the dendrites of overlapping populations of neurons. The model generates numerous experimentally testable predictions regarding the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Methods for Dynamical Inference in Intracellular Networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-59745-440-7_28",
            "Abstract": "Equation-based algorithms make hypotheses regarding the biophysical dynamical laws that govern a biological system and in the form of a mathematical expression, aiming to interrelate the system components, in an effort to explain and verify the experimental observations. This approach is what we mainly regard as dynamical inference. Assumptions such as the deterministic or stochastic laws that govern the system dynamics, the degree of modeling spatial phenomena, the exact mathematical representations of these biophysical laws and constraints, comprise some of the main issues of the dynamical inference problem. Another class of algorithms considers the cell as a whole system that orchestrates its components under physio-chemical constraints towards the accomplishment of certain cellular functions. These approaches avoid the search of detailed equation forms as well as the demand of …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Mechanisms underlying the emergence of Up and Down states in a model PFC microcircuit",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2202-12-S1-O7",
            "Abstract": "ConclusionsOur results indicate that the generation of Up states in PFC is likely to involve not only a balance of excitation/inhibition provided within a microcircuit but also single-neuron dynamics shaped by intrinsic mechanisms. Interestingly, the duration of the Up state was significantly altered in only two of the conditions tested, namely, the enhancement of the NMDA current and the activation of the dADP mechanism. These findings suggest that the transition to more prolonged depolarizations is carefully controlled by the same mechanisms that have been associated with persistent firing during working memory tasks.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:QIV2ME_5wuYC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Dendritic nonlinearities enable PFC microcircuits to serve as predictive modules of persistent activity",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2202-14-S1-P319",
            "Abstract": "The ability to monitor and probe the activity of large neuronal networks both in vivo and in vitro has recently established that neurons of various brain regions are organized into spatially restricted clusters (or small assemblies) that are bi-directionally connected, share common inputs and are co-activated during behavioral tasks [1, 2]. Investigations regarding the functional implications of such neuronal clustering have proposed that this modularity may underlie the spiking irregularities seen in cortical activity in vivo [3] or code for the execution of a voluntary movement [4]. In the prefrontal cortex (PFC), such microcircuits are proposed to support the spontaneous emergence of Up and Down states [5], a phenomenon linked to persistent activity, which is the cellular correlate of working memory. In this work we investigate the functional role of PFC microcircuits in the expression of persistent activity, focusing on the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:M3NEmzRMIkIC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Modelling reduced excitability in aged CA1 neurons as a calcium-dependent process",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231204004084",
            "Abstract": "We use a multi-compartmental model of a CA1 pyramidal cell to study changes in hippocampal excitability that result from aging-induced alterations in calcium-dependent membrane mechanisms. The model incorporates N- and L-type calcium channels which are respectively coupled to fast and slow afterhyperpolarization potassium channels. Model parameters are calibrated using physiological data. Computer simulations reproduce the decreased excitability of aged CA1 cells, which results from increased internal calcium accumulation, subsequently larger postburst slow afterhyperpolarization, and enhanced spike frequency adaptation. We find that aging-induced alterations in CA1 excitability can be modelled with simple coupling mechanisms that selectively link specific types of calcium channels to specific calcium-dependent potassium channels.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Computational identification of bacterial communities",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30822189/10.1.1.193.6476.pdf",
            "Abstract": "Stable bacterial polymorphism on a single limiting resource may appear if between the evolved strains metabolic interactions take place that allow the exchange of essential nutrients [8]. Towards an attempt to predict the possible outcome of longrunning evolution experiments, a network based on the metabolic capabilities of homogeneous populations of every single gene knockout strain (nodes) of the bacterium E. coli is reconstructed. Potential metabolic interactions (edges) are allowed only between strains of different metabolic capabilities. Bacterial communities are determined by finding cliques in this network. Growth of the emerged hypothetical bacterial communities is simulated by extending the metabolic flux balance analysis model of Varma et al [2] to embody heterogeneous cell population growth in a mutual environment.Results from aerobic growth on 10 different carbon sources are presented. The upper bounds of the diversity that can emerge from single-cloned populations of E. coli such as the number of strains that appears to metabolically differ from most strains (highly connected nodes), the maximum clique size as well as the number of all the possible communities are determined. Certain single gene deletions are identified to consistently participate in our hypothetical bacterial communities under most environmental conditions implying a pattern of growth-condition-invariant strains with similar metabolic effects. Moreover, evaluation of all the hypothetical bacterial communities under growth on pyruvate reveals heterogeneous populations that can exhibit superior growth performance when compared to the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prediction of miRNA targets",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-2291-8_13",
            "Abstract": "Computational methods for miRNA target prediction are currently undergoing extensive review and evaluation. There is still a great need for improvement of these tools and bioinformatics approaches are looking towards high-throughput experiments in order to validate predictions. The combination of large-scale techniques with computational tools will not only provide greater credence to computational predictions but also lead to the better understanding of specific biological questions. Current miRNA target prediction tools utilize probabilistic learning algorithms, machine learning methods and even empirical biologically defined rules in order to build models based on experimentally verified miRNA targets. Large-scale protein downregulation assays and next-generation sequencing (NGS) are now being used to validate methodologies and compare the performance of existing tools. Tools that exhibit …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Hotspots of dendritic spine turnover facilitate clustered spine addition and learning and memory",
            "Publication year": 2018,
            "Publication url": "https://www.nature.com/articles/s41467-017-02751-2",
            "Abstract": "Modeling studies suggest that clustered structural plasticity of dendritic spines is an efficient mechanism of information storage in cortical circuits. However, why new clustered spines occur in specific locations and how their formation relates to learning and memory (L&M) remain unclear. Using in vivo two-photon microscopy, we track spine dynamics in retrosplenial cortex before, during, and after two forms of episodic-like learning and find that spine turnover before learning predicts future L&M performance, as well as the localization and rates of spine clustering. Consistent with the idea that these measures are causally related, a genetic manipulation that enhances spine turnover also enhances both L&M and spine clustering. Biophysically inspired modeling suggests turnover increases clustering, network sparsity, and memory capacity. These results support a hotspot model where spine turnover is the driver for …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Models of Dendritic Integration",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:Mojj43d5GZwC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "Impact of active dendrites and structural plasticity on the memory capacity of neural tissue",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627301002525",
            "Abstract": "We consider the combined effects of active dendrites and structural plasticity on the storage capacity of neural tissue. We compare capacity for two different modes of dendritic integration: (1) linear, where synaptic inputs are summed across the entire dendritic arbor, and (2) nonlinear, where each dendritic compartment functions as a separately thresholded neuron-like summing unit. We calculate much larger storage capacities for cells with nonlinear subunits and show that this capacity is accessible to a structural learning rule that combines random synapse formation with activity-dependent stabilization/elimination. In a departure from the common view that memories are encoded in the overall connection strengths between neurons, our results suggest that long-term information storage in neural tissue could reside primarily in the selective addressing of synaptic contacts onto dendritic subunits.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Cell Press"
        },
        {
            "Title": "A compressed sensing perspective of hippocampal function",
            "Publication year": 2014,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnsys.2014.00141/full",
            "Abstract": "Hippocampus is one of the most important information processing units in the brain. Input from the cortex passes through convergent axon pathways to the downstream hippocampal subregions and, after being appropriately processed, is fanned out back to the cortex. Here, we review evidence of the hypothesis that information flow and processing in the hippocampus complies with the principles of Compressed Sensing (CS). The CS theory comprises a mathematical framework that describes how and under which conditions, restricted sampling of information (data set) can lead to condensed, yet concise, forms of the initial, subsampled information entity (i.e. of the original data set). In this work, hippocampus related regions and their respective circuitry are presented as a CS-based system whose different components collaborate to realize efficient memory encoding and decoding processes. This proposition introduces a unifying mathematical framework for hippocampal function and opens new avenues for exploring coding and decoding strategies in the brain.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:lSLTfruPkqcC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Balancing family with a successful career in neuroscience",
            "Publication year": 2016,
            "Publication url": "https://infoscience.epfl.ch/record/218984",
            "Abstract": "After years of hard work as a student and postdoc, stressful negotiations and restless nights of agony regarding your academic future, you managed to secure a PI position and establish your own lab. And just when you thought you could relax a bit and enjoy some time with your family, or start a family, you find yourself facing massive levels of responsibility added to your research, that demand most of your time and energy. The challenge to balance a successful career with a happy family life is not a trivial one. This article is protected by copyright. All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Breakdown of spatial coding and interneuron synchronization in epileptic mice",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41593-019-0559-0",
            "Abstract": "Temporal lobe epilepsy causes severe cognitive deficits, but the circuit mechanisms remain unknown. Interneuron death and reorganization during epileptogenesis may disrupt the synchrony of hippocampal inhibition. To test this, we simultaneously recorded from the CA1 and dentate gyrus in pilocarpine-treated epileptic mice with silicon probes during head-fixed virtual navigation. We found desynchronized interneuron firing between the CA1 and dentate gyrus in epileptic mice. Since hippocampal interneurons control information processing, we tested whether CA1 spatial coding was altered in this desynchronized circuit, using a novel wire-free miniscope. We found that CA1 place cells in epileptic mice were unstable and completely remapped across a week. This spatial instability emerged around 6 weeks after status epilepticus, well after the onset of chronic seizures and interneuron death. Finally, CA1 network …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:5ugPr518TE4C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Synaptic clustering and memory formation",
            "Publication year": 2019,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnmol.2019.00300/full",
            "Abstract": "In the study of memory engrams, synaptic memory allocation is a newly emerged theme that focuses on how specific synapses come to store a given memory. Cumulating evidence from imaging and molecular experiments indicates that the recruitment of synapses that participate in the encoding and expression of a memory is neither random nor uniform. A hallmark observation is the emergence of groups of synapses which share similar response properties and/or similar input properties and are located within a stretch of a dendritic branch. This grouping of synapses has been termed “synapse clustering” and has been shown to emerge in many different memory related paradigms, as well as in in vitro studies. The clustering of synapses may emerge from synapses receiving similar input, or via many processes which allow for cross-talk between nearby synapses within a dendritic branch, leading to cooperative plasticity. Clustered synapses can act in concert to maximally exploit the nonlinear integration potential of the dendritic branches in which they reside. Their main contribution is to facilitate the induction of dendritic spikes and dendritic plateau potentials, which provide advanced computational and memory-related capabilities to dendrites and single neurons. In this review we present recent evidence which investigates the role of synapse clustering in dendritic integration, sensory perception, learning and memory as well as brain dysfunction. We also discuss recent theoretical work which explores the computational advantages provided by synapse clustering, leading to novel and revised theories of memory. As an eminent phenomenon …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Induction and modulation of persistent activity in a layer V PFC microcircuit model",
            "Publication year": 2013,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fncir.2013.00161/full",
            "Abstract": "Working memory refers to the temporary storage of information and is strongly associated with the prefrontal cortex (PFC). Persistent activity of cortical neurons, namely the activity that persists beyond the stimulus presentation, is considered the cellular correlate of working memory. Although past studies suggested that this type of activity is characteristic of large scale networks, recent experimental evidence imply that small, tightly interconnected clusters of neurons in the cortex may support similar functionalities. However, very little is known about the biophysical mechanisms giving rise to persistent activity in small-sized microcircuits in the prefrontal cortex. Here, we present a detailed biophysically –yet morphologically simplified- microcircuit model of layer V PFC neurons that incorporates connectivity constraints and is validated against a multitude of experimental data. We show that (a) a small-sized network can exhibit persistent activity under realistic stimulus conditions. (b) Its emergence depends strongly on the interplay of dADP, NMDA and GABAB currents. (c) Although increases in stimulus duration increase the probability of persistent activity induction, variability in the stimulus firing frequency does not consistently influence it. (d) Modulation of ionic conductances (Ih, ID, IsAHP, IcaL, IcaN, IcaR) differentially controls persistent activity properties in a location dependent manner. These findings suggest that modulation of the microcircuit’s firing characteristics is achieved primarily through changes in its intrinsic mechanism makeup, supporting the hypothesis of multiple bi-stable units in the PFC. Overall, the model generates a number of …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "… with Love, from Post to Pre",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0896627317308620",
            "Abstract": "In this issue of Neuron, Costa et al. (2017) introduce a theoretical framework that predicts the ratio of presynaptic and postsynaptic changes taking place during LTP and LTD and show that these processes co-operate so as to optimize the postsynaptic response statistics.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "The Impact of Systems Biology on the Digital Patient",
            "Publication year": 2007,
            "Publication url": "https://projects.ics.forth.gr/_pdf/brochures/EN69-5.pdf",
            "Abstract": "Substantial advances in predictive, preventive and personalized (PPP) medicine are starting to emerge from computational simulations of complex networked models of metabolism ranging to the molecular level of detail. From the systems biology perspective of the digital patient, diseases are perturbations of biological networks through defective genes or environmental stimuli, and therapies are the interventions needed to restore these networks to their normal states. The Bioinformatics group at FORTH Heraklion is developing novel computational methods for identifying new parts of these networks both from genomic sequences and from metabolite time-series, and to generate meaningful visualizations of them.",
            "Abstract entirety": 1,
            "Author pub id": "7IidNJMAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A computational study on how theta modulated inhibition can account for the long temporal windows in the entorhinal–hippocampal loop",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1074742715000234",
            "Abstract": "A recent experimental study (Mizuseki, Sirota, Pastalkova, & Buzsaki, 2009) has shown that the temporal delays between population activities in successive entorhinal and hippocampal anatomical stages are longer (about 70–80 ms) than expected from axon conduction velocities and passive synaptic integration of feed-forward excitatory inputs. We investigate via computer simulations the mechanisms that give rise to such long temporal delays in the hippocampus structures. A model of the dentate gyrus (DG), CA3 and CA1 microcircuits is presented that uses biophysical representations of the major cell types including granule cells, CA3 and CA1 pyramidal cells (PCs) and six types of interneurons: basket cells (BCs), axo-axonic cells (AACs), bistratified cells (BSCs), oriens lacunosum-moleculare cells (OLMs), mossy cells (MCs) and hilar perforant path associated cells (HC). Inputs to the network came from the …",
            "Abstract entirety": 0,
            "Author pub id": "7IidNJMAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Academic Press"
        }
    ]
}]