[{
    "name": "Panos Linos",
    "romanize name": "Panos Linos",
    "School-Department": "Computer Science and Software Engineering",
    "University": "Butler University",
    "Rank": "Καθηγητής",
    "Apella_id": 488,
    "Scholar name": "Panagiotis K. Linos",
    "Scholar id": "mYFmkiEAAAAJ",
    "Affiliation": "Professor of Computer Science and Software Engineering, Butler University",
    "Citedby": 368,
    "Interests": [
        "software engineering",
        "machine learning",
        "mobile app development"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=mYFmkiEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Next generation of distributed training utilizing SOA, cloud computing, and virtualization",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=9800900739014405272&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest Editorial: Special Issue on Software Maintenance and Evolution",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1542063/",
            "Abstract": "In systems developed without aspect-oriented programming, code implementing a crosscutting concern may be spread over many different parts of a system. Identifying such code automatically could be of great help during maintenance of the system. First of all, it allows a developer to more easily find the places in the code that must be changed when the concern changes and, thus, makes such changes less time consuming and less prone to errors. Second, it allows the code to be refactored to an aspect-oriented solution, thereby improving its modularity. In this paper, we evaluate the suitability of clone detection as a technique for the identification of crosscutting concerns. To that end, we manually identify five specific crosscutting concerns in an industrial C system and analyze to what extent clone detection is capable of finding them. We consider our results as a stepping stone toward an automated \"aspect miner …",
            "Abstract entirety": 0,
            "Author pub id": "mYFmkiEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EPICS: A service learning program at butler university",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1612059/",
            "Abstract": "In this paper we present our experiences teaching EPICS (engineering projects in community service) at Butler University, a small, private university, from within the Department of Computer Science and Software Engineering. The EPICS program began at Purdue University in 1995. The idea behind EPICS is to have undergraduate students earn college credit for working on long-term, multi-semester projects to benefit charity and non-profit organizations. The projects are student-driven, under faculty supervision. There are many good reasons for having an EPICS program in an undergraduate computer science major. It is excellent for leveraging knowledge from other areas of computer science such as databases, networks, operating systems, and of course software engineering. The students are highly motivated because the project is real: there are real clients who use the software, making the software lifecycle …",
            "Abstract entirety": 0,
            "Author pub id": "mYFmkiEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service learning in software engineering and maintenance",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1235440/",
            "Abstract": "We discuss a service-learning program called EPICS (engineering projects in community service). More specifically, we describe an effort to incorporate EPICS within computer science and computer engineering curricula at Purdue University and Butler University, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Learning without borders: Qualitative exploration of service-learning",
            "Publication year": 2008,
            "Publication url": "http://new.seceij.net/wp-content/uploads/2018/10/SECEIJ_Summer2018_Cox.pdf",
            "Abstract": "For the last four years, pharmacy, physician assistant, premedicine, and nursing students enrolled or associated with Butler University’s College of Pharmacy and Health Sciences (COPHS) and College of Liberal Arts and Science (LAS) have partnered with Barnabas Task to travel to the Dominican Republic (DR) for an annual medical mission trip. Barnabas Task, a nonprofit organization founded in Fort Wayne, Indiana, conducts multiple service trips every year with dental and medical professionals, as well as other volunteers, to the Dominican Republic, Cuba, or Guatemala. Barnabas Task’s mission is“community transformation through leadership development”(Barnabas Task, 2013), and they utilize community health evangelism (CHE) to accomplish this goal. During these mission experiences, students have the opportunity to assist medical providers through patient triage, medical scribing, and medication dispensing. Students also work directly with community leaders to educate them on public health topics including nutrition, exercise, smoking cessation, dental hygiene, and mosquito-borne illnesses. These community leaders can then educate others and spread the knowledge through grass roots. This philosophy of developing a relationship with host communities",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Employing Service Orientation to Enable Training as a Service in the US Army",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6529269/",
            "Abstract": "Currently many training systems acquired, fielded and sustained by the U.S. Army are unable to seamlessly comply with a continuously evolving and often complex computational environment. The current state of such training systems must advance to a Training as a Service (TaaS) future state in order to adapt to a volatile defense budget, conform to policy updates, and enhance the training capabilities afforded to the War fighter. TaaS will transform current Army training applications into distributed web-based services, allowing them to be accessible across any location via thin client workstations and wireless mobile devices. The motivation behind this migration is coming from the Common Operating Environment (COE) Architecture Guidance published by the U.S. Army Chief Information Officer and the Assistant Secretary of the Army for Acquisition, Logistics, and Technology. In order to achieve the COE …",
            "Abstract entirety": 0,
            "Author pub id": "mYFmkiEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Qualitative Findings from an Online Course on Machine Learning",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8658554/",
            "Abstract": "This is a full paper in the Innovate Practice category. It reports experiences while teaching a largely online course about Machine Learning at two separate Universities. We targeted our course for a much wider than usual audience -- as “Computer Science (CS) for All,” with undergraduate non-CS majors learning the same material alongside CS majors. We discuss why the majority of the students appreciated the flexibility of online classes designed for this wide group, and how they welcomed the opportunity to learn together about a “hot” topic such as Machine Learning. We explain our handling of challenges coordinating diverse and remote teams working with realistic big data of their own interest. Moreover, we describe how we engaged students in stimulating discussions about their readings and team projects, and how we balanced keeping everyone on the same pace while providing opportunities for learning …",
            "Abstract entirety": 0,
            "Author pub id": "mYFmkiEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modernizing the US Army's Live Training Product Line using a Cloud Migration Strategy: Early Experiences, Current Challenges and Future Roadmap.",
            "Publication year": 2016,
            "Publication url": "http://www.dspace.uce.edu.ec/bitstream/25000/14825/1/On%20the%20development%20of%20strategic%20games%20based%20on%20a%20semiotic%20analysis%20a%20case%20study%20of%20an%20optimized%20tic-tac-toe.pdf#page=573",
            "Abstract": "1U. SA Army, PEO STRI, Orlando, Florida, USA 2Butler University, Computer Science and Software Engineering, 4600 Sunset Avenue, Indianapolis, Indiana, USA 3U. SA Army, Modeling and Simulation, Ft. Eustis, Virginia, USA 4University of Central Florida, Computer Science, Orlando, Florida, USA",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Involving IT professionals in Scrum student teams: An empirical study on the impact of students’ learning",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9274190/",
            "Abstract": "This is a full paper under the Innovative Practice category. It presents an empirical study that describes our efforts, reflections and lessons learned from including Information Technology (IT) professionals in an undergraduate Computer Science and Software Engineering (CSSE) course, which introduces Scrum as an agile software development methodology. We discuss how students, who took such a course, perceive their interaction with IT professionals as an overall positive learning experience and an opportunity to interject real world lessons and scenarios into course content. Moreover, we report on some useful observations and the feedback we received from the professionals, who volunteered and committed to engage regularly with our student Scrum teams throughout this course. We discuss how we leveraged the feedback we received, from both students and IT professionals, to incrementally fine-tune our …",
            "Abstract entirety": 0,
            "Author pub id": "mYFmkiEAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teaching Machine Learning: A Step towards Introducing Computing in Undergraduate Education",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9206225/",
            "Abstract": "Stimulating a wider audience to learn about computing is a popular and important area of research. As a result, we see emerging efforts to create new undergraduate programs to prepare students for careers unavoidably connected to software development [1], [2]. Our own research motivation comes from such recent efforts and our primary goal is to offer a course on Machine Learning (ML) as a platform for students of different backgrounds to collaborate while learning together.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Maintainable systems with a business object approach",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1018937127347",
            "Abstract": "The concept of Business Objects (BOs) has been recently promoted as a new way of exploiting object‐orientation for achieving large‐grain reuse. In this paper, we address the issue of how to effectively re‐engineer business software applications using BOs as a reuse technique. To this end, we first identify the reuse features of business objects and then compare them with other reuse techniques. In addition, we show that software re‐engineering can be more economical when business objects are used. Our work also provides guidance on how to develop and use a Business Object Architecture (BOA), which is shared by a group of interrelated and interdependent software applications. We argue that such architecture allows for more efficient reuse and better maintainability and it is illustrated by means of a case study in a realistic manufacturing environment.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Maintenance support for web sites: A case study",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/988788/",
            "Abstract": "This paper reports on results gathered during a case study using a Web maintenance tool called Perlbot. The main objective of the study is to observe the history of modifications made on various Web documents. Based on selected metrics, we collect data with respect to how such sites are maintained and evolve. The data gathered support our hypothesis that there is a worldwide tendency to accumulate large numbers of stale documents over long periods of time. Moreover, our quantitative results reveal inconsistent Web maintenance activities spanning over various international sites.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ten Years of EPICS at Butler University: Experiences from Crafting a Service‐Learning Program for Computer Science and Software Engineering",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118319130.ch3",
            "Abstract": "This chapter describes lessons learned and challenges faced while crafting a service‐learning program called EPICS at Butler University. Drawing from such experience, the chapter presents a road map to anyone who is interested in creating a similar EPICS program. Emphasis is given on how a service learning pedagogical model can be incorporated within a computer science and/or software engineering (CSSE) curriculum successfully. Finally, some qualitative assessment data collected from our students and community partners are discussed that validate the success of EPICS at Butler.computer science; learning (artificial intelligence); software engineering",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:ufrVoPGSRksC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Teaching Machine Learning: A Step towards Introducing Computing in Undergraduate Education",
            "Publication year": 2020,
            "Publication url": "https://scholar.rose-hulman.edu/computersci_fac/239/",
            "Abstract": "\"Teaching Machine Learning: A Step towards Introducing Computing in Und\" by Steve \nChenoweth and P Linos Home Search Browse Collections My Account About DC Network \nDigital Commons Network™ Skip to main content Rose-Hulman Scholar Rose-Hulman \nInstitute of Technology Home About FAQ My Account < Previous Next > Home > \nCOMPUTER_SCIENCE > COMPUTERSCI_FAC > 239 Faculty Publications - Computer \nScience & Software Engineering Title Teaching Machine Learning: A Step towards \nIntroducing Computing in Undergraduate Education Authors Steve Chenoweth, Rose-Hulman \nInsitute of TechnologyFollow P Linos Document Type Article Publication Date 2020 \nRecommended Citation Linos, PK, & Chenoweth, S. (2020). - - Teaching Machine Learning: \nA Step towards Introducing Computing in Undergraduate Education. - -(- -). This document \nis currently not available here. Share COinS : -…",
            "Abstract entirety": 0,
            "Author pub id": "mYFmkiEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A service-learning program for computer science and software engineering",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/961511.961523",
            "Abstract": "This paper presents a service-learning educational program called EPICS (Engineering Projects In Community Service). It also describes our efforts and experiences from incorporating this program within a Computer Science and Software Engineering curriculum. Our paper concludes by discussing various key challenges and some early lessons learned while crafting such program.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TEN YEARS OF EPICS AT BUTLER UNIVERSITY",
            "Publication year": 2012,
            "Publication url": "http://epics.butler.edu/wp-content/uploads/2018/11/c03.pdf",
            "Abstract": "This chapter describes lessons learned and challenges faced while crafting a service-learning program called EPICS at Butler University. Drawing from such experience, the chapter presents a road map to anyone who is interested in creating a similar EPICS program. Emphasis is given on how a servicelearning pedagogical model can be incorporated within a computer science and/or software engineering (CSSE) curriculum successfully. Finally, some qualitative assessment data collected from our students and community partners are discussed that validate the success of EPICS at Butler.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "A tool for understanding multi-language program dependencies",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1199190/",
            "Abstract": "This paper describes a prototype tool that facilitates the process of understanding and managing multi-language program dependencies. More specifically, the software tool maintains a repository of host-to-foreign language dependencies between C/C++ and Java code. We describe some program comprehension features of the tool and we discuss a preliminary case study performed in order to verify its functionality and validate its usefulness. Based on the results of this study, we continue improving the tool.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer Science and Software Engineering",
            "Publication year": 2008,
            "Publication url": "https://www.butler.edu/sites/default/files/csse-butler-bulletin-21-22.pdf",
            "Abstract": "These disciplines are an excellent choice for students who enjoy problem solving and are good at mathematics and the sciences. Good communication skills are also a plus, as this type of work is typically done in small groups or as part of a team. Computers and software have become essential tools in all disciplines, so you can pair the study of computer science or software engineering with a major or minor in any other area of study, including the sciences, business, fine arts, or the humanities. Employment prospects in computer science and software engineering are excellent.",
            "Abstract entirety": 1,
            "Author pub id": "mYFmkiEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        }
    ]
}]