[{
    "name": "Άρτεμις - Γεωργία Χατζηγεωργίου",
    "romanize name": "Artemis - Georgia Chatzigeorgiou",
    "School-Department": "Πληροφορικής με Εφαρμογές στη Βιοϊατρική ",
    "University": "uth",
    "Rank": "Καθηγητής",
    "Apella_id": 19058,
    "Scholar name": "Artemis Hatzigeorgiou",
    "Scholar id": "iGhiEpEAAAAJ",
    "Affiliation": "Professor of  Bioinformatics, University of Thessaly",
    "Citedby": 21993,
    "Interests": [
        "Bioinformatics",
        "computational biology",
        "machine learning"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=iGhiEpEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "RNAcentral 2021: secondary structure integration, improved sequence search and new member databases",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/nar/article-abstract/49/D1/D212/5940500",
            "Abstract": "RNAcentral is a comprehensive database of non-coding RNA (ncRNA) sequences that provides a single access point to 44 RNA resources and >18 million ncRNA sequences from a wide range of organisms and RNA types. RNAcentral now also includes secondary (2D) structure information for >13 million sequences, making RNAcentral the world’s largest RNA 2D structure database. The 2D diagrams are displayed using R2DT, a new 2D structure visualization method that uses consistent, reproducible and recognizable layouts for related RNAs. The sequence similarity search has been updated with a faster interface featuring facets for filtering search results by RNA type, organism, source database or any keyword. This sequence search tool is available as a reusable web component, and has been integrated into several RNAcentral member databases, including Rfam, miRBase and snoDB. To allow for a …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:ye4kPcJQO24C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Impact of Helicobacter pylori Infection and Its Major Virulence Factor CagA on DNA Damage Repair",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/925790",
            "Abstract": "Helicobacter pylori infection induces a plethora of DNA damages. Gastric epithelial cells, in order to maintain genomic integrity, require an integrous DNA damage repair (DDR) machinery, which, however, is reported to be modulated by the infection. CagA is a major H. pylori virulence factor, associated with increased risk for gastric carcinogenesis. Its pathogenic activity is partly regulated by phosphorylation on EPIYA motifs. Our aim was to identify effects of H. pylori infection and CagA on DDR, investigating the transcriptome of AGS cells, infected with wild-type, ΔCagA and EPIYA-phosphorylation-defective strains. Upon RNA-Seq-based transcriptomic analysis, we observed that a notable number of DDR genes were found deregulated during the infection, potentially resulting to base excision repair and mismatch repair compromise and an intricate deregulation of nucleotide excision repair, homologous recombination and non-homologous end-joining. Transcriptome observations were further investigated on the protein expression level, utilizing infections of AGS and GES-1 cells. We observed that CagA contributed to the downregulation of Nth Like DNA Glycosylase 1 (NTHL1), MutY DNA Glycosylase (MUTYH), Flap Structure-Specific Endonuclease 1 (FEN1), RAD51 Recombinase, DNA Polymerase Delta Catalytic Subunit (POLD1), and DNA Ligase 1 (LIG1) and, contrary to transcriptome results, Apurinic/Apyrimidinic Endodeoxyribonuclease 1 (APE1) upregulation. Our study accentuates the role of CagA as a significant contributor of H. pylori infection-mediated DDR modulation, potentially disrupting the balance between DNA damage and …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Anti-apoptotic function of a microRNA encoded by the HSV-1 latency-associated transcript",
            "Publication year": 2006,
            "Publication url": "https://www.nature.com/articles/nature04836",
            "Abstract": "MicroRNAs (miRNAs) are a class of small RNA molecules that regulate the stability or the translational efficiency of target messenger RNAs (mRNAs) 1, 2. The latency-associated transcript (LAT) of herpes simplex virus-1 (HSV-1) is the only viral gene expressed during latent infection in neurons 3. LAT inhibits apoptosis and maintains latency by promoting the survival of infected neurons 4. No protein product has been attributed to the LAT gene and the mechanism by which LAT protects cells from apoptosis is not yet known. Here we show that a miRNA encoded by the HSV-1 LAT gene confers resistance to apoptosis. Neuroblastoma cells transfected with a fragment of the LAT gene show reduced susceptibility to cell death. The anti-apoptotic function of LAT has been mapped to a region within the first exon 5, 6. We have identified and characterized a microRNA (miR-LAT) generated from the exon 1 region of the …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "A positive regulatory loop between a Wnt-regulated non-coding RNA and ASCL2 controls intestinal stem cell fate",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2211124716306210",
            "Abstract": "The canonical Wnt pathway plays a central role in stem cell maintenance, differentiation, and proliferation in the intestinal epithelium. Constitutive, aberrant activity of the TCF4/β-catenin transcriptional complex is the primary transforming factor in colorectal cancer. We identify a nuclear long non-coding RNA, termed WiNTRLINC1, as a direct target of TCF4/β-catenin in colorectal cancer cells. WiNTRLINC1 positively regulates the expression of its genomic neighbor ASCL2, a transcription factor that controls intestinal stem cell fate. WiNTRLINC1 interacts with TCF4/β-catenin to mediate the juxtaposition of its promoter with the regulatory regions of ASCL2. ASCL2, in turn, regulates WiNTRLINC1 transcriptionally, closing a feedforward regulatory loop that controls stem cell-related gene expression. This regulatory circuitry is highly amplified in colorectal cancer and correlates with increased metastatic potential and …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "DIANA-TarBase v7. 0: indexing more than half a million experimentally supported miRNA: mRNA interactions",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/nar/article-abstract/43/D1/D153/2439410",
            "Abstract": "microRNAs (miRNAs) are short non-coding RNA species, which act as potent gene expression regulators. Accurate identification of miRNA targets is crucial to understanding their function. Currently, hundreds of thousands of miRNA:gene interactions have been experimentally identified. However, this wealth of information is fragmented and hidden in thousands of manuscripts and raw next-generation sequencing data sets. DIANA-TarBase was initially released in 2006 and it was the first database aiming to catalog published experimentally validated miRNA:gene interactions. DIANA-TarBase v7.0 (http://www.microrna.gr/tarbase) aims to provide for the first time hundreds of thousands of high-quality manually curated experimentally validated miRNA:gene interactions, enhanced with detailed meta-data. DIANA-TarBase v7.0 enables users to easily identify positive or negative experimental results, the utilized …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:D03iK_w7-QYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Lost in translation: an assessment and perspective for computational microRNA target identification",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/25/23/3049/216632",
            "Abstract": "MicroRNAs (miRNAs) are a class of short endogenously expressed RNA molecules that regulate gene expression by binding directly to the messenger RNA of protein coding genes. They have been found to confer a novel layer of genetic regulation in a wide range of biological processes. Computational miRNA target prediction remains one of the key means used to decipher the role of miRNAs in development and disease. Here we introduce the basic idea behind the experimental identification of miRNA targets and present some of the most widely used computational miRNA target identification programs. The review includes an assessment of the prediction quality of these programs and their combinations. Contact:           p.alexiou@fleming.gr          Supplementary information:           Supplementary data are available at Bioinformatics online.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "In vivo profiling of hypoxic gene expression in gliomas using the hypoxia marker EF5 and laser-capture microdissection",
            "Publication year": 2011,
            "Publication url": "https://cancerres.aacrjournals.org/content/71/3/779.short",
            "Abstract": "Hypoxia is a key determinant of tumor aggressiveness, yet little is known regarding hypoxic global gene regulation in vivo. We used the hypoxia marker EF5 coupled with laser-capture microdissection to isolate RNA from viable hypoxic and normoxic regions of 9L experimental gliomas. Through microarray analysis, we identified several mRNAs (including the HIF targets Vegf, Glut-1, and Hsp27) with increased levels under hypoxia compared with normoxia both in vitro and in vivo. However, we also found striking differences between the global in vitro and in vivo hypoxic mRNA profiles. Intriguingly, the mRNA levels of a substantial number of immunomodulatory and DNA repair proteins including CXCL9, CD3D, and RAD51 were found to be downregulated in hypoxic areas in vivo, consistent with a protumorigenic role of hypoxia in solid tumors. Immunohistochemical staining verified increased HSP27 and decreased …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:aqlVkmm33-oC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Frequency and fate of microRNA editing in human brain",
            "Publication year": 2008,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc2532740/",
            "Abstract": "Primary transcripts of certain microRNA (miRNA) genes (pri-miRNAs) are subject to RNA editing that converts adenosine to inosine (A→ I RNA editing). However, the frequency of the pri-miRNA editing and the fate of edited pri-miRNAs remain largely to be determined. Examination of already known pri-miRNA editing sites indicated that adenosine residues of the U A G triplet sequence might be edited more frequently. In the present study, therefore, we conducted a large-scale survey of human pri-miRNAs containing the U A G triplet sequence. By direct sequencing of RT–PCR products corresponding to pri-miRNAs, we examined 209 pri-miRNAs and identified 43 U A G and also 43 non-U A G editing sites in 47 pri-miRNAs, which were highly edited in human brain. In vitro miRNA processing assay using recombinant Drosha-DGCR8 and Dicer-TRBP (the human immuno deficiency virus transactivating response …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:roLk4NBRz8UC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "DIANA-mAP: Analyzing miRNA from Raw NGS Data to Quantification",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/945404",
            "Abstract": "microRNAs (miRNAs) are small non-coding RNAs (~ 22 nts) that are considered central post-transcriptional regulators of gene expression and key components in many pathological conditions. Next-Generation Sequencing (NGS) technologies have led to inexpensive, massive data production, revolutionizing every research aspect in the fields of biology and medicine. Particularly, small RNA-Seq (sRNA-Seq) enables small non-coding RNA quantification on a high-throughput scale, providing a closer look into the expression profiles of these crucial regulators within the cell. Here, we present DIANA-microRNA-Analysis-Pipeline (DIANA-mAP), a fully automated computational pipeline that allows the user to perform miRNA NGS data analysis from raw sRNA-Seq libraries to quantification and Differential Expression Analysis in an easy, scalable, efficient, and intuitive way. Emphasis has been given to data pre-processing, an early, critical step in the analysis for the robustness of the final results and conclusions. Through modularity, parallelizability and customization, DIANA-mAP produces high quality expression results, reports and graphs for downstream data mining and statistical analysis. In an extended evaluation, the tool outperforms similar tools providing pre-processing without any adapter knowledge. Closing, DIANA-mAP is a freely available tool. It is available dockerized with no dependency installations or standalone, accompanied by an installation manual through Github. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Editing of Epstein-Barr virus-encoded BART6 microRNAs controls their dicer targeting and consequently affects viral latency",
            "Publication year": 2010,
            "Publication url": "https://www.jbc.org/article/S0021-9258(20)47215-1/abstract",
            "Abstract": "Certain primary transcripts of miRNA (pri-microRNAs) undergo RNA editing that converts adenosine to inosine. The Epstein-Barr virus (EBV) genome encodes multiple microRNA genes of its own. Here we report that primary transcripts of ebv-miR-BART6 (pri-miR-BART6) are edited in latently EBV-infected cells. Editing of wild-type pri-miR-BART6 RNAs dramatically reduced loading of miR-BART6-5p RNAs onto the microRNA-induced silencing complex. Editing of a mutation-containing pri-miR-BART6 found in Daudi Burkitt lymphoma and nasopharyngeal carcinoma C666-1 cell lines suppressed processing of miR-BART6 RNAs. Most importantly, miR-BART6-5p RNAs silence Dicer through multiple target sites located in the 3′-UTR of Dicer mRNA. The significance of miR-BART6 was further investigated in cells in various stages of latency. We found that miR-BART6-5p RNAs suppress the EBNA2 viral oncogene …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Putative impact of CagA protein on DNA damage repair modulation during Helicobacter pylori infection",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=10597269687632813572&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:35r97b3x0nAC",
            "Publisher": "WILEY"
        },
        {
            "Title": "miRNP: mRNA association in polyribosomes in a human neuronal cell line",
            "Publication year": 2004,
            "Publication url": "https://rnajournal.cshlp.org/content/10/3/387.short",
            "Abstract": "MicroRNAs (miRNAs) are small regulatory RNAs that control gene expression by base-pairing with their mRNA targets. miRNAs assemble into ribonucleoprotein complexes termed miRNPs. Animal miRNAs recognize their mRNA targets via partial antisense complementarity and repress mRNA translation at a step after translation initiation. How animal miRNAs recognize their mRNA targets and how they control their translation is unknown. Here we describe that in a human neuronal cell line, the miRNP proteins eIF2C2 (a member of the Argonaute family of proteins), Gemin3, and Gemin4 along with miRNAs cosediment with polyribosomes. Furthermore, we describe a physical association between a let-7b (miRNA)-containing miRNP and its putative human mRNA target in polyribosome-containing fractions. These findings suggest that miRNP proteins may play important roles in target mRNA recognition and …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:WF5omc3nYNoC",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "Functional microRNA targets in protein coding sequences",
            "Publication year": 2012,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/28/6/771/312159",
            "Abstract": " Motivation: Experimental evidence has accumulated showing that microRNA (miRNA) binding sites within protein coding sequences (CDSs) are functional in controlling gene expression. Results: Here we report a computational analysis of such miRNA target sites, based on features extracted from existing mammalian high-throughput immunoprecipitation and sequencing data. The analysis is performed independently for the CDS and the 3′-untranslated regions (3′-UTRs) and reveals different sets of features and models for the two regions. The two models are combined into a novel computational model for miRNA target genes, DIANA-microT-CDS, which achieves higher sensitivity compared with other popular programs and the model that uses only the 3′-UTR target sites. Further analysis indicates that genes with shorter 3′-UTRs are preferentially targeted in the CDS, suggesting that …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:4DMP91E08xMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Human microRNA-155 on chromosome 21 differentially interacts with its polymorphic target in the AGTR1 3′ untranslated region: a mechanism for functional single-nucleotide polymorphisms related to phenotypes",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0002929707612063",
            "Abstract": "Animal microRNAs (miRNAs) regulate gene expression through base pairing to their targets within the 3′ untranslated region (UTR) of protein-coding genes. Single-nucleotide polymorphisms (SNPs) located within such target sites can affect miRNA regulation. We mapped annotated SNPs onto a collection of experimentally supported human miRNA targets. Of the 143 experimentally supported human target sites, 9 contain 12 SNPs. We further experimentally investigated one of these target sites for hsa-miR-155, within the 3′ UTR of the human AGTR1 gene that contains SNP rs5186. Using reporter silencing assays, we show that hsa-miR-155 down-regulates the expression of only the 1166A, and not the 1166C, allele of rs5186. Remarkably, the 1166C allele has been associated with hypertension in many studies. Thus, the 1166C allele may be functionally associated with hypertension by abrogating regulation …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Artificial neural networks based systems for recognition of genomic signals and regions: a review",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.391.1923&rep=rep1&type=pdf",
            "Abstract": "AND Artemis G. Hatzigeorgiou Department of Genetics, Department of Engineering and Applied Science, Center for Bioinformatics, University of Pennsylvania, Philadelphia, USA.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Defective synaptic connectivity and axonal neuropathology in a human iPSC-based model of familial Parkinson’s disease",
            "Publication year": 2017,
            "Publication url": "https://www.pnas.org/content/114/18/E3679.short",
            "Abstract": "α-Synuclein (αSyn) is the major gene linked to sporadic Parkinson’s disease (PD), whereas the G209A (p.A53T) αSyn mutation causes a familial form of PD characterized by early onset and a generally severe phenotype, including nonmotor manifestations. Here we generated de novo induced pluripotent stem cells (iPSCs) from patients harboring the p.A53T mutation and developed a robust model that captures PD pathogenic processes under basal conditions. iPSC-derived mutant neurons displayed novel disease-relevant phenotypes, including protein aggregation, compromised neuritic outgrowth, and contorted or fragmented axons with swollen varicosities containing αSyn and Tau. The identified neuropathological features closely resembled those in brains of p.A53T patients. Small molecules targeting αSyn reverted the degenerative phenotype under both basal and induced stress conditions, indicating a …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "National Academy of Sciences"
        },
        {
            "Title": "DiS-TSS: An Annotation Agnostic Algorithm for TSS Identification.",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Grigoriadis-4/publication/341688886_DiS-TSS_An_Annotation_Agnostic_Algorithm_for_TSS_Identification/links/5fbf889092851c933f5d576c/DiS-TSS-An-Annotation-Agnostic-Algorithm-for-TSS-Identification.pdf",
            "Abstract": "The spread, distribution and utilization of transcription start sites (TSS) within promoters are poorly understood. Cap Analysis of Gene Expression (CAGE) has emerged as a popular gene expression profiling protocol, able to quantitate TSS usage by recognizing the 5’end of capped RNA molecules. However, there is an increasing volume of studies in the literature suggesting that CAGE can also detect 5’capping events which are transcription byproducts. These findings highlight the need for computational methods that can effectively remove the excessive amount of noise from CAGE samples, leading to accurate TSS annotation and promoter usage quantification. In this study, we present an annotation agnostic computational framework, DIANA Signal-TSS (DiS-TSS), that for the first time utilizes digital signal processing inspired features customized on the peculiarities of CAGE data. Features from the spatial and frequency domains are combined with a robustly trained Support Vector Machines (SVM) model to accurately distinguish between peaks related to real transcription initiation events and biological or protocol-induced noise. When benchmarked on experimentally derived data on active transcription marks as well as annotated TSSs, DiS-TSS was found to outperform existing implementations, by providing on average~ 11k positive predictions and an increase in performance by~ 5% in the experimental and annotation-based evaluations.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational classification of microRNAs in next-generation sequencing data",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00214-009-0684-z",
            "Abstract": "MicroRNAs (miRNAs) have been shown to play an important regulatory role in plants and animals. A large number of known and novel miRNAs can be uncovered from next-generation sequencing (NGS) experiments that measure the complement of a given cell’s small RNAs under various conditions. Here, we present an algorithm based on radial basis functions for the identification of potential miRNA precursor structures. Computationally assessing features of known human miRNA precursors, such as structural linearity, normalized minimum folding energy, and nucleotide pairing frequencies, this model robustly differentiates between miRNAs and other types of non-coding RNAs. Without relying on cross species conservation, the method also identifies non-conserved precursors and achieves high sensitivity. The presented method can be used routinely for the identification of known and novel miRNAs …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Online resources for miRNA analysis",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0009912013000994",
            "Abstract": "This review aims to provide a brief introduction to each major category of available tools and algorithms for microRNA (miRNA) research, as well as to present some of the most widely used or promising representative applications.Only tools offering a fully functional web interface have been included, excluding implementations requiring deployment in local servers or workstations. Furthermore, we have specifically evaluated implementations focusing on Homo sapiens or on mammals used extensively in in vivo research, such as mice and rats.We present an overview of databases and repositories of miRNA sequences and expression, a commentary on miRNA target prediction algorithms, tools for miRNA functional investigation, and online pipelines for the analysis of high throughput experiments. Examples and case studies are provided at the end of the manuscript, which can hopefully …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:BqipwSGYUEgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Computational approaches to elucidate miRNA biology",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=15772544875256574602&hl=en&oi=scholarr",
            "Abstract": "Research in the past decade has revealed that microRNAs (miRNAs) are widespread and that they are likely to underlie an appreciably larger set of disease processes than is currently known. The first miRNAs and their functions were determined via classical genetic techniques. Soon after, a number of miRNAs were discovered experimentally (Lagos-Quintana et al., 2001). However, the characterization of miRNA function remained elusive owing to low-throughput experiments and often indeterminate results, most notably for those miRNAs which have multiple roles in multiple tissues. High-throughput experimental methods for miRNA target identification are the ideal solution, but such methods are not currently available. As a result, computational methods were developed, and are still regularly used, for the purpose of identifying miRNA targets. Most current target prediction programs require the sequences of known miRNAs. Currently, there are 332 known miRNAs in the human genome. The estimation of the total number of miRNAs varies from publication to publication (Lim et al., 2003; Bentwich et al., 2005). In a recent paper, Bentwich et al. contended that there are at least 500 more miRNAs that are yet to be identified (Bentwich etal., 2005). Despite the number of unknown miRNAs, computational approaches based on features of known miRNAs have been instrumental in the discovery of as-of-yet-unknown miRNAs in the genome. The past few years have witnessed an explosion in information regarding the genomic organization of miRNAs, the biogenesis of miRNAs, the targeting mechanisms of miRNAs, and the regulatory networks in …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Alternative RNA splicing of U2AF2, induced by AKT3-phosphorylated IWS1, promotes tumor growth, by activating a CDCA5-pERK positive feedback loop",
            "Publication year": 2020,
            "Publication url": "https://cancerres.aacrjournals.org/content/80/16_Supplement/3649.short",
            "Abstract": "A phosphoproteomics study of isogenic cell lines expressing the 3 different Akt isoforms identified 606 proteins that are phosphorylated by at least one isoform. About 30 of these proteins were involved in various steps of RNA processing. One of them, IWS1, is a transcription elongation factor, which was originally identified in the yeast Saccharomyces cerevisiae, as a protein that interacts with the histone H3/H4 chaperone Spt6 or as a suppressor of TATA binding protein (TBP) mutations that impair post-recruitment transcriptional activation. The human IWS1 is an 819aa protein, which contains a C-terminal domain that is similar to domain I of the transcription elongation factor TFIIS, and to related domains in Elongin A and the Mediator Complex subunit 26 (Med26). IWS1 was shown to be phosphorylated, primarily by Akt3, at two neighboring sites (Ser720/Thr721). To address the role of phosphorylated IWS1 in RNA …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:5awf1xo2G04C",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Peryton: a manual collection of experimentally supported microbe-disease associations",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/nar/article-abstract/49/D1/D1328/5932864",
            "Abstract": "We present Peryton (https://dianalab.e-ce.uth.gr/peryton/), a database of experimentally supported microbe-disease associations. Its first version constitutes a novel resource hosting more than 7900 entries linking 43 diseases with 1396 microorganisms. Peryton's content is exclusively sustained by manual curation of biomedical articles. Diseases and microorganisms are provided in a systematic, standardized manner using reference resources to create database dictionaries. Information about the experimental design, study cohorts and the applied high- or low-throughput techniques is meticulously annotated and catered to users. Several functionalities are provided to enhance user experience and enable ingenious use of Peryton. One or more microorganisms and/or diseases can be queried at the same time. Advanced filtering options and direct text-based filtering of results enable refinement of returned …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "MR-microT: a MapReduce-based MicroRNA target prediction method",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2618243.2618289",
            "Abstract": "MicroRNAs (miRNAs) are small RNA molecules that inhibit the expression of particular genes, a function that makes them useful towards the treatment of many diseases. Computational methods that predict which genes are targeted by particular miRNA molecules are known as target prediction methods. In this paper, we present a MapReduce-based system, termed MR-microT, for one of the most popular and accurate, but computational intensive, prediction methods. MR-microT offers the highly requested by life scientists feature of predicting the targets of ad-hoc miRNA molecules in near-real time through an intuitive Web interface.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simple methods of finding short protein coding sequences using multiple species alignments",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Artemis-Hatzigeorgiou-2/publication/228759657_Simple_methods_of_finding_short_protein_coding_sequences_using_multiple_species_alignments/links/09e41511cfd86cb2aa000000/Simple-methods-of-finding-short-protein-coding-sequences-using-multiple-species-alignments.pdf",
            "Abstract": "Eukaryotic genomes contain many conserved regions of unknown function. Accurately assessing the protein coding potential of these regions is a key step in annotation. We develop three protein coding measures that directly assess conserved regions in multiple sequence alignments of many species: one based on phase-shifts induced by alignment gaps, another based on the 3rd position mutation asymmetry in codons, and a third based on nucleotide composition asymmetry. The methods are easy to implement and require no training. Using a human-chimp-rat-mouse-chicken multiple alignment, these measures can classify coding regions as short as 30nt with greater specificity than single-genome measures using 120nt. Results from human-mouse and humanchicken alignments can be further improved by considering additional species; only the chimp genome proved uninformative. The phase-shift method is especially accurate.Contact: agh@ pcbi. upenn. edu, hannoh@ seas. upenn. edu",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MicroRNA promoter element discovery in Arabidopsis",
            "Publication year": 2006,
            "Publication url": "https://rnajournal.cshlp.org/content/12/9/1612.short",
            "Abstract": "In this study we present a method of identifying Arabidopsis miRNA promoter elements using known transcription factor binding motifs. We provide a comparative analysis of the representation of these elements in miRNA promoters, protein-coding gene promoters, and random genomic sequences. We report five transcription factor (TF) binding motifs that show evidence of overrepresentation in miRNA promoter regions relative to the promoter regions of protein-coding genes. This investigation is based on the analysis of 800-nucleotide regions upstream of 63 experimentally verified Transcription Start Sites (TSS) for miRNA primary transcripts in Arabidopsis. While the TATA-box binding motif was also previously reported by Xie and colleagues, the transcription factors AtMYC2, ARF, SORLREP3, and LFY are identified for the first time as overrepresented binding motifs in miRNA promoters.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:UebtZRa9Y70C",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "RNAcentral: an international database of ncRNA sequences",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/nar/article-abstract/43/D1/D123/2439941",
            "Abstract": "The field of non-coding RNA biology has been hampered by the lack of availability of a           comprehensive, up-to-date collection of accessioned RNA sequences. Here we present the           first release of RNAcentral, a database that collates and integrates information from an           international consortium of established RNA sequence databases. The initial release           contains over 8.1 million sequences, including representatives of all major functional           classes. A web portal (http://rnacentral.org) provides free access to data, search functionality,           cross-references, source code and an integrated genome browser for selected species.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:UxriW0iASnsC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Method and systems for identifying micro-RNA targets and synthesizing novel micro-RNAs and uses of the same",
            "Publication year": 2012,
            "Publication url": "https://patents.google.com/patent/US8145436B2/en",
            "Abstract": "Method of identifying a microRNA-recognition element and of generating microRNAs are disclosed. System and computer programs for performing such methods are disclosed. Recombinant nucleic acid molecule comprising a heterologous coding sequences and one or more MREs are also disclosed as are isolated nucleic acid molecule comprising one or more MRE sequences and being free of a coding sequence operably linked to regulatory elements. MicroRNA generated by a methods of the invention and the use of the microRNAs to downregulate gene expression are disclosed.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIANA‐TarBase and DIANA suite tools: studying experimentally supported microRNA targets",
            "Publication year": 2016,
            "Publication url": "https://currentprotocols.onlinelibrary.wiley.com/doi/abs/10.1002/cpbi.12",
            "Abstract": "microRNAs (miRNAs) are short non‐coding RNAs (∼22 nts) present in animals, plants, and viruses. They are considered central post‐transcriptional regulators of gene expression and are key components in a great number of physiological and pathological conditions. The accurate characterization of their targets is considered essential to a series of applications and basic or applied research settings. DIANA‐TarBase (http://www.microrna.gr/tarbase) was initially launched in 2006. It is a reference repository indexing experimentally derived miRNA‐gene interactions in different cell types, tissues, and conditions across numerous species. This unit focuses on the study of experimentally supported miRNA‐gene interactions, as well as their functional interpretation through the use of available tools in the DIANA suite (http://www.microrna.gr). The proposed use‐case scenarios are presented in protocols, describing …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anti-apoptotic function of a microRNA encoded by the HSV-1 latency-associated transcript.",
            "Publication year": 2008,
            "Publication url": "https://europepmc.org/article/med/18235505",
            "Abstract": "Anti-apoptotic function of a microRNA encoded by the HSV-1 latency-associated transcript. - \nAbstract - Europe PMC Feedback Sign in or create an account https://orcid.org Europe PMC \nMenu About About Europe PMC Funders Joining Europe PMC Governance Roadmap Outreach \nTools Tools overview ORCID article claiming Journal list Grant finder External links service \nRSS feeds Annotations Annotations submission service Developers Developer resources \nArticles RESTful API Grants RESTful API API use cases SOAP web service Annotations API \nOAI service Bulk downloads Developers Forum Help Help using Europe PMC Search syntax \nreference Contact us Contact us Helpdesk Feedback Twitter Blog Tech blog Developer Forum \nEurope PMC plus Search worldwide, life-sciences literature Search Advanced Search Recent \nhistory Saved searches Abstract Full text References Citations & impact Anti-apoptotic of …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIANA-LncBase v3: indexing experimentally supported miRNA targets on non-coding transcripts",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/nar/article-abstract/48/D1/D101/5626521",
            "Abstract": "DIANA-LncBase v3.0 (www.microrna.gr/LncBase) is a reference repository with experimentally supported miRNA targets on non-coding transcripts. Its third version provides approximately half a million entries, corresponding to ∼240 000 unique tissue and cell type specific miRNA–lncRNA pairs. This compilation of interactions is derived from the manual curation of publications and the analysis of >300 high-throughput datasets. miRNA targets are supported by 14 experimental methodologies, applied to 243 distinct cell types and tissues in human and mouse. The largest part of the database is highly confident, AGO-CLIP-derived miRNA-binding events. LncBase v3.0 is the first relevant database to employ a robust CLIP-Seq-guided algorithm, microCLIP framework, to analyze 236 AGO-CLIP-Seq libraries and catalogue ∼370 000 miRNA binding events. The database was redesigned from the ground up …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Online resources for microRNA analysis",
            "Publication year": 2011,
            "Publication url": "http://www.pagepress.org/journals/index.php/jnai/article/view/2161",
            "Abstract": "The use of online tools for bioinformatics analyses is becoming increasingly widespread. Resources specific to the field of microRNAs are available, varying in scope and usability. Online tools are the most useful for casual as well as power users since they need no installation, are hardware independent and are used mostly through graphic user interfaces and links to external sources. Here, we present an overview of useful online resources that have to do with microRNA genomics, gene finding, target prediction and functional analysis.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "miRGen: a database for the study of animal microRNA genomic organization and function",
            "Publication year": 2007,
            "Publication url": "https://academic.oup.com/nar/article-abstract/35/suppl_1/D149/1107823",
            "Abstract": " miRGen is an integrated database of (i) positional relationships between animal miRNAs and genomic annotation sets and (ii) animal miRNA targets according to combinations of widely used target prediction programs. A major goal of the database is the study of the relationship between miRNA genomic organization and miRNA function. This is made possible by three integrated and user friendly interfaces. The Genomics interface allows the user to explore where whole-genome collections of miRNAs are located with respect to UCSC genome browser annotation sets such as Known Genes, Refseq Genes, Genscan predicted genes, CpG islands and pseudogenes. These miRNAs are connected through the Targets interface to their experimentally supported target genes from TarBase, as well as computationally predicted target genes from optimized intersections and unions of several widely used …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "COMPUTATIONAL CHALLENGES AND-OMICS APPROACHES FOR THE IDENTIFICATION",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=EgSqDQAAQBAJ&oi=fnd&pg=PA39&dq=info:qD2kTs52LncJ:scholar.google.com&ots=YBb3ViL6lx&sig=5BNywpSd-xKP0eTfzFbaS4AYQ3U",
            "Abstract": "The noncoding RNA class of microRNAs (miRNAs) is characterized by powerful capabilities for posttranscriptional repression of gene expression. miRNAs identify their target regions (miRNA Recognition Elements, MREs) in 30UTR (Bartel, 2009), coding sequence (CDS)(Reczko et al., 2012), and more rarely in the 50UTR of genes (Kloosterman et al., 2004; Lytle et al., 2007) through base complementarity, and induce cleavage, degradation, or translation suppression in the case of protein coding genes (Huntzinger and Izaurralde, 2011). MiRNAs are being actively researched for more than a decade and in silico tools have been proven from early on to be an invaluable aid to this effort (Enright et al., 2003; Lewis et al., 2003; Kiriakidou et al., 2004). Throughout these years, a significant number of algorithms (Vlachos and Hatzigeorgiou, 2013; Akhtar et al., 2016) have been developed to assist in the elucidation of fundamental research questions related to miRNA biogenesis and function, including miRNA annotation, regulation, and interactions with other RNA species (Fig. 3.1). Advanced applications have been also developed that facilitate complex research inquiries, such as the identification of miRNA biomarkers, the detection of miRNAs with crucial regulatory roles and of miRNA-controlled pathways. A plethora of databases and repositories were also deployed to catalog and organize the large amounts of miRNA-related data in a comprehensible and efficient fashion (Singh, 2016). A long series of experimental techniques have been devised to seemingly complement the numerous computational algorithms employed in the exploration of …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "DIANA-mirPath: Integrating human and mouse microRNAs in pathways",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/25/15/1991/211387",
            "Abstract": " Summary: DIANA-mirPath is a web-based computational tool developed to identify molecular pathways potentially altered by the expression of single or multiple microRNAs. The software performs an enrichment analysis of multiple microRNA target genes comparing each set of microRNA targets to all known KEGG pathways. The combinatorial effect of co-expressed microRNAs in the modulation of a given pathway is taken into account by the simultaneous analysis of multiple microRNAs. The graphical output of the program provides an overview of the parts of the pathway modulated by microRNAs, facilitating the interpretation and presentation of the analysis results. Availability: The software is available at http://microrna.gr/mirpath and is free for all users with no login or download requirement. Contact:           papadopoulos@fleming.gr or hatzigeorgiou@fleming.gr",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:Se3iqnhoufwC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Identification of microRNA-221/222 and microRNA-323-3p association with rheumatoid arthritis via predictions using the human tumour necrosis factor transgenic mouse model",
            "Publication year": 2012,
            "Publication url": "https://ard.bmj.com/content/71/10/1716.short",
            "Abstract": "To identify novel microRNA (miR) associations in synovial fibroblasts (SF), by performing miR expression profiling on cells isolated from the human tumour necrosis factor (TNF) transgenic mouse model (TghuTNF, Tg197) and patients biopsies.miR expression in SF from TghuTNF and wild-type (WT) control mice were determined by miR deep sequencing (miR-seq) and the arthritic profile was established by pairwise comparisons. Quantitative PCR analysis was utilised for profile validation, miR and gene quantitation in patient SF. Dysregulated miR target genes and pathways were predicted via bioinformatic algorithms and validated using gain-of-function coupled with reporter assay experiments.miR-seq demonstrated that TghuTNF-SF exhibit a distinct pathogenic profile with 22 significantly upregulated and 30 significantly downregulated miR. Validation assays confirmed the …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:dhFuZR0502QC",
            "Publisher": "BMJ Publishing Group Ltd"
        },
        {
            "Title": "Functional analysis of miRNAs using the DIANA tools online suite",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-6563-2_2",
            "Abstract": "microRNAs (miRNAs) are central regulators of gene expression. They are actively studied for their involvement in numerous physiological and pathological conditions but also as diagnostic biomarkers or promising therapeutic targets. The increased complexity of the miRNA interactomes hinders straightforward interpretation of miRNA expression differences between states and conditions. To this end, functional analysis web servers process and combine experimental and in silico data, enabling researchers to uncover targeted pathways and transcriptional mechanisms that are hidden within numerous interactions and vast expression datasets. DIANA-tools (                   www.microrna.gr                                    ) is a web server hosting state-of-the-art utilities and databases for miRNA functional investigation. Available utilities cover a wide scope of different needs and research scenarios, rendering DIANA website …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "DIANA-mAP: Analyzing miRNA from Raw NGS Data to Quantification. Genes 2021, 12, 46",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Antonis-Koussounadis/publication/348106999_DIANA-mAP_Analyzing_miRNA_from_Raw_NGS_Data_to_Quantification/links/600191e6a6fdccdcb8575e67/DIANA-mAP-Analyzing-miRNA-from-Raw-NGS-Data-to-Quantification.pdf",
            "Abstract": "microRNAs (miRNAs) are small non-coding RNAs (~ 22 nts) that are considered central post-transcriptional regulators of gene expression and key components in many pathological conditions. Next-Generation Sequencing (NGS) technologies have led to inexpensive, massive data production, revolutionizing every research aspect in the fields of biology and medicine. Particularly, small RNA-Seq (sRNA-Seq) enables small non-coding RNA quantification on a high-throughput scale, providing a closer look into the expression profiles of these crucial regulators within the cell. Here, we present DIANA-microRNA-Analysis-Pipeline (DIANA-mAP), a fully automated computational pipeline that allows the user to perform miRNA NGS data analysis from raw sRNA-Seq libraries to quantification and Differential Expression Analysis in an easy, scalable, efficient, and intuitive way. Emphasis has been given to data pre-processing, an early, critical step in the analysis for the robustness of the final results and conclusions. Through modularity, parallelizability and customization, DIANA-mAP produces high quality expression results, reports and graphs for downstream data mining and statistical analysis. In an extended evaluation, the tool outperforms similar tools providing pre-processing without any adapter knowledge. Closing, DIANA-mAP is a freely available tool. It is available dockerized with no dependency installations or standalone, accompanied by an installation manual through Github.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:UHK10RUVsp4C",
            "Publisher": "s Note: MDPI stays neu-tral with regard to jurisdictional clai-ms in published maps and institutio-nal affiliations."
        },
        {
            "Title": "DIANA-miRGen v4: indexing promoters and regulators for more than 1500 microRNAs",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/nar/article-abstract/49/D1/D151/6007663",
            "Abstract": "Deregulation of microRNA (miRNA) expression plays a critical role in the transition from a physiological to a pathological state. The accurate miRNA promoter identification in multiple cell types is a fundamental endeavor towards understanding and characterizing the underlying mechanisms of both physiological as well as pathological conditions. DIANA-miRGen v4 (www.microrna.gr/mirgenv4) provides cell type specific miRNA transcription start sites (TSSs) for over 1500 miRNAs retrieved from the analysis of >1000 cap analysis of gene expression (CAGE) samples corresponding to 133 tissues, cell lines and primary cells available in FANTOM repository. MiRNA TSS locations were associated with transcription factor binding site (TFBSs) annotation, for >280 TFs, derived from analyzing the majority of ENCODE ChIP-Seq datasets. For the first time, clusters of cell types having common miRNA TSSs are …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "miRGen 2.0: a database of microRNA genomic information and regulation",
            "Publication year": 2010,
            "Publication url": "https://academic.oup.com/nar/article-abstract/38/suppl_1/D137/3112243",
            "Abstract": "MicroRNAs are small, non-protein coding RNA molecules known to regulate the expression of genes by binding to the 3′UTR region of mRNAs. MicroRNAs are produced from longer transcripts which can code for more than one mature miRNAs. miRGen 2.0 is a database that aims to provide comprehensive information about the position of human and mouse microRNA coding transcripts and their regulation by transcription factors, including a unique compilation of both predicted and experimentally supported data. Expression profiles of microRNAs in several tissues and cell lines, single nucleotide polymorphism locations, microRNA target prediction on protein coding genes and mapping of miRNA targets of co-regulated miRNAs on biological pathways are also integrated into the database and user interface. The miRGen database will be continuously maintained and freely available at http://www.microrna …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "DIANA-EST: a statistical analysis",
            "Publication year": 2001,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/17/10/913/251555",
            "Abstract": "Motivation: Expressed Sequence Tags (ESTs) are next to cDNA   sequences as the most direct way to locate in silico the   genes of the genome and determine their structure. Currently ESTs   make up more than 60% of all the database entries. The goal of this   work is the development of a new program called DNA Intelligent   Analysis for ESTs (DIANA-EST) based on a combination of Artificial   Neural Networks (ANN) and statistics for the characterization of the   coding regions within ESTs and the reconstruction of the encoded   protein.Results: 89.7% of the nucleotides from an independent test set   with 127 ESTs were predicted correctly as to whether they are coding   or non coding.Availability: The program is available upon request from the   author.Contact: Present address: Department of Genetics, University of   Pennsylvania, School of Medicine, 475 Clinical Research Building,   415 Curie …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Computational identification of regulatory factors involved in microRNA transcription",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_43",
            "Abstract": "MicroRNAs (miRNAs) are non-coding RNA molecules that bind to and translationally repress mRNA transcripts. Currently ~1345 miRNAs have been identified in at least twelve species through experimental and computational approaches. Here, we report on a field not yet thoroughly investigated: the transcriptional regulation of miRNAs. Adequately locating miRNA promoter regions will provide a reasonable search space for computational and experimental studies to determine regulatory factors that drive miRNA transcription. Insight in to the factors that control miRNA transcription may provide clues regarding more complicated mechanisms of miRNA expression control in a developing organism. We use a novel Expressed Sequence Tag (EST) based approach to approximate promoter regions for intergenic miRNAs in order to detect specific and over-represented regulatory elements. We find that miRNA …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Methods and systems for identifying micro-rna targets and synthesizing novel micro-rnas and uses of the same",
            "Publication year": 2014,
            "Publication url": "https://patents.google.com/patent/US20140106351A1/en",
            "Abstract": "Method of identifying a microRNA-recognition element and of generating microRNAs are disclosed. System and computer programs for performing such methods are disclosed. Recombinant nucleic acid molecule comprising a heterologous coding sequences and one or more MREs are also disclosed as are isolated nucleic acid molecule comprising one or more MRE sequences and being free of a coding sequence operably linked to regulatory elements. MicroRNA generated by a methods of the invention and the use of the microRNAs to downregulate gene expression are disclosed.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIANA-miTED: a microRNA tissue expression database",
            "Publication year": 2021,
            "Publication url": "https://academic.oup.com/nar/advance-article-abstract/doi/10.1093/nar/gkab733/6362088",
            "Abstract": "microRNAs (miRNAs) are short (∼23nt) single-stranded non-coding RNAs that act as potent post-transcriptional gene expression regulators. Information about miRNA expression and distribution across cell types and tissues is crucial to the understanding of their function and for their translational use as biomarkers or therapeutic targets. DIANA-miTED is the most comprehensive and systematic collection of miRNA expression values derived from the analysis of 15 183 raw human small RNA-Seq (sRNA-Seq) datasets from the Sequence Read Archive (SRA) and The Cancer Genome Atlas (TCGA). Metadata quality maximizes the utility of expression atlases, therefore we manually curated SRA and TCGA-derived information to deliver a comprehensive and standardized set, incorporating in total 199 tissues, 82 anatomical sublocations, 267 cell lines and 261 diseases. miTED offers rich instant visualizations of …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIANA-mirExTra v2. 0: Uncovering microRNAs and transcription factors with crucial roles in NGS expression data",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/nar/article-abstract/44/W1/W128/2499390",
            "Abstract": "Differential expression analysis (DEA) is one of the main instruments utilized for revealing molecular mechanisms in pathological and physiological conditions. DIANA-mirExTra v2.0 (http://www.microrna.gr/mirextrav2) performs a combined DEA of mRNAs and microRNAs (miRNAs) to uncover miRNAs and transcription factors (TFs) playing important regulatory roles between two investigated states. The web server uses as input miRNA/RNA-Seq read count data sets that can be uploaded for analysis. Users can combine their data with 350 small-RNA-Seq and 65 RNA-Seq in-house analyzed libraries which are provided by DIANA-mirExTra v2.0.The web server utilizes miRNA:mRNA, TF:mRNA and TF:miRNA interactions derived from extensive experimental data sets. More than 450 000 miRNA interactions and 2 000 000 TF binding sites from specific or high-throughput techniques have been incorporated …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:SP6oXDckpogC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Signal peptide prediction on DNA sequences with artificial neural networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1454178/",
            "Abstract": "In this work we apply the signal peptide prediction Sigfind on DNA sequences. A combination with the DIANA-TIS method for translation initiation start site (TIS) prediction can identify half of the ambiguous cases with alternative start sites correctly. Sigfind is based on the bidirectional recurrent neural network (BRNN) architecture. DIANA-TIS makes use of two modules, one sensitive to the conserved motif and one sensitive to the coding/non-coding potential around the start codon. Both modules are based on hierarchical artificial neural networks.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DIANA-TarBase v8: a decade-long collection of experimentally supported miRNA–gene interactions",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/nar/article-abstract/46/D1/D239/4634010",
            "Abstract": "DIANA-TarBase v8 (http://www.microrna.gr/tarbase) is a reference database devoted to the indexing of experimentally supported microRNA (miRNA) targets. Its eighth version is the first database indexing >1 million entries, corresponding to ∼670 000 unique miRNA-target pairs. The interactions are supported by >33 experimental methodologies, applied to ∼600 cell types/tissues under ∼451 experimental conditions. It integrates information on cell-type specific miRNA–gene regulation, while hundreds of thousands of miRNA-binding locations are reported. TarBase is coming of age, with more than a decade of continuous support in the non-coding RNA field. A new module has been implemented that enables the browsing of interactions through different filtering combinations. It permits easy retrieval of positive and negative miRNA targets per species, methodology, cell type and tissue. An incorporated …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Tarcloud: A cloud-based platform to support mirna target prediction",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31235-9_48",
            "Abstract": "Micro RNAs (miRNAs) are small RNA molecules that target protein coding genes and inhibit protein production. Since experimental identification of miRNA targets poses difficulties, computational miRNA target prediction is one of the key means in deciphering the role of microRNAs in development and disease. However, these computational methods are CPU-intensive. For example, the predictions for a single miRNA molecule on the whole human genome according to a popular target prediction method require about 30 minutes. Such performance is a hindrance to the biologists’ requirement for near-real time target prediction. In this paper, we present TARCLOUD, a Cloud-based target prediction solution built on Microsoft’s Azure platform. TARCLOUD is a highly-scalable solution based on distributed programming models that provides near-real time predictions to its users through an easy and intuitive …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Predicting miRNA targets utilizing an extended profile HMM",
            "Publication year": 2010,
            "Publication url": "https://dl.gi.de/handle/20.500.12116/19675",
            "Abstract": "The regulation of many cellular processes is influenced by miRNAs, and bioinformatics approaches for predicting miRNA targets evolve rapidly. Here, we propose conditional profile HMMs that learn rules of miRNA-target site interaction automatically from data. We demonstrate that conditional profile HMMs detect the rules implemented into existing approaches from their predictions. And we show that a simple UTR model utilizing conditional profile HMMs predicts target genes of miR- NAs with a precision that is competitive compared to leading approaches, although it does not exploit cross-species conservation.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Gesellschaft für Informatik eV"
        },
        {
            "Title": "Characterization of a spliced exon product of herpes simplex type-1 latency-associated transcript in productively infected cells",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0042682206005101",
            "Abstract": "The latency-associated transcripts (LATs) of herpes simplex virus type-1 (HSV-1) are the only viral RNAs accumulating during latent infections in the sensory ganglia of the peripheral nervous system. The major form of LAT that accumulates in latently infected neurons is a 2 kb intron, spliced from a much less abundant 8.3 primary transcript. The spliced exon mRNA has been hard to detect. However, in this study, we have examined the spliced exon RNA in productively infected cells using ribonuclease protection (RPA), and quantitative RT-PCR (q-PCR) assays. We were able to detect the LAT exon RNA in productively infected SY5Y cells (a human neuronal cell line). The level of the LAT exon RNA was found to be approximately 5% that of the 2 kb intron RNA and thus is likely to be relatively unstable. Quantitative RT-PCR (q-PCR) assays were used to examine the LAT exon RNA and its properties. They confirmed …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Differential microRNA profiles and their functional implications in different immunogenetic subsets of chronic lymphocytic leukemia",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.2119/molmed.2013.00005",
            "Abstract": "Critical processes of B-cell physiology, including immune signaling through the B-cell receptor (BcR) and/or Toll-like receptors (TLRs), are targeted by microRNAs. With this in mind and also given the important role of BcR and TLR signaling and microRNAs in chronic lymphocytic leukemia (CLL), we investigated whether microRNAs could be implicated in shaping the behavior of CLL clones with distinct BcR and TLR molecular and functional profiles. To this end, we examined 79 CLL cases for the expression of 33 microRNAs, selected on the following criteria: (a) deregulated in CLL versus normal B-cells; (b) differentially expressed in CLL subgroups with distinct clinicobiological features; and, (c) if meeting (a) + (b), having predicted targets in the immune signaling pathways. Significant upregulation of miR-150, miR-29c, miR-143 and miR-223 and downregulation of miR-15a was found in mutated versus unmutated …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:YFjsv_pBGBYC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "In vivo profiling of hypoxic mRNA and miRNA expression in gliomas and head and neck tumors",
            "Publication year": 2011,
            "Publication url": "https://cancerres.aacrjournals.org/content/71/8_Supplement/5004.short",
            "Abstract": "Hypoxia plays a key role in tumor aggressiveness and radiation resistance, yet little is known regarding hypoxic global gene regulation in vivo. Although the regulation of mRNA and miRNA expression by hypoxia has been investigated in isolation in vitro, it has not yet been analyzed directly in tumor samples.We have used the hypoxia marker EF5 coupled with laser capture microdissection (LCM) to isolate RNA from viable hypoxic and normoxic regions of 9L experimental rat gliomas and from human head and neck (H&N) tumor samples. This was followed by microarray analysis of mRNA expression and comparison of this signature with that obtained from treating 9L cells with hypoxia in vitro. Through this, we have identified several mRNAs (including the HIF targets Vegf, Glut-1 and Hsp27) with increased levels under hypoxia compared to normoxia both in vitro and in vivo. We also found striking differences …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:a0OBvERweLwC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Solving the transcription start site identification problem with ADAPT-CAGE: a Machine Learning algorithm for the analysis of CAGE data",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41598-020-57811-3",
            "Abstract": "Cap Analysis of Gene Expression (CAGE) has emerged as a powerful experimental technique for assisting in the identification of transcription start sites (TSSs). There is strong evidence that CAGE also identifies capping sites along various other locations of transcribed loci such as splicing byproducts, alternative isoforms and capped molecules overlapping introns and exons. We present ADAPT-CAGE, a Machine Learning framework which is trained to distinguish between CAGE signal derived from TSSs and transcriptional noise. ADAPT-CAGE provides highly accurate experimentally derived TSSs on a genome-wide scale. It has been specifically designed for flexibility and ease-of-use by only requiring aligned CAGE data and the underlying genomic sequence. When compared to existing algorithms, ADAPT-CAGE exhibits improved performance on every benchmark that we designed based on both annotation …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:XiVPGOgt02cC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "miRNome integrative analysis in ovarian cancer",
            "Publication year": 2008,
            "Publication url": "https://clincancerres.aacrjournals.org/content/14/19_Supplement/ED02-02.short",
            "Abstract": "ED02-02MicroRNAs (miRNAs) are an abundant class of endogenous small non-coding RNAs that function as negative gene regulators. We present data from integrative genomic analysis of the miRNome in human epithelial ovarian cancer including miRNA microarray, array-based comparative genomic hybridization, cDNA microarray, and tissue array. miRNA expression was markedly downregulated with malignant transformation and tumor progression. A high proportion of genomic loci containing miRNA genes exhibited DNA copy number alterations in ovarian cancer (37.1%). Copy number alterations observed in >15% tumors were considered significant. We identified 41 miRNA genes with gene copy number changes that were shared among human ovarian cancer, breast cancer and melanoma (26 with gains and 15 with losses) as well as miRNA genes with copy number changes that were unique to each …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:yD5IFk8b50cC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Cooperative action of miR-124 and ISX9 in instructing direct reprogramming of mouse astrocytes to induced-neurons in vitro and in vivo",
            "Publication year": 2020,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.06.01.127126v1.full-text",
            "Abstract": "miR-124 plays a major regulatory role in neurogenesis and neuronal differentiation during brain development through control of its multiple non-neuronal targets and has therefore been employed in direct reprogramming protocols supplementary to neurogenic TFs, and other miRNAs to enhance neurogenic conversion. However, its capacity to instruct neurogenic conversion of astrocytes and its independent mechanism of direct reprogramming action have been poorly investigated. Aim of the study was to investigate whether miR-124 is a master-regulatory reprogramming agent, potent to drive direct reprogramming of astrocytes to induced-neurons (iNs) on its own and to elucidate its mechanism of reprogramming action. To this end we overexpressed miR-124 either alone or in combination with the small neurogenic compound ISX9 both in vitro and in in vivo in a mouse mechanical cortical trauma model and analyzed their mechanism of reprogramming action. Our data indicate that miR-124 and ISX9 exhibit both unique and convergent molecular contributions in the reprogramming process to iNs. miR-124 is a potent driver of the astrocytic reprogramming switch of astrocytes towards an immature neuronal fate by repressing genes regulating astrocytic function, among which we identified the RNA-binding protein Zfp36l1 as a novel miR-124 direct target. We also provide evidence that ISX9 greatly improves both miR-124-induced reprogramming efficiency and functional maturation of iNs. Importantly, miR-124 either alone or along with ISX9 is potent to guide direct neuronal reprogramming of reactive astrocytes to iNs of cortical identity in vivo, a …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "Analyzing miRNA–lncRNA interactions",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-3378-5_21",
            "Abstract": "Long noncoding RNAs (lncRNAs) are noncoding transcripts usually longer than 200 nts that have recently emerged as one of the largest and significantly diverse RNA families. The biological role and functions of lncRNAs are still mostly uncharacterized. Their target-mimetic, sponge/decoy function on microRNAs was recently uncovered. miRNAs are a class of noncoding RNA species (~22 nts) that play a central role in posttranscriptional regulation of protein coding genes by mRNA cleavage, direct translational repression and/or mRNA destabilization. LncRNAs can act as miRNA sponges, reducing their regulatory effect on mRNAs. This function introduces an extra layer of complexity in the miRNA–target interaction network. This chapter focuses on the study of miRNA–lncRNA interactions with either in silico or experimentally supported analyses. The proposed methodologies can be appropriately adapted …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Humana Press, New York, NY"
        },
        {
            "Title": "Global discriminative learning for higher-accuracy computational gene prediction",
            "Publication year": 2007,
            "Publication url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.0030054",
            "Abstract": "Most ab initio gene predictors use a probabilistic sequence model, typically a hidden Markov model, to combine separately trained models of genomic signals and content. By combining separate models of relevant genomic features, such gene predictors can exploit small training sets and incomplete annotations, and can be trained fairly efficiently. However, that type of piecewise training does not optimize prediction accuracy and has difficulty in accounting for statistical dependencies among different parts of the gene model. With genomic information being created at an ever-increasing rate, it is worth investigating alternative approaches in which many different types of genomic evidence, with complex statistical dependencies, can be integrated by discriminative learning to maximize annotation accuracy. Among discriminative learning methods, large-margin classifiers have become prominent because of the success of support vector machines (SVM) in many classification tasks. We describe CRAIG, a new program for ab initio gene prediction based on a conditional random field model with semi-Markov structure that is trained with an online large-margin algorithm related to multiclass SVMs. Our experiments on benchmark vertebrate datasets and on regions from the ENCODE project show significant improvements in prediction accuracy over published gene predictors that use intrinsic features only, particularly at the gene level and on genes with long introns.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "mirPub: a database for searching microRNA publications",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/31/9/1502/200032",
            "Abstract": " Summary: Identifying, amongst millions of publications available in MEDLINE, those that are relevant to specific microRNAs (miRNAs) of interest based on keyword search faces major obstacles. References to miRNA names in the literature often deviate from standard nomenclature for various reasons, since even the official nomenclature evolves. For instance, a single miRNA name may identify two completely different molecules or two different names may refer to the same molecule. mirPub is a database with a powerful and intuitive interface, which facilitates searching for miRNA literature, addressing the aforementioned issues. To provide effective search services, mirPub applies text mining techniques on MEDLINE, integrates data from several curated databases and exploits data from its user community following a crowdsourcing approach. Other key features include an interactive visualization …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:_xSYboBqXhAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "IWS1 phosphorylation promotes cell proliferation and predicts poor prognosis in EGFR mutant lung adenocarcinoma patients, through the cell cycle-regulated U2AF2 RNA splicing",
            "Publication year": 2020,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.07.14.195297v4.abstract",
            "Abstract": "Our previous studies have shown that IWS1 (Interacts with Spt6) is a phosphorylation target of AKT and regulates the alternative RNA splicing of FGFR2, linking IWS1 with human Non-Small Cell Lung Cancer. To further address the role of IWS1 in alternative RNA splicing in lung cancer, we performed an RNA-seq study using lung adenocarcinoma cells in which IWS1 was knocked down or replaced by its phosphorylation site mutant. The results identified a novel, exon 2 deficient splice variant of the splicing factor U2 Associated-Factor 2 (U2AF2), whose abundance increases, upon the loss of phosphorylated IWS1. This exon encodes part of the U2AF65 Serine-Rich (SR) Domain, which is required for its binding with pre-mRNA Processing factor 19 (Prp19). Here, we show that U2AF2 exon 2 inclusion depends on phosphorylated IWS1, by promoting histone H3K36 trimethylation and the assembly of LEDGF/SRSF1 splicing complexes, in a cell-cycle specific manner. Inhibition of the pathway results in the downregulation of cell cycle division associated 5 (CDCA5), a phosphorylation target and regulator of ERK, leading to G2/M phase arrest, impaired cell proliferation and tumor growth in mouse xenografts models, an effect more pronounced in EGFR mutant cells. Analysis of lung adenocarcinoma samples revealed strong correlations between IWS1 phosphorylation, U2AF2 RNA splicing, and Sororin/p-ERK levels, especially in EGFR, as opposed to K-RAS mutant patients. More importantly, IWS1 phosphorylation and U2AF2 RNA splicing pattern are positively correlated with tumor stage, grade and metastasis, and associated with poor survival in …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "MicroRNAs exhibit high frequency genomic alterations in human ovarian cancer.",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=803759554613519404&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:maZDTaKrznsC",
            "Publisher": "SOC STUDY REPRODUCTION"
        },
        {
            "Title": "Characterizing miRNA–lncRNA Interplay",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-0716-1697-0_21",
            "Abstract": "Long noncoding RNAs (lncRNAs) are noncoding transcripts, usually longer than 200 nt, that constitute one of the largest and significantly heterogeneous RNA families. The annotation of lncRNAs and the characterization of their function is a constantly evolving field. LncRNA interplay with microRNAs (miRNAs) is thoroughly studied in several physiological and disease states. miRNAs are small noncoding RNAs (~22 nt) that posttranscriptionally regulate the expression of protein coding genes, through mRNA target cleavage, degradation or direct translational suppression. miRNAs can affect lncRNA half-life by promoting their degradation, or lncRNAs can act as miRNA “sponges,” reducing miRNA regulatory effect on target mRNAs. This chapter outlines the miRNA–lncRNA interplay and provides hands-on methodologies for experimentally supported and in silico-guided analyses. The proposed techniques …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Humana, New York, NY"
        },
        {
            "Title": "ANALYSIS OF DNA SEQUENCES: HUNTING FOR GENES",
            "Publication year": 2005,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9781860946882_0015",
            "Abstract": "The following sections are included:  Introduction   DNA and Genes  DNA Coding Genes The Genetic Code and Proteins Structure of Coding Genes Complementary DNA (cDNA) Non-Coding Genes     Genomes  Computational Analysis of the Genome: Coding Gene Prediction Computational Analysis of the Genome: Non-coding Gene Prediction     Closing Remarks   References  IntroductionDNA and Genes  DNA Coding Genes The Genetic Code and Proteins Structure of Coding Genes Complementary DNA (cDNA) Non-Coding Genes  DNACoding GenesThe Genetic Code and ProteinsStructure of Coding GenesComplementary DNA (cDNA)Non-Coding GenesGenomes  Computational Analysis of the Genome: Coding Gene Prediction Computational Analysis of the Genome: Non-coding Gene Prediction  Computational Analysis of the Genome: Coding Gene PredictionComputational Analysis of the Genome: Non-coding Gene PredictionClosing RemarksReferences",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Publishing Diachronic Life Science Linked Data.",
            "Publication year": 2014,
            "Publication url": "http://ceur-ws.org/Vol-1320/paper_3.pdf",
            "Abstract": "The Linked Data paradigm involves practices to publish, share, and connect data on the Web. Thus, it is a compelling approach for the dissemination and re-use of scientific data, realizing the vision of the so-called Linked Science. However, by just converting legacy scientific data as Linked Data, we do not fully meet the requirements of data re-use. Scientific data is evolving data. To ensure re-use and allow exploitation and validation of scientific results, several challenges related to scientific data dynamics should be tackled. In this paper, we deal with the publication of diachronic life science linked data. We propose a change model based on RDF to capture versioned entities. Based on this model we convert legacy data from biological databases as diachronic linked data. Our linked data server can assist biologists to explore biological entities and their evolution by either using SPARQL queries or navigating among entity versions. All services are publicly available at http://diana. imis. athena-innovation. gr/lod.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "microCLIP super learning framework uncovers functional transcriptome-wide miRNA interactions",
            "Publication year": 2018,
            "Publication url": "https://www.nature.com/articles/s41467-018-06046-y",
            "Abstract": "Argonaute crosslinking and immunoprecipitation (CLIP) experiments are the most widely used high-throughput methodologies for miRNA targetome characterization. The analysis of Photoactivatable Ribonucleoside-Enhanced (PAR) CLIP methodology focuses on sequence clusters containing T-to-C conversions. Here, we demonstrate for the first time that the non-T-to-C clusters, frequently observed in PAR-CLIP experiments, exhibit functional miRNA-binding events and strong RNA accessibility. This discovery is based on the analysis of an extensive compendium of bona fide miRNA-binding events, and is further supported by numerous miRNA perturbation experiments and structural sequencing data. The incorporation of these previously neglected clusters yields an average of 14% increase in miRNA-target interactions per PAR-CLIP library. Our findings are integrated in microCLIP (www. microrna. gr/microCLIP …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "THU0028 Microrna-381 Ameliorates Arthritis by Controlling Functions of Fibroblast-like Synoviocytes, Which Are Affected by A To I RNA Editing",
            "Publication year": 2016,
            "Publication url": "https://ard.bmj.com/content/75/Suppl_2/187.2.abstract",
            "Abstract": "MicroRNAs (miRNAs) play as regulators of rheumatoid arthritis (RA) and other diseases. MicroRNA is edited by the adenosine deaminase double-stranded RNA (ADAR) as well as mRNA and other noncoding RNA after transcription. A to I RNA editing is occurred limited variety of miRNAs. MicroRNA-381 (MiR-381) is one of limited miRNAs and was down regulated in synovium derived from patients with RA. However, the function of miR-381 and A to I RNA editing against RA is not clear.To clarify a role of miR-381 and A to I RNA editing in synovium derived from RA or OA.1) RNA was purified from the synovium derive from patients with RA (n=6) or OA (n=6) and analyzed with next generation sequencing (NGS). MiRNA editing was annotated containing 2 nucleotide mismatch. 2) The expression of wild type (WT) and edited miR-381 of synovium derived from RA (n=10) was compared …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:XiSMed-E-HIC",
            "Publisher": "BMJ Publishing Group Ltd"
        },
        {
            "Title": "Methods and systems for identifying micro-RNA targets and synthesizing novel micro-RNAs and uses of the same",
            "Publication year": 2013,
            "Publication url": "https://patents.google.com/patent/US8532937B2/en",
            "Abstract": "Method of identifying a microRNA-recognition element and of generating microRNAs are disclosed. System and computer programs for performing such methods are disclosed. Recombinant nucleic acid molecule comprising a heterologous coding sequences and one or more MREs are also disclosed as are isolated nucleic acid molecule comprising one or more MRE sequences and being free of a coding sequence operably linked to regulatory elements. MicroRNA generated by a methods of the invention and the use of the microRNAs to downregulate gene expression are disclosed.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distinct profiles of miRNAs modulating immune signalling pathways in different subsets of chronic lymphocytic leukemia",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=6471687770216001606&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:tkaPQYYpVKoC",
            "Publisher": "FERRATA STORTI FOUNDATION"
        },
        {
            "Title": "Prediction of Human microRNA Targets using Parallel Computing",
            "Publication year": 2004,
            "Publication url": "http://www.wseas.us/e-library/conferences/athens2004/papers/487-826.doc",
            "Abstract": "New paradigm of gene expression regulation has emerged recently with the discovery of microRNAs (miRNAs). Most, if not all, miRNAs are thought to control gene expression, mostly by base pairing with miRNA-recognition elements (MREs) found in their messenger RNA (mRNA) targets. Despite a large number of reported human miRNAs, many of their mRNA targets remain unknown. Here we use a combined bioinformatics and experimental approach to identify important rules governing miRNA-MRE recognition that allow prediction of human miRNA targets. We describe a computational program,\" DIANA-microT” that identifies mRNA targets for animal miRNAs and predicts single mRNA targets for human and mouse miRNAs. The execution time of “DIANA-microT” on a database whose size far outweighs that of the miRNA file compared against it requires us to adopt a parallel approach to implementing this task [1]. Here we describe a specific parallelization method which significantly enhances execution time.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DIANA-microT web server: elucidating microRNA functions through target prediction",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/nar/article-abstract/37/suppl_2/W273/1128394",
            "Abstract": "Computational microRNA (miRNA) target prediction is one of the key means for deciphering the role of miRNAs in development and disease. Here, we present the DIANA-microT web server as the user interface to the DIANA-microT 3.0 miRNA target prediction algorithm. The web server provides extensive information for predicted miRNA:target gene interactions with a user-friendly interface, providing extensive connectivity to online biological resources. Target gene and miRNA functions may be elucidated through automated bibliographic searches and functional information is accessible through Kyoto Encyclopedia of Genes and Genomes (KEGG) pathways. The web server offers links to nomenclature, sequence and protein databases, and users are facilitated by being able to search for targeted genes using different nomenclatures or functional features, such as the genes possible involvement in biological …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "DIANA-LncBase v2: indexing microRNA targets on non-coding transcripts",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/nar/article-abstract/44/D1/D231/2503082",
            "Abstract": "microRNAs (miRNAs) are short non-coding RNAs (ncRNAs) that act as post-transcriptional regulators of coding gene expression. Long non-coding RNAs (lncRNAs) have been recently reported to interact with miRNAs. The sponge-like function of lncRNAs introduces an extra layer of complexity in the miRNA interactome. DIANA-LncBase v1 provided a database of experimentally supported and in silico predicted miRNA Recognition Elements (MREs) on lncRNAs. The second version of LncBase (www.microrna.gr/LncBase) presents an extensive collection of miRNA:lncRNA interactions. The significantly enhanced database includes more than 70 000 low and high-throughput, (in)direct miRNA:lncRNA experimentally supported interactions, derived from manually curated publications and the analysis of 153 AGO CLIP-Seq libraries. The new experimental module presents a 14-fold increase compared to the …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Support Vector Machines for Predicting microRNA Hairpins.",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Artemis-Hatzigeorgiou-2/publication/221051647_Support_Vector_Machines_for_Predicting_microRNA_Hairpins/links/09e41511cfd884565c000000/Support-Vector-Machines-for-Predicting-microRNA-Hairpins.pdf",
            "Abstract": "RNAs which are rapidly emerging as crucial regulators of gene expression in plants and animals. Identification of the hairpins which yield mature miRNAs is the first and most challenging step in miRNA gene prediction. We believe this step can best be achieved with biologically motivated feature design and classification techniques which account for the dependencies inherent in any set of hairpin features. We present DIANA-microH, a tool for predicting microRNA hairpins with high specificity and sensitivity. DIANA-microH implements a Support Vector Machine classifier trained on a set of structural and evolutionary features characteristic of miRNA hairpins. DIANA-microH introduces a unique structural feature motivated by a consideration of how enzymatic cleavage occurs. On test data, the SVM classifier achieved an accuracy of 98.6%. DIANA-microH is applied to chromosome 21 to provide a set of highly probable miRNA hairpins for future laboratory testing.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational/experimental approaches reveal novel functions of microRNAs in disease: IL2D-4",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=6871211956125850141&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "miRNA genetic alterations in human cancers",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1517/14712598.7.9.1375",
            "Abstract": "MicroRNAs (miRNAs) are endogenous, non-coding, small RNAs, which negatively regulate gene expression in a sequence-specific manner via translational repression and/or mRNA degradation. Their discovery revealed a new and exciting aspect of post-transcriptional gene regulation that is universally involved in cellular homeostasis. Importantly, the advent of miRNAs added another level of complication in the already complex regulatory networks of the cell, undermining that RNA molecules in general, should be considered gene regulators of equal importance with proteins. Recently, the scientific community drew attention to the miRNA field for an additional reason: an increasing line of evidence indicated that miRNA genes are tightly connected with the process of tumorigenesis. Indeed, several miRNAs have already been demonstrated to behave as oncogenes or tumor suppressor genes in many types of …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Identification of Microrna-221,-222 and-323-3p Association with Rheumatoid Arthritis Via Predictions Using the Human TNF Transgenic Mouse Model",
            "Publication year": 2011,
            "Publication url": "https://www.zora.uzh.ch/62509/1/Pandis_et_al_2012_Accepted_manuscript.pdf",
            "Abstract": "(SFs), by performing miR expression profiling on cells isolated from the human TNF transgenic mouse model (TghuTNF, Tg197) and patients biopsies.METHODS: miR expression in SFs from TghuTNF and WT control mice were determined by miR deep sequencing (miR-seq) and the arthritic profile was established by pairwise comparisons. qPCR analysis was utilised for profile validation, miR and gene quantitation in patient SFs. Dysregulated miR target genes and pathways were predicted via bioinformatic algorithms and validated using gain-of-function coupled with reporter assays experiments.RESULTS: miR-seq demonstrated that TghuTNF-SFs exhibit a distinct pathogenic profile with 22 significantly upregulated and 30 significantly downregulated miRs. Validation assays confirmed the dysregulation of miR-223, miR-146a and miR-155 previously associated with human rheumatoid arthritis (RA) pathology, as well as that of miR-221/222 and miR-323-3p. Notably, the latter were also found significantly upregulated in patient RASFs, suggesting for the first time their association with RA pathology.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:NMxIlDl6LWMC",
            "Publisher": "WILEY-BLACKWELL"
        },
        {
            "Title": "The DIANA-mirExTra web server: from gene expression data to microRNA function",
            "Publication year": 2010,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0009171",
            "Abstract": "Background High-throughput gene expression experiments are widely used to identify the role of genes involved in biological conditions of interest. MicroRNAs (miRNA) are regulatory molecules that have been functionally associated with several developmental programs and their deregulation with diverse diseases including cancer.  Methodology/Principal Findings Although miRNA expression levels may not be routinely measured in high-throughput experiments, a possible involvement of miRNAs in the deregulation of gene expression can be computationally predicted and quantified through analysis of overrepresented motifs in the deregulated genes 3′ untranslated region (3′UTR) sequences. Here, we introduce a user-friendly web-server, DIANA-mirExTra (www.microrna.gr/mirextra) that allows the comparison of frequencies of miRNA associated motifs between sets of genes that can lead to the identification of miRNAs responsible for the deregulation of large numbers of genes. To this end, we have investigated different approaches and measures, and have practically implemented them on experimental data.  Conclusions/Significance On several datasets of miRNA overexpression and repression experiments, our proposed approaches have successfully identified the deregulated miRNA. Beyond the prediction of miRNAs responsible for the deregulation of transcripts, the web-server provides extensive links to DIANA-mirPath, a functional analysis tool incorporating miRNA targets in biological pathways. Additionally, in case information about miRNA expression changes is provided, the results can be filtered to display the analysis for …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:Zph67rFs4hoC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "RNAcentral: a hub of information for non-coding RNA sequences",
            "Publication year": 2019,
            "Publication url": "https://academic.oup.com/nar/article-abstract/47/D1/D221/5160993",
            "Abstract": "RNAcentral is a comprehensive database of non-coding RNA (ncRNA) sequences, collating information on ncRNA sequences of all types from a broad range of organisms. We have recently added a new genome mapping pipeline that identifies genomic locations for ncRNA sequences in 296 species. We have also added several new types of functional annotations, such as tRNA secondary structures, Gene Ontology annotations, and miRNA-target interactions. A new quality control mechanism based on Rfam family assignments identifies potential contamination, incomplete sequences, and more. The RNAcentral database has become a vital component of many workflows in the RNA community, serving as both the primary source of sequence data for academic and commercial groups, as well as a source of stable accessions for the annotation of genomic and functional features. These examples are …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "FLASH proton radiotherapy spares normal epithelial and mesenchymal tissues while preserving sarcoma response",
            "Publication year": 2021,
            "Publication url": "https://cancerres.aacrjournals.org/content/81/18/4808?elqTrackId=8557db49355d431fae14702df7f2ee3a",
            "Abstract": "In studies of electron and proton radiotherapy, ultrahigh dose rates of FLASH radiotherapy appear to produce fewer toxicities than standard dose rates while maintaining local tumor control. FLASH-proton radiotherapy (F-PRT) brings the spatial advantages of PRT to FLASH dose rates (>40 Gy/second), making it important to understand if and how F-PRT spares normal tissues while providing antitumor efficacy that is equivalent to standard-proton radiotherapy (S-PRT). Here we studied PRT damage to skin and mesenchymal tissues of muscle and bone and found that F-PRT of the C57BL/6 murine hind leg produced fewer severe toxicities leading to death or requiring euthanasia than S-PRT of the same dose. RNA-seq analyses of murine skin and bone revealed pathways upregulated by S-PRT yet unaltered by F-PRT, such as apoptosis signaling and keratinocyte differentiation in skin, as well as osteoclast …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:NJ774b8OgUMC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Sequence and comparative analysis of the chicken genome provide unique perspectives on vertebrate evolution.",
            "Publication year": 2004,
            "Publication url": "https://escholarship.org/uc/item/44v0c3r5",
            "Abstract": "We present here a draft genome sequence of the red jungle fowl, Gallus gallus. Because the chicken is a modern descendant of the dinosaurs and the first non-mammalian amniote to have its genome sequenced, the draft sequence of its genome--composed of approximately one billion base pairs of sequence and an estimated 20,000-23,000 genes--provides a new perspective on vertebrate genome evolution, while also improving the annotation of mammalian genomes. For example, the evolutionary distance between chicken and human provides high specificity in detecting functional elements, both non-coding and coding. Notably, many conserved non-coding sequences are far from genes and cannot be assigned to defined functional classes. In coding regions the evolutionary dynamics of protein domains and orthologous groups illustrate processes that distinguish the lineages leading to birds and mammals. The distinctive properties of avian microchromosomes, together with the inferred patterns of conserved synteny, provide additional insights into vertebrate chromosome architecture.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A transcription factor affinity-based code for mammalian transcription initiation",
            "Publication year": 2009,
            "Publication url": "https://genome.cshlp.org/content/19/4/644.short",
            "Abstract": "The recent arrival of large-scale cap analysis of gene expression (CAGE) data sets in mammals provides a wealth of quantitative information on coding and noncoding RNA polymerase II transcription start sites (TSS). Genome-wide CAGE studies reveal that a large fraction of TSS exhibit peaks where the vast majority of associated tags map to a particular location (∼45%), whereas other active regions contain a broader distribution of initiation events. The presence of a strong single peak suggests that transcription at these locations may be mediated by position-specific sequence features. We therefore propose a new model for single-peaked TSS based solely on known transcription factors (TFs) and their respective regions of positional enrichment. This probabilistic model leads to near-perfect classification results in cross-validation (auROC = 0.98), and performance in genomic scans demonstrates that TSS …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "Manatee: detection and quantification of small non-coding RNAs from next-generation sequencing data",
            "Publication year": 2020,
            "Publication url": "https://www.nature.com/articles/s41598-020-57495-9",
            "Abstract": "Small non-coding RNAs (sncRNAs) play important roles in health and disease. Next Generation Sequencing (NGS) technologies are considered as the most powerful and versatile methodologies to explore small RNA (sRNA) transcriptomes in diverse experimental and clinical studies. Small RNA-Seq (sRNA-Seq) data analysis proved to be challenging due to non-unique genomic origin, short length, and abundant post-transcriptional modifications of sRNA species. Here, we present Manatee, an algorithm for the quantification of sRNA classes and the detection of novel expressed non-coding loci. Manatee combines prior annotation of sRNAs with reliable alignment density information and extensive rescue of usually neglected multimapped reads to provide accurate transcriptome-wide sRNA expression quantification. Comparison of Manatee against state-of-the-art implementations using real and simulated data …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Accurate microRNA target prediction using detailed binding site accessibility and machine learning on proteomics data",
            "Publication year": 2012,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fgene.2011.00103/full",
            "Abstract": "MicroRNAs (miRNAs) are a class of small regulatory genes regulating gene expression by targeting messenger RNA. Though computational methods for miRNA target prediction are the prevailing means to analyze their function, they still miss a large fraction of the targeted genes and additionally predict a large number of false positives. Here we introduce a novel algorithm called DIANAmicroT- ANN which combines multiple novel target site features through an artificial neural network (ANN) and is trained using recently published high-throughput data measuring the change of protein levels after miRNA overexpression, providing positive and negative targeting examples. The features characterizing each miRNA recognition element include binding structure, conservation level and a specific profile of structural accessibility. The ANN is trained to integrate the features of each recognition element along the 3’ untranslated region into a targeting score, reproducing the relative repression fold change of the protein. Tested on two different sets the algorithm outperforms other widely used algorithms and also predicts a significant number of unique and reliable targets not predicted by the other methods. For 542 human miRNAs DIANA-microT-ANN predicts 120,000 targets not provided by TargetScan 5.0. The algorithm is freely available at http://microrna.gr/microT-ANN.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Knowledge-based TDNN architectures for features recognition in DNA sequences",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/938723/",
            "Abstract": "We present work on the eflective utilization of ANNs for the recognition and location of specific regulatoly elements in genomic DNA, namely promoters. In particular, we rely on the utilization of knowledge-based NN (kbNN) techniques for the automatic construction of Time Delay NN (TDNN) architectures. The prior-knowledge is based and extracted from position weight-matrices of the DNA-sequence bases. The resulted kPRNN: knowledgeable Promoter Recognition Neural Network is trained, and the knowledge used to initialize the TDNN is refined. Experimental results show a significant improvement in TDNN-based promoter recognition.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A poly (lactic-co-glycolic) acid nanovaccine based on chimeric peptides from different Leishmania infantum proteins induces dendritic cells maturation and promotes peptide-specific IFNγ-producing CD8+ T cells essential for the protection against experimental visceral leishmaniasis",
            "Publication year": 2017,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fimmu.2017.00684/full",
            "Abstract": "Visceral leishmaniasis (VL), caused by Leishmania (L.) donovani and L. infantum protozoan parasites, can provoke overwhelming and protracted epidemics, with high case–fatality rates. An effective vaccine against the disease must rely on the generation of a strong and long-lasting T cell immunity, mediated by CD4+ TH1 and CD8+ T cells. Multi-epitope peptide-based vaccine development is manifesting as the new era of vaccination strategies against Leishmania infection. In the present study, we designed chimeric peptides containing HLA-restricted epitopes from three immunogenic L. infantum proteins (cysteine peptidase A, histone H1 and kinetoplastid membrane protein 11), in order to be encapsulated in poly(lactic-co-glycolic) acid nanoparticles with or without the adjuvant Monophosphoryl lipid A (MPLA) or surface modification with an octapeptide targeting the Tumor Necrosis Factor Receptor II. We aimed to construct differentially functionalized peptide-based nanovaccine candidates and investigate their capacity to stimulate the immunomodulatory properties of dendritic cells (DCs), which are critical regulators of adaptive immunity generated upon vaccination. According to our results, DCs stimulation with the peptide-based nanovaccine candidates with MPLA incorporation or surface modification induced an enhanced maturation profile with prominent IL-12 production, promoting allogeneic Τ cell proliferation and intracellular production of IFN by CD4+ and CD8+ T cell subsets. In addition, DCs stimulated with the peptide-based nanovaccine candidate with MPLA incorporation exhibited a robust transcriptional activation, characterized …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:vRqMK49ujn8C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "PlasmiR: A Manual Collection of Circulating microRNAs of Prognostic and Diagnostic Value",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2072-6694/13/15/3680",
            "Abstract": "Only recently have the important biomarker capacities of microRNAs (miRNAs) in blood samples during disease been revealed. miRNAs are abundantly detected in circulation, and are less prone to degradation than longer RNA. Details regarding potential discriminatory miRNAs against numerous pathologic conditions are dispersed across articles, while existing resources that catalogue miRNA abundance in blood samples are not tailored to biomarker research. This study presents the meticulous manual curation of more than 200 articles that specifically interrogate the biomarker potential of miRNAs in whole blood, serum, or plasma. This annotation effort resulted in the creation of plasmiR, a database that systematically provides experimental evidence for the diagnostic and prognostic potential of circulating miRNAs against human diseases. plasmiR features 1021 entries, accompanied by rich study-specific meta-information, and an intuitive interface that enables the formation of complex queries and visualizations.Only recently, microRNAs (miRNAs) were found to exist in traceable and distinctive amounts in the human circulatory system, bringing forth the intriguing possibility of using them as minimally invasive biomarkers. miRNAs are short non-coding RNAs that act as potent post-transcriptional regulators of gene expression. Extensive studies in cancer and other disease landscapes investigate the protective/pathogenic functions of dysregulated miRNAs, as well as their biomarker potential. A specialized resource amassing experimentally verified, circulating miRNA biomarkers …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Reporting on the role of miRNAs and affected pathways on the molecular backbone of ovarian insufficiency: A systematic review and critical analysis mapping of future research",
            "Publication year": 2020,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc7835544/",
            "Abstract": "Ovarian insufficiency is identified as a perplexing entity in the long list of pathologies impairing fertility dynamics. The three distinct classifications of ovarian insufficiency are poor ovarian response, premature ovarian insufficiency/failure, and advanced maternal age, sharing the common denominator of deteriorated ovarian reserve. Despite efforts to define clear lines among the three, the vast heterogeneity and overlap of clinical characteristics renders their diagnosis and management challenging. Lack of a consensus has prompted an empirically based management coupled by uncertainty from the clinicians’ perspective. Profiling of patients in the era of precision medicine seems to be the way forward, while the necessity for a novel approach is underlined. Implicating miRNAs in the quest for patient profiling is promising in light of their fundamental role in cellular and gene expression regulation. To this end, the …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Frontiers Media SA"
        },
        {
            "Title": "TarMiner: automatic extraction of miRNA targets from literature",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2791347.2791366",
            "Abstract": "MicroRNAs (miRNAs) are small RNA molecules that target particular genes and prohibit their expression. Since many important diseases are related to the expression or non-expression of particular genes, knowing the miRNAs that affect these genes can help in finding possible treatments. In the last decade, a large amount of experimental studies trying to reveal the targets of several miRNAs has been published. A handful of curated databases that collect miRNA targets from the literature have been developed to make this information more easily available. However, due to the large number of existing published articles, maintaining these databases up-to-date is a tedious task that requires important resources. In this work we introduce TarMiner, a pipeline for automatic extraction of miRNA targets that can facilitate the curation process of databases that maintain miRNA validated targets.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "microRNAs exhibit high frequency genomic alterations in human cancer",
            "Publication year": 2006,
            "Publication url": "https://www.pnas.org/content/103/24/9136.short",
            "Abstract": "MicroRNAs (miRNAs) are endogenous noncoding RNAs, which negatively regulate gene expression. To determine genomewide miRNA DNA copy number abnormalities in cancer, 283 known human miRNA genes were analyzed by high-resolution array-based comparative genomic hybridization in 227 human ovarian cancer, breast cancer, and melanoma specimens. A high proportion of genomic loci containing miRNA genes exhibited DNA copy number alterations in ovarian cancer (37.1%), breast cancer (72.8%), and melanoma (85.9%), where copy number alterations observed in >15% tumors were considered significant for each miRNA gene. We identified 41 miRNA genes with gene copy number changes that were shared among the three cancer types (26 with gains and 15 with losses) as well as miRNA genes with copy number changes that were unique to each tumor type. Importantly, we show that …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "National Academy of Sciences"
        },
        {
            "Title": "DIANA-microT web server v5. 0: service integration into miRNA functional analysis workflows",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/nar/article-abstract/41/W1/W169/1100417",
            "Abstract": "MicroRNAs (miRNAs) are small endogenous RNA molecules that regulate gene expression through mRNA degradation and/or translation repression, affecting many biological processes. DIANA-microT web server (http://www.microrna.gr/webServer) is dedicated to miRNA target prediction/functional analysis, and it is being widely used from the scientific community, since its initial launch in 2009. DIANA-microT v5.0, the new version of the microT server, has been significantly enhanced with an improved target prediction algorithm, DIANA-microT-CDS. It has been updated to incorporate miRBase version 18 and Ensembl version 69. The in silico-predicted miRNA–gene interactions in Homo sapiens, Mus musculus, Drosophila melanogaster and Caenorhabditis elegans exceed 11 million in total. The web server was completely redesigned, to host a series of sophisticated workflows, which can be used directly …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:RGFaLdJalmkC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Identifying pri-miRNA transcription start sites",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/protocol/10.1007/978-1-4939-8624-8_2",
            "Abstract": "MicroRNAs (miRNAs) are small non-coding RNAs that can regulate gene expression playing vital role in nearly all biological pathways. Even though miRNAs have been intensely studied for more than two decades, information regarding miRNA transcription regulation remains limited. The rapid cleavage of primary miRNA transcripts (pri-miRNAs) by Drosha in the nucleus hinders their identification with conventional RNA-seq approaches. Identifying the transcription start site (TSS) of miRNAs will enable genome-wide identification of their expression regulators, including transcription factors (TFs), other non-coding RNAs (ncRNAs) and epigenetic modifiers, providing significant breakthroughs in understanding the mechanisms underlying miRNA expression in development and disease. Here we present a protocol that utilizes microTSS, a versatile computational framework for accurate and single-nucleotide …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "DIANA-miRPath v3. 0: deciphering microRNA function with experimental support",
            "Publication year": 2015,
            "Publication url": "https://academic.oup.com/nar/article-abstract/43/W1/W460/2467903",
            "Abstract": "The functional characterization of miRNAs is still an open challenge. Here, we present DIANA-miRPath v3.0 (http://www.microrna.gr/miRPathv3) an online software suite dedicated to the assessment of miRNA regulatory roles and the identification of controlled pathways. The new miRPath web server renders possible the functional annotation of one or more miRNAs using standard (hypergeometric distributions), unbiased empirical distributions and/or meta-analysis statistics. DIANA-miRPath v3.0 database and functionality have been significantly extended to support all analyses for KEGG molecular pathways, as well as multiple slices of Gene Ontology (GO) in seven species (Homo sapiens, Mus musculus, Rattus norvegicus, Drosophila melanogaster, Caenorhabditis elegans, Gallus gallus and Danio rerio). Importantly, more than 600 000 experimentally supported miRNA targets from DIANA-TarBase v7.0 …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "TarBase 6.0: capturing the exponential growth of miRNA targets with experimental support",
            "Publication year": 2012,
            "Publication url": "https://academic.oup.com/nar/article-abstract/40/D1/D222/2903277",
            "Abstract": "As the relevant literature and the number of experiments increase at a super linear rate, databases that curate and collect experimentally verified microRNA (miRNA) targets have gradually emerged. These databases attempt to provide efficient access to this wealth of experimental data, which is scattered in thousands of manuscripts. Aim of TarBase 6.0 (http://www.microrna.gr/tarbase) is to face this challenge by providing a significant increase of available miRNA targets derived from all contemporary experimental techniques (gene specific and high-throughput), while incorporating a powerful set of tools in a user-friendly interface. TarBase 6.0 hosts detailed information for each miRNA–gene interaction, ranging from miRNA- and gene-related facts to information specific to their interaction, the experimental validation methodologies and their outcomes. All database entries are enriched with function-related data …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "The whole genome sequence of the Mediterranean fruit fly, Ceratitis capitata (Wiedemann), reveals insights into the biology and adaptive evolution of a highly invasive pest species",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s13059-016-1049-2",
            "Abstract": "The Mediterranean fruit fly (medfly), Ceratitis capitata, is a major destructive insect pest due to its broad host range, which includes hundreds of fruits and vegetables. It exhibits a unique ability to invade and adapt to ecological niches throughout tropical and subtropical regions of the world, though medfly infestations have been prevented and controlled by the sterile insect technique (SIT) as part of integrated pest management programs (IPMs). The genetic analysis and manipulation of medfly has been subject to intensive study in an effort to improve SIT efficacy and other aspects of IPM control. The 479 Mb medfly genome is sequenced from adult flies from lines inbred for 20 generations. A high-quality assembly is achieved having a contig N50 of 45.7 kb and scaffold N50 of 4.06 Mb. In-depth curation of more than 1800 messenger RNAs shows specific gene expansions that can be related to invasiveness and host …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:u9iWguZQMMsC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Same computational analysis, different miRNA target predictions",
            "Publication year": 2007,
            "Publication url": "https://www.nature.com/articles/nmeth0307-191a",
            "Abstract": "To the editor: Sethupathy et al. 1 compared various microRNA (miRNA) target-prediction programs and present a practical guide for predicting miRNA targets. The programs differ in their requirement for base-pairing of miRNA and target genes and implement similar but not the same criteria when cross-species conservation is applied. Consequently, these programs generate different sets of target genes for some, probably all, miRNAs. Sethupathy et al. 1 presented an online tool that takes sets of target genes predicted by the individual programs and presents compiled lists of the intersection of some programs, providing higher specificity, and the union of all programs, providing higher sensitivity for a particular miRNA (http://www. diana. pcbi. upenn. edu/cgibin/TargetCombo. cgi).We used the same concept of intersection of some of the programs to obtain high specificity and a manageable number of target genes …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:08ZZubdj9fEC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "MicroRNA-934 is a novel primate-specific small non-coding RNA with neurogenic function during early development",
            "Publication year": 2020,
            "Publication url": "https://elifesciences.org/articles/50561",
            "Abstract": "Integrating differential RNA and miRNA expression during neuronal lineage induction of human embryonic stem cells we identified miR-934, a primate-specific miRNA that displays a stage-specific expression pattern during progenitor expansion and early neuron generation. We demonstrate the biological relevance of this finding by comparison with data from early to mid-gestation human cortical tissue. Further we find that miR-934 directly controls progenitor to neuroblast transition and impacts on neurite growth of newborn neurons. In agreement, miR-934 targets are involved in progenitor proliferation and neuronal differentiation whilst miR-934 inhibition results in profound global transcriptome changes associated with neurogenesis, axonogenesis, neuronal migration and neurotransmission. Interestingly, miR-934 inhibition affects the expression of genes associated with the subplate zone, a transient compartment most prominent in primates that emerges during early corticogenesis. Our data suggest that mir-934 is a novel regulator of early human neurogenesis with potential implications for a species-specific evolutionary role in brain function.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:PELIpwtuRlgC",
            "Publisher": "eLife Sciences Publications Limited"
        },
        {
            "Title": "Computational Analysis of Human DNA Sequences: An Application of Artificial Neural Networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-30927-6_7",
            "Abstract": "In this chapter we give an introduction to the area of bioinformatics handling the nucleotide sequence analysis problem. We give a brief introduction to the nature of DNA and RNA and use one of many topics - the Translation Initiation Start (TIS) problem - to explain a computational prediction of motifs on biological sequences. Correct identification of the Translation Initiation Start (TIS) in cDNA sequences is an important issue for genome annotation. Here we describe a computational method for TIS identification based in a combination of statistics and Artificial Neural Networks (ANNs). This method makes use of two modules, one sensitive to the conserved motif and the other sensitive to the coding/noncoding potential around the start codon. Finally by applying a method inspired by molecular biology, the simplified method of the ribosome scanning model improves the prediction significantly.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Association of microRNA-221/222 and-323-3p with rheumatoid arthritis via predictions using the human TNF transgenic mouse model",
            "Publication year": 2012,
            "Publication url": "https://arthritis-research.biomedcentral.com/articles/10.1186/ar3660",
            "Abstract": "BackgroundMicroRNAs (miRs), a class of small non-coding RNA molecules, act as posttranscriptional regulators and are involved in a plethora of cellular functions. miRs have attracted a great deal of attention as potential therapeutic targets, as the sequence-specific mode in which they act, allows the simultaneous targeting of multiple target genes, often members of the same biological pathway (s)[1]. Previous studies have demonstrated that miRs are dysregulated and functionally involved in rheumatoid arthritis (RA)[2–9]. In this study we sought to identify novel miR associations in synovial fibroblasts (SFs), a key pathogenic cell type in RA [10, 11], by performing miR expression profiling on cells isolated from the human TNF transgenic mouse model (TghuTNF, Tg197)[12] and patients biopsies.Materials and methodsmiR expression in SFs from TghuTNF and WT control mice were determined by deep sequencing and the arthritic profile was established by pairwise comparisons. qRT-PCR analysis was utilised for profile validation, miR and gene quantitation in patient SFs. Dysregulated miR target genes and pathways were predicted via bioinformatic algorithms.ResultsDeep sequencing demonstrated that TghuTNF-SFs exhibit a distinct pathogenic profile with 22 significantly upregulated and 30 significantly downregulated miRs (fold change> 1.5, p-value< 0.05). qRT-PCR validation assays confirmed the dysregulation of miR-223, miR-146a and miR-155 previously associated with human RA pathology, as well as that of miR-221/222 and miR-323-3p. Notably, the latter were also found significantly upregulated in patient RASFs, suggesting their …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "The database of experimentally supported targets: a functional update of TarBase",
            "Publication year": 2009,
            "Publication url": "https://academic.oup.com/nar/article-abstract/37/suppl_1/D155/1011763",
            "Abstract": "TarBase5.0 is a database which houses a manually curated collection of experimentally supported microRNA (miRNA) targets in several animal species of central scientific interest, plants and viruses. MiRNAs are small non-coding RNA molecules that exhibit an inhibitory effect on gene expression, interfering with the stability and translational efficiency of the targeted mature messenger RNAs. Even though several computational programs exist to predict miRNA targets, there is a need for a comprehensive collection and description of miRNA targets with experimental support. Here we introduce a substantially extended version of this resource. The current version includes more than 1300 experimentally supported targets. Each target site is described by the miRNA that binds it, the gene in which it occurs, the nature of the experiments that were conducted to test it, the sufficiency of the site to induce translational …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Deciphering the role of miRNAs in hypoxia by digital gene expression profiling",
            "Publication year": 2008,
            "Publication url": "https://abstracts.ncri.org.uk/abstract/deciphering-the-role-of-mirnas-in-hypoxia-by-digital-gene-expression-profiling-2/",
            "Abstract": "Hypoxia in tumours may confer resistance to conventional therapies and is associated with a poorer prognosis. MicroRNA expression alterations have been described in cancer [1] and certain microRNAs have shown regulation by hypoxia [2, 3].",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transcriptome analysis identifies immune markers related to visceral leishmaniasis establishment in the experimental model of BALB/c mice",
            "Publication year": 2019,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fimmu.2019.02749/full",
            "Abstract": "Visceral leishmaniasis (VL) caused by Leishmania donovani and L. infantum is a potentially fatal disease. To date there are no registered vaccines for disease prevention despite the fact that several vaccines are in preclinical development. Thus, new strategies are needed to improve vaccine efficacy based on a better understanding of the mechanisms mediating protective immunity and mechanisms of host immune responses subversion by immunopathogenic components of Leishmania. We found that mice vaccinated with CPA162-189-loaded p8-PLGA nanoparticles, an experimental nanovaccine, induced the differentiation of antigen-specific CD8+ T cells in spleen compared to control mice, characterized by increased dynamics of proliferation and high amounts of IFN-γ production after ex vivo re-stimulation with CPA162-189 antigen. Vaccination with CPA162-189-loaded p8-PLGA nanoparticles resulted in about 80% lower parasite load in spleen and liver at 4 weeks after challenge with L. infantum promastigotes as compared to control mice. However, 16 weeks after infection the parasite load in spleen was comparable in both mouse groups. Decreased protection levels in vaccinated mice were followed by up-regulation of the anti-inflammatory IL-10 production although at lower levels in comparison to control mice. Microarray analysis in spleen tissue at 4 weeks post challenge revealed different immune-related profiles among the two groups. Specifically, vaccinated mice were characterized by similar profile to naïve mice. On the other hand, the transcriptome of the non-vaccinated mice was dominated by increased expression of genes …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:Mojj43d5GZwC",
            "Publisher": "Frontiers"
        },
        {
            "Title": "A combined computational-experimental approach predicts human microRNA targets",
            "Publication year": 2004,
            "Publication url": "http://genesdev.cshlp.org/content/18/10/1165.short",
            "Abstract": "A new paradigm of gene expression regulation has emerged recently with the discovery of microRNAs (miRNAs). Most, if not all, miRNAs are thought to control gene expression, mostly by base pairing with miRNA-recognition elements (MREs) found in their messenger RNA (mRNA) targets. Although a large number of human miRNAs have been reported, many of their mRNA targets remain unknown. Here we used a combined bioinformatics and experimental approach to identify important rules governing miRNA-MRE recognition that allow prediction of human miRNA targets. We describe a computational program, “DIANA-microT”, that identifies mRNA targets for animal miRNAs and predicts mRNA targets, bearing single MREs, for human and mouse miRNAs.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "Translation initiation start prediction in human cDNAs with high accuracy",
            "Publication year": 2002,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/18/2/343/225821",
            "Abstract": "Motivation: Correct identification of the Translation Initiation   Start (TIS) in cDNA sequences is an important issue for genome   annotation. The aim of this work is to improve upon current methods   and provide a performance guaranteed prediction.Methods: This   is achieved by using two modules, one sensitive to the conserved   motif and the other sensitive to the coding/non-coding potential   around the start codon. Both modules are based on Artificial Neural   Networks (ANNs). By applying the simplified method of the ribosome   scanning model, the algorithm starts a linear search at the   beginning of the coding ORF and stops once the combination of the   two modules predicts a positive score.Results: According to the results of the test group, 94% of   the TIS were correctly predicted. A confident decision is obtained   through the use of the Las Vegas algorithm idea. The incorporation   of this …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:5nxA0vEk-isC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "E-mail: pan. alexiou@ fleming. gr",
            "Publication year": 2011,
            "Publication url": "https://www.pagepress.org/journals/index.php/jnai/article/download/jnai.2011.e4/html_81?inline=1",
            "Abstract": "﻿ The use of online tools for bioinformatics analyses is becoming increasingly widespread. Resources specific to the field of microRNAs are available, varying in scope and usability. Online tools are the most useful for casual as well as power users since they need no installation, are hardware independent and are used mostly through graphic user interfaces and links to external sources. Here, we present an overview of useful online resources that have to do with microRNA genomics, gene finding, target prediction and functional analysis.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mathematical models for feature recognition in nucleotide sequences",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=7494641445121753968&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3 A Suite of Resources for",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=SlhAMdAqOJQC&oi=fnd&pg=PA45&dq=info:deLlNTHcJOYJ:scholar.google.com&ots=a7UpNQ9abM&sig=0S80zQSTAvddzegbs8tok0TpFI0",
            "Abstract": "MicroRNAs (miRNAs) are~ 22-nt small RNA molecules involved in posttranscriptional gene silencing in organisms ranging from plant to human (Bartel, 2004). They have been shown to bind, with perfect complementarity in plants, and usually imperfect complementarity in animals, to specific sites along the 3′ UTR of various cytoplasmic messenger RNAs. Since 2001, when miRNAs were appreciated as abundant and widespread regulators (Lagos-Quintana et al., 2001; Lee et al., 2001; Lau et al., 2001), they have been implicated in fat metabolism, development, differentiation, apoptosis, antiviral defense, insulin secretion, and many other diverse biological processes (Kloosterman et al., 2005). There is also strong evidence that the misexpression of miRNAs abets the development of many diseases such as various forms of cancer (Calin and Croce, 2006; Esquela-Kerscher and Slack, 2006). Since it has been predicted that miRNAs target at least 30% of human genes (Lewis et al., 2005; Rajewsky, 2006), it is likely that they underlie an even larger set of disease processes than is currently appreciated. In this chapter we present a suite of resources we have developed to facilitate the study of miRNA ontology and function.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:O3NaXMp0MMsC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "AKT3-mediated IWS1 phosphorylation promotes the proliferation of EGFR-mutant lung adenocarcinomas through cell cycle-regulated U2AF2 RNA splicing",
            "Publication year": 2021,
            "Publication url": "https://www.nature.com/articles/s41467-021-24795-1",
            "Abstract": "AKT-phosphorylated IWS1 regulates alternative RNA splicing via a pathway that is active in lung cancer. RNA-seq studies in lung adenocarcinoma cells lacking phosphorylated IWS1, identified a exon 2-deficient U2AF2 splice variant. Here, we show that exon 2 inclusion in the U2AF2 mRNA is a cell cycle-dependent process that is regulated by LEDGF/SRSF1 splicing complexes, whose assembly is controlled by the IWS1 phosphorylation-dependent deposition of histone H3K36me3 marks in the body of target genes. The exon 2-deficient U2AF2 mRNA encodes a Serine-Arginine-Rich (RS) domain-deficient U2AF65, which is defective in CDCA5 pre-mRNA processing. This results in downregulation of the CDCA5-encoded protein Sororin, a phosphorylation target and regulator of ERK, G2/M arrest and impaired cell proliferation and tumor growth. Analysis of human lung adenocarcinomas, confirmed activation of the …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "An Integrated Stress Response Pathway activates Perivascular Cancer-Associated Fibroblasts to Drive Angiogenesis and Tumor Progression",
            "Publication year": 2020,
            "Publication url": "https://www.researchsquare.com/article/rs-122088/latest.pdf",
            "Abstract": "ATF4 is a major effector of the Integrated Stress Response (ISR), a homeostatic mechanism coupling cell growth and survival to bioenergetic demands. Although the pro-tumorigenic role of the ISR in a tumor cellintrinsic manner has been established, its role in cell-extrinsic processes remains unexplored. Using novel conditional knockout ATF4 mouse models, we show that global, or broblast (FB)-speci c loss of host ATF4 results in abnormal tumor vascularization and a pronounced tumor growth delay in syngeneic melanoma and pancreatic tumor models, a phenotype which is largely reversed by co-injection of ATF4wt/wt FBs. Single-cell tumor transcriptomics uncovered a reduction of markers associated with FB activation in a cluster of perivascular cancer-associated broblasts (CAF) in ATF4Δ/Δ mice. ATF4Δ/Δ FBs displayed signi cant defects in collagen biosynthesis and deposition and reduced ability to support angiogenesis in vitro. Mechanistically, ATF4 directly regulates the expression of the Col1a1 gene as well as the biosynthesis of glycine and proline, the major amino acids comprising collagen bers. Analysis of human tumor samples revealed a strong correlation between ATF4 and collagen levels and between an ATF4 FB signature and expression of collagen genes. Our ndings uncover a novel role of stromal ATF4 in shaping CAF functionality, a key driver of disease progression and therapy resistance.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A guide through present computational approaches for the identification of mammalian microRNA targets",
            "Publication year": 2006,
            "Publication url": "https://www.nature.com/articles/nmeth954",
            "Abstract": "Computational microRNA (miRNA) target prediction is a field in flux. Here we present a guide through five widely used mammalian target prediction programs. We include an analysis of the performance of these individual programs and of various combinations of these programs. For this analysis we compiled several benchmark data sets of experimentally supported miRNA–target gene interactions. Based on the results, we provide a discussion on the status of target prediction and also suggest a stepwise approach toward predicting and selecting miRNA targets for experimental testing.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "miRNA regulons associated with synaptic function",
            "Publication year": 2012,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0046189",
            "Abstract": "Differential RNA localization and local protein synthesis regulate synapse function and plasticity in neurons. MicroRNAs are a conserved class of regulatory RNAs that control mRNA stability and translation in tissues. They are abundant in the brain but the extent into which they are involved in synaptic mRNA regulation is poorly known. Herein, a computational analysis of the coding and 3′UTR regions of 242 presynaptic and 304 postsynaptic proteins revealed that 91% of them are predicted to be microRNA targets. Analysis of the longest 3′UTR isoform of synaptic transcripts showed that presynaptic mRNAs have significantly longer 3′UTR than control and postsynaptic mRNAs. In contrast, the shortest 3′UTR isoform of postsynaptic mRNAs is significantly shorter than control and presynaptic mRNAs, indicating they avert microRNA regulation under specific conditions. Examination of microRNA binding site density of synaptic 3′UTRs revealed that they are twice as dense as the rest of protein-coding transcripts and that approximately 50% of synaptic transcripts are predicted to have more than five different microRNA sites. An interaction map exploring the association of microRNAs and their targets revealed that a small set of ten microRNAs is predicted to regulate 77% and 80% of presynaptic and postsynaptic transcripts, respectively. Intriguingly, many of these microRNAs have yet to be identified outside primate mammals, implicating them in cognition differences observed between high-level primates and non-primate mammals. Importantly, the identified miRNAs have been previously associated with psychotic disorders that are …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:r0BpntZqJG4C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Integrated analysis of microRNA and mRNA expression and association with HIF binding reveals the complexity of microRNA expression regulation under hypoxia",
            "Publication year": 2014,
            "Publication url": "https://molecular-cancer.biomedcentral.com/articles/10.1186/1476-4598-13-28",
            "Abstract": "In mammalians, HIF is a master regulator of hypoxia gene expression through direct binding to DNA, while its role in microRNA expression regulation, critical in the hypoxia response, is not elucidated genome wide. Our aim is to investigate in depth the regulation of microRNA expression by hypoxia in the breast cancer cell line MCF-7, establish the relationship between microRNA expression and HIF binding sites, pri-miRNA transcription and microRNA processing gene expression. MCF-7 cells were incubated at 1% Oxygen for 16, 32 and 48 h. SiRNA against HIF-1α and HIF-2α were performed as previously published. MicroRNA and mRNA expression were assessed using microRNA microarrays, small RNA sequencing, gene expression microarrays and Real time PCR. The Kraken pipeline was applied for microRNA-seq analysis along with Bioconductor packages. Microarray data was analysed using Limma (Bioconductor), ChIP-seq data were analysed using Gene Set Enrichment Analysis and multiple testing correction applied in all analyses. Hypoxia time course microRNA sequencing data analysis identified 41 microRNAs significantly up- and 28 down-regulated, including hsa-miR-4521, hsa-miR-145-3p and hsa-miR-222-5p reported in conjunction with hypoxia for the first time. Integration of HIF-1α and HIF-2α ChIP-seq data with expression data showed overall association between binding sites and microRNA up-regulation, with hsa-miR-210-3p and microRNAs of miR-27a/23a/24-2 and miR-30b/30d clusters as predominant examples. Moreover the expression of hsa-miR-27a-3p and hsa-miR-24-3p was found positively associated to a …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:zA6iFVUQeVQC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "ECCB 2018: The 17th European Conference on Computational Biology",
            "Publication year": 2018,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/34/17/i595/5093250",
            "Abstract": "The Conference is being held jointly with ISMB in the oddnumbered years and independently in the even-numbered years. This year, the 17th ECCB (ECCB 2018) will take place in Athens, at the Stavros Niarchos Foundation Cultural Center (SNFCC), from September 8 to 12, 2018. SNFCC, which was opened in June 2017, is a multifunctional arts, education and entertainment complex located on the edge of Faliro Bay, 4.5 km south of the center of Athens. Information on the ECCB 2018 can be found at eccb18. org and will be later archived at www. ebi. ac. uk/eccb/2018/. With more than 1,000 participants from academia and industry, ECCB is the leading European Conference on computational biology and bioinformatics and the second largest internationally, next to ISMB (Intelligent Systems in Molecular Biology). The work presented in ECCB is related to all domains of the field of computational biology and …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "MicroRNA promoter analysis",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-1-60327-005-2_11.pdf",
            "Abstract": "In this chapter, we present a brief overview of current knowledge about the promoters of plant microRNAs (miRNAs), and provide a step-by-step guide for predicting plant miRNA promoter elements using known transcription factor binding motifs. The approach to promoter element prediction is based on a carefully constructed collection of Positional Weight Matrices (PWMs) for known transcription factors (TFs) in Arabidopsis. A key concept of the method is to use scoring thresholds for potential binding sites that are appropriate to each individual transcription factor. While the procedure can be applied to search for Transcription Factor Binding Sites (TFBSs) in any pol-II promoter region, it is particularly practical for the case of plant miRNA promoters where upstream sequence regions and binding sites are not readily available in existing databases. The majority of the material described in this chapter is …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Neuronal ELAVL proteins utilize AUF-1 as a co-partner to induce neuron-specific alternative splicing of APP",
            "Publication year": 2017,
            "Publication url": "https://www.nature.com/articles/srep44507",
            "Abstract": "Aβ peptide that accumulates in Alzheimer’s disease brain, derives from proteolytic processing of the amyloid precursor protein (APP) that exists in three main isoforms derived by alternative splicing. The isoform APP695, lacking exons 7 and 8, is predominately expressed in neurons and abnormal neuronal splicing of APP has been observed in the brain of patients with Alzheimer’s disease. Herein, we demonstrate that expression of the neuronal members of the ELAVL protein family (nELAVLs) correlate with APP695 levels in vitro and in vivo. Moreover, we provide evidence that nELAVLs regulate the production of APP695; by using a series of reporters we show that concurrent binding of nELAVLs to sequences located both upstream and downstream of exon 7 is required for its skipping, whereas nELAVL-binding to a highly conserved U-rich sequence upstream of exon 8, is sufficient for its exclusion. Finally, we …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Phospho-IWS1-dependent U2AF2 splicing is cell-cycle-regulated, promotes proliferation and predicts poor prognosis of EGFR-mutant lung adenocarcinoma",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2020.07.14.195297v6.full-text",
            "Abstract": "Our previous studies have shown that IWS1 (Interacts with Spt6) is a phosphorylation target of AKT and regulates the alternative RNA splicing of FGFR2, linking IWS1 with human Non-Small Cell Lung Cancer. To further address the role of IWS1 in alternative RNA splicing in lung cancer, we performed an RNA-seq study using lung adenocarcinoma cells in which IWS1 was knocked down or replaced by its phosphorylation site mutant. The results identified a novel, exon 2 deficient splice variant of the splicing factor U2 Associated-Factor 2 (U2AF2), whose abundance increases, upon the loss of phosphorylated IWS1. This exon encodes part of the U2AF65 Serine-Rich (SR) Domain, which is required for its binding with pre-mRNA Processing factor 19 (Prp19). Here, we show that U2AF2 exon 2 inclusion depends on phosphorylated IWS1, by promoting histone H3K36 trimethylation and the assembly of LEDGF/SRSF1 splicing complexes, in a cell-cycle specific manner. Inhibition of the pathway results in the downregulation of cell cycle division associated 5 (CDCA5), a phosphorylation target and regulator of ERK, leading to G2/M phase arrest, impaired cell proliferation and tumor growth in mouse xenografts models, an effect more pronounced in EGFR mutant cells. Analysis of lung adenocarcinoma samples revealed strong correlations between IWS1 phosphorylation, U2AF2 RNA splicing, and Sororin/p-ERK levels, especially in EGFR, as opposed to K-RAS mutant patients. More importantly, IWS1 phosphorylation and U2AF2 RNA splicing pattern are positively correlated with tumor stage, grade and metastasis, and associated with poor survival in …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:uLbwQdceFCQC",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "DIANA-LncBase: experimentally verified and computationally predicted microRNA targets on long non-coding RNAs",
            "Publication year": 2013,
            "Publication url": "https://academic.oup.com/nar/article-abstract/41/D1/D239/1071827",
            "Abstract": "Recently, the attention of the research community has been focused on long non-coding RNAs (lncRNAs) and their physiological/pathological implications. As the number of experiments increase in a rapid rate and transcriptional units are better annotated, databases indexing lncRNA properties and function gradually become essential tools to this process. Aim of DIANA-LncBase (www.microrna.gr/LncBase) is to reinforce researchers’ attempts and unravel microRNA (miRNA)–lncRNA putative functional interactions. This study provides, for the first time, a comprehensive annotation of miRNA targets on lncRNAs. DIANA-LncBase hosts transcriptome-wide experimentally verified and computationally predicted miRNA recognition elements (MREs) on human and mouse lncRNAs. The analysis performed includes an integration of most of the available lncRNA resources, relevant high-throughput HITS-CLIP and …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "IWS1 phosphorylation promotes tumor growth and predicts poor prognosis in EGFR mutant lung adenocarcinoma patients, through the epigenetic regulation of U2AF2 RNA splicing.",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=13676714438108836141&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:hkOj_22Ku90C",
            "Publisher": "AMER ASSOC CANCER RESEARCH"
        },
        {
            "Title": "DIANA miRPath v. 2.0: investigating the combinatorial effect of microRNAs in pathways",
            "Publication year": 2012,
            "Publication url": "https://academic.oup.com/nar/article-abstract/40/W1/W498/1078464",
            "Abstract": "MicroRNAs (miRNAs) are key regulators of diverse biological processes and their functional analysis has been deemed central in many research pipelines. The new version of DIANA-miRPath web server was redesigned from the ground-up. The user of DNA Intelligent Analysis (DIANA) DIANA-miRPath v2.0 can now utilize miRNA targets predicted with high accuracy based on DIANA-microT-CDS and/or experimentally verified targets from TarBase v6; combine results with merging and meta-analysis algorithms; perform hierarchical clustering of miRNAs and pathways based on their interaction levels; as well as elaborate sophisticated visualizations, such as dendrograms or miRNA versus pathway heat maps, from an intuitive and easy to use web interface. New modules enable DIANA-miRPath server to provide information regarding pathogenic single nucleotide polymorphisms (SNPs) in miRNA target sites …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:4TOpqqG69KYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "DIANA-miRGen v3. 0: accurate characterization of microRNA promoters and their regulators",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/nar/article-abstract/44/D1/D190/2503068",
            "Abstract": "microRNAs (miRNAs) are small non-coding RNAs that actively fine-tune gene expression. The accurate characterization of the mechanisms underlying miRNA transcription regulation will further expand our knowledge regarding their implication in homeostatic and pathobiological networks. Aim of DIANA-miRGen v3.0 (http://www.microrna.gr/mirgen) is to provide for the first time accurate cell-line-specific miRNA gene transcription start sites (TSSs), coupled with genome-wide maps of transcription factor (TF) binding sites in order to unveil the mechanisms of miRNA transcription regulation. To this end, more than 7.3 billion RNA-, ChIP- and DNase-Seq next generation sequencing reads were analyzed/assembled and combined with state-of-the-art miRNA TSS prediction and TF binding site identification algorithms. The new database schema and web interface facilitates user interaction, provides advanced …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "MicroRNAs and their rgulatory genes exhibit high frequency genomic alterations in human epithelial cancers",
            "Publication year": 2006,
            "Publication url": "https://cancerres.aacrjournals.org/content/66/8_Supplement/622.1.short",
            "Abstract": "2638MicroRNAs (miRNAs) are endogenous non-coding RNAs, which negatively regulate gene expression. To determine genome-wide miRNA DNA copy number abnormalities in cancer, 207 known human miRNA genes were analyzed by high-resolution array-based CGH in 253 human ovarian and breast cancer as well as melanoma specimens. High proportion of miRNA genes exhibited DNA copy number alterations in ovarian cancer (40.6%), breast cancer (57.0%) and melanoma (57.2% of miRNA genes). These frequencies were significantly higher than the average genome alteration frequency in the same cancer dataset. We identified miRNA genes with gene copy number changes that were shared among the three types of cancer (22 with gain and 7 with loss) and miRNA genes with copy number changes that were unique to each tumor type. In addition, we identified miRNA genes with copy number …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Redirection of silencing targets by adenosine-to-inosine editing of miRNAs",
            "Publication year": 2007,
            "Publication url": "https://science.sciencemag.org/content/315/5815/1137.abstract",
            "Abstract": "Primary transcripts of certain microRNA (miRNA) genes are subject to RNA editing that converts adenosine to inosine. However, the importance of miRNA editing remains largely undetermined. Here we report that tissue-specific adenosine-to-inosine editing of miR-376 cluster transcripts leads to predominant expression of edited miR-376 isoform RNAs. One highly edited site is positioned in the middle of the 5′-proximal half “seed” region critical for the hybridization of miRNAs to targets. We provide evidence that the edited miR-376 RNA silences specifically a different set of genes. Repression of phosphoribosyl pyrophosphate synthetase 1, a target of the edited miR-376 RNA and an enzyme involved in the uric-acid synthesis pathway, contributes to tight and tissue-specific regulation of uric-acid levels, revealing a previously unknown role for RNA editing in miRNA-mediated gene silencing.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "American Association for the Advancement of Science"
        },
        {
            "Title": "DIANA-microT Web server upgrade supports Fly and Worm miRNA target prediction and bibliographic miRNA to disease association",
            "Publication year": 2011,
            "Publication url": "https://academic.oup.com/nar/article-abstract/39/suppl_2/W145/2505870",
            "Abstract": " microRNAs (miRNAs) are small endogenous RNA molecules that are implicated in many biological processes through post-transcriptional regulation of gene expression. The DIANA-microT Web server provides a user-friendly interface for comprehensive computational analysis of miRNA targets in human and mouse. The server has now been extended to support predictions for two widely studied species: Drosophila melanogaster and Caenorhabditis elegans . In the updated version, the Web server enables the association of miRNAs to diseases through bibliographic analysis and provides insights for the potential involvement of miRNAs in biological processes. The nomenclature used to describe mature miRNAs along different miRBase versions has been extensively analyzed, and the naming history of each miRNA has been extracted. This enables the identification of miRNA publications regardless of possible …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Finding signal peptides in human protein sequences using recurrent neural networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45784-4_5",
            "Abstract": "A new approach called Sigfind for the prediction of signal peptides in human protein sequences is introduced. The method is based on the bidirectional recurrent neural network architecture. The modifications to this architecture and a better learning algorithm result in a very accurate identification of signal peptides (99.5% correct in fivefold cross-validation). The Sigfind system is available on the WWW for predictions (http://www.stepc.gr/ synaptic/sig.nd.html).",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Accurate microRNA target prediction correlates with protein repression levels",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-10-295",
            "Abstract": "MicroRNAs are small endogenously expressed non-coding RNA molecules that regulate target gene expression through translation repression or messenger RNA degradation. MicroRNA regulation is performed through pairing of the microRNA to sites in the messenger RNA of protein coding genes. Since experimental identification of miRNA target genes poses difficulties, computational microRNA target prediction is one of the key means in deciphering the role of microRNAs in development and disease. DIANA-microT 3.0 is an algorithm for microRNA target prediction which is based on several parameters calculated individually for each microRNA and combines conserved and non-conserved microRNA recognition elements into a final prediction score, which correlates with protein production fold change. Specifically, for each predicted interaction the program reports a signal to noise ratio and a precision score …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Abstract PO-011: IWS1 phosphorylation promotes tumor growth and predicts poor prognosis in EGFR mutant lung adenocarcinoma patients, through the epigenetic regulation of U2AF2 RNA splicing",
            "Publication year": 2020,
            "Publication url": "https://cancerres.aacrjournals.org/content/80/23_Supplement/PO-011.short",
            "Abstract": "Our previous studies have shown that IWS1 (Interacts with Spt6) is a phosphorylation target of AKT and regulates the alternative RNA splicing of FGFR2, linking IWS1 with human Non-Small Cell Lung Cancer. To further address the role of IWS1 in alternative RNA splicing in lung cancer, we performed an RNA-seq study using lung adenocarcinoma cells in which IWS1 was knocked down or replaced by its phosphorylation site mutant. The results identified a novel, exon 2 deficient splice variant of the splicing factor U2 Associated-Factor 2 (U2AF2), whose abundance increases, upon the loss of phosphorylated IWS1. This exon encodes part of the U2AF65 Serine-Rich (SR) Domain, which is required for its binding with pre-mRNA Processing factor 19 (Prp19). Here, we show that U2AF2 exon 2 inclusion depends on phosphorylated IWS1, by promoting histone H3K36 trimethylation and the assembly of LEDGF/SRSF1 …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:N5tVd3kTz84C",
            "Publisher": "American Association for Cancer Research"
        },
        {
            "Title": "Prediction of human transnational initiation sites using a multiple neural network approach.",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=8148479880168649690&hl=en&oi=scholarr",
            "Abstract": "câėäîïäĮč dÜėîïL mĮėïäč rÜŅõåęL aėïÜéäî hĮïõäāÜęėāäęņ söčĮëïäŅL lïÖNL gėÜÜŅÜ aŅŅÜëïÜÖ äč ïâÜ< čĮį áęėéZ dÜŅÜéÉÜė PQL RPPP aÉîïėĮŅïZ a éÜïâęÖ áęė ïâÜ äÖÜčïä< ŅĮïäęč ęá âņéĮč ïėĮčîįĮïäęčĮį äčäïäĮïäęč îäïÜî HâtisI äč āÜčęéäŅ dna îÜíņÜčŅÜî âĮî ÉÜÜč îņāāÜîïÜÖN tâÜ äééÜÖäĮïÜ îÜíņÜčŅÜ ŅęčïÜôï ĮėęņčÖ îïĮėï ŅęÖęčî îâęō Įč ņčÜóÜč ÖäîïėäÉņïäęč ęá čņŅįÜęïäÖÜî Įï Į îëÜŅä< Ņ ëęîäïäęč ėÜįĮïäóÜ ïę ïâÜ îïĮėï ŅęÖęčN tâÜėÜáęėÜ ōÜ ņîÜÖ Į čÜņėĮį čÜïōęėå ĮëëėęĮŅâ ïę äÖÜčïäáö ïėĮčîįĮïäęčĮį äčäïäĮïäęč îäïÜî ōäïâ ïâäî îÜíņÜčŅÜ ŅęčïÜôï HčņŅįÜęïäÖÜ ëęîäïäęčî MRP ïę KQSI Įî ōÜįį Įî ōäïâ ïâÜ ëėÜÖäŅïäęč ęá ŅęÖäčā ėÜāäęčî áęįįęōäčā ïâÜ îïĮėï ŅęÖęčîN wäïâ ïâÜ äééÜÖäĮïÜ îÜíņÜčŅÜ ŅęčïÜôï Įî ïâÜ ęčįö äčáęėéĮïäęč ōÜ āÜï Į ŅęėėÜŅï ëėÜÖäŅïäęč ęá ĮÉęņï WY EN tę äčŅėÜĮîÜ ïâÜ ĮŅŅņėĮŅö ęá ïâÜ éÜïâęÖ ōÜ îëįäï ïâÜ îÜíņÜčŅÜMëĮïïÜėč äčïę îÜóÜėĮį îéĮįįÜė îņÉëĮïïÜėčîN uîäčā ïâäî ëĮïïÜėč Įî ïâÜ …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TarBase: A comprehensive database of experimentally supported animal microRNA targets",
            "Publication year": 2006,
            "Publication url": "https://rnajournal.cshlp.org/content/12/2/192.short",
            "Abstract": "MicroRNAs (miRNAs) are ~22-nt RNA segments that are involved in the regulation of protein expression primarily by binding to one or more target sites on an mRNA transcript and inhibiting translation. MicroRNAs are likely to factor into multiple developmental pathways, multiple mechanisms of gene regulation, and underlie an array of inherited disease processes and phenotypic determinants. Several computational programs exist to predict miRNA targets in mammals, fruit flies, worms, and plants. However, to date, there is no systematic collection and description of miRNA targets with experimental support. We describe a database, TarBase, which houses a manually curated collection of experimentally tested miRNA targets, in human/mouse, fruit fly, worm, and zebrafish, distinguishing between those that tested positive and those that tested negative. Each positive target site is described by the miRNA that binds it …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Cold Spring Harbor Lab"
        },
        {
            "Title": "Genomic and epigenetic alterations deregulate microRNA expression in human epithelial ovarian cancer",
            "Publication year": 2008,
            "Publication url": "https://www.pnas.org/content/105/19/7004.short",
            "Abstract": "MicroRNAs (miRNAs) are an abundant class of small noncoding RNAs that function as negative gene regulators. miRNA deregulation is involved in the initiation and progression of human cancer; however, the underlying mechanism and its contributions to genome-wide transcriptional changes in cancer are still largely unknown. We studied miRNA deregulation in human epithelial ovarian cancer by integrative genomic approach, including miRNA microarray (n = 106), array-based comparative genomic hybridization (n = 109), cDNA microarray (n = 76), and tissue array (n = 504). miRNA expression is markedly down-regulated in malignant transformation and tumor progression. Genomic copy number loss and epigenetic silencing, respectively, may account for the down-regulation of ≈15% and at least ≈36% of miRNAs in advanced ovarian tumors and miRNA down-regulation contributes to a genome-wide …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "National Academy of Sciences"
        },
        {
            "Title": "Use of mutagenesis, genetic mapping and next generation transcriptomics to investigate insecticide resistance mechanisms",
            "Publication year": 2012,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0040296",
            "Abstract": "Insecticide resistance is a worldwide problem with major impact on agriculture and human health. Understanding the underlying molecular mechanisms is crucial for the management of the phenomenon; however, this information often comes late with respect to the implementation of efficient counter-measures, particularly in the case of metabolism-based resistance mechanisms. We employed a genome-wide insertional mutagenesis screen to Drosophila melanogaster, using a Minos-based construct, and retrieved a line (MiT[w−]3R2) resistant to the neonicotinoid insecticide Imidacloprid. Biochemical and bioassay data indicated that resistance was due to increased P450 detoxification. Deep sequencing transcriptomic analysis revealed substantial over- and under-representation of 357 transcripts in the resistant line, including statistically significant changes in mixed function oxidases, peptidases and cuticular proteins. Three P450 genes (Cyp4p2, Cyp6a2 and Cyp6g1) located on the 2R chromosome, are highly up-regulated in mutant flies compared to susceptible Drosophila. One of them (Cyp6g1) has been already described as a major factor for Imidacloprid resistance, which validated the approach. Elevated expression of the Cyp4p2 was not previously documented in Drosophila lines resistant to neonicotinoids. In silico analysis using the Drosophila reference genome failed to detect transcription binding factors or microRNAs associated with the over-expressed Cyp genes. The resistant line did not contain a Minos insertion in its chromosomes, suggesting a hit-and-run event, i.e. an insertion of the transposable element, followed by an …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:isC4tDSrTZIC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "microTSS: accurate microRNA transcription start site identification reveals a significant number of divergent pri-miRNAs",
            "Publication year": 2014,
            "Publication url": "https://www.nature.com/articles/ncomms6700",
            "Abstract": "A large fraction of microRNAs (miRNAs) are derived from intergenic non-coding loci and the identification of their promoters remains ‘elusive’. Here, we present microTSS, a machine-learning algorithm that provides highly accurate, single-nucleotide resolution predictions for intergenic miRNA transcription start sites (TSSs). MicroTSS integrates high-resolution RNA-sequencing data with active transcription marks derived from chromatin immunoprecipitation and DNase-sequencing to enable the characterization of tissue-specific promoters. MicroTSS is validated with a specifically designed Drosha-null/conditional-null mouse model, generated using the conditional by inversion (COIN) methodology. Analyses of global run-on sequencing data revealed numerous pri-miRNAs in human and mouse either originating from divergent transcription at promoters of active genes or partially overlapping with annotated long …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Isoform specific gene auto-regulation via miRNAs: a case study on miR-128b and ARPP-21",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00214-009-0647-4",
            "Abstract": "In this study, we investigate whether miRNAs located within “host” protein-coding genes may regulate the expression of their host genes. We find that 43 of 174 miRNAs encoded within RefSeq genes are predicted to target their host genes. Statistical analysis of this phenomenon suggests that gene auto-regulation via miRNAs may be under positive selective pressure. Our analysis also indicates that several of the 43 miRNAs have a much lower expectation of targeting their host genes by chance than others. Among these examples, we identify miR-128b:ARPP-21 (cyclic AMP-regulated phosphoprotein, 21 kD) as a case in which both the miRNA and the target site are also evolutionarily conserved. We provide experimental support for this miRNA:target interaction via reporter silencing assays, and present evidence that this isoform-specific gene auto-regulation has been preserved in vertebrate species in …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Computational Challenges and-omics Approaches for the Identification of microRNAs and Targets",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128044025000030",
            "Abstract": "From very early on, computational methods have been deemed as key players in microRNA (miRNA) research. Currently, there are numerous implemented approaches that can be used to support miRNA-related studies by identifying their coding and noncoding targets, their expression, their regulators, as well as by inferring their underlying regulatory networks. This chapter aims to provide an overview of the available state-of-the-art tools, web servers, and databases utilized in miRNA research. The selected tools cover an extensive scope ranging from miRNA annotation, promoter identification, and transcription to the identification of miRNA-controlled pathways. Significant attention has been paid to present and explain standard and novel -omics approaches that can be used to support, complement, or even substitute their in silico counterparts. Importantly, current open challenges, limitations, and good …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Artemis-Georgia Hatzigeorgiou",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.461.6618&rep=rep1&type=pdf",
            "Abstract": "Artemis-Georgia Hatzigeorgiou Page 1 Artemis-Georgia Hatzigeorgiou, Ph.D. Page 1 Revised \n6/02 Artemis-Georgia Hatzigeorgiou Sarandaporou 77b Kifisia Attiki 14563 E. mail: \nArtemis@fleming.gr Education 1993 MSE in Computer Science, University of Stuttgart, Germany. \n2001 PhD in Molecular Biology, University of Jena, Germany. Positions held Research and \nFellowship Appointments 1992 Research Assistant, Institute of Process Automation, Frauenhofer \nGesellschaft, Stuttgart, Germany. 1993-96 Research Associate, German Cancer Research \nCenter, Heidelberg, Germany. 1996 Fellowship, Gene prediction in Bacteria, Los Alamos \nNational Laboratory, New Mexico. Faculty Appointments 2001- 2007 Assistant Professor, \nDepartment of Genetics School of Medicine, University of Pennsylvania. 2001-2007 Assistant \nProfessor, Department of Computer and Information Science, University of Pennsylvania (). 2007- …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Publishing life science data as linked open data: the case study of miRBase",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2422604.2422615",
            "Abstract": "This paper presents our Linked Open Data (LOD) infrastructures for genomic and experimental data related to microRNA biomolecules. Legacy data from two well-known microRNA databases with experimental data and observations, as well as change and version information about microRNA entities, are fused and exported as LOD. Our LOD server assists biologists to explore biological entities and their evolution, and provides a SPARQL endpoint for applications and services to query historical miRNA data and track changes, their causes and effects.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Erratum to: The whole genome sequence of the Mediterranean fruit fly, Ceratitis capitata (Wiedemann), reveals insights into the biology and adaptive evolution of a highly invasive pest species",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s13059-017-1155-9",
            "Abstract": "Funding Support of this project was provided by the US Department of Agriculture (USDA), Agricultural Research Service (ARS), Animal and Plant Health Inspection Service (APHIS), and National Institute of Food and Agriculture (NIFA)-Biotechnology Risk Assessment Grants Program (grant# 2011-39211-30769 to AMH) for funding the initial phase of this project, and to the National Institutes of Health (NIH)-National Human Genome Research Institute (NHGRI) for funding the medfly genome sequencing, assembly and Maker 2.0 automated annotation as part of the i5K 30 genome pilot project (grant# U54 HG003273 to RAG). The NIH Intramural Research Program, National Library of Medicine funded the NCBI Gnomon annotation and the USDA-National Agricultural Library (NAL) provided support for the WebApollo curation website, with support for manual curation training (to MM-T) provided by NIGMS (grant …",
            "Abstract entirety": 0,
            "Author pub id": "iGhiEpEAAAAJ:tOudhMTPpwUC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "FreePub: Collecting and Organizing Scienti* c Material Using Mindmaps",
            "Publication year": 2010,
            "Publication url": "https://www.nature.com/articles/npre.2010.5432.1",
            "Abstract": "This paper presents a creativity support tool, called FreePub, to collect and organize scientifi* c material using mindmaps. Mindmaps are visual, graph-based representations of concepts, ideas, notes, tasks, etc. They generally take a hierarchical or tree branch format, with ideas branching into their subsections. FreePub supports creativity cycles. A user starts such a cycle by setting up her domain of interest using mindmaps. Then, she can browse mindmaps and launch search tasks to gather relevant publications from several data sources. FreePub, besides publications, identifies helpful supporting material (eg, blog posts, presentations). All retrieved information from FreePub can be imported and organized in mindmaps. FreePub has been fully implemented on top of FreeMind, a popular open-source, mindmapping tool.",
            "Abstract entirety": 1,
            "Author pub id": "iGhiEpEAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Nature Publishing Group"
        }
    ]
}]