[{
    "name": "Αγγελος Ρουσκας",
    "romanize name": "Angelos Rouskas",
    "School-Department": "Ψηφιακών Συστημάτων",
    "University": "unipi",
    "Rank": "Καθηγητής",
    "Apella_id": 2069,
    "Scholar name": "Angelos Rouskas",
    "Scholar id": "nmpzcwUAAAAJ",
    "Affiliation": "University of Piraeus",
    "Citedby": 1064,
    "Interests": [
        "Mobile communication networks"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=nmpzcwUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Performance evaluation of public key-based authentication in future mobile communication systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1155/S1687147204403016",
            "Abstract": "While mobile hosts are evolving into full-IP enabled devices, there is a greater demand to provide a more flexible, reconfigurable, and scalable security mechanism in mobile communication systems beyond 3G (B3G). Work has already begun on such an \"all-IP\" end-to-end solution, commonly referred to as 4G systems. Fully fledged integration between heterogeneous networks, such as 2.5G, UMTS, WLAN, Bluetooth, and the Internet, demands fully compatible, time-tested, and reliable mechanisms to depend on. SSL protocol has proved its effectiveness in the wired Internet and it will probably be the most promising candidate for future wireless environments. In this paper, we discuss existing problems related to authentication and key agreement (AKA) procedures, such as compromised authentication vectors attacks, as they appear in current 2/2.5G/3G mobile communication systems, and propose how SSL …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:9yKSN-GCB0IC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "A PKI approach for deploying modern secure distributed e-learning and m-learning environments",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504001745",
            "Abstract": "While public key cryptography is continuously evolving and its installed base is growing significantly, recent research works examine its potential use in e-learning or m-learning environments. Public key infrastructure (PKI) and attribute certificates (ACs) can provide the appropriate framework to effectively support authentication and authorization services, offering mutual trust to both learners and service providers. Considering PKI requirements for online distance learning networks, this paper discusses the potential application of ACs in a proposed trust model. Typical e-learning trust interactions between e-learners and providers are presented, demonstrating that robust security mechanisms and effective trust control can be obtained and implemented. The application of ACs to support m-learning is also presented and evaluated through an experimental test-bed setup, using the general packet radio service …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Selection of Service Nodes in Edge Computing Environments",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9340201/",
            "Abstract": "Traditional centralized mobile cloud computing is encountering severe challenges, due to the ever-increasing growth of portable smart devices, which host numerous resource-hungry applications generating exponentially growing data traffic volumes. Edge computing technology promises an increased quality of service with low communication delays by bringing the cloud closer to the end-users, at the network edge. The approach of placing server capabilities at access nodes, yielding edge service nodes, seems to be a feasible solution. In this way, proximity to service is achieved and guaranteed QoS is provided. However, keeping operational edge service nodes at every access node is energy consuming and yields increased operational expenses to the application provider when the requests for services are at low levels. In this paper, we propose algorithms to select the most appropriate access nodes to host …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introducing PKI to enhance security in future mobile networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35691-4_10",
            "Abstract": "Current wireless network standards perform user authentication, signaling and data encryption, as well as message integrity protection, by utilizing only symmetric key methods. However, as mobile networks are evolving into full-IP and the communication is envisaged to change from second generation (2G) person-to-person model to fourth generation (4G) machine-to-machine model, there is greater demand to provide more flexible, reconfigurahle and scalable security mechanisms that can advance in a many-to-many trust relationship model. Employing public key methods in many-to-many schemes drops the requirement for a secure channel to transfer keys between two communication parties, thus providing the appropriate scalability to the whole system. With a large number of different network technologies and operators, expected in the future mobile communications environment, that should …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "NGL02-6: Game Theoretical Formulation of Admission Control and Pricing in Wireless Networks: The Case of Cooperating Providers",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4150884/",
            "Abstract": "As the number of wireless network providers is constantly growing, the competition among them is about to increase as well. In future environments, where many wireless providers will be present as is the case of hotspot areas, it is realistic to assume that the subscription will be session-oriented, meaning that the users may start one session in one provider and another session in a different provider. As the QoS of the demanding applications will still have to be preserved, more sophisticated schemes have to be employed in the admission control process so that providers will maintain their market share. Extending our previous work, we consider the existence of a visiting provider in the area, that can accept sessions from the home provider, to absorb overflow traffic due to instant lack of resources. The situation is modeled through game theory and its solution generates an admission control scheme that can improve …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cross layer scheduling framework for supporting bursty data applications in wcdma networks",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-007-9354-4",
            "Abstract": "In future wireless networks multimedia applications are expected to finally dominate the overall traffic volume. Shared channels are more suitable for the transmission of this type of traffic, as they are able to periodically adjust their transmission rate. In this paper, we introduce a cross-layer framework for WCDMA based networks which aims to make the packet scheduling procedure more efficient. In addition to that, we further propose a traffic scheduling scheme which serves the connections not only according to their delay sensitivity, but also according to the predicted state of their wireless channel. The efficiency of the proposed scheme, in terms of average packet delay and channel utilization is verified via simulations.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:mB3voiENLucC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A game theoretical formulation of integrated admission control and pricing in wireless networks",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221707006832",
            "Abstract": "We consider a competitive environment with several wireless network providers offering high data rate services and assume that users activate ephemeral session subscriptions with these providers. In the cases of overcharging or substantial service degradation by the serving networks, the users have the possibility to withdraw their request or terminate earlier their session subscription, respectively. In this context, network providers should attempt to optimize a more general utility function that incorporates technical, as well as other subjective parameters like money revenue, reputation, and user satisfaction. Considering such parameters, we formulate the problem of session establishment as an extensive form game between the different parties involved namely the provider, its current users, and the potential customer. The solution of this game produces an integrated pricing and admission control policy that …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:_FxGoFyzp5QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Energy-aware management of virtual machines in cloud data centers",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2797143.2797153",
            "Abstract": "The demand for more resources in computational power, memory and disk storage by modern applications and enterprises, results in the consumption of huge amounts of electrical power at cloud data centers. Consequently, cloud service providers, should not only attempt to provide competitive services to their customers, but also keep at the same time their operational costs at acceptable levels by minimizing energy consumption. The reduction of the number of active servers, using live virtual machine (VM) migrations, while keeping the system performance within the levels specified by the SLAs with customers, are main objectives of cloud service providers towards the above goals. In this paper, an efficient VM provisioning mechanism for cloud data center environments is proposed. We first describe our proposed VM allocation policy and then perform a series of simulation experiments based on CloudSim [1 …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Radio resource management for handoff provisioning in WCDMA systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394586/",
            "Abstract": "In this paper we propose an effective combination of a call admission control (CAC) mechanism together with a traffic scheduling algorithm. These two schemes are designed for WCDMA systems and operate in a complementary fashion in order to support handoff provisioning. The CAC mechanism belongs to the well known family of guard channel schemes and reserves some code capacity to favor the continuation of handover (HO) calls over the new calls. During the handoff procedure the HO calls experience high delays as a number of packets have to be forwarded through the wireline infrastructure to the target cell. Thus, we employ a delay driven traffic scheduler (DDS) which aims to prioritize calls which experience high delays such as HO calls. Furthermore, DDS is able to exploit information from the physical layer in order to avoid erroneous packets transmissions and increases system performance. The …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On Intelligent Base Station Activation for Next Generation Wireless Networks",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050915024436",
            "Abstract": "The evolution of mobile communications, during the last decades, has led to a rapid increase in the number of users that mobile operators have to serve. To cope with this increase, mobile operators increment the number of base stations they are using resulting in an escalation of the corresponding energy footprint. This is why; the reduction of the total energy that is consumed from base stations has been the epicentre of many researchers. To achieve that, a common approach is to minimize the number of base stations that are used by activating only the necessary base stations without affecting the corresponding quality of service. In this paper, we present a method for predicting crowded areas based on machine learning techniques. The dataset used contains information about the number of users that have been connected to twenty base stations during the time period of 8 days. Prediction results can be used in …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:GnPB-g6toBAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Enabling the provision of secure web based m‐health services utilizing XML based security models",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.46",
            "Abstract": "It has been generally agreed that the security of electronic patient records and generally e‐health applications must meet or exceed the standard security that should be applied to paper medical records, yet the absence of clarity on the proper goals of protection has led to confusion. The primary purpose of this study was to investigate appropriate security mechanisms, which will help clinical professionals and patients discharge their ethical and legal responsibilities by selecting suitable systems and operating them safely and in short order. Thus, in this paper we propose a security model based on XML with the intention of developing a fast security policy mostly intended for mobile healthcare information systems. The proposed schema consists of a set of principles based on XML security models through the use of partial encryption, signature and integrity services and it was implemented by means of a web …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:3fE2CSJIrl8C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The IEEE 802.11 g standard for high data rate WLANs",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1453395/",
            "Abstract": "Continuous WLAN public acceptance comes with increasing demand for provision of higher data rates. Building on this context, the IEEE published the IEEE 802.11g standard for providing data rates of up to 54 Mb/s at the 2.4 GHz band. This article presents the new features of IEEE 802.11g and, using an open source C++-based simulation tool, evaluates both the performance and effectiveness of these features compared to the older IEEE 802.11 standard versions.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy optimization schemes in heterogeneous wireless mobile networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7033269/",
            "Abstract": "Reducing energy consumption in wireless communications has attracted increasing attention recently, as power costs have become a significant component in mobile network operators OPEX. In this work, we consider a heterogeneous mobile networks topology with coexisting macrocellular and microcellular Base Stations (BSs) and propose two algorithms to optimally determine the operational mode of BSs under various traffic load conditions and achieve overall energy consumption minimization for efficient mobile network operation. Different traffic loads are investigated via simulation campaigns and our proposed optimization schemes yield quite satisfactory energy saving gains compared to Full Operational Topology (FOT) networks in all scenarios of interest examined.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Formulation of optimization problems for access selection in next generation wireless networks",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1385289.1385314",
            "Abstract": "Wireless Networks are rapidly evolving, constantly increasing both in coverage and offered bandwidth, while the vision for Next Generation Wireless Networks (NGWNs) encompasses a unified core network incorporating various Radio Access Technologies (RATs) in a unified and seamless manner. In such an environment providers would like to maximize their users' satisfaction, while at the same time avoid overloading their subsystems. In this paper we identify several aspects of access selection and resource allocation in NGWNs and provide different variations of optimization problems that seem to present significant interest in this context. All problem formulations seem to be NP-Hard, and our ongoing research focuses on designing approximation techniques for solving them.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of certificate based authentication in integrated emerging 3G and Wi-Fi networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25980-0_23",
            "Abstract": "Certificate based authentication of parties provides a powerful means for verifying claimed identities, avoiding the necessity of distributing shared secrets beforehand. Whereas Wi-Fi networks present security deficiencies, they manage to highly penetrate into the wireless market in a great degree due to their low cost, easy administration, great capacity, IP-oriented nature, etc. Considering Wi-Fi networking settings, administrated by different operators, as parts of a common core 3G infrastructure, the paper proposes and evaluates the potential application of enhanced TLS-based authentication mechanisms in integrated emerging-3G and Wi-Fi networks. We propose to use EAP-TLS protocol seconded by Public Key Infrastructure entities, to provide users with robust authentication mechanisms in hybrid WLAN-3G heterogeneous environment. Our alternative solution is discussed against EAP-AKA procedures …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A delay optimal scheduling policy for real time services in WCDMA systems",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11277-010-0031-7.pdf",
            "Abstract": "Enhanced Uplink operation of WCDMA-UMTS systems utilizes fast Node B scheduling and a short Transmission Time Interval (TTI) of 2 ms. The scheduling decisions are based on Scheduling Information (SI) sent from each User Equipment (UE) to the Node B. The weakness of the existing scheduling framework is that the SI does not include information regarding the delay sensitivity of each traffic flow, as well as the actual delay that the buffered data have experienced, especially for real-time services. In this paper, we propose the inclusion of such information in SI by introducing modifications into the respective 3GPP specifications. Thus, we propose a Delay Aware Channel Prioritization (DACP) criterion optimized for real-time services. Furthermore, we propose a DACP-based packet Scheduler (DACP-S) which is able to dynamically manage the Enhanced Dedicated Channel’s (E-DCH) transmissions …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Using SSL/TLS in authentication and key agreement procedures of future mobile networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045713/",
            "Abstract": "Existing security schemes in 2G and 3G systems are inadequate, as there is a greater demand to provide a more flexible, reconfigurable and scalable security mechanism that can advance as fast as mobile hosts are evolving into full-IP enabled devices. Work has already begun on such an \"all-IP\" end-to-end solution, commonly referred to as 4G systems. Fully-fledged integration between mobile networks and the Internet demands fully compatible, time-tested and reliable mechanisms to depend on. SSL/TLS protocol has proved its effectiveness in wired Internet and it will probably be the most promising candidate for future wireless environments. We discuss existing problems related to authentication and key agreement procedures (AKA), such as compromised authentication vectors attacks, as they appear in 2G and 3G systems, and propose how SSL/TLS can be used to overcome these inefficiencies. Further on …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Activities Report",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=636685559243656370&hl=en&oi=scholarr",
            "Abstract": "Technologies of Information and Communication Systems cause a world-wide revolution which is as much important (if not more important) and extended as the industrial and other technological revolutions made in the past. Even if new technologies invade in all the sectors of the human activity, this new revolution is still in its infancy and the technologies developed in our days are far from being mature. New trends and visions arise, making the scientific sector of Information and Communication Systems the most dynamic and fast changing sector of modern science and technology.According to our view and interests, new trends comprise the development of intelligent systems that perform their functions with security and reliability, cooperating among themselves, being embedded in devices and infrastructures without making their existence perceivable, servicing people needs and further support and empowering …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient selection of OVSF codes for the downlink DCH in WCDMA",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1390615/",
            "Abstract": "We examine the problem of unmovable dedicated channels (DCH) at the forward link in 3G mobile communications systems employing WCDMA. An unmovable DCH is defined as one which cannot be reallocated to another OVSF (orthogonal variable spreading factor) code because it is related to some service with very strict delay requirements. The relatively high total signaling delay for a single OVSF code reassignment makes the reallocation of such channels impractical. Therefore, a reassignment procedure that involves unmovable DCH channels cannot be performed. This is a very significant problem, since the complete elimination of code blocking is accomplished only if a code reassignment procedure can always be performed. We introduce a code selection scheme, named selective fewer codes blocked (S-FCB), which takes into account the different delay requirements of incoming calls during the …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A guard code scheme for handover traffic management in WCDMA systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10776-008-0076-7",
            "Abstract": "A key performance indicator of mobile wireless networks is failure probability of handover calls. In this paper, we propose a Call Admission Control policy which prioritizes handover calls over new calls in WCDMA systems. The OVSF code occupancy of the system is modeled by a Markov chain and the differentiation between handover and new calls is performed at the code level by introducing a “guard code” scheme. The scheme belongs to the well-known family of guard channel schemes and reserves some code capacity to favor the continuation of handover calls over the new calls. As the management of the general case is intractable, we solve certain numerical instances of the problem and manage to calculate several performance metrics like new call blocking and handover failure probabilities and code utilization. We complete our study with simulation results in the case of higher OVSF code tree …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Admission control and pricing in competitive wireless networks based on non-cooperative game theory",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1683465/",
            "Abstract": "The number of wireless network providers offering high data rate services in hot-spot areas as well as the competition among them will continue to grow in the near future. The users on the other hand will probably alter their behaviour towards the networks by making short-term commitments through ephemeral session-based subscriptions and requiring increased quality for the service they receive. In this upcoming environment, providers have to take into account in their admission control policies not only technical but also other parameters, like money revenue, reputation, and user satisfaction. We model the procedure of temporal session establishment as an extensive form game between the different parties involved, namely the provider, its current users, and the potential customer. The solution of this game produces an integrated pricing and admission control policy that achieves the network provider's optimum …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Scheduling algorithm with dynamic priority assignment for WCDMA systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4585386/",
            "Abstract": "In third generation WCDMA systems, shared channels allow many users to jointly utilize a single orthogonal variable spreading factor (OVSF) code. In this paper, we propose a scheduling algorithm with dynamic priority assignment (DPA) which is designed for the downlink-shared channel (DSCH) of 3G WCDMA systems and operates within a cross layer framework. The DPA scheduler has low computational complexity and is able to provide QoS differentiation among traffic flows based on their delay sensitivity. Through the cross layer framework, DPA takes into account the variations of the wireless channel, and exploits processing gain to improve transmission quality and enable service provisioning when possible. Additionally, by providing a guaranteed rate per traffic flow at each scheduling period, DPA can offer a deterministic delay bound to each connection when transmissions are reliable. Stochastic delay …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint access and backhaul power consumption optimization in heterogeneous mobile broadband networks",
            "Publication year": 2016,
            "Publication url": "https://www.riverpublishers.com/journal_read_html_article.php?j=JGE/6/4/1",
            "Abstract": "Capacity overprovisioning in mobile networks leads to underutilization of network resources and thus inefficient operation from a power consumption perspective. In addition, as operators constantly evolve their networks to denser heterogeneous layouts, with overlaying macrocellular base stations coexisting with numerous smaller cells, to cope with upcoming increase in peak mobile data traffic, the energy consumption of mobile networks will continue to grow in the next years. In this context, although backhaul connections can be responsible for tremendous power consumption, the corresponding study is usually neglected in most of the recent energy related literature. An approach for fast and low cost connectivity of dense microcellular sites is the deployment of wireless in-band backhaul links via existing macrocellular base stations. In this paper, we consider this wireless in-band backhaul approach, where access and backhaul links share the same frequency spectrum, and examine joint energy efficient resource optimization on both links. We introduce an iterative low-complexity polynomial backhaul-aware heuristic, which directs traffic to the most energy efficient network resources, and compare it against i) an exhaustive search method that provides optimum results, ii) a previously proposed reference algorithm, and iii) ordinary Full Operational Topology (FOT) network, where no energy aware technique is applied. From the results obtained, we conclude that our heuristic achieves high energy efficiency gains in all scenarios examined, while wireless in-band backhaul method proved a solid choice for this purpose.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:SeFeTyx0c_EC",
            "Publisher": "River Publishers"
        },
        {
            "Title": "Association of mobile stations in cellular networks with relay nodes",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7296402/",
            "Abstract": "Cooperative relaying is adopted as a possible candidate to address network coverage and capacity limitations in 4G cellular networks. In this paper we investigate the offline problem of associating mobile stations to telecommunication nodes in a cooperative relay network. We propose a heuristic algorithm to determine how mobile stations should associate to the base station or relay nodes so that overall resource consumption is minimized and compare it against two other conventional algorithms. Simulation results show that the proposed mobile association scheme outperforms the conventional schemes in a heterogeneous environment.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimized cloudlet management in edge computing environment",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8514942/",
            "Abstract": "As mobile applications are becoming computational intensive, edge computing supported by Cloudlets is a promising and ongoing solution to overcome the obstacles of mobile devices capabilities and remote Cloud access limitations. Bringing the Cloud, closer to mobile user, at the network's edge, is a plausible key solution to tackle high network latencies in a Wireless Metropolitan Area Network (WMAN). The inclusion of Cloud features at the access network can be accomplished by collocating an Access Point (AP) with a respective Cloudlet. However, this functionality induces a cost of additional energy consumption at the edge of the network, which may be an important issue for massive deployments not only for operational expenses, but also for environmental reasons. Thus, designing such an architecture should take into consideration not only technical requirements to support user Quality of Experience (QoE …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental analysis of an SSL-based AKA mechanism in 3G-and-beyond wireless networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:WIRE.0000047068.20203.57",
            "Abstract": "The SSL/TLS protocol is a de-facto standard that has proved its effectiveness in the wired Internet and it will probably be the most promising candidate for future heterogeneous wireless environments. In this paper, we propose potential solutions that this protocol can offer to future “all-IP” heterogeneous mobile networks with particular emphasis on the user's side. Our approach takes into consideration the necessary underlying public key infrastructure (PKI) to be incorporated in future 3G core network versions and is under investigation by 3GPP. We focus on the standard 3G+ authentication and key agreement (AKA), as well as the recently standardized extensible authentication protocol (EAP)-AKA procedures and claim that SSL-based AKA mechanisms can provide for an alternative, more robust, flexible and scalable security framework. In this 3G+ environment, we perceive authentication as a service …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Mobile networks planning for minimum power consumption",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6686482/",
            "Abstract": "Energy consumption minimization of mobile networks is a growing concern for the research community in recent years. As networks are most of the time underutilized due to spatial and temporal traffic fluctuations, we propose an algorithm to optimally determine the operational mode of Base Stations (BS) under certain traffic load conditions to achieve overall energy efficient mobile network operation. The proposed algorithm and simulation environment are both implemented in Matlab. Simulation results show that, under all traffic loads and topology scenarios examined, our proposed scheme outperforms a previously proposed algorithm, while the results are very close to optimum.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-efficient traffic bypassing in LTE HetNets with mobile relays",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7347978/",
            "Abstract": "One of the core technologies being standardized by 3GPP for LTE-A is the introduction of Relay Nodes (RNs). RNs are intended for ensuring coverage at cell edges as well as for the provision of enhanced capacity at hot spot areas. An extension to this concept is the Mobile Relay (MR). MRs can be mounted on vehicles and the original idea is to serve users inside high speed trains thus counter fighting the inherent severe fading and vehicle penetration loss. In this work we present a framework for exploiting Mobile Relay (MRs) even at low speeds in urban environments for bypassing traffic from nearby users, either within or outside the vehicles. In particular we show that apart from increased capacity and good quality coverage this approach achieves important energy savings for the mobile terminals.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PKI-based secure mobile access to electronic health services and data",
            "Publication year": 2005,
            "Publication url": "https://content.iospress.com/articles/technology-and-health-care/thc00388",
            "Abstract": "Recent research works examine the potential employment of public-key cryptography schemes in e-health environments. In such systems, where a Public Key Infrastructure (PKI) is established beforehand, Attribute Certificates (ACs) and public key enabled protocols like TLS, can provide the appropriate mechanisms to effectively support authentication, authorization and confidentiality services. In other words, mutual trust and secure communications between all the stakeholders, namely physicians, patients and e-health service providers, can be successfully established and maintained. Furthermore, as the recently introduced mobile devices with access to computer-based patient record systems are expanding, the need of physicians and nurses to interact increasingly with such systems arises. Considering public key infrastructure requirements for mobile online health networks, this paper discusses the potential …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Delivering attribute certificates over GPRS",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.968137",
            "Abstract": "Attribute Certificates (ACs) have been developed and standardized by the ANSI X9 committee as an alternative and better approach, to X. 509 public key certificates, for carrying authorization information. Attribute Authorities (AA) bind the characteristics of an entity (called attributes) to that entity by signing the appropriate AC. Therefore, ACs can be used for controlling access to system resources and employing role-based authorization and access controls policies accordingly. Although ACs are widely used and standardized, to the best of our knowledge, no mobile infrastructure or service currently utilizes them. In this paper, we first examine how basic Public Key Infrastructure (PKI) can be incorporated into mobile networks and especially the Universal Mobile Telecommunications System (UMTS). As a case study, we then experiment with ACs in the GPRS network, using a prototype implementation. In particular, we …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RBS Activation Schemes for Minimum Power Consumption in Mobile Networks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050914013969",
            "Abstract": "Power consumption costs is a significant component in mobile network operators OPEX and recent research is focusing on energy efficient design and operation of the radio access network to decrease the economic and environmental consequences of operating such a vast number of Radio Base Stations (RBSs). In this work, we formulate the problem of power consumption in mobile networks as an ILP and propose a heuristic to determine the optimal, with respect to power consumption, subset of available RBS that should be active in order to serve a certain load of UEs, without violating QoS requirements for each user served. We exploit the results of this formulation setup and propose RBS activation schemes for network operation with acceptable levels of outage probability for the users. The results indicate that our RBS activation scheme which takes into account RBS coverage overlap achieves significant …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "MPEG-21 digital items to support integration of heterogeneous multimedia content",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405004639",
            "Abstract": "The MELISA system is a distributed platform for multi-platform sports content broadcasting, providing end users with a wide range of real-time interactive services during the sport event, such as statistics, visual aids or enhancements, betting, and user- and context-specific advertisements. In this paper, we present the revamped design of the complete system and the implementation of a middleware entity utilizing concepts present in the emerging MPEG-21 framework. More specifically, all multimedia content is packaged in a self-contained “digital item”, containing both the binary information (video, graphics, etc.) required for the playback, as well as structured representations of the different entities that can handle this item and the actions they can perform on it. This module essentially stands between the different components of the integrated content preparation system, thereby not disrupting their original …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Scheduling with QoS provisioning in mobile broadband wireless systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5483503/",
            "Abstract": "We propose a Dynamic Hybrid Scheduler (DHS) for Mobile Broadband Wireless Systems composed by two basic components, corresponding to a guaranteed and a dynamic delay based rate allocation policy respectively. The proposed scheduler is balanced between these two scheduling disciplines and thus combines their merits in an effective manner. Furthermore, a delay bound is obtained for each service under the assumptions of (a) reliable channel conditions and (b) employment of the least power demanding coding and modulation scheme. DHS is applicable to various Mobile Broadband Wireless Systems such as HSPA, 1xEVDO and Mobile WiMAX and its performance is evaluated through event driven simulation and compared against another delay driven scheduler namely Feasible Earliest Due Date (FEDD) a variation of classic EDD modified for wireless systems.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Socially aware heterogeneous wireless networks",
            "Publication year": 2015,
            "Publication url": "https://www.mdpi.com/101968",
            "Abstract": "The development of smart cities has been the epicentre of many researchers’ efforts during the past decade. One of the key requirements for smart city networks is mobility and this is the reason stable, reliable and high-quality wireless communications are needed in order to connect people and devices. Most research efforts so far, have used different kinds of wireless and sensor networks, making interoperability rather difficult to accomplish in smart cities. One common solution proposed in the recent literature is the use of software defined networks (SDNs), in order to enhance interoperability among the various heterogeneous wireless networks. In addition, SDNs can take advantage of the data retrieved from available sensors and use them as part of the intelligent decision making process contacted during the resource allocation procedure. In this paper, we propose an architecture combining heterogeneous wireless networks with social networks using SDNs. Specifically, we exploit the information retrieved from location based social networks regarding users’ locations and we attempt to predict areas that will be crowded by using specially-designed machine learning techniques. By recognizing possible crowded areas, we can provide mobile operators with recommendations about areas requiring datacell activation or deactivation. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Energy efficient wireless in-band backhaul in heterogeneous networking environments",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7772138/",
            "Abstract": "Cost effective and efficient wireless BackHaul (BH) transmissions are key factors for energy efficient network architectures and strategies on upcoming dense Access Points (AP) 5G heterogeneous environments, where rapid data volume increase and energy consumption reduction are main variables to consider. Towards this direction, we consider a heterogeneous mobile network topology with coexisting macrocellular (macro) and microcellular (micro) Base Stations (BSs) and propose two energy optimization heuristics incorporating wireless in-band BH transmission framework as the core network data transport mean. We examine the overall impact of this BH approach on total mobile network's consumption and point out the significance of BH consideration on wireless networks energy optimization tactics. The simulation results obtained exhibit that the proposed heuristics applied to the wireless in-band BH …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Support of subscribers’ certificates in a hybrid WLAN-3G environment",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128605002653",
            "Abstract": "Third Generation Partnership Project (3GPP) has recently provided a cellular-WLAN interworking architecture as an add-on to 3GPP system specifications. This architecture can offer IP-based services, compatible with those obtainable by 3G packet switched domain, to a 3G subscriber who is connected via a WLAN. Following this approach, in this paper we propose extensions to current 3GPP specifications, implementing and experimenting with a hybrid WLAN-3G network architecture capable of supporting subscriber’s certificates. We focus on attribute certificates, which are of major importance for user authorization and, due to their temporary nature, entail minimum concern regarding revocation issues. We emphasise on the necessary public key infrastructure incorporation which requires minimum changes in 3G core network elements and signalling and provide a list of the potential threats, which can be …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Inter/intra core network security with PKI for 3G-and-beyond systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_2",
            "Abstract": "With a large number of different heterogeneous network technologies (e.g. UMTS, WLAN, HIPERLAN) and operators expected in the future mobile communications environment, that should frequently and seamlessly interwork with each other and a constantly increasing population of communication parties, capturing the full benefits of open channel key transfers and scaling public key methods requires Public Key Infrastructure (PKI). In this paper, we discuss and investigate different ways to take advantage of a proposed PKI system. Focusing on UMTS Release 6 IP multimedia subsystem, we analyze the ongoing 3GPP specifications and its limitations and examine how PKI can provide robust security solutions to both 3G-and-beyond inter/intra core network and the mobile user. Public key security mechanisms to protect operator’s core networks seem to gain ground and protocols like IPsec and SSL …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A dynamic traffic scheduling algorithm for the downlink shared channel in 3G WCDMA",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1313077/",
            "Abstract": "In third generation WCDMA systems, the major part of the overall traffic volume is expected to be inherently bursty. Shared channels are more suitable for the transmission of this type of traffic, as they allow many users to share a single orthogonal variable spreading factor (OVSF) code. In this paper, we propose a delay fair scheduling (DFS) to be used with the downlink-shared channel (DSCH). The proposed scheme is efficient and robust, providing QoS differentiation according to the delay sensitivity of each service, while it takes into account the constraints of the wireless OVSF-CDMA networks.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced dedicated channel scheduling optimization in WCDMA",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4623867/",
            "Abstract": "Enhanced Uplink operation of WCDMA-UMTS systems utilizes fast Node B scheduling and a short Transmission Time Interval (TTI) of 2ms. The scheduling decisions are based on scheduling information (SI) sent by each UE to the Node B. The main drawback of the current scheduling procedure is that the SI does not include any information regarding the delay sensitivity of each traffic flow, as well as the actual delay that the buffered data have experienced. In this paper, we propose the inclusion of such information in SI by introducing a modification of the respective 3GPP specifications. Furthermore, we propose a Dynamic Priority Scheduler (DPS), which can utilize this new information. The performance of the proposed scheme is evaluated by means of system level simulations.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of digital certificates acquisition in large-scale 802.11-3GPP hybrid environments",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541544/",
            "Abstract": "This paper evaluates the performance of a hybrid WLAN-3GPP network architecture for delivering subscribers' certificates. Two main categories of simulation scenarios are implemented and evaluated based on the underlying access network technology used; 802.11b and UMTS. Each of the scenarios is categorized further in numerous sub-cases. Results showed that AC acquisition when deployed in large scale between several heterogeneous networks is feasible within acceptable time limits",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Energy-efficient base station management in heterogeneous networking environments",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7405529/",
            "Abstract": "Reduction of energy consumption is becoming a crucial aspect of wireless communications, due to the need of lowering CO2 emissions and enhancing mobile network operators OPEX. In this work we consider a heterogeneous mobile network topology with coexisting macrocellular and microcellular Base Stations (BSs). By employing two energy optimization heuristics we determine operational profiles for the network BSs under various traffic loads and examine their impact on handoff signaling rate and achievable throughput. The obtained simulation results exhibit that the proposed BS operational profiles yield quite satisfactory energy saving gains compared to Full Operational Topology (FOT) networks in all examined scenarios, without degradation of the network's handoff signaling rate and achievable throughput of the mobile subscribers.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating Security Mechanisms in Different Protocol Layers for Bluetooth Connections",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-wireless-security/22076",
            "Abstract": "Security is always an important factor in wireless connections. As with all other existing radio technologies, the Bluetooth standard is often cited to suffer from various vulnerabilities and security inefficiencies while attempting to optimize the trade-off between performance and complementary services including security. On the other hand, security protocols like IP secure (IPsec) and secure shell (SSH) provide strong, flexible, low cost, and easy to implement solutions for exchanging data over insecure communication links. However, the employment of such robust security mechanisms in wireless realms enjoins additional research efforts due to several limitations of the radio-based connections, for example, link bandwidth and unreliability. This chapter will evaluate several Bluetooth personal area network (PAN) parameters, including absolute transfer times, link capacity, throughput, and goodput. Experiments shall …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:-f6ydRqryjwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Reducing CQI Signalling Overhead in HSPA.",
            "Publication year": 2008,
            "Publication url": "https://downloads.hindawi.com/journals/rlc/2008/982805.pdf",
            "Abstract": "High-speed packet access (HSPA) aims to advance the performance of the existing UMTS networks by improving the level of quality of service (QoS) and increasing the supported peak data rates at both the forward and the reverse link. HSPA consists of the HSDPA and high-speed uplink packet access (HSUPA) standards.AMC procedure of HSDPA makes possible the adaptation of the employed transport format and resource combination (TFRC) to the wireless channel variations as well as to the varying rate requirements of the UE. However, as the rate of the wireless channel variation increases, more frequent CQI reports by the UE to Node B are needed in order to have an efficient AMC. On the other hand, as the number of CQI reports increases, uplink interference also increases, thus reducing uplink reception quality. The authors of [1–3] propose a number of CQI schemes which aim to keep high the efficiency of AMC while at the same time reduce the required CQI information. In this paper, we propose a new CQI reporting scheme which reduces the required CQI signaling by exploiting a CQI prediction method based on an FSMC model of the wireless channel. The remainder of the paper is organized as follows: in Section 2, we describe the CQI reporting procedure as it is determined by 3GPP specifications and subsequently we",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Minimizing the call setup delay caused by reconfigurations of dedicated channels at the downlink of WCDMA",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4381372/",
            "Abstract": "Reconfigurations of downlink dedicated channels are often necessary during call setup to eliminate code blocking encountered in 3G WCDMA systems. These reconfigurations increase not only the signaling overhead, but also the setup delay of the incoming call and may yield prohibitive delays if performed inefficiently. In this paper, we introduce a reconfiguration scheme which manages to minimize this additional setup delay with a tolerable increase in signaling overhead.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "OVSF codes assignment and reassignment at the forward link of W-CDMA 3G systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1046575/",
            "Abstract": "We examine the problem of assigning and reassigning orthogonal variable spreading factor (OVSF) codes at the forward link in 3G mobile communications systems employing W-CDMA. Efficient channelization code management results in high code utilization and increased system capacity. We introduce a new code selection scheme, which, by means of a very simple measure, attempts to mitigate the problem of scattered codes that fragments the capacity of the OVSF code tree. The main advantage of this new scheme is its ability to combine effectively the merits of other previously proposed schemes (see Tseng, Y.-C. et al., Proc. IEEE GLOBECOM, vol.1, p.562-6,2001). Thus, our proposed scheme is as fast as the random or ordered strategies, while simulation results have shown that it is as efficient, in terms of capacity improvement, as the crowded-first scheme.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Management of channelization codes at the forward link of WCDMA",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1496580/",
            "Abstract": "We examine the orthogonal variable spreading factor (OVSF) code tree management problem at the forward link of 3G WCDMA systems. Considering single code operation, we evaluate the performance of a code selection scheme called recursive fewer codes blocked scheme (RFCB). RFCB manages to mitigate code blocking and thus minimizes the fragmentation of the OVSF code tree capacity. Simulation results demonstrate the efficiency of the RFCB scheme compared to previously proposed schemes.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cross-System Handover Execution in the context of an Event-based Distributed Virtual Testbed",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4299158/",
            "Abstract": "The paper discusses the constituent software modules of a Virtual Distributed Testbed (VDT) which enables cross-system operation and interworking among clusters simulating different Radio Access Technologies (RATs). The heart module of VDT is the Central Controller whose role is to manage and control the individual simulation clusters. The communication among the VDT modules is achieved by the exchange of SOAP messages that implement events. Motivated by cross-system vertical handovers, the paper presents how such a handover is feasible in terms of VDT and which events are necessary for its realization. Although the implementation discussed herein concerns UMTS, IEEE 802.11 and Composite Radio Network simulation clusters, the future incorporation of other RAT clusters is straightforward.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "D5. 5b: XIFI nodes operation, maintenance, assistance and procedures updates",
            "Publication year": 2013,
            "Publication url": "https://cordis.europa.eu/docs/projects/cnect/0/604590/080/deliverables/001-D55bXIFInodesoperationmaintenanceassistanceandprocedures.pdf",
            "Abstract": "This deliverable provides an overview of the different activities related to the running of the XIFI nodes (Consortium’s members and Associated partners), an update of the procedures that are used by XIFI and proposed to FI-Core project. It also describes support to FI-Developers.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Green optimization schemes for mobile network design and operation",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-017-4350-9",
            "Abstract": "Mobile telecommunication’s operation power cost occupies a large portion in network operators OPEX list. Recent research efforts on energy efficient design and optimization of the radio access network focus on applicable solutions that decrease the energy consumption of the vast number of radio base stations (BSs), mostly because of the economic and environmental consequences of their operation. In this work, we formulate the power consumption optimization problem in mobile networks and propose two energy efficient heuristic schemes to determine the optimal subset of available BSs that should be active in order to serve a certain load of UEs, without violating QoS requirements for each user served. We exploit the results of this formulation setup and further propose a BS activation scheme to produce proper BS activation profiles for continuous time operation in the same network deployment under …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Energy efficient base station placement and operation in mobile networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6582788/",
            "Abstract": "Optimal planning and management of resources for reducing operational costs of energy consumption and the equivalent environmental footprint in mobile communication networks have gathered increasing interest in the recent research literature. In this paper, we deal with the problem of base station placement and planning in a mobile network and propose a practical algorithm for achieving the above goal of energy consumption minimization. Usage cases of this algorithm are investigated via a simulation campaign, where the results are compared with the optimum solution derived by means of exhaustive search. Our evaluation depicts that the proposed approach exhibits a near-optimum performance under all scenarios of interest examined.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:bEWYMUwI8FkC",
            "Publisher": "VDE"
        },
        {
            "Title": "WPAN's Technologies for Pervasive e-Health Applications–State of the Art and Future Trends",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5196749414587535631&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Code reservation schemes at the forward link in WCDMA",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404000556",
            "Abstract": "We examine resource reservation schemes for the management of orthogonal variable spreading factor (OVSF) codes at the forward link of 3G mobile communications systems employing WCDMA. Like in every multi-service network, calls with different rate requirements will perceive very dissimilar system performance at the forward link in 3G systems if no measures are taken and the channelization code tree is treated as a common pool of resources. Assuming that the traffic level for each class is known in advance, we introduce complete sharing (CS), complete partitioning (CP) and hybrid partitioning (HP) policies to manage the code tree. At the resource reservation level, we develop an efficient method to partition the available codes based on the offered traffic load of each class of calls and the size of the tree. The resulting partition is optimal in the sense that the maximum blocking probability of the different rate …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Energy-efficient virtual machine provisioning mechanism in cloud computing environments",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801989",
            "Abstract": "As the increasing number of modern applications and enterprises demand more and more resources in computational power, memory and disk storage, cloud data centers are consuming huge amounts of electrical energy. The aim of cloud service providers is to reduce the operational costs by minimizing energy consumption while providing competitive services to their customers. The above, can be fulfilled by trying to reduce the number of active servers, using live VM migrations and keeping the system performance in the requested levels according to SLAs. In this paper, an efficient virtual machine allocation mechanism for cloud data center environments is proposed. We first describe the virtual machine allocation policy and then we perform a series of experiments based on CloudSim [1] 3.0. 3 simulator. Experimental results have shown that the proposed scheme is very efficient in terms of energy consumption …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RAT selection optimization in heterogeneous wireless networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30376-0_33",
            "Abstract": "While wireless access networks are rapidly evolving, constantly increasing both in coverage and offered bandwidth, the vision for Next Generation Wireless Networks (NGWNs) encompasses a core network incorporating various Radio Access Technologies (RATs) in a unified and seamless manner. In such an environment, providers with multi-RAT technologies will aim at the maximization of the satisfaction of their subscribers, while attempting to avoid overloading their subsystems. In this paper we deal with the network selection problem in a multi-RAT environment where users are equipped with multimode terminals. We introduce a utility-based optimization function and formulate the problem of allocating user terminals to RATs as an optimization problem under demand and capacity constraints. This problem is recognized as NP-hard and we propose an optimal Branch and Bound (BB) algorithm, as well …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Self-organizing virtual devices in the Internet of Things networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7785362/",
            "Abstract": "The Internet of Things (IoT) paradigm is expected to be a key communication platform between Real World Objects (RWO) and the virtual realm. This work identifies the main issues that are related to IoT realization, focusing on the networking technological heterogeneity between the connected objects, the (self-) management of their virtual representations along with the respective services, as well as enhancing context-awareness, allowing for greater autonomicity of applications and re-usability of devices and software components. This paper proposes a self-management framework for addressing these issues. The framework consists of three levels of functionality and each level comprises cognitive entities that provide the means for self-management (configuration, healing, optimization, organization) capabilities and learning, allowing for smart, flexible applications and objects. The presented framework enables …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Utility-based RAT selection optimization in heterogeneous wireless networks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1574119213000588",
            "Abstract": "Recent technological advances in wireless networks will enable the realization of an integrated heterogeneous wireless environment consisting of multiple Radio Access Technologies (RATs) within a network provider. One of the most important benefits is that this will allow providers to balance their traffic among their subsystems without compromising on QoS issues. In this paper we focus on the Network Selection problem to allocate terminals to the most appropriate RATs by jointly examining both users’ and providers’ preferences. We introduce three utility-based optimization functions based on the type of application that users request. We then formulate the terminal assignment problem as an optimization problem, which is recognized as NP-hard. We examine both offline and online selection and develop an optimal Branch and Bound (BB) algorithm, a Greedy heuristic, as well as three Strip Packing variations …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Ant colony self-healing schemes for survivable optical networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1630208/",
            "Abstract": "This paper deals with survivability issues in high-speed optical networks. The authors propose an ant colony-based mechanism as substitution in a phase of an algorithm, which employs an integrated self-healing technique. The benefits as well as the influence of the proposed modification in the design of the self-healing rings and the spare channel assignment are analytically examined over different integration levels. The derived results outline that the proposed ant colony-based modification provides a reduced amount of spare capacity at the same levels of integration, when applied in the integrated self-healing scheme",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated platform for providing ship management, tourist information and booking services",
            "Publication year": 2004,
            "Publication url": "http://195.130.87.21:8080/dspace/handle/123456789/609",
            "Abstract": "The growth of e-commerce brings to foreground innovative e-based services, which heavily affect the behaviour of sea travellers. The interested parties of the maritime market (ie, shipping companies, travel agencies, port authorities, etc.) have to take account of the new scheme and take appropriate actions in order to strengthen their presence in e market. In this context, the paper discusses an integrated telecommunication platform for providing ship management, tourist information and booking services for sea travellers. The presented platform has been developed in the framework of the EU funded project TELESHIPPING and validated during actual pilot tests.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:4JMBOYKVnBMC",
            "Publisher": "ENTER 2004: 11th International Conference on Information Technology in Travel & Tourism"
        },
        {
            "Title": "Handover provisioning in WCDMA systems",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/1385289.1385359",
            "Abstract": "In this paper, we propose a prioritization of handover (HO) calls over new calls in WCDMA systems employing orthogonal variable spreading factor (OVSF) codes as channelization codes. The code occupancy of the system is modeled by a Markov chain and the differentiation between HO and new call is performed at the code level by introducing a\" guard code\" scheme. The scheme belongs to the well known family of guard channel schemes and reserves some code capacity to favor the continuation of HO calls over the new calls. As the management of the general case is intractable, we solve certain numerical instances of the problem and manage to calculate several popular performance metrics like new call blocking and HO failure probabilities and code utilization.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A federated edge cloud-IoT architecture",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7561038/",
            "Abstract": "The provisioning of powerful decentralized services in the Internet of Things (IoT), as well as the integration of innovative IoT platforms, requires ubiquity, reliability, high-performance, efficiency, and scalability. Towards the accomplishment of the above requirements, the contemporary technological trends leaded to the IoT and Cloud convergence. This combination created the approach of federated Cloud-IoT architectures. The Cloud-IoT architectural vision is paving the way to the vital step, beyond the IoT cognitive capabilities, that refers to the IoT world leveraging cloud principles. For the success of the deployment of such innovative and high-performance solutions, the introduction and the exploitation of 5G technological principles will empower the way forward. Towards this direction, this paper presents a federated architecture combined by distributed Edge Cloud-IoT platforms, that enables the semantic-based …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assignment of multiple OVSF codes at the downlink in WCDMA",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1370912/",
            "Abstract": "We examine the problem of assigning multiple orthogonal variable spreading factor (OVSF) codes to serve calls at the downlink in WCDMA. In contrast to previously published approaches, we propose algorithms that fully exploit any additional hardware available at the user equipment. Depending on the requested rate and the number of available transceivers, our schemes support a call by as many OVSF codes as possible. Compared to previous multiple code assignment schemes, our approach significantly lowers code blocking. Different ways to calculate the most appropriate combination of codes result in different variations of our schemes. It turns out that if we attempt to minimize the highest rate among the codes used, instead of minimizing the excess bandwidth wasted, we get better results in terms of code blocking, and the number of reassignments to support the call.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editorial: Topics in wireless broadband systems",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.comnet.2007.02.004",
            "Abstract": "Guest Editorial: Topics in wireless broadband systems: Computer Networks: The International \nJournal of Computer and Telecommunications Networking: Vol 51, No 9 ACM Digital Library \nhome ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register \nAdvanced Search Journals Magazines Proceedings Books SIGs Conferences People More \nSearch ACM Digital Library SearchSearch Advanced Search Computer Networks: The \nInternational Journal of Computer and Telecommunications Networking Periodical Home Latest \nIssue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsComputer \nNetworks: The International Journal of Computer and Telecommunications NetworkingVol. , \nNo. Guest Editorial: Topics in wireless broadband systems article Guest Editorial: Topics in \nwireless broadband systems Share on Authors: George T Karetsos profile image George of :…",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Elsevier North-Holland, Inc."
        },
        {
            "Title": "Comparison of code reservation schemes at the forward link in WCDMA",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045720/",
            "Abstract": "We examine resource reservation schemes for the management of orthogonal variable spreading factor (OVSF) codes at the forward link of 3G mobile communications systems employing WCDMA. Like in every multiservice network, different rate calls in 3G systems will perceive dissimilar system performance if no measures are taken and the channelization code tree is treated as a common pool of resources. The paper introduces complete sharing, complete partitioning and hybrid partitioning strategies to manage the code tree, and studies the performance in terms of blocking probability per traffic rate class and utilization of codes. It turns out that fair access to codes by different rate calls and code utilization are conflicting goals, and that hybrid schemes can provide a compromise between these two extremes.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Delay sensitivity based assignment of OVSF codes for the downlink DCH in WCDMA",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_38",
            "Abstract": "A significant problem that deteriorates the performance of 3G W-CDMA systems is code blocking. The complete elimination of this phenomenon is accomplished only if a code reassignment procedure is employed. However, the relatively high total signaling delay for a single OVSF code reassignment combined with the strict delay requirements of some services makes the reassignment of some OVSF codes impractical. In other words, that a reassignment procedure cannot always be performed and therefore code blocking cannot be eliminated. In this paper, we introduce a new code selection scheme, named Delay Sensitivity Based Assignment (DSBA), which takes into account the different delay requirements of the incoming calls. The performance of the proposed scheme is evaluated through event driven simulation and the results show a significant decrease in code blocking probability, especially for …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Advanced SSL/TLS-based authentication for secure WLAN-3G interworking",
            "Publication year": 2004,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-com_20040835",
            "Abstract": "Motivated by the fact that the SSL protocol has proved its effectiveness in wired IP networks, recent research work has examined the potential use of this protocol in various wireless technologies. Although Wi-Fi networks present security deficiencies, they manage to penetrate the wireless market to a great degree due to their low cost, easy administration, great capacity, IP-oriented nature, etc. Considering Wi-Fi networking settings, administrated by different operators, as parts of a common core 3G infrastructure, the author propose the potential application of enhanced SSL-based authentication mechanisms in integrated emerging-3G and Wi-Fi networks. Existing problems related to authentication and key agreement (AKA) procedures and the extensible authentication protocol (EAP)-AKA, as they appear in the latest 3G and integrated 3G/Wi-Fi specifications, are discussed. It is proposed how EAP-TLS, combined …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Network selection in heterogeneous wireless environments",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5898929/",
            "Abstract": "The evolution of wireless access networks has led to the vision of an integrated heterogeneous wireless environment consisting of various Radio Access Technologies (RATs). In such an environment, users with multimode terminals can seamlessly change from one RAT to another RAT attempting to maximize their satisfaction level, while providers may carefully utilize without overloading their subsystems. In this paper, we focus on the Network Selection problem to allocate terminals to most appropriate RATs by jointly examining both users and providers' preferences. We introduce a utility-based optimization function and formulate the terminal assignment problem as an optimization problem which is recognized as NP-hard. We propose a Greedy heuristic which exploits a metric that measures the utility gained versus the capacity resource spent for each allocation and confirm its superior performance against three …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A modelling and simulation framework for compound medical applications in regional healthcare networks",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEH.2005.006689",
            "Abstract": "Regional healthcare information networks have already started to grow across Europe, in order to cover local healthcare provision needs, especially in isolated regions, where there is often no availability of central general hospitals. The paper discusses a modelling and simulation framework for the design of regional healthcare information networks running compound medical and QoS–sensitive applications. The proposed framework decomposes the compound medical applications into combinations of elementary traffic profiles, assesses appropriate values to the traffic parameters of the assigned models and defines suitable simulation scenarios. The simulation results are analysed and finally lead to reliable bandwidth estimations of the links of the healthcare information network under design. The proposed framework has been thoroughly validated through its application for the design of a healthcare network …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:hMod-77fHWUC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Design and operation of energy efficient heterogeneous mobile networks",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11276-015-1083-0",
            "Abstract": "During the last two decades we have witnessed a rapid growth in wireless communication services, which has dramatically increased the number of necessary radio access components to provide the adequate capacity and acceptable quality of service. The power cost for operating this huge number of radio Base Stations (BSs) is under serious consideration by the mobile communication industry and recent research efforts have focused on energy efficient design and optimization of the radio access network in order to alleviate the energy consumption and mobile network operators OPEX. In this work, we consider a deployment of heterogeneous BSs to serve a given geographical area and propose two energy-aware algorithms to optimally determine the operational mode of those BSs under various traffic load conditions. Performance evaluation results show that the proposed algorithms can provide near …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Improving a Set of Sequential Heuristics for the Channel Allocation Problem",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1009583520060",
            "Abstract": "We consider the minimum span channel allocation problem encountered in cellular systems. Our solution approach is based on a set of sequential heuristics, and incorporates concepts borrowed from graph coloring schemes. The performance of the new heuristics has been tested on known benchmark problems, whose optimal solutions have been recently quoted in the literature. The new heuristics are quite effective in terms of speed, as well as in terms of spans produced. The results obtained are near-optimal in almost all cases, and certainly comparable to those produced by slower optimization procedures, indicating that these new variations can be treated either as an efficient alternative to this type of problems or as a very good starting point to more complicated procedures.",
            "Abstract entirety": 1,
            "Author pub id": "nmpzcwUAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Kluwer Academic Publishers-Plenum Publishers"
        },
        {
            "Title": "The Wisconsin breast cancer problem: Diagnosis and TTR/DFS time prognosis using probabilistic and generalised regression information classifiers",
            "Publication year": 2006,
            "Publication url": "https://www.spandidos-publications.com/10.3892/or.15.4.975",
            "Abstract": "This study addresses the breast cancer diagnosis and prognosis problem by employing two neural network architectures with the Wisconsin diagnostic and prognostic breast cancer (WDBC/WPBC) datasets. A probabilistic approach is dedicated to solve the diagnosis problem, detecting malignancy among cases (instances) as derived from fine needle aspirate (FNA) tests, while the second architecture estimates the time interval that possibly contains the right endpoint of disease-free survival (DFS) of the patient. The accuracy of the neural classifiers reaches nearly 98% for the diagnosis and 93% for the prognosis problem, while the prognostic recurrence predictions were evaluated using survival analysis through the Kaplan-Meier approximation method. Both architectures were compared with other similar approaches. The robustness and real-time response of the proposed classifiers were further tested over the …",
            "Abstract entirety": 0,
            "Author pub id": "nmpzcwUAAAAJ:UebtZRa9Y70C",
            "Publisher": "Spandidos Publications"
        }
    ]
}]