[{
    "name": "Αγγελική Δημητρακοπούλου",
    "romanize name": "Angeliki Dimitrakopoulou",
    "School-Department": "Επιστημών Προσχολικής Αγωγής &  Εκπαιδευτικού Σχεδιασμού",
    "University": "aegean",
    "Rank": "Καθηγητής",
    "Apella_id": 4399,
    "Scholar name": "Angelique Dimitracopoulou",
    "Scholar id": "vjVYyXwAAAAJ",
    "Affiliation": "Professor, University of the Aegean, Greece",
    "Citedby": 2085,
    "Interests": [
        "ICTs in Education",
        "Educational Technology",
        "Education"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=vjVYyXwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Educational Activities via Internet for young children: How to promote meaningful learning",
            "Publication year": 2001,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/adimitr-Prelude-congress-1999-Internet_children.pdf",
            "Abstract": "Today we can register a growing interest in the Internet and especially in the World Wide Web. The Internet network links not only start to blur our conception of distance, they also create a new learning environment by bringing together a multinational community of learners and by providing for new social exchanges, so precious for children and teachers living in islands. With the Internet infrastructure computer supported learning sites can be set up connecting different learning communities. This is important. However, just connecting different knowledge generating communities doesn't guarantee learning or better a kind of knowledge negotiation resulting in understanding and new insights. The goal of this paper is to:• Categorise the current educational activities supported by Internet and analyse them. The term'Internet'only refers to the underlying technology. Actually, a large variety of tools are available for teaching or learning via Internet. Any reflection on the practices and on the effectiveness of learning experiences needs to discriminate which software tools are being used, and which pedagogical functions are fulfilled by these tools.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interpretation of computer based interaction analysis indicators: A significant issue for enhancing collaboration in technology based learning",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/interdisciplinary-perspectives-collaboration/41542",
            "Abstract": "DIAS is an Asynchronous Discussion Forum Platform, mainly developed in order to offer extended monitoring and interaction analysis support, by providing a wide range of indicators jointly used in various situations, to all discussion forae users (individual students, groups, moderators/teachers or even researchers/observers), appropriate for their various roles in different activities. This chapter focuses on the explanatory and interpretation issues that arise when the integrated Interaction Analysis (IA) features are used by teachers–moderators. The importance of applying additional interpretative value to seemingly simple quantitative measurements is highlighted through several implemented case studies. This research indicates that the teachers’ tasks can be supported using such approaches. More complex diagrams, with potentially increased underlying interpretation power, provide a more insightful examination …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:dhFuZR0502QC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Design issues in Learning Environments for young students: The importance and the limits of general usability criteria",
            "Publication year": 2001,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/adimitr-PCHCI2001-congr-design-issues-usability.pdf",
            "Abstract": "This paper initially examines some often overlooked factors (such as users and context) that are related to the usability of educational software. Then, the concept of usability is examined, trying to consider its real meaning in educational software, related more on its features supporting learning. Additionally, it is argued that usercentred or even learner-centred design approach must be actually reconsidered, taken into account recent, more social oriented, considerations. Finally, interface design and usability evaluation methods during the whole design-development lifecycle process are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-reflection, comparative reflection and analogical reflection in the framework of metacognitive modelling activities using the ModellingSpace technological environment",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kritikos-5/publication/233784342_Self-reflection_comparative_reflection_and_analogical_reflection_in_the_framework_of_metacognitive_modelling_activities_using_the_ModellingSpace_technological_environment/links/09e4150b7a84fe6cfb000000/Self-reflection-comparative-reflection-and-analogical-reflection-in-the-framework-of-metacognitive-modelling-activities-using-the-ModellingSpace-technological-environment.pdf",
            "Abstract": "The modern educational technological environments do not focus on the transmission of knowledge, but on the triggering of metacognitive functions. Reflection acts as a booster for metacognition. In this work, we present initially a review of the research on reflection in technological environments. Through the review and in combination with the benefits of analogical reasoning, we propose an alternative kind of reflection, the analogical reflection, instead of self-reflection and comparative reflection. Self-reflection is considered as someone’s reflection on his/her own actions. As comparative reflection, we consider the reflection on others’ actions. By the analogical reflection, we mean the reflection on analogies. Based on the analogical reflection, we outline our pilot research, which is a case study on three groups consisted of two students each. The students work collaboratively in the ModellingSpace technological environment. Our basic hypothesis is the following: In self-reflection, it is very possible that someone cannot recognise his/her own mistakes. In comparative reflection, this possibility is potentially reduced, because perhaps the others do not make the same mistakes. We estimate that this possibility is minimised when the analogical reflection is activated, because it is easier to recognise a strange behaviour in a familiar cognitive domain, where the normal behaviour is well known. Finally, we present briefly an instructional framework, in which students are asked to reason analogically and reflect on modelling activities, in order to exploit and improve their metacognitive skills.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:BqipwSGYUEgC",
            "Publisher": "GIREP-ICPE-MPTL 2010"
        },
        {
            "Title": "ModelsCreator-Un logiciel de modélisation, les regles logiques et la prise de décision",
            "Publication year": 2001,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00001195/",
            "Abstract": "Les processus de résolution de problèmes et de prise de décision constituent une question importante de l'enseignement et de l'apprentissage. Les compétences acquises par les élèves au cours de ces processus devraient se trouver au centre même de l'acte éducatif. Cet article traite des processus de prise de décision dans le cadre de résolution des problèmes à l'aide du logiciel éducatif ModelsCreator. Ce logiciel constitue un environnement ouvert d'apprentissage, permettant aux élèves de concevoir, de construire et de modifier des modèles. Il s'agit d'un environnement de modélisation mettant l'accent sur le raisonnement qualitatif et semi-quantitatif, ainsi que sur les moyens alternatifs d'expression et de visualisation des modèles. Nous étudions les aspects de construction des modèles d'ordre logique et de prise de décision, de l'étude de leur comportement et de leur amélioration.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Users’ data",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-9827-7_11",
            "Abstract": "Interaction analysis has been used in computer-mediated settings for approximately two decades. Its main purpose has been to understand and identify the characteristics of electronic communication, collaboration and coordination. In recent years, however, its scope has expanded to include the support of students and teachers during online learning activities. This chapter documents the findings from three European projects that focused on this novel, supportive role for interaction analysis. Following the definition of interaction analysis indicators and their computation, the use of unified data formats and interfaces is considered as means for utilising tools and data beyond their original scope and settings. Finally, the issue of visualisation of analysis results is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Exploitation of data modeling for database design in secondary education learning activities: A case study concerning real stories analysis",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/38944811/B.3.19.pdf",
            "Abstract": "Data models are representation systems for structural modelling of physical systems. Data models application results in databases that are amenable to computation enabling the modeller to interact with them for information retrieval, hypotheses testing, comparisons etc. In this paper we initially approach the didactic and learning value of data modelling for database design in terms of the features related to students’ involvement in the related learning activities. In order to clarify the proposed analysis a case study is presented concerning the design of a database for the analysis of real stories about vehicular accidents. The case study results support the fundamental consideration that database design based learning activities offer opportunities for rich learning situations that activate high order thinking.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual argumentation against racism in videos designed by university students: The role of images",
            "Publication year": 2016,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2017/07/visual_argumentation_against_Racism_inVideos_2017_F_D_P.pdf",
            "Abstract": "The paper discusses university students΄ multimodal digital compositions concerning racism in the specific sociopolitical context marked by the expansion of racist violence following the raise of far-right political parties and the financial crisis. Drawing on the fields of Multimodal Social Semiotics, Argumentation and Rhetoric, this paper attempts to provide a methodology for analyzing multimodal argumentation in videos. We focus on the way two students “orchestrated” circulated meanings and opinions into videos as answers to the short film Schwarzfahrer. Findings suggest that modality judgements related to specific types of photos and the interaction of rhetorical figures and visual meanings inform the identification and verbal reconstruction of the argument.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Grand Challenge Problem 10: TELEARC an Agile and Productive Networking of TEL Small and Medium Sized Research Labs",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-12562-6_11",
            "Abstract": "Small and medium sized research labs (SMLs) are dominating European TEL research. This is justified by the great numbers of countries and regions in Europe needing to develop a research and innovation competence to facilitate the diverse educational systems contextualized in various institutional settings across Europe. However, to strengthen the various research practices and to develop a common scientific language on TEL research the Grand Challenge Problem is to establish a vivid network and a community of practice among the research labs. TELEARC (Technology Enhanced Learning European Advanced Research Consortium) has been established to realize such a network. The chapter presents the framework of TELEARC.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Modellingspace: the setting up of human networks as vital part of the design and implementation of a technology-supported learning environment",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64484",
            "Abstract": "The ModellingSpace (MS) project is concerned with developing and implementing a computer-based modelling learning environment in actual school contexts and preparing an education programme for the teachers involved in it. The paper describes the conceptual framework of setting up human networks and developing them into communities of practitioners as part of carrying out this empirical research. To foster a harmonious integration of the environment and to promote an efficient use of it, the MS project sees the development of pedagogical tools as a process of innovation that involves teachers, as the main actors, from the first stages of the design. Teachers also participate in the building of new knowledge about the development of high level competencies such as modelling, exploratory learning and collaborative problem solving. In order to describe the complex mechanisms set to work during the implementation phase, a conceptual model is used. This concerns the systematisation of actions so as to focus on the goals of implementation and to control better the variables that could negatively bias any expected effects. The systemic nature of this model is expected to further facilitate the communication of the created expertise. It will thus allow to improve the efficiency of future actions in relation to the use of ICT-rich environments in education while also promoting a more formal “driving” of the associated changes.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:-f6ydRqryjwC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Supporting “learning by design” activities using group blogs",
            "Publication year": 2008,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.11.4.199.pdf",
            "Abstract": "The paper presents a case study of the educational exploitation of group blogging for the implementation of a “learning by design” activity. More specifically, a group of students used a blog as a communication and information management tool in the University course of ICT-enhanced Geometry learning activities. The analysis of the designed learning activities, the blog content and log files, as well as the points of view of the students (via a questionnaire and a group interview) expressed upon completion of the activity gives significant findings supporting the researchers’ initial hypotheses about the potential of blogs’ educational applications. Blogs combined with a proper pedagogical approach such as ‘learning by design’enable teachers to offer high quality learning experiences to their students.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Symposium Learning environment design for modelling activities in a social context: the venture of modellingspace",
            "Publication year": 2003,
            "Publication url": "https://gnosis.library.ucy.ac.cy/bitstream/handle/7/64481/C1_Dimitracopoulou_LEARNING%20ENVIRONMENT%20DESIGN%20FOR%20MODELLING_CBLIS_2003.pdf?sequence=2",
            "Abstract": "Modelling, especially dynamic modelling, for many students of secondary education, is an extremely difficult cognitive activity. Professional tools are too hard for novices to use, user-unfriendly, and do not provide support for learners. Over the last decade, the interest in modeling activities and the possibilities offered by technology have led to the development of a number of systems addressed to young students (eg Model-It, SimQuest, Modellus, etc).",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:35N4QoGY0k4C",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Design principles for an open environment, supporting learning process participants on modelling and collaboration",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Vassilis_Komis/publication/228978646_Design_principles_for_an_open_environment_supporting_learning_process_participants_on_modelling_and_collaboration/links/09e4150e091351f144000000/Design-principles-for-an-open-environment-supporting-learning-process-participants-on-modelling-and-collaboration.pdf",
            "Abstract": "The aim of the paper is to present and discuss the main design concepts and principles, for a collaborative modelling environment for sciences addressed to young students 11-16 years old. The main issues under discussion concern central design questions such as: what must the main modelling primitives be when addressing young students, belonging to a wide range of cognitive possibilities? In what specific ways can we support students reasoning offering multiple representations? How can we ensure flexible collaboration and how can we support related needs in a community level? Even more, how can we support self-regulation and metacognitive development for students and how can we support teachers when working in typical schools conditions? This paper, which focuses on the design principles, briefly presents the derived developed tools and functionalities of a collaborative modelling environment (MODELLINGSPACE), while citating the main research results issued during the design-development process.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparative analysis of understanding practices in the VMT environment.",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZnAfAwAAQBAJ&oi=fnd&pg=PA28&dq=info:9fitWGQ9S_EJ:scholar.google.com&ots=pkVSQJOa_7&sig=MP3vVapsNt8TAdRRcwRApHrmmJY",
            "Abstract": "The oriented question of this symposium is, what are the appropriate methods and frameworks for studying practice in CSCL environments? To foster a useful dialogue on methodology, we apply a “comparative analysis” of computer-mediated interactions taken from a common data source of Virtual Math Teams (VMT) environment.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "OCAF: An object-oriented model of analysis of",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indicators for measuring quality in asynchronous discussion forae",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.470.4404&rep=rep1&type=pdf",
            "Abstract": "Asynchronous discussions are widely used in Distance Learning approaches. DIAS is an Asynchronous Discussion Forum Software, mainly developed in order to offer extended monitoring and interaction analysis support, by providing a wide range of indicators jointly used in various situations, to all discussion forae users (individual user/students, groups, moderators/teachers or even researchers/observers), appropriate for their various roles in different activities. In this paper we describe two of the integrated Interaction Analysis (IA) Indicators, concerning the Quality assessment of a discussion.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ιnquiry learning using a technology-based learning environment",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=18164065692478450840&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Monitoring and analyzing group interactions in asynchronous discussions with the DIAS system",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11853862_5",
            "Abstract": "DIAS is an Asynchronous Discussion Forum Software, mainly developed in order to offer extended monitoring and interaction analysis support, by providing a wide range of indicators jointly used in various situations, to all discussion forae users (individual user/students, groups, moderators/teachers or even researchers/observers), appropriate for their various roles in different activities. In this paper we describe some of the integrated Interaction Analysis (IA) features and we provide information concerning case studies, some of which are in progress.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Is synchronous computer mediated collaborative problem-solving ‘justified’only when by distance? Teachers’ points of views and interventions with co-located groups, during everyday class activities",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-0195-2_53",
            "Abstract": "Synchronous collaborative problem solving is usually examined for its learning potential, while it is often studied under experimental conditions. The present research aims at exploring synchronous computer mediated collaborative problem solving in real school context, with collocated students, in every day practice. This paper focus on teachers and the possibility offered to improve or empower their teaching approaches exploiting collaborative settings with minimum technological support. The analysis shows that this approach provides teachers with some new opportunities and especially concerning online/off-line students’ diagnosis during problem-solving.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "USE OF COOPERATIVE LEARNING SCENARIOS IN COMPUTER TEACHING FOR STUDENTS WITH DISABILITIES THROUGH AN E-LEARNING PLATFORM–RESULT OF STUDY",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=1884938224761661953&hl=en&oi=scholarr",
            "Abstract": "This study is part of a research that took place at the Special Gymnasium of Athens. It aims to explore how Information and Communication Technologies can be used during learning procedures to students with disabilities, to study of current Informatics Curriculum for the specific category of students, to develop and study teaching scenarios, in order to improve the quality of the learning procedure for the specific category of  students and to find methods that will ensure the equal participation of all students during the learning procedure, both in the strict limits of a classroom and the wider borders of each educational activity. It presents a cooperative educational activity using technological tools and its effect on the participation of students, on the quality of cooperation, the sociographics of the students in the classroom and finally the cognitive result is examined. Within the general spirit of curricula, and the goal of …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:hMod-77fHWUC",
            "Publisher": "IATED"
        },
        {
            "Title": "What dialogue analysis can tell about teacher strategies related to representational changes",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2836149850165282760&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collecting and analyzing interaction data in computer-based group learning discussions: An overview",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/35756235/BA-PING2007.pdf",
            "Abstract": "This paper provides an overview of the dynamics underlying the process of collecting and analyzing raw data from collaborative learning activities. It is based on the research background which the implementation of DIAS relied upon; a system aiming at supporting asynchronous discussions’ participants on an awareness and metacognition level via visualized interaction analysis indicators. Open questions from the CSCW field are used as a guideline for selecting the appropriate data to collect. The Information Visualization field provides ideas for successfully presenting information obtained by applying Interaction Analysis methods on these data. Through simple examples, we try to demonstrate how such attempts may lead to powerful analysis tools, with cognitive and metacognitive extensions.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design principles for the support of modelling and collaboration in a technology-based learning environment",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2005.006791",
            "Abstract": "The aim of the paper is to present and discuss the main design concepts and principles, for a collaborative modelling environment for sciences addressed to young students 11–16 years old. The main issues under discussion concern central design questions such as: what must the main modelling primitives be when addressing young students belonging to a wide range of cognitive possibilities? In what specific ways can we support students' reasoning offering multiple representations? How can we ensure flexible collaboration and how can we support related needs in a community level? Furthermore, how can we support self-regulation and metacognitive development for students and how can we support teachers when working in typical school conditions? This paper, which focuses on the design principles, briefly presents the derived developed tools and functionalities of a collaborative modelling environment …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:_kc_bZDykSQC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Participatory Analysis of Synchronous Collaborative Problem Solving using the OCAF methodology and tools",
            "Publication year": 2003,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/28/Avouris_etal_Interactive_event_proposal_CSCL2003.pdf",
            "Abstract": "This interactive event aims at introducing the participants in analysis of collaborative problem-solving activities, in which they are going to be first involved themselves, using the OCAF (Object-oriented collaboration analysis framework) methodology and Collaboration analysis tools.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On evaluation of collaborative problem solving: Methodological issues of interaction analysis",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=7443862500748377545&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-COMODE Services for the Implementation of Collaborative Modelling Environments in Schools.",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00190262/",
            "Abstract": "e-COMODE is an open digital learning environment, which assists young students (10-17 year old) in creating models. e-COMODE services aim to offer a collaborative modelling environment, including pedagogical, technical and implementation support services. The market validation of the different services has been performed in different environments, private and state schools, from different geographical areas; Greece, Spain and North Ireland in the UK, in order to confirm the business model developed and the services acceptance. Outcomes show that e-COMODE services benefit schools by providing mechanisms to solve the lack of sufficient and appropriate teacher's support to incorporate new technologies in their teaching practices, to implement collaborative learning in the educational systems and the learning via computer based modelling. Although end-users (teachers, students) have already adopted the e-COMODE facilities, the barriers for the exploitation of the services are at the level of the public administration. Therefore, the business model proposed is being revised in function of the experience gathered during the market validation.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying the effect of interaction analysis indicators on students’ selfregulation during asynchronous discussion learning activities",
            "Publication year": 2009,
            "Publication url": "https://repository.isls.org/handle/1/3006",
            "Abstract": "Selfregulation has become an important research subject during the past 20 years, especially in Technology Enhanced Learning approaches, following student-centered strategies. When designing learning activities under this scope, in a social context, the need for building supporting tools for the participants of such activities has been highlighted. We have implemented such tools, by applying Interaction Analysis (IA) techniques, in order to support the participants of asynchronous discussion learning activities. In this paper we study the effects of IA indicators on students' selfregulation. We present research findings from several implemented case studies, in order to confirm our hypothesis, that such supporting tools indeed facilitate students' selfregulation, as it was shown both quantitatively and qualitatively, thus enhancing the overall activity, as well as the collaborative process itself.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "Synchronous computer-mediated collaborative activities among collocated students: Conditions that make them valuable in every-day educational practice",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=14639730016716762389&hl=en&oi=scholarr",
            "Abstract": "REPORT PRESENTATION IN THE CLASSROOM. During the next lesson, some group of students present their activity report in the classroom and answer other students’ and teacher questions.⇨ collective activity in the social level of the class, moderated by the teacher. Teacher Role: Additionally, teacher intervenes to the whole class, or to specific groups after having study the ‘history of collaborative process’ of each group (using and studying information provided by interaction analysis tools).",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The School‐Teacher's Learning Community: matters of communication analysis",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/14759390701406745",
            "Abstract": "A distance learning educational program for in‐service teachers from disperse islands was implemented in Greece. The program was designed to create and sustain a learning community within which learning would be achieved in both a formal manner (by implementing electronically supported courses) and an informal manner (through interaction and collaboration). During the implementation of the program, a case study was produced which focused on the analysis of the learning community that was created. In this paper analysis results are presented indicating how the learning community was created and how it evolved. In order to thoroughly analyze the learning community, appropriate tools and methods of analysis were used and are presented. These tools were also used for self‐regulation. The outcomes of this program demonstrated some positive results.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Method and Tools for analysis of collaborative problem-solving activities",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Olav-Bertelsen/publication/295847094_Proceedings_of_the_First_International_Workshop_on_Activity_Theory_Based_Practical_Methods_for_IT-Design_Copenhagen_Denmark_September_2-3_2004/links/572b0f9c08ae057b0a08c7ba/Proceedings-of-the-First-International-Workshop-on-Activity-Theory-Based-Practical-Methods-for-IT-Design-Copenhagen-Denmark-September-2-3-2004.pdf#page=7",
            "Abstract": "This paper provides an overview of the “Object-oriented Collaboration Analysis Framework (OCAF)” a method proposed for analysis and evaluation of collaborative problem solving activities of groups of actors, mediated by collaboration-support technology. This framework puts emphasis on the abstract and tangible objects that appear during the development of a solution to a given problem. The notions of the “objects’ histories” and “objects’ ownership” are introduced by this analytical framework. In the paper tools that have been developed to support this framework are described, together with extracts of studies that have been undertaken, during which OCAF has been effectively used.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indicators for measuring quality in asynchronous discussion forums",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.470.4404",
            "Abstract": "Asynchronous discussions are widely used in Distance Learning approaches. DIAS is an Asynchronous Discussion Forum Software, mainly developed in order to offer extended monitoring and interaction analysis support, by providing a wide range of indicators jointly used in various situations, to all discussion forae users (individual user/students, groups, moderators/teachers or even researchers/observers), appropriate for their various roles in different activities. In this paper we describe two of the integrated Interaction Analysis (IA) Indicators, concerning the Quality assessment of a discussion.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing collaborative learning systems: current trends & future research agenda",
            "Publication year": 2005,
            "Publication url": "https://45.55.127.102/handle/1/3670",
            "Abstract": "The research community, in order to support learning as well as collaboration, has designed systems, which, distinctive from common web-based ones (simply enabling collaborative activities), constitute new cognitive and meta-cognitive tools. The paper proceeds with a categorization of the main tools and functions that characterise collaborative learning systems (designed for primary/ secondary/ higher/ education) in order to discuss the current trade- offs. It proposes a design framework for collaborative learning systems that are addressed to primary & secondary education. This framework is derived from considerations of cognitive psychology, science education, and CSCL community research results. The paper concludes by presenting the main themes of the actual research agenda, which is intended to help design systems that can be integrated into primary and secondary education contexts.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:eQOLeE2rZwMC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "Interaction analysis in asynchronous discussions: lessons learned on the learners' perspective, using the DIAS system.",
            "Publication year": 2007,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/bratitsis_adimitr_cscl_2007.pdf",
            "Abstract": "DIAS is an Asynchronous Discussion Forum Software, mainly developed in order to offer extended monitoring and interaction analysis support, by providing a wide range of Interaction Analysis (IA) indicators jointly used in various situations, to all discussion forae users (individual user/students, groups, moderators/teachers or even researchers/observers), appropriate for their various roles in different activities. In this paper we present an overview of the research questions and results regarding the students as IA tool users, deriving from four conducted studies, in educational contexts.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "State of the art of interaction analysis for Metacognitive Support & Diagnosis,(D31. 1.1) EU Sixth Framework programme priority 2",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=3697063822434536753&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design Principles for an open modeling environment for learning, modelling & collaboration in sciences",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=5801420071165156670&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of the Computer Programming Learning Environments for primary education",
            "Publication year": 2019,
            "Publication url": "https://resmicte.lis.upatras.gr/review/article/view/3140",
            "Abstract": "Over the past decade, the assessment of the general educational value of computer programming and computational thinking has been constantly increasing and, as a result, they are introduced to increasingly younger ages. In parallel, educational programming environments are significantly progressing, providing a variety of options for different ages. This paper presents an overview of the modern learning programming environments for primary education and proposes a classification system with categories corresponding to the technological and educational dimensions of the area. The paper aims to support teachers in learning design for the interdisciplinary approach of programming and the development of computational thinking.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secondary education students’ difficulties on database design and remedial teaching strategies",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/38944795/B.3.17.pdf",
            "Abstract": "Databases use and design has utilitarian and pedagogical educational interest. The utilitarian interest for databases education is determined by their economic impact. The increasing demand for database development in combination with the availability of user friendly data base management systems (dbms‟ s) results to database design by untrained people raising quality and cost questions [2, 3]. In addition we consider that pedagogical interest of databases rises from their view as models [8] and the possibility to use them for the design of general knowledge learning activities. In this consideration database design is a modeling activity and dbms‟ s are general purpose modeling environments using data models as representation systems. Database design can be used for the development of group based, learning activities, concerning authentic problem solving that conserve students motivation. The above utilitarian and learning advantages of databases rationalize the database design instruction in secondary education but the way that this could be better approached is still an open educational research question. Research reports about human factors in database design are rather limited [2, 3, 9] and concern higher education students and professionals. The differences in the background between the two target groups do not permit simple transfer of research results from higher to secondary education. Our research interests concern databases didactics and educational exploitation in general, for secondary education students.In this paper we present an action research about difficulties secondary education students in database design …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interpretation issues in monitoring and analyzing group interactions in asynchronous discussions",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/article/international-journal-collaboration-ijec/1969",
            "Abstract": "DIAS is an asynchronous discussion forum software, mainly developed in order to offer extended monitoring and interaction analysis support, by providing a wide range of indicators jointly used in various situations, to all discussion forae users (individual students, groups, moderators/teachers or even researchers/observers), appropriate for their various roles in different activities. In this paper we focus on the explanatory and interpretation issues that arise when the integrated interaction analysis (IA) features are used by a teacher–moderator. Core objective of this paper is to outline the importance of appropriate interpretation of the IA indicators. The notion of interpretative schemas is deployed and their potential exploitation is thoroughly explored, using examples from real teaching settings. In fact, the significance of interpreting visualization data in a combined way and from different perspectives is designated …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:0EnyYjriUFMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A course model implemented in a teacher's learning community context: issues of course assessment",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/01449290600691210",
            "Abstract": "How could we design course programmes in a teachers' learning community context? Is it possible to conceive a concrete and appropriate course model? And if so, how could we assess the effectiveness of such a course model in such a complex learning situation? In this paper, a model implementation of technology-based courses is presented. The model was specified according to adult collaborative learning principles and was implemented in a learning community context. This model was put into practice during a distance learning educational programme, concerning further education of in-service primary and secondary education teachers. The programme was named School-Teacher's Learning Community and hosted many different web-based supported courses. Within this broad e-Learning Community students were educated, via the Internet, on aspects mainly concerning uses of information and …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Synchronous computer mediated collaborative activities among collocated students: Conditions that make them valuable in every day educational practice",
            "Publication year": 2004,
            "Publication url": "https://telearn.archives-ouvertes.fr/docs/00/19/06/91/PDF/Fessakis-George-2004b.pdf",
            "Abstract": "Synchronous collaborative activities are usually studied in conditions where teachers and students are physically separated. Is there any possibility to apply these activities when all participants are collocated? Does this collocated collaboration setting seems meaningful and for what reasons? Is the quality of learning and teaching process satisfactory high? Under what conditions? The present research explores the previous questions. More specifically, it explores synchronous computer mediated collaborative activities with collocated students in realistic secondary school context. The proposed approach determines some significant application conditions:(a) The selection of critical instances of this setting application related to every day courses (eg conceptual understanding, strategies for inquiry or modelling),(b) The application of appropriate structured script that involves: individual work, synchronous computer mediated activity, face to face activity, and social activity with the whole class,(c) The existence of appropriate interactions’ analysis tools, that support students in a metacognitive level,(d) The existence of interactions’ analysis tools appropriate to support teachers in a diagnosis level as well as in a teaching strategies self-regulation level. Research results are based on analysis of students’ actions & computer mediated dialogues, as well as on students’ and teachers’ points of view, in order to justify the meaningfulness of the activity. The quality of learning process and collaboration are analyzed mainly via a mixed analysis approach of students’ computer-mediated dialogues.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inventory of inquiry learning programs-updated version",
            "Publication year": 2005,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00190108/",
            "Abstract": "Deliverable 18.1.2 presents the updated version of the inventory of inquiry learning programs of the Computer supported inquiry learning SIG. The aim of the inventory is to develop an exhaustive overview of applications, tools, web environments, and resources in the field of inquiry learning. The complete inventory is available on the website of the SIG (http://kaleidoscope.gw.utwente.nl/SIG.IL/). The present Deliverable (18.1.2) provides a description the changes that have been made and the material that was added since the publication of the intermediate version of the Inventory of inquiry learning programs of the Computer supported inquiry learning SIG (18.1.1).",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Examining the relation between domain-related communication and collaborative inquiry learning.",
            "Publication year": 2009,
            "Publication url": "https://www.narcis.nl/publication/RecordID/oai:ris.utwente.nl:publications%2F5e9b2319-08b6-4188-a16f-d5844b52df55",
            "Abstract": "Examining the relation between domain-related communication and... (2009) | www.narcis.nl \nKNAW KNAW Narcis Back to search results University of Twente Publication Examining the \nrelation between domain-related communication and... (2009) Pagina-navigatie: Main Save \npublication Save as MODS Export to Mendeley Save as EndNote Export to RefWorks Title \nExamining the relation between domain-related communication and collaborative inquiry \nlearning. Author O'Malley, C.; Anjewierden, Anjo Allert; Suthers, D.; Gijlers, Aaltje H.; Kolloffel, \nBas Jan; Reimann, P.; Dimitracopoulou, A.; Saab, Nadira; de Hoog, Robert Date issued 2009 \nAccess Restricted Access Reference(s) METIS-260309 Language und Type Conference Paper \nPublication https://research.utwente.nl/en/publications/examining-the-re... OpenURL Search \nthis publication in (your) library Persistent Identifier urn:nbn:nl:ui:28-5e9b2319-08b6-4188--.…",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inquiry-based activities using a variety of Pedagogical tools",
            "Publication year": 2007,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64680",
            "Abstract": "This study examined the impact of an inquiry-based and modeling-based instructional intervention on primary school students, using different pedagogical tools: video, real objects and a technology-based environment that supports modeling.. The study was implemented with thirty (30) students. Quantitative results demonstrated that the intervention enhanced the inquiry ability of all students. Qualitative results demonstrated that it is essential for students to practise modeling activities. It is also essential that the realisation of experiments in computer follow the realisation of real experiments, in order to activate the students reasoning in greater depth and support them pass to formal thought. The study adds to the existing literature on designing learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:maZDTaKrznsC",
            "Publisher": "University of Cyprus"
        },
        {
            "Title": "Improving database design teaching in secondary education: action research implementation for documentation of didactic requirements and strategies",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563204001177",
            "Abstract": "Database design and use has educational interest for utilitarian and learning reasons. Database technology has significant economic impact and the demand for database design cannot be covered by the existent educated experts. Furthermore, the database management systems available at schools could be used for the design and implementation of high quality learning activities. Databases are general purpose modeling environments that enable problem solving using conceptual frameworks closer to the solver and the problem than the machine architecture. Databases design introduction in the curricula of secondary education programs raises educational research questions. Research questions concern the didactics of the subject as well as the value of database design based learning activities. In this paper, we present some of the more significant findings of an action research concerning the database …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The function of images in argumentation against racism in videos designed by university students",
            "Publication year": 2019,
            "Publication url": "http://ikee.lib.auth.gr/record/310589",
            "Abstract": "The paper discusses university students΄ multimodal digital compositions concerning racism in the specific sociopolitical context marked by the expansion of racist violence following the rise of far-right political parties and the financial crisis in Greece. Drawing on the fields of Multimodal Social Semiotics, Argumentation and Rhetoric, this paper discusses the property of high naturalistic modality of journalistic photos as a semiotic and rhetorical choice in the videos of two students. We focus on the way two students orchestrated semiotic resources into argumentation as answers to the short film Schwarzfahrer. Findings suggest that modality judgements inform the identification and reconstruction of the argumentSubject: Linguistics",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:XiSMed-E-HIC",
            "Publisher": "Hellenic Semiotics Society"
        },
        {
            "Title": "Full length articles",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=5759015067435298382&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design Principles for an Open and Wide MODELLINGSPACE for Learning, Modelling & Collaboration in Sciences and Mathematics, In (Ed) C. Constantinou “Computer Based Learning in Sciences",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12375108988203910911&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Young Children Collaborating to use Maps during Technology based Distributed Learning Activities",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.626.7456&rep=rep1&type=pdf",
            "Abstract": "How very young children of 6 years old reach to accomplish activities related to map use (reading, navigation); activities so cognitive demanding even for adults? This paper presents certain analysis aspects on a complex cognitive system that is formed by two groups of children collaborating by distance so as to navigate each other, through the use of technological tools of motion representation, cartography and oral communication. The analysis presented in this paper is focused mainly on cognitive processes during intra-group interactions as well as intergroup interactions involving relations and interactions among individuals and artifacts and examines which cognitive activities are emerged or activated by the children in their effort to read a map and navigate others to move in space facilitating learning related to spatial knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Technology-based Collaborative Learning in Every Day School Practices: Research Directions of Learning Technology & Educational Engineering Laboratory",
            "Publication year": 2004,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/18-adimitr-et-al-LTEE-directions-workshop-Vosn-%CE%95TPE-2004-english.pdf",
            "Abstract": "Four main directions of research was implemented by the Learning Technology and Educational Engineering (LTEE) Laboratory, in order to investigate aspects of technology based learning environments & collaborative learning, for young children, secondary education students, students with special needs as well as teachers support and teachers’ education approaches.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualizing linking patterns in weblogs: indicators of self-directed learning activities in a community of inquiry.",
            "Publication year": 2009,
            "Publication url": "https://www.narcis.nl/publication/RecordID/oai:ris.utwente.nl:publications%2Fcdfa193e-046a-42d4-b449-8f44d63928bd",
            "Abstract": "Visualizing linking patterns in weblogs: indicators of self-directed... (2009) | www.narcis.nl \nKNAW KNAW Narcis Back to search results University of Twente Publication Visualizing \nlinking patterns in weblogs: indicators of self-directed... (2009) Pagina-navigatie: Main Save \npublication Save as MODS Export to Mendeley Save as EndNote Export to RefWorks Title \nVisualizing linking patterns in weblogs: indicators of self-directed learning activities in a \ncommunity of inquiry. Author Bruilliard, E.; Anjewierden, Anjo Allert; Dimitracopoulou, A.; \nEfimova, L.; de Hoog, Robert; Reimann, P. Date issued 2009 Access Restricted Access \nReference(s) METIS-260280 Language und Type Conference Paper Publication https://research.utwente.nl/en/publications/visualizing-link... \nOpenURL Search this publication in (your) library Persistent Identifier urn:nbn:nl:ui:28-cdfa193e-046a-42d4-b449-8f44d63928bd \nMetadata XML Source of Go .…",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secondary Students’ Analogical Reflections on Unfamiliar Scientific Concepts",
            "Publication year": 2017,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2017/07/Analogical-Reflections-on-Unfamiliar-Scientific-Concepts_fdraft_Kritikos_Dimitracopoulou_2017_IJTL.pdf",
            "Abstract": "In this paper, we describe a method of reflection, analogical reflection, and present a supportive software tool, called ART (Analogical Reflection Tool). We focus on the contribution of analogical reflection to students’ comprehension of unfamiliar scientific concepts. There are two basic categories of reflection: self-reflection and comparative reflection. In self-reflection, the learner reflects on his or her own actions. In comparative reflection, the learner reflects on others’ actions. We propose an alternative reflection type as a subcategory of comparative reflection: analogical reflection. In analogical reflection, students reflect on analogies, collating their actions with the analog’s functions. The hypothesis of our research is the following: If the learners study an analogical model, they will improve their performance, comprehending the unfamiliar scientific concept “electric capacitance” and identifying their alternative conceptions. According to the results, analogical reflection on unfamiliar concepts through ART appeared to be effective only after the students completed the learning activities. ART guides the students to make use of their existing knowledge, comprehend the studied domain, revise their alternative conceptions, and validate their correct perceptions.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enrich forum interfaces by visualization of interaction analysis' outputs.",
            "Publication year": 2015,
            "Publication url": "http://138.250.13.117/handle/123456789/28569",
            "Abstract": "Even if asynchronous discussion forums are currently used in education, the underlying research continues focusing more on the improvement of the basic functionalities than to a better awareness of exchanges, interactions and emerging content. This paper explores a new research direction in the design of technology based learning environments: computer based interaction analysis in educational forums. The aim is to contribute in the design of enriched forums’ interfaces allowing alternative representations of posted messages, and to provide support on the awareness of participants’ contributions via multiple and diversified visualisations of interaction analysis indicators, offering a metacognitive assistance to forum participants (students, tutors, moderators), as well as a cognitive assistance to observers of interactions (teachers, researchers, etc.).",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:WbkHhVStYXYC",
            "Publisher": "ATIEF"
        },
        {
            "Title": "Collaborative Learning By Design Through Group Blogging.",
            "Publication year": 2008,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/Fesakis_Tatsis_Dimitracopoulou_IADIS_2008-1.pdf",
            "Abstract": "This paper concerns the case study of a group blogging with the help of which, the participating students implemented a collaborative “learning by design” activity. More specifically, the students jointly designed Geometry learning activities with the purpose of exploiting technologies that are suitable for young children. The analysis of the viewpoints of the participants as well as of the blog content provides interesting information on the possibilities of exploiting blogging to improve the quality of higher education instruction.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design of distributed collaborative activities for young children related to map use and construction",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.471.70&rep=rep1&type=pdf",
            "Abstract": "One of the effects of recent theories on learning is not only to analyze learning processes but also to inspire for new learning activities. The design of learning activities related to map use and construction for young students is mainly based on ‘an idea’derived from epistemological analysis and analysis of cognitive difficulties of individuals using maps. This analysis led to re-attribute to the map its communicative status, through meaningful activities. The design rationale of the proposed learning activities apply on the assumption that the cognitive operation of an individual for instance to read a map (2D symbolic representation) and use it to ‘move’in the real space (3D representation), could be distributed over two group of individuals communicating each other while working in one of the two representational modes. For this purpose a technology based learning environment was designed, permitting children 6 years old to be implicated in collaborative settings as distributed cognitive activities related to maps. The activities are based on settings of two teams communicating via walky-talky: one team wanders around a real specific space carrying a GPS device, while the other team observes the exact path-trail traveled by the rover team, in front of their workstation running cartography tools. This paper is focused on the design of these learning activities, as well as on the collaborative settings specifications.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modelling Activities in School with a collaborative technology based learning environment. Scenarios of use in secondary education",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Angelique-Dimitracopoulou/publication/228799301_Modelling_Activities_in_School_with_a_collaborative_technology_based_learning_environment_Scenarios_of_use_in_secondary_education/links/5429a9c90cf27e39fa8e65e7/Modelling-Activities-in-School-with-a-collaborative-technology-based-learning-environment-Scenarios-of-use-in-secondary-education.pdf",
            "Abstract": "During the last years, modelling activities becomes an important aspect of the curricula in European secondary education. Technology based modelling environments have enhanced the available possibilities for learning activities in schools, while networking technologies have allowed to associate promising capabilities for collaborative learning in a wider learning community. The present paper presents briefly a modelling collaborative environment addressed to young students 11-16 years old, focusing on the presentation of some general scenarios of use in classroom, related to concept construction and modelling process.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mechanisms of Spatial Awareness in Groups Interactions of Pre-school Children during Cognitively Distributed Learning Activities",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=1327834779023443983&hl=en&oi=scholarr",
            "Abstract": "Even though the fact that several researchers doubted the value to introduce map work to young children because of their apparent “immaturity” to understand maps, this paper shows how 6 years old children manage to accomplish cognitive demanding mapping activities and how they finally acquire intuitions related to spatial awareness. The distributed learning activities are based on settings of two groups of children collaborating by distance so as to navigate each other or to create maps, through the use of technological tools of motion representation, cartography and oral communication: One team wanders around a real specific space carrying a Global Positioning System device (GPS), while the other team observes the exact path-trail traveled by the rover team, in front of their workstation running cartography tools. Recent theories of learning such as the Distributed Cognition theory analyze learning processes …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ModellingSpace: supporting young students to be thoroughly involved in modelling and collaborative modelling activities",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357765/",
            "Abstract": "How to really support young students in cognitively demanding modeling & collaborative modeling activities? ModellingSpace environment was designed to deal with this problem. This short paper is focused on its main design principles and features related to modeling primitives, data representations, collaborative activities' support, metacognitive support for students, as well as to teachers' support.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computer Supported Collaborative Learning Practices - CSCL2009 Conference Proceedings",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "ISLS, ISBN: 978-1-61584-137-0, distributed via LuLu.com & Amazon"
        },
        {
            "Title": "The impact of the Analogical Reflection on the Metacognitive Awareness",
            "Publication year": 2014,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2017/07/Kritikos_Dimitracopoulou_The_Learner_draft.pdf",
            "Abstract": "There are two types of reflection, according to what the learner reflects on, self-reflection and comparative reflection. In self-reflection, the learner reflects on her/his own actions, while in comparative reflection the learner reflects on others’ actions. We propose an alternative reflection type, as a subcategory of the comparative reflection, the analogical reflection. In analogical reflection, students reflect on analogies, collating their actions with the analog’s functions.The hypothesis of our research is the following. If the learners study an analogical model, the revision may be more substantial than the revision with self-reflection. We have designed a scaffolding software tool that assists students while reflecting analogically, the ART (Analogical Reflection Tool). In our research, we asked from the students (aged 15 years) to reflect (1) on their own actions and (2) on analogies, using the ART. In order to compare the metacognitive awareness due to self and analogical reflection we used three criteria-questions, based on the MAI (Metacognitive Awareness Inventory).",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "OCAF: An object-oriented model of analysis of collaborative problem solving",
            "Publication year": 2002,
            "Publication url": "https://repository.isls.org/bitstream/1/3926/1/92-101.pdf",
            "Abstract": "Computer-supported collaborative problem solving requires new methodological approaches of interaction and problem solving analysis. Usually analysis of collaborative problem solving situations is done through discourse analysis or interaction analysis, where in the center of attention are the actors involved (students, tutors etc.). An alternative framework, called “Object-oriented Collaboration Analysis Framework (OCAF)” is presented here, according to which the objects of the collaboratively developed solution become the center of attention and are studied as entities that carry their own history. This approach produces a view of the process, according to which the solution is made of structural components that are ‘owned’by actors who have contributed in various degrees to their development. OCAF is based on both actions and dialogues of actors, providing qualitative as well as quantitative indicators of collaboration and solution quality. The paper presents first the framework notation. Examples of its use in analysis of distance groups and face-to-face collaborative activities are provided next, followed by the dimensions of the framework supported analysis for teachers and researchers. Web-based tools supporting the OCAF approach are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:roLk4NBRz8UC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "Data recording and usage interaction analysis in asynchronous discussions: The DIAS system",
            "Publication year": 2005,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/Bratitsis-Adimitr_-Interaction-Usages-WS-AIED2005.pdf",
            "Abstract": "This paper describes the development and the implementation of a new Asynchronous Discussion Forum Software, called DIAS. While evaluating several corresponding software, we came to the conclusion that they seem to be inadequate to support the use of this activity (asynchronous discussion) as a substantial part of the learning process. Most actual forums, that incorporate interaction analysis functions, support mainly administrators, or teachers, while offer only basic awareness functions to the learners.The DIAS system is mainly developed in order to offer extended interaction analysis support, by providing a wide range of indicators jointly used in various learning situations, to all discussion forae users (individual students, groups, teachers or even researchers), appropriate for their various roles in different learning activities. An additional goal is to provide a customizable, flexible and interoperable environment.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On analysis of collaborative problem solving: An object-oriented approach",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563202000560",
            "Abstract": "During the last decade an increased interest has been observed on computer-supported collaborative problem solving. This relatively new area of research requires new methodological approaches of interaction and problem solving analysis. Usually analysis of collaborative problem solving situations is done through discourse analysis or interaction analysis, where in the center of attention are the actors involved (students, tutors etc.). An alternative framework, called “Object-oriented Collaboration Analysis Framework (OCAF)” is presented here, according to which the objects of the collaboratively developed solution become the center of attention and are studied as entities that carry their own history. This approach produces a reversed view of the process, according to which the solution is made of structural components that are ‘owned’ by actors who have contributed in various degrees to their development …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:WF5omc3nYNoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Contribution à l’étude des raisonnements des élèves sur les acides et bases avec l’utilisation de vidéo, des objets reels et de logiciel éducatif",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Angelique-Dimitracopoulou/publication/338924349_Contribution_a_l'etude_des_raisonnements_des_eleves_sur_les_acides_et_bases_avec_l'utilisation_de_video_des_objets_reels_et_de_logiciel_educatif/links/5e33243092851c7f7f0e9f23/Contribution-a-letude-des-raisonnements-des-eleves-sur-les-acides-et-bases-avec-lutilisation-de-video-des-objets-reels-et-de-logiciel-educatif.pdf",
            "Abstract": "Les dispositifs technologiques destinés à l’enseignement de la physique sont étudiés du point de vue de leur apport, pour la formation des élèves de l’enseignement primaire, aux démarches de modélisation. Questions comme «quels modèles faut-il qu'enseignions-nous afin que les citoyens en général soient alphabets en chimie»,«Quels modèles doivent être développés, être remplacés ou être ajoutés pour que soit-il un individu compétent pour communiquer avec autres individus à une échelle limitée d’applications?» intéressent les scientifiques.Nous nous sommes interrogés sur l’utilisation de ces dispositifs (logiciel éducatif de modélisation appelé ModellingSpace, vidéos). Cela nous a conduit à nous intéresser à la manière dont les élèves grecs, d'âge 11-12 d'ans, traitaient les informations qu’ils appréhendaient à l’écran de la vidéo, l’écran de l’ordinateur (les informations symboliques) et les modèles qu’ils fabriquent à la surface de travail de logiciel de modélisation (la connaissance qu’ils ont bâtie des expériences qu’ils ont effectuées avec des objets quotidiens). Les élèves des classes de primaire ont été interrogés en groupes de trois. Premièrement ils expérimentent avec la vidéo, en suite avec les objets et finalement avec le logiciel. L'enquête s' intègre à la problématique plus générale qui examine les avantages des ces trois outils pédagogiques (vidéo, objets naturels, logiciel éducatif) et à qu'ils peuvent contribuer à la construction de concepts en chimie.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "State of the art on interaction and collaboration analysis",
            "Publication year": 2004,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00190145/",
            "Abstract": "The document focuses on students-machine or students-students' interactions analysis that could support students & teachers, when students work in stand-alone mode or in collaborative technology based learning environments. The document concerns the State of the art on the interaction analysis dimensions and approaches that are already applied. The appropriateness of these approaches is related to the learning environments features, the user's profile, the learning activities, and the context of use.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced collaborative distance learning systems for young students: Design issues and current trends on new cognitive and metacognitive tools",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/61759406/Advanced_Collaborative_Distance_Learning20200112-11025-1pmfl5t.pdf",
            "Abstract": "This paper reviews recent applications concerning technology-based learning systems that promote collaboration among students by distance. The research community in order to support learning as well as collaboration, has designed systems differentiating themselves from common web-based tools (simply enabling collaborative activities), and constitute new cognitive and metacognitive tools. The paper, firstly, presents some distinctions of collaborative learning systems from other networked systems, based on assumptions on collaborative learning processes and possibilities of implementation in current educational settings. Secondly, by presenting some cross section systems proceeds to an analysis and categorization of main tools and functionalities that characterizing them. Thirdly, it analyses and discusses extensively the current trade-offs of collaborative systems design. Finally, it attempts a synthesis of necessary tools by a proposed framework and concludes by presenting the main axes of the research agenda concerning design of systems and underlying tools addressed to young students of primary and secondary education.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative problem solving using an open modeling environment",
            "Publication year": 2002,
            "Publication url": "https://repository.isls.org/bitstream/1/3896/1/654-655.pdf",
            "Abstract": "An innovative learning environment, enabling collaborative modeling activities, is introduced in this paper. ModelsCreator 3.0 (MC3) supports semi-quantitative, quantitative and qualitative reasoning during modeling activities of collaborating young children. MC3 is also an open environment in terms of primitive modeling entities, models and collaborating partners. Synchronous modeling activity can be performed at a distance using MC3, based on a mechanism of light multiple processes (reactive agents) residing in collaborating hosts.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:4TOpqqG69KYC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "Supporting members of a learning community using Interaction Analysis tools: The example of the Kaleidoscope NoE scientific network",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561839/",
            "Abstract": "Communities of practice (CoP) are nowadays widely used for implementing collaborative learning approaches, under the scope of contemporary learning theories. Several communication and/or collaboration web modules are used in order to support the organizational structure and facilitate the operational purpose of such communities. Following the same approach, scientific networks (SN) are widely used as a common method of expanding research and sharing academic resources. The need for appropriate tools in order to support the members of a CoP or a SN and further facilitate their collaborative tasks, or even resulted learning is often highlighted by the literature. In this paper we propose the use of Interaction Analysis indicators for that matter. Our experience from the implementation of such indicators, supporting the kaleidoscope network of excellence is presented.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "State of the art of interaction analysis for Metacognitive Support & Diagnosis",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00190146/",
            "Abstract": "The document concerns Computer Based Interaction Analysis that could support technology based learning activities' participants (e.g. students, teachers) or observers (e.g. teachers, researchers). The underlying considerations and analyses focus on interactions that occur via technology based Learning Environments, designed for stand alone use or collaborative use. Special emphasis is given on Interactions Analysis (IA) outputs that could support learning activities' participants in cognitive and metacognitive reflection and thus in selfregulatory operations. The document aims to present the state of the art on Interaction Analysis (highlighting the current state as well as the new trends) in three complementary dimensions: (I) Design of IA tools and involved IA indicators (II) Applied Analysis methods (III) Research questions and related applied methodologies",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Object-oriented analysis of collaborative problem solving activities",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=9167222179167493608&hl=en&oi=scholarr",
            "Abstract": "This paper provides an overview of the “Object-oriented Collaboration Analysis Framework (OCAF)” a method proposed for analysis and evaluation of collaborative problem solving activities of groups of actors, mediated by collaboration-support technology. This framework puts emphasis on the abstract and tangible objects that appear during the development of a solution to a given problem. The notions of the “objects’ histories” and “objects’ ownership” are introduced by this analytical framework. In the paper tools that have been developed to support this framework are described, together with extracts of studies that have been undertaken, during which OCAF has been effectively used.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interaction Analysis as a multi-support approach of social computing for learning, in the “Collaborative Era”: Lessons learned by using the DIAS system",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561758/",
            "Abstract": "Apparently computer technology is shifting its focus, with individual users not being the main target any more. The evolution of Web 2.0 technologies is promoting the development of services, suitable for the collaborative construction of electronic content. The Web seems to be gradually transforming into a multi-user platform, through which learning approaches, aligned with computer supported collaborative learning (CSCL), can be promoted into a new dimension. Under this scope, interaction analysis (IA) tools can be used to support different functionalities (e.g. awareness, regulation and evaluation of the collaborative processes by the participants themselves), based on the understanding of the social processes and the possibilities of intervention, in order to support and improve collaboration. In this paper we present our findings from using an asynchronous discussion platform with integrated IA tools for …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Issues in computer supported inquiry learning in science",
            "Publication year": 2007,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/Joolingen-de-Jong-Dimitracopoulou-JCAL-paper.pdf",
            "Abstract": "Computer supported inquiry learning has become an important application of computers in education. Computers allow for providing resources for inquiry learning, such as simulations; built-in support for the processes of inquiry learning; support for collaborative learning scenarios as well as tools for modeling by learners. An overview of the main issues on research on computer supported inquiry learning is provided including issues such as assessing learning effects of computer support, gaming learning systems, as well as conditions that are favorable or detrimental to learning. The articles in the current special issue are discussed with respect to their contribution to resolving these issues.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time collaborative modelling over low-bandwidth networks",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/50010427/C68_Margaritis_Avouris_Komis_Dimitracopoulou_CSCL2003_poster.pdf",
            "Abstract": "ModellingSpace is an open learning environment, which permits building of models by collaborating partners in various educational settings. This paper describes briefly the main features of the ModellingSpace environment and in particular issues related with coordination and communication during problem solving, as well as architectural considerations of this distributed peer-to-peer application relating to maintaining acceptable performance under low bandwidth network conditions. This is an interactive paper followed by a computer presentation of the described software.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aspects de la conception d'un environnement collaboratif de modélisation à distance",
            "Publication year": 2003,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00000143/",
            "Abstract": "Dans cet article nous traitons de la conception d'un environnement collaboratif d'apprentissage à distance centré sur le développement de compétences de modélisation scientifique. Dans un premier temps nous exposons les motifs cognitifs et pédagogiques qui nous ont amenés à concevoir cet outil. Ensuite, nous présentons brièvement les résultats des études de cas au cours desquelles ont été effectuées les expérimentations des premiers prototypes de l'environnement. Enfin, nous discutons de l'architecture de l'environnement et de ses principales fonctionnalités avant d'esquisser un plan des recherches à effectuer pour le valider.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "ATIEF; INRP"
        },
        {
            "Title": "Course Assessment in a Teacher's Learning Community",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-new-media-literacy/35949",
            "Abstract": "How can we assess the effectiveness of a course that is implemented in the context of a technology based Learning Community (LC)? What are the features of successful courses? Under what circumstances is a LC created within courses? Such questions were explored during an educational program for in-service K-12 teachers concerning the use of ICT in their teaching practices. During the implementation of the program, a research study took place. Assessment issues were dealt with and one course was proven the most “successful”, according to specified criteria. In this chapter, features of this course are presented in detail. We studied the role of e-moderation and how different means of communication were used during the course implementation. During our analysis, we deduced that a key factor for the success of the course was the creation and evolution of a LC. Finally, conclusions, benefits and …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:rO6llkc54NcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Evaluation of distance-learning environments: Impact of usability on student performance",
            "Publication year": 2001,
            "Publication url": "https://www.learntechlib.org/p/9213/",
            "Abstract": "Experimental results of usability evaluation of a distance learning system are presented in this article. An experiment is described that took place in the frame of a University course. The main goal of the experiment was to evaluate the usability of the Testing and Self-evaluation component of the system. A complementary research goal was to explore the eventual impact of system usability on student performance. For this purpose, two alternative software components were compared that shared similar functionality, implemented in different ways (IDLE, WebCT). The usability evaluation was based on user questionnaires. From this experiment correlation between the software usability and student performance has emerged, underlining the importance of usability evaluation of systems supporting distance learning.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:ufrVoPGSRksC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Enrichir les interfaces de forums par la visualisation d'analyses automatiques des interactions et du contenu",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00696377/",
            "Abstract": "Alors que les forums de discussion asynchrone deviennent de plus en plus répandus et utilisés en formation, la recherche les concernant s  intéresse plus à l  amélioration de leurs caractéristiques et fonctionnalités de base qu  à assurer une meilleure prise de conscience des interactions, des échanges et du contenu mis en jeu. Or, de nombreuses analyses des comportements des participants aux forums de discussion mettent en évidence des difficultés récurrentes. Ce texte explore une nouvelle direction de recherche, celle de l  analyse automatique des interactions et du contenu des échanges dans les forums de discussion à visée éducative. Il s  agit d  aider à concevoir des interfaces enrichies, ouvrant à de multiples lectures des échanges et offrant un support pour la prise de conscience des contributions des participants via des représentations multiples et diversifiées et pour une assistance métacognitive directe aux participants des forums (étudiants, tuteurs ou modérateurs), ainsi que pour une assistance cognitive aux observateurs des interactions d  un forum (enseignants, chercheurs, etc.).",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graphical interaction analysis impact on groups collaborating through blogs",
            "Publication year": 2013,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.16.1.243.pdf",
            "Abstract": "This paper presents empirical research results regarding the impact of Interaction Analysis (IA) graphs on groups of students collaborating through online blogging according to a “learning by design” scenario. The IA graphs used are of two categories; the first category summarizes quantitatively the activity of the users for each blog, hence permitting the comparison of the students’ activity level in a group, while the second category allows the comparison among different groups. The statistical analysis of the students’ interactions shows the significant impact of the graphs presence based on the number of posts and comments produced by the groups. Furthermore, the graphs of the first category (intra-group IA) have stronger impact than the graphs of the second (intergroup IA). The results support the general claim that interaction analysis is an important component of self-regulation in computer supported …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:aqlVkmm33-oC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Collaboration activity function: an interaction analysis tool for supported collaborative learning activities",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357402/",
            "Abstract": "During the last years, an increased interest has been observed on tools analyzing collaborative interactions that could be useful for researchers, teachers, or even students. The paper presents such a tool, based on the formally defined collaborative activity function (CAF). The empirical evaluation of CAF is also presented. The evaluation is focused on teachers using CAF during and after sessions of synchronous collaborative problem solving among students.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vers des outils d’Analyse des Interactions pour l’Assistance Metacognitive des Participants aux Forums de Discussion",
            "Publication year": 2005,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2017/07/3-adimitr-talk-amiens-forum-symposium.pdf",
            "Abstract": "ModellingSpace - Concertation meeting 3-4/09/2001 Page 1 LTEE Laboratory, University of \nAegean www.rhodes.aegean.gr/LTEE SYMFONIC SYMPOSIUM AMIENS, 20-22 Janvier, \n2005 Angelique Dimitracopoulou Learning Technology and Educational Engineering \nLaboratory University of the Aegean, Greece www.rhodes.aegean.gr/LTEE Vers des Outils d’Analyse \ndes Interactions pour l’Assistance Metacognitive des Participants aux Forums de \nDiscussion Vers des Outils d’Analyse des Interactions pour l’Assistance Metacognitive des \nParticipants aux Forums de Discussion Page 2 LTEE Laboratory, University of Aegean www.rhodes.aegean.gr/LTEE \n⇨… Structure I) ⇨ La voie d’Analyse des Interactions pour assister aux participants II) ⇨ \nConsiderations theoriques III) ⇨ Assister aux ‘etudiants’: metacognition ⇨ Assister aux ‘enseignants’: \ncognition et metacognition ⇨ Etude de cas similaire IV) ⇨ Cadre conceptuel: d…",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced Distance Learning Systems. A technical approach using MS SharePointTM Portal Server",
            "Publication year": 2003,
            "Publication url": "https://www.actapress.com/PDFViewer.aspx?paperId=14907",
            "Abstract": "ADVANCED DISTANCE LEARNING SYSTEMS. A TECHNICALAPPROACH USING MS \nSHAREPOINTTM PORTAL SERVER Tharrenos Bratitsis Electrical Engineer- Computer Scientist, \nPostgraduate Student, University of the Aegean, Rhodes, Greece bratitsis@aegean.gr George \nHenry Hlapanis Informatics Teacher, Computer Scientist, Postgraduate Student, University of \nthe Aegean, Rhodes, Greece hlapanis@aegean.gr Angelique Dimitracopoulou Associate \nProfessor, Learning Technology and Educational Engineering Laboratory, University of the \nAegean, Rhodes, Greece adimitr@aegean.gr ABSTRACT An inspection of existing Distance \nLearning Systems (DLS) is firstly attempted within this paper in order to point out drawbacks \narising when implementing sophisticated learning models. Thereafter a DLS based on the MS \nSharepointTM Portal Server (SPS) software is proposed, which provides several means in …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative learning environment and Modelling Activities in primary and secondary education: The ModellingSpace Project",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Angelique-Dimitracopoulou/publication/338924407_COLLABORATIVE_LEARNING_ENVIRONMENT_AND_MODELLING_ACTIVITIES_IN_PRIMARY_AND_SECONDARY_EDUCATION_THE_MODELLINGSPACE_PROJECT/links/5e333123299bf1cdb9ff36ce/COLLABORATIVE-LEARNING-ENVIRONMENT-AND-MODELLING-ACTIVITIES-IN-PRIMARY-AND-SECONDARY-EDUCATION-THE-MODELLINGSPACE-PROJECT.pdf",
            "Abstract": "Faster networking technologies are allowing us to build wider and more effective communities for collaborative learning. Technology-based modelling environments have enhanced the pedagogical possibilities for learning activities. However, most of the available modelling systems usually support very specific types of modelling, and the vast majority are not appropriate for young children. MODELLINGSPACE is a project funded by the IST program of the European Commission that explores the pedagogical possibilities of modelling activities in actual schools. This paper presents some MODELLINGSPACE tools and functions, typical use-scenarios of modelling and collaborative modelling within the classroom; addressed to students 11-16 years old, as well as an outline of the main current research results.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer Supported Collaborative Learning Practices - CSCL2009 Community Events Proceedings",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:fPk4N6BV_jEC",
            "Publisher": "ISLS, ISBN: 978-1-4092-8598-4, distributed via LuLu.com & Amazon"
        },
        {
            "Title": "Towards open object-oriented models of collaborative problem solving interaction",
            "Publication year": 2002,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2020/01/adimitr-avouris-komis-feidas-Workshop-on-Models.pdf",
            "Abstract": "Usually analysis of collaborative problem solving situations is done through discourse analysis or interaction analysis, where in the centre of attention are the actors involved (students, tutors etc.). An alternative framework, called “Objectoriented Collaboration Analysis Framework (OCAF) is briefly presented here, according to which the objects of the collaboratively developed solution become the centre of attention and are studied as entities that carry their own history. This approach produces a view of the process, according to which the solution is made of structural components that are ‘owned’by actors who have contributed in various degrees to their development. OCAF is based on both actions and dialogues of actors and allow deriving further qualitative as well as quantitative indicators of both solution quality and collaboration. Web-based tools supporting the OCAF approach are discussed. These tools are designed to be open in possible adaptations and able to be linked to various collaborative systems supporting diagrammatic problem solving.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer based interaction analysis supporting self-regulation: Achievements and prospects of an emerging research field",
            "Publication year": 2007,
            "Publication url": "http://ltee.aegean.gr/adimitr/wp-content/uploads/sites/8/2017/07/Dimitracopoulou_CELDA_2007_IA_invited_talk.pdf",
            "Abstract": "Computer based Interaction Analysis supporting Self-regulation: achievements and \nprospects of an emerging research field Compute Page 1 Computer based Interaction \nAnalysis supporting Self-regulation: achievements and prospects of an emerging research \nfield Computer based Interaction Analysis supporting Self-regulation: achievements and \nprospects of an emerging research field Αngelique Dimitracopoulou Learning Technology \nand Educational Engineering Lab University of the Aegean IADIS, CELDA 2007 Algarve, \nPortugal, 7-9 Dec. 2007 Page 2 2 LEARNING TECHNOLOGY AND EDUCATIONAL \nENGINEERING LABORATORY www.LTEE.gr/adimitr Field Purpose & field sources The \nPerspectives of the IA field The field’s Main Concepts Three Examples of Case studies on IA \ntools’ usages The Achievements of the IA field Research dimensions and research \nquestions IA indicators, IA tools, IA tools’ , Page …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Expérimentations sur l’utilisation d’un logiciel de modélisation par petits groupes d’élèves",
            "Publication year": 2001,
            "Publication url": "https://www.persee.fr/doc/stice_1265-1338_2001_num_8_1_1527",
            "Abstract": "modeling, problem solving, quantitative and semi-quantitative modeling, qualitative, interface, ergonomic aspects, learning environments, environnements d’apprentissage, modélisation, aspects ergonomiques, interface, modélisation qualitative, semi-quantitative et quantitative, résolution de problèmes",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Persée-Portail des revues scientifiques en SHS"
        },
        {
            "Title": "Interaction analysis and visualization for asynchronous communication: analysis methods, tools and research questions",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/pdf/10.5555/1599503.1599581",
            "Abstract": "Topic: Automatic and semi-automatic methods and tools providing indicators and multiple visualizations and views, that could support self-regulation and/or moderation purposes. Focus on Interaction Analysis (IA) tools that analyse asynchronous and content oriented communication and collaboration tools, such as forums, discussion lists, wikis, and blogs.Currently, there are IA tools that provide a variety of IA indicators such as participation and interaction oriented indicators, content analysis indicators, and mixed approaches. There are also IA tools that provide interface alternatives in CMC tools (eg alternative reading views in forums). Moreover, there are IA tools that are directly linked to a specific learning environment (eg a specific forum) or others that are independent of them; recently some methods are designed so as to be open to every kind of interaction data. Goal: To achieve a consensus on IA tools’ basic …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AN ADVANCED\" E-LEARNING COMMUNITY\" PROPOSAL USING MS SHAREPOINTTM PORTAL SERVER",
            "Publication year": 2003,
            "Publication url": "https://eden-europe.eu/wp-content/uploads/2016/05/Annual_2003-Rhodes_Proceedings.pdf#page=156",
            "Abstract": "In order to implement e-learning, quite often simple Internet technologies are used, usually without any clear pedagogical approach. Unfortunately this is not quite effective, it restricts learners’ exchanges, while influence the quality of resulted knowledge construction. More sophisticated environments are needed when we vision e-learning as taken place in a rich and flexible Learning Community context, for young students or even for adults and professionals. Our proposal consists of an Electronic Learning Community (eLC) that can be nested in a Web-based system using MS SharepointTM Portal Server advanced features. Such a solution could provide several means in order to overcome problems and difficulties that inevitably occur in a system as complex and sophisticated as that.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proposing\" collaborative filtering\" to foster collaboration in ScratchR community.",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZnAfAwAAQBAJ&oi=fnd&pg=PA168&dq=info:n8NS2ca1QAIJ:scholar.google.com&ots=pkVSQJOb_0&sig=cuS9IIXaXWRC0bpXldMrb_ENuwQ",
            "Abstract": "The present work focuses the interest of study in a naturally emerged and intense online community, this of ScratchR “programmers by choice” community, that actually practice collaborative learning in an authentic way. Our interest is not to support collaborative learning process, but to foster collaboration opportunities. We propose a personalized recommendation system based on a “collaborative filtering” technique aiming at inciting collaboration and increasing the frequency of Scratch projects remixing, in order to foster collaborative learning. In this paper the proposed collaboration fostering mechanism is outlined with the assistance of a test data set. The significance of the proposal is discussed while the future work is described.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enrichir les interfaces de forums par la visualisation d’analyses automatiques des interactions",
            "Publication year": 2006,
            "Publication url": "https://www.persee.fr/doc/stice_1952-8302_2006_num_13_1_942",
            "Abstract": "content analysis, forum tools design, interaction analysis tools, metacognition, self regulation, educational context, hypertext, analyse de contenu, métacognition, autorégulation, situations d’apprentissage, hypertexte, Conception d’outils de forum, outils d’analyse des interactions",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:738O_yMBCRsC",
            "Publisher": "Persée-Portail des revues scientifiques en SHS"
        },
        {
            "Title": "Successful e‐courses: the role of synchronous communication and e‐moderation via chat",
            "Publication year": 2006,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/10650740610674184/full/html",
            "Abstract": "This study investigates: what kind of e‐moderation is more effective in the formation of successful web‐based courses, and the essential characteristics of synchronous communication (SC) that have a positive contribution in the formation of successful courses.The previously mentioned issues investigated a five‐month learning experiment that took place in the context of an e‐learning community consisting of 18 e‐courses dedicated for primary and secondary school teachers. About 59 school teachers participated in this community as trainees, 23 professionals as trainers and two professionals as moderators. In terms of methodology this research can be characterized as a case study. Various data (quantitative and qualitative) were collected from both trainers and trainees regarding the teaching and learning which took place within the context of e‐learning community …",
            "Abstract entirety": 0,
            "Author pub id": "vjVYyXwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "A study on user's perception in e-learning security and privacy Issues",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6268044/",
            "Abstract": "Researchers have proven with both theoretical and empirical studies that technologies could enhance learning. Meanwhile, technologies could also create barriers to the latter. Particularly, when the use of technologies causes security and privacy concerns, E-learning becomes less fruitful as the participants are too afraid to be exposed by what has been provided to help them learn in the first place. This paper presents a study on user's perception in using E-learning technologies and the relevant issues. The major contribution of this paper is the awareness-raising of security and privacy issues, which are often overlooked in the research efforts that implicate user tracking and personal data usage for instructional purposes.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The impact of interaction analysis graphs on groups during online collaboration through blogs according to the\" learning by design\" scenario",
            "Publication year": 2011,
            "Publication url": "https://45.55.127.102/handle/1/2536",
            "Abstract": "This paper presents empirical research results about the impact of Interaction Analysis (IA) graphs to groups of students collaborating through online blogging according to a “learning by design” scenario. The IA graphs used are of two categories, the first category summarizes quantitatively the activity of the users for each blog permitting the comparison of students’ activity level in a group while the second category permits the comparison among different groups. The statistical analysis of the students’ interactions shows significant impact of the graphs presence to the number of posts and comments produced by the groups. Furthermore the graphs of the first category (intra-group IA) have stronger consequences than the graphs of the second (intergroup IA). The results support the general claim that interaction analysis is an important component for self regulation in computer supported collaborative learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:k_IJM867U9cC",
            "Publisher": "International Society of the Learning Sciences"
        },
        {
            "Title": "State of the art on interaction analysis: Interaction analysis indicators",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=3663478737552653133&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of real and virtual experiments in science learning",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64642",
            "Abstract": "Learning science requires understanding of concepts and formal relationships, a process that has often proved difficult for students. Numerous experiments for use in physics instruction are provided using different pedagogical tools. The paradigm described here adopts a socio-constructivist approach, where the student takes an active role in the construction of his knowledge, and it exploits three different media: a video in order to motivate students’ interest; objects from everyday life for the experiments; the technology-based learning environment “ModellingSpace”, which emphasize qualitative understanding, semi-quantitative understanding, requiring written explanations and cooperative learning. Results shows that the use of three media is essential in order to advance the reasoning of students in greater depth and pass to formal thought. The realisation of experiments in computer is not contrary to reality, but can supplement it.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "University of Zilina"
        },
        {
            "Title": "Design principles for an open and wide MODELLINGSPACE of modelling, collaboration and learning",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64480",
            "Abstract": "The aim of the paper is to present and discuss the main design concepts and principles, for a collaborative modeling environment for sciences and mathematics (MODELLINGSPACE). It incorporates various representational formalisms, allows synchronous and asynchronous collaboration among students and supports teachers. The main design principles and related issues under discussion concern certain central design questions such as: what must be the main modeling primitives when addressed to young students 11-16 years old, in a wide range of cognitive possibilities? In what specific ways support students reasoning applying rich visualizations and multiple representations? How to assure flexible main collaborative actions and communications and how to support related learning community needs? The paper approaches equally important questions such as how to support selfregulation and metacognitive development for students and how to assure teachers needs accomplishment when working in typical real schools conditions?",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Learning environments and Usability: Appropriateness and complementarity of evaluation methods",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.453.6624&rep=rep1&type=pdf",
            "Abstract": "Technolog-based learning environments are a specific kind of software. In this paper we initiall briefly examine some often overlooked factors that are related to the usabilit y of educational software. Then, evaluation methods are examined in relation to the overall design-development cycle. It is argued that most of the methods are complementary and may be used in different phases of a specific lear ning environment development. It is also argued that some methods are crucial to use for formative evaluation. Finall some research approaches, appropriate for interface design and evaluation of innovative environments are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interaction analysis supporting participants during technology based collaborative activities",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=10372826522605625619&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "vjVYyXwAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        }
    ]
}]