[{
    "name": "Αθανάσιος Τζιμογιάννης",
    "romanize name": "Athanasios Tzimogiannis",
    "School-Department": "Κοινωνικής & Εκπαιδευτικής Πολιτικής",
    "University": "uop",
    "Rank": "Καθηγητής",
    "Apella_id": 5404,
    "Scholar name": "Athanassios Jimoyiannis",
    "Scholar id": "-rBR13oAAAAJ",
    "Affiliation": "Professor, University of Peloponnese",
    "Citedby": 3130,
    "Interests": [
        "e-learning",
        "Web 2.0",
        "ICT in education",
        "MOOCs",
        "computer science education"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=-rBR13oAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Secondary education students’ difficulties in algorithmic problems with arrays: An analysis using the SOLO taxonomy",
            "Publication year": 2017,
            "Publication url": "http://earthlab.uoi.gr/ojs/theste/index.php/theste/article/view/238",
            "Abstract": "Developing students’ algorithmic and computational thinking is currently a major objective for primary and secondary education in many countries around the globe. Literature suggests that students face at various difficulties in programming processes, because of their mental models about basic programming constructs. Arrays constitute the first data structure students have to cope with in introductory programming courses. This paper presents the results of an empirical study on secondary education students’ misconceptions and mental representations of the array data structure. Students’ responses to written tasks regarding short code segments were mapped to the different levels of the SOLO taxonomy, in order to identify how students use arrays to solve programming problems. The analysis of the results showed that the majority of the students tended to manifest responses assigned to the lower SOLO levels, ie prestructural, unistructural and multistructural. The findings indicate that many students in the sample had incomplete or faulty representations of the array concept, which seem to be connected to their misconceptions about the programming variable concept.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying and Promoting Best Practice in Virtual Campuses and E-Learning",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/28497/",
            "Abstract": "Implementing learning solutions in diverse environments can be very challenging due to a range of organisational, cultural, technological and pedagogical issues. This is particularly the case in relation to the development and implementation of virtual campus projects and initiatives in which courses are often provided to students across international boundaries and cultures. This roundtable will report on the work of a European Commission DG Education and Culture co-financed project ‘Promoting Best Practice in Virtual Campuses’ which is aimed at providing a deeper understanding of the key issues and success factors underlying the implementation of virtual campuses and e-learning. The roundtable will explore through interactive debate a model of key issues underpinning best practice in virtual campuses and e-learning.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:_kc_bZDykSQC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Adult educators and learners' perceptions and experiences of digital literacy: The case of the Second Chance Schools in Greece.",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:4TOpqqG69KYC",
            "Publisher": "EERA"
        },
        {
            "Title": "Examining teachers’ beliefs about ICT in education: Implications of a teacher preparation programme",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13664530701414779",
            "Abstract": "The survey presented in this article examines current teachers’ beliefs and attitudes towards information and communication technologies (ICT) in education. A total of 1165 primary and secondary education teachers participated in the study, immediately after following a training programme on basic ICT skills. The authors’ results showed that the majority of the teachers in the sample have positive attitudes towards the training programme they attended, the general role that ICT can play in education and the integration of ICT in the educational process. The authors’ findings also revealed some parameters that interfere negatively, thus making many teachers cautious of or sceptical about ICT integration in educational practice. Multivariate analysis identified three groups of teachers that exhibited a consistent approach: a group of teachers having positive attitudes towards the items of the research, a second group …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Learning about Europe through educational gaming",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03098265.2020.1803816",
            "Abstract": "This paper explores the contribution to geography teaching which can be made by serious games. We describe the ways in which gaming has progressed from “dissected maps” and jigsaws through board games, to the range of online games which are available today. We describe the development, in conjunction with European partner institutions, of a new game, entitled RU EU?, intended to raise student awareness of European issues, notably the question of European identity; this seems to be both important and topical at the time of Brexit. We describe the development and the nature of the game and its launch, and the feedback which we have received from students who have played it, and suggest that, while it is not necessarily a substitute for traditional lecture-style teaching, games such as this can provide an additional tool in the geography lecturer’s armoury.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:u9iWguZQMMsC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Dave: A dynamic algorithm visualization environment for novice learners",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561697/",
            "Abstract": "Acquiring knowledge about algorithms and programming skills is a difficult and complex process in particular. Various algorithm visualization systems have been developed, using animation techniques to illustrate the behavior of basic algorithms, to facilitate studentspsila learning and skills development. This paper presents DAVE, an interactive dynamic algorithm visualization system for the introductory lessons in algorithm design and programming. DAVE allows studentspsila experimentation not only with sample algorithms, constructed by the designer, but, mainly, with the automatic animation of their own algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MOOCs for teacher professional development: investigating views and perceptions of the participants",
            "Publication year": 2015,
            "Publication url": "https://www.academia.edu/download/40212051/Paper_ICERI_2015.pdf",
            "Abstract": "Massive Open Online Courses (MOOCs) are currently one of the most debated and dynamically evolving e-learning topics with regards to application in practice, research and development. This paper reports on the implementation of a MOOC designed to support primary education teachers’ development in using Web-based tools in their instruction. The findings of an empirical post-course investigation indicated that the MOOC presented helped teachers to acquire the knowledge and skills to integrate Web tools in their classroom. The great majority of the teachers attending this MOOC were satisfied of their participation and the key course design and implementation issues, and they reported that this program had a positive impact to their professional development. The paper concludes with suggestions for further research and analysis of teachers’ learning in MOOCs designed to support teacher professional development.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social network analysis of students' participation and presence in a community of educational blogging",
            "Publication year": 2013,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17415651311326428/full/html",
            "Abstract": "The purpose of this paper is to report on an investigation of university students' participation and learning presence in a blogging activity, designed to support collaborative learning. There are three main reasons justifying the current research: to better understand the structure and the dynamics of students' blogging subgroups; to reveal students' patterns of engagement and their roles within the blogging community; and to evaluate the applicability of social network analysis (SNA) in studying students' performance and learning presence in educational blogs.The design of students' blogging activities was rooted on the ideas of authentic learning and followed a project‐based learning philosophy. Data analysis used methods of SNA to reveal collaborative aspects of students' engagement, the different roles undertaken by the students and the structure of the community …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Developing a framework for best practice in sustainable virtual campuses",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJNVO.2009.02739",
            "Abstract": "Despite the significant investment and growth both in Europe and globally in the development of virtual universities and virtual campuses over the last decade, there have been a number of high-profile projects and initiatives that failed to achieve their intended goals. If such failures are to be avoided in the future, then it is vital that a better understanding of best practice within virtual universities and virtual campuses is achieved. This paper reports on the work of a European Commission Education Audiovisual & Culture Executive Agency (EACEA) co-financed project 'Promoting Best Practice in Virtual Campuses' (PBP-VC), which is aimed at providing a deeper understanding of the key issues and success factors underlying the implementation of virtual campuses. The paper will outline a tentative model of the issues underpinning best practice in virtual campuses which covers areas that include organisational …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Collaboration and community building in an on-line teacher community of learning: A social network analysis",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/303898170_Collaboration_and_community_building_in_an_on-line_Teacher_Community_of_learning_A_Social_Network_Analysis/links/575bb74208aec91374a628f1/Collaboration-and-community-building-in-an-on-line-Teacher-Community-of-learning-A-Social-Network-Analysis.pdf",
            "Abstract": "This paper presents an investigation of teachers’ engagement and collaboration toward building a Teacher Community in the context of a blended post-graduate course about e-learning and ICT in education. The design of both pedagogical and technological dimensions of the teacher community framework are presented. Research data were analysed using Social Network Analysis methods and revealed important information regarding critical indicators of interaction and collaboration among participants and the whole community performance. Conclusions are drawn for future development and research about on-line teacher communities.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TPACK 2.0",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=jAYoDwAAQBAJ&oi=fnd&pg=PA83&dq=info:E1ZmqrPyA60J:scholar.google.com&ots=dSTkd0wtkk&sig=lcGQ-Ca-WHKF7SqwkqOJd6KvM7Q",
            "Abstract": "Since its formal introduction as a theoretical concept, Technological Pedagogical Content Knowledge (TPACK) has been transformed into a robust framework to support ICT integration in practice by allowing instructional designers, teachers and teacher educators to focus upon the connections among Technology, Content, and Pedagogy in real instructional-learning contexts. Web 2.0, on the other hand, has received in the last decade intense and growing educational and research interest. The key idea, upon which the educational Web 2.0 is built, is the wide range of affordances incorporated that transform both Pedagogy (Pedagogy 2.0, ie, selfdirected, reflective and community learning) and Content (Content 2.0, ie, shared and learner-generated content). This chapter presents TPACK 2.0, as a promising framework a) to guide learning design and teacher preparation programs and b) to promote Web 2.0 integration in curriculum and classroom settings by harnessing their learner-centered, participative and social networking characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IAP"
        },
        {
            "Title": "Research on e-Learning and ICT in Education",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-s7b3Vq0xtIC&oi=fnd&pg=PR8&dq=info:hfpo3K457ioJ:scholar.google.com&ots=w2ELaqbrAr&sig=-PS4BdCKusXYD2aKkQfVoZN_DZI",
            "Abstract": "This book aims to serve as a multidisciplinary forum covering technical, pedagogical, organizational, instructional, as well as policy aspects of ICT in Education and e-Learning. Special emphasis is given to applied research relevant to educational practice guided by the educational realities in schools, colleges, universities and informal learning organizations. In a more generic scope, the volume aims to encompass current trends and issues determining ICT integration in practice, including learning and teaching, curriculum and instructional design, learning media and environments, teacher education and professional development, assessment and evaluation, etc.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "An investigation into the educational affordances of blogs and wikis",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=9401425494714335991&hl=en&oi=scholarr",
            "Abstract": "A blog (weblog) is a frequently updated website consisting of dated entries, in text and multimedia format. In general, a blog is a publishing platform that offers a two way communication (read-write) to its users. It includes hyperlinks to other websites, blogs or other online content resources across the Internet, content organization tools easily customizable in terms of user needs, and many more features.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:Zph67rFs4hoC",
            "Publisher": "European Resource Center for Web"
        },
        {
            "Title": "Developing a computer science teacher community in greece: Design framework and implications from the pilot",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/255686932_Developing_a_Computer_Science_Teacher_Community_in_Greece_Design_framework_and_implications_from_the_pilot/links/568c013408ae71d5cd04a63e/Developing-a-Computer-Science-Teacher-Community-in-Greece-Design-framework-and-implications-from-the-pilot.pdf",
            "Abstract": "This paper reports on the design and the implementation of a Computer Science Teacher Community in Greece. The pedagogical and technological dimensions of the teacher community design framework are presented in detail. The architecture of a new platform developed to support the teacher community and the community tools and features it incorporates are also outlined. Finally, first findings of the pilot phase regarding interaction, cooperation, educational support and development of the participating teachers are presented. Conclusions are drawn for future development and research regarding teacher communities.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:-f6ydRqryjwC",
            "Publisher": "IATED"
        },
        {
            "Title": "Using a Web-Based Environment to Enhance Vocational Skills of Students with Autism Spectrum Disorder",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95059-4_23",
            "Abstract": "This chapter presents an investigation on the effectiveness of Pre-Vocational Skills Laboratory (PVS-Lab), a Web-based learning environment designed to enhance pre-vocational and employment skills of students with autism spectrum disorders. Five adolescents-young adults participated in an intervention consisted of a series of individualized sessions. The experimental design followed a single-subject approach and multiple sources of information (system log files, psychophysiological data, video recordings of students’ actions, and tutors’ observation notes) were used in combination. The results indicated a continuous improvement in students’ performance along the timeline of the intervention, in terms of response accuracy and task completion time. However, in some cases, students exhibited fluctuations in their performance which were related to their difficulties to recall visual and spatial information.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The development of models for identifying and promoting best practice in e-learning and Virtual Campuses",
            "Publication year": 2008,
            "Publication url": "https://research-portal.uws.ac.uk/en/publications/the-development-of-models-for-identifying-and-promoting-best-prac",
            "Abstract": "This paper explores a number of key issues that have been identified as being important in the identification and evaluation of best practice within the context of e-learning and virtual campuses. The'Promoting Best Practice in Virtual Campuses'(PBP-VC) project is a two year European Commission Education Audiovisual and Culture Executive Agency (EACEA) co-financed project that is aimed at providing a deeper understanding of the key issues and success factors underlying the implementation of virtual campuses and e-learning. The PBP-VC project team have been working with stakeholders from a number of large virtual campus projects across Europe in identifying and exploring key issues relating to best practice. The importance of developing a practical framework for identifying, evaluating and promoting best practice in virtual campuses and e-learning can be demonstrated by the significant number of high profile e-learning and virtual campus failures both within Europe and globally, In many cases their failure has been quite spectacular with millions pound being wasted as a result some quite basic errors in overlooking key best practice issues that have occurred across several large-scale projects. This paper will provide a description of the different elements comprising models for best practice that has been developed by the PBP-VC project.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Academic Conferences and Publishing Limited (ACPIL)"
        },
        {
            "Title": "Towards the development of a framework for promoting best practice in virtual campuses",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/33907082/EADTU_2007.pdf",
            "Abstract": "Despite a significant growth in the development of virtual campuses (VCs) across the EU in recent years, the findings from a European Commission DG Education and Culture workshop in 2005 on VCs highlighted a number of concerns relating to VC projects and initiatives across the EU. It was felt that many VCs suffered from a low profile resulting in little support at senior levels, thus hampering their development, as well as having very little contact and interoperability with each other. If eLearning and VC initiatives are to be sustainable within the European Union, then it is vital that stakeholders understand how new models of teaching and learning transform the institution and how they can be used to enhance the flexibility and inclusiveness of the European education system. This paper reports on the work of a European Commission DG Education and Culture co-financed project PBP-VC Promoting Best Practice in Virtual Campuses which is aimed at providing a deeper understanding of the key issues and critical success factors underlying the implementation of VCs. The paper will outline a tentative model of issues underpinning best practice in VCs derived from an initial literature based investigation of existing VC initiatives within Europe. In addition, the project is working towards developing a practical framework to help guide the process of creating best practice in VCs, as well as raising awareness of issues and approaches to creating sustainable VCs.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Linking Learning Outcomes and Game Mechanics in the Early Stages of the RU EU? Project",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=KPeFDwAAQBAJ&oi=fnd&pg=PA191&dq=info:mg4NUKp0OXUJ:scholar.google.com&ots=KGaFE4tKIm&sig=2lwikuo-tFhqkTgY9kN4qJ7USvo",
            "Abstract": "The issue of national and European identity is driving many of the issues that are currently of concern to European citizens. The Erasmus+ funded RU EU? project aims to develop an innovative online game, the RU EU? game, that will help students across Europe to develop a better understanding of their own National and European identity and values, as well as those of others, and to challenge them about their attitudes and prejudices by tackling problem solving dilemmas relating to identity. It is hoped that the game will provide an engaging platform for young Europeans to confront some of the complex and confusing issues surrounding National and European identity at a time of change and increasing tension across Europe. This paper describes the early stages of the game design and focuses on characterizing the learning outcomes and game mechanics for the RU EU? game and bringing these together.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Educational blogging: Developing and investigating a students’ community of inquiry",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-1083-6_13",
            "Abstract": "The study presented in this is paper reports on the investigation of students’ engagement in an educational blog established as a project-based learning environment. Twenty-one secondary education students (aged 15 years), coming from two separate K-9 classes, were involved in this learning activity and the research reported. Using the Community of Inquiry (CoI) framework, the analysis of the content posted shed light into the multiple ways of students’ engagement into the blog learning space, namely their social and cognitive presence that supported the development of a CoI. The results suggested that the students in the sample achieved higher cognitive levels through enhancing their communication and collaboration skills, and their analytical and critical thinking as well.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Dissemination of the VCSE model for virtual mobility",
            "Publication year": 2008,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02511026/",
            "Abstract": "The Virtual Campus for a Sustainable Europe is a network of European universities experienced in e-learning and education for sustainable development who believe in the wealth of opportunities for learners and teachers engaged in e-learning across disciplinary and cultural boundaries. The VCSE shares high quality, inter-disciplinary and trans-disciplinary e-courses on sustainability issues for university students.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Examining primary education teachers’ perceptions of TPACK and the related educational context factors",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/15391523.2019.1666323",
            "Abstract": "The study presented in this paper was designed to examine Greek primary education teachers’ perceptions of their knowledge and skills with regards to the integration of ICT in their instructional practices. By adopting the Technological Pedagogical Content Knowledge framework, we developed an extended TPACK scale, including two sub-constructs, i.e., a) the Educational Context and b) teachers’ self-assessment of TPACK abilities. The analysis of the results showed that the participants appear to believe that they have a good level of knowledge with regards to the primary TPACK domains, i.e., content, pedagogy and technology. However, most teachers perceived them separately and were not able to integrate their TPACK knowledge in order to design and implement meaningful ICT-based interventions in their classroom practice. Statistically significant differences were recorded in relation to teachers’ factors, i …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:P5F9QuxV20EC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Concept mapping as cognitive tool in science education: An analysis of students’ learning using SOLO taxonomy",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/327252136_Concept_mapping_as_cognitive_tool_in_science_education_An_analysis_of_students'_learning_using_SOLO_taxonomy/links/5b8432fc299bf1d5a72b6faa/Concept-mapping-as-cognitive-tool-in-science-education-An-analysis-of-students-learning-using-SOLO-taxonomy.pdf",
            "Abstract": "This paper presents an exploratory study on the use of concept mapping as a cognitive tool in K-6 science education. The design of an instructional sequence with concept mapping activities, in the topics of human respiratory and circulatory systems, is also presented. Qualitative research data was collected in the form of students’ concept maps developed by using both the ‘paper and pencil’method and concept mapping software. The content and structure of students’ concept maps were analysed according to the levels of the Structure of the Observed Learning Outcomes (SOLO) taxonomy. The analysis revealed promising results regarding students’ learning evolution during the instructional sequence. The paper concludes that concept mapping is an effective learning strategy that could be integrated into the primary science classroom.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy Logic-Based Modeling in Collaborative and Blended Learning",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=1284084806907668685&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IGI GLOBAL"
        },
        {
            "Title": "Factors determining teachers’ beliefs and perceptions of ICT in education",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/factors-determining-teachers-beliefs-perceptions/13375",
            "Abstract": "In this article the factors involved in the uptake of ICT by the teachers and the schools are examined. The focus of our argumentation is that teachers constitute a critical factor in the attempt to integrate technology in the classroom but they are not appropriately prepared for that undertaking. An extensive review of the literature associated with teachers’ views and perceptions of ICT in education is presented. Finally, we conclude debating on the demand of a new curriculum and a new pedagogical framework, both based on and enhanced by the new environments and tolls ICT offer in education.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:qjMakFHDy7sC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Students’ engagement and peer interaction in on-line academic writing through a course blog",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_8",
            "Abstract": "Academic writing is considered one of the most critical competencies that university students need to develop and constitutes an integral part of contemporary educational programs in higher education. This paper presents an analysis of students’ engagement in online academic writing associated with inquiry and peer interaction practices through a course blog. The intervention was designed in the context of a blended postgraduate course under the assumption that on-line writing in the course blog could promote students’ academic writing skills. The key aspects of student generated content, peer interaction and reflection in the course blog were directed by the principles of e-learning 2.0. Descriptive and Social Network Analysis revealed important information regarding individual students’ contribution, peer interaction and the network structure of a learning community that was emerging in the course blog.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Designing MOOCs for teacher professional development: Analysis of participants’ engagement and perceptions",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/321061445_Koukis_N_Jimoyiannis_A_2017_Designing_MOOCs_for_teacher_professional_development_Analysis_of_participants'_engagement_and_perceptions_In_A_Mesquita_and_P_Peres_Eds_Proceedings_of_the_16th_European_Con/links/5a0b29f9458515e482747f9d/Koukis-N-Jimoyiannis-A-2017-Designing-MOOCs-for-teacher-professional-development-Analysis-of-participants-engagement-and-perceptions-In-A-Mesquita-and-P-Peres-Eds-Proceedings-of-the-16th-Europea.pdf",
            "Abstract": "Massive Open Online Courses (MOOCs) are widely recognized as a new form for on-line learning while they have recently attracted interest with regards to teacher professional development. This paper reports on a study concerning a MOOC designed to support secondary education teachers’ development towards using Web 2.0 tools in language instruction. The principles that determined the particular MOOC design framework were directed by four dimensions of teachers’ participation: a) engagement and creativity, b) peer interaction, c) mutual support and d) collaboration. A total of 589 language teachers from secondary education schools were enrolled in this MOOC, which achieved high completion rates (62.5%). We used a mixed method that combines the analysis of a) participants’ engagement through platform records and b) teacher interviews’ transcripts. The results provided supportive evidence that the design framework was effective towards promoting teachers’ motivation, active engagement, peer interaction and support, and development of learning design abilities to integrate Web 2.0 in their classroom. In addition, the findings revealed teachers’ satisfaction with regards to the perceived value of this particular MOOC and their willingness to adopt MOOCs as an effective method for their professional development.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Serious Games as a Means to Promote Thinking about European Identity: A Case Study of the Design and Development of the RU EU? Game",
            "Publication year": 2021,
            "Publication url": "https://myresearchspace.uws.ac.uk/ws/files/29092716/2021_04_14_Terras_et_al_Serious_final.pdf",
            "Abstract": "The diversity of the EU is both a strength and a weakness, with Issues of National and European identity contributing to division, marginalization and exclusion. Many European citizens have very firmly entrenched, but frequently simplistic, views about the value of the European Union as good (pro EU) or bad (anti EU). To promote a culture of increased tolerance and inclusion, EU citizens need to develop a more mature and nuanced understanding of National and European identity that considers the validity of others’ points of view. Serious Games are increasingly recognised as active and effective methods for tackling complex social problems. Therefore, the RU EU?(are you EU?) project developed a game to increase players’ awareness of the complexity of European identity and values, to help players develop a more detailed understanding of European identity and promote critical thinking about their own views, the views of others, and the wider societal consequences. In this paper we describe the RU EU? Game as a case study explaining the thinking behind the game design. We outline the early design tasks that led to development of the multicomponent model of European identity that we used in the game, the adoption of the journalist narrative and the tools that assisted the player in his goal of compiling and publishing a set of articles about European identity. We discuss the potential of the game tools and mechanics to be used more widely to promote social understanding and inclusion.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual Campuses: A New Paradigm in E-Learning Widening Access to Higher Education",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/41922761/Virtual_Campuses_A_new_paradigm_in_e-lea20160202-3435-1500md.pdf",
            "Abstract": "This paper considers the increasing impact of Information and Communications Technologies (ICT) and eLearning practices and the associated rise in Virtual Campuses (VC) as a recognized and respected research area in the EU and around the world. The paper provides an outline of the key issues characterizing the VC paradigm. The paper will also report on the work of a European Commission DG Culture and Education and Culture co-financed project PBP-VC (Promoting Best Practice in Virtual Campuses) which is aimed at providing a deeper understanding of the key issues and critical success factors underlying the implementation of VCs. In addition, the project is working towards developing a practical framework to help guide the process of creating best practice in VCs, as well as raising awareness of issues and approaches to creating sustainable VCs.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:0EnyYjriUFMC",
            "Publisher": "ETPE"
        },
        {
            "Title": "Digital literacy and adult learners",
            "Publication year": 2015,
            "Publication url": "https://epale.ec.europa.eu/sites/default/files/digital_literacy_and_adult_learners.pdf",
            "Abstract": "Over the past decade, Information and Communication Technologies (ICT) have become more and more embedded in our everyday lives and they have produced rapid changes in society by fundamentally transforming the way people work, communicate and have access to information, government/public services, education and entertainment. Increasingly, a wide range of services, administration, businesses and citizenship processes are transferred online. In addition, ICT are perceived to be inherent to the reform efforts necessary for the 21st century society.Academics, researchers, educators, experts and policy officers, at international level, have acknowledged digital skills as one of the key competences for work force, lifelong development and active participation in social and economical life. The main argument is that people who can understand and effectively use digital means and facilities are significantly empowered and advantaged in terms of educational opportunities and success, professional development, employment prospects, civic participation and many other aspects of their personal and social life (eg public and social services, cultural and everyday practices, online shopping, social networking etc.).",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:b0M2c_1WBrUC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "In memoriam: David H. Jonassen",
            "Publication year": 2013,
            "Publication url": "http://earthlab.uoi.gr/ojs/theste/index.php/theste/article/viewFile/113/61",
            "Abstract": "David wrote a monumental collection of top-level research works that influence scholars, educators and students around the world. Over his outstanding academic career, David has published 37 books, 182 journal articles, and 67 book chapters and gave innumerable presentations and speeches in the United States and 28 countries around the globe. He received many scholarly awards, including awards for outstanding publications and books, the 2001 Presidential Service Award, and the Lifetime Achievement Award for Excellence in Research and Theory, both for Association for Educational Communications and Technology. Recently David was nominated and selected as a Fellow of the American Educational Research Association.Themes in Science and Technology Education was bound to Dave for his contribution as a distinguished member of the editorial board. In addition, David joined the Greek …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of students’ participation patterns and learning presence in a wiki-based project",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2013.863471",
            "Abstract": "The educational applications of wikis are becoming very popular among instructors and researchers and they have captured their attention and imagination. This paper reports on the investigation of a wiki project designed to support university students’ collaborative authoring and learning. The design framework of the wiki-based project is outlined and an analysis framework is proposed as the result of combining analysis of students’ collaborative actions, e.g. edits and posts in the wiki pages. The framework was applied to investigate students’ engagement, their contribution to the wiki content and the patterns of collaboration and content co-creation they followed during the project timeline. Our findings revealed different patterns of students’ contribution to their group wiki as well as their different roles. The paper concludes with suggestions for future development of the framework and research in the field of wiki …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Design and evaluation of a web-based dynamic algorithm visualization environment for novices",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050914000283",
            "Abstract": "Teaching basic algorithmic concepts to novices is not an easy task. Existing research has given considerable information about students’ alternative conceptions and faulty mental models about abstract programming concepts and constructs, as well as their difficulties in solving programming problems. Various algorithm visualization systems are proposed as alternative and efficient instructional environments for introductory programming courses. They include dynamic features, based on animation techniques, aiming at illustrating the behavior of basic algorithms and fostering students’ experimentation and algorithmic knowledge construction. This paper presents DAVE, a web-based dynamic algorithm visualization environment designed to support secondary education students’ learning about basic algorithms. DAVE facilitates students’ experimentation with array algorithms by allowing the modification of both …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:TFP_iSt0sucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Pedagogical and instructional design issues towards the integration of Web 2.0 tools in instruction-Implications of teachers' training pilot courses in Greece",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6088235/",
            "Abstract": "This paper presents the design and the implementation of a training course aiming to prepare teachers to effectively integrate Web 2.0 tools in their instruction. The program was established in the context of the Web 2.0 ERC project aiming at simplifying Web 2.0 for educational purposes. The model of Technological Pedagogical Content Knowledge and the Authentic Learning approach were the guiding principles that largely influenced the educational design of this teacher preparation program. This Web 2.0 instructional design framework is outlined in detail. The program outcomes and the described experience aim to offer insight into the developing programs that respond to teachers' training needs and effective preparation.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teachers’ performance within communities of learning: Investigating the role of community structure",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/303898171_Teachers'_performance_within_communities_of_learning_Investigating_the_role_of_community_structure/links/575bb79108ae414b8e467e32/Teachers-performance-within-communities-of-learning-Investigating-the-role-of-community-structure.pdf",
            "Abstract": "On-line learning communities constitute a dynamically evolving field at both levels, research-development and practical application. This paper reports on teachers’ performance in the context of two on-line communities with different organizational-functional characteristics, an open and a semi-structured one. The conceptual and operational dimensions of the teacher community design framework are presented in detail. The findings presented revealed important information regarding a) critical community indicators, eg participation, engagement, interaction, creativity and cohesion, and b) the role of community structure. The results provided supportive evidence that the structured community framework was effective towards promoting teachers’ engagement, interaction, ideas interchange, collaboration and knowledge sharing and co-creation. On the other hand, open community turned out to be centralised and evolving around the coordinator’s initiatives; the participants exhibited low rates of interaction and community presence. The paper concludes with suggestions for further research and analysis of teachers’ community learning and the different patterns of their community presence and contribution.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing a pedagogical framework for the design and the implementation of e-portfolios in educational practice",
            "Publication year": 2012,
            "Publication url": "http://earthlab.uoi.gr/ojs/theste/index.php/theste/article/view/110",
            "Abstract": "A theoretical framework for designing, implementing and researching students’ engagement, learning, and personal development in e-portfolios is described in this article. After providing an overview of the research on e-portfolios in education, the paper analyses the theoretical foundations of e-portfolio learning. Following it proposes a conceptual and organizational framework for teachers and instructors a) to conceptualize principles of student motivation, self-directed learning and reflection, and b) to implement effective e-portfolio learning initiatives at secondary and higher education, and teacher professional development. Finally, the article presents representative case studies and good practice examples regarding the implementation of e-portfolio initiatives using different tools in various educational contexts and programs.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Identification of Key Issues in the Development of Sustainable e-Learning and Virtual Campus Initiatives.",
            "Publication year": 2009,
            "Publication url": "https://eric.ed.gov/?id=EJ867113",
            "Abstract": "This paper explores a number of key issues that have been identified as being important in the identification and evaluation of best practice within the context of e-learning and virtual campuses. The ‘Promoting Best Practice in Virtual Campuses’(PBP-VC) project is a two year European Commission Education Audiovisual and Culture Executive Agency (EACEA) co-financed project that is aimed at providing a deeper understanding of the key issues and success factors underlying the implementation and sustainability of virtual campuses. The PBP-VC project team have been working with stakeholders from a number of large virtual campus projects across Europe in identifying and exploring key issues relating to best practice and sustainability. The importance of developing a practical framework for identifying, evaluating and promoting best practice in virtual campuses and e-learning can be demonstrated by the significant number of high profile e-learning and virtual campus failures both within Europe and globally. In many cases their failure has been quite spectacular with millions of dollars being wasted as a result some quite basic errors in overlooking key best practice issues that have occurred across several large-scale projects. This paper will provide a description of the different issues relating to models for best practice and sustainability that has been developed by the PBP-VC project.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:WF5omc3nYNoC",
            "Publisher": "Academic Conferences Limited. Curtis Farm, Kidmore End, Nr Reading, RG4 9AY, UK"
        },
        {
            "Title": "A framework for promoting best practice in virtual campuses: initial lessons from the PBP-VC Project",
            "Publication year": 2007,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00424146/",
            "Abstract": "Despite a significant growth in the development of virtual campuses (VCs) across the EU in recent years, the findings from a European Commission DG Education and Culture workshop in 2005 on VCs highlighted a number of concerns relating to VC projects and initiatives across the EU. It was felt that many VCs suffered from a low profile resulting in little support at senior levels, thus hampering their development, as well as having very little contact and interoperability with each other. If eLearning and VC initiatives are to be sustainable within the European Union, then it is vital that stakeholders understand how new models of teaching and learning transform the institution and how they can be used to enhance the flexibility and inclusiveness of the European education system. This paper reports on the work of a European Commission DG Education and Culture co-financed project PBP-VC Promoting Best Practice in Virtual Campuses which is aimed at providing a deeper understanding of the key issues and critical success factors underlying the implementation of VCs. The paper will outline a tentative model of issues underpinning best practice in VCs derived from an initial literature based investigation of existing VC initiatives within Europe. In addition, the project is working towards developing a practical framework to help guide the process of creating best practice in VCs, as well as raising awareness of issues and approaches to creating sustainable VCs.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Physics instruction in secondary schools: An investigation of teachers’ beliefs towards physics laboratory and ICT",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/02635140802037328",
            "Abstract": "This paper reports on the examination of physics teachers’ beliefs and perceptions of laboratory and ICT supported physics instruction. The findings indicate that the teachers in the sample were generally positive about the affordances offered by the physics lab and ICT in physics instruction. However, school culture context, mainly the need to cover the physics content in the mandated curriculum and to prepare the students for their examinations, constitutes a critical factor shaping teachers’ views about physics education in secondary schools. There are three discrete groups of physics teachers identified, which exhibited a rather consistent approach across the research items: (a) a group of traditional teachers, whose beliefs are dominated by rigorous presentation of the physics content while they are unwilling to incorporate laboratory and ICT‐based activities in their classroom practice; (b) a second one consisted …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Critical factors towards analysing teachers' presence in on-line learning communities",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1096751615000603",
            "Abstract": "On-line teacher communities constitute a very popular and dynamic field while they foster a new philosophy for professional development which is characterised as associative, constructivist, reflective, situated, collaborative, and connectivist. This paper reports on the design and the implementation of a learning community consisting of computer science teachers teaching in primary and secondary public schools (K–9), in Greece. The conceptual and the operational dimensions of the on-line community design framework are presented in detail. The architecture of an integrated platform, developed to support the teacher community, as well as the tools and the features it incorporates are also outlined. Finally, we present the findings of a pilot study concerning teachers' presence within the community as well as their views and perceptions of community learning. The results provided supportive evidence of the …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:NMxIlDl6LWMC",
            "Publisher": "JAI"
        },
        {
            "Title": "Linking Learning Outcomes and Game Mechanics in the Early Stages of the RU EU? Project",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11548-7_18",
            "Abstract": " The issue of national and European identity is driving many of the issues that are currently of concern to European citizens. The Erasmus+ funded RU EU? project aims to develop an innovative online game, the RU EU? game, that will help students across Europe to develop a better understanding of their own National and European identity and values, as well as those of others, and to challenge them about their attitudes and prejudices by tackling problem solving dilemmas relating to identity. It is hoped that the game will provide an engaging platform for young Europeans to confront some of the complex and confusing issues surrounding National and European identity at a time of change and increasing tension across Europe. This paper describes the early stages of the game design and focuses on characterizing the learning outcomes and game mechanics for the RU EU? game and bringing these …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:_xSYboBqXhAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "E-mentoring and novice teachers’ professional development: Program design and critical success factors",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/p/184346/",
            "Abstract": "In recent years, e-mentoring has received increased interest with regards to teachers’ professional development, since it offers new possibilities for teacher support and guidance from distance that overcome space and time constraints. It is also expected that e-mentoring creates an open, flexible, supportive and reflective environment for teachers collective development. This paper presents the design and the implementation of an e-mentoring program for primary education teachers with low teaching experience, which lasted eleven weeks. Eight mentors with high teaching experience and enhanced qualifications, provided guidance and support to eighteen in-service teachers. The whole initiative was supported by e-learning methods through Elgg on-line platform. Qualitative data were collected through interviews conducted with both, mentors and protégés, three weeks after the e-mentoring program was …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:yD5IFk8b50cC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Investigating participants' collaborative patterns in a MOOC for teacher professional development",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZMjBDwAAQBAJ&oi=fnd&pg=PA303&dq=info:IFkXo2G7X34J:scholar.google.com&ots=NNK1oXTbKQ&sig=6j04-aWFeS_eEGtKJ_xwtfasbsY",
            "Abstract": "This paper reports on a teacher professional development MOOC, designed to prepare Greek language teachers in secondary education schools towards designing and implementing collaborative writing activities in their classroom. Using a hybrid mode, a new design framework for MOOCs is proposed, organised along three dimensions of teachers’ learning activities: a) individual engagement, b) peer interaction and mutual support, and c) collaborative creation of educational artefacts. The pedagogical principles that determine the particular framework were authentic learning, case-study approach, peer-supported, collaborative and self-regulated learning. A mixed method of research data analysis was used regarding teachers’ engagement and their learning presence in the collaborative learning activities. The analysis showed that the present MOOC achieved high completion rate (57.6%). In addition, the results provided supportive evidence that the design framework was effective towards promoting teachers’ active engagement, peer interaction and support, as well as development of learning design abilities to integrate collaborative writing with Google Docs in their classroom.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:dshw04ExmUIC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Virtual campuses: a new paradigm in eLearning widening learning participation",
            "Publication year": 2008,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02511028/",
            "Abstract": "The paper presents the results of the analysis of the difficulties evidenced by the students while approaching some scientific disciplines (the ones the author has been teaching or involved with) and shows various kinds of these problems usually known as preconceptions, misconceptions or mental schemes in students' learning. The work describes then the strategies adopted to help students in overcoming their difficulties by using specific strategies built up with the help of the constructivistic paradigm. It analyzes soon after the experiences made by the author while using Web techniques to support his teaching activity and proposes the model of a special Web site where e-commerce techniques have been adopted. The paper ends with the description of the monitoring process of students' knowledge one can carry out with the above site by using the Data Base it's interfaced with and gives an outline of the possible knowledge paradigms this instrument leads to.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TPACK 2.0: Towards a framework guiding Web 2.0 integration in educational practice",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/292138937_TPACK_20_Towards_a_framework_guiding_Web_20_integration_in_educational_practice/links/56a9c94908aef6e05df2c2f7/TPACK-20-Towards-a-framework-guiding-Web-20-integration-in-educational-practice.pdf",
            "Abstract": "Since its formal introduction as a theoretical concept, Technological Pedagogical Content Knowledge (TPACK) has been transformed into a robust framework to support ICT integration in practice by allowing instructional designers, teachers and teacher educators to focus upon the connections among Technology, Content, and Pedagogy in real instructional-learning contexts. Web 2.0, on the other hand, has received in the last decade intense and growing educational and research interest. The key idea, upon which the educational Web 2.0 is built, is the wide range of affordances incorporated that transform both Pedagogy (Pedagogy 2.0, eg selfdirected, reflective and community learning) and Content (Content 2.0, eg shared and learner-generated content). This chapter presents TPACK 2.0, as a promising framework a) to guide learning design and teacher preparation programs and b) to promote Web 2.0 …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Information Age Publishing"
        },
        {
            "Title": "Towards a Design Framework of MOOCs for Teacher Development: Theoretical Issues and Analysis of Teachers' Achievements about Web 2.0 in Language Instruction.",
            "Publication year": 2020,
            "Publication url": "https://eric.ed.gov/?id=EJ1291202",
            "Abstract": "This paper reports on the development of a hybrid framework for designing and implementing teacher professional development MOOCs. The theoretical foundations were rooted on combining features of cMOOCs and xMOOCs that promote teachers’ learning through active engagement, peer interaction, mutual support, and collaborative creation of educational artefacts. The framework was applied in a MOOC designed to enhance language teachers’ technological and pedagogical knowledge in order to integrate Web 2.0 tools in their instruction. Using research data from a) a post-survey and b) the MOOC platform, we revealed important information regarding teachers’ outcomes as well as their perceptions of using the specific Web 2.0 tools in Greek language learning. The findings provided supportive evidence that the blended and collaborative features of this professional development MOOC were effective towards enhancing teachers’ achievements and strengthening their ability to design suitable educational interventions with Web 2.0 regarding language instruction in secondary schools.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Themes in eLearning. Web site: http://earthlab. uoi. gr/tel/index. php/themeselearn"
        },
        {
            "Title": "Towards an analysis framework for investigating students' engagement and learning in educational blogs",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1365-2729.2011.00467.x",
            "Abstract": "Educational blogs are currently gaining in popularity in schools and higher education institutions, and they are widely promoted as collaborative tools supporting students' active learning. However, literature review on educational blogging revealed a lack of a complete and consistent framework for studying and assessing students' engagement and the impact of blogging on students' learning. This study reports on the application of an analysis framework for evaluating blogging learning activities, based on two well‐documented models, those of Community of Inquiry (CoI) and Social Network Analysis. The framework proposed is examined through an empirical study involving 21 K‐9 students, coming from two classes, in Greece. This investigation shed light into the different ways of students' engagement in a blog‐based project, namely their social and cognitive presence that supported the development of a CoI …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Designing and implementing an integrated technological pedagogical science knowledge framework for science teachers professional development",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131510001545",
            "Abstract": "This paper reports on the design and the implementation of the Technological Pedagogical Science Knowledge (TPASK), a new model for science teachers professional development built on an integrated framework determined by the Technological Pedagogical Content Knowledge (TPACK) model and the authentic learning approach. The TPASK curriculum dimensions and the related course sessions are also elaborated and applied in the context of a teacher trainers’ preparation program aiming at ICT integration in science classroom practice. A brief description of the project, its accomplishments, and perceptions of the participants, through the lens of TPASK professional development model, are presented. This is followed by the presentation of the evaluation results on the impact of the program which demonstrates that science teachers reported meaningful TPASK knowledge and increased willingness to …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Beyond students’ perceptions: investigating learning presence in an educational blogging community",
            "Publication year": 2017,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/JARHE-06-2015-0046/full/html",
            "Abstract": "The purpose of this paper is to present an integrated framework for designing and investigating students’ engagement patterns and learning presence in educational blogs. The framework was grounded on the ideas of self-directed and reflective learning, and was applied to analyse students’ blogging activities in the context of an undergraduate course.The proposed research framework was organized along three dimensions: content artefacts, blogging processes and community building. With regard to the methodological tools used, this study integrates content analysis of students’ posts using the framework of community of inquiry, the representation of learning mapping and social network analysis methods.The results have revealed important information about the different ways of students’ engagement and learning presence within the blogging groups, the …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Shifting to emergency remote teaching due to the COVID-19 pandemic: An investigation of Greek teachers’ beliefs and experiences",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73988-1_25",
            "Abstract": "During schools’ closure, due to the pandemic of COVID-19, teachers around the globe were forced to transfer their instruction on-line. They were facing a range of barriers and difficulties to plan and provide online remote teaching to their students. This paper reports on a study exploring Greek primary and secondary education teachers’ views about emergency remote teaching and e-learning. The survey conducted in May 2020, just after schools’ reopening in Greece. A total of 694 K-12 teachers responded to an online questionnaire. The preliminary findings of data analysis showed that the majority of the participants perceived the pandemic as a turning point with regards to the role of digital technologies and e-learning in the schools. On the other hand, we identified teachers’ needs for professional development and support, in terms of learning design abilities necessary to integrate synchronous and …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Preparing teachers to integrate Web 2.0 in school practice: Toward a framework for Pedagogy 2.0",
            "Publication year": 2013,
            "Publication url": "https://ajet.org.au/index.php/AJET/article/view/157",
            "Abstract": "Web 2.0 has captured the interest and the imagination of both educators and researchers while it is expected to exert a significant impact on instruction and learning, in the context of the 21st century education. Hailed as an open collaborative learning space, many questions remain unanswered regarding the appropriate teacher preparation and the pedagogical impact of using Web 2.0 tools in the classroom practice. Do teachers feel comfortable and ready to adopt educational Web 2.0? What are their beliefs and perceptions regarding the educational potential of Web 2.0? What are the educational and contextual issues that determine teachers' challenges and decisions to use Web 2.0 in their classroom practice? This article addresses these questions by presenting the design and the implementation of a development program aiming to prepare teachers to make meaningful and purposeful use of Web 2.0 tools in their classroom. The model of technological pedagogical content knowledge and the authentic learning approach were the guiding principles that largely influenced the Web 2.0 pedagogical framework, which was designed and applied in this particular teacher preparation program. The aim of the program was the preparation of the participating teachers, coming from the area near the city of Korinthos, Greece for purposeful applying Web 2.0 tools in their instruction. The course sessions and the related instructional activities were implemented between February and April 2011. In total, 86 primary and secondary teachers participated in the pilot courses. The program findings were encouraging as far as the participants' perceptions and …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teacher Professional Development through Virtual Campuses: Conceptions of a ‘New’Model",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-practices-outcomes-virtual/55909",
            "Abstract": "This chapter acknowledges the increasing impact of eLearning and the associated rise of Virtual Campuses (VCs) for Teacher Professional Development (TPD). On the basis of reported literature, in particular, deficiencies identified in Bell’s (1991) traditional “individual”,“group,” and “school development” approaches, the authors propose an alternative model for TPD delivered through VCs. In support of this “new” model, key issues underlying the VC paradigm in terms of the design and implementation of such environments are further discussed. In particular, the authors argue about the value and complications behind the adoption of this model and suggest principles supporting the design of such type of environments.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Design and development of learning objects for lower secondary education in Greece: The case of computer science e-books",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/38581550/EDULEARN13__1st-3rd_July_2013__Barcelona__Spain.pdf",
            "Abstract": "This paper reports on the design framework and the development of a variety of learning objects aiming at the enrichment of both, the lower secondary education computer science e-textbooks and the Greek National Aggregator of Educational Content. At first, the theoretical foundations and critical instructional design issues for computer science learning objects are addressed. The learning objects design and development method is also presented. Following, indicative examples of learning objects are presented and their affordances to support active, inquiry and constructivist learning activities in school practice are discussed. Conclusions for educational practice and further research in the schools are drawn.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pre-vocational skills laboratory: Development and investigation of a web-based environment for students with autism",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S187705091400026X",
            "Abstract": "The use of Information and Communication Technologies (ICT) in educating children with Autism Spectrum Disorder (ASD) is a dynamic field linking both special education and learning technologies research areas. This paper reports on the design and development of Pre-Vocational Skills Laboratory, a Web-based learning environment aiming to support students with ASD towards developing pre-vocational skills. The first section addresses theoretical foundations regarding ICT applications in educating and supporting individuals with ASD. The key design features, the structure and the functionality of the system are analytically presented. Following, preliminary findings regarding an instructional intervention implemented in a special education school in Greece are also presented. The paper concludes that the environment can help students with autism to acquire pre-vocational skills, while the combination of …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:isC4tDSrTZIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Teachers' Decisions to Use ICT in Classroom Practice: An Investigation Based on Decomposed Theory of Planned Behavior",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/article/teachers-decisions-use-ict-classroom/69160",
            "Abstract": "Presented are reports on a pilot study investigating Greek secondary education teachers’ perceptions and attitudes towards current use of ICT as a learning tool in their classroom practice and the possible factors that influence their decisions to integrate ICT in their instruction. The survey presented has adopted the Decomposed Theory of Planned Behavior (DTPB) with certain modifications a) to assess teachers’ beliefs of the potential of ICT to support classroom learning activities, and b) to better understand teachers’ decisions to adopt ICT as learning tool in classroom practice. A Likert-type scale was constructed to investigate the DTPB variables and other factors related to the use of ICT in the classroom. Results indicated that although teachers were aware of the benefits of ICT to promote students’ learning they do not integrate ICT as a learning tool in their regular, everyday teaching practices. Primary factors …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:p2g8aNsByqUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Pre-vocational skills laboratory: designing interventions to improve employment skills for students with autism spectrum disorders",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-016-0488-6",
            "Abstract": "The use of information and communication technologies in educating children with autism spectrum disorders (ASD) is a dynamic field linking both special education and learning technologies research areas. This paper reports on the development of pre-vocational skills laboratory (PVS-Lab), a Web-based learning environment aiming to support students with ASD towards developing pre-vocational and employment skills. The first section addresses theoretical foundations and the design framework of PVS-Lab, as well as the structure and the functionality of the system. Following a particular intervention is presented including the analysis of the engagement of an autistic student with PVS-Lab and his tutors’ monitoring, based on a psychophysiological signal recording system. The paper concludes with the need to advance future research towards new learning environments that can help (a) students with …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Towards the development of a new model for best practice and knowledge construction in virtual campuses",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/111375/",
            "Abstract": "This paper reports on the work of a European Commission DG Education and Culture cofinanced project PBP-VC, Promoting Best Practice in Virtual Campuses, which is aimed at providing a deeper understanding of the key issues and critical success factors underlying the implementation of virtual campuses. The paper outlines a tentative model of issues underpinning best practice in virtual campuses derived from an initial literature-based investigation of existing virtual campus initiatives within the European Union. It is proposed that the tentative model will build upon key principles that have been identified for the development of an online constructivist learning environment based on problem-based learning and on a suitable model for knowledge construction and evolution. The tentative model comprises five main areas that can be viewed as being interrelated: 1. Organizational issues 2. Technological issues 3 …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Informing Science Institute"
        },
        {
            "Title": "What’s In a game? A game-based approach to exploring 21st-century European identity and values",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/23265507.2018.1562364",
            "Abstract": "This article focuses on the early stages of an international project on gamifying national identity. It examines the production of the content required for developing a sophisticated and engaging approach to pedagogical innovation in education, through game-based learning. This will encourage individuals to think about both European and national identity, specifically within the context of the European Union (EU). At a time when the EU faces significant challenges, a better understanding and appreciation of the role of national and supra-national identity and belonging in Europe is clear. RU EU? – an Erasmus+ funded project – aims to develop an innovative online game to help students and others enhance their understanding of their own national and European identities and challenge attitudes and prejudices. The content development of the game has brought together experts with socio-political knowledge …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:NhqRSupF_l8C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Computer simulations and scientific knowledge construction",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/gaming-simulations-concepts-methodologies-tools/49374",
            "Abstract": "In this article, the basic characteristics of scientific and educational simulations are discussed. Research findings which support their educational effectiveness are presented, and emphasis is placed on the pedagogical issues of designing and using simulation environments aiming at facilitating students’ engagement and active knowledge construction.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Hershey, PA: IGI Global"
        },
        {
            "Title": "MOOCs and Teacher Professional Development: A Case Study on Teachers' Views and Perceptions.",
            "Publication year": 2018,
            "Publication url": "https://eric.ed.gov/?id=ED590293",
            "Abstract": "This paper reports on a study concerning a MOOC designed to support Greek language teachers in secondary education schools towards designing and using collaborative writing activities with Google Docs in their classroom. The principles that determined the particular MOOC design framework were directed by three dimensions of teacher participation: a) engagement b) peer interaction and mutual support and c) collaborative creation of educational artefacts. A total of 566 language teachers from secondary education schools were enrolled in this MOOC, which achieved a completion rate of 57.6%. We used a mixed method that combines the analysis of teachers’ engagement through platform records and their responses to a specific questionnaire. The results provided supportive evidence that the design framework was effective towards promoting teachers’ active engagement, peer interaction and support, and development of learning design abilities to integrate collaborative writing with Google Docs in their classroom. In addition, the analysis showed that the majority of participants conceptualized this MOOC as an efficient environment for their professional development.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:D03iK_w7-QYC",
            "Publisher": "International Association for the Development of the Information Society"
        },
        {
            "Title": "The promoting best practice in virtual campuses (PBP-VC) project: towards new strategies for higher education",
            "Publication year": 2007,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00424349/",
            "Abstract": "It is a 2 year EACEA co-financed project (March 2007 -February 2009) It aims at providing a deeper understanding of key issues and critical success factors underlying implementation of Virtual Campuses (VCs)",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-directed learning in e-portfolios: Analysing students’ performance and learning presence",
            "Publication year": 2016,
            "Publication url": "http://eprints.eudl.eu/id/eprint/458/",
            "Abstract": "E-portfolios constitute a dynamic research topic in e-learning, since they foster a new philosophy for learning and personal development, which is characterised by open, participatory, self-directed, reflective and collaborative processes. This paper presents an investigation on students’ learning presence in a blended post-graduate course, designed to promote self directed learning through e-portfolio activities. The theoretical foundations and the key dimensions of e-portfolio learning activities are outlined, i.e. students’ construction, reflection and collaboration. Following are presented the organizational and the analysis framework of students’ self-directed learning and constructive activities within the e-portfolio. Combining both, descriptive analysis and Social Network Analysis of the research data, we have revealed important information regarding individual performance and students’ learning presence, interaction and collaboration among participants as well as the overall operation of the e-portfolio community.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:rO6llkc54NcC",
            "Publisher": "European Alliance for Innovation"
        },
        {
            "Title": "Self-directed learning in e-portfolios: Design issues and investigation of students’ performance",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-28883-3_16",
            "Abstract": "This paper presents an investigation on students’ learning presence in a blended post-graduate course, designed to promote self-directed learning through e-portfolio activities. The theoretical foundations and the key dimensions of e-portfolio learning activities are outlined, i.e. students’ construction, reflection and collaboration. Following are presented the organizational and the analysis framework of students’ self-directed learning and constructive activities within the e-portfolio. Descriptive analysis and Social Network Analysis of the research data revealed important information regarding individual performance, interaction and collaboration among participants as well as the whole e-portfolio community.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Developing a technological pedagogical content knowledge framework for science education: Implications of a teacher trainers’ preparation program",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/228428241_Developing_a_Technological_Pedagogical_Content_Knowledge_Framework_for_Science_Education_Implications_of_a_Teacher_Trainers'_Preparation_Program/links/575bb43f08aed884620da0d0/Developing-a-Technological-Pedagogical-Content-Knowledge-Framework-for-Science-Education-Implications-of-a-Teacher-Trainers-Preparation-Program.pdf",
            "Abstract": "In this paper we describe a science teacher preparation program, implemented in Greece, aiming at ICT integration in classroom practice. The development of this teacher preparation program was guided by the various components of Technological Pedagogical Content Knowledge (TPACK) while attempting to meet the professional development needs of science teachers. We begin with an overview of this teacher preparation program. Next, we look specifically at program components and correlate them with the knowledge bases for science education in secondary schools, particularly Pedagogical Content Knowledge. This is followed by a review of recent research findings that report the impact of the teacher preparation program on teachers’ views, perceptions and abilities to integrate ICT in science classroom. Finally, we draw on the apparent successes and challenges of the teacher preparation program to make suggestions regarding further applications of the construct of TPACK in science teacher preparation.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "InSITE"
        },
        {
            "Title": "RU EU? A game-based approach to exploring 21st century European identity and values",
            "Publication year": 2018,
            "Publication url": "https://research.ou.nl/en/publications/ru-eu-a-game-based-approach-to-exploring-21st-century-european-id",
            "Abstract": "The RU EU game and support materials are clearly relevant to specific themes of the conference in describing the research and development tasks required for developing a sophisticated and engaging approach to pedagogical Innovations in Education, especially in the field of game based learning. Our paper specifically encourages individuals to think about the nature of both European and National identity, specifically with the context of the EU.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IATED Academy"
        },
        {
            "Title": "Rapid design and implementation of a teacher development MOOC about emergency remote teaching during the pandemic",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73988-1_26",
            "Abstract": "The pandemic of COVID-19 forced K-12 schools worldwide to transfer their educational programs from in-person instruction to remote online teaching. Teachers faced a range of difficulties towards providing remote teaching and integrating e-learning tools in their practices. This paper reports on a study concerning the rapid design and implementation of a MOOC to support primary and secondary education teachers in Greece towards using online tools in their remote instruction during the pandemic of COVID-19. The design framework and the implementation procedure of this particular MOOC are presented. The preliminary findings of a survey concerning 171 teachers who responded to an online questionnaire after completing this MOOC, are also presented. The results revealed teachers’ satisfaction with regards to their personal outcomes and achievements, in terms of abilities to apply online instructional …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Using SOLO taxonomy to explore students’ mental models of the programming variable and the assignment statement",
            "Publication year": 2011,
            "Publication url": "http://earthlab.uoi.gr/theste/index.php/theste/article/view/99",
            "Abstract": "Introductory programming seems far from being successful at both university and high school levels. Research data already published offer significant knowledge regarding university students’ deficiencies in computer programming and the alternative representations they built about abstract programming constructs. However, secondary education students’ learning and development in computer programming has not been extensively studied. This paper reports on the use of the SOLO taxonomy to explore secondary education students’ representations of the concept of programming variable and the assignment statement. Data was collected in the form of students’ written responses to programming tasks related to short code programs. The responses were mapped to the different levels of the SOLO taxonomy. The results showed that approximately more than one half of the students in the sample tended to manifest prestructural, unistructural and multistructural responses to the research tasks. In addition, the findings provide evidence that students’ thinking and application patterns are prevalently based on mathematical-like mental models about the concepts of programming variable and the assignment statement. The paper concludes with suggestions for instructional design and practice to help students’ building coherent and viable mental models of the programming variable and the assignment statement.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysing students’ engagement and learning presence in an educational blog community",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09523987.2012.738012",
            "Abstract": "This paper reports on a case study investigating students’ participation and learning presence in an educational blog implemented as a cross-thematic inquiry activity exploring and debating on the acid rain problem. Twenty-one secondary education students (14–15 years aged), coming from two separate classes, were involved. The content and commentary postings of the blog were analysed using a combined framework, combining the model of Community of Inquiry (CoI) and the representation of learning mapping, aiming to reveal students’ engagement in blogging activities. The analysis shed light into the different patterns of participation that students showed and their gradual evolution of learning presence which supported the development of a CoI. The results suggested that properly designed blog activities can help students to achieve higher cognitive levels through enhancing their collaboration skills and …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Promoting and implementing best practice in virtual campuses and e-learning",
            "Publication year": 2008,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02511022/",
            "Abstract": "Interactively explore issues relating to key success factors, best practices within context of e-learning and virtual campuses. Introduce models and a framework aimed at identifying and promoting best practice. Hearing about and learning from your own experiences and work, and getting feedback and comments to issues explored in workshop.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Students’ collaborative patterns in a wiki-authoring project: Towards a theoretical and analysis framework",
            "Publication year": 2017,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/JARHE-05-2016-0034/full/html",
            "Abstract": "The purpose of this paper is to present a case study investigating students’ patterns of collaborative content creation in a wiki project that was designed to promote self-directed and collaborative learning in the context of a university course. In addition, it proposes a new organizational and analysis framework of students’ constructive and collaborative activities in wiki-authoring projects.The key notion, around which the present conceptual and research framework was built, is that a wiki integrates a content space and a social (discussion) space both considered in collaborative manner. The analysis of student contributions to their wiki was organized along two dimensions: interaction and refection posts were analyzed using the framework of Community of Inquiry; content contributions to the wiki pages were classified into five categories: creating a new page, content expansion …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Pedagogical and instructional design issues towards the integration of Web 2.0 tools in instruction",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/236973154_Pedagogical_and_instructional_design_issues_towards_the_integration_of_Web_20_tools_in_instruction_Implications_of_teachers'_training_pilot_courses_in_Greece/links/0c9605307a1956383d000000/Pedagogical-and-instructional-design-issues-towards-the-integration-of-Web-20-tools-in-instruction-Implications-of-teachers-training-pilot-courses-in-Greece.pdf",
            "Abstract": "This paper presents the design and the implementation of a training course aiming to prepare teachers to effectively integrate Web 2.0 tools in their instruction. The program was established in the context of the Web2. 0 ERC project aiming at simplifying Web 2.0 for educational purposes. The model of Technological Pedagogical Content Knowledge and the Authentic Learning approach were the guiding principles that largely influenced the educational design of this teacher preparation program. This Web 2.0 instructional design framework is outlined in detail. The program outcomes and the described experience aim to offer insight into the developing programs that respond to teachers’ training needs and effective preparation.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:RGFaLdJalmkC",
            "Publisher": "Korinthos, Greece: University of Peloponnese"
        },
        {
            "Title": "Investigating the role of structure in online teachers’ communities of learning",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-34127-9_12",
            "Abstract": "Online learning communities constitute a dynamically evolving field at both levels, research and development in educational practice. This paper reports on the design and the implementation of two online communities with different organizational–functional characteristics, a self-directed (open) community and a semi-structured community. Using in combination of qualitative and social network analysis methods, this investigation revealed important information regarding critical community indicators, i.e. teachers’ engagement and mutual interaction, as well as collaboration and community evolution. The findings indicated that the semi-structured community was very effective and cohesive, since the majority of the participants were very active and self-organized in groups, and they developed strong interrelations among them. On the other hand, the open community turned out to be very centralized, evolving …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Students’ self-regulated learning through online academic writing in a course blog",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73417-0_7",
            "Abstract": "This chapter presents an investigation on students’ self-regulation practices associated with online academic writing and inquiry through blogging, in the context of a blended postgraduate course. The design framework of this particular intervention was determined by the assumption that online writing in course blogs could be a means of increasing students’ academic writing skills. The key aspects of students’ engagement, peer interaction, and reflection were directed by the principles of self-directed and self-regulated learning. Students’ contributions to the course blog were analyzed by using two schemas, i.e., Community of Inquiry and Learning Presence. Descriptive and content analysis revealed important information regarding individual inquiry and performance, peer interaction and reflection, as well as self-regulated learning actions exhibited by the participants within a community of inquiry. The …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Exploring secondary education teachers’ attitudes and beliefs towards ICT adoption in education",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/42268046/Jimoyiannis_Komis_2006.pdf",
            "Abstract": "The survey presented in this article aims at the investigation of secondary education teachers’ attitudes and beliefs about ICT in education. It has been administered to a total of 240 secondary education teachers, coming from the Ioannina prefecture, in Greece. Our results show that the great majority of the teachers in the sample are positive towards acquiring basic skills on ICT, applying ICT tools in their instruction and the role that ICT could play in education. We have recorded differences in teachers’ beliefs according to their attributes such as gender, specialty, teaching experience, computer experience, training on ICT, and computer ownership. Our findings have also revealed some parameters, which interfere making thus many teachers cautious or fearful about ICT integration in the educational practice. On the other hand, multivariate analysis has identified three discrete groups of teachers which have exhibited a persistent and rather consistent approach: a group having strongly positive attitudes about ICT in education, a second group of teachers which are in general positive, and a third one with negative or neutral beliefs.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CONCEPT MAPPING AS A COGNITIVE TOOL IN SCIENCE EDUCATION: AN ANALYSIS OF STUDENTS’LEARNING USING SOLO TAXONOMY VASILIKIBAKOULI",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=cC_5DAAAQBAJ&oi=fnd&pg=PA43&dq=info:D_XPBaZujnkJ:scholar.google.com&ots=urkKEdoSbW&sig=b1J-oBiPj3q26JRO745DE2PAPP8",
            "Abstract": "This paper presents an exploratory study on the use of concept mapping as a cognitive tool in K-6 science education. The design of an instructional sequence with concept mapping activities, in the topics of human respiratory and circulatory systems, is also presented. Qualitative research data was collected in the form of students’ concept maps developed by using both the ‘paper and pencil’method and concept mapping software. The content and structure of students’ concept maps were analysed according to the levels of the Structure of the Observed Learning Outcomes (SOLO) taxonomy. The analysis revealed promising results regarding students’ learning evolution during the instructional sequence. The paper concludes that concept mapping is an effective learning strategy that could be integrated into the primary science classroom.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Cambridge Scholars Publishing"
        },
        {
            "Title": "Digital Literacy in a Lifelong Learning Programme for Adults: Educators’ Experiences and and Perceptions on Teaching Practices",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/article/digital-literacy-lifelong-learning-programme/39062",
            "Abstract": "The study presented explores aspects of adult learning on digital literacy in the context of a lifelong learning programme for social cohesion in Greece. The article outlines the framework of the digital literacy subject and underlines its associated objectives regarding adults’ knowledge and competence in Information and Communication Technologies (ICT). The exploration draws upon the experiences and perceptions of eight adult ICT educators. The findings reveal that the educators tried to use flexible instructional practices that were adjusted to adult learners’ needs and interests. Common effective instructional practices used were: ICT competence sessions, interdisciplinary and multi-literacy lessons, ICT-based projects, individual instruction sessions. Additionally, the article reveals the difficulties that adults faced in the course of developing ICT literacy skills. The article ends with implications for the design of …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A Literature Review Looking at Graduate Employability Skills (GESs): GES App Report 1: Review of the GES literature",
            "Publication year": 2020,
            "Publication url": "https://research-portal.uws.ac.uk/en/publications/a-literature-review-looking-at-graduate-employability-skills-gess",
            "Abstract": "This review aims to identify how graduate employability skills (GES) are conceptualised in the literature and which skills are emphasised from a range of perspectives, which will inform the design of the GES App. The review draws upon a range of international studies, including those which have employed interviews, focus groups, surveys, and analysis of graduate job advertisements. In the review we identify and define the myriad of ways in which graduate employability skills are conceptualised, from the perspectives of employers and students, as well as within policymaking. We consider different GES frameworks, identifying common features and compare these with models of employability utilised within Higher Education institutions. We conclude with recommendations for the development of the Graduate Employability Skills App.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:B3FOqHPlNUQC",
            "Publisher": "University of the West of Scotland"
        },
        {
            "Title": "Towards a Framework for Identifying and Evaluating Best Practice in E-Learning and Virtual Campuses",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/28498/",
            "Abstract": "The Promoting Best Practice in Virtual Campuses (PBP-VC) project is a two year European Commission DG Education and Culture co-financed study which is aimed at providing a deeper understanding of the key issues and success factors underlying the implementation of virtual campuses. The PBP-VC project involves working with key stakeholders throughout the European Union in order to investigate best practice in virtual campuses. The outcome of the project is the development of a model and framework that has been developed which is aimed at identifying and evaluating best practice in e-learning and virtual campuses. The framework covers areas relating to best practice from organisational, pedagogical, technological, financial, student/user and sustainability related issues. The framework also explores key issues relating to best practice and key success factors within the context of virtual campus project …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Exploring adult digital literacy using learners' and educators' perceptions and experiences: The case of the second chance schools in Greece",
            "Publication year": 2011,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.14.1.217.pdf",
            "Abstract": "The research reported in this paper aspires to shed light into adult digital literacy using learners’ and educators’ experiences and perceptions at Second Chance Schools, a project in Greece aiming at combating social exclusion through education. In exploring the above, this investigation uses a case-study approach within a qualitative paradigm and draws upon a heuristic that brings together a set of ideas on adult program development to guide research techniques and analysis procedures. The latter focuses on five key elements of program development for adults: needs identification, planning, design, climate, and evaluation. The findings identify the importance placed by the participants on digital literacy and indicate some tentative points and practices that, when suitably adapted, could pave the way for effective preparation and delivery of digital literacy courses for adults.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:LkGwnXOMwfcC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Blogs in higher education: Analysing students’ participation and presence in a community of blogging",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/236973141_Blogs_in_higher_education_Analysing_students'_participation_and_presence_in_a_community_of_blogging/links/568c026708ae197e426890bb/Blogs-in-higher-education-Analysing-students-participation-and-presence-in-a-community-of-blogging.pdf",
            "Abstract": "This paper reports on the investigation of university students’ engagement and participation patterns in a blogging activity, designed to support collaborative learning. The study was administered in the context of an authentic coursework project, in a second semester university course attended by 48 students. The analysis was based on the models of Community of Inquiry and Social Network Analysis and shed light into the different patterns of participation students showed and the evolution of their learning presence within the community of blogs. Preliminary research findings, both quantitative and qualitative, indicated that the majority of the students in the sample were generally active and exhibited learning presence actions within their group blog. Differences between students in the various groups were also recorded. The results suggested that properly designed blog activities can help students to achieve higher cognitive levels through enhancing their communication and collaboration skills, and their critical thinking.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MOOCS for teacher professional development: exploring teachers’ perceptions and achievements",
            "Publication year": 2019,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ITSE-10-2018-0081/full/html",
            "Abstract": "This paper aims to report on a study concerning a Massive Open Online Course (MOOC), designed to support Greek-language teachers in secondary-education schools in implementing collaborative writing activities with Google Docs (GDs) in their classrooms. Data recorded from a post-survey were used to investigate teachers’ views and perceptions about MOOC design features, their personal achievements and the overall outcomes for their professional work and development.The design framework of the particular teacher professional development MOOC was determined by the connectivist principles and addressed three main dimensions of teachers’ active participation: a) individual engagement; b) peer interaction and mutual support; and c) collaborative creation of educational scenarios and artefacts. The analysis used a mixed method that combines data from …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:f2IySw72cVMC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Blended collaborative learning through a wiki-based project: A case study on students’ perceptions",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/blended-collaborative-learning-through-wiki/74311",
            "Abstract": "Wikis are currently gaining in popularity in schools and higher education institutions and they are widely promoted as collaborative tools supporting students’ active learning. This paper reports on the investigation of university students’ beliefs and perceptions of a wiki authoring activity, designed to support blended and collaborative learning. The study was administered in the context of an authentic coursework project activity in a first semester university course on Information and Communication Technologies (ICT), attended by 47 first year students. Research findings indicated that the students in the sample were generally positive about the collaborative experience offered through the wiki and the consequent learning outcomes. Students’ perceptions of the functionality and usability of the wiki environment were also positive. They considered the wiki as an effective and easy to use technology. In overall, they …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Integrating Web 2.0 in education: Towards a framework for Pedagogy 2.0",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=15848189457955708943&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:IWHjjKOFINEC",
            "Publisher": "Brunel University"
        },
        {
            "Title": "Teacher Professional Development through Virtual Campuses",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=13539795273193753295&hl=en&oi=scholarr",
            "Abstract": "This chapter acknowledges the increasing impact of eLearning and the associated rise of Virtual Campuses (VCs) for Teacher Professional Development (TPD). On the basis of reported literature, in particular, deficiencies identified in Bell’s (1991) traditional “individual”,“group,” and “school development” approaches, the authors propose an alternative model for TPD delivered through VCs. In support of this “new” model, key issues underlying the VC paradigm in terms of the design and implementation of such environments are further discussed. In particular, the authors argue about the value and complications behind the adoption of this model and suggest principles supporting the design of such type of environments.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Factors affecting teachers’ views and perceptions of ICT in education",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/303897609_FACTORS_AFFECTING_TEACHERS'_VIEWS_AND_PERCEPTIONS_OF_ICT_IN_EDUCATION/links/575bb20408aec91374a628b0/FACTORS-AFFECTING-TEACHERS-VIEWS-AND-PERCEPTIONS-OF-ICT-IN-EDUCATION.pdf",
            "Abstract": "This article presents the results of a study investigating current teachers’ beliefs and perceptions of ICT in education. The survey was administered in Greece to a total of 1165 primary and secondary education teachers, just after they had completed a training programme on basic ICT skills. The majority of the teachers in the sample stated positively towards the role that ICT could play in education. However, only a small percentage of them have adopted and use ICT in their instruction job. Our findings have also revealed some interfering factors, which make many teachers cautious or skeptical about ICT integration in the educational practice. We have also recorded differences in teachers’ beliefs and perceptions according to their gender and subject specialty. Finally, we conclude with some implications, which could be helpful to the educational policy authorities in their attempt to implement new initiatives aiming at teachers’ preparation to effectively integrate ICT in their everyday classroom practice.",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating Greek students' ideas about forces and motion",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1025457116654",
            "Abstract": "Educational research has shown that high school and university students also follow the Aristotelian idea about motion; for example, a continuous action of a force is necessary to keep an object in motion. The survey presented in this article aims at a deeper investigation of secondary education students' ideas about the forces involved in objects moving under the sole influence of gravity. The main objectives are: (1) to investigate other ideas or difficulties, which intervene and determine students' mental models about motion and force, and (2) to reveal how the students in the sample are grouped according to their alternative conceptions. Our study has been mainly determined by the revision in Science Curriculum established in Greece three years ago. A survey has been administered to a total of 146 students (15–16 years old) attending six typical public high schools in Greece. The results presented show …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Department of Social and Educational Policy University of Peloponnese Korinthos, Greece ajimoyia@ uop. gr",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=16506193507235574799&hl=en&oi=scholarr",
            "Abstract": "During the last decade, Web 2.0 applications, including blogs, wikis, social networking, social bookmarking, media sharing, podcasting, etc., have received intense and growing educational and research interest (Clark et al. 2009; Ravenscroft 2009; Schroeder et al. 2010). It is widely considered that Web 2.0 applications, while not designed specifically for educational purposes, have a number of affordances that provide multiple opportunities for shared content and resources, self-directed learning, collaborative learning, ubiquitous and lifelong learning. The emerged socially based technologies of the Web 2.0 have the potential to offer enhanced learning opportunities and support students' participation in effective task-oriented personal learning spaces independent of physical, geographic, and institutional boundaries (Hall 2009; McLoughlin and Lee 2010).Among Web 2.0 tools, blogs constitute a new content …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer simulations in physics teaching and learning: a case study on students' understanding of trajectory motion",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131500000592",
            "Abstract": "A major research domain in physics education is focused on the study of the effects of various types of teaching interventions aimed to help students' alternative conceptions transformation. Computer simulations are applications of special interest in physics teaching because they can support powerful modeling environments involving physics concepts and processes. In this study two groups (control and experimental) of 15–16 years old students were studied to determine the role of computer simulations in the development of functional understanding of the concepts of velocity and acceleration in projectile motions. Both groups received traditional classroom instruction on these topics; the experimental group used computer simulations also. The results presented here show that students working with simulations exhibited significantly higher scores in the research tasks. Our findings strongly support that computer …",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Editorial: Special Issue “Investigating the Educational Web 2.0”",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-rBR13oAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Students' performance towards computer simulations on kinematics",
            "Publication year": 2000,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/14978",
            "Abstract": "Repository of UOI \"Olympias\": Students' performance towards computer simulations on \nKinematics Skip navigation Home Browse Communities & Collections Browse Items by: \nIssue Date Author Title Subject Item Type Advanced Search Help About DSpace Sign on to: \nMy DSpace Receive email updates Edit Profile Saved Searches Favorites Repository of \nUOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών \nΑγωγής 4.Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης 5.Άρθρα σε επιστημονικά περιοδικά ( \nΑνοικτά) Ελληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/14978 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nΑγωγής. Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/14978 \nAppears in Collections: Άρθρα σε επιστημονικά '…",
            "Abstract entirety": 0,
            "Author pub id": "-rBR13oAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        }
    ]
}]