[{
    "name": "Αθανάσιος Τυροπάνης",
    "romanize name": "Athanasios Tyropanis",
    "School-Department": "School of Electronics and Computer Science",
    "University": "University of Southampton",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 54,
    "Scholar name": "Thanassis Tiropanis",
    "Scholar id": "T0MK3pUAAAAJ",
    "Affiliation": "University of Southampton",
    "Citedby": 1829,
    "Interests": [
        "Computer Science",
        "Web",
        "Networking",
        "Learning"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=T0MK3pUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Semantic technologies in learning and teaching (SemTech)",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=13008821464246739874&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting semantic annotation of content with Linked Open Data (LoD) to improve searching performance in web repositories of multi-disciplinary research data",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41718-9_7",
            "Abstract": "Searching for relevant information in multi-disciplinary repositories of scientific research data is becoming a challenge for research communities such as the Social Sciences. Researchers use the available keywords-based online search, which often fall short of meeting the desired search results given the known issues of content heterogeneity, volume of data and terminological obsolescence. This leads to a number of problems including insufficient content exposure, unsatisfied researchers and above all dwindling confidence in such repositories of invaluable knowledge. In this paper, we explore the appropriateness of alternative searching based on Linked Open Data (LoD)-based semantic annotation and indexing in online repositories such as the ReStore repository (ReStore repository is an online service hosting and maintaining web resources containing data about multidisciplinary research in Social …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Special issue on\" Ubiquitous e-Learning solutions over heterogeneous networks\"",
            "Publication year": 2009,
            "Publication url": "https://search.proquest.com/openview/df51e1bb7790cb41dfc29138b6323a1d/1?pq-origsite=gscholar&cbl=25320",
            "Abstract": "The recent advent and proliferation of wireless networking solutions such as DVB/DVB-RCS, VSAT, DVB-S/S2, WiFi, WiMax, and UMTS/3G, to name but a few, has raised the expectations for delivering media rich e-learning content any time, any place. Towards meeting this challenge, bandwidth, reliability of content delivery, as well as economic feasibility are key factors that require fresh research on innovative end-to-end tele-education systems. Accordingly, this special issue targets precisely the area of ubiquitous e-learning solutions built over heterogeneous networks—their implementation, deployment and use. The issue kicks off with the paper by Salzmann, Gillet and Mullhaupt who present a new end-to-end adaptation scheme to provide the user with the best possible interacting experience, while considering imposed constraints in the ubiquity of the solution, the adaptability to the E2E infrastructure, and the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer Nature BV"
        },
        {
            "Title": "Building a connected web observatory: architecture and challenges",
            "Publication year": 2014,
            "Publication url": "https://eprints.soton.ac.uk/366270/1/web-obs-arch-bwow14.pdf",
            "Abstract": "An increasing number of datasets and analytics resources have been made available on the Web. Often, those resources are hosted on portals that are related to dedicated topics (eg online social network analytics) or dedicated communities (eg Web Science researchers). A Web Observatory portal brings together communities to contribute or engage with datasets and analytic (or visualisation) applications. In addition, it provides links to dataset and analytic resources that are potentially hosted in remote locations. This paper presents the architecture of a Web Observatory at the University of Southampton, which aims to foster engagement with analytics and applications and, at the same time, support linking to remote resources in other locations, potentially hosted in other Web Observatories. We report our experiences in building the” Connected Web Observatory” and discuss open challenges both in research and standardisation.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The web science observatory",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6547975/",
            "Abstract": "To understand and enable the evolution of the Web and to help address grand societal challenges, the Web must be observable at scale across space and time. That requires a globally distributed and collaborative Web Observatory.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Querying the web of data with graph theory-based techniques",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12468859628333475280&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolutionary thinking for the Web: Chairs' Welcome and Workshop Summary",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3394332.3402899",
            "Abstract": "The Web has been the subject of compelling biological metaphors that liken it to an evolving ecosystem. Analogies of this kind could benefit from further theoretical and empirical examination. Evolutionary and cognitive approaches provide not only a powerful theoretical framework to address this theme, but also a heritage of robust analytic tools that can help to quantify complex and subjective social and technological phenomena. The goal of this workshop will be to discuss how evolutionary approaches can inform our understanding of the Web at present, as well as methodological challenges and opportunities to shape its evolution into the future.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting the Web of Data to provide descriptions of ICT tools: a preliminary report about SEEK-AT-WD",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/340777/1/12-paper-19.pdf",
            "Abstract": "In order to support educators when selecting ICT tools, several educational organizations provide ICT tool registries whose functionality is limited by the data they contain. These registries could reduce the cost of creating and updating their datasets obtaining ICT tool descriptions from the Web of Data. However, some problems hinder the educational consumption of these descriptions: they are not described using an appropriate vocabulary for this specific domain and registries do not discriminate which tools are useful for education. SEEK-AT-WD is proposed as an infrastructure that overcomes these problems and consumes ICT tool descriptions from the Web of Data, publishing them back once they are related to educational concepts. This paper discusses the challenges found when developing SEEK-AT-WD, and how they were solved to take advantage of data from the Web in the educational applications.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet Science: Second International Conference, INSCI 2015, Brussels, Belgium, May 27-29, 2015, Proceedings",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=VmV1CQAAQBAJ&oi=fnd&pg=PP6&dq=info:NUP9yb6KTdwJ:scholar.google.com&ots=zhpK0RtFTv&sig=ZEtXnxvzPYXClZ1IOs_EzbHqEI4",
            "Abstract": "This book constitutes the proceedings of the Second International Conference on Internet Science, INSCIE 2015, held in Brussels, Belgium, in May 2015. The 10 papers presented were carefully reviewed and selected for inclusion in this volume. They were organized in topical sections named: internet and society; internet and governance; and internet and innovation.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:0N-VGjzr574C",
            "Publisher": "Springer"
        },
        {
            "Title": "Empowering geographically isolated communities with instant access to learning and training through satellite",
            "Publication year": 2007,
            "Publication url": "https://eprints.soton.ac.uk/265060/",
            "Abstract": "Enabling learning for members of geographically isolated communities such as agrarian, or maritime communities presents benefits in terms of promoting regional development and cost savings for governments and companies. We present a methodology for designing a satellite and wireless based network infrastructure and learning services to support distance learning for such isolated communities. This methodology entails (a) the involvement of community members in the development of targeted learning services from an early stage and (b) a service-oriented approach to learning solution deployment. Here this methodology is applied in the context of the European research project BASE2 (BASE2 2006), in which the following two types of geographically isolated communities are considered: agrarian and maritime.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic-based policy engineering for autonomic systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11520184_12",
            "Abstract": "This paper presents some important directions in the use of ontology-based semantics in achieving the vision of Autonomic Communications. We examine the requirements of Autonomic Communication with a focus on the demanding needs of ubiquitous computing environments, with an emphasis on the requirements shared with Autonomic Computing. We observe that ontologies provide a strong mechanism for addressing the heterogeneity in user task requirements, managed resources, services and context. We then present two complimentary approaches that exploit ontology-based knowledge in support of autonomic communications: service-oriented models for policy engineering and dynamic semantic queries using content-based networks. The paper concludes with a discussion of the major research challenges such approaches raise.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "PIOTRe: Personal Internet of Things Repository",
            "Publication year": 2016,
            "Publication url": "https://eprints.soton.ac.uk/399327/",
            "Abstract": "Resource-constrained Internet of Things (IoT) devices like Raspberry Pis', with specific performance optimisation, can serve as interoperable personal Linked Data repositories for IoT applications. In this demo paper we describe PIOTRe, a personal datastore that utilises our sparql2sql query translation technology on Pis' to process, store and publish IoT time-series historical data and streams. We demonstrate with PIOTRe in a smart home scenario: a real-time dashboard that utilises RDF stream processing, a set of descriptive analytics visualisations on historical data, a framework for registering stream queries within a local network and a means of sharing metadata globally with HyperCat and Web Observatories.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deconstructing diffusion on Tumblr: structural and temporal aspects",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3091478.3091491",
            "Abstract": "Online social networks enable collectives of users to create and share content at scale. The diffusion of content through the network, and the resulting information cascades, are phenomena that have been widely investigated on various platforms, which facilitate information diffusion using diverse technical mechanisms, user interfaces and incentives. This paper focuses on Tumblr, an online microblogging social network with a core'reblogging'functionality that allows information to diffuse across its network by appearing on multiple user blogs. The formation of any cascade network is visible as a list of reblogging events attached as notes to each appearance of the post in the cascade. In this paper, we examine cascade networks on Tumblr, recreated from the series of diffusion events, and analyse them from structural and temporal perspectives. To achieve this, we utilise a cascade construction model that create …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A schema-based P2P network to enable publish-subscribe for multimedia content in open hypermedia systems",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2008.016103",
            "Abstract": "Open Hypermedia Systems (OHS) aim to provide efficient dissemination, adaptation and integration of hyperlinked multimedia resources. Content available in Peer-to-Peer (P2P) networks could add significant value to OHS provided that challenges for efficient discovery and prompt delivery of rich and up-to-date content are successfully addressed. This paper proposes an architecture that enables the operation of OHS over a P2P overlay network of OHS servers based on semantic annotation of (a) peer OHS servers and of (b) multimedia resources that can be obtained through the link services of the OHS. The architecture provides efficient resource discovery. Semantic query-based subscriptions over this P2P network can enable access to up-to-date content, while caching at certain peers enables prompt delivery of multimedia content. Advanced query resolution techniques are employed to match different parts of …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:k_IJM867U9cC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Semantic Technologies for Learning and Teaching in the Web 2.0 era-A survey",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/267106/",
            "Abstract": "The strengths of semantic technologies for learning and teaching and their benefits in the areas of digital libraries, virtual communities and e-learning have been identified and well established. The case for semantic technologies in education has been on the expressive power of metadata to describe learning content, people, and services, and on how these could be intelligently matched for added value services and an advanced learning experience. However, certain concerns on the feasibility of ontology consensus and of the annotation of the enormous amount of content currently available on the Web have arisen making globally available and interoperable semantic-rich metadata for learning resources a long term vision. At the same time, progress towards a more modest machine-readable Web has been made, and pragmatic solutions to interoperability based around REST and XML have emerged in the last few years along with prototypes of SPARQL server implementations and new RDF/OWL annotation tools. Web 2.0 systems have enabled a lightweight knowledge modelling approach (sometimes called folksonomies) based around techniques such as community tagging, clustering, and community authoring. These are strong indications that consensus on ontologies can be achieved within a virtual community and that content can be efficiently annotated by community members provided adequate tools become available. Seen in this broader context it can be argued that Semantic Technologies are already impacting on the way in which we learn and teach, and will have an increasing impact as the sophistication of the tools …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for using Wikipedia to measure the flow of trends across countries",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2487788.2488177",
            "Abstract": "Wikipedia has grown to become the most successful online encyclopedia on the Web, containing over 24 million articles, offered in over 240 languages. In just over 10 years Wikipedia has transformed from being just an encyclopedia of knowledge, to a wealth of facts and information, from articles discussing trivia, political issues, geographies and demographics, to popular culture, news articles, and social events. In this paper we explore the use of Wikipedia for identifying the flow of information and trends across the world. We start with the hypothesis that, given that Wikipedia is a resource that is globally available in different languages across countries, access to its articles could be a reflection human activity. To explore this hypothesis we try to establish metrics on the use of Wikipedia in order to identify potential trends and to establish whether or how those trends flow from one county to another. We subsequently …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bias in data‐driven artificial intelligence systems—An introductory survey",
            "Publication year": 2020,
            "Publication url": "https://wires.onlinelibrary.wiley.com/doi/abs/10.1002/widm.1356",
            "Abstract": "Artificial Intelligence (AI)‐based systems are widely employed nowadays to make decisions that have far‐reaching impact on individuals and society. Their decisions might affect everyone, everywhere, and anytime, entailing concerns about potential human rights issues. Therefore, it is necessary to move beyond traditional AI algorithms optimized for predictive performance and embed ethical and legal principles in their design, training, and deployment to ensure social good while still benefiting from the huge potential of the AI technology. The goal of this survey is to provide a broad multidisciplinary overview of the area of bias in AI systems, focusing on technical challenges and solutions as well as to suggest new research directions towards approaches well‐grounded in a legal frame. In this survey, we focus on data‐driven AI, as a large part of AI is powered nowadays by (big) data and powerful machine learning …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Wiley Periodicals, Inc"
        },
        {
            "Title": "Systems & Platforms: Computer Networking",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/10802/",
            "Abstract": "Systems & Platforms: Computer Networking - EdShare Southampton EdShare Home \nBrowse By Year By Author Tags Course code University structure Share About Help Login \nLogin Systems & Platforms: Computer Networking Loading Loading previews... comp1214-10-networking.ppt \nSlideshow Download (1MB) comp1214-10-networking.ppt comp1214-10-networking.ppt 1 \nfile in this resource Systems & Platforms: Computer Networking Added By: Mr Rikki Prince \nDate Added: 16 Apr 2013 10:10 Creators Name: Mr Rikki Prince Dr Yvonne Howard Dr \nAthanassios Tiropanis Tags: systems & platforms, operating systems, comp1214, \nnetworking Viewing permissions: University Course codes: COMP1214 Link: http://edshare.soton.ac.uk/id/eprint/10802 \nDownloads & Views Actions (login required) View Item View Item Toolbox There are no \nactions available for this resource. Collection(s) COMP1214 course materials For , …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Measuring the performance of social media marketing in the charitable domain",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/340929/",
            "Abstract": "Social media services offer a new avenue for non-profit organizations (NPOs) to initiate viral and word-of- mouth marketing. Due to the widespread adoption of these sites, there is the potential for this type of marketing to reach a large audience. The emergence of social media as a new marketing platform leads to fresh challenges in that the online nature of it creates difficulties in attributing actions of intent on social media to real, meaningful action that can help NPOs. This paper provides an interdisciplinary approach to discovering the relationship between actions on social media and the performance of NPOs’ social media marketing campaign. A framework is proposed which distinguishes, tracks and measures different stages of social media marketing activity in order to determine its success. The framework provides a number of metrics - taking into account the disciplines of computer science and management - that can be used to assess performance of NPO campaigns, and is tested on two sample charities. Future research directions for this project are then discussed.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of mobile app use in the decision making behavior of spread traders",
            "Publication year": 2016,
            "Publication url": "https://eprints.soton.ac.uk/396573/",
            "Abstract": "The role of mobile app use in the decision making behavior of spread traders - ePrints Soton The \nUniversity of Southampton Courses University life Research Business Global About Visit Alumni \nDepartments News Events Contact × Search the Site Search Filter your search: All Courses \nProjects Staff University of Southampton Institutional Repository Search Advanced Search \nPolicies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight The \nrole of mobile app use in the decision making behavior of spread traders Lawrence, William, \nSung, Ming-Chien, Ma, Tiejun, Johnson, Johnnie and Tiropanis, Thanassis (2016) The role of \nmobile app use in the decision making behavior of spread traders. International Conference \non Advanced Computing, Communication and Information Sciences (ICACCI), Cebu City, \nPhilippines. 26 - 28 May 2016. Record type: Conference or Workshop Item (Paper) . e…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Observing data in IoT worlds: What and how to observe?",
            "Publication year": 2018,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp.2018.0032",
            "Abstract": "The widespread adoption of “smart devices' and sensors in various domains such as, transport, home, critical infrastructure, and wellbeing has given rise to highly dynamic data ecosystems. The data in these ecosystems is a goldmine for data-driven decision making for a variety of stakeholders. These stakeholders exploit multiple device capabilities, re-purpose and re-contextualize data collected by the devices for a number of applications. Such IoT ecosystem(s) mandate data sharing at both small and large scale. However, sensitive nature of IoT data, lack of prior knowledge of purpose of data-use, regulations and standards make data sharing a non-trivial problem. It also raises concerns of data trust, ownership, and accountability. In this paper, we scope the “IoT Observatory” infrastructure to enable various stakeholders to observe and analyse the data and methodologies in IoT enabled ecosystems. It details the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:e_rmSamDkqQC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Systems & Platforms: I/O Hardware and Software",
            "Publication year": 2013,
            "Publication url": "http://edshare.soton.ac.uk/id/eprint/10472",
            "Abstract": "Systems & Platforms: I/O Hardware and Software - EdShare Southampton EdShare Home \nBrowse By Year By Author Tags Course code University structure Share About Help Login \nLogin Systems & Platforms: I/O Hardware and Software Loading Loading previews... 2015 \nedition Slideshow Download (773kB) 2015 edition 2015 edition 1 file in this resource Systems \n& Platforms: I/O Hardware and Software Added By: Mr Rikki Prince Date Added: 29 Jan 2013 \n11:31 Creators Name: Mr Rikki Prince Dr Yvonne Howard Dr Athanassios Tiropanis Tags: \nsystems & platforms, comp1214, operating systems Viewing permissions: University Course \ncodes: COMP1214 Link: http://edshare.soton.ac.uk/id/eprint/10472 Downloads & Views Actions \n(login required) View Item View Item Toolbox There are no actions available for this resource. \nCollection(s) COMP1214 course materials EdShare For any questions or feedback, please us…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic technologies in education: exploring the practitioners’ perspective",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/268786/1/ALT-C_09_conf_intro%252Babstracts_p47.pdf",
            "Abstract": "JISC commissioned an investigation into semantic technologies in learning and teaching (SemTech) due for completion early in 2009. The SemTech Project website summarises information about semantic technologies in education and contains an analysis of the technologies and applications thus far identified. Following a brief overview of our investigation of semantic technologies in education the workshop will consist of structured group discussions from a selected perspective (educational, technical and organisational). The workshop structure will be fine-tuned to match the participants, who will work in groups of eight using flip charts to produce a poster for a two-minute poster pitch. A second peer review group activity will comment on each poster. A plenary session will identify next steps. Each participant in the workshop will receive a copy of the SemTech report, plus detailed activity guidance notes which they can also take away and use in their own institution.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic technologies in learning and teaching",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=18014056778982232793&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A streaming real-time web observatory architecture for monitoring the health of social machines",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2740908.2743977",
            "Abstract": "Over the past years, streaming Web services have become popular, with many of the top Web platforms now offering near real-time streams of user and machine activity. In light of this, Web Observatories now are faced with the challenge of being able to process and republish real-time, big data, Web streams, whilst maintaining access control and data consistency. In this paper we describe the architecture used in the Southampton Web Observatory to harvest, process, and serve real-time Web streams.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "WSCD: negotiating the web science curriculum development through shared educational artefacts",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "K., Tiropanis, T., Courtenage, S.: An active, ontologydriven network service for internet collaboration",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Longitudinal study of Web-related patents",
            "Publication year": 2020,
            "Publication url": "https://eprints.soton.ac.uk/448419/",
            "Abstract": "Original dataset and analysis scripts for our patent-based study into the history of corporate Web innovation. The dataset contains 20,493 Web-related patents filed between years 1990 through 2013 in the US. From this dataset we extracted temporal patenting rates which are used in the analysis. The accumulation of patents over time is fitted using regressions to examine the shape of the growth curve in Web technology. We also analyse the relationship between monthly patenting rates and NASDAQ stock market movements using a VAR model.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Code Ocean"
        },
        {
            "Title": "Government as a Social Machine in an Ecosystem",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2567948.2578837",
            "Abstract": "The Web is becoming increasingly pervasive throughout all aspects of human activity. As citizens and organisations adopt Web technologies, so governments are beginning to respond by themselves utilising the electronic space. Much of this has been reactive, and there is very little understanding of the impact that Web technologies are having on government systems and processes, let alone a proactive approach to designing systems that can ensure a positive and beneficial societal impact. The ecosystem which encompasses governments, citizens and communities is both evolving and adaptive, and the only way to examine and understand the development of Web-enabled government, and its possible implications, is to consider government itself as a\" social machine\" within a social machine ecosystem. In this light, there are significant opportunities and challenges for government that this paper identifies.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest editorial. Innovations in Web communications infrastructure.(In:(1) Innovations in Web Communications Infrastructure;(2) Middleware Challenges for Next Generation Networks and Services)",
            "Publication year": 2007,
            "Publication url": "https://eprints.soton.ac.uk/50022/1/computer-nets-editorial-2007.pdf",
            "Abstract": "The Web dominates, and will continue to dominate, our lives in ways that were unimaginable just a few years ago. Any business, organization, group, cause or individual that seeks to reach beyond its own immediate locality recognizes the value of a Web presence. Undeniably, the Web has radically reshaped the way we communicate with the world. Among the many astonishing things about the Web is the fact that it has been achieved with the aid of what are essentially basic technologies: a client, a server, and a network, together with a simple text-based mark-up language and a basic addressing scheme to locate resources. What we have done with these basic elements is truly amazing. This achievement does not stop us, however, from designing, developing and testing new technologies in order to add value to the Web, to enhance the way we use it or to move the Web in new directions. Our experience of the Web is still far from perfect in many ways, and our expectations of the Web have changed radically–simply as a result of its presence in our lives. In addition, the basic technology that we use to access and describe resources has changed dramatically. For example, mobile and embedded Internet-ready devices are growing in use.The aim of this special issue is to present research that aims to investigate how ways in which our experience, usage and understanding of the Web can be enhanced. One of our primary goals has been to look at how changes in the underlying network layer can affect what features can be added to the Web: for example, a better way to find and tag Web pages. The Web is now so vast that the task of finding …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open data and charities. 1-87",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=4265527581748164693&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of data science in web science",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7478499/",
            "Abstract": "Web science relies on an interdisciplinary approach that seeks to go beyond what any one subject can say about the World Wide Web. By incorporating numerous disciplinary perspectives and relying heavily on domain knowledge and expertise, data science has emerged as an important new area that integrates statistics with computational knowledge, data collection, cleaning and processing, analysis methods, and visualization to produce actionable insights from big data. As a discipline to use within Web science research, data science offers significant opportunities for uncovering trends in large Web-based datasets. A Web science observatory exemplifies this relationship by offering an online platform of tools for carrying out Web science research, allowing users to carry out data science techniques to produce insights into Web science issues such as community development, online behavior, and information …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Computer support collaborative authoring model for authoring adaptive educational hypermedia systems",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Hugh-Davis-6/publication/267819662_A_Computer_Support_Collaborative_Authoring_Model_for_Authoring_Adaptive_Educational_Hypermedia_Systems/links/54d9f0230cf25013d0437380/A-Computer-Support-Collaborative-Authoring-Model-for-Authoring-Adaptive-Educational-Hypermedia-Systems.pdf",
            "Abstract": "Adaptive Educational Hypermedia (AEH) systems require massive and complex knowledge spaces in order to provide adaptation and personalisation in learning. Hence, it is difficult for a single person or a small group of people to develop them effectively. Former studies addressed the problem by developing collaborative authoring systems. However, the systems tended to support object reusability rather than enabling authors to collaboratively work in the same workspace. Potential ways to address these issues come from recent developments in social semantic web technologies that have successfully shifted authoring to a community based development. The application of such technologies together with Computer Support Collaborative Work (CSCW) could enhance collaborative authoring on documents and ontologies. This paper presents a Computer Support Collaborative Adaptation Authoring (CSCAA) model for AEH systems. The novelty of the model lies in the use of Semantic Mediawiki and the application of CSCW principles. The model aims at improving authoring for AEH systems by allowing more people to participate and enhancing authors’ interaction. We have established requirements for the model and evaluated it by drawing a comparison with other existing collaborative authoring models made for developing documents, simple knowledge, and ontology. The result shows that such tools can be complementary for CSCAA, and CSCAA has a novelty by applying the CSCW aspects for authoring adaptation.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lhd: Optimising linked data query processing using parallelisation",
            "Publication year": 2013,
            "Publication url": "https://openreview.net/pdf?id=H1-GReWOZS",
            "Abstract": "In the past few years as large volume of Linked Data has been published, and processing distributed SPARQL queries over the Linked Data cloud is becoming increasingly challenging. The high data traffic cost and response time significantly affect the performance of distributed SPARQL queries as the number of SPARQL end point and the volume of data at each endpoint increase. In this context, parallelisation is promising to fully exploit the potential of connections to SPARQL endpoints and thus improve the efficiency of querying Linked Data. We propose LHD, a distributed SPARQL engine that is built on a highly parallel infrastructure and able to minimise query response time, and we evaluate its performance using a BSBM based environment.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The southampton university web observatory",
            "Publication year": 2013,
            "Publication url": "https://core.ac.uk/download/pdf/29035728.pdf",
            "Abstract": "The Web Observatory is a project that started under the auspices of the Web Science Trust network of labs (WSTnet) to support activities on Web data collection and analysis across research institutions around the world. The objective is to build from a bottom-up fashion a distributed environment empowers Web scientists not only with access to datasets about activity on the Web but also to interoperable analytic and visualisation tools that can be combined to allow the exploration of the various aspects of activity on the Web. The harmonization of existing infrastructures is the first step to vision, which is supported by a W3C community group that discusses standardization aspects for the interoperability of Web Observatories. In this paper we present the Web Observatory that is currently deployed at the University of Southampton. We outline its infrastructure, datasets and tools. The aim is to provide a summary of the functional aspects of the Southampton University Web Observatory (SUWO). Those aspects cover the following aspects of research about the Web:",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Returns to Buying Online Sentiment Winners",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=13797678942700386337&hl=en&oi=scholarr",
            "Abstract": "We study the time evolution of the relationship between sentiment expressed in online messages and asset prices. Research in this area typically assumes that sentiment will always have a consistent relationship to price, both in terms of the sign of the relationship and the lag time between sentiment occurring and price reacting. We argue that factors latent to the text, such as investors trust in a particular author, make such a relationship unlikely. To test this theory we study the largest sample of online content assembled for an academic paper on this topic (10.2 million messages over a 15 month period). We show, using cross correlation analysis, that there is a variable, long run relationship between sentiment and price for the stocks in the S&P 100 index. We present a simple trading strategy based on the sentiment signal that produces significant excess returns over the sample period.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Satellite-enabled educational services specification and requirements analysis based on user feedback",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2008.020668",
            "Abstract": "Advanced tele-education services provision in remote geographically dispersed user communities (such as agriculture and maritime), based on the specific needs and requirements of such communities, implies significant infrastructural and broadband connectivity requirements for rich media, timely and quality-assured content delivery and interactivity. The solution to broadband access anywhere is provided by satellite-enabled communication infrastructures. This paper aims to present such satellite-based infrastructures that are capable of addressing the core requirements of rich media educational services in remote areas. The paper proceeds to examine a set of services that will realise such satellite-based distance learning systems and to assess the targeted users' interest in such services. The presented work is undertaken within the framework of the EU-funded Broadband Access Satellite Enabled Education …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:_kc_bZDykSQC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Systems & Platforms: OS Design and Performance",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/id/eprint/10808",
            "Abstract": "Systems & Platforms: OS Design and Performance - EdShare Southampton EdShare Home \nBrowse By Year By Author Tags Course code University structure Share About Help Login \nLogin Systems & Platforms: OS Design and Performance Loading Loading previews... \ncomp1214-13-OS-design-perf.ppt Slideshow Download (306kB) comp1214-13-OS-design-perf.ppt \ncomp1214-13-OS-design-perf.ppt 1 file in this resource Systems & Platforms: OS Design and \nPerformance Added By: Mr Rikki Prince Date Added: 16 Apr 2013 15:28 Creators Name: Dr \nAthanassios Tiropanis Mr Rikki Prince Dr Yvonne Howard Tags: comp1214, operating systems, \nsystems & platforms, design, performance Viewing permissions: University Course codes: \nCOMP1214 Link: http://edshare.soton.ac.uk/id/eprint/10808 Downloads & Views Actions (login \nrequired) View Item View Item Toolbox There are no actions available for this resource. (s) …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From FAIR research data toward FAIR and open research software",
            "Publication year": 2020,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/itit-2019-0040/html",
            "Abstract": "The Open Science agenda holds that science advances faster when we can build on existing results. Therefore, research data must be FAIR (Findable, Accessible, Interoperable, and Reusable) in order to advance the findability, reproducibility and reuse of research results. Besides the research data, all the processing steps on these data – as basis of scientific publications – have to be available, too.For good scientific practice, the resulting research software should be both open and adhere to the FAIR principles to allow full repeatability, reproducibility, and reuse. As compared to research data, research software should be both archived for reproducibility and actively maintained for reusability.The FAIR data principles do not require openness, but research software should be open source software. Established open source software licenses provide sufficient licensing options, such that it should be the rare …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:LO7wyVUgiFcC",
            "Publisher": "De Gruyter Oldenbourg"
        },
        {
            "Title": "Building a Global Network of Web Observatories to Study the Web: A Case Study in Integrated Health Management",
            "Publication year": 2016,
            "Publication url": "https://www.qscience.com/content/papers/10.5339/qfarc.2016.ICTOP3092?utm_source=TrendMD&utm_medium=cpc&utm_campaign=Qatar_Foundation_Annual_Research_Conference_Proceedings_TrendMD_1",
            "Abstract": "The Web is barely 25 years old but in that time it has changed every aspect of our lives. Because of its sociotechnical rather than purely engineered nature, not only is the Web changing society but also we shape the way the technology evolves. The whole process is inherently co-constituted and as such its evolution is unlike any other system. In order to understand how the Web might evolve in the future - for good or bad - we need to study how it has evolved since its inception and the associated emergent behaviours. We call this new research discipline Web Science [1,2], and it is important for all our futures that we urgently address its major research challenges. We are fast becoming part of a world of digital inter-connectivity, where devices such as smartphones, watches, fitness trackers, and household goods are part of a growing network, capable of sharing data and information. Increasingly, the Web has …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Hamad bin Khalifa University Press (HBKU Press)"
        },
        {
            "Title": "Worldwide universities network (WUN) web observatory: Applying lessons from the web to transform the research data ecosystem",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3041021.3051691",
            "Abstract": "The ongoing growth in research data publication supports global intra-disciplinary and inter-disciplinary research collaboration but the current generation of archive-centric research data repositories do not address some of the key practical obstacles to research data sharing and re-use, specifically: discovering relevant data on a global scale is time-consuming; sharinglive'and streaming data is non-trivial; managing secure access to sensitive data is overly complicated; and, researchers are not guaranteed attribution for re-use of their own research data. These issues are keenly felt in an international network like the Worldwide Universities Network (WUN) as it seeks to address major global challenges. In this paper we outline the WUN Web Observatory project's plan to overcome these obstacles and, given that these obstacles are not unique to WUN, we also propose an ambitious, longer-term route to their solution …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic technologies in learning and teaching (SemTech) report",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=13280528613609131769&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Joint Information Systems Council (JISC)"
        },
        {
            "Title": "Systems & Platforms: Course Introduction",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/10468/",
            "Abstract": "Systems & Platforms: Course Introduction - EdShare Southampton EdShare Home Browse By \nYear By Author Tags Course code University structure Share About Help Login Login Systems & \nPlatforms: Course Introduction Loading Loading previews... 2016 intro Slideshow Download \n(2MB) 2016 intro 2016 intro 1 file in this resource Systems & Platforms: Course Introduction Added \nBy: Mr Rikki Prince Date Added: 29 Jan 2013 11:10 Creators Name: Dr Yvonne Howard Mr Rikki \nPrince Dr Athanassios Tiropanis Tags: comp1214, operating systems, systems & platforms \nViewing permissions: University Course codes: COMP1214 Link: \nhttp://edshare.soton.ac.uk/id/eprint/10468 Downloads & Views Actions (login required) View Item \nView Item Toolbox There are no actions available for this resource. Collection(s) COMP1214 \ncourse materials EdShare For any questions or feedback, please contact us. Copyright © 2008-of -:…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Use of ID-based Cryptography for the Efficient Verification of the Integrity and Authenticity of Web Resources",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-05284-2_20",
            "Abstract": "As the amount of information resources on the Web keeps increasing so are the concerns for information integrity, confidentiality and authenticity. In Web 2.0 users are producers as well as consumers of content and metadata, which makes guaranteeing the authenticity and integrity of information critical. The scale of the Web requires that any proposals in this direction require minimal (if any) infrastructural or administrative changes. This paper proposes the use of ID-based cryptography (IBC) to address requirements for integrity and authenticity of Web resources using either the URL/URI of a resource or the DNS name part of if. This approach presents certain challenges, which are discussed along with the pros and cons of different designs and implementations.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:p__nRnzSRKYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Guest editorial: Special section on semantic technologies for learning and teaching support in higher education",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6213195/",
            "Abstract": "This special issue reports on the latest developments on the use of semantic technologies to support learning, especially in higher education and lifelong learning contexts. The Guest Editors then provide an overview of the technical articles presented in this issue.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The platform effect: Analysing user activity on Tumblr",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-01437-7_13",
            "Abstract": "One of the fundamental aspects of online social network platforms is that they provide a number of core affordances. The actual mechanisms of these affordances vary in different platforms but their main purposes are similar: allowing users to create content and connect with each other. In this paper, we study user activity on Tumblr, we analyse user activity around the most popular posts in one year, reflecting on the effects of Tumblr’s affordances, communication style, and content discovery mechanisms on its users’ behaviour. Our findings show that the majority of user activity on Tumblr is non-verbal, users reblog and like posts but they rarely engage in conversations with others.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A roadmap for semantic technology adoption in UK higher education",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=13032064721870704459&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building a web observatory for south Australian government: supporting an age friendly population",
            "Publication year": 2015,
            "Publication url": "https://eprints.soton.ac.uk/378418/1/main.pdf",
            "Abstract": "The South Australian Government has played a leading role in the digital government trend, and Adelaide has led the move towards becoming a” smart city” ever since the” multi-function polis” in the early 1990s. As a part of the move towards Open Government many jurisdictions have created platforms upon which to publish open public data, and South Australia’s data. sa. gov. au is where its public government data are made available as csv files for use by business and the community. However, there is much more to opening up data than just publishing it, because when it comes to data that contains sensitive and private information, the current data publishing and sharing solutions hit barriers due to the lack of data provenance and security mechanisms, as well as limited use/usability for applications. Further, building analytic applications that make use of those datasets in line with their sharing policies is another challenge as many users have little digital literacy. These issues can be addressed by a new data sharing platform called the Web Observatory which allows both data and analytics to be published, shared and consumed in a secure and transparent manner. This paper describes the joint effort of building a Web Observatory for the South Australian Government through the collaboration of the University of South Australia and the University of Southampton.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WDFed: exploiting big data on the Web using metadata and RESTful APIs",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=10556792976986709448&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EDEN (European Distance and E-Learning Network)",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=14363940615058881318&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decentralised coordination of electrical generators in the smart grid using message passing",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.220.5289&rep=rep1&type=pdf",
            "Abstract": "In an effort to mitigate the effects of human-induced climate change, agreements have been made by numerous governments (International Energy Agency, 2011) to reduce global carbon dioxide (CO2) emissions. The current global target is to reduce CO2 emissions by 50%, compared with 1990 levels, by the year 2050 (Department of Energy and Climate Change, 2009b). To help achieve this global target, the UK has committed to transition to a low carbon economy via an 80% reduction in emissions by the year 2050. Therefore, over the coming years there will be an increasing demand for the electrification of heating and transport (Department of Energy and Climate Change, 2009a), coupled with greater low carbon electricity generation, instead of increasing high CO2 emitting coal or gas based electricity production, in order to meet this target. However, as a result, electricity networks will have to evolve to incorporate increased generation. Consequently, the integration of renewable generation will be needed to ensure the 2050 target is met. Owing to the intermittent nature of the resources the generators harness, the complexity of integrating these technologies will be increased.Electricity networks around the world are outdated and inefficient at transporting electricity (US Department of Energy, 2003) and (Department of Energy and Climate Change, 2009a); this is because the electricity networks were originally built to transport power from a small amount of large power stations to end consumers. However, more and more generators, end consumers and electrical devices are being added to electricity networks daily. Therefore, without a …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Technical report, University of Southampton"
        },
        {
            "Title": "Semantics in Education",
            "Publication year": 2014,
            "Publication url": "https://www.computer.org/publications/tech-news/computing-now/semantics-in-education",
            "Abstract": "Semantics represents the backbone of several of today’s technological trends and visions, from the Internet of Things (IoT) and Web of Things (WoT) paradigms to the Open Data and Linked Data initiatives. Moreover, it is increasingly advertised as a key enabling technology in a growing number of application domains. In the past ten years, we at Polytechnic University of Turin have been considering the possible benefits of applying semantic technologies to the field of education. For instance, in two recently closed research initiatives, cofunded by the European Commission under the Lifelong Learning Programme, we studied how to exploit semantics to find common or missing learning units across transnational qualifications (TAMTAM project) and to fill the competency gap between learners and job-seekers (MATCH project).",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Social Enterprise",
            "Publication year": 2011,
            "Publication url": "http://www.edshare.soton.ac.uk/6626/",
            "Abstract": "The Social Enterprise - EdShare Southampton EdShare Home Browse By Year By Author \nTags Course code University structure Share About Help Login Login The Social Enterprise \nLoading Loading previews... 1-social-enterprise.pdf Text Download (72MB) 1-social-enterprise.pdf \n1-social-enterprise.pdf 1 file in this resource The Social Enterprise Added By: Dr Thanassis \nTiropanis Date Added: 11 Feb 2011 17:46 Creators Name: Dr Thanassis Tiropanis Viewing \npermissions: University Course codes: COMP6051, COMP6052, COMP6217, COMP6250 \nLink: http://edshare.soton.ac.uk/id/eprint/6626 Downloads & Views Actions (login required) \nView Item View Item Toolbox There are no actions available for this resource. EdShare For any \nquestions or feedback, please contact us. Copyright © 2008-2020 University of Southampton \nTag Cloud Latest Additions Take-Down Request & Complaints Procedure Terms and for a …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using semantic indexing to improve searching performance in web archives",
            "Publication year": 2013,
            "Publication url": "http://eprints.ncrm.ac.uk/4008/",
            "Abstract": "he sheer volume of electronic documents being published on the Web can be overwhelming for users if the searching aspect is not properly addressed. This problem is particularly acute inside archives and repositories containing large collections of web resources or, more precisely, web pages and other web objects. Using the existing search capabilities in web archives, results can be compromised because of the size of data, content heterogeneity and changes in scientific terminologies and meanings. During the course of this research, we will explore whether semantic web technologies, particularly ontology-based annotation and retrieval, could improve precision in search results in multi-disciplinary web archives.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:CHSYGLWDkRkC",
            "Publisher": "ThinkMind"
        },
        {
            "Title": "FAIR and Open Computer Science Research Software",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1908.05986",
            "Abstract": "In computational science and in computer science, research software is a central asset for research. Computational science is the application of computer science and software engineering principles to solving scientific problems, whereas computer science is the study of computer hardware and software design. The Open Science agenda holds that science advances faster when we can build on existing results. Therefore, research software has to be reusable for advancing science. Thus, we need proper research software engineering for obtaining reusable and sustainable research software. This way, software engineering methods may improve research in other disciplines. However, research in software engineering and computer science itself will also benefit from reuse when research software is involved. For good scientific practice, the resulting research software should be open and adhere to the FAIR principles (findable, accessible, interoperable and repeatable) to allow repeatability, reproducibility, and reuse. Compared to research data, research software should be both archived for reproducibility and actively maintained for reusability. The FAIR data principles do not require openness, but research software should be open source software. Established open source software licenses provide sufficient licensing options, such that it should be the rare exception to keep research software closed. We review and analyze the current state in this area in order to give recommendations for making computer science research software FAIR and open. We observe that research software publishing practices in computer science and in …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open source research software",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9153295/",
            "Abstract": "Reports on the need to make make software open source. It should be both archived for reproducibility and actively maintained for reusability. In computational and computer science, research software is a central asset for development activities. For good scientific practice, the resulting research software should be open source. Established open source software licenses provide sufficient options for granting permissions such that it should be the rare exception to keep research software closed. Proper engineering is required for obtaining reusable and sustainable research software. This way, software engineering methods may improve research in other disciplines. However, research in software engineering and computer science itself will also benefit when programs are reused. To study the state of the art in this field, we analyzed research software publishing practices in computer and computational science …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:anf4URPfarAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPARQL-to-SQL on Internet of Things Databases and Streams",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-46523-4_31",
            "Abstract": "To realise a semantic Web of Things, the challenge of achieving efficient Resource Description Format (RDF) storage and SPARQL query performance on Internet of Things (IoT) devices with limited resources has to be addressed. State-of-the-art SPARQL-to-SQL engines have been shown to outperform RDF stores on some benchmarks. In this paper, we describe an optimisation to the SPARQL-to-SQL approach, based on a study of time-series IoT data structures, that employs metadata abstraction and efficient translation by reusing existing SPARQL engines to produce Linked Data ‘just-in-time’. We evaluate our approach against RDF stores, state-of-the-art SPARQL-to-SQL engines and streaming SPARQL engines, in the context of IoT data and scenarios. We show that storage efficiency, with succinct row storage, and query performance can be improved from 2 times to 3 orders of magnitude.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:VLnqNzywnoUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Impact of consolidating Web based social networks on derived trust factors",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/345754/1/Impact_of_Consolidating_Web_Based_Social_Networks_on_Derived_Trust_Factors.pdf",
            "Abstract": "Individuals are typically members of a variety of web-based social networks (both explicit and implied), but existing trust inference mechanisms typically draw only on a single network in order to calculate trust between any two individuals. This both reduces the likelihood that a trust value can be calculated (as both people have to be members of the same network), and reduces the quality of any trust inference that can be drawn (as it will be based on only a single network, typically representing a single type of relationship). To make trust calculations on multiple distributed (MuDi) social networks those networks must be first consolidated into a single network. This is challenging as simple consolidation strategies such as summing or averaging trust values tend to distort trust values. In this paper we present an analysis of different consolidation approaches for MuDi trust networks, and propose a Weighted Ordered Weighted Averaging (WOWA) approach, that avoids these problems by including the value added (by a given tie in a given network) as a factor during consolidation. We evaluate the consolidation strategies using a numerical simulation, where we generate a range of networks that simulate the characteristics of real-world networks, and analyse what happens to trust factors such as average strength of trust ties (TS), and average length of trust path (TL), as they are consolidated with different node and tie overlap. We discover that while simple strategies such as summing or averaging distort the trust values in the consolidated network by amplifying or dampening trust metrics, the WOWA approach maintains the integrity of the trust metrics …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "WDFed: exploiting cloud databases using metadata and RESTful APIs",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-49157-8_30",
            "Abstract": "As a result of the development of Big Data and cloud databases, a huge amount of data are available on the Web, not only as dump files but also in databases. Due to the volume and heterogeneity of these data, it is a challenging task to find and consume them. To reduce the barrier of data sharing and reuse on the Web, we propose a data cataloguing framework called WDFed that combines the strength of both Linked Data and REST. WDFed adopts the Data Catalog Vocabulary (DCAT) to harmonise database metadata, and develops a two-way mapping between DCAT and a RESTful API. This framework provides an interoperable middle layer that enables humans as well as applications to discover and consume Big Data on the Web in a semi-automatic manner. The framework is implemented in a data portal called Web Observatory and we present several use cases to evaluate the framework.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A framework of collaborative adaptation authoring",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5767005/",
            "Abstract": "Adaptive Educational Hypermedia systems (AEH) enhance learning by adaptation and personalisation. As a consequence, wide ranging knowledge and learning content are needed. Problems then emerge in the provision of suitable authoring tools to carry out the authoring process which is complex and time consuming. Based on the fact that former research studies on authoring have identified drawbacks in collaboration, usabilility, efficiency, or interoperability, this paper proposes an approach for collaborative adaptation authoring for adaptive learning. The intended approach aims at improving authoring for AEH systems by allowing many people to participate and enhancing authors' interaction. The novelty of the approach lies in how the domain knowledge which has been semantically defined is enriched, and in the application of Computer Support Collaborative Work (CSCW). This approach adopts the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EINS D1. 2 Roadmap for an economic theory for information networks",
            "Publication year": 2015,
            "Publication url": "https://www.narcis.nl/publication/RecordID/oai:pure.knaw.nl:publications%2F771af138-fe16-44e3-854f-19cdbfc22ba3",
            "Abstract": "This Deliverable collects a series of research perspectives on the economic analysis of Internet-related phenomena. In the spirit of multidisciplinarity that pervades the project, many of these contributions reflect the disciplinary perspectives of consortium members. They illustrate the two-way relation between Internet Science and economics – the use of economic methods and tools to analyse behaviour on and by the Internet and the implications of the Internet for economics.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:N5tVd3kTz84C",
            "Publisher": "European Commission"
        },
        {
            "Title": "Crime applications and social machines: crowdsourcing sensitive data",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2487788.2488075",
            "Abstract": "The authors explore some issues with the United Kingdom (UK) crime reporting and recording systems which currently produce Open Crime Data. The availability of Open Crime Data seems to create a potential data ecosystem which would encourage crowdsourcing, or the creation of social machines, in order to counter some of these issues. While such solutions are enticing, we suggest that in fact the theoretical solution brings to light fairly compelling problems, which highlight some limitations of crowdsourcing as a means of addressing Berners-Lee's\" social constraint.\" The authors present a thought experiment--a Gendankenexperiment-in order to explore the implications, both good and bad, of a social machine in such a sensitive space and suggest a Web Science perspective to pick apart the ramifications of this thought experiment as a theoretical approach to the characterisation of social machines.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Paolozzi, S. Papamarkos, G. Pierri, A. Poulovassilis, A.",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=J2_B5AbqA8sC&oi=fnd&pg=PA245&dq=info:s-04PYJnWp0J:scholar.google.com&ots=Se4zdeySNj&sig=8tOUQ-Hu6KncEXVJqlLctqfwLUM",
            "Abstract": "Paolozzi, S. Papamarkos, G. Pierri, A. Poulovassilis, A. Page 258 The Learning Grid Handbook \n245 S. Salerno et al.(Eds.) IOS Press, 2008 © 2008 The authors and IOS Press. All rights \nreserved. Asensio-Pérez, JI Bote-Lorenzo, ML Caballe, S. Capuano, N. Christophides, V. \nChristou, IT Contreras, P. D’Andria, F. Daradoumis, T. de Freitas, S. Dimitriadis, YA Doerner, R. \nGaeta, A. Gaeta, M. Gómez-Sánchez, E. Gutiérrez-Carreón, G. Harrison, I. Jiménez, S. Jorba, \nJ. Jorrín-Abellán, IM Keenoy, K. Kotzinos, D. Kuehn, G. Laria, G. Libbrecht, P. Lievonen, M. \nAuthor Index 93 93 173 Magoulas, G. Martrat, J. Mee, A. 3, 57 157 199 Miranda, S. Murtagh, F. \nOliver, M. 107 125 39, 173 143 93 107 21, 57 3, 73 93 39 143 125 39 93 157 157 107 125 219 \n107 Orciuoli, F. Paolozzi, S. Papamarkos, G. Pierri, A. Poulovassilis, A. Rigaux, P. Ritrovato, \nP. Rosenberg, D. Roussos, K. Salerno, S. Spyratos, N. Tiropanis, T. Tsekeridou, S. Ullrich-…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Evaluating three scrutability and three privacy user privileges for a scrutable user modelling infrastructure",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02247-0_48",
            "Abstract": "This paper describes the evaluation of a Scrutable User Modelling Infrastructure. SUMI is intended to form a service to allow users to share their user models from social e-networking and e-commerce providers to educational systems. The model is scrutable, meaning users can inspect and correct the data that is held about them, and implements privacy policies so that users can control how their models are accessed by other users. This evaluation was conducted with 107 users, which were exposed to a prototype service, for determining whether the proposed scrutability and privacy privileges were acceptable to the users, whether the users were able to achieve the desired outcome, and whether they understood the consequences of their interactions with the system. The conclusions show that the users expressed their general approval of the proposed privileges while making useful suggestions …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Trends for community-aware learning services over wireless infrastructure by the example of Greece",
            "Publication year": 2007,
            "Publication url": "https://eprints.soton.ac.uk/265126/1/Tiropanis_Report_kazrena-2007-v2.pdf",
            "Abstract": "There is a long history of evolution of e-learning systems which has been ongoing for the last few decades. A combination of technological and pedagogical innovation as well as new patterns of social interaction are leading to a paradigm shift in all forms of learning. People use technology and in particular the Web to learn and interact with each other. Increasingly, however, they are starting to interact more frequently and in novel ways (eg instant messaging, blogs, etc) and, at the same time, they start to produce and classify content (social tagging, content management services, etc). Therefore, people are members of a learning society in which each member can be both a producer and a user of knowledge.Both pedagogical and technological innovation is behind this evolution. In terms of technology, it appears that this new e-learning paradigm (for which the term e-learning 2.0 was coined) is largely supported by technological innovation enabling more interactive rich-media applications over the Web to empower user communities. This set of technologies is often referred to as Web 2.0. Infrastructure for deploying software as a service and broadband networking for high quality communication and efficient access to content repositories are also important enablers of this paradigm shift.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scrutable User Modelling Infrastructure for Enriching Lifelong User Modelling",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=7557481563768307765&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sharing databases on the Web with Porter Proxy",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3041021.3051694",
            "Abstract": "With large number of datasets now available through the Web, data-sharing ecosystems such as the Web Observatory have emerged. The Web Observatory provides an active decentralised ecosystem for datasets and applications based on a number Web Observatory sites, each of which can run in a different administrative domain. On a Web Observatory site users can publish and securely access datasets across domains via a harmonised API and reverse proxies for access control. However, that API provides a different interface to that of the databases on which datasets are stored and, consequently, existing applications that consume data from specific databases require major modification to be added to the Web Observatory ecosystem. In this paper we propose a lightweight architecture called Porter Proxy to address this concern. Porter Proxy exposes the same interfaces as databases as requested by the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Systems & Platforms: Multicomputers and Distributed Systems",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/10804/",
            "Abstract": "Systems & Platforms: Multicomputers and Distributed Systems - EdShare Southampton \nEdShare Home Browse By Year By Author Tags Course code University structure Share \nAbout Help Login Login Systems & Platforms: Multicomputers and Distributed Systems \nLoading Loading previews... comp1214-11-multicomp-dist-syst.ppt Slideshow Download (368kB) \ncomp1214-11-multicomp-dist-syst.ppt comp1214-11-multicomp-dist-syst.ppt 1 file in this \nresource Systems & Platforms: Multicomputers and Distributed Systems Added By: Mr Rikki \nPrince Date Added: 16 Apr 2013 10:16 Creators Name: Mr Rikki Prince Dr Yvonne Howard \nDr Athanassios Tiropanis Tags: comp1214, operating systems, systems & platforms, \ndistributed systems Viewing permissions: University Course codes: COMP1214 Link: http://edshare.soton.ac.uk/id/eprint/10804 \nDownloads & Views Actions (login required) View Item View Item Toolbox There …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:EYYDruWGBe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative authoring of adaptive learning resources: Opportunities and challenges",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6144777/",
            "Abstract": "One issue regarding adaptive learning systems is the provision of learning resources that consist of domain knowledge, pedagogical knowledge with adaptation rules, and learning content. Challenges emerge concerning the lack of usability, interoperability, efficiency and collaboration. This paper critically discusses an enhanced collaborative authoring approach to developing adaptive learning resources. The main motivation behind the proposed approach is the evidence that creating adaptive learning resources is a complex, time-consuming process. Therefore, teachers must work together to reduce individual efforts. Until recently, collaborative work has not been strongly supported by existing authoring tools for adaptive learning. The contribution of this paper is twofold: the analysis of current authoring tools for learning and the proposed approach, which addresses the importance of collaboration and reuse in …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network science, web science, and internet science",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/fullHtml/10.1145/2699416",
            "Abstract": "Exploring three interdisciplinary areas and the extent to which they overlap. Are they all part of the same larger domain?",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:tkaPQYYpVKoC",
            "Publisher": "ACM"
        },
        {
            "Title": "Systems & Platforms: Introduction to OS Abstraction",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/10470/",
            "Abstract": "Systems & Platforms: Introduction to OS Abstraction - EdShare Southampton EdShare Home \nBrowse By Year By Author Tags Course code University structure Share About Help Login \nLogin Systems & Platforms: Introduction to OS Abstraction Loading Loading previews... \ncomp1214-1-os-abstraction.pptx Slideshow Download (917kB) comp1214-1-os-abstraction.pptx \ncomp1214-1-os-abstraction.pptx 1 file in this resource Systems & Platforms: Introduction to OS \nAbstraction Added By: Mr Rikki Prince Date Added: 29 Jan 2013 11:27 Creators Name: Mr \nRikki Prince Dr Yvonne Howard Dr Athanassios Tiropanis Tags: comp1214, operating systems, \nsystems & platforms, abstract Viewing permissions: University Course codes: COMP1214 \nLink: http://edshare.soton.ac.uk/id/eprint/10470 Downloads & Views Actions (login required) \nView Item View Item Toolbox There are no actions available for this resource. Collection(s) or -…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open data and charities",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/341346/",
            "Abstract": "Open data involves a paradigm shift in the way organisations manage their information and data: moving from a default of charities keeping data resources locked up in underused internal systems, to building a shared ‘Web of Data’. The emergence of the open data movement has supported powerful new models of creativity, innovation and public engagement. Although most of the recent stories of progress and success in the open data field come from government and research where open data is more established, this report sets out to explain the ways in which open data is increasingly coming to play a role in the charitable sector. Existing open government data can be used by charities to add value to their work, to target services better, to improve advocacy and fundraising, and to support knowledge sharing and collaboration between different charities and agencies. Crowdsourcing of open data also offers a new way for charities to gather intelligence, and a wide range of freely available online tools can support charities to analyse open data resources. Realising the potential of open data will require charities to meet a number of technical and organisational challenges. Indeed many charities will need to address key issues relating to open data, whether they choose to pursue benefits from open data or not (as regulatory, funding and performance indication is published online by researchers, by government and by others in the sector). This report reviews open data as it relates to the charitable sector, drawing on long experience of developing open data in research and government, as well as early work exploring open data with charities …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Nominet Trust"
        },
        {
            "Title": "Web Service Scenarios",
            "Publication year": 2011,
            "Publication url": "https://eprints.soton.ac.uk/273219/1/Scenarios%2520Final.pdf",
            "Abstract": "A user is interested in houses that have the best restaurants around. The user visits a housing website and adds it to MashMaker by clicking an icon in the browser. The houses are displayed in MashMaker as a tree where each house is a node, when a node is clicked MashMaker suggests appropriate queries like “things nearby”. The user searches for food nearby, then applies a filter",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algorithmic Trading and Mutual Fund Performance",
            "Publication year": 2018,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3111598",
            "Abstract": "We examine the effects of algorithmic trading (AT) on the US mutual fund industry and find that funds holding stocks with higher AT intensity have lower holdings returns and higher interim trading profits (return gap). This effect survives controls of effective spread and execution shortfall. Our results suggest that AT’s effect on funds is via the trading channel rather than funds’ stock selection abilities. AT’s positive effects of enhanced market quality on fund performance dominates its negative predatory trading influence. Using exchange automation as an instrument, we find evidence suggesting the effect of AT on the return gap is causal.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing the value of social media for organisations: The case for charitable use",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2786451.2786457",
            "Abstract": "Social media offer opportunities for organisations of all sectors to communicate with their audiences. There is little understanding, however, of what value these services actually provide for many of these organisations. Focusing on the charitable sector, this paper brings together the results of a number of studies into a triangulation whose own results and findings are discussed, and an overall model of value assessment for social media is presented. Emphasis is placed on eliciting the motivations and aims of both the charity and their supporters, along with observing the actual behaviour that then occurs from each side. By comparing these phenomena, and appreciating how they all interact with each other, it is argued that greater understanding around how valuable a particular organisation will find social media can be obtained.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CrowdUI: Supporting Web Design with the Crowd",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/3394978",
            "Abstract": "Web design is a complex and challenging task. It involves making many design decisions that materialise preconceived notions of user needs that may or may not be true. In this paper, we investigate supporting the co-design of a website with visual feedback elicited from the website's community of users. Website users can express their needs by re-arranging and modifying the website's layout and design. To explore and validate this idea, we present CrowdUI, a web-based tool that enables members of the community of a website to visually express their design improvement ideas, frustrations and needs, and to send this feedback to the person in charge of designing or maintaining the website.CrowdUI is validated in a study with 45 users of a popular social media and networking website. Second, our qualitative evaluation with 60 experienced web developers shows that CrowdUI is able to elicit diverse and …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:HtEfBTGE9r8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Taking the relationship to the next level: a comparison of how supporters converse with charities on facebook and twitter",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2615569.2615648",
            "Abstract": "Social media provide a unique opportunity for charities to reach a large audience with whom they can engage in productive two-way conversations. This abstract reports findings from a study that seeks to determine the extent to which these conversations occur, and whether they differ between Facebook and Twitter. Differences arise showing that Facebook receives more conversations in response to the charities' own posts. However, on Twitter more comments are made per each engaged supporter, which could represent more unsolicited discussion that provides an alternative type of value.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A roadmap for semantic technology adoption in UK higher education",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/268013/1/ALT-C09_conf_intro_abstracts_web_%2528dragged%2529_1.pdf",
            "Abstract": "This paper discusses the current use of semantic technologies in the UK higher education, the value of these technologies for learning and teaching and a roadmap for semantic technology adoption by higher education institutions in the next five to ten years. This work is the output of the JISC funded project SemTech (Semantic Technologies for Learning and Teaching—www. semtech. ecs. soton. ac. uk). A survey on the current adoption of semantic technologies in higher education showed that relevant semantic tools and services can be:",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the 2nd International Workshop on Semantic Web Applications in Higher Education (SemHE'10)",
            "Publication year": 2010,
            "Publication url": "https://eprints.soton.ac.uk/271750/",
            "Abstract": "This workshop is the second in a series investigating the potential of semantic web technologies in higher education. There has been much interest in this topic within the Technology Enhanced Learning, the Higher Education Support and the Web Science communities. Recently, there is particular interest in how linked data technologies could address HE challenges. Following the success of the 1st SemHE workshop last year, SemHE will continue to involve a wider international audience, report on developments and discuss future research directions. SemHE is inviting the submission of both full papers and short papers in this area. The submission and presentation of position papers is also invited. SemHE is supported by the communities of the SemTech and ENSEMBLE projects that organised the 1st SemHE workshop in 2009.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:R3hNpaxXUhUC",
            "Publisher": "www. semhe. org"
        },
        {
            "Title": "Linked data, data mining and external open data for better prediction of at-risk students",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6996973/",
            "Abstract": "Research in student retention is traditionally survey-based, where researchers use questionnaires to collect student data to analyse and to develop student predictive model. The major issues with survey-based study are the potentially low response rates, time consuming and costly. Nevertheless, a large number of datasets that could inform the questions that students are explicitly asked in surveys is commonly available in the external open datasets. This paper describes a new student predictive model that uses commonly available external open data instead of traditional questionnaires/surveys to spot `at-risk' students. Considering the promising behavior of neural networks led us to develop student predictive models to predict `at-risk' students. The results of empirical study for undergraduate students in their first year of study shows that this model can perform as well as or even out-perform traditional survey …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Students’ performance prediction by using institutional internal and external open data sources",
            "Publication year": 2013,
            "Publication url": "https://eprints.soton.ac.uk/353532/1/Students%2527%2520mark%2520prediction%2520model.pdf",
            "Abstract": "The ability to predict students’ mark could be useful in a great number of different ways associated with university-level learning. In this study, student’s mark prediction models have been developed using institutional internal databases and external open data sources. The results of empirical study for undergraduate students’ first year mark prediction show that prediction models based on institutional internal and external data sources provide better performance with more accurate models compared to the models based on only institutional internal data sources. Moreover, this study explores the external data sources (such as National Student Survey result) as one of the best predictors in students’ mark prediction. Also, we found that students’ first semester performance is the most informative for their first year performance. We envisage that results such as the ones described in this study may increasingly improve the design of future students’ predictive models to support students to perform better in their study.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Broadband access satellite enabled education: The BASE 2 project.",
            "Publication year": 2004,
            "Publication url": "http://www.wseas.us/e-library/conferences/crete2004/papers/476-326.doc",
            "Abstract": "The overall objective of the BASE 2 (Broadband Access Satellite Enabled Education) project is the implementation of an end-to-end system for tele-education applications, integrating broadband terrestrial networks with satellite broadband technologies. Aim of the project is to facilitate the sustainable provision of integrated tele-education services and applications to a large number of distributed interconnected sites over a variety of telecommunication infrastructures and the investigation of the seamless integration of low-cost satellite telecommunications infrastructures with broadband terrestrial systems. The project will integrate satellite communication technologies with various terrestrial network infrastructures. An integrated end-to-end system will be implemented in order to provide tele-education services to remote, distributed and isolated rural areas and maritime users where satellite communication technologies have a potential edge over terrestrial infrastructures. Both of these user groups are typical examples of economic sectors and activities that can benefit greatly by a wider deployment and use of satellite communications essentially due to the usually large distances which separate them from broadband terrestrial telecom infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating graph traversal algorithms for distributed SPARQL query optimization",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29923-0_14",
            "Abstract": "Distributed SPARQL queries enable users to retrieve information by exploiting the increasing amount of linked data being published. However, industrial-strength distributed SPARQL query processing is still at its early stage for efficiently answering queries. Previous research shows that it is possible to apply methods from graph theory to optimize the performance of distributed SPARQL. In this paper we describe a framework that can simulate arbitrary RDF data networks to evaluate different approaches of distributed SPARQL query processing. Using this framework we further explore the graph traversal algorithms for distributed SPARQL optimization. We present an implementation of a Minimum-Spanning-Tree-based (MST-based) algorithm for distributed SPARQL processing, the performance of which is compared to other approaches using this evaluation framework. The contribution of this paper is to …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An investigation into correlations between financial sentiment and prices in financial markets",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2464464.2464510",
            "Abstract": "There is now a small but growing literature showing some relationship between sentiment contained within blogs, online news article and message boards and price movements in financial markets. Typically, researchers use keyword searching to find financially relevant messages, then rate them in terms of their how positive or negative the sentiment they contain is in relation to prices.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Research in IAM-MSc Briefings",
            "Publication year": 2009,
            "Publication url": "http://edshare.soton.ac.uk/3895/1/Agents_in_IAM.pdf",
            "Abstract": "This share contains a set of slides intended to help Web Technology MSc students become acquainted with the research in IAM and so to choose a topic for their summer projects and dissertations.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data observatories: decentralised data and interdisciplinary research",
            "Publication year": 2019,
            "Publication url": "https://eprints.soton.ac.uk/428200/",
            "Abstract": "Sharing data and observations has been at the centre of academic discourse for centuries. The Internet has enabled new promising methods of sharing, introducing a number of challenges. This paper discusses the concept of data observatories as decentralised platforms for sharing data and observations, and outlines a reference architecture for their deployment. It argues that decentralisation has been a necessity for interdisciplinary research and that it will benefit data-driven innovation beyond academia. It concludes with discussion on the necessary conditions of decentralisation and literacy for innovation and wider engagement in academic discourse.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Message from the technical program and art and demos chairs",
            "Publication year": 2008,
            "Publication url": "https://scholarbank.nus.edu.sg/handle/10635/68576",
            "Abstract": "Message from the technical program and art and demos chairs | ScholarBank@NUS Skip \nnavigation NUS IVLE Email Library Map Calendar NUS Home Research Outputs View research \noutputs Deposit publication / dataset Researchers Help FAQs Contact us Guidelines Log in \n1.ScholarBank@NUS 2.. Staff 3.Staff Publications Please use this identifier to cite or link to this \nitem: https://scholarbank.nus.edu.sg/handle/10635/68576 Title: Message from the technical \nprogram and art and demos chairs Authors: Wong, K. Tiropanis, T. Nakatsu, R. Santorineos, \nM. Rist, T. Tosa, N. Issue Date: 2008 Citation: Wong, K.,Tiropanis, T.,Nakatsu, R.,Santorineos, \nM.,Rist, T.,Tosa, N. (2008). Message from the technical program and art and demos chairs. \nProceedings - 3rd International Conference on Digital Interactive Media in Entertainment and \nArts, DIMEA 2008 : x-. ScholarBank@NUS Repository. Source Title: Proceedings - 3rd on :…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Systems & Platforms: Multiprocessors",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/id/eprint/10720",
            "Abstract": "Systems & Platforms: Multiprocessors - EdShare Southampton EdShare Home Browse By \nYear By Author Tags Course code University structure Share About Help Login Login \nSystems & Platforms: Multiprocessors Loading Loading previews... comp1214-9-multiprocessors.ppt \nSlideshow Download (353kB) comp1214-9-multiprocessors.ppt comp1214-9-multiprocessors.ppt \n1 file in this resource Systems & Platforms: Multiprocessors Added By: Mr Rikki Prince Date \nAdded: 14 Mar 2013 10:28 Creators Name: Dr Athanassios Tiropanis Mr Rikki Prince Tags: \ncomp1214 Viewing permissions: University Course codes: COMP1214 Link: http://edshare.soton.ac.uk/id/eprint/10720 \nDownloads & Views Actions (login required) View Item View Item Toolbox There are no \nactions available for this resource. Collection(s) COMP1214 course materials EdShare For \nany questions or feedback, please contact us. Copyright © 2008-of -a …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method of evaluation of social network user sentiments based on fuzzy logic",
            "Publication year": 2016,
            "Publication url": "https://www.scientific.net/KEM.685.847",
            "Abstract": "The article introduces a method of online social network users’ sentiment evaluation. The advantage of the proposed method consists in its ability to take into account user’s influence as well as the fact that a user could be an author of several messages. Results presented in this paper have been used in the past in mechanical engineering to analyze reviews on products as well as in robotics for developing user communication interfaces. The paper shows the steps of calculation of the sentiment of messages on a certain topic in online social networks. The proposed method is deployed with a view of developing analytic tools and visualizations that make use of more than one such datasets in Web Observatories.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Crowd-annotation and LoD-based semantic indexing of content in multi-disciplinary web repositories to improve search results",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3014812.3014867",
            "Abstract": "Searching for relevant information in multi-disciplinary web repositories is becoming a topic of increasing interest among the computer science research community. To date, methods and techniques to extract useful and relevant information from online repositories of research data have largely been based on static full text indexing which entails a'produce once and use forever'kind of strategy. That strategy is fast becoming insufficient due to increasing data volume, concept obsolescence, and complexity and heterogeneity of content types in web repositories. We propose that by automatic semantic annotation of content in web repositories (using Linked Open Data or LoD sources) without using domain-specific ontologies, we can sustain the performance of searching by retrieving highly relevant search results. Secondly, we claim that by expert crowd-annotation of content on top of automatic semantic annotation …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Facilitating data-driven innovation using VOICE observatory infrastructure",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2911187.2914584",
            "Abstract": "Data is the new capital of the global economy and data analysis can increase efficiency and reduce costs for innovation. Finding and accessing both public and private data is essential to exploiting this data capital. In this paper we describe a platform, VOICE Observatory (VO), that provides an infrastructure and analytical resources to facilitate data-driven innovation. The VO curates a catalogue of analytical resources and provides secure access to them. Through the VO, users can efficiently share, find and use curated analytical resources to create new analytics. Furthermore, the VO provides a well-defined API for authorised applications to access datasets on the behalf of certain users.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Satellite-enabled interactive education: scenarios and systems architectures",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11876663_32",
            "Abstract": "There are specific sectors of the economy that can benefit from satellite-based tele-education. Areas, such as maritime and agriculture, share common needs for both broadband connectivity at remote geographical areas that cannot otherwise be covered, and for innovative content for tele-education purposes. Furthermore, each area has special requirements with regard to the type of content to be delivered. In this paper we propose a set of architectural designs and case scenarios that will realise such interactive end-to-end education systems based on satellite communications. Services requirements in this setting are also identified and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Semantic technologies for learning and teaching in the web 2.0 era: A survey of uk higher education",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12704644306335907505&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Opportunistic social networks for academia",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6060785/",
            "Abstract": "This paper begins by describing the behavioural shift in online interactivity and how it has empowered the growth of online social networks and emergent forms of social awareness. It then discusses the notion of decentralised, peer-to-peer social networks and how this has been largely motivated by ideals that include giving users greater control over the data that they share in order to protect their privacy. At the same time it discusses the motivation for opportunistic contact that takes place when people are in geographical proximity (e.g. in the same office or attending the same event) and how those opportunities seem to establish the right context in which one can share and interpret ideas. Based on the hypothesis that the value of opportunistic contact in decentralised, peer-to-peer networks is more than the sum of its parts, we describe the deployment and evaluation of an application that lets users build …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building a real-time web observatory",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7274243/",
            "Abstract": "Real-time data streams are becoming primary ways to access data from the Web and from Internet-ready devices. Real-time streams, personal devices, and sensor networks have the potential to contain rich insights for researchers, commerce, and governments. With a vested interest in unlocking the potential benefits hidden within, there has been extensive work conducted on developing technologies to process, integrate, and extract value from the data. However, exposing the value in this data is achieved via sharing the data in a secure and controllable environment. To that end, here the authors present the Web Observatory, a Web platform with an architecture capable of harvesting, querying, and analyzing multiple real-time and historic heterogeneous data, while providing data owners access control to their resources. They consider the current landscape and challenges of using data, analytics, and …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A review of higher education challenges and data infrastructure responses",
            "Publication year": 2010,
            "Publication url": "https://eprints.soton.ac.uk/271695/",
            "Abstract": "Higher education institutions are large, complex, adaptive social systems like all other human organizations. Over the last decade, Higher Education around the world is facing a number of challenges and potential threats to effective learning and teaching support. In recent years considerable interest has focused on identifying those challenges, identifying opportunities and threats and proposing ways to address them. However, the relevant literature on higher education challenges is scattered over many textbooks, conferences and journals. This paper provides a comprehensive presentation of all those challenges found in the literature in a structured way. Also this study will identify how technology and data infrastructures could provide responses to address those challenges in a world where students are changing, their learning styles are changing, and the technologies to accommodate their needs are changing. Keywords: Higher Education Challenges, technology, Higher Education Infrastructure, Data Infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PRESTO: Probabilistic Cardinality Estimation for RDF Queries Based on Subgraph Overlapping",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1801.06408",
            "Abstract": "In query optimisation accurate cardinality estimation is essential for finding optimal query plans. It is especially challenging for RDF due to the lack of explicit schema and the excessive occurrence of joins in RDF queries. Existing approaches typically collect statistics based on the counts of triples and estimate the cardinality of a query as the product of its join components, where errors can accumulate even when the estimation of each component is accurate. As opposed to existing methods, we propose PRESTO, a cardinality estimation method that is based on the counts of subgraphs instead of triples and uses a probabilistic method to estimate cardinalities of RDF queries as a whole. PRESTO avoids some major issues of existing approaches and is able to accurately estimate arbitrary queries under a bound memory constraint. We evaluate PRESTO with YAGO and show that PRESTO is more accurate for both simple and complex queries.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "EINS Evidence Base: A Semantic Catalogue for Internet Experimentation and Measurement",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-18609-2_7",
            "Abstract": "To explore the socio-technical aspects of the Internet requires infrastructures to properly foster interdisciplinary work and the development of appropriate research methods. To this end we present a platform called EINS Evidence Base (EINS-EB) which is developed as part of the EINS project. The EINS-EB also aims to empower researchers, academics, organisations and society to engage with Internet Science research independent of background. Currently, it provides for the collection and discovery of data resources, of analytic and simulation tools, and, in the future, of the methodologies behind those tools an of relevant scholarly activity. We explore issues of data representation, dataset description, dataset catalogues and method catalogues for Internet Science. The evidence base adopts semantic technologies to provide an interoperable catalogue of online resources related to Internet science. We …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Rethinking measurements of social media use by charities: a mixed methods approach",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2464464.2464497",
            "Abstract": "Increasingly, the utilisation of social media services are helping charities continue to operate, as they provide unique opportunities of low-cost, easily targeted and viral marketing that have never been seen before to this scale. However, without knowing exactly how and why they are being used, analysis of their performance that could be used to indicate areas of improvement will continue to be insufficient. An innovative mixed methods approach was followed in order to address the issue, and this paper presents the results of a study that sought to determine the reasons why charities use social media, and the strategies they employ in an attempt to succeed. Three main contributions are presented--firstly, by combining the qualitative and quantitative data it was discovered that social media are currently intended to be used primarily as relationship building tools, with little focus on fundraising; secondly, an overview …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The First International Conference on Building and Exploring Web Based Environments-WEB2013",
            "Publication year": 2013,
            "Publication url": "http://eprints.ncrm.ac.uk/2971/",
            "Abstract": "he sheer volume of electronic documents being published on the Web can be overwhelming for users if the searching aspect is not properly addressed. This problem is particularly acute inside archives and repositories containing large collections of web resources or, more precisely, web pages and other web objects. Using the existing search capabilities in web archives, results can be compromised because of the size of data, content heterogeneity and changes in scientific terminologies and meanings. During the course of this research, we will explore whether semantic web technologies, particularly ontology-based annotation and retrieval, could improve precision in search results in multi-disciplinary web archives.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "ThinkMind"
        },
        {
            "Title": "Semantic technologies for learning and teaching in the Web 2.0 era",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5372202/",
            "Abstract": "Deploying semantic tools and services over a field of linked data could be a way to address many current challenges of higher education. The strengths of semantic technologies for learning and teaching, and their benefits for digital libraries, virtual communities, and e-learning, have been a major topic of discussion during recent years. Experts argue that semantic technologies can enhance the advanced learning experience by using the expressive power of metadata to describe learning content, people, and services, and then matching these intelligently.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Innovation on the web: the end of the S-curve?",
            "Publication year": 2020,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/24701475.2020.1747261",
            "Abstract": "Rigorous research into the historical past of Web technology-driven innovation becomes timely as technological growth and forecasting are attracting popular interest. Drawing on economic and management literature relating to the typical trends of technological innovation, we examine the long-term development of Web technology in a theoretically informed and empirical manner. An original longitudinal dataset of 20,493 Web-related US patents is used to trace the growth curve of Web technology between the years of 1990 through 2013. We find that the accumulation of corporate Web inventions followed an S-shaped curve which shifted to linear growth after year 2004. This transition is unusual in relation to the traditional S-curve model of technological development that typically approaches a limit. The point of inflection on the S-curve coincided reasonably closely with the timing of the dot-com crash in year 2000 …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:0izLItjtcgwC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Toward virtual campuses: collaborative virtual labs & personalized learning services in a real-life context",
            "Publication year": 2008,
            "Publication url": "https://eprints.soton.ac.uk/265410/",
            "Abstract": "Virtual campuses are gradually becoming a reality with the advances in e-learning and Web technologies, distributed systems and broadband communication, as well as the emerging needs of remote Universities for collaboration on offering common programs. The advances in grid-based distributed infrastructures have further significantly contributed to this fact providing optimized and real-time system performance and support for virtual communities even under synchronous distributed multi-user usage contexts executing complex simulations in virtual lab applications. This paper focuses on realizing fundamental rich-media e-learning services for synchronous shared and interactive virtual labs offerings and asynchronous personalized learning paradigms towards enabling virtual campuses in a real-life context. The paper further presents evaluation results of the developed e-learning services on both learning and usability aspects in real-life learning contexts involving participation of student communities from remote collaborating Universities. The evaluation results showcase the interest of learning communities in such systems as they evolve to be more advanced and user-friendly and their impact in realizing virtual campuses.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:IjCSPb-OGe4C",
            "Publisher": "ACTA Press"
        },
        {
            "Title": "Semantic technologies and learning",
            "Publication year": 2012,
            "Publication url": "https://hal-lirmm.ccsd.cnrs.fr/lirmm-00670658/",
            "Abstract": "Semantic technologies provide for the expression of meaning of resources such as content, software, systems, people, and communities in machine processable formats with the help of ontologies. Ontologies provide the vocabulary for describing resources and their relationships (Gruber 1993; Musen 1992). Based on the meaning of resources, semantic technologies can draw conclusions and enable better resource discovery and matching. In a learning context, the potential of semantic technologies translates to a number of affordances. Thetypes of resources involved in formal or informal learning environments could include learners, teachers, software, services and content. Given the description (or annotation) of these resources with the help of ontologies, it is possible to support more efficient discovery of learning resources, sequencing of relevant learning material, adaptation of learning experiences to match learner profiles, formation of groups for teaching learning activities, collaborative construction of knowledge, recommendation of learning resources and activities, and assessment. A number of ontologies are developed in the learning domain in order to support these applications with the help of reasoning software.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer"
        },
        {
            "Title": "Semantic Technologies in HE-Learning Societies Lab seminar",
            "Publication year": 2009,
            "Publication url": "http://www.edshare.soton.ac.uk/3673/",
            "Abstract": "Semantic Technologies in HE - Learning Societies Lab seminar - EdShare Southampton EdShare \nHome Browse By Year By Author Tags Course code University structure Share About Help Login \nLogin Semantic Technologies in HE - Learning Societies Lab seminar Loading Loading \npreviews... semtech-2009-lsl-seminar-tiropanis.key Other Download (10MB) \nsemtech-2009-lsl-seminar-tiropanis.key semtech-2009-lsl-seminar-tiropanis.key 1 file in this \nresource Semantic Technologies in HE - Learning Societies Lab seminar Added By: Dr Thanassis \nTiropanis Date Added: 28 Oct 2009 14:32 Creators Name: Tags: \"higher education\", \"learning \nand teaching\", \"linked data\", \"semantic tools\", \"semantic web\" Viewing permissions: World Link: \nhttp://edshare.soton.ac.uk/id/eprint/3673 Downloads & Views Actions (login required) View \nItem View Item Toolbox There are no actions available for this resource. EdShare For any or :…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The web observatory: a middle layer for broad data",
            "Publication year": 2014,
            "Publication url": "https://www.liebertpub.com/doi/full/10.1089/big.2014.0035",
            "Abstract": "BD129 or curating the many instances of the same dataset. Certain providers such as Datasift9 provide access to curated cloudbased versions of datasets; however, those datasets will still have to be copied on local big data installations before analytics can be run on them.When we consider these issues, it becomes clear that there is a gap that potentially inhibits the vision of big data, and especially broad web data, to reach its full potential; this gap lies in the ability to have distributed infrastructures for big data analytics that will (1) enable the query of common datasets where they are, without the need for replication unless desired;(2) provide opportunities for more people to engage with those datasets’ and (3) enable the reuse of analytic tools that can be applied for analysis on different datasets. This gap calls for a different kind of global, more weblike infrastructure that will bridge the potential of sharing datasets …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:5ugPr518TE4C",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Analytics for the internet of things: A survey",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3204947",
            "Abstract": "The Internet of Things (IoT) envisions a world-wide, interconnected network of smart physical entities. These physical entities generate a large amount of data in operation, and as the IoT gains momentum in terms of deployment, the combined scale of those data seems destined to continue to grow. Increasingly, applications for the IoT involve analytics. Data analytics is the process of deriving knowledge from data, generating value like actionable insights from them. This article reviews work in the IoT and big data analytics from the perspective of their utility in creating efficient, effective, and innovative applications and services for a wide spectrum of domains. We review the broad vision for the IoT as it is shaped in various communities, examine the application of data analytics across IoT domains, provide a categorisation of analytic approaches, and propose a layered taxonomy from IoT data to analytics. This …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:S16KYo8Pm5AC",
            "Publisher": "ACM"
        },
        {
            "Title": "Systems & Platforms: Virtualization",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/10668/",
            "Abstract": "Systems & Platforms: Virtualization - EdShare Southampton EdShare Home Browse By Year \nBy Author Tags Course code University structure Share About Help Login Login Systems & \nPlatforms: Virtualization Loading Loading previews... comp1214-8-virtualization.ppt Slideshow \nDownload (481kB) comp1214-8-virtualization.ppt comp1214-8-virtualization.ppt Video about \nprivileged instructions Video about privileged instructions 2 files in this resource Systems & \nPlatforms: Virtualization Added By: Mr Rikki Prince Date Added: 05 Mar 2013 11:04 Creators \nName: Dr Athanassios Tiropanis Mr Rikki Prince Tags: comp1214, operating systems, systems \n& platforms, virtualization Viewing permissions: University Course codes: COMP1214 Link: \nhttp://edshare.soton.ac.uk/id/eprint/10668 Downloads & Views Actions (login required) View \nItem View Item Toolbox There are no actions available for this resource. Collection(s) For …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introducing the omega-machine",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2567948.2578838",
            "Abstract": "In this paper, we propose the Ω-machine model for social machines. By introducing a cluster of\" oracles\" to a traditional Turing machine, the Ω-machine is capable of describing the interaction between human participants and mechanical machines. We also give two examples of social machines, collective intelligence and rumor spreading, and demonstrate how the general Ω-machine model could be used to simulate their computations.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet Science",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-70284-1.pdf",
            "Abstract": "This volume contains the papers presented at INSCI 2017, the 4th International Conference on Internet Science, held during November 22–24, 2017, in Thessaloniki, Greece.This year the conference featured work that used a range of technical and social approaches to shed light on the path toward a more open, interoperable, human-centric, democratic, and trustworthy Internet. This provides a glimpse of an Internet more conducive to social innovation and services, with more intelligence, and with greater involvement and participation across the board. In order to provide this insight, INSCI 2017 brought together researchers from around the world and across disciplinary boundaries. Together we are able to explore the sociotechnical nature of the Internet through the lenses of computer science, sociology, art, mathematics, physics, complex systems analysis, psychology, economics, law, political sciences, and …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "International Journal of Knowledge and Learning (IJKL)",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/47795162/ELeGI_as_enabling_architecture_for_e-lea20160804-32424-lnxac8.pdf",
            "Abstract": "The Web 2.0 is supposed to be a second-generation of Internet-based services–such as social networking sites, wikis, communication tools, and folksonomies–that let people collaborate and share information online in previously unavailable way. Currently, there is a strong interest of many leading enterprises in the Web 2.0 and on the impact that it can have on the traditional web-based application such as the e-Learning, namely e-Learning 2.0.This paper analyses what ELeGI could provide to e-Learning 2.0, in terms of its vision of learning, processes, methodologies and technologies. Our preliminary investigations have raised up which results obtained in the ELeGI project can give support to the e-Learning 2.0 and improve some its typical aspects and processes.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Observlets: Empowering analytical observations on web observatory",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2872518.2890593",
            "Abstract": "The Web observatory is proposed as a global catalogue for sharing data-sets and analytic applications to support researchers from a variety of disciplines for analysing huge amount of research data for Web Science research. However, often these users fail to understand various transformations and consequences of complex data processing involved in a data analytic application. Therefore, there is a need to enable these users develop and re-use analytic applications on web observatory. In this study, we propose formal design patterns called\" Observlets\" for analytic applications to\" observe\" various web phenomena. The observlets provide abstract definitions for intermediate analysis required for a data analytic application. The users can share observlets across distributed web observatory nodes. The observlets are aimed to enhance end-users' awareness and engagement on web observatory and support …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The opportunity of linked data for the European higher education area",
            "Publication year": 2016,
            "Publication url": "https://www.duo.uio.no/handle/10852/41415",
            "Abstract": "The european higher education area (EHEA) aims to create a more comparable, compatible and coherent space of Higher Education in Europe. After a decade of reforms, most of the required instruments are already in place, so the next years are key to complete the implementation and consolidation of the EHEA. However, data challenges pose a threat to pivotal EHEA processes such as credit recognition that require institutions to cooperate and integrate their datasets scattered across diverse repositories in multiple data formats. Linked Data principles and practices have the potential to address such difficulties, as demonstrated with the emergence of a global data space –the Web of Data. This paper first discusses the benefits of Linked Data for the emergent EHEA, devising a new set of Linked Data-driven scenarios that leverage current EHEA processes. Further, a set of preliminary Linked Data deployments is examined to assess the advantages and identify the challenges ahead in the EHEA landscape.   Made available here with permission from the publisher.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Negotiating the Web Science Curriculum through Shared Educational Artefacts",
            "Publication year": 2011,
            "Publication url": "https://hal-lirmm.ccsd.cnrs.fr/lirmm-00652085/",
            "Abstract": "The far-reaching impact of the Web on society is widely recognised. The interdisciplinary study of this impact has crystallised in the field of study known as Web Science. However, defining an agreed, shared understanding of what constitutes Web Science requires complex negotiation and translations of understandings across component disciplines, national cultures and educational traditions. Some individual institutions have already established particular curricula, and discussions in the Web Science Curriculum Workshop series have marked the territory to some extent. This paper reports on a process being adopted across a consortium of partners to systematically create a shared understanding of what constitutes Web Science. It records and critiques the processes instantiated to agree a common curriculum, and presents a framework for future discussion and development.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated analysis of charities’ communication styles on Twitter",
            "Publication year": 2013,
            "Publication url": "https://core.ac.uk/download/pdf/29039519.pdf",
            "Abstract": "This extended abstract presents an overview of a technology demonstration that would consist of a novel piece of software for automatically analysing charitable organisations’ posts on the micro-blogging service Twitter. The main contribution is an inbuilt taxonomy of communication styles, which is used to classify each charity based on the results of the analysis undertaken. The demonstration will showcase this automated process, as well as explaining the restrictive properties for each category, and why certain charities are classified into certain styles.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ZEUS:“SATELLITE NETWORK OF RURAL SCHOOLS”",
            "Publication year": 2004,
            "Publication url": "http://oro.open.ac.uk/46698/1/Annual_2004_Budapest_Proceedings.pdf#page=506",
            "Abstract": "Greece is a country with a particularity in terms of the geomorphology–many islands across the Aegean and the Ionion sea as well as mountainous areas–and consequently many relatively isolated and secluded areas. The population number in these areas is decreasing year by year as the inhabitants are facing serious problems in terms of their living conditions. The provision of adequate infrastructure for mainly education, health care and other vital sectors, is a challenging issue of key importance for addressing the demographic recession.As regards the educational system in remote areas in Greece and more specifically primary education most of the schools in these areas are multigrade schools1. According to the data of the Ministry of Education and Religious Affairs (2001-2002), 44% of the primary schools in Greece are multigrade and 15% of the primary school teachers serve in multigrade schools. Teachers serving in multigrade schools are usually recently appointed. Although the function of the multigrade schools in the Greek educational system represents an institutional reality there are no relevant undergraduate courses in the curricula of the Greek Departments of Primary Education and the efforts for the teachers’ professional enhancement in the field are occasional (seminars, workshops etc organised now and then by various organisations/institutions).",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of a virtual scientific experiment model in different educational contexts",
            "Publication year": 2006,
            "Publication url": "https://eprints.soton.ac.uk/265082/",
            "Abstract": "E-learning practice is continuously using experimentation in order to enhance the basic information transfer model where knowledge is passed from the system/ tutors to the students. Boosting student productivity through on-line experimentation is not simple since many organizational, educational and technological issues need to be dealt with. This work describes the application of a Learning Model for Virtual Scientific Experiments (VSEs) in two different scenarios: Information and Communication Technologies and Physics. As part of the first, a VSE for Wireless Sensor Networks was specified and deployed while the second involved the specification and design of a collaborative VSE for physics experiments. Preliminary implementation and deployment results are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:Zph67rFs4hoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Calculating trust using multiple heterogeneous social networks",
            "Publication year": 2020,
            "Publication url": "https://www.hindawi.com/journals/wcmc/2020/8545128/",
            "Abstract": "In today’s Internet, a web user becomes members of multiple social networks due to different types of services provided by each of these networks. This creates an opportunity to make trust decisions that go beyond individual social networks, since these networks provide single perspective of trust. To make trust inference over multiple social networks, these networks need to be consolidated. It is nontrivial as these networks are of heterogeneous nature due to different naming conventions used in these networks. Furthermore, trust metrics extracted from these networks are also varied in nature due to different trust evaluation algorithms used in each of these networks. Heterogeneity of these social networks can be overcome by using semantic technologies as it allows us to represent knowledge using ontologies. Trust data can be consolidated by using such data fusion techniques which not only provide but also preserve trust data integrity from each of the individual social network profiles. The proposed semantic framework is evaluated using two sets of experiments. Through simulations in this work, we analysed various techniques for data fusion. For identifying suitable technique that preserves the integrity of trust consolidated from each of the individual networks, analysis revealed that Weighted Ordered Weighted Averaging parameter best aggregated trust data, and, unlike other techniques, it preserved the integrity of trust from each individual network for varying participant overlap and tie overlap (). Similarly, for experimental analysis, we used findings of the simulation study about the best trust aggregation technique and applied the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:FAceZFleit8C",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A (multi'domain'sional) Scrutable User Modelling Infrastructure for Enriching Lifelong User Modelling",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/267542/",
            "Abstract": "A Scrutable User Modelling Infrastructure (SUMI) is proposed in this paper, which focuses on three key Lifelong User Modelling (LUM) requirements: interoperability, scrutability and privacy. SUMI attempts to enrich the LUM vision by examining two unexplored \"pieces of the puzzle\": the social e-networking and e-commerce domains. SUMI allows users to gather their various (lifelong) models which they hold with several providers from the social e-networking and e-commerce domains, passes the control to the owners of the user models by providing scrutability and user-controlled privacy privileges, and enables exporting of these user models, or parts of them, towards educational personalization systems, after direct consent of the users-owners. Up-to-date results highlight users’ approval of six proposed scrutability and user-controlled privacy privileges which were presented during SUMI’s first evaluation, while data portability initiatives from providers of the two examined domains, combined with Semantic Web technologies, constitute the backbone of the proposed solution.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet Science",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-18609-2.pdf",
            "Abstract": "The 2nd International Conference on Internet Science “Societies, governance and innovation” took place in Brussels during May 27–29, 2015, under the aegis of the European Commission, by the EINS project, the FP7 European Network of Excellence in Internet Science.The main objective of this highly multidisciplinary conference is to foster dialogue among scholars and practitioners in Internet science; an interdisciplinary area that draws on Computer Science, Sociology, Art, Mathematics, Physics, Complex systems analysis, Psychology, Economics, Law, Political Science, Epistemology, and other disciplines in order to study the Internet as a sociotechnical phenomenon closely related to various areas of human activity, under technological and humanistic perspectives. This year the focus was on the contribution and role of Internet science on the current and future multidisciplinary understanding of societal …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the 1st International Workshop on Semantic Web Applications for Learning and Teaching Support in Higher Education (SemHE'09)",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/268091/",
            "Abstract": "SemHE is concerned with the applications of semantic web technologies in higher education. There has been much interest in this topic within the Technology Enhanced Learning, the Higher Education Support and the Web Science communities. SemHE is intended to involve a wider international audience in discussing recent developments in this area and in shaping a roadmap for future research. SemHE is supported by the JISC funded SemTech project and the ESRC/EPSRC funded ENSEMBLE project both of which have been working on the relevance and value of semantic technologies to higher education in the UK.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:IWHjjKOFINEC",
            "Publisher": "www. semhe. org"
        },
        {
            "Title": "The web science observatory-the challenges of analytics over distributed linked data infrastructures",
            "Publication year": 2014,
            "Publication url": "https://eprints.soton.ac.uk/361437/",
            "Abstract": "Linked data technologies provide advantages in terms of interoperability and integration, which, in certain cases, come at the cost of performance. The Web Observatory, a global Web Science research project, is providing a benchmark infrastructure to understand and address the challenges of analytics on distributed Linked Data infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmented reality for games",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1413634.1413645",
            "Abstract": "In this text, we intend to explore augmented reality as a means to visualise interactive communication projects. With ARToolkit, Virtools and 3ds Max applications, we aim to show how to create a portable interactive platform that resorts to the environment and markers for constructing the game's scenario.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:hCrLmN-GePgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending authoring for adaptive learning to collaborative authoring",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22095-1_104",
            "Abstract": "Research on learning systems has led to the development of Adaptive Educational Hypermedia (AEH) systems that offer students adaptive learning and free exploratory lessons. Developing learning spaces for AEH, however, requires a lot of effort due to the complexity of the learning resources, consisting of learning content, domain knowledge and pedagogical knowledge, which are completed with adaptation rules. Current authoring tools for adaptive learning present drawbacks in terms of the reusability of their output and their collaborative work features. In this paper, a proposed collaborative authoring approach for developing adaptive learning resources is presented. The advantages of the proposed approach lie in the application of a collaborative method; the use of a learning standard, IMS Learning Design, for reusability and extensibility reasons; and the repurposing of learning materials available …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Web evolution and Web science",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128612003581",
            "Abstract": "This paper examines the evolution of the World Wide Web as a network of networks and discusses the emergence of Web Science as an interdisciplinary area that can provide us with insights on how the Web developed, and how it has affected and is affected by society. Through its different stages of evolution, the Web has gradually changed from a technological network of documents to a network where documents, data, people and organisations are interlinked in various and often unexpected ways. It has developed from a technological artefact separate from people to an integral part of human activity that is having an increasingly significant impact on the world. This paper outlines the lessons from this retrospective examination of the evolution of the Web, presents the main outcomes of Web Science activities and discusses directions along which future developments could be anticipated.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Measuring the megaphone: how are charities using social media for marketing?",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/344872/",
            "Abstract": "The Web has disrupted charitable marketing by providing new opportunities for word-of-mouth marketing on an unprecedented scale. This paper describes the transformation in marketing that the Web – and social media in particular – has brought about by providing customers with more power, before highlighting the need for a broad investigation into how charities are now using these services so that its impact upon modern society can be realized. A framework is identified in the literature that will be used to categorize charities’ interactions on these sites and show how the Web has transformed marketing activities. Interviews will determine whether UK-based charities’ aims for social media marketing are likely to be met given their current usage as identified using the framework. These findings will provide a foundation on which to build a system of measurement, as part of a wider research agenda to analyze charitable marketing performance for which a previously constructed framework will be further developed to help determine the success of such marketing campaigns.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WebSci’18 Ethics and Privacy for Social Machines, Social Groups and Aggregations",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=15259650268163150952&hl=en&oi=scholarr",
            "Abstract": "Emerging technologies of data analytics and digital networks are developing and achieving scale rapidly, often thanks to the affordances of the World Wide Web and mobile devices. Such technologies pose important ethical issues, ranging from privacy, to their potential to undermine individual autonomy, to the difficulty of apportioning accountability for their realworld effects.Furthermore, the domains of greatest potential for such technologies are extremely heterogeneous in their own ethical status, ranging from areas such as healthcare where the public good is obvious, to those like marketing where the benefits are rather more equivocal, and also include use by governments, which might themselves be benign democracies or authoritarian regimes.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Philosophy meets internet engineering: Ethics in networked systems research.(GTC workshop outcomes paper)",
            "Publication year": 2015,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2666934",
            "Abstract": "Internet engineering and networked systems research improves our understanding of the underlying technical processes of the Internet. Internet engineers therefore analyse data transfers on the Internet, typically by collecting data from devices of large groups of individuals as well as organisations. The designs of Internet engineering and research projects reflect human decisions and therefore may create new moral systems. This interplay of technology and society creates new practices that can impact the lives of individuals in many ways. These actions can raise new ethical dilemmas, or challenge existing ethics methodologies within the new and complex information environment presented by the Internet.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Systems & Platforms: Processes, Threads & Scheduling",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/10522",
            "Abstract": "Systems & Platforms: Processes, Threads & Scheduling - EdShare Southampton EdShare Home \nBrowse By Year By Author Tags Course code University structure Share About Help Login Login \nSystems & Platforms: Processes, Threads & Scheduling Loading Loading previews... \ncomp1214-4-processes.ppt Slideshow Download (1MB) comp1214-4-processes.ppt \ncomp1214-4-processes.ppt 1 file in this resource Systems & Platforms: Processes, Threads & \nScheduling Added By: Mr Rikki Prince Date Added: 05 Feb 2013 11:20 Creators Name: Mr Rikki \nPrince Dr Yvonne Howard Dr Athanassios Tiropanis Tags: comp1214, operating systems, \nsystems & platforms Viewing permissions: University Course codes: COMP1214 Link: \nhttp://edshare.soton.ac.uk/id/eprint/10522 Downloads & Views Actions (login required) View Item \nView Item Toolbox There are no actions available for this resource. Collection(s) COMP1214 For …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of institutional repositories in addressing higher education challenges",
            "Publication year": 2010,
            "Publication url": "https://eprints.soton.ac.uk/271694/",
            "Abstract": "Over the last decade, Higher Education around the world is facing a number of challenges. Challenges such as adopting new technologies, improving the quality of learning and teaching, widening participation, student retention, curriculum design/alignment, student employability, funding and the necessity to improve governance are considered particularly in many literature. To effectively operate and to survive in this globalization era, Higher Education institutions need to respond those challenges in an efficient way. This paper proposes ways in which institutional data repositories can be utilized to address the challenges found in different literature. Also we discuss which repositories can be shared across the institutions and which need not to be shared in order to address those challenges. Finally the paper discusses the barriers to sharing Higher Education repositories and how those barriers can be addressed.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EXPRESS: EXPressing REstful semantic services using domain ontologies",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04930-9_59",
            "Abstract": "Existing approaches to Semantic Web Services (SWS) require a domain ontology and a semantic description of the service. In the case of lightweight SWS approaches, such as SAWSDL, service description is achieved by semantically annotating existing web service interfaces. Other approaches such as OWL-S and WSMO describe services in a separate ontology. So, existing approaches separate service description from domain description, therefore increasing design efforts. We propose EXPRESS a lightweight approach to SWS that requires the domain ontology definition only. Its simplicity stems from the similarities between REST and the Semantic Web such as resource realization, self describing representations, and uniform interfaces. The semantics of a service is elicited from a resource’s semantic description in the domain ontology and the semantics of the uniform interface, hence eliminating the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Ethical and legal support for innovation on web observatories",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2911187.2914579",
            "Abstract": "In this paper, we consider the ethical and legal context and challenges for the further development of Web Observatories (WOs). First the need for and importance of a transparent and robust legal and ethical framework that can be adopted by WOs is outlined. Then, the legal and ethical challenges faced are explored. Finally, characteristics of best practice and an outline of the proposed solutions, including the development of a new ethical model--PRO-SENT, are set out.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HCI as a Differentiator between Mobile and Ubiquitous Learning",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6081999/",
            "Abstract": "Consideration of the availability of learning resources, or the ability of mobile learners to find information, is not enough when defining mobile and ubiquitous learning approaches. This limited consideration could play a role in blending both learning approaches as they assist the mobile learners. Moreover, the essential requirements for mobile learners may be overlooked by this consideration and consequently, mobile learners may be affected negatively. In this paper, mobile and ubiquitous learning are compared from the view of the nature of interaction between learners and computers. This comparison will provide a close picture of the potential of these learning approaches and the differences between their environments. Furthermore, it plays a crucial role in achieving a level where the different design requirements to facilitate the learning for learners in m-learning and u-learning environments are realised and …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Business roles and negotiation models for Web service based provision",
            "Publication year": 2003,
            "Publication url": "https://eprints.soton.ac.uk/265058/",
            "Abstract": "The emergence of XML as the lingua franca for communication among applications over the Web, the recent advances in service oriented computing and in web service architectures and the applicability of these technologies in the area of eCommerce necessitates the conceptualisation of business roles and negotiation models for web service based provision. According to the web service paradigm it is envisaged that services will be provided to customers based on dynamic web service composition. This places additional requirements to SLA negotiation in comparison to the traditional service provision paradigm where negotiation for service was performed with a single service provider system. This paper addresses the research challenges with regard to SLA negotiation for web service based provision and outlines business roles and a negotiation model for establishing SLAs with multiple web service providers in order to offer combined web service functionality to match user needs.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:_axFR9aDTf0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Patterns of collaboration: Towards learning mathematics in the era of the semantic web",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-007-2321-4_1",
            "Abstract": "With current digital technologies there are a number of networked computer-based tools that provide ways for users, be they learners or teachers, to collaborate in tackling visual representations of mathematics, both algebraic and geometric. For learners, there are various ways of collaborating that can occur while the learners are tackling mathematical problems. In this chapter we use selected outcomes from recent innovative research on this aspect of learning and teaching mathematics with digital technologies to review the patterns of collaboration that can occur in terms of teacher and learner experience. Given that such patterns of collaboration are via current digital technologies, this chapter goes on to offer a view on the likely impact on the cyberlearning of mathematics of progress towards the next generation of Web technologies that seeks to make use of ideas related to the web of data and the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Cross-domain depression detection via harvesting social media",
            "Publication year": 2018,
            "Publication url": "https://eprints.soton.ac.uk/423226/",
            "Abstract": "Depression detection is a significant issue for human well-being. In previous studies, online detection has proven effective in Twitter, enabling proactive care for depressed users. Owing to cultural differences, replicating the method to other social media platforms, such as Chinese Weibo, however, might lead to poor performance because of insufficient available labeled (self-reported depression) data for model training. In this paper, we study an interesting but challenging problem of enhancing detection in a certain target domain (e.g. Weibo) with ample Twitter data as the source domain. We first systematically analyze the depression-related feature patterns across domains and summarize two major detection challenges, namely isomerism and divergency. We further propose a cross-domain Deep Neural Network model with Feature Adaptive Transformation & Combination strategy (DNN-FATC) that transfers the relevant information across heterogeneous domains. Experiments demonstrate improved performance compared to existing heterogeneous transfer methods or training directly in the target domain (over 3.4% improvement in F1), indicating the potential of our model to enable depression detection via social media for more countries with different cultural settings.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:SpbeaW3--B0C",
            "Publisher": "International Joint Conferences on Artificial Intelligence"
        },
        {
            "Title": "Examining Wikipedia across linguistic and temporal borders",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2567948.2576931",
            "Abstract": "The Web has grown to be an integral part of modern society offering novel ways for humans to communicate, interact, and share information. New collaborative platforms are forming which are providing individuals with new communities and knowledge bases and, at the same time, offering insights into human activity for researchers, policy-makers and engineers. On a global scale, the role of cultural and language barriers when studying such phenomena becomes particularly relevant and presents significant challenges: due to insufficient information, it is often hard to establish the cultural or language groups in which individuals belong, while there are technical difficulties in establishing the relevance and in analysing resources in different languages. This paper presents a framework to the end of addressing those issues by leveraging data on the use of Wikipedia. Resources available in different languages are …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Worldwide Universities Network (WUN) Web Observatory",
            "Publication year": 2017,
            "Publication url": "https://research-information.bris.ac.uk/files/109875275/p1665.pdf",
            "Abstract": "The ongoing growth in research data publication supports global intra-disciplinary and inter-disciplinary research collaboration but the current generation of archive-centric research data repositories do not address some of the key practical obstacles to research data sharing and re-use, specifically: discovering relevant data on a global scale is timeconsuming; sharing ‘live’and streaming data is non-trivial; managing secure access to sensitive data is overly complicated; and, researchers are not guaranteed attribution for re-use of their own research data. These issues are keenly felt in an international network like the Worldwide Universities Network (WUN) as it seeks to address major global challenges. In this paper we outline the WUN Web Observatory project’s plan to overcome these obstacles and, given that these obstacles are not unique to WUN, we also propose an ambitious, longer-term route to their solution at Web-scale by applying lessons from the Web itself. c 2017 International World Wide Web Conference Committee (IW3C2), published under Creative Commons CC BY 4.0 License. WWW’17 Companion, April 3–7, 2017, Perth, Australia. ACM 978-1-4503-4914-7/17/04. http://dx. doi. org/10.1145/3041021.3051691",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:WZBGuue-350C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Signal Diffusion Mapping: Optimal Forecasting with Time‐Varying Lags",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/for.2365",
            "Abstract": "We introduce a new methodology for forecasting, which we call signal diffusion mapping. Our approach accommodates features of real‐world financial data which have been ignored historically in existing forecasting methodologies. Our method builds upon well‐established and accepted methods from other areas of statistical analysis. We develop and adapt those models for use in forecasting. We also present tests of our model on data in which we demonstrate the efficacy of our approach. Copyright © 2015 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3rd ACM International Conference on Digital Interactive Media in Entertainment and Arts-DIMEA 2008-Proceedings",
            "Publication year": 2008,
            "Publication url": "https://eprints.soton.ac.uk/266653/",
            "Abstract": "3rd ACM International Conference on Digital Interactive Media in Entertainment and Arts - \nDIMEA 2008 - Proceedings - ePrints Soton The University of Southampton Courses University \nlife Research Business Global About Visit Alumni Departments News Events Contact × Search \nthe Site Search Filter your search: All Courses Projects Staff University of Southampton \nInstitutional Repository Search Advanced Search Policies & Help Latest Download Statistics \nBrowse by Year Browse by Divisions LeftRight 3rd ACM International Conference on Digital \nInteractive Media in Entertainment and Arts - DIMEA 2008 - Proceedings Tsekeridou, Sofia, \nPnevmatikakis, Aristodemos, Wong, Kevin, Tiropanis, Thanassis and Nakatsu, Ryohei (eds.) \n(2008) 3rd ACM International Conference on Digital Interactive Media in Entertainment and Arts \n- DIMEA 2008 - Proceedings , The Association of Computing Machinery, Inc. Record type: . : :…",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:hFOr9nPyWt4C",
            "Publisher": "The Association of Computing Machinery, Inc."
        },
        {
            "Title": "The evolving dynamics of the internet layered archtecture: innovation, net neutrality and the interdependence of structure and function",
            "Publication year": 2013,
            "Publication url": "http://eprints.lse.ac.uk/49833/",
            "Abstract": "In this extended abstract we discuss the infrastructure of the Internet as two distinct layers that are increasingly interdependent : the network layer, below, and the Web, above. The network layer is responsible for the structural properties of the Internet, while the top layer is where the Web content is consumed through Web applications and communications. We argue that the principle of independence between the layers, which guided the early design of the Internet, has enabled an environment conducive to innovation pursued by different communities: networking technologists primarily below, and business, application developers, and humanists/artists above. The innovations in each layer, however, are increasingly influencing design criteria and choices in the other, suggesting that the Internet architecture is evolving towards greater interdependence between the layers. For example, this is explicitly sought in some cases for wireless networks for efficiency optimization. Tight coupling between structural and functional properties is one of the fundamental “architectural” principles of biological organism s, which have evolved to optimize energy efficiency as a requirement for survival and procreation. This view, which mixes strictly functionalist concerns with creative and opportunistic behaviour, suggests that the Internet may be evolving towards an increasingly complex structure and dynamic. The paper argues that an environment in which the two layers are increasingly interdependent can still sustain a high level of innovation as long as no entity has full control of both , and as long as the design principles on each layer, which can be argued to …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:dshw04ExmUIC",
            "Publisher": "The FP7 European Network of Excellence in Internet Science"
        },
        {
            "Title": "Impact of Consolidating Web Based Social Networks on Derived Trust Factors",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=11702382219425203403&hl=en&oi=scholarr",
            "Abstract": "Individuals are typically members of a variety ofweb-based social networks (both explicit and im-plied), but existing trust inference mechanisms typ-ically draw only on a single network in order tocalculate trust between any two individuals. Thisboth reduces the likelihood that a trust value can becalculated (as both people have to be members of thesame network), and reduces the quality of any trustinference that can be drawn (as it will be based ononly a single network, typically representing a singletype of relationship). To make trust calculations onmultiple distributed (MuDi) social networks thosenetworks must be rst consolidated into a single net-work. This is challenging as simple consolidationstrategies such as summing or averaging trust valuestend to distort trust values. In this paper we presentan analysis of dierent consolidation approaches forMuDi trust networks, and propose a Weighted Or-dered Weighted …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:umqufdRvDiIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Notes on Semantic Web Services (Greek language)",
            "Publication year": 2006,
            "Publication url": "https://eprints.soton.ac.uk/268173/1/tiropanis-notes-sws-gr.pdf",
            "Abstract": "Σε αυτή την εργασία µετά από µία παρουσίαση των Υπηρεσιών Ιστού (Web Services) και των τεχνολογιών µε τις οποίες υποστηρίζεται η ανάπτυξή τους παρουσιάζουµε τις Σηµασιολογικές Υπηρεσίες Ιστού. Οι Σηµασιολογικές Υπηρεσίες Ιστού είναι το αποτέλεσµα της εφαρµογής τεχνολογιών του Σηµασιολογικού Ιστού (Semantic Web) σε Υπηρεσίες Ιστού. Αναλύουµε τα πλεονεκτήµατα που παρουσιάζουν οι Σηµασιολογικές Υπηρεσίες Ιστού όπως και τα θέµατα που είναι ακόµα ανοικτά προς επίλυση. Παρουσιάζουµε επίσης τις µελλοντικές κατευθύνσεις όσον αφορά την εξέλιξη των Σηµασιολογικών Υπηρεσιών Ιστού.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online grocery shopping: Identifying change in consumption practices",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-70284-1_16",
            "Abstract": "Following the invention and proliferation of the Internet, Web and mobile technologies, we have seen a global revolution in retailing. Despite the rapid growth of e-commerce, the online grocery shopping market has taken until now to gain traction, currently constituting 6.9% of the UK’s grocery market, but projected to increase 68.3% to £17.6 bn by 2021. There is little work accounting for new and contingent behaviours in the online grocery market, not least because of historically poor access to retailers’ data. This paper leverages access to the UK’s fourth largest supermarket, WM Morrisons Plc (Morrisons) to investigate consumer behaviour in this market, augmenting the Office for National Statistics’ Living Costs and Food Survey, the UK’s only substantial publicly available resource to date. This paper establishes that there have been changes in consumer behaviours in response to the unique …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluating a web-based information system for managing master of science summer projects",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1999747.1999784",
            "Abstract": "We describe the design of a web-based information system for monitoring MSc summer projects in the School of Electronics and Computer Science at the University of Southampton, and a mixed method quasi-experimental study involving 290 MSc project students, 19 monitors, and 69 supervisors in electronics and computer science, using the system over a period of 17 weeks. Statistically significant results presented here are: Students making heavy use of the system achieved higher marks on their project dissertation, while no such correlation was found with marks for other parts of their MSc. Likewise, student's monitor activity is significantly correlated with their own activity and dissertation mark. These results suggest that educational information and project management systems positively affect student achievement and academic staff involvement is crucial for these systems to be successful. Future work …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Survey of students’ technology use for time management",
            "Publication year": 2010,
            "Publication url": "https://www.learntechlib.org/p/35089/",
            "Abstract": "We present the results of a survey conducted at the University of Southampton in September 2009. Students in the School of Electronics and Computer Science were asked to take an online survey about devices, calendaring applications and features, and study time management strategies. All respondents own a mobile device and about 76% carry a web-enabled device on campus. The most used calendaring applications for study planning are mobile phone calendaring software, Google Calendar, and MS Outlook. Feature-wise, appointments and reminders are preferred over tasks. Students’ time management practices are diverse, and a range of different technologies is used. Those reporting poor time management use more software features and think that existing software lacks features for study planning. Also, those using software make less use of guessing for time on task estimation. It is hoped that the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:86PQX7AUzd4C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Engaging with charities on social media: comparing interaction on Facebook and Twitter",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-18609-2_2",
            "Abstract": "Social media are commonly assumed to provide fruitful online communities for organisations, whereby the brand and supporter-base engage in productive, two-way conversations. For charities, this provides a unique opportunity to reach an audience for a relatively low cost, yet some remain hesitant to fully embrace these services without knowing exactly what they will receive in return. This paper reports on a study that seeks to determine the extent to which these conversations occur, and compares this phenomenon on Facebook and Twitter for a sample of UK-based charities. Focus was placed on analysing conversations as signs of developing relationships, which have previously been shown to be a key target for charities on social media. The results of this study find that while there is an expected proportion of the audience who prefer to listen rather than engage, there is strong evidence of a core …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:PELIpwtuRlgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Establishing expert consensuses on the value of open data in open social innovation ideation",
            "Publication year": 2015,
            "Publication url": "https://eprints.soton.ac.uk/397874/",
            "Abstract": "There is little conclusive evidence as to whether OD provides value to social innovation ideation scenarios. Furthermore, OD as a resource is severely contested as to its openness, availability, quality, importance, and usefulness within innovation ideation. Therefore, understanding how Open Data (OD) can be leveraged for innovation ideation practices has become a topic at the mainstream of management literature. However much of the effort thus far has been focused on ideation and innovation for-profit, specifically when in papers examining Open Innovation (OI), even though OD has been depicted as a resource for providing social, economical and entrepreneurial benefit. Therefore this paper presents an initial study of the perceived value of OD, in research phase Open Social Innovation (OSI), amongst academic and professional experts in OI, Innovation Networking and OD. Consequently, a Modified Delphi Study (MDS) is conducted, aimed at forming a convergence of opinion amongst academic and professional experts. From converging expert opinions from both academic and professional perspectives, optimal managerial practices within this field can be shaped. Furthermore, management processes and practices can be justified in collecting and targeting particular datasets that are opportune for a social innovation context. In addition to the primary objectives, and with respect to the paper’s findings, barriers of utilizing and leveraging OD for this purpose are duly noted with proposed methods of overcoming such challenges",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CIP-OSN; Networks as Graphs",
            "Publication year": 2013,
            "Publication url": "http://www.edshare.soton.ac.uk/id/eprint/10515",
            "Abstract": "CIP-OSN; Networks as Graphs - EdShare Southampton EdShare Home Browse By Year By \nAuthor Tags Course code University structure Share About Help Login Login CIP-OSN; \nNetworks as Graphs Loading Loading previews... 1-online-social-network-as-a-graph.pdf Text \nDownload (7MB) 1-online-social-network-as-a-graph.pdf 1-online-social-network-as-a-graph.pdf \n1 file in this resource CIP-OSN; Networks as Graphs Curriculum Innovation Programme - \nOnline Social Networks (UOSM2012) - Networks as Graphs Added By: Dr Thanassis Tiropanis \nDate Added: 04 Feb 2013 16:18 Creators Name: Viewing permissions: World Course codes: \nUOSM2012 Link: http://edshare.soton.ac.uk/id/eprint/10515 Downloads & Views Actions \n(login required) View Item View Item Toolbox There are no actions available for this resource. \nEdShare For any questions or feedback, please contact us. Copyright © 2008-2020 University …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Satellite-based delivery of educational content to geographically isolated communities: a service based approach",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s00779-007-0185-9",
            "Abstract": "Enabling learning for members of geographically isolated communities presents benefits in terms of promoting regional development and cost savings for governments and companies. However, notwithstanding recent advances in e-Learning, from both technological and pedagogical perspectives, there are very few, if any, recognised methodologies for user-led design of satellite-based e-learning infrastructures. In this paper, we present a methodology for designing a satellite and wireless based network infrastructure and learning services to support distance learning for such isolated communities. This methodology entails (a) the involvement of community members in the development of targeted learning services from an early stage, and (b) a service-oriented approach to learning solution deployment. Results show, that, while the technological premises of distance learning can be accommodated by …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Intelligence in Services and Networks. Paving the Way for an Open Service Market: 6th International Conference on Intelligence and Services in Networks, IS&N'99, Barcelona, Spain, April 27-29, 1999, Proceedings",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=4bBqCQAAQBAJ&oi=fnd&pg=PR3&dq=info:IlGkZKPLPjcJ:scholar.google.com&ots=HYNCB-Lg5f&sig=7dkdMfh3kQSzyROahnAcR3DtVxs",
            "Abstract": "Paving the Way for an Open Service Market We live in an age when powerful communications technology is becoming available to everyone. From our home we can send and receive not only analogue voice, but also growing volumes of digital information and even intelligence in the form of agents. We are becoming increasingly mobile and are expecting the same level of connectivity in the home, in the office, and on the road. The regulatory and commercial environment in which we communicate is changing. The telecommunications market is becoming increasingly competitive. The Internet is erasing the borders between information technology and telecommunications. And the way we do business is ever more dominated by electronic exchanges of information. Is our technology ready for the open market of networks and services? Can we manage the growing complexity of computing and telecommunications technology and place it at the service of the people? The challenge for the research community is to develop the tools and techniques that will ultimately bring the full power of communications and information to everyone, in a way that everyone can easily use. The Sixth International Conference on Intelligence in Services and Networks (IS&N’99) is all about technology for paving the way to the open services market. Since the first IS&N conference in 1992 the focus of the IS&N program has continually shifted. We see existing technologies maturing while new ones emerge, but the bottom line has always been putting technology at the service of the people.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer"
        },
        {
            "Title": "The reception of education reforms through the Blogosphere",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3394231.3397909",
            "Abstract": "Teachers and other Edu-professionals in the United Kingdom are a professional body charged with educating each generation of children from birth to age 18, and beyond to Higher Education (HE). Over the last 10 years or so, they have formed a significant community in the blogosphere.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Linked data as a Foundation for the deployment of Semantic applications in Higher Education",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/267660/",
            "Abstract": "The value of semantic technologies in the context of learning and teaching has often been associated with the use of reasoning to support learning processes. This paper discusses the value of linked data in addressing data interoperability and integration across higher education institutions and repositories. This value is related to higher education challenges and a proposal on deploying linked data in higher education is presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Grid-based virtual laboratory experiments for a graduate course on sensor networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4084615/",
            "Abstract": "This paper presents the pedagogical and technical challenges the authors faced in developing a distributed laboratory for the execution of virtual scientific experiments (VSEs) superimposed on a Grid infrastructure, for a course on sensor networks that is part of the Master's in Information Networking (MSIN) program jointly offered by Carnegie Mellon University (CMU), USA and Athens Information Technology (AIT), Athens, Greece. The MSIN program utilizes virtual classroom technologies because of its strong distance learning component. Courses taught by CMU faculty are attended in real-time by students in Athens, Greece, via video-wall teleconferencing sessions. Vice versa, visiting CMU faculty to AIT teach classes that are attended by students at CMU. Students in both institutions enjoy full interactivity with their classmates on the other side of the Atlantic Ocean. A distributed shared virtual laboratory is needed …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring student predictive model that relies on institutional databases and open data instead of traditional questionnaires",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2487788.2487955",
            "Abstract": "Research in student retention and progression to completion is traditionally survey-based, where researchers collect data through questionnaires and interviewing students. The major issues with survey-based study are the potentially low response rates and cost. Nevertheless, a large number of datasets that could inform the questions that students are explicitly asked in surveys is commonly available in the external open datasets. This paper describes a new student predictive model for student progression that relies on the data available in institutional internal databases and external open data, without the need for surveys. The results of empirical study for undergraduate students in their first year of study shows that this model can perform as well as or even out-perform traditional survey-based ones.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ASPG: generating OLAP queries for SPARQL benchmarking",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50112-3_13.pdf",
            "Abstract": "The increasing use of data analytics on Linked Data leads to the requirement for SPARQL engines to efficiently execute Online Analytical Processing (OLAP) queries. While SPARQL 1.1 provides basic constructs, further development on optimising OLAP queries lacks benchmarks that mimic the data distributions found in Link Data. Existing work on OLAP benchmarking for SPARQL has usually adopted queries and data from relational databases, which may not well represent Linked Data. We propose an approach that maps typical OLAP operations to SPARQL and a tool named ASPG to automatically generate OLAP queries from real-world Linked Data. We evaluate ASPG by constructing a benchmark called DBOBfrom the online DBpedia endpoint, and use DBOB to measure the performance of the Virtuoso engine.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Optimising linked data queries in the presence of co-reference",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07443-6_30",
            "Abstract": "Due to the distributed nature of Linked Data, many resources are referred to by more than one URI. This phenomenon, known as co-reference, increases the probability of leaving out implicit semantically related results when querying Linked Data. The probability of co-reference increases further when considering distributed SPARQL queries over a larger set of distributed datasets. Addressing co-reference in Linked Data queries, on one hand, increases complexity of query processing. On the other hand, it requires changes in how statistics of datasets are taken into consideration. We investigate these two challenges of addressing co-reference in distributed SPARQL queries, and propose two methods to improve query efficiency: 1) a model named Virtual Graph, that transforms a query with co-reference into a normal query with pre-existing bindings; 2) an algorithm named Ψ, that intensively exploits …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The Web in education",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128612003489",
            "Abstract": "The Web has spurred our imagination as to how education could be radically transformed and enhanced through the adoption of Information and Communication Technologies (ICTs). While there have been many significant innovations and successes over the last decade there have also been many unrealised aims. Beliefs in technology-driven change for education have been countered by shortcomings in technological understanding by educationalists and in turn by shortcomings in the understanding of educational theories and learning concepts by technologists. The use of the Web in education has revealed issues such as the distinction between formal and informal learning; the packaging and formatting of learning materials for online distribution and use; the management of learning materials and processes in virtual and managed learning environments; solutions offered by the semantic Web; and how the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Resource oriented modelling: Describing restful Web Services using collaboration diagrams",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6731108/",
            "Abstract": "The popularity of Resource Oriented and RESTful Web Services is increasing rapidly. In these, resources are key actors in the interfaces, in contrast to other approaches where services, messages or objects are. This distinctive feature necessitates a new approach for modelling RESTful interfaces providing a more intuitive mapping from model to implementation than could be achieved with non-resource methods. With this objective we propose an approach to describe Resource Oriented and RESTful Web Services based on UML collaboration diagrams. Then use it to model scenarios from several problem domains, arguing that Resource Oriented and RESTful Web Services can be used in systems which go beyond ad-hoc integration. Using the scenarios we demonstrate how the approach is useful for: eliciting domain ontologies; identifying recurring patterns; and capturing static and dynamic aspects of the …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet Science",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-45982-0.pdf",
            "Abstract": "This volume contains the papers presented at INSCI 2016, the Third International Conference on Internet Science, held on September 12–14, 2016 in Florence. This conference brought together researchers from across the world to help further develop the emerging discipline of Internet Science. Internet Science is an interdisciplinary field that explores the sociotechnical nature of the Internet through the lenses of Computer Science, Sociology, Art, Mathematics, Physics, Complex Systems Analysis, Psychology, Economics, Law, Political Sciences, and more. Internet Science aims to bridge these different views and theories, in order to create a more holistic understanding of the Internet and its impact on society. In particular, Internet Science asks crucial questions like: How do people behave in the Internet? Are they changing their lifestyle and how? Can the Internet promote sustainability, cooperation, and collective …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer International Pu"
        },
        {
            "Title": "Automating SLA negotiation: a policy-based approach",
            "Publication year": 2001,
            "Publication url": "https://eprints.soton.ac.uk/265270/1/tt-may01.pdf",
            "Abstract": "• Meta-model• Policy language independent• Applies to different application areas• Provides for hierarchical policy organisation• Provides for policy transformation functions• Policy semantics are out of the model• Security information can be added• Compatible with current IETF/DMTF policy models• A base for the implementation of policy-independent PDP/PEPs",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cascades on online social networks: A chronological account",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-70284-1_31",
            "Abstract": "Online social network platforms have served as a substantial venue for research, offering a plethora of data that can be analysed to cultivate insights about the way humans behave and interact within the virtual borders of these platforms. In addition to generating content, these platforms provide the means to spread content via built-in functionalities. The traces of the spreading content and the individuals’ incentives behind such behaviour are all parts of a phenomenon known as information diffusion. This phenomenon has been extensively studied in the literature from different perspectives, one of which is cascades: the traces of the spreading content. These traces form structures that link users to each other, where these links represent the direction of information flow between the users. In fact, cascades have served as an artefact to study the information diffusion processes on online social networks. In …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Observing the web.",
            "Publication year": 2014,
            "Publication url": "http://alexandria-project.eu/wp-content/uploads/2014/09/1st_alex_ws_wendy_hall.pdf",
            "Abstract": "“Real life must be full of all kinds of social constraints–the very processes from which society arises. Computers help if we can use them to create abstract social machines on the Web, processes in which people do the creativity and the machine does the administration. The stage is set for an evolutionary growth of new social engines. The ability to create new forms of social process would be given to the world at large and development would be rapid”",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantically annotated hypermedia services",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1083356.1083406",
            "Abstract": "Hypermedia systems' researchers investigate the various approaches in the way documents and resources are linked, navigated and stored in a distributed environment. Unfortunately, those systems fail to provide effortlessly usable discrete services, since it is difficult both to discover and to invoke any of them. This paper proposes the usage of emerging technologies that try to augment the Web resources with semantics in order to provide Hypermedia services that can be easily discovered, and integrated by potential third party developers. In this context, we analyze the benefits for the Hypermedia community upon the adoption of Semantic Web technologies for the description of Hypermedia services, and we implement an initial corresponding ontology.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysing an academic field through the lenses of Internet Science: Digital Humanities as a Virtual Community",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-18609-2_6",
            "Abstract": "Digital Humanities (DH) has been depicted as an innovative engine for humanities, as a challenge for Data Science, and as an area where libraries, archives and providers of e-research infrastructures join forces with research pioneers. However DH is defined, one thing is certain: DH is a new community which manifests and identifies itself via the Internet and social media. In this paper we propose to describe DH as a virtual community (VC), and discuss the implications of such an epistemic approach. We start with a (re)inspection of the scholarly discourse about VCs, and the analytic frameworks which have been applied to study them. We discuss the aspects that are highlighted by taking such a stance, and use the guidelines proposed by the FP7 European Network of Excellence in Internet Science (EINS) in our investigation.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A REVIEW OF HIGHER EDUCATION CHALLENGES AND INSTITUTIONS’DATA INFRASTRUCTURES RESPONSE TO THOSE CHALLENGES",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=9041946788696649870&hl=en&oi=scholarr",
            "Abstract": "Higher education institutions are large, complex, adaptive social systems like all other human organizations. Over the last decade, Higher Education around the world is facing a number of challenges and potential threats to effective learning and teaching support. In recent years considerable interest has focused on identifying those challenges, identifying the threats and proposing ways to address them. However, the relevant literature on higher education challenges is scattered over many textbooks, conferences and journals. This paper presents a comprehensive presentation of all those challenges found in different literatures in a structured way. Also this study will identify how technology and institutions’ data infrastructures could response to address those challenges in this changing world where students are changing, their learning styles are changing, and the technologies to accommodate their needs are …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IATED"
        },
        {
            "Title": "Lhd: Optimising linked data query processing using parallelisation.(2013)",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=15967168569763700100&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:9pM33mqn1YgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "IoT and semantic web technologies for event detection in natural disasters",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cpe.4789",
            "Abstract": "Natural disasters cannot be predicted well in advance, but it is still possible to decrease the loss of life and mitigate the damages, exploiting some peculiarities that distinguish them. Smart collection, integration, and analysis of data produced by distributed sensors and services are key elements for understanding the context and supporting decision making process for disaster prevention and management. In this paper, we demonstrate how Internet of Things and Semantic Web technologies can be effectively used for abnormal event detection in the contest of an earthquake. In our proposal, a prototype system, which retrieves the data streams from IoT sensors and web services, is presented. In order to contextualize and give a meaning to the data, semantic web technologies are applied for data annotation. We evaluate our system performances by measuring the response time and other parameters that are …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:XoXfffV-tXoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ewya: An interoperable fog computing infrastructure with RDF stream processing",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-70284-1_20",
            "Abstract": "Fog computing is an emerging technology for the Internet of Things (IoT) that aims to support processing on resource-constrained distributed nodes in between the sensors and actuators on the ground and compute clusters in the cloud. Fog Computing benefits from low latency, location awareness, mobility, wide-spread deployment and geographical distribution at the edge of the network. However, there is a need to investigate, optimise for and measure the performance, scalability and interoperability of resource-constrained Fog nodes running real-time applications and queries on streaming IoT data before we can realise these benefits. With Eywa, a novel Fog Computing infrastructure, we (1) formally define and implement a means of distribution and control of query workload with an inverse publish-subscribe and push mechanism, (2) show how data can be integrated and made interoperable through …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:4MWp96NkSFoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Supporting educators to discover and select ICT tools with SEEK-AT-WD",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33263-0_24",
            "Abstract": "Several educational organizations provide Information and Communication Technology (ICT) tool registries to support educators when selecting ICT tools for their classrooms. A common problem is how to populate these registries with descriptions of ICT tools that can be useful for education. This paper proposes to tackle it taking advantage of the information already published in the Web of Data, following a Linked-Data approach. For this purpose, SEEK-AT-WD is proposed as an infrastructure that automatically retrieves ICT tool descriptions from the Web and publishes them back once they are related to an educational vocabulary. A working prototype containing 3556 descriptions of ICT tools is presented. These descriptions can be accessed either from a web interface or through a search client that has also been developed. The potential of the proposal is discussed by means of a feature analysis …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Learning Grid Handbook: Concepts, Technologies and Applications",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UwvvAgAAQBAJ&oi=fnd&pg=PR1&dq=info:VD9PwleWQ2MJ:scholar.google.com&ots=gVBLW8xRHb&sig=WDbWfvK_DSTiULQM_ETnw_iQhrU",
            "Abstract": "Grid technologies are rising with the next generation of Internet by defining a powerful computing paradigm. Grid could be used as a technology ‘glue’providing users with a uniform way to access resources by means of several devices. These technologies can provide a support for Technology Enhanced Learning (TEL) by enabling new learning environments based on collaboration, real direct experience, personalization, ubiquity, accessibility and contextualization. Nevertheless, to be effectively used in TEL, Grid must be complemented with other elements like semantics and educational modelling; leading to the concept of ‘Learning Grid’as defined in the homonymous Special Interest Group (SIG) of the European Network of Excellence ‘Kaleidoscope: Shaping the Scientific Evolution of Technology Enhanced Learning’. The key challenge that Kaleidoscope is facing is the scientific and structural integration of the European TEL research. In this context, the Learning Grid SIG aims at contributing to the achievement of an improvement in TEL practices through the definition of open, distributed and pervasive environments for effective human learning taking into account that effective learning requires an active attitude of learners and that learning is a social and collaborative activity so requiring a technology that allows for active and realistic experiments, personalization, knowledge creation and evolution, as well as autonomous and dynamic creation of communities. The first section of the book is about the concept of Learning Grid and related technologies. The second chapter analyses and compares existing languages for the dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Governance in the age of social machines: the web observatory",
            "Publication year": 2015,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.819.6386&rep=rep1&type=pdf",
            "Abstract": "The World Wide Web has provided unprecedented access to information; as humans and machines increasingly interact with it they provide more and more data. The challenge is how to analyse and interpret this data within the context that it was created, and to present it in a way that both researchers and practitioners can more easily make sense of.The first step is to have access to open and interoperable data sets, which Governments around the world are increasingly subscribing to. But having ‘open’data is just the beginning and does not necessarily lead to better decision making or policy development. This is because data do not provide the answers–they need to be analysed, interpreted and understood within the context of their creation, and the business imperative of the organisation using them. The major corporate entities, such as Google, Amazon, Microsoft, Apple and Facebook, have the capabilities to do this, but are driven by their own commercial imperatives, and their data are largely siloed and held within ‘walled gardens’ of information. All too often governments and non-profit groups lack these capabilities, and are driven by very different mandates. In addition they have far more complex community relationships, and must abide by regulatory constraints which dictate how they can use the data they hold. As such they struggle to maximise the value of this emerging ‘digital currency’and are therefore largely beholden to commercial vendors. What has emerged is a public-private data ecosystem that has huge policy implications (including the twin challenges of privacy and security). Many within the public sector lack the skills to …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The digital underground economy: A social network approach to understanding cybercrime",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/343351",
            "Abstract": "Emphasized in both the National Security Strategy [11] and the Cyber Security Strategy [3], cybercrime is now a Tier-One national threat to the United Kingdom, a threat which must be addressed as our lives become ever more embedded in the digital economy. Recent cybercrime statistics [14, 24] indicate that with hundreds of millions worth of damage, cybercrime remains one of the primary threats facing nations, corporations and ordinary people. The intriguing question then is how has cybercrime managed to evolve into such a persistent problem despite almost a decade of extensive research into cybersecurity?",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Negotiating the Web Science Curriculum through Shared Educational Artefacts",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2527031.2527046",
            "Abstract": "The far-reaching impact of the Web on society is widely recognised. The interdisciplinary study of this impact has crystallised in the field of study known as Web Science. However, defining an agreed, shared understanding of what constitutes web science requires complex negotiation and translations of understandings across component disciplines, national cultures and educational traditions. Some individual institutions have already established particular curricula, and discussions in the Web Science Curriculum Workshop series have marked the territory to some extent. This paper reports on a process being adopted across a consortium of partners to systematically create a shared understanding of what constitutes web science. It records and critiques the processes instantiated to agree a common curriculum, and presents a framework for future discussion and development.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic Technologies in Learning and Teaching (SemTech)-JISC Report",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/267534/",
            "Abstract": "This report presents and discusses the findings of the SemTech (Semantic Technologies for Learning and Teaching) project that was funded by JISC and commenced its activities in September 2008. SemTech addressed the following questions: • What are semantic technologies? • Which tools that make use of semantic technologies are, or could be, relevant to education? • What is the actual use of semantic tools and services in UK HE and FE? • What is the value of such tools in the context of learning, teaching and support? • How do we envisage the adoption of semantic tools in higher education in the future? Although a definition of semantic technologies was not in the scope of the project it was considered necessary for the survey of semantic tools and services and their adoption. SemTech distinguishes between (i) soft semantic technologies like topic maps and Web 2.0 applications, which provide lightweight knowledge modelling in formats understood by humans and (ii) hard semantic technologies like RDF, which provide knowledge modelling in formats processable by computers. The outcomes of an extensive survey of semantic technologies relevant to learning and teaching are documented online (http://semtech-survey.ecs.soton.ac.uk). A total of thirty-six relevant tools and services have been identified by SemTech and the community at the moment of writing. Most of the surveyed tools were not purpose-built for education and they find value in semantic technologies for well-formed metadata or data interoperability and integration. The surveyed tools can be classified to (i) collaborative authoring and annotation, (ii) searching and …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The problem of identifying misogynist language on Twitter (and other online social spaces)",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2908131.2908183",
            "Abstract": "Misogynist abuse has now become serious enough to attract attention from scholars of Law [7]. Social network platform providers have been forced to address this issue, such that Twitter is now very clear about what constitutes abusive behaviour, and has responded by updating their trust and safety rules [16].",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "JISC-SemTech project report",
            "Publication year": 2009,
            "Publication url": "https://www.voced.edu.au/content/ngv:29098",
            "Abstract": "Semantic technologies appear to hold the promise of significantly enhancing formal and informal learning but issues such as building ontology consensus, the logistics of annotating large volumes of learning content and the underpinning pedagogy have been frequently questioned. However, recent developments in Web 2.0 tools and services for teaching and learning show that these concerns may be successfully addressed and benefit higher education/further education, informal learning and exploratory learning. This project sought to identify and quantify these benefits and outline a roadmap...[+] Show more",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interoperable and efficient: linked data for the internet of things",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-45982-0_15",
            "Abstract": "Two requirements to utilise the large source of time-series sensor data from the Internet of Things are interoperability and efficient access. We present a Linked Data solution that increases interoperability through the use and referencing of common identifiers and ontologies for integration. From our study of the shape of Internet of Things data, we show how we can improve access within the resource constraints of Lightweight Computers, compact machines deployed in close proximity to sensors, by storing time-series data succinctly as rows and producing Linked Data ‘just-in-time’. We examine our approach within two scenarios: a distributed meteorological analytics system and a smart home hub. We show with established benchmarks that in comparison to storing the data in a traditional Linked Data store, our approach provides gains in both storage efficiency and query performance from over 3 times to …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Systems & Platforms: Security",
            "Publication year": 2013,
            "Publication url": "http://edshare.soton.ac.uk/id/eprint/10806",
            "Abstract": "Systems & Platforms: Security - EdShare Southampton EdShare Home Browse By Year By \nAuthor Tags Course code University structure Share About Help Login Login Systems & \nPlatforms: Security Loading Loading previews... comp1214-12-security.ppt Slideshow Download \n(1MB) comp1214-12-security.ppt comp1214-12-security.ppt 1 file in this resource Systems & \nPlatforms: Security Added By: Mr Rikki Prince Date Added: 16 Apr 2013 15:27 Creators Name: Dr \nAthanassios Tiropanis Mr Rikki Prince Dr Yvonne Howard Tags: comp1214, operating systems, \nsystems & platforms, security Viewing permissions: University Course codes: COMP1214 \nLink: http://edshare.soton.ac.uk/id/eprint/10806 Downloads & Views Actions (login required) \nView Item View Item Toolbox There are no actions available for this resource. Collection(s) \nCOMP1214 course materials EdShare For any questions or feedback, please contact us. …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Internet Science",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-45982-0.pdf",
            "Abstract": "This volume contains the papers presented at INSCI 2016, the Third International Conference on Internet Science, held on September 12–14, 2016 in Florence. This conference brought together researchers from across the world to help further develop the emerging discipline of Internet Science. Internet Science is an interdisciplinary field that explores the sociotechnical nature of the Internet through the lenses of Computer Science, Sociology, Art, Mathematics, Physics, Complex Systems Analysis, Psychology, Economics, Law, Political Sciences, and more. Internet Science aims to bridge these different views and theories, in order to create a more holistic understanding of the Internet and its impact on society. In particular, Internet Science asks crucial questions like: How do people behave in the Internet? Are they changing their lifestyle and how? Can the Internet promote sustainability, cooperation, and collective …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer International Pu"
        },
        {
            "Title": "Grid-based interactive virtual scientific experiments for distributed virtual communities",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2010.037786",
            "Abstract": "Today, distance learning classes are commonly offered from many leading universities around the world. A major challenge in such distributed classrooms is the formation of active virtual communities among the participating students. Shared virtual laboratories offer such a possibility as students form lab teams to run the same interactive simulation and in the course of such experiments learn to interact and understand each other better. A virtual scientific experiment architectural framework on top of a grid infrastructure for running interactive virtual laboratory experiments for such distributed student communities with visualisation capabilities was designed and implemented, using web services standard protocols such as WSDL and WS-notification as implemented in the WSRF specification. This paper reports on results from running such simulations on a local grid infrastructure. System evaluation results from a …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Architectural considerations for managing mobility",
            "Publication year": 2001,
            "Publication url": "https://search.proquest.com/openview/09a5a1bf9702dc4f427b45a109531d4c/1?pq-origsite=gscholar&cbl=2026366&diss=y",
            "Abstract": "Ever since the first communication systems were deployed, requirements for mobility have been one of the most important causes of architectural changes. For instance, it has taken a long period of research and standardisation to arrive at the deployment of mobile telephony, the architecture of which is very different from that of the traditional/fixed telephony. Similarly, in the Internet, the proposed architecture of Mobile-IP adopts different methods of IP address allocation and routing, among other changes. On the other hand, the mobile system architectures introduced by the different communities, eg telephony, Internet, data management, nomadic computing, and wireless communications, all differ significantly. They provide different kinds of mobility, they adopt different approaches to managing mobility and each of them has certain architectural problems. For example, the problem of triangular routing in Mobile IP is …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimising Linked Data Queries Using Runtime Statistics in the Presence of Co-reference",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=1063050429953425753&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced learning management systems for distance education",
            "Publication year": 2005,
            "Publication url": "https://eprints.soton.ac.uk/267215/",
            "Abstract": "Distance education is in a position to offer additional educational solutions and to constitute a platform for the dissemination of knowledge beyond geographical limitations. The success of distance education activities depends on the proper pedagogical and technological support. For its provision and management, thus, adapted pedagogical procedures as well as innovative technological applications are needed. A synopsis of the different types of distance education is presented below, together with support offered nowadays by learning management systems. Moreover, the provision is presented of a learning content management system within the framework of ZEUS, a Greek research project focusing on the provision of distance in- service training to teachers at remote schools.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:blknAaTinKkC",
            "Publisher": "NEMED Consortium"
        },
        {
            "Title": "Tritandb: time-series rapid internet of things analytics",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1801.07947",
            "Abstract": "The efficient management of data is an important prerequisite for realising the potential of the Internet of Things (IoT). Two issues given the large volume of structured time-series IoT data are, addressing the difficulties of data integration between heterogeneous Things and improving ingestion and query performance across databases on both resource-constrained Things and in the cloud. In this paper, we examine the structure of public IoT data and discover that the majority exhibit unique flat, wide and numerical characteristics with a mix of evenly and unevenly-spaced time-series. We investigate the advances in time-series databases for telemetry data and combine these findings with microbenchmarks to determine the best compression techniques and storage data structures to inform the design of a novel solution optimised for IoT data. A query translation method with low overhead even on resource-constrained Things allows us to utilise rich data models like the Resource Description Framework (RDF) for interoperability and data integration on top of the optimised storage. Our solution, TritanDB, shows an order of magnitude performance improvement across both Things and cloud hardware on many state-of-the-art databases within IoT scenarios. Finally, we describe how TritanDB supports various analyses of IoT time-series data like forecasting.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparison between mobile and ubiquitous learning from the perspective of human–computer interaction",
            "Publication year": 2012,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMLO.2012.050046",
            "Abstract": "In this paper, the notions of mobile learning and ubiquitous learning are compared from the viewpoint of the nature of interaction between learners and computers. This comparison leads to better understanding of their potential and the differences between these notions.",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "SemTech project report",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=16987111127177658665&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "T0MK3pUAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motivating university students using a location-aware time management system with social networking features",
            "Publication year": 2010,
            "Publication url": "https://www.learntechlib.org/p/35101/",
            "Abstract": "Time management in university can be different from that in the professional workplace or at school. Students are required to learn independently, many learning activities take place outside the formal teaching timetable, and students may require additional motivation. We present the design of a time management system prototype addressing these requirements. Our system contains social networking features, enhanced social presence, and motivational techniques. Individual learning task progress data is disclosed to other students, enabling them to assess their own progress and seek help from their peers. Also, their current geographical position and that of their peers is shown on a virtual map. We use this prototype in an experiment with 55 first-year students studying on an undergraduate degree in our department. Our objectives are to test the effects of the system on academic performance, and to evaluate …",
            "Abstract entirety": 0,
            "Author pub id": "T0MK3pUAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        }
    ]
}]