[{
    "name": "Αθανάσιος Νταραντούμης",
    "romanize name": "Athanasios Ntarantoumis",
    "School-Department": "Πολιτισμικής Τεχνολογίας και Επικοινωνίας",
    "University": "aegean",
    "Rank": " Καθηγητής",
    "Apella_id": 18062,
    "Scholar name": "Thanasis Daradoumis",
    "Scholar id": "5oD0RKcAAAAJ",
    "Affiliation": "Professor, University of the Aegean / Open University of Catalonia",
    "Citedby": 2920,
    "Interests": [
        "Emotional Intelligence",
        "Alternative (Holistic) Education",
        "Learning Analytics",
        "Collaborative",
        "Affective and Adaptive Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=5oD0RKcAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A Network Analysis Method for Tailoring Academic Programs",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/a-network-analysis-method-for-tailoring-academic-programs/149429",
            "Abstract": "Producing or updating an academic program implies a significant effort: involving people, academic units, knowledge elements, regulations, institutions, industry, etc. Such effort entails a complexity related to the volume of elements involved, the diversity of the origins of contributions, the diversity of formats, the representation of information, and the required granularity. Moreover, such effort is a common task performed by humans who collaborate for long periods of time participating in frequent meetings in order to achieve agreement. New educational approaches are heading to adaptive, flexible, ubiquitous, asynchronous, collaborative, hyper-mediated, and personalized strategies based on modern Information and Communication Technologies (ICT). We propose an approach for tailoring academic programs to provide a practical and automated method to discover and organize milestones of knowledge through …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:sSrBHYA8nusC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A neural approach for modeling the inference of awareness in computer-supported collaboration",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11876663_37",
            "Abstract": "Individuals interacting in a computer supported collaborative learning (CSCL) environment produce a variety of information elements during their participation; these information elements usually have a complex structure and semantics, which make it rather difficult to find out the behavioral attitudes and profiles of the users involved. This work provides a model that can be used to discover awareness information lying underneath multi-user interaction. This information is initially captured in log files and then is represented in a specific form in events-databases. By using data mining techniques, it is possible to infer both the users’ behavioral profiles and the relationships that occur in a CSCL environment. In this work we combine different data mining strategies and a neural-based approach in order to construct a multi-layer model that provides a mechanism for inferring different types of awareness …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Analyzing students' perceptions to improve the design of an automated assessment tool in online distributed programming",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131518302665",
            "Abstract": "Designing an automated assessment tool in online distributed programming can provide students with a meaningful distributed learning environment that improves their academic performance. However, it is a complex and challenging endeavor that, as far as we know, has not been investigated yet. To address this research gap, this work presents a new automated assessment tool in online distributed programming, called DSLab. The tool was evaluated in a real long-term online educational experience by analyzing students' perceptions with the aim of improving its design. A quantitative analysis method was employed to collect and analyze data concerning students’ perceptions as to whether using the DSLab tool was really a worthwhile experience. Our study shows that the DSLab tool includes acceptable utility and efficiency features. It also identifies factors that influence current design efficiency with the aim of …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:WZBGuue-350C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Graph indexing and querying: a review",
            "Publication year": 2010,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17440081011053104/full/html",
            "Abstract": "The purpose of this paper is to provide a detailed discussion for different types of graph queries and a different mechanism for indexing and querying graph databases.The paper reviews the existing approaches and techniques for indexing and querying graph databases. For each approach, the strengths and weaknesses are discussed with particular emphasis on the target application domain. Based on an analysis of the state‐of‐the‐art of research literature, the paper provides insights for future research directions and untouched challenging research aspects.Several graph indexing and querying techniques have been proposed in the literature. However, there is still a clear room for improvement and further research issues in that domain.The paper identifies the advantages and disadvantages of the different graph …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Technology Enhanced Systems and Tools for Collaborative Learning Scaffolding, vol. 350",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=6639152272008657489&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Grid Approach to Efficiently Embed Information and Knowledge into Collaborative Learning Applications",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=6329814198380275376&hl=en&oi=scholarr",
            "Abstract": "The reports of the repository are subject to a Creative Commons Attribution-Noncommercial-NoDerivativeWorks 3.0 license. They may be copied, distributed and broadcast provided that the authors, the institution promoting them (Internet Interdisciplinary Institute-Open University of Catalonia). Commercial use and derivative works are not permitted. The full licence can be consulted on http://creativecommons. org/licenses/by-nc-nd/3.0/es/deed. en",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering Social Relationships and Intentions in Web Forums Using Natural Language Processing Techniques",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.488.613&rep=rep1&type=pdf",
            "Abstract": "Natural Language (NL) is the main communication media for humans, who have a deep need for communicating based on evolutionary mechanisms. This inner-need implied the development of languages. Proto-humans had to name objects around, feelings, memories, expectations, and etcetera. The growing of conscience in human’s brain along the time, led to the construction of complex models of concepts stored among the neurons of the brain. Some layers of the brain were devoted to handle the relations between an inner net of concepts with the areas concerning the treatment of language. The NL spoken by humans has a complex construction, based on the diversity of meaning for words and expressions according to the context. Besides, there are different cases of languages. Our work is aimed at presenting a multi-agent approach for dealing with the problem of discovering the intention in expressions written in Spanish and inside Web forums. We are also looking for the identification of some relations among participants in the Web forum. Although the conversations in these forums are usually built in some point between formal and informal communications, and would not follow grammatical rules in every case, we have made arrangements to deal with many of the situations present in Web forums and provide an adaptive response for most of the cases.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterizing Social Network e-Assessment in Collaborative Complex Learning Resources The 8th International Conference on Complex",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=1893059840230560029&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multi-fold time approach to address emotions in live and virtualized collaborative learning",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6245704/",
            "Abstract": "The enrichment of Computer Supported Collaborative (CSCL) Systems with emotion awareness features (detect emotion patterns and respond effectively) opens a window to the future of learner-to-computer interaction. In the current paper we present a system's design that attempts to evaluate the learner's affective state while he/she is taking part into collaborative tasks, in three different time-points: (i) before the task, (ii) in real-time (while collaborating) and (iii) retrospective (after the task). For the emotion assessment process, self-reporting and sentiment analysis are explored. Based on effective production rules that correlate emotions or emotion sequences to affective feedback techniques, the system will provide emotion scaffolds corresponding to user needs and feelings.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An integrated approach for analysing and assessing the performance of virtual learning groups",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30112-7_25",
            "Abstract": "Collaborative distance learning involves a variety of elements and factors that have to be considered and measured in order to analyse and assess group and individual performance more effectively and objectively. This paper presents an approach that integrates qualitative, social network analysis (SNA) and quantitative techniques for evaluating online collaborative learning interactions. Integration of various different data sources, tools and techniques provides a more complete and robust framework for group modelling and guarantees a more efficient evaluation of group effectiveness and individual competence. Our research relies on the analysis of a real, long-term, complex collaborative experience, which is initially evaluated in terms of principled criteria and a basic qualitative process. At the end of the experience, the coded student interactions are further analysed through the SNA technique to …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extending jxta protocols for p2p file sharing systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606660/",
            "Abstract": "File sharing is among the most important features of the today's Internet-based applications. Most of such applications are server-based approaches inheriting thus the disadvantages of centralized systems. Advances in P2P systems are allowing to share huge quantities of data and files in a distributed way. In this paper, we present extensions of JXTA protocols to support file sharing in P2P systems with the aim to overcome limitations of server-mediated approaches. Our proposal is validated in practice by deploying a P2P file sharing system in a real P2P network. The empirical study revealed the benefits and drawbacks of using JXTA protocols for P2P file sharing systems.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A network analysis method for selecting personalized content in e-Learning programs",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6603923/",
            "Abstract": "Academic programs demand a constant updating. As the reader might agree, today's societies demand a new merge of knowledge elements. Current web-infrastructure is able to support new approaches in science development. On the one hand, due to current social, scientific and technological advances, academic programs in universities are clearly under pressure to be constantly restructured and renewed in order to provide valid and up-to-date knowledge to students. On the other hand, students obviously have different academic needs and backgrounds. So every person needs to follow a specific path in its training process. Our approach aims at proposing a well-ordered method for selecting personalized contents in e-Learning environments through the use of complex network analysis. Due to the similar nature and structure of knowledge and despite the diversity of knowledge types, the proposed method …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Orchestration challenges raised by transporting a traditional writing activity into a web-based Computer Supported Collaborative Language Learning activity",
            "Publication year": 2017,
            "Publication url": "https://research.utwente.nl/files/192996365/finalvol2cscl2017.pdf#page=305",
            "Abstract": "Language teaching is dominated by traditional methodologies and teachers argue that elaborated pedagogies, such as collaborative learning, combined with innovative technologies lead to a classroom with a “complex ecosystem”. Attempting to understand the causes of the appearing management issues, this paper uses the term orchestration to describe real-time management of learning processes and examines the orchestration challenges raised when transporting an individual writing activity into a Computer-Supported Collaborative Language Learning (CSCLL) one.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rediscovering the use of chatbots in education: A systematic literature review",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cae.22326",
            "Abstract": "Chatbots have been around for years and have been used in many areas such as medicine or commerce. Our focus is on the development and current uses of chatbots in the field of education, where they can function as service assistants or as educational agents. In this research paper, we attempt to make a systematic review of the literature on educational chatbots that address various issues. From 485 sources, 80 studies on chatbots and their application in education were selected through a step‐by‐step procedure based on the guidelines of the PRISMA framework, using a set of predefined criteria. The results obtained demonstrate the existence of different types of educational chatbots currently in use that affect student learning or improve services in various areas. This paper also examines the type of technology used to unravel the learning outcome that can be obtained from each type of chatbots. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:fbc8zXXH2BUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of Clustering techniques for Efficient Searching in JXTA-based P2P systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606721/",
            "Abstract": "The efficient file searching is an essential feature in P2P systems. While many current approaches use brute force techniques to search files by meta information (file names, extensions or user-provided tags), the interest is in implementing techniques that allow content-based search in P2P systems. Recently, clustering techniques have been used for searching text documents to increase the efficiency of document discovery and retrieval. Integrating such techniques into P2P systems is important toenhance searching in P2P file sharing systems. While some effort has been done for content-based searching for text documents in P2P systems, there has been few research work for applying these techniques for multimedia content in P2P systems. In this paper we introduce two P2P content-based clustering techniques for multimedia documents. These techniques are an adaptation of the existing Class-based Semantic …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating learning services in the cloud: An approach that benefits both systems and learning",
            "Publication year": 2015,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.18.1.145.pdf",
            "Abstract": "Currently there is an increasing trend to implement functionalities that allow for the development of applications based on Cloud computing. In education there are high expectations for Learning Management Systems since they can be powerful tools to foster more effective collaboration within a virtual classroom. Tools can also be integrated with these systems that can provide assistance to students on any topic covered in class through the proliferation and popularity of publicly available Web APIs. However, generally most students and teachers still face technological barriers to access these resources and integrate them into their educational systems. This paper discusses an effort to overcome this problem by proposing a method of resource access through linked data, which is explicitly defined with semantic annotations related to the learning environment. Doing so, we are able to decorate the Cloud providers …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:9yKSN-GCB0IC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "NWeSP 2007",
            "Publication year": 2007,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/cisis/2016/0987z048/12OmNBKmXsu",
            "Abstract": "We are very pleased to welcome our colleagues to the International Conference on Next generation Web Services Practices (NWeSP'07). NWeSP'07 is a forum which brings together researchers and practitioners specializing on different aspects of Web based information systems. The second conference will bring together the world's most respected authorities on semantic web, Web based services, Web applications, Web enhanced business information systems, e-education specialists, Information security, and other Web related technologies. NWeSP'07 addresses the following important themes:",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A computational academic integrity framework",
            "Publication year": 2018,
            "Publication url": "https://84.88.27.106/handle/10803/461581",
            "Abstract": "The growing scope and changing nature of academic programmes provide a challenge to the integrity of traditional testing and examination protocols. The aim of this thesis is to introduce an alternative to the traditional approaches to academic integrity, bridging the anonymity gap and empowering instructors and academic administrators with new ways of maintaining academic integrity that preserve privacy, minimize disruption to the learning process, and promote accountability, accessibility and efficiency. This work aims to initiate a paradigm shift in academic integrity practices. Research in the area of learner identity and authorship assurance is important because the award of course credits to unverified entities is detrimental to institutional credibility and public safety. This thesis builds upon the notion of learner identity consisting of two distinct layers (a physical layer and a behavioural layer), where the criteria of identity and authorship must both be confirmed to maintain a reasonable level of academic integrity. To pursue this goal in organized fashion, this thesis has the following three sections: (a) theoretical, (b) empirical, and (c) pragmatic.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling efficient real time user modeling in on-line campus",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73078-1_46",
            "Abstract": "User modelling in on-line distance learning is an important research field focusing on two important aspects: describing and predicting students’ actions and intentions as well as adapting the learning process to students’ features, habits, interests, preferences, and so on. The aim is to greatly stimulate and improve the learning experience. In this context, user modeling implies a constant processing and analysis of user interaction data during long-term learning activities, which produces large and considerably complex information. As a consequence, processing this information is costly and requires computational capacity beyond that of a single computer. In order to overcome this obstacle, in this paper we show how a parallel processing approach can considerably decrease the time of processing log data that come from on-line distance educational web-based systems. The results of our study show the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Providing emotion awareness and affective feedback to virtualised collaborative learning scenarios",
            "Publication year": 2014,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2014.060154",
            "Abstract": "The enrichment of computer supported collaborative learning (CSCL) systems with emotion awareness features (detect emotion patterns and respond affectively) opens a window towards an authentic social interaction and learning experience. In the current paper, we first review prominent emotion theories and models with respect to learning, detection techniques and affective feedback strategies, and then we present a system’s design and implementation that provides collaborators with a usable, web tool for self-reporting of emotions. In response to the user’s emotions, the system activates an animated, virtual assistant that employs expressive faces and synthesised speech to provide affective and task-based feedback. The specific tool was customised and adapted to the virtualised collaborative session (VCS) system for the needs of an experiment that we run in the Open University of Catalonia. The respective …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:1qzjygNMrQYC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Evaluation of the effectiveness of a web-based learning design for adult computer science courses",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5545452/",
            "Abstract": "This paper reports on work undertaken within a pilot study concerned with the design, development, and evaluation of online computer science training courses. Drawing on recent developments in e-learning technology, these courses were structured around the principles of a learner-oriented approach for use with adult learners. The paper describes a methodological framework for the evaluation of three main educational issues involved in the learning process of Web-based computer science training courses, and analyzes the results of this study with the aim of providing an improved learning design, and environment, for these courses. The findings highlight a number of potential barriers to learning and indicate the failed indicators that need to be improved in order to enhance effective performance. The authors give their views both on ways to improve the proposed learning environment and on the need for an …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Knowledge extraction and representation of collaborative activity through ontology-based and Social Network Analysis technologies",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBIDM.2009.026905",
            "Abstract": "This paper describes an approach for extracting and representing the knowledge generated from collaborative interaction of small learning teams that work together in distance to carry out a software project or a case study. Our approach is based on ontology, Social Network Analysis (SNA) and fuzzy classification, which has been initially developed as a mechanism to analyse and understand behavioural patterns from collaboration performed in different scenarios. Through the SNA we are able to define an ontological profile that provides a deep knowledge about the participants' roles, intentions and effects; hence a fuzzy model can perform inferences over individual indicators.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Using a real Internet-scale environment for protocol testing in undergraduate courses: students\" behaviour and feedback",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=10375170490642534203&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Responding affectively in online learning situations",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6403210/",
            "Abstract": "This paper describes a system's implementation that evaluates the learner's affective state and based on computer intelligence, responds affectively. Prominent theories and models of emotions are reviewed and analysed, especially in respect to learning, together with emotion recognition technologies. Finally, we set open issues for future experimentation, contributing to the research agenda.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards the use of metaphors in the design and implementation of educational software: a case study",
            "Publication year": 2009,
            "Publication url": "https://www.learntechlib.org/p/32011/",
            "Abstract": "This paper presents a case study that illustrates the significance of using metaphors in the design of educational software through a specific example for the learning of basic concepts of Operating Systems (OS) by beginers. Constructivist and social views of learning have also taken into account. Our software helps students study scheduling, using a simple and fundamental algorithm–the Priority Round-Robin (PRR) algorithm, used for scheduling in most OS. The architecture of the proposed software consists of two main parts: a) an information space where students are provided with opportunities to access appropriate information about OS and b) an experimentation space that allows students to take control of their learning by forming their own set of tasks, assigning them priorities and durations. This architecture could be used for the learning of diverse scheduling algorithms. Finally, the system provides learners …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Exploring the value of audience collaboration and game design in immersive virtual learning environments",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1810543.1810605",
            "Abstract": "Informal learning in public spaces like museums and location-based entertainment venues is increasingly popular during the last years. Especially in technology-enhanced museums such properties as Virtual Reality, Game-Based Collaboration, and Immersive Displays are considered to bear significant educational value. After extensive literature review we have come to the conclusion that little to no research has been carried out on the learning outcomes of these powerful properties. Thus, the scope of our research is to investigate the learning efficacy of an integrated schema of audience collaboration and game design in immersive virtual reality environments. In order to achieve this, we are going to build and evaluate a theoretical framework that supports collaboration within an audience of 9--14 years old children.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Convergence among imagination, social-emotional learning and media literacy: an integrative literature review",
            "Publication year": 2020,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03004430.2020.1753720",
            "Abstract": "An integrative literature review was conducted according to Coopers’ guidelines in order to critique and integrate issues over the convergence among imaginative/Waldorf pedagogy, social-emotional learning and media literacy mindfulness in Primary and Secondary education. A comprehensive analysis of theoretical and empirical articles between 2005 and 2019 was provided. Three research questions were set, discussed and analysed highlighting the followinggaps in the literature: (i) the combination of imagination pedagogies with digital media and social-emotional development is neglected, (ii) there is a lack of longitudinal studies to analyse how social-emotional skills contribute to forming critical media literacy according to student’s developmental stage, (iii) there is urgent need for reconceptualizing media literacy by encompassing and analysing its effects on cognitive, social-emotional and motivational …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:8xutWZnSdmoC",
            "Publisher": "Routledge"
        },
        {
            "Title": "LaCOLLA: Middleware for self-sufficient online collaboration",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=17662894760985068079&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:rmuvC79q63oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing CSCL Activity through networking models",
            "Publication year": 2014,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/handle/10609/92597",
            "Abstract": "This study aims at managing activity carried out in Computer-Supported CollaborativeLearning (CSCL) environments. We apply an approach that gathers and manages the knowledgeunderlying huge data structures, resulting from collaborative interaction among participants and stored as activity logs. Our method comprises a variety of important issues and aspects, such as: deep understanding of collaboration among participants in workgroups, definition of an ontology for providing meaning to isolated data manifestations, discovering of knowledge structures built in huge amounts of data stored in log files, and development of high-semantic indicators to describe diverse primitive collaborative acts, and binding these indicators to formal descriptions defined in the collaboration ontology; besides our method includes gathering collaboration indicators from web forums using natural language processing (NLP) techniques.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ZHo1McVdvXMC",
            "Publisher": "International Journal of Emerging Technologies in Learning"
        },
        {
            "Title": "Intelligent adaptation and personalization techniques in computer-supported collaborative learning",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-28586-8.pdf",
            "Abstract": "Contemporary research efforts in the Computer-Supported Collaborative Learning (CSCL) domain have clearly emphasized the need for building flexible, adaptable and intelligibly operating technology systems that could provide a personalized, more productive and satisfactory learning experience to all group learners. The key premise of this endeavor is that intelligent adaptation and personalization techniques can offer the basis for dramatically extending the affordances of the CSCL technology infrastructure and relevant pedagogical design so that learning gains (cognitive and metacognitive) are maximized through elegantly orchestrated peer interaction and support. This perspective lies at the crossroads of Adaptive Educational Hypermedia Systems, Intelligent Tutoring Systems and Computer-Supported Collaborative Learning, expanding the perspective of the fields and setting innovative research agendas …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Monitoring and Assessment in Online Collaborative Environments: Emergent Computational Technologies for E-Learning Support: Emergent Computational Technologies for E-Learning Support",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=BDsBqux8BSIC&oi=fnd&pg=PR1&dq=info:2gIw99eDEJ0J:scholar.google.com&ots=N9kwUY6MOi&sig=AJgk6vOMet5-Ogka1rdVRHJKwJE",
            "Abstract": "Due to growing technologies for learning processes, universities are making modifications in the development and construction of courses and services they offer. Monitoring and Assessment in Online Collaborative Environments: Emergent Computational Technologies for E-Learning Support focuses on new models and systems that perform efficient evaluation of student activity in Internet-based education. Containing research from leading international experts, this Premier Reference Source introduces original case studies and experiences of educators worldwide regarding e-learning activities.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:tH6gc1N1XXoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards the Construction of a Multi-agent Approach for Discovering the Meaning of Natural Language Collaborative Conversations",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606722/",
            "Abstract": "On the one hand, natural language is the main communication media for humans. It has a complex construction, based on the diversity of meaning for words and expressions according to the context. On the other hand, computers are not prepared to handle this ambiguity. The present work aims at presenting a multi-agent approach for dealing with the problem of discovering the meaning of expressions written in Spanish, based on a flexible recovery system and Bayesian principles. At a first stage, agents are supposed to identify the role of the words composing a sentence. At a second stage, a second set of agents is supposed to coordinate among them in order to assemble a meaning. Our research forms part and contributes to the analysis of collaborative conversations among participants in a web-based collaborative learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Connecting moments of creativity, computational thinking, collaboration and new media literacy skills",
            "Publication year": 2019,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ILS-05-2019-0042/full/html",
            "Abstract": "This paper aims to present a novel pedagogical model that aims at bridging creativity with computational thinking (CT) and new media literacy skills at low-technology, information-rich learning environments. As creativity, problem solving and collaboration are among the targeted skills in twenty-first century, this model promotes the acquisition of these skills towards a holistic development of students in primary and secondary school settings. In this direction, teaching students to think like a computer scientist, an economist, a physicist or an artist can be achieved through CT practices, as well as media arts practices. The interface between these practices is imagination, a fundamental concept in the model. Imaginative teaching methods, computer science unplugged approach and low-technology prototyping method are used to develop creativity, CT, collaboration and new media literacy skills in students …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:KbBQZpvPDL4C",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Exploring students’ engagement within a collaborative inquiry-based language learning activity in a blended environment",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-15-0618-5_21",
            "Abstract": "Recent studies have shown that both inquiry-based and blended learning are beneficial pedagogies when implemented in language learning environments. Also, collaboration can provide opportunities and many advantages to language learners. Some of the latest studies have presented examples combining two or even all three of these approaches in many different disciplines with mostly positive results toward students’ learning outcome. However, there is little research work exploring the combination of these approaches in the field of language learning and the correlation that may exist with students’ engagement. To address this research gap, this work presents an experimental study where participants were divided in experimental and control groups. A quantitative analysis method was employed to collect and analyze data concerning students’ perceptions as to whether a collaborative, inquiry …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:r_AWSJRzSzQC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "An ontology about emotion awareness and affective feedback in elearning",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7312065/",
            "Abstract": "In this paper, we propose designing a specific ontology for representing relevant aspects of affective phenomena in e-learning. The ontology is aimed to include the different types of emotions, moods and behaviors that students experience in the e-learning environments, the different types of feedback that teachers can provide to their students and the different effects in students' behavior during the e-learning process. Once the ontology is formalized, it will be used to design a virtual Affective Pedagogical Tutor (APT) based on an Event-Condition-Action rule system to provide affective feedback, aiming to provide a positive change in students' behavior and performance. The ultimate goal is to provide means for effective emotion management in a collaborative learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Collaborative and Distributed E-Research: Innovations in Technologies",
            "Publication year": 2012,
            "Publication url": "https://researchoutput.csu.edu.au/ws/portalfiles/portal/20424401/9954911_FntMat_chpt.pdf",
            "Abstract": "Why and how do researchers collaborate, share knowledge resources, data and expertise? What kinds of infrastructures and services do they use and what do they need for the future enhancement of collaborative research practices? The chapter focuses on existing and potential eResearch from a ‘user’perspective. Drawing on a study of ICT-enhanced research practices and needs conducted at seven Australian universities, it discusses how researchers engage with distributed research and use ICT for collaboration. Findings show significant current engagement of the majority of researchers in collaborative research, their acknowledgement of the potential of eResearch, and researchers’ general willingness to engage in collaborative eResearch. While there are some essential differences in the collaboration practices of research students and academics and between practices and challenges in different disciplinary domains, researchers who are more involved in collaborative research also adopt eResearch more extensively; more often use ICT-enhanced collaboration tools; share more of their data; and more often disseminate their findings via digital media.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Conceptual Model for Grid Learning Services Automatic Composition",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=6703003528163710872&hl=en&oi=scholarr",
            "Abstract": "The reports of the repository are subject to a Creative Commons Attribution-Noncommercial-NoDerivativeWorks 3.0 license. They may be copied, distributed and broadcast provided that the authors, the institution promoting them (Internet Interdisciplinary Institute-Open University of Catalonia). Commercial use and derivative works are not permitted. The full licence can be consulted on http://creativecommons. org/licenses/by-nc-nd/3.0/es/deed. en",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using a grid platform for enabling real time user modeling in on-line campus",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4159713/",
            "Abstract": "User modelling in on-line distance learning is an important research field focusing on two important aspects: describing and predicting students' actions and intentions as well as adapting the learning process to students' features, habits, preferences, and so on. The aim is to greatly stimulate and improve the learning experience. Indeed, on the one hand, students' intentions may change during the realization of learning activities and thus their actions evolve accordingly as the learning process moves forward. On the other hand, adaptive systems can effectively plan and design appropriate learning tasks according to students' features, habits and interests with the aim of facilitating the achievement of the learning goal. In this context, user modelling implies a continuous processing and analysis of user interaction data during long-term learning activities, which produces large and considerably complex information. As …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "E-assessment of individual and group learning processes",
            "Publication year": 2012,
            "Publication url": "https://www.ingentaconnect.com/contentone/asp/jctn/2012/00000009/00000002/art00014",
            "Abstract": "Evaluating on-line collaborative learning interactions is a complex task due to the variety of elements and factors that take place and intervene in the way a group of students comes together to collaborate in order to achieve a learning goal. The aim of this paper is to provide a better understanding of group interaction and determine how to best support the collaborative learning process. We propose a generic framework for the study and analysis of group interaction and group scaffolding, which is built by combining different aspects and issues of collaboration, learning and evaluation. In particular, we define learning activity indicators at several levels of description, which prompt to the application of a mixed interaction analysis scheme and the use of different data types and specific tools. At an initial layer, the basis of the approach is set by applying a qualitative process for evaluating the individual and group task …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:WA5NYHcadZ8C",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "A Grid Approach to Efficiently Embed Information and Knowledge into Collaborative Learning Applications",
            "Publication year": 2008,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/handle/10609/1350",
            "Abstract": "Constantly embedding information and knowledge about group activity  into on-line collaborative learning is a challenging yet one of the latest and most  attractive issues to influence learning experience in a positive manner. The  possibility to enhance learning groupâ¿¿s participation by means of providing  appropriate knowledge is rapidly gaining popularity due to its great impact on  group performance and outcomes. Indeed, by storing parameters of interaction  such as participation behaviour and giving constant awareness and feedback of  these parameters to the group may influence groupâ¿¿s motivation and emotional  state as well as  enhance the learnersâ¿¿ and groupsâ¿¿ problem solving abilities. This  implies a need to capture and structure the information generated by group activity  and then to extract the relevant knowledge in order to provide learners and tutors  with efficient awareness and feedback as regards group performance and  collaboration. To that end, we first identify and define the main types of  information generated in on-line group activity and then we propose a process for  efficiently embedding this information and the knowledge extracted into  collaborative learning applications. However, in order to provide learners with  effective knowledge, it is necessary to process large and complex event log files  from group activity in a constant manner, and thus it may require computational  capacity beyond that of a single computer. To that end, in this chapter we show  how a Grid approach can considerably decrease the time of processing group  activity log files and thus allow group learners to receive selected knowledge …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:5nxA0vEk-isC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Providing Efficient Event Information Management to CSCL Applications",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Thanasis-Daradoumis/publication/281327635_Providing_Efficient_Event_Information_Management_to_CSCL_Applications/links/561cc02c08ae78721fa23c7f/Providing-Efficient-Event-Information-Management-to-CSCL-Applications.pdf",
            "Abstract": "This work aims to explore the importance of carrying out an efficient management of the event information generated from CSCL applications during the collaborative learning process. The achievement of this task first involves the design of a conceptual model of collaborative learning interaction that captures and distinguishes several highlevel collaborative learning processes, which in turns leads to a computational model. To achieve that, we first define the main types of event information generated in group activity and then we propose the creation of a process to embed this information into CSCL applications in an efficient manner. Our ultimate goal has been to design a CSCL generic platform that we call a Collaborative Learning Purpose Library (CLPL), as a basis for the development of such CSCL applications. The CLPL library is currently under implementation and evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A review on massive e-learning (MOOC) design, delivery and assessment",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6681230/",
            "Abstract": "MOOCs or Massive Online Open Courses based on Open Educational Resources (OER) might be one of the most versatile ways to offer access to quality education, especially for those residing in far or disadvantaged areas. This article analyzes the state of the art on MOOCs, exploring open research questions and setting interesting topics and goals for further research. Finally, it proposes a framework that includes the use of software agents with the aim to improve and personalize management, delivery, efficiency and evaluation of massive online courses on an individual level basis.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring Learning through Audience Interaction in Virtual Reality Dome Theaters",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16318-0_55",
            "Abstract": "Informal learning in public spaces like museums, science centers and planetariums is increasingly popular during the last years. Recent advancements in large-scale displays allowed contemporary technology-enhanced museums to get equipped with digital domes, some with real-time capabilities like Virtual Reality systems. By conducting extensive literature review we have come to the conclusion that little to no research has been carried out on the leaning outcomes that the combination of VR and audience interaction can provide in the immersive environments of dome theaters. Thus, we propose that audience collaboration in immersive virtual reality environments presents a promising approach to support effective learning in groups of school aged children.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards an emotion labeling model to detect emotions in educational discourse",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6915499/",
            "Abstract": "In a collaborative e-learning environment, students are usually involved in learning activities such as collaborative writing (e.g., an essay in Wiki form) and debates in the form of a chat or asynchronous forum. Capturing students' feelings and emotional states enclosed in such textual information is important, since sentiments can influence individual behavior and consequently group dynamics as well as individual and group performance. For this reason, emotion awareness becomes an important issue for both tutors and students themselves. Especially for tutors, if they have as accurate affective information as possible about the emotional state that every individual and group is encountered, they might be able to provide more effective feedback to the students that includes not only cognitive but also affective scaffold. A first important step to this endeavor is to develop an approach that enables labeling affective …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Horizontal Cooperation Practices in Internet-based Higher Education, Computational Logistics and Telecommunications",
            "Publication year": 2019,
            "Publication url": "https://ruomo.lib.uom.gr/handle/7000/787",
            "Abstract": "Globalization and advances in information and communication technologies have boosted the use of Horizontal Cooperation (HC) practices in many industry sectors. In the current international market, these ‘alliances’ become especially relevant for small and medium organizations, which are forced to compete with large-scale corporations. This paper analyzes benefits and challenges of HC practices in three service sectors that are critical for most developed and emerging countries: Internet-based higher education, computational logistics and transportation and telecommunication services. The paper discusses the role of HC to benefit from economies of scale and reduce costs, improve quality of service and become more environmentally friendly. Hence, by using HC firms not only increase their competitiveness and extend their markets but, in addition, they also promote social responsiveness actions.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:5MTHONV0fEkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Methodology to Evaluate Complex Learning Resources to Improve e-Assessment from Collaborative and Networking Settings",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7185181/",
            "Abstract": "Cognitive assessment in collaborative and social learning requires a broad perspective about learning and the involved processes. Assessment processes have a significant effect on collaborative learning because they engage learners through accountability and constructive feedback. However, in order to design a coherent and efficient assessment system for collaborative and social learning it is necessary to design an enriched learning experience that predisposes the feedback and awareness in the group. This paper focuses on e-assessment of collaborative learning and extends it with Social Network Analysis (SNA) techniques that are able to analyze and represent social network interaction during the live sessions of collaboration by using collaborative complex learning resources (CC-LR). The knowledge extracted from analyzing the large amounts of interaction data related to social and collaborative …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Employing collaborative learning strategies and tools for engaging university students in collaborative study and writing",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/employing-collaborative-learning-strategies-tools/46913",
            "Abstract": "This chapter addresses several issues and challenges that one faces when carrying out a real collaborative learning experience following a blended learning design that includes a mixture of face-to-face and online collaborative learning processes. The chapter presents an experience based on a blended course on “Collaborative Educational Systems”. This scenario employed a variety of collaborative strategies, methods and tools to support and enhance debate and information exchange among peers in order to complete a specific task: writing an essay collaboratively. Carrying out this task entails a preliminary study and analysis of the subject matter, which are also performed in a collaborative manner. The authors describe the educational scenario in detail, including the structure of the activities, the rules the groups were asked to apply and the procedures the students had to follow to accomplish the task. They …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:qUcmZB5y_30C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Exploring interaction behaviour and performance of online collaborative learning teams",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39850-9_11",
            "Abstract": "Studying and analysing the collaborative behaviour of online learning teams and how this behaviour is related and affects task performance is a complex process. This paper presents an integrated approach that analyzes the participatory attitudes of group members in collaborative learning activities (group functioning) in relation to the individual and group learning outcomes (task performance). To that end, we first provide principled criteria and methods for evaluating collaborative problem-solving situations and then we identify different group types in terms of their degree of success at group functioning and task levels. Our objective is two-fold: assessing the effectiveness and adequacy of the evaluation criteria and methods, and exploring the interaction behaviour of different collaborative group types with respect to their performance.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extension and evaluation of JXTA protocols for supporting reliable P2P distributed computing",
            "Publication year": 2008,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17440080810865657/full/html",
            "Abstract": "In any distributed application, the communication between the distributed processes/nodes of the distributed systems is essential for both reliability and efficiency matters. The purpose of this paper is to address this issue for distributed applications based on JXTA protocols aiming at extending and evaluating the protocols of the JXTA library for reliable P2P computing.After a careful examination of the current version of JXTA protocols, the need was observed for improving the original JXTA protocols such as pipe services to ensure reliable communication between nodes of the grid platform and the discovery and presence service to increase the performance of the applications. Using a mixed P2P network based on broker peers and client peers architecture, which served as a basis to extend the JXTA protocols, was the basis of the approach.The original JXTA …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "A layered framework for evaluating on-Line collaborative learning interactions",
            "Publication year": 2012,
            "Publication url": "http://tutorial.softcomputing.net/jctn2012_snasel.pdf",
            "Abstract": "Evaluating on-line collaborative learning interactions is a complex task due to the variety of elements and factors that take place and intervene in the way a group of students comes together to collaborate in order to achieve a learning goal. The aim of this paper is to provide a better understanding of group interaction and determine how to best support the collaborative learning process. We propose a generic framework for the study and analysis of group interaction and group scaffolding, which is built by combining different aspects and issues of collaboration, learning and evaluation. In particular, we define learning activity indicators at several levels of description, which prompt to the application of a mixed interaction analysis scheme and the use of different data types and specific tools. At an initial layer, the basis of the approach is set by applying a qualitative process for evaluating the individual and group task performance as well as the group functioning and scaffolding. The interaction analysis process is completed by defining and applying two more layers: a social network analysis of the group activity and participation behavior and a quantitative analysis of group effectiveness as regards task achievement and active interaction involvement. Our work defines a grounded and holistic conceptual model that describes on-line collaborative learning interactions sufficiently and applies it in a real, web-based, complex and long-term collaborative learning situation. An in-depth empirical evaluation of the conceptual model is fully discussed, which demonstrates the usefulness and value of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special issue articles",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/30781324/ets_13_3_contents.pdf",
            "Abstract": "ISSN 1436-4522.© International Forum of Educational Technology & Society (IFETS). The authors and the forum jointly retain the copyright of the articles.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CRM and higher education: developing a monitoring system to improve relationships in e-learning environments",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11151323740176987577&hl=en&oi=scholarr",
            "Abstract": "CRM has usually been associated to business contexts. However, it has recently been pointed out that its principles and applications are also very appropriate for non-profit making organizations. In this paper, we defend the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organizations seems natural. In particular, we focus on analyzing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to e-learning. This is an issue that has much potential but has received little attention in research so far. Our work reflects upon this matter and provides a new step towards a CRM solution for managing relationships of specific customers, such as students. Indeed, the main contribution of this paper is specifically characterized by the proposal and empirical application of an …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent Collaborative e-Learning Systems and Applications",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-04001-6.pdf",
            "Abstract": "One of the main research focuses in Computer Supported Collaborative Learning (CSCL) investigates on the improvement of on-line collaborative learning processes through the development of collaborative e-learning systems and applications which are empowered with intelligent methods and techniques. As a result, collaborative learning systems and applications are to be more powerful and flexible and also more adaptable to the learning process and thus provide better answers to the paradigmatic principles of on-line collaborative learning. In addition, virtual learning environments should be able to deeply influence the learning process by providing precise and exhaustive information and complex knowledge to all actors of the collaboration about the real dynamics of the group activity. By means of the obtained knowledge, tutors can offer an adequate support at the appropriate time and situation and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Implementing imagination-based pedagogies in a web-based Computer Supported Collaborative Language Learning writing activity: Orchestration issues",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633604/",
            "Abstract": "Computer-Supported Collaborative Language Learning (CSCLL) has been proved to offer many advantages to language learners. However, teachers argue that the use of complicated pedagogies such as imagination-based techniques in combination with innovative technologies lead to a “complex ecosystem” in which many issues of management appear. This paper examines how students' motivation and engagement are influenced when implementing imagination-based pedagogies in a web-based Computer-Supported Collaborative Language Learning writing activity with shared orchestration load.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:foquWX3nUaYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating collaborative learning practices in a virtual groupware environment",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/40375311/Evaluating_Collaborative_Learning_Practi20151125-658-yrwog0.pdf",
            "Abstract": "This paper presents an approach to analysing and evaluating collaborative learning situations that take place in an asynchronous collaboration platform. Our approach takes into account three basic aspects of collaborative learning: interaction, problem-solving construction, and social support among group members. At this stage, our analysis focuses on the first two, giving special emphasis on the evaluation of the problem-solving performance (and learning achievement) of a learning group as well as of the group functioning. As a result, the current purpose of the analysis is multiple. First, it determines principled evaluation criteria for assessing a number of different, long-term, complex, online collaborative problem-solving situations. Second, it supplies the necessary means that support and facilitate the tutor’s assessment of students’ individual and group performance in a more effective and objective manner. Finally, it contributes towards a principled categorisation of learning groups into specific types according to the degree of success both of their collaborative behaviour and their learning outcomes.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the construction of a multi-agent approach for discovering the meaning of natural language collaborative conversations",
            "Publication year": 2008,
            "Publication url": "https://portalrecerca.csuc.cat/47162746?mode=full&locale=ca",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:Ak0FvsSvgGUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring learners' emotions over time in virtual learning",
            "Publication year": 2013,
            "Publication url": "https://www.raco.cat/index.php/eLearn/article/view/272010",
            "Abstract": "Time constitutes an important factor influencing every process related to e-learning. Along these lines, we need to study how students manage time in their learning processes. We need to know if they feel that they have enough time to carry out a learning activity or whether they feel stressed and frustrated by the lack of time. We are also interested in what kind of emotions they express and how these emotions evolve over this period of time.Our work focuses on studying the nature and role time plays in the affective states learners experience during a long-term e-learning process. Our methodological design shows the type of data we need to collect, which methods are more suitable for analysing this data in order to detect and interpret the learners’ emotions across time.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transformación pedagógica y uso de tabletas digitales: reflexión sobre el proceso en el aula de secundaria",
            "Publication year": 2019,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=7941016",
            "Abstract": "Transformación pedagógica y uso de tabletas digitales: reflexión sobre el proceso en el \naula de secundaria - Dialnet Ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda \nBuscar Consultar la ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar \nConsultar la ayuda Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda \nTransformación pedagógica y uso de tabletas digitales: reflexión sobre el proceso en el \naula de secundaria Autores: Stephanie Garcia Senin, Marta Arguedas, Thanasis \nDaradoumis Localización: VI Jornadas Iberoamericanas de Innovación Educativa en \námbito de las TIC y de las TAC: Las Palmas de Grana Canaria, 14 y 15 de noviembre de \n2019 / coord. por Antonio Gabriel Ravelo García, Carlos Manuel Travieso González, Jesús \nBernardino Alonso Hernández, José Miguel Canino Rodríguez, Santiago Tomás Pérez \nSuárez; David de la Cruz Sánchez Rodríguez ( ed. lit. ), …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:LgRImbQfgY4C",
            "Publisher": "Universidad de Las Palmas de Gran Canaria"
        },
        {
            "Title": "Efficient peer selection in p2p jxta-based platforms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4482817/",
            "Abstract": "P2P systems are nowadays being used not only for file sharing but also for developing large-scale distributed applications. As an emerging paradigm for distributed computing, P2P systems are raising important issues as many novel aspects have to be dealt with in such systems. One key issue in P2P distributed computing is the efficient discovery and selection of peers, which is needed for many purposes such as efficient allocation of jobs to peers, load balancing, efficient file transfer, etc. Existing P2P distributed applications use ad hoc ways to discover and select peers, usually without any performance guarantee. In this paper we address the problem of the efficient peer selection in P2P distributed platforms. To this end, we have developed a P2P distributed platform using Sun's JXTA technology, which is endowed with resource brokerage strategies to efficiently select peers using four selection models: (a …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Posters of the 2007 GADA (Grid Computing, High Performance and Distributed Applications) International Conference-A Conceptual Model for Grid Learning Services Automatic Composition",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5878132273264245488&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Teaching cultural heritage through a narrative-based game",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3414833",
            "Abstract": "Games are used in various learning situations and domains, among which is cultural heritage. Storytelling is used in games regarding cultural places, but it often takes a simple form. Thus, the authors’ aim is to investigate the possibility to communicate cultural content through a narrative-based game that can function with multiple narratives. Another core element of our design is the less exploited in serious games combination of endogenous cooperation and competition. The social dimension of our design was expressed through features of Classroom Multiplayer Presential Games (CMPGs), in respect of using a one-to-many game environment projected on a single screen, while enhancing collaborative work in small teams. After providing an overview of the game, we briefly explain how this was implemented with the use of Twine, a free authoring tool for the creation of interactive stories and text-based games …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:gVv57TyPmFsC",
            "Publisher": "ACM"
        },
        {
            "Title": "SAMOS: a model for monitoring students' and groups' activities in collaborative e-learning",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=2880084443468884873&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New Methodologies and Tools for the Virtualization of Knowledge-based Collaborative Learning",
            "Publication year": 2012,
            "Publication url": "https://www.learntechlib.org/p/40990/",
            "Abstract": "Despite a great potential, on-line collaborative learning do not yet have the impact that many believe is possible. In particular, collaborative learning approaches cannot be applied in every e-learning experience because they require people’s presence and/or collaboration is difficult to achieve. In addition, collaborative learning systems often lack of challenging resources to support the collaboration, making the collaborative experience unattractive, which discourages progression. As a result, collaborative learning resources lack of authentic interactivity, social identity, user empowerment and challenge, thus having a negative effect in learner motivation and engagement. To overcome these deficiencies, we propose to leverage the knowledge elicited during live collaborative sessions in order to produce interactive and attractive resources to be played by learners. Learners will observe how avatars discuss and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Metaphor based educational software for beginners’ learning of operating systems",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/38493679/C34_2008_CELDA_2008.pdf",
            "Abstract": "This paper presents the design of educational software for beginners’ learning of basic concepts of Operating Systems (OS). The design of the proposed educational software is based on modern social and constructivist learning theories as well as on the essential role of metaphors and of computer tools in student learning. In particular, the architecture of the proposed software consists of two main parts: a) the information space where students are provided with opportunities to access appropriate information about OS and to study scheduling, using a simple and fundamental algorithm; the Priority Round-Robin (PRR) algorithm, and b) the experimentation space where learners can take control of their learning by forming their own set of tasks, assigning them priorities and durations and also scheduling them using the PRR algorithm. Finally, the proposed system has been designed so that to provide pupils with feedback so that they may make self corrections.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SAMOS: a model for monitoring students' and groups' activities in collaborative e-learning",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2009.024716",
            "Abstract": "We address the issue of monitoring students' and groups' activities in online collaborative learning environments. Such monitoring can provide valuable information to online instructors, who may guide and support the development of efficient collaborative learning projects. We have developed and tested an information system, Student Activity Monitoring using Overview Spreadsheets (SAMOS), which facilitates the automatic generation of weekly monitoring reports derived from data contained in server log files. These reports provide online instructors with visual information regarding students' and groups' activity, thus allowing for a quick and easy classification of students and groups according to their activity level. That way, entities with a low activity level are easily identified, which allows the establishment of just-in-time assistance for them. Furthermore, instructors can use complementary qualitative monitoring …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:mB3voiENLucC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Improving e-assessment in collaborative and social learning settings",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7312086/",
            "Abstract": "Cognitive assessment in collaborative and social learning requires assessment processes that achieve significant effect on collaborative learning and engage learners through accountability and constructive feedback. In order to design a coherent and efficient assessment system for collaborative and social learning it is necessary to design an enriched learning experience that predisposes the feedback and awareness in the group. This research focuses on e-assessment of collaborative learning and extends it with Social Network Analysis (SNA) techniques that are able to analyze and represent social network interaction during the live collaborative sessions. The interaction data extracted from social and collaborative networking must be integrated into a general assessment system to produce an efficient and personalized awareness and feedback about the collaborative activity and the social behavior of the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Dual-Modal System that Evaluates User's Emotions in Virtual Learning Environments and Responds Affectively.",
            "Publication year": 2013,
            "Publication url": "http://www.jucs.org/jucs_19_11/a_dual_modal_system/jucs_19_11_1638_1660_feidakis.pdf",
            "Abstract": "Endowing learning systems with emotion awareness features (capture user’s affective state and provide affective feedback), seems quite promising. This paper describes a system implementation that provides emotion awareness, both explicitly, by self-reporting of emotions through a usable web tool, and implicitly, via sentiment analysis. Prominent theories, models and techniques of emotion, emotion learning, emotion detection and affective feedback are reviewed. We also present findings from our experiment with university students, validating the explicit mechanism in real education settings. Finally, we set open issues for future experimentation, contributing to the research agenda.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterizing social network e-assessment in collaborative complex learning resources",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6915525/",
            "Abstract": "In previous research we proposed a new type of learning resource named Collaborative Complex Learning Resource (CC-LR) in support for teaching and learning by the virtualization of live collaborative sessions, with the aim to leverage the knowledge elicited during the collaboration and produce interactive and attractive resources to be played by engineering learners. We claimed this type of pedagogically and technologically augmented learning resources is able to overcome endemic problems found in collaborative learning of on-line courses, such as lack of authentic interactivity, user empowerment, social identity and challenge, thus having a positive effect in learner engagement. In order to enhance further learning engagement we endowed CC-LR with a multifold cognitive e-assessment approach that provided effective awareness and constructive feedback to learners from the live collaborative interaction …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "El proceso de trabajo y de aprendizaje en equipo en un entorno virtual a partir del análisis de experiencias de la UOC",
            "Publication year": 2003,
            "Publication url": "http://in3-working-paper-series.uoc.edu/in3/es/index.php/in3-working-paper-series/article/view/n3-guitert-et-al.html",
            "Abstract": "El informe presenta el proceso de investigación que ha seguido el grupo TACEV a lo largo del año 2000-2001 en torno a su área temática, el aprendizaje y el trabajo en equipo en el entorno virtual, a partir de dos objetivos centrales: por un lado, conocer cómo se organiza el proceso de aprendizaje y trabajo cooperativo en un entorno virtual y, por otro, valorar qué herramientas presentan funcionalidades adecuadas que puedan dar respuesta a la propuesta metodológica de aprendizaje y trabajo cooperativo que planteamos.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a generic platform for developing CSCL applications using grid infrastructure",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1336567/",
            "Abstract": "The goal of this paper is to explore the possibility of using CSCL component-based software under a Grid infrastructure. The merge of these technologies represents an attractive, but probably quite laborious enterprise if we consider not only the benefits but also the barriers that we have to overcome. This work presents an attempt toward this direction by developing a generic platform of CSCL components and discussing the advantages that we could obtain if we adapted it to the Grid. We then propose a means that could make this adjustment possible due to the high degree of genericity that our library component is endowed with by being based on the generic programming paradigm. Finally, an application of our library is proposed both for validating the adequacy of the platform which it is based on and for indicating the possibilities gained by using it under the Grid.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:bnK-pcrLprsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing knowledge management in online collaborative learning",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218194010004839",
            "Abstract": "This paper aims to explore two crucial aspects of collaborative work and learning: on the one hand, the importance of enabling collaborative learning applications to capture and structure the information generated by group activity and, on the other hand, to extract the relevant knowledge in order to provide learners and tutors with efficient awareness, feedback and support with regards to group performance and collaboration. To this end, in this paper we first propose a conceptual model for data analysis and management that identifies and classifies the many kinds of indicators that describe collaboration and learning into high-level aspects of collaboration. Then, we provide a computational platform that, at a first step, collects and classifies both the event information generated asynchronously from the users' actions and the labeled dialogues from the synchronous collaboration according to these indicators. This …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:4TOpqqG69KYC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Broadening the CRM domain of application to higher educational (e-learning) environments",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=2519857761227097934&hl=en&oi=scholarr",
            "Abstract": "In this paper, we reflect about the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organizations seems natural. In particular, we focus on analyzing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to e-learning. This is an issue that, in our opinion, has much potential but has received little attention in research so far.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-Assessment of Individual and Group Learning Processes",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=10030096438002935802&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic description of grid based learning services",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11942634_52",
            "Abstract": "Grid technology has emerged as a powerful tool to increase the capabilities of e-learning frameworks. Learning services are fundamental components representing functionalities that can be easily reused without knowing the details of how services have been implemented. On the one hand, a problem that still remains unsolved is how to use and integrate low-level learning services to compose more complex high-level services or tools that make sense to both tutors and learners. On the other hand, the approaches that are currently used to implement an e-learning framework developed with learning services based on the Grid are limited in semantic expressiveness for matching services and only support keyword based search. Due to the complexity of these two related problems, the paper focuses on the second one by proposing an initial model for Semantic Description of Grid based Learning Services …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Providing effective feedback, monitoring and evaluation to on-line collaborative learning discussions",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563210002281",
            "Abstract": "Learning and knowledge building have become critical competences for people in the knowledge society era. In this paper, we propose a sociolinguistic dialogue model for understanding how learning evolves and how cognitive process is constructed in on-line discussions. The knowledge extracted from this model is used to assess participation behavior, knowledge building and performance. The ultimate purpose is to provide effective feedback, evaluation and monitoring to the discussion process. Seven hundred students from the Open University of Catalonia in Spain participated in this study. Results showed that learning and knowledge building may be greatly enhanced by presenting selected knowledge to learners as for their particular skills exhibited during interaction. In addition, this valuable provision of information is used as a meta cognitive tool for tutors and moderators for monitoring and evaluating the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:Se3iqnhoufwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Expanding the customer relationship management scope to the non-profit organizations: an analysis focused on the e-university domain",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/41458243/Expanding_the_customer_relationship_mana20160122-311-1xkr7k4.pdf",
            "Abstract": "In this paper, we reflect about the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organizations seems natural. In particular, we focus on analyzing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to elearning. This is an issue that, in our opinion, has much potential but has received little attention in research so far.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:_axFR9aDTf0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Providing cognitive and social networking assessment to virtualized collaborative learning in engineering courses",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7057133/",
            "Abstract": "In previous research we proposed a new type of learning resource named Collaborative Complex Learning Resource (CC-LR) in support for teaching and learning engineering education by the virtualization of live collaborative sessions, with the aim to leverage the knowledge elicited during the collaboration and produce interactive and attractive resources to be played by engineering learners. We claimed this type of pedagogically and technologically augmented learning resources is able to overcome endemic problems found in collaborative learning of on-line engineering courses, such as lack of authentic interactivity, user empowerment, social identity and challenge, thus having a positive effect in learner engagement. In order to enhance further learning engagement we endowed CC-LR with a multifold cognitive assessment approach that provided effective awareness and constructive feedback to learners …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Generic Platform for the Systematic Construction of Knowledge-based Collaborative Learning Applications",
            "Publication year": 2007,
            "Publication url": "https://www.recercat.cat/handle/2072/229611",
            "Abstract": "This study aims to explore the importance of efficient management of event information generated from group activity in collaborative learning practices for its further use in extracting and providing knowledge on interaction behavior. The essential issue here is how to design a platform that can be used for real, long-term, complex collaborative problem-solving situations and which enables the instructor to both analyze group interaction effectively and provide an adequate support when needed. The achievement of this task first involves the design of a conceptual model that structures and classifies the information generated in a collaborative learning application at several levels of description. This conceptual model is then translated into a computational model that not only allows the efficient management of the knowledge produced by the individual and group activity but also the possibility of exploiting this knowledge further as a meta-cognitive tool for real-time coaching and regulating the collaborative learning process. The computational model becomes the central issue in this contribution while the conceptual model is briefly introduced.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing an information system for monitoring student's activity in online collaborative learning",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606692/",
            "Abstract": "In this paper we address the issue of monitoring studentspsila and groupspsila activity in online collaborative learning environments. This issue is especially important in the collaborative e-learning context, since an efficient monitoring process can provide valuable information to online instructors who may guide and support the development of collaborative learning projects. We have developed and tested an information system model which facilitates the automatic generation of weekly monitoring reports derived from data contained in server log files. These reports provide online instructors with visual information regarding studentspsila and groupspsila activity, thus allowing for a quick and easy classification of students and groups according to their activity level. Therefore, entities with a low activity level are identified as soon as possible and just-in-time assistance can be established for them. Furthermore …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Issue Articles",
            "Publication year": 2015,
            "Publication url": "https://www.ds.unipi.gr/et&s/journals/18_1/ets_18_1_contents.pdf",
            "Abstract": "Educational Technology & Society Page 1 iii ISSN 1436-4522 (online) and 1176-3647 (print). \nThe articles in this issue of the Journal of Educational Technology & Society are available \nunder Creative Commons CC-BY-NDNC 3.0 license (https://creativecommons.org/licenses/by-nc-nd/3.0/). \nFor further queries, please contact Journal Editors at ets-editors@ifets.info. Journal of \nEducational Technology & Society Volume 18 Number 1 2015 Table of contents Special Issue \nArticles Guest Editorial: Overcoming the Technological Hurdles Facing Virtual Worlds in \nEducation: The Road to Widespread Deployment Leonel Morgado, Baltasar Fernández \nManjón and Christian Gütl 1–2 Barriers and Enablers to the Use of Virtual Worlds in Higher \nEducation: An Exploration of Educator Perceptions, Attitudes and Experiences Sue Gregory, \nSheila Scutter, Lisa Jacka, Marcus McDonald, Helen Farley and Chris Newman 3–12 Coming -…",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using a Notification, Recommendation and Monitoring System to Improve Interaction in an Automated Assessment Tool: An Analysis of Students’ Perceptions",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10447318.2021.1938400",
            "Abstract": "Online courses heavily relying on programming skills tend to be difficult and time-consuming for students, who may get frustrated when stuck in an assignment. Obviously, this may increase drop-out rate and decrease academic performance as well as students’ satisfaction with the course and the institution in general. In this context, we propose a notification, recommendation and monitoring system which is integrated into an automatic assessment tool with the aim to enhance the learning process in virtual classrooms. In particular, notifications, recommendations and visualization reports are used to show the activity, progress and performance of all students. The system is implemented in a distributed computing course in an online university. A quantitative analysis method used to collect and analyze data of students’ perceptions regarding the system showed that: (1) notifications helped students organize their time …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:F1b5ZUV5XREC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Analyzing how emotion awareness influences students' motivation, engagement, self-regulation and learning outcome",
            "Publication year": 2016,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.19.2.87.pdf",
            "Abstract": "Considering social and emotional competence in learning, emotion awareness aims to detect the emotions that students show during their learning interactions and make these emotions explicit to them. Being aware of their emotions, students become more conscious of their situation, what may prompt them to behavioral change. The main goal of this work is to analyze the effects of emotion awareness, supported by specific teaching strategies, on students’ motivation, engagement, self-regulation and learning outcome in long-term blended collaborative learning practices. A bilateral goal also involves an initial study that explores the way emotion awareness affects teacher’s attitude and feedback as well as the competencies that teachers need to have in order to achieve a positive change on students’ affective and cognitive state. To this end a quasi-experimental study was designed with high school students. The …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A study of using SmartBox to embed emotion awareness through stimulation into e-learning environments",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7057134/",
            "Abstract": "Emotions strongly influence human's behavior in individual and social situations and must be seriously considered in any human activity, such as e-Learning. Indeed, the embedding of emotional awareness features into virtual learning environments could offer a more authentic and challenging e-Learning experience, either individual or collaborative. However, the lack of empirical results together with the complexity attributed to the management by computers of human emotions and affective data, seriously limits the advances in e-Learning as it impedes to virtualize many real-world learning situations in which emotions play a significant role. In this paper, we investigate the use of the SmartBox device for emotion measurement of distance learners during their study as well as the development of affective strategies based on the SmartBox's stimulation capabilities. The aim is to collect emotion data from different …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Is an “effective” online group really effective?",
            "Publication year": 2003,
            "Publication url": "https://upcommons.upc.edu/handle/2117/126415",
            "Abstract": "The aim of this paper is to explore the real value of effectiveness and success of online collaborative learning teams by studying and analysing their collaborative behaviour with respect to their problem solving performance. To that end, we focus on online learning groups that are engaged in a problem solving situation which ends up with successful group learning outcomes; the final product they deliver as a group is judged satisfactory. But can we safely admit that such a group was really effective? In other words, can we claim that each individual member achieved the learning objectives set or obtained the same benefit as the others? Or, did the group manage a well-balanced participation and contribution of all its members? This work presents an integrated approach that focuses on analysing the participatory attitudes of group members in collaborative learning activities (group functioning) and their contributions to the problem solving (task performance). This allows us to assess the real effectiveness of online collaborative learning teams by examining and measuring the skills that should characterise an effective collaborative learning team. In particular, we explore the interaction behaviour of different collaborative groups that apparently proved to be effective as regards their performance at problem solving level. The ultimate aim of our work is to provide both a better understanding of group interaction and the means to improve the effectiveness of online learning groups as well as to enhance individual member learning and success.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:kRWSkSYxWN8C",
            "Publisher": "asociacion española para la inteligencia artificial"
        },
        {
            "Title": "Efficient Interaction Analysis for an Effective Provision of Knowledge about the Discussion Process to CSCL Practices",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4557876/",
            "Abstract": "The discussion process plays an important social task in computer-supported collaborative learning (CSCL) where participants can discuss about the activity being performed, collaborate with each other through the exchange of ideas that may arise, propose new resolution mechanisms, as well as justify and refine their own contributions and thus acquire new knowledge. Indeed, learning by discussion when applied to collaborative learning scenarios can provide significant benefits for students in collaborative learning, and in education in general. However, the discussion process in the context of distance education presents high dropout in comparison to traditional programs due chiefly to a sense of isolation of participants who do not have knowledge about others nor they can compare their own progress and performance to the group. To alleviate this problem, the provision of appropriate knowledge from the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measuring the Impact of Emotion Awareness on e-learning Situations",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6603920/",
            "Abstract": "The adoption of emotion awareness features in learning environments, has been put on the focus of the research agenda towards students' engagement and their authentic social interaction. In the current paper we provide a solution towards the provision of e-learning with emotion awareness features, which is based on self-reporting of emotions and affective response from the system. We also present research findings derived from two experiments with undergraduate students: in the University of Aegean (UoA) and the Open University of Catalonia (UoC). Finally, we set open questions for future research.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A data analysis model based on control charts to monitor online learning processes",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBIDM.2009.026906",
            "Abstract": "This paper discusses the convenience of using data analysis techniques to monitor e-learning processes. It also proposes a model to monitor online students' academic activity and performance. Using data from log files and databases, this model determines which information has to be provided to online instructors and students. These reports allow instructors to: classify students according to their activity and learning outcomes, track their evolution, and identify those who might need immediate assistance. They also provide students with a periodical feedback which makes them aware of how they are performing as compared with the rest of the class.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Analyzing the educational design, use and effect of spatial games for cultural heritage: A literature review",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131517300076",
            "Abstract": "Integrating game-based approaches with learning constitutes a prevailing trend in education and training, applied in several domains, one of which is cultural heritage. The present paper attempts a literature review of such approaches developed in the cultural domain. It analyzes 34 games which intend to enable a physical or virtual interaction with a cultural place and its objects. The article focuses, first, on the game genres and game plots used to cope with cultural content and then it investigates the contexts of use in which games for culture are applied and the social relationships they create. Finally, given the need for a better understanding of games effectiveness for learning and training, we examine the reported outcomes of the reviewed games.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Constructing a multi-Agent system for discovering the meaning over natural-language collaborative conversations",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04001-6_7",
            "Abstract": "On the one hand, natural language is the main communication media for humans. It has a complex construction, based on the diversity of meaning for words and expressions according to the context. On the other hand, computers are not prepared to handle this ambiguity. Our work aims at presenting a multi-agent approach for dealing with the problem of discovering the meaning of expressions written in Spanish, based on a flexible recovery system and Bayesian principles. At a first stage, agents are supposed to identify the role of the words composing a sentence. At a second stage, a second set of agents is ready to coordinate among them in order to assemble a meaning. Our research forms part and contributes to the analysis of collaborative conversations among participants in a web-based collaborative learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A grid-based approach for processing group activity log files",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30470-8_35",
            "Abstract": "The information collected regarding group activity in a collaborative learning environment requires classifying, structuring and processing. The aim is to process this information in order to extract, reveal and provide students and tutors with valuable knowledge, awareness and feedback in order to successfully perform the collaborative learning activity. However, the large amount of information generated during online group activity may be time-consuming to process and, hence, can hinder the real-time delivery of the information. In this study we show how a Grid-based paradigm can be used to effectively process and present the information regarding group activity gathered in the log files under a collaborative environment. The computational power of the Grid makes it possible to process a huge amount of event information, compute statistical results and present them, when needed, to the members of the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Cultivating Students’ Reflective Learning in Metacognitive Activities through an Affective Pedagogical Agent",
            "Publication year": 2020,
            "Publication url": "https://www.jstor.org/stable/26921131",
            "Abstract": "There is an increasing interest in the ways pedagogical agents can provide cognitive, emotional, and metacognitive support to students. Moreover, several research studies have proposed various approaches for cultivating students’ reflective learning. A variety of research has also been conducted into interrelations between metacognition and affective processes. However, very few studies have examined the effect of emotional feedback provided by a virtual Affective Pedagogical Tutor (APT) on students’ self-reflection during a metacognitive learning activity. An experimental research design was used in a study aimed at measuring the extent to which an APT’s affective feedback managed to enhance students’ self-reflection about what and how they had learned. Participants were a sample of 45 fourth-year high school students, who were divided into experimental and control groups (APT vs. human tutor) in a real …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:ZzlSgRqYykMC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Expanding the customer relationship management scope to the non-profit organizations: an analysis focused on the e-university domain",
            "Publication year": 2008,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/handle/10609/1429",
            "Abstract": "In this paper, we reflect about the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organizations seems natural. In particular, we focus on analyzing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to e-learning. This is an issue that, in our opinion, has much potential but has received little attention in research so far.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CRM applied to higher education: Developing an e-monitoring system to improve relationships in e-learning environments",
            "Publication year": 2010,
            "Publication url": "https://scholar.archive.org/work/jw6dgrmunrhrtj52bvudtwjpvu/access/wayback/http://openaccess.uoc.edu/webapps/o2/bitstream/10609/1327/1/Daradoumis_CRM_IJSTM_dSpace_2010.pdf",
            "Abstract": "CRM has usually been associated to business contexts. However, it has recently been pointed out that its principles and applications are also very appropriate for non-profit making organizations. In this paper, we defend the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organizations seems natural. In particular, we focus on analyzing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to e-learning. This is an issue that, in our opinion, has much potential but has received little attention in research so far. Our work reflects upon this matter and provides a new step towards a CRM solution for managing relationships of specific customers, such as students. Indeed, the main contribution of this paper is specifically characterized by the proposal and empirical application of an emonitoring system that aims to enhance the performance of relationships in e-learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prototyping a Cognitive Assessment System to Enrich the Virtualization of Collaborative Learning",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6603917/",
            "Abstract": "Cognitive assessment in collaborative and social learning requires a broad perspective about learning and the involved processes. Assessment processes have a significant effect on collaborative learning because they engage learners through accountability and constructive feedback. However, in order to design a coherent and efficient assessment system for collaborative and social learning it is necessary to design an enriched learning experience that predisposes the feedback and awareness in the group. In this paper, collaborative learning is developed into a special environment: a Virtualized Collaborative Sessions. Two levels of assessment are incorporated, deferred and immediate time, in order to produce an efficient and personalized assessment feedback to ultimately enhance and improve the collaborative learning experience. The research reported in this paper was undertaken within the FP7 …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysing the role of a pedagogical agent in psychological and cognitive preparatory activities",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jcal.12556",
            "Abstract": "There is a lack of studies that examine the role of a pedagogical agent on student development in a specific learning situation that involves psychological and cognitive preparatory activities in high school settings. We examined the effectiveness of pedagogical agent (APT) cognitive and affective feedback on learner motivation and well‐being. We applied an experimental research design, involving 45 fourth‐year high school students, divided in experimental and control groups (APT vs. human tutor). We performed a quantitative analysis to collect and analyse data of students using our APT. APT cognitive feedback had a positive effect on students' motivation for learning by encouraging students' proposals and initiatives and arousing students' interest in the topic. In addition, APT affective feedback fostered an appropriate emotional climate and creative environment for learning by enhancing students' curiosity …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Using a real Internet-scale environment for protocol testing in undergraduate courses: students' behaviour and feedback",
            "Publication year": 2012,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.7227/IJEEE.49.1.6",
            "Abstract": "This paper presents a five-semester experience regarding the use of a real Internet-scale environment for testing protocols and services under realistic conditions. The paper discusses the convenience of using such real environments over other alternatives, i.e. emulated or simulated environments. Since most currently published work focuses primarily on technical specifications of academic testing environments, the paper also argues for the need to carry out studies which analyse students' opinions, performance, and behaviours while using these environments. Accordingly, an exhaustive survey analysis is included. This first analysis is complemented with a second one regarding the way students interact with the system. From both studies, several conclusions and recommendations are derived.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Emotion measurement in intelligent tutoring systems: what, when and how to measure",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6132913/",
            "Abstract": "Affective or Emotion oriented computing constitutes an emerging research field that is still in its early stages. The lack of empirical results together with the complexity that attributes emotions, subjects research to a diversity of theories, models and tools. In the current paper we present a critical review of the state of the art on emotion measurement models, methods and tools and we suggest some informal rules towards their realistic use in education settings.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Distributed cognition in the context of virtual collaborative learning",
            "Publication year": 2002,
            "Publication url": "https://www.learntechlib.org/p/10784/",
            "Abstract": "In this article, the authors address the distribution of cognition in small virtual group learning. In particular, they examine how the distribution of cognition is manifested in the context of student-student interaction and how it can be studied in a virtual learning environment. For this reason, they define a conceptual framework of collaborative learning situations for modelling and understanding how learning evolves and how knowledge is constructed among students that cooperate on a task. One important issue to consider is the types and levels of interaction and knowledge, which is manifested, in a collaborative learning situation. Their approach aims at identifying the various types of interaction produced and examining how an interaction type is related to the learning that results from it. This framework allows us to study how distribution of cognition is transformed and becomes common to all group members.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Analyzing the effects of emotion management on time and self-management in computer-based learning",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563216303958",
            "Abstract": "Emotional learning involves the acquisition of skills to recognize and manage emotions, develop care and concern for others, make responsible decisions, establish positive relationships, and handle challenging situations effectively. Time is an important variable in learning context and especially in the analysis of teaching-learning processes that take place in collaborative learning, whereas time management is crucial for effective learning. The aim of this work has been to analyze the effects of emotion management on time and self-management in e-learning and identify the competencies in time and self-management that are mostly influenced when students strive to achieve effective learning. To this end, we run an experiment with a class of high school students, which showed that increasing their ability to manage emotions better and more effectively enhances their competency to manage the time allocated to …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:4DMP91E08xMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Toward a semantic approach for automatic composition of Learning Grid Services",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606791/",
            "Abstract": "Due to their potential advantages, the use of Grid technologies toward the development of collaborative and personalized learning frameworks has been considerably increased. These learning frameworks can be constructed based on the distributed learning services and resources available in a learning Grid environment. A problem still unsolved is how to use and integrate low-level learning services to compose more complex high-level services or tools that can be useful to both tutors and learners. In that sense, on the one hand, semantic description of Grid learning services appears to be a powerful tool that can be used to discover suitable learning services depending on the systempsilas semantic capabilities. On the other hand, it can be employed to carry out a matching process among the learning services located in a learning framework to obtain the best fit according to specific functional parameters …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Current trends in CSCL orchestration--New perspectives for improving CSCL orchestration in a language learning environment",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901498/",
            "Abstract": "Recent research shows that Computer Supported Collaborative Learning (CSCL) can offer many advantages to Language Teaching and Learning such as motivate students to participate in an environment where they are asked to use their skills to communicate effectively. However, teachers have to face numerous problems and complicated issues of management when dealing with such a complex pedagogy and the technologies involved. One of the most promising solutions so far is this of \"orchestration\", a field where there has been a thriving research activity over the last years, yet with various open issues to be discussed and little research focused on Language Learning. This is a position paper which aims at presenting the recent developments on this field and discovering the open research questions that will lead to the proposal of a context-aware orchestration framework, which will improve the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gridifying IBM's generic log adapter to speed-up the processing of log data",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4159743/",
            "Abstract": "Problem determination in today's computing environments consumes between 30 and 70% of an organization's IT resources and represents from one third to one half of their total cost of ownership. The first step to cutting down costs and to enable autonomic computing systems is to have all parts of the system report status in a common log data format and semantics. The generic log adapter (GLA) is a generic parsing engine shipped with the IBM's Autonomic Computing Toolkit that has been conceived to convert proprietary log data into a standard log data event-based format in real time. However, in order to provide generic support for parsing the majority of today's unstructured log data formats the GLA makes heavy use of regular expressions that incur in performance limitations. Current approaches proposed to increase GLA's performance have revolved around fine-tuning the set of regular expressions used to …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Embedding emotion awareness into e-learning environments",
            "Publication year": 2014,
            "Publication url": "https://www.learntechlib.org/p/148187/",
            "Abstract": "In this work we investigate the importance of emotion awareness in e-learning environments, with emphasis to Computer Supported Collaborative Learning (CSCL) activities. Our presented solution involves a new conceptual model of emotions of interest in e-learning context. In the basis of this model, a computational model has been implemented employing self-report of emotions, affective feedback and effective emotion visualizations. Both models have been tested in real education settings, contributing to the research agenda.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "International Journal of Emerging Technology in Learning"
        },
        {
            "Title": "Using learning analytics for preserving academic integrity",
            "Publication year": 2017,
            "Publication url": "https://www.erudit.org/en/journals/irrodl/1900-v1-n1-irrodl04896/1064912ar/abstract/",
            "Abstract": "This paper presents the results of integrating learning analytics into the assessment process to enhance academic integrity in the e-learning environment. The goal of this research is to evaluate the computational-based approach to academic integrity. The machine-learning based framework learns students’ patterns of language use from data, providing an accessible and non-invasive validation of student identities and student-produced content. To assess the performance of the proposed approach, we conducted a series of experiments using written assignments of graduate students. The proposed method yielded a mean accuracy of 93%, exceeding the baseline of human performance that yielded a mean accuracy rate of 12%. The results suggest a promising potential for developing automated tools that promote accountability and simplify the provision of academic integrity in the e-learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Athabasca University Press (AU Press)"
        },
        {
            "Title": "Automatic composition of Learning Grid Portlets: a comparison of syntactic and semantic approaches",
            "Publication year": 2009,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJGUC.2009.02792",
            "Abstract": "Due to their potential advantages, the use of Grid technologies towards the development of collaborative and personalised learning frameworks has been considerably increased. These learning frameworks can be constructed based on distributed learning services and resources. A problem still unsolved is how to use and integrate low-level learning services to compose more complex high-level learning services or tools. In that sense, on the one hand, Business Process Execution Language (BPEL) is an orchestration language that, based on a syntactic representation of the characteristics of a learning service, can carry out the composition of a new learning service; on the other hand, Web Service Modeling Ontology (WSMO) is a language that can be used to represent the functional characteristics of a learning service semantically. This paper presents the benefits and limitations of the processes of composing …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Customer Relationship Management applied to higher education: developing an e-monitoring system to improve relationships in electronic learning environments",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSTM.2010.032887",
            "Abstract": "Customer Relationship Management (CRM) has usually been associated with business contexts. However, it has recently been pointed out that its principles and applications are also very appropriate for non-profit making organisations. In this article, we defend the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organisations seems natural. In particular, we focus on analysing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to electronic learning (e-learning). This is an issue that has much potential but has received little attention in research so far. Our work reflects upon this matter and provides a new step towards a CRM solution for managing relationships of specific customers, such as students. Indeed, the main contribution of this article is specifically …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Exploring Multiple Intelligence Theory Prospects as a Vehicle for Discovering the Relationship of Neuroeducation with Imaginative/Waldorf Pedagogy: A Systematic Literature Review",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/892884",
            "Abstract": "Waldorf Education follows a holistic approach of children’s development, where the fundamental characteristics are creative/artistic activities, integrating imagination-based teaching methods to support and enhance the development of children’s and adolescents’ physical, social, emotional, and cognitive skills. Neuroeducation provides the most relevant level of analysis for resolving today’s core problems in education. Multiple Intelligence (MI) theory investigates ways of using the theory as a framework in school for improving work quality, collaborations, opportunities for choice, and a role for the arts. To that end, we provide a systematic literature review that critiques and synthesizes representative literature on these three topics in order to reveal new perspectives towards a novel transformative educational paradigm in a digitized society. A comprehensive analysis of theoretical and empirical articles between 2000 and 2019 is provided. The search included five main academic databases (ERIC, Web of Science, ScienceDirect, SpringerLink, and Scopus) using predefined selection criteria. In total, 321 different articles were screened, from which 43 articles met the predefined inclusion criteria. The results indicate a correlation between pedagogical practices of Waldorf schools and MI theory compatible teaching practices and between Waldorf schools and neuroeducation. Further empirical research examining different facets of this relationship is still needed to establish live and effective schools as Learning Organizations. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:nVrZBo8bIpAC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Providing a multi-fold assessment framework to virtualized collaborative learning in support for engineering education",
            "Publication year": 2016,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/handle/10609/78515",
            "Abstract": "In previous research we proposed a virtualization process of live collaborative sessions from Web discussion forums and chats with the aim to produce interactive and attractive online learning resources to be played by learners, thus having a positive effect in learner engagement. In order to enhance further learning engagement, in this paper we endow our virtualization process with a multifold assessment framework that provides effective awareness and constructive feedback to learners from the original collaborative interactions amongst group members. The research here presented focuses on e-assessment of collaborative and social learning and extends it with Learning Analytics and Social Network Analysis techniques that are able to analyze and represent cognitive and social interactions underlying live collaborative sessions. The interaction data extracted from collaborative knowledge and social networking is integrated into the virtualized collaborative learning to produce an efficient and personalized awareness and feedback system about the collaborative activity and the social behaviour of the original participants of live collaboration. This paper describes both the conceptual and methodological research to build our multi-fold e-assessment framework. The research is evaluated in real context of e-learning and validated by empirical data and interpretation.scientific gatherings. This 'work-in-progress' spirit is reflected as well in this volume: the call was launched in late 2014 and 10 articles were eventually accepted and published, including reviews -a look behind-, one methods paper, and six original contributions -a look ahead …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:a0OBvERweLwC",
            "Publisher": "International Journal of Emerging Technologies in Learning"
        },
        {
            "Title": "Jxta-Overlay: An Interface for Efficient Peer Selection in P2P JXTA-based Systems",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=7959409911956946574&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Assessing students’ social and emotional competencies through graph analysis of emotional-enriched sociograms",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128234105000073",
            "Abstract": "Improvement of social and emotional competencies of students is associated with positive effects in various learning and personal development activities. To achieve this, Social and Emotional Learning activities are applied by tutors within educational groups. In the current chapter, we present an approach for the composition and analysis of social and emotional profiles of individuals within educational groups, based on the creation of socioemotional graphs. The former (social characteristics) is represented by sociometrics within an educational group, while the latter (emotional characteristics) is represented by individuals’ emotional competencies. Graph theory techniques are applied for the analysis of the evolving relationships of socioemotional characteristics, considering the interactions among group members. Upon the realization of a literature review over sociometric assessment and emotional …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:5icHVeHT4IsC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A framework for designing computer supported learning systems with sensibility",
            "Publication year": 2013,
            "Publication url": "https://www.igi-global.com/article/content/75213",
            "Abstract": "In the current paper, the authors propose a new conceptual framework in Computer Supported Learning System-CSCL design that takes emotion into account. They conduct their analysis through five layers: physiological, emotional, sociological, technological, and educational, in relation to learning. This study reviews the literature in emotional learning and emotion assessment and proposes a model for the design of a social-emotional computer supported learning system.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Broadening the CRM domain of application to higher educational (e-learning) environments",
            "Publication year": 2008,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/handle/10609/1424",
            "Abstract": "In this paper, we reflect about the broadening of the field of application of CRM from the business domain to a wider context of relationships in which the inclusion of non-profit making organizations seems natural. In particular, we focus on analyzing the suitability of adopting CRM processes by universities and higher educational institutions dedicated to e-learning. This is an issue that, in our opinion, has much potential but has received little attention in research so far.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "El procés de treball i d’aprenentatge en equip en un entorn virtual a partir de l'anàlisi d'experiències de la UOC (No. DP03-001)",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=8503697356817209768&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Jxta-Overlay: An interface for efficient peer selection in P2P JXTA-based systems",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548908000342",
            "Abstract": "In this paper we address the problem of the efficient peer selection in P2P distributed platforms. To this end, we have developed a P2P distributed platform using Sun's JXTA technology, which is endowed with resource brokerage strategies to efficiently select peers using four selection models: (a) economic scheduling model; (b) priced-based model; (c) peer-priority selection model; and, (d) random selection model. Next, we have deployed the P2P platform in a real network using nodes of the PlanetLab and have experimentally evaluated the performance of the peer selection models. The P2P platform offers a user-friendly interface for efficient peer selection and configuration of the P2P platform.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:kNdYIx-mwKoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A methodological framework for project-based collaborative learning in a networked environment",
            "Publication year": 2002,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2002.002141",
            "Abstract": "In this work, we present a new way to use existing technology in a real learning context. We investigate and propose a scenario based on collaborative work of virtual groups of students developing a software project. Our intent is to promote learning through collaborative implementation of a project in shared workspaces. This raises several important issues that concern virtual group formation techniques, group regulation and role-playing by students. Other important aspects are related to the pedagogical side and include setting project development phases, assessment, tutor role, student tracking, and the tutor's understanding and awareness of the social and cognitive processes. We consider them to be fundamental concerns and influencing factors in supervising, guiding and enhancing the collaborative learning process. Our approach describes the bases of a methodological framework for collaborative project …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:J-pR_7NvFogC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A generic platform for the systematic construction of knowledge-based collaborative learning applications",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/architecture-solutions-learning-systems/5237",
            "Abstract": "This study aims to explore the importance of efficient management of event information generated from group activity in collaborative learning practices for its further use in extracting and providing knowledge on interaction behavior. The essential issue here is how to design a platform that can be used for real, long-term, complex collaborative problem-solving situations and which enables the instructor to both analyze group interaction effectively and provide an adequate support when needed. The achievement of this task first involves the design of a conceptual model that structures and classifies the information generated in a collaborative learning application at several levels of description. This conceptual model is then translated into a computational model that not only allows the efficient management of the knowledge produced by the individual and group activity but also the possibility of exploiting this …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards an Integrated Model of Dialogue for CSCL. 1999",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=769158132798118341&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Games and simulation in higher education",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1186/s41239-017-0075-9",
            "Abstract": "The evolution of computer technologies, together with the increasing speed of Internet-based communications, has promoted the use of simulation software and serious games in higher education. These technological and methodological tools can significantly enrich the learning experience in almost any knowledge area. In particular, they will have a significant impact on how the learning process is performed in the so called Science, Technology, Engineering, and Mathematics (STEM) education. This thematic series brings together several articles related to the use of serious games and simulations in higher education. Technological and pedagogical characteristics of these innovative learning tools are explored through this series, alongside their cultural, technological, and/or social contexts. Among others, the selected articles explore topics such as:(i) the benefits of teaching practices, based on the utilisation of …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:geHnlv5EZngC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Using collaboration strategies to support the monitoring of online collaborative learning activity",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13166-0_39",
            "Abstract": "This paper first discusses the importance of online education and highlights its main benefits and challenges. In this context, on the one hand, we argue the significance of monitoring students’ and groups’ activity in an online learning environment. On the other hand, we analyze the informational needs that should be covered by any monitoring information system. Finally, the paper goes a step further by proposing the use of collaboration strategies as a manner to improve monitoring and learning processes in computer-supported collaborative learning.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Issue 3: complete document",
            "Publication year": 2011,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/bitstream/10609/24282/1/UOC_eLC_%203.pdf",
            "Abstract": "AdOPTINg THE ROLE Of ONLINE TEACHER AS A RESEARCHER ANd MOdEL buILdER Of LEARNERS’NEEdS TO APPROACH TIME AS A CONTExT dEPENdENT fACTOR wITHIN NETwORkINg SETTINgS",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:WqliGbK-hY8C",
            "Publisher": "Universitat Oberta de Catalunya"
        },
        {
            "Title": "Building intelligent emotion awareness for improving collaborative e-learning",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6630423/",
            "Abstract": "In CSCL contexts it is necessary to study new forms of interaction that stimulate and promote the necessary skills for human communication and critical thinking in order to improve learning experience. Consequently, we have to take advantage of the interaction data generated in CSCL activities to extract important information related to the emotions manifested by group members and build emotional intelligence that supports awareness and regulation of emotions at both individual and group level. This raises important issues that concern, on the one hand, the ways to label affective behavior in educational discourse and, on the other hand, the ways to present emotional information to group participants. This paper focuses on the first issue and describes an approach that considers participant's affective behaviors when interacting in virtual spaces and labels their emotions in a non-intrusive way.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Thinking dimensions as a foundation of learning design",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5194323/",
            "Abstract": "This work presents a position paper that describes a conceptual framework for dasialearning designpsila-based e-learning systems focusing on the role of the development of learnerspsila cognitive and critical thinking. Within this framework, teacherspsila active involvement is viewed as essential. To this end, an attempt has been also made to map basic dimensions of thinking to dasialearning designpsila through the proposal of an innovative dasialearning designpsila environment which includes various features.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A K-6 computational thinking curricular framework: pedagogical implications for teaching practice",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10494820.2021.1986725",
            "Abstract": "In this paper we propose a universal curricular framework that is intended to aid K-6 schoolteachers holistically and humanistically developing their students’ computational thinking (CT) skills (e.g. algorithmic thinking, abstraction, decomposition, generalization, patterns recognition, evaluation, and logical thinking). This framework, which can be applied to any subject at the elementary school level, is grounded on specific principles that we have gleaned from both learning theories and considerations on child development. New media literacy skills (NML) and social-emotional skills are also targeted, as they are strongly connected with CT skills and display bidirectional linkages that can comprehensively benefit students in various ways (cognitively, imaginatively/creatively, materially, socially, and affectively/emotionally) without the need for digital technologies or coding. The universal nature of our curricular …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "Routledge"
        },
        {
            "Title": "CC-LO: Embedding Interactivity, Challenge and Empowerment into Collaborative Learning Sessions.",
            "Publication year": 2012,
            "Publication url": "http://jucs.org/jucs_18_1/cc_lo_embedding_interactivity/jucs_18_01_0025_0043_caballe.pdf",
            "Abstract": "Despite their demonstrated potential through a range of early studies, on-line collaborative learning systems do not yet have the impact that many believe is possible. In particular, collaborative learning approaches cannot be readily applied to every e-learning experience, since they require a degree of presence and/or collaboration which may be difficult to achieve. In addition, collaborative learning systems often lack the challenging resources and tools required to fully support collaborations, making the experience unattractive to end-users and discouraging progression. Whilst the learner might expect to control the collaborative experience, often it is the collaborative experience that controls and limits the learner. As a result, collaborative learning resources can lack authentic interactivity, user empowerment and balanced levels of challenge, thus having a negative effect in learner motivation and engagement. To …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Martrat, J. Mee, A. 3, 57 157 199 Miranda, S. Murtagh, F.",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UwvvAgAAQBAJ&oi=fnd&pg=PA245&dq=info:U38XJTHFXt8J:scholar.google.com&ots=gVBLW5vSNa&sig=DJexxtjCkYJA_loW0NJwbRAi4vw",
            "Abstract": "Martrat, J. Mee, A. 3, 57 157 199 Miranda, S. Murtagh, F. Page 257 The Learning Grid \nHandbook 245 S. Salerno et al.(Eds.) IOS Press, 2008 © 2008 The authors and IOS Press. \nAll rights reserved. Asensio-Pérez, JI Bote-Lorenzo, ML Caballe, S. Capuano, N. \nChristophides, V. Christou, IT Contreras, P. D’Andria, F. Daradoumis, T. de Freitas, S. \nDimitriadis, YA Doerner, R. Gaeta, A. Gaeta, M. Gómez-Sánchez, E. Gutiérrez-Carreón, G. \nHarrison, I. Jiménez, S. Jorba, J. Jorrín-Abellán, IM Keenoy, K. Kotzinos, D. Kuehn, G. Laria, \nG. Libbrecht, P. Lievonen, M. Author Index 93 93 173 Magoulas, G. Martrat, J. Mee, A. 3, 57 \n157 199 Miranda, S. Murtagh, F. Oliver, M. 107 Orciuoli, F. 125 Paolozzi, S. 39, 173 \nPapamarkos, G. 143 93 Pierri, A. Poulovassilis, A. 107 Rigaux, P. 21, 57 3, 73 Ritrovato, P. \nRosenberg, D. 93 39 Roussos, K. Salerno, S. 143 Spyratos, N. 125 39 93 Tiropanis, T. \nTsekeridou, S. Ullrich, C. 157 Van Labeke, N. -…",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Architectures for Distributed and Complex M-Learning Systems: Applying Intelligent Technologies: Applying Intelligent Technologies",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Lrg5tZQICMkC&oi=fnd&pg=PR1&dq=info:WCVJFXkt2u8J:scholar.google.com&ots=s7R3NIa2aw&sig=7TKHxtikCZde_aMYSnaSupolag8",
            "Abstract": "Over the last decade, the needs of educational organizations have been changing in accordance with increasingly complex pedagogical models and with the technological evolution of e-learning environments with very dynamic teaching and learning requirements. Architectures for Distributed and Complex M-Learning Systems: Applying Intelligent Technologies explores state-of-the-art software architectures and platforms used to support distributed and mobile e-learning systems. Containing research from leading international experts, this advanced publication provides useful references to support learning practices for academicians, researchers, and practitioners.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:_OXeSy2IsFwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Cooperative learning &amp; working in a virtual environment: A case study",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=18113049219032566784&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling in multiprocessor system using genetic algorithms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4557878/",
            "Abstract": "Multiprocessors have emerged as a powerful computing means for running real-time applications, especially where a uniprocessor system would not be sufficient enough to execute all the tasks. The high performance and reliability of multiprocessors have made them a powerful computing resource. Such computing environment requires an efficient algorithm to determine when and on which processor a given task should execute. This paper investigates dynamic scheduling of real-time tasks in a multiprocessor system to obtain a feasible solution using genetic algorithms combined with well-known heuristics, such as 'Earliest Deadline First' and 'Shortest Computation Time First'. A comparative study of the results obtained from simulations shows that genetic algorithm can be used to schedule tasks to meet deadlines, in turn to obtain high processor utilization.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Providing Cognitive and Social Networking Assessment to Virtualized Collaborative Learning in Engineering Courses. In proceedings of the Sixth IEEE International Conference on Intelligent Networking and Collaborative Systems, 463-468",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=17451128888432654965&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CC–LR: providing interactive, challenging and attractive C ollaborative C omplex L earning R esources",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jcal.12021",
            "Abstract": "Many researchers argue that students must be meaningfully engaged in the learning resources for effective learning to occur. However, current online learners still report a problematic lack of attractive and challenging learning resources that engage them in the learning process. This endemic problem is even more evident in online collaborative learning approaches whose resources lack of authentic interactivity, user empowerment, social identity and challenge, thus having a negative effect on learners' self‐motivation and engagement. To overcome these and other limitations and deficiencies, in this paper, a new type of learning resource named Collaborative Complex Learning Resources (CC–LR) is presented based on the virtualization of collaborative learning with the aim of leveraging knowledge elicited during live sessions. During the CC–LR execution, the collaborative sessions are animated so learners …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting Effective and Useful Web-based Distance Learning.",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Santi-Caballe/publication/278796681_Supporting_Effective_and_Useful_Web-based_Distance_Learning/links/56051e7708aeb5718ff0443d/Supporting-Effective-and-Useful-Web-based-Distance-Learning.pdf",
            "Abstract": "Learners interacting in a Web-based distance learning environment produce a variety of information elements during their participation; these information elements usually have a complex structure and semantics, which makes it rather difficult to find out the behavioral attitudes and profiles of the users involved. User modelling in on-line distance learning is an important research field focusing on two important aspects: describing and predicting students’ actions and intentions as well as adapting the learning process to students’ features, habits, interests, preferences, and so on. This work provides an approach that can be used to greatly stimulate and improve the learning experience by tracking the students’ intentions and helping them reconduct their actions that could evolve accordingly as the learning process moves forward. In this context, user modelling implies a constant processing and analysis of user interaction data during long-term learning activities, which produces large and considerably complex information. In this paper we show how a Grid approach can considerably decrease the time of processing log data. Our prototype is based on the master-worker paradigm and is implemented using a peer-to-peer platform called Juxtacat running on the Planetlab nodes. The results of our study show the feasibility of using Grid middleware to speed and scale up the processing of log data and thus achieve an efficient and dynamic user modelling in on-line distance learning.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending the scope of asynchronous collaboration: a matter of being autonomous and self-sufficient",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1376815/",
            "Abstract": "Asynchronous collaborative applications and systems have to deal with complexities associated with interaction nature, idiosyncrasy of groups and technical and administrative issues. Inclusion of requirements derived from them is costly (in time, resources and economically). Existing solutions addresses asynchronous collaboration via simplification of requirements and by using centralized models. In this paper we present LaCOLLA, a fully decentralized infrastructure for building collaborative applications that provides general purpose collaborative functionalities. The provision of those functionalities will avoid applications deal with most of complexities derived from groups and its members, what will help inclusion of collaborative aspects. The implementation of LaCOLLA follows the peer-to-peer paradigm and pays special attention to autonomy of its members and to self-organization of the components of the …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:86PQX7AUzd4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Issue 3: complete document",
            "Publication year": 2011,
            "Publication url": "http://www.artnodes.com/ojs/index.php/elcrps/article/view/n3-intelligent-networking",
            "Abstract": "Buying a domain is an easy task. But when you are looking for a specific domain that needs to be transferred over and the costs are high you need a company that can handle this transaction for you. You are in a way buying a business when dealing with domains of this quality. With HugeDomains the process was extremely easy and helpful. We paid and received our logins/transfer documents and etc within the same hour. I highly recommend them and will be dealing with them for my domain needs.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open proctor: An academic integrity tool for the open learning environment",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-65636-6_23",
            "Abstract": "Managing integrity of continuous and authentic assessments in an open and distance environments is a complex process. The core challenge is to map student identities with their academic work in effective and efficient manners, while preserving privacy, ensuring minimal disruption, minimizing impacts on accessibility and convenience. To address this issue, we have developed a prototype cloud-based application entitled OpenProctor that employs machine-learning techniques to analyze patterns in the learner-produced textual content in order to provide identity and authorship assurance. In contrast to the traditional academic integrity approaches that seek to control the remote learning environment, our method takes advantage of the readily available learner-generated data to analyze how the students go about doing their academic work. We present the framework, the architecture and main functions of …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Efficient embedding of information and knowledge",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=8023752388374506637&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A behavioral biometrics based and machine learning aided framework for academic integrity in e-assessment",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7695181/",
            "Abstract": "The common approaches to academic integrity in the e-learning environment are resource-intensive and require technology and/or dedicated invigilation staff to monitor assessment activities. These approaches are observational and often external to the learning spaces where the majority of the instructional content resides. Authentic assessments such as discussions, projects and portfolios may not always undergo the same scrutiny as high-stakes examinations and therefore differ in the level of identity and authorship assurance they provide. In this paper, we propose an integrated approach to enhancing academic integrity of e-assessments. The approach is based on behavioral biometrics and aided by machine-learning techniques. It provides continuous identity and authorship assurance throughout the learning activities within the existing learning space. It can be applied to measure the degree of learner …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building emotion-aware features in Computer Supported Collaborative Learning (CSCL) systems",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=5043696432274671047&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fruitful student interactions and perceived learning improvement in DSLab: A dynamic assessment tool for distributed programming",
            "Publication year": 2020,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/bjet.12756",
            "Abstract": "This work presents an automated assessment tool for online distributed programming, called DSLab. It is a web‐based environment that provides a transparent deployment and execution of assignments in remote computers, a transparent initialization and the possibility to add new logs by the students. DSLab has been evaluated in a real distributed learning environment by analysing students' own perceptions on their learning improvement and exploring whether students' interactions with the tool yielded a fruitful learning experience. Current research provides no evidence that the effects of such a tool have been investigated in the field of online distributed programming. Two types of analysis were performed: a quantitative analysis of data coming from students answering a questionnaire and an analysis of the log files of students' interactions with the tool. Our results showed that students perceived substantial …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:YohjEiUPhakC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using a distributed systems laboratory to facilitate students' cognitive, metacognitive and critical thinking strategy use",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/jcal.12605",
            "Abstract": "Recent research in online settings reports that supporting self‐regulated learning (SRL) strategy use could lead to greater online academic success. A growing number of studies have started to investigate SRL supports in online environments recently, which indicates a great interest in this matter. Though several systems for automatic assessment of programming have been developed, there is hardly any study that has investigated how an automated assessment tool for distributed programming could facilitate students' SRL strategies.This study examined the ways our online Distributed Systems Laboratory (DSLab) tried to enhance students' SRL strategies in an authentic long‐term online educational experience.We applied an experimental research design, involving 111 university students who performed a programming assignment using DSLab. A customized questionnaire …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:2tRrZ1ZAMYUC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Critical thinking as a framework for structuring synchronous and asynchronous communication within learning design-based e-learning systems",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04001-6_6",
            "Abstract": "This paper describes a conceptual framework focusing on the role that the development of learners’ core cognitive skills and critical thinking plays on the success of synchronous and asynchronous communication within learning design-based e-learning systems. Based on this framework, we propose the design of specific tools which can be used by both teachers and students for structuring synchronous and asynchronous communication. In particular, a Cognitive Skill-based Communication Wizard (CSC-Wizard) is proposed as a supporting tool for helping discussion participants formulate appropriate interventions that express their intentions more clearly and thus facilitate the development of their cognitive skills more adequately. The design of this CSC-Wizard is based on modern social and constructivist views of learning and dialogue modeling. The idea, the rationale, the architecture and the interface …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computing for processing and analysing information from online collaborative learning teams",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=8667183203612921862&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent Networking",
            "Publication year": 2011,
            "Publication url": "http://elcrps.uoc.edu/elcrps/index.php/elcrps/article/download/n3-intelligent-networking/1391-2900-1-PB.pdf",
            "Abstract": "AdOPTINg THE ROLE Of ONLINE TEACHER AS A RESEARCHER ANd MOdEL buILdER Of LEARNERS’NEEdS TO APPROACH TIME AS A CONTExT dEPENdENT fACTOR wITHIN NETwORkINg SETTINgS",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:LhH-TYMQEocC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improvement of JXTA protocols for supporting reliable distributed applications in P2P systems",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74573-0_36",
            "Abstract": "In any distributed application, the communication between the distributed processes/nodes of the distributed systems is essential for both reliability and efficiency matters. In this work we address this issue for distributed applications based on JXTA protocols. After a careful examination of the current version of JXTA protocols, we observed the need for improving the original JXTA protocols, such as pipe services, to ensure reliable communication between peer nodes and the discovery and presence service to increase the performance of the applications. The re-implemented protocols have been validated in practice by deploying a P2P network using nodes of PlanetLab platform and testing each of the extended protocols using this real P2P network.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Blended Learning",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-94505-7.pdf",
            "Abstract": "Welcome to the proceedings of the 11th International Conference on Blended Learning (ICBL 2018). This year, ICBL 2018 was held at the Kansai University, Osaka, Japan, from 31 July to 2 August 2018.Blended learning is one of the promising approaches to teaching and learning. It aims to integrate traditional learning with innovative means, such as e-learning, analytics, game-based learning, and open educational resources, in order to create a new learning environment to enhance learning effectiveness and enrich learning experience. Like the previous conferences in the series, ICBL 2018 provided a platform for knowledge exchange and experience sharing among researchers and practitioners in this field.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Semantic Description and Matchmaking of Learning Grid Services.",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UwvvAgAAQBAJ&oi=fnd&pg=PA39&dq=info:PfK4N1K6jCgJ:scholar.google.com&ots=gVBLW5vSO8&sig=KLIeh1rVwWAd6Lvg0ssnb5lQ4SY",
            "Abstract": "Learning Grid services are the fundamental component of learning systems based on Grid Technology and represent functionalities that can be easily reused without knowing the details of how services have been implemented. Semantic Web Service technology promises to automate web service discovery, composition and integration, tasks that currently need to be performed manually despite the quickly increasing number of online service. A number of approaches have been proposed to tackle the problems of semantic description and matchmaking of Learning Grid Services. This article gives an overview of those recent research efforts.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A grid-aware implementation for providing effective feedback to on-line learning groups",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11575863_47",
            "Abstract": "Constantly providing feedback to on-line learning teams is a challenging yet one of the latest and most attractive issues to influence learning experience in a positive manner. The possibility to enhance learning group’s participation by means of providing appropriate feedback is rapidly gaining popularity due to its great impact on group performance and outcomes. Indeed, by storing parameters of interaction such as participation behaviour and giving constant feedback of these parameters to the group may influence group’s motivation and emotional state resulting in an improvement of the collaboration. Furthermore, by feeding back to the group the results of tracking the interaction data may enhance the learners’ and groups’ problem solving abilities. In all cases, feedback implies constantly receiving information from the learners’ actions stored in log files since the history information shown is continuously …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Waldorf inspired hyper-imaginative learning trajectories: developing new media literacies in elementary education",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03004430.2020.1835881",
            "Abstract": "The purpose of this pilot study is to identify how Waldorf-inspired imaginative teaching methods, and low-technology prototyping promote New Media Literacies (NMLs) development at upper elementary school students. Particularly, the aim is twofold: firstly, to test the feasibility of the research design and validate the research instruments; secondly, to explore the relationship among Waldorf-inspired teaching methods, low-technology prototyping and NMLs development. The study was conducted following mixed methods-grounded theory (MM-GT) methodology by collecting, analyzing, and interpreting qualitative and quantitative data from 104 participants. Specific learning trajectories are traced facilitating students to develop NMLs. Waldorf-inspired hyper-imaginative learning trajectories are unfolded within a six-phases learning process, as particularly effective at low-technology learning environments. Further …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:lvd772isFD0C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Team working and learning process in a virtual environment based on analysis of experiences at the UOC",
            "Publication year": 2003,
            "Publication url": "https://in3wps.uoc.edu/in3/en/index.php/in3-working-paper-series/article/view/n3-guitert-et-al/0.html",
            "Abstract": "This report presents the research process that the TACEV group followed throughout the 2000-2001 academic year surrounding their subject area: Team Working and Learning in a Virtual Environment, based on two central objectives: knowing how to organise the learning and co-operative work process in a virtual environment and evaluating which tools provide adequate functionalities to respond to our methodological proposal for co-operative working and learning.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Students’ motivations of English language learning in Greece in an era of financial crisis: Empirical study of secondary school and university students’ perceptions",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Thanasis-Daradoumis/publication/311365241_Students'_motivations_of_English_language_learning_in_Greece_in_an_era_of_financial_crisis_empirical_study_of_secondary_school_and_university_students'_perceptions/links/584bf9d608aeb989251f22bc/Students-motivations-of-English-language-learning-in-Greece-in-an-era-of-financial-crisis-empirical-study-of-secondary-school-and-university-students-perceptions.pdf",
            "Abstract": "Globalization of technology and employment are two essential factors in today’s network society; therefore, the use of a lingua franca is necessary. English has been playing this role for decades and is considered a powerful means of communication [1]. Particularly in Greece, English has long been an essential part of education and research has revealed many reasons why Greek students are motivated to learn it [2]. However, Greece has faced a harsh financial crisis recently and up to date is unable to overcome its problems. A large number of students, researchers and workforce have moved abroad in order to find better opportunities. Consequently, it is likely that the motivation of current Greek students to learn English has increased over the last decade due to their desire to study and work abroad. Moreover, the technological advances in education have played another important role in today’s English classrooms that may influence students’ motives. This study aims to unravel the young learners’ attitude to learn English in Greece in an era of financial crisis. For the data gathering procedure, a questionnaire is created that explores students’ motivation. The participants are fifty one students in Greek secondary schools or universities aged between 12 and 24 years old, who study English as a foreign language (EFL). The main results reflect that the economic crisis has little influence on students’ motives to learn English since students claim that–regardless of the economic situation-English has always played a dominant role for their future prospective.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning design: a conceptual frame work emphasizing critical thinking",
            "Publication year": 2009,
            "Publication url": "https://www.learntechlib.org/p/32709/",
            "Abstract": "This work presents a conceptual framework for ‘learning design’-based e-learning systems focusing on the role of the development of learners’ cognitive skills and critical thinking. To this end, an attempt has been made to map basic dimensions of thinking to ‘learning design’through the proposal of an innovative environment which includes various features such as: i) a set of design-patterns for the design of appropriate learning activities, ii) communication tools aiming for the development of these thinking dimensions as well as for the formation of appropriate teacher-interventions, iii) regulation tools to be used by the learners to take control of their learning, iv) monitoring tools supporting appropriate teacher interventions encouraging critical thinking, v) teacher scaffolding elements in terms of providing a teacher education curricula based on thinking skills, and vi) meaningful online help for teachers providing …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:uLbwQdceFCQC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Problems and Opportunities of Learning Together",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=1125464092986123632&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Idea Group Inc"
        },
        {
            "Title": "Cooperative learning & working in a virtual environment: A case study",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=5839355095024697545&hl=en&oi=scholarr",
            "Abstract": "This paper focuses on examining the various kinds of pedagogical, organisational or technical elements and constraints of successful application of collaborative learning in distance education. Our research relies on case studies concerning collaborative learning and work in several courses in virtual learning environments. Firstly, based on the implementation and analysis of educational practices with clearly differentiated goals, contents and methodologies, our research revealed that the progress of virtual learning groups goes across four critical moments: Group formation, consolidation, development and dissolution. Finally, we propose, explore and evaluate tools and technical functionalities that mediate collaboration and support effective virtual collaborative work and learning",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Current trends in emotional e-learning: new perspectives for enhancing emotional intelligence",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6603863/",
            "Abstract": "This paper explores the role and impact of emotion on learning and specifically analyzes issues related to emotion awareness and emotional feedback in e-learning. After a detailed analysis of current research work in these issues, important research questions in emotional e-learning are set and a conceptual Emotion Analysis model is proposed to answer these questions.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Study on the Effectiveness of an Undergraduate Online Teaching Laboratory With Semantic Mechanism From a Student Perspective",
            "Publication year": 2020,
            "Publication url": "https://www.learntechlib.org/p/217680/",
            "Abstract": "Aim/Purpose: The current study was conducted to investigate the students’ perceived satisfaction with the use of a semantic-based online laboratory, which provides students with a search mechanism for laboratory resources, such as instruments and devices. Background: The increasing popularity of using online teaching labs, as an important element of experiential learning in STEM education, is because they represent a collection of integrated tools that allow students and teachers to interact and work collaboratively, whereas they provide an enriched learning content delivery mechanism. Moreover, several research studies have proposed various approaches for online teaching laboratories. However, there are hardly any studies that examine the student satisfaction provided by online laboratories based on students’ experiential learning. Methodology: To measure the effectiveness of the laboratory, we …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:Aul-kAQHnToC",
            "Publisher": "Informing Science Institute"
        },
        {
            "Title": "A method for thematic and structural visualization of academic content",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8001769/",
            "Abstract": "Academic work: grading student assignments or conducting literature surveys entails extensive reading, which is both a time consuming and cognitively demanding task. The challenge increases proportionally with the increase of volume of the textual content. In this paper, we propose a novel approach to visualization of textual data that depicts information on a continuum (temporal or spatial) allowing inferences to be made about thematic organization of a document and its structure. Our visualization method-termed ThemeTrack-creates a visual map: delineating key themes and tracking their presence throughout the text, highlighting their variations and relationships. It aims to make the review of textual data more efficient. To assess the viability of the proposed approach, a series of experiments were conducted using graduate-level theses and published articles in the peer-reviewed journals. The applications of …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring the Learning Profile of Information System Workers to Provide Effective Professional Development",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35879-1_40",
            "Abstract": "This paper presents a research work that explores a variety of issues which, on the one hand, are related to the way the employees of a computerized workplace behave, work and learn and, on the other hand, try to identify the employees’ knowledge, competencies, preferences, interests, deficiencies in knowledge, skills and abilities, training needs as well as socialization and health aspects. All these concerns lead to the construction of a rich learning profile of Information System employees which is a key issue for determining an adequate and timely training for the different types of employees and their needs. The methodology followed integrates a variety of profile assessment techniques, such as observation, questionnaires, interviews, focus groups, and documentation. This paper focuses more on the questionnaire technique where the main employee profile indicators are determined, analyzed and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design of an emotion aware e-learning system",
            "Publication year": 2012,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKL.2012.051676",
            "Abstract": "Sense and analysis of user’s emotions has appeared in the focus of the research agenda during the last decade with many applications, especially in learning. The latter is informed by the study of emotions that has been attained for many years. In the current paper, we first review prominent theories and models of learning with respect to student’s emotions and emotion recognition technologies and then we analyse the design of a system endowed with emotion awareness features. Part of the work we present, is based on the results of a pilot CSCL project, named emot-project. In our last section, we define an agenda for future work.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:JQOojiI6XY0C",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Supporting effective monitoring and knowledge building in online collaborative learning systems",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87781-3_23",
            "Abstract": "This paper aims to report on an experience of using an innovative groupware tool to support real, collaborative learning. We base the success of on-line collaborative learning on extracting relevant knowledge from interaction data analysis in order to provide learners and instructors with efficient awareness, feedback, and monitoring as regards individual and group performance and collaboration. Monitoring is especially important for online instructors since they can use this valuable provision of information as a meta cognitive tool for regulating the collaborative learning process more conveniently and provide adequate support when needed. In addition, learning and knowledge building may be greatly enhanced by presenting selected knowledge to learners as for their particular skills exhibited during interaction, such as the impact and effectiveness of their contributions. Indeed, by letting learners be …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:g3aElNc5_aQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Lacolla: Middleware for self-sufficient online collaboration",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4120450/",
            "Abstract": "The LaCOLLA middleware makes it possible for collaborators to interact using their own resources without depending on centralized regimes. By contributing their own resources, group members can organize and communicate using a federated peer-to-peer model. This lets the group function regardless of whether a member removes resources and despite network or node failures or disconnection. In turn, this capacity for self-organization, together with location transparency, lets application developers create self-sufficient applications for collaborative activity",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:kzcrU_BdoSEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CESA 2008",
            "Publication year": 2008,
            "Publication url": "https://www.computer.org/csdl/pds/api/csdl/proceedings/download-article/12OmNAndiwW/pdf",
            "Abstract": "Welcome Message from the Organizers onference chairpersons, PC chair, PC members, presenters and all audience. We are pleased to extend to you the warmest of welcomes to the first edition of the International Workshop on Collaborative e-Learning Systems and Applications. It was a pleasure for us to be involved in the organization and kick-off of this international workshop, which gives us a great deal of satisfaction.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Enabling of Real Time User Modeling in On-line Campus Proceedings of the UM 2007",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=6743404784522330296&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:epqYDVWIO7EC",
            "Publisher": "LNCS"
        },
        {
            "Title": "Problems and opportunities of learning together in a virtual learning environment",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/problems-opportunities-learning-together-virtual/6908",
            "Abstract": "This chapter explores new ways of collaborative learning in a virtual learning environment based on our acquisition of knowledge from previous experience. We identify both the problems faced in real collaborative learning practices and the ways these problems can be overcome and turned into opportunities for more efficient learning. These issues concern pedagogical, organizational, and technical elements and constraints that influence the successful application of collaborative learning in distance education, such as efficient group formation, the nature of collaborative learning situations that promote peer interaction and learning, the student roles and tutor means of supervising and guiding the learning process, and an effective assessment of group work. The proposed methodology not only achieves better learning outcomes but also contributes to the tutor’s professional development in a networked learning …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:M05iB0D1s5AC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Exploring Interaction Behaviour and Performance of Online Collaborative Learning",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12109199229730809298&hl=en&oi=scholarr",
            "Abstract": "Studying and analysing the collaborative behaviour of on-line learning teams and how this behaviour is related and affects task performance is a complex process. This paper presents an integrated approach that analyzes the participatory attitudes of group members in collaborative learning activities (group functioning) in relation to the individual and group learning outcomes (task performance). To that end, we first provide principled criteria and methods for evaluating collabora-tive problem-solving situations and then we identify different group types in terms of their degree of success at group functioning and task levels. Our objective is two-fold: assessing the effectiveness and adequacy of the evaluation criteria and methods, and exploring the interaction behaviour of different collaborative group types with respect to their performance.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:artPoR2Yc-kC",
            "Publisher": "Springer"
        },
        {
            "Title": "A Framework for understanding Cooperation and Coordination in a Project-based Collaborative Learning Situation",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13553860958733496737&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A layered framework for evaluating on-line collaborative learning interactions",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1071581906000176",
            "Abstract": "Evaluating on-line collaborative learning interactions is a complex task due to the variety of elements and factors that take place and intervene in the way a group of students comes together to collaborate in order to achieve a learning goal. The aim of this paper is to provide a better understanding of group interaction and determine how to best support the collaborative learning process. To that end, we propose a principled framework for the study and analysis of group interaction and group scaffolding which is built by combining different aspects and issues of collaboration, learning and evaluation. In particular, we define learning activity indicators at several levels of description which prompt to the application of a mixed interaction analysis scheme and the use of different data types and specific tools. At an initial layer, the basis of the approach is set by applying a qualitative process for evaluating the individual and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A data analysis model based on control charts to monitor online learning processes",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=3952625081040741639&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A robust and non-invasive strategy for preserving academic integrity in an open and distance learning environment",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8001852/",
            "Abstract": "The aim of this research project is to evaluate a novel approach to providing academic integrity through behavioral pattern analysis for continuous and on-demand assessments. Our objective is to empower instructors with efficient and automated tools that promote accountability and academic integrity, while providing students with an accessible, non-invasive, privacy preserving and convenient validation of the student-generated academic content. The contributions of the proposed study are threefold: (1) the bridged anonymity gap between learners and instructors, (2) an open source learning technology that enhances academic integrity, and (3) understanding of how the behavioral-based biometric technologies are perceived by students and instructors.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Parallel Grid-based Implementation for Real Time Processing of Event Log Data in Collaborative Applications.",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Santi-Caballe/publication/221133741_A_Parallel_Grid-based_Implementation_for_Real_Time_Processing_of_Event_Log_Data_in_Collaborative_Applications/links/0deec52960cff45794000000/A-Parallel-Grid-based-Implementation-for-Real-Time-Processing-of-Event-Log-Data-in-Collaborative-Applications.pdf",
            "Abstract": "Collaborative applications usually register user interaction in the form of semi-structured plain text event log data. Extracting and structuring this data is a prerequisite for later key processes such as the analysis of interactions, assessment of group activity, or the provision of awareness and feedback. Yet, in real situations of online collaborative activity the processing of log data is usually done offline since structuring event log data is, in general, a computationally costly process and the amount of log data tends to be very large. Techniques to speed and scale up the structuring and processing of log data with minimal impact on the performance of the collaborative application are thus desirable in order to be able to process log data in real time. In this paper we present a parallel Grid-based implementation for processing in real time the event log data generated in collaborative applications. Our results show the feasibility of using grid middleware to speed and scale up the process of structuring and processing semistructured event log data. Our Grid prototype follows the Master-Worker paradigm, is implemented using the Globus Toolkit 3.2 and is tested on the Planetlab platform.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Providing an Effective Structured and Context-aware Asynchronous Discussion Forum for Collaborative Knowledge Building",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/29057/",
            "Abstract": "This paper aims to report a experience of using an innovative CSCL tool to support real, collaborative learning by discussion. First, we provide an adequate dialogue structure and move types that promote meaningful contributions and achieve more productive interaction. Then we extract relevant knowledge in order to provide learners and tutors with efficient awareness, feedback, and monitoring as regards learners’ performance and collaboration. To this end, we employ a sociolinguistic model that builds a structure of the discussion through generic exchange types. We use these move types as indicators to analyse learners’ interactions in terms of performance and the particular skills exhibited during interaction. The ultimate goal is to achieve a more effective support and assessment of the discussion process and to enhance learning. To validate this model, we employed it in a real virtual learning environment to …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:LI9QrySNdTsC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Transformación pedagógica y uso de tabletas digitales: reflexión sobre el proceso en el aula de secundaria",
            "Publication year": 2019,
            "Publication url": "https://accedacris.ulpgc.es/handle/10553/58029",
            "Abstract": "Una transformación pedagógica donde la tecnología no sea considerada como una herramienta sino como parte de nuestra vida diaria, es un discurso más apropiado para la sociedad digital en que estamos inmersos. A pesar de la importancia dada al uso de las tecnologías en el entorno educativo, su implementación en el proceso de aprendizaje sigue siendo un gran desafío y su éxito educativo desconocido. Basado en un caso práctico, este estudio muestra la reflexión descriptiva de la transformación pedagógica llevada a cabo en las aulas de educación secundaria obligatoria (ESO) tras la incorporación de la tableta digital en los cursos académicos 2014-2019. Un total de 139 estudiantes, 84 familias y 25 docentes participaron en este estudio. Se diseñaron y distribuyeron cuestionarios tipo Likert, a partir de una adaptación de la herramienta de la Unión Europea SELFIE (“Self-reflection on Effective Learning by Fostering the use of Innovative Educational Technologies”) junto con una revisión de la literatura científica en el campo de las tecnologías educativas. Los datos fueron agrupados y presentados en cuatro bloques temáticos: Pedagogía, Didáctica, Proceso de Enseñanza-Aprendizaje y Evaluación. Para facilitar la comprensión los resultados se presentaron en forma de análisis DAFO (Debilidades, Amenazas, Fortalezas y Oportunidades). Se ha iniciado una transformación pedagógica en el seno de la comunidad educativa. Una enseñanza basada en un aprendizaje por competencias donde el desarrollo metacognitivo y emocional del estudiante permita aprender a lo largo de la vida es necesaria, por tanto, el currículum debe …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting the composition of effective virtual groups for collaborative learning",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1185939/",
            "Abstract": "In this paper, the authors explore the different processes involved in constructing effective virtual collaborative learning groups, especially why, when and how these processes affect group formation and to which degree they guarantee the creation of well-functioning and successful learning groups. A student can benefit from collaborative learning only if he/she participates in supportive learning teams. For this reason, their research interest is to aid and provide the means for the configuration of learning groups that are appropriate for different learning situations. A key issue in this process is to make the educational function and structure of collaborative learning groups clear, by identifying and making explicit both the individual and group learning and social goals, as well as the relationships, interaction processes and roles that determine the nature and idiosyncrasy of the group.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developing social-emotional skills through imaginative teaching methods in elementary education",
            "Publication year": 2020,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03004430.2020.1854241",
            "Abstract": "The purpose of this preliminary pilot study is to identify how imaginative teaching methods and low-technology prototyping promote social-emotional (SE) skills development in elementary school students. Particularly, two are the objectives of the study, firstly to test the research desigńs feasibility and validate the research tools and secondly, to explore the relationships between the employed teaching methods and social-emotional skills development. The study is based on mixed methods-grounded theory methodology involving the collection of qualitative and quantitative data from 104 participants. Based on grounded theory methodology, we have developed a pedagogical approach illustrating age-appropriate teaching practices for developing SE skills. Further research needs to be carried out to gain greater insight into the cross-curricular infusion of these methods and skills across different grades. The added …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:gKiMpY-AVTkC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Endowing e-learning systems with emotion awareness",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6132781/",
            "Abstract": "The consideration of emotion in learning has been in the research agenda for quite long time and literature is offering a variety of studies that are evaluating the role of emotions in various learning contexts (class, test and exams, during studying at home, etc). In the current paper we first appose a critical review of prominent emotion taxonomies, affect detection and feedback strategies and then we propose the design of a system that is endowed with students' emotion aware capabilities. An emotion taxonomy that originates from the basic emotions of fear and affection is put forward. Social-Emotional Learning Theory and Practice can be exploited to feed the necessary theoretical background that is lacking of empirical data.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An infrastructure for educational virtual laboratories based on Semantic Web and Grid Computing",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.927.5195&rep=rep1&type=pdf",
            "Abstract": "Due to the success of web-based systems, the use of Grid technologies have been popularized in the development of learning scenarios supporting scientific applications that enable collaboration and personalization, which can be accessed anytime and anywhere. These Learning frameworks have generated new challenges, since they must develop technologies that allow the location of available resources in distributed scientific networks and give users a common access point, which can be customized for user preferences, profile privileges and access limitations. In that sense, semantic description can be used to perform a discovery of learning services based on a semantic matching process between the learning framework characteristic and user needs to obtain the best fit according to individual parameters. This paper presents an infrastructure for virtual laboratories based on semantic capabilities and a case study of discovery of optoelectronic services based on semantic description using Web Services Modeling Ontology (WSMO) and their respective representation using Web Services Modeling Language (WSML).",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "6 Computer Supported Collaborative Learning-An Integrated Approach for Analysing and Assessing the Performance of Virtual Learning Groups",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4868711652494275253&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:AHdEip9mkN0C",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Enabling novel methodologies to promote virtual collaborative study and learning in distance education",
            "Publication year": 2001,
            "Publication url": "https://www.uoc.edu/in3/grupsrecerca/03_ICDE2001.doc",
            "Abstract": "This paper describes an approach that aims to promote active study and learning in a virtual collaborative learning environment, providing strategies, methods and resources that support effective student interaction in small Virtual Study and Learning Groups. From the theoretical point of view, we propose a design methodology of three layers (initiating, forming and performing) that sets the basis for the elaboration of a conceptual framework for understanding virtual collaborative study and learning, the determination of guidelines for modelling collaborative learning situations, and the development of models of cooperation from different perspectives. In particular, we examine the processes involved in virtual collaborative learning, especially why, when and how collaborative interaction mediates the intelligent construction, management and dissemination of knowledge. Due to the lack of a paradigm, there is no definitive approach yet to the design of sound virtual collaborative learning methodologies. To that end, our approach brings new expectations and requires changes in attitudes and reward structures for both the learners and the teachers, such as new roles, different pedagogic and learning methods, and technological and training supports that enable learners build up social structures, encourage learning and develop critical thinking skills.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A service-oriented platform for the enhancement and effectiveness of the collaborative learning process in distributed environments",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-76843-2_9",
            "Abstract": "Modern on-line collaborative learning environments are to enable and scale the involvement of an increasing large number of single/group participants who can geographically be distributed, and who need to transparently share a huge variety of both software and hardware distributed learning resources. As a result, collaborative learning applications are to overcome important non-functional requirements arisen in distributed environments, such as scalability, flexibility, availability, interoperability, and integration of different, heterogeneous, and legacy collaborative learning systems. In this paper, we present a generic platform, called Collaborative Learning Purpose Library, which is based on flexible fine-grained Web-services for the systematical construction of collaborative learning applications that need to meet demanding non-functional requirements. The ultimate aim of this platform is to enhance and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Adapting the collaborative strategy ‘students team achievement divisions’ in an information technology work place",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28586-8_6",
            "Abstract": "This paper presents an innovative description and an initial implementation of the “Students Team Achievement Divisions (STAD)” collaboration method (Slavin, 1978), in the form of an online adaptive collaborative design-pattern that has been constructed taking into account adaptation techniques, within the context of an open-source learning design-based environments such as the LAMS system (Dalziel, 2003). This method is described with special reference to the learning of essential aspects of an Information System. The innovative description of the aforementioned collaborative method within the LAMS system is based on the fact that: (a) the tasks assigned to the groups consist of investigation of real world scenarios, and not merely the study of learning material as is usually proposed, (b) adaptive techniques are integrated with the method and (c) for the design of the collaborative learning activity, an …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Framework for Assessing Self, Peer, and Group Performance in E-Learning",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/self-peer-group-assessment-learning/28807",
            "Abstract": "In this chapter, we propose a framework that supports the analysis andassessment of collaborative learning of online groups of students workingon a complex task (software project, or case study) in a real Web-based, distance-learning context. On the one hand, our approach is based onprincipled evaluation criteria that involve and measure a variety ofelements and factors as well as on a combination of a basic qualitativeprocess and a quantitative method that provide a grounded and holisticframework to analyze and assess group and individual performance moreeffectively and objectively. On the other hand, the approach has been fullyimplemented and tested on an asynchronous collaboration platform. All inall, the aim of our work is to provide a better understanding of groupinteraction and determine how to best support the collaborative learningprocess.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:5ugPr518TE4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Towards a Social-Emotional e-Learning System",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35879-1_38",
            "Abstract": "In the current paper, we first review Emotion-Learning Theories and Emotion Assessment in Human-Computer Interaction (HCI) and then we lay the foundations of a Social-Emotional Computer Supported Learning System that is based on social-emotional competencies and can support emotion assessment.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Extending the scope of asynchronous collaboration: a matter of being autonomous and self-sufficient",
            "Publication year": 2004,
            "Publication url": "https://upcommons.upc.edu/handle/2117/2302",
            "Abstract": "Asynchronous collaborative applications and systems have to deal with complexities associated with interaction nature, idiosyncrasy of groups and technical and administrative issues. Inclusion of requirements derived from them is costly (in time, resources and economically). Existing solutions addresses asynchronous collaboration via simplification of requirements and by using centralized models. In this paper we present LaCOLLA, a fully decentralized infrastructure for building collaborative applications that provides general purpose collaborative functionalities. The provision of those functionalities will avoid applications deal with most of complexities derived from groups and its members, what will help inclusion of collaborative aspects. The implementation of LaCOLLA follows the peer-to-peer paradigm and pays special attention to autonomy of its members and to self-organization of the components of the infrastructure. Another key aspect is that resources (e.g. storage) and services (e.g. authorization) are provided by its members (avoiding dependency from agents not belonging to group).",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A model for providing emotion awareness and feedback using fuzzy logic in online learning",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00500-016-2399-0",
            "Abstract": "Monitoring users’ emotive states and using that information for providing feedback and scaffolding is crucial. In the learning context, emotions can be used to increase students’ attention as well as to improve memory and reasoning. In this context, tutors should be prepared to create affective learning situations and encourage collaborative knowledge construction as well as identify those students’ feelings which hinder learning process. In this paper, we propose a novel approach to label affective behavior in educational discourse based on fuzzy logic, which enables a human or virtual tutor to capture students’ emotions, make students aware of their own emotions, assess these emotions and provide appropriate affective feedback. To that end, we propose a fuzzy classifier that provides a priori qualitative assessment and fuzzy qualifiers bound to the amounts such as few, regular and many assigned by an …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "WWG: a distributed infrastructure for learning in groups",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/963702/",
            "Abstract": "This paper describes the experiences of learning and working in groups on the Computer Science studies at the Virtual Campus of the Open University of Catalunya. Two communities have used a web based shared workspace tool to (a) coordinate the task of tutors of a computer architecture course, and (b) a problem based collaborative learning project with software engineering students. These experiences have lead to the design of WWG: a distributed infrastructure for distance learning in groups on an Internet scale. WWG is based on the distribution of events about the information produced by people. Every participant can be notified and thus be aware of the actions, changes, and progress of the groups he belongs to: synchronous awareness for asynchronous work. There are three classes of components that work together: user agents for collecting and presenting actions to people, meta-information agents …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A grid approach to provide effective awareness to on-line collaborative learning teams",
            "Publication year": 2005,
            "Publication url": "https://www.scienceopen.com/hosted-document?doi=10.14236/ewic/KLGW2005.1",
            "Abstract": "Providing collaborative learning applications the possibility to offer continuous awareness to on-line collaborative learning teams is a challenging issue since it is essential to keep participants informed of both what is happening and what happened in the learning group. Moreover, awareness is the basis to enhance collaboration and improve the individual and group performance since it allows to track and assess the collaborative learning process more objectively and to model students' behavior more efficiently. In order to provide students and tutors with effective awareness, we consider the collaborative actions registered in log files. It is necessary to process large and considerably complex event log files in a constant manner, and thus it may requires processing capacity beyond that of a single computer. To that end, in this paper we show how a Grid approach can considerably decrease the time of processing group activity log files and thus allow students and tutors to be aware of what is going on in the group activity even in real time. Our approach is based on the master-worker paradigm and is implemented using Globus technology running on the Planetlab platform. To test our application, we used event log files from the Basic Support for Collaborative Work (BSCW) system.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient embedding of information and knowledge into CSCL applications",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73011-8_53",
            "Abstract": "This study aims to explore two crucial aspects of collaborative work and learning: the importance of enabling CSCL applications, on the one hand, to capture and structure the information generated by group activity and, on the other hand, to extract the relevant knowledge in order to provide learners and tutors with efficient awareness and support as regards collaboration. To this end, we first identify and define the main types of information generated in on-line group activity and then propose a process for efficiently embedding this information and the knowledge extracted from it into CSCL applications for awareness and feedback purposes. The conceptual model proposed finally gave rise to the design and implementation of a CSCL generic platform, called the Collaborative Learning Purpose Library (CLPL), which serves as a basis for the systematic development of collaborative learning applications and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Using a Story-Driven Board Game to Engage Students and Adults With Cultural Heritage",
            "Publication year": 2021,
            "Publication url": "https://www.igi-global.com/article/using-a-story-driven-board-game-to-engage-students-and-adults-with-cultural-heritage/274327",
            "Abstract": "Serious games are used in the field of cultural heritage as a means to transmit cultural knowledge and enable an experiential contact with cultural content. The authors' aim is to investigate whether a game design exploiting the less used combination of complex storytelling, endogenous cooperation, and competition has the potential to sufficiently convey cultural content. More specifically, through four game interventions, it was investigated how a story-driven board game functions with teenage and adult users alike. A mixed research methodology was followed in all game sessions and data were collected through observation, semi-structured group interviews, and short questionnaires. Findings confirmed the playability of the suggested design and the potential to amuse players while providing learning gains and engagement with cultural content. Nevertheless, further evaluation in formal and non-formal …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:BJbdYPG6LGMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An integrative review of security and integrity strategies in an academic environment: Current understanding and emerging perspectives",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404818301792",
            "Abstract": "The growing scope and changing nature of academic programs provide a challenge to the integrity of testing and examination protocols, prompting academic administrators to re-evaluate the design of learner performance assessment. This article reviews the research on a number of identity and authorship assurance approaches employed to the bolster security of assessment activities. A total of 54 articles, published between 2000 and 2016, were reviewed. Research in the area of learner identity and authorship assurance is important because the award of course credits to unverified entities raises questions over institutional credibility. We argue that learner identity is composed of two distinct layers: physical and behavioral, where identity and authorship are criteria that both need to be confirmed to maintain a reasonable level of academic integrity.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Audience interactivity as leverage for effective learning in gaming environments for dome theaters",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16020-2_36",
            "Abstract": "Informal or free-choice learning has become a well-established means of disseminating knowledge to school classrooms over the last years. Various technology-enhanced public spaces, like science centers and cultural heritage museums, are nowadays equipped with state-of-the-art digital dome theaters, where groups of people (mainly children) attend educational programmes. The overwhelming majority of such ‘shows’ include astronomical phenomena and in few cases cultural heritage. In this paper, we investigate the potential learning benefit of integrating audience interaction with gaming environments in the immersive space of a dome theater. In order to achieve this, we examine how six factors of the Contextual Model of Learning proposed by Falk & Dierking, can be applied in an integrated schema of group interactivity and game design in immersive learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Collaborative learning design within open source e-learning systems: lessons learned from an empirical study",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/collaborative-learning-design-within-open/52922",
            "Abstract": "This chapter addresses a number of serious ‘collaborative learning design’problems faced by adults within the context of e-learning systems and outlines some innovative solutions. Specifically, thirty-three Computer Science students at the Hellenic Open University participated in an experiment aimed at designing collaborative learning courses for Computer Science concepts within MOODLE, a well known open source Learning Management System. The systematic study presented in this chapter argues and specifies that these Prospective Computer Science Professionals (PCSPs) have serious difficulties with the formation of both collaborative learning activities and collaboration procedures, and with realizing them within e-learning settings. The proposed solutions emphasize the design and development of a set of computer-based collaborative patterns reflecting diverse collaboration methods. These patterns …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A methodological approach to networked collaborative learning: Design and pedagogy Issues",
            "Publication year": 2000,
            "Publication url": "https://files.eric.ed.gov/fulltext/ED441078.pdf#page=82",
            "Abstract": "This work presents a report on research carried out in the field of networked collaborative learning. In particular, we present a theory/model-based approach applied to a distance education course that is developed and taught in a virtual learning environment. In this educational practice, our objective has been twofold: first, to improve distance teaching and learning, and second, to facilitate social interaction among students and between tutor and students via the Web. To that end, our research approach has been based on the following actions: First, we analysed the goals, needs, expectations and preferences of our students, based on a previous pilot experience on distance collaborative learning, in order to understand what is actually happening in networked learning when collaboration becomes an integrated part of the whole learning process. Second, we proceeded to the design, development and implementation of a new pedagogical practice, called Virtual Study Group, to encourage and enhance learning through collaborative construction of knowledge and reflective interaction which contribute to a deeper understanding of the course contents. The paper focuses mainly on the latter. Finally, we provide a critical analysis and evaluation of the outcomes of this experience and of the many issues arising from applying this collaborative pedagogical practice to a virtual learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Lancaster University and the University of Sheffield"
        },
        {
            "Title": "A Quantitative Treatment to Data from Computer-Supported Collaboration: An Ontological Approach",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606686/",
            "Abstract": "Collaborative activity performed over specific platforms, designed for such purpose, can provide a deep knowledge about the roles, intentions and effects regarding participants and their interaction among themselves and with the knowledge objects available. This study aims at proposing a structured process for gathering the semantics of the activity hidden behind the raw data collected in log files from CSCL platforms. The proposal is based on exploring the semantic elements (activity awareness) through a social networks analysis (SNA). The main focus of our work is to match different behavioral profiles detected in the collaborative activity from CSCL with the formal profiles identified inside a complex concept-network. This network defines an ontology that describes the behavior expected when collaborating in different scenarios and types of activity. When a certain activity sequence matches with a predefined …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Model for the Efficient Representation and Management of Online Collaborative Learning Interactions",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/42318141/A_Model_for_the_Efficient_Representation20160207-11015-14v6bw1.pdf",
            "Abstract": "This study aims to explore the importance of the efficient representation and management of the event information generated from group activity in online collaborative learning practices so that we can use it to provide awareness about individual and group behaviour. The achievement of this goal first involves the design of a conceptual model of collaborative learning interaction that structures and classifies the information generated in an online collaborative learning situation at several levels of description. This model is then translated into a computational platform that can be used for the systematic construction of collaborative learning applications endowed with enriched capabilities for providing more efficient knowledge management and scaffolding. To test our model we describe the construction of a specific application, a structured forum, to be used in real situations.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A grid prototype implementation for real time processing of group activity log data in collaborative applications",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=16695380572434160959&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting collaborative discussions on asynchronous time: a technological perspective",
            "Publication year": 2011,
            "Publication url": "https://www.raco.cat/index.php/eLearn/article/view/257273",
            "Abstract": "The aim of this paper is to report on an experience of using an innovative on-line learning tool to support real, collaborative learning through discussion in asynchronous time. While asynchronous interaction gives rise to unique opportunities that support active, collaborative learning, unique problems also arise, such as frustration, caused by waiting for other peoples' reactions and feedback and the consequent loss of motivation, which has a negative impact on learning outcomes. In order to alleviate these problems, we focus the asynchronous discussion process on two crucial aspects: First, we provide an appropriate dialogue structure and conversational types that promote meaningful contributions and achieve more effective interaction. Second, we extract relevant knowledge in order to increase the awareness of learners and tutors and give them feedback on what is happening, as well as to monitor the performance and collaboration of learners. The ultimate goal is to increase the motivation, involvement and feeling of",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:tYavs44e6CUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A distributed systems laboratory that helps students accomplish their assignments through self-regulation of behavior",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11423-021-09975-6",
            "Abstract": "Recent research has shown a great interest in supporting self-regulated learning (SRL) strategies in online learning. However, there is hardly any study that has investigated how students’ self-regulation of behavior could be promoted in online environments for programming learning and assessment, despite the proliferation of automated programming evaluation systems. This study examined the ways our online Distributed Systems Laboratory (DSLab) tried to enhance students’ self-regulation of behavior in a real long-term online educational experience. Participants were a sample of 111 university students who performed a programming assignment using DSLab. A customized questionnaire was used to collect data from all students. Our results revealed that DSLab tool managed to enhance students’ self-regulation of behavior to a large extent. Moreover, our study explored the correlation between students …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A five-layer approach in collaborative learning systems design with respect to emotion",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5702108/",
            "Abstract": "This work presents a position paper that first reviews in depth the state of the art in Collaborative Learning Systems design with respect to emotion and then proposes a new conceptual framework that takes into account a five layer approach that considers physiological, emotional, sociological, technological and educational aspects in relation to learning. This study reveals the need for a more situated and affective Computer Supported Collaborative Learning system.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a multi-fold assessment approach to enrich the virtualization of collaborative learning",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6245713/",
            "Abstract": "Collaborative and social learning assessment requires a broad perspective about learning and the involved processes. Assessment processes have a significant effect on CSCL because they engage learners through accountability and constructive feedback. However, in order to design a coherent and efficient assessment system for collaborative and social learning it is necessary to design an enriched learning experience that predisposes the feedback and awareness in the group. A complex set of simultaneously applied assessment approaches, each reinforcing and/or complementing the other is the main tool to enhance collaborative learning and social interaction amongst group members. In this paper, collaborative learning will be developed into a special environment: a Storyboard Learning Object. Collaborative learning using a storyboard may develop partners' collaborative and social abilities and …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using a Grid Platform for Enabling Real Time User Modeling in On-line Campus Proceedings of the CISIS 2007",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=1796485857766584077&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software agents in large scale open e-learning: a critical component for the future of massive online courses (MOOCs)",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7057089/",
            "Abstract": "MOOCs or massive open online courses are a recent trend in online education. They combine online resources with social tools and have unique challenges due to the large number of simultaneous participants. This paper analyzes some of the challenges in the areas of MOOC design, delivery and assessment. Then the authors present an approach using software agents to overcome some of the challenges that have been identified, as well as optimize efficiency, reduce costs, and ensure the pedagogical effectiveness and educational quality of large scale online learning courses. This paper is a first step towards research in the usage of software agents in massive online courses that we hope will shed more light on potential real life applications.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Procedural Learning and Institutional Analytics Framework",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-68318-8_2",
            "Abstract": "Data analyses provide the means for monitoring the quality of academic processes and the means for assessing the fiscal and operational health of an organization. Data-driven decision making can help to empower academic leaders, faculty, and staff with quantitative insights that guide strategies pertaining to enrollment and retention, student support and quality assurance, communication, bullying intervention, academic progress, and academic integrity         . However, the integration of analytics into the institutional context is not a trivial process. Much of the analytics approaches discussed in the literature take a theoretical stance outlining main considerations but lacking the pragmatic edge. Our aim in this chapter is to assist academic leaders in undertaking analytics design and implementation. To this end, we synthesize the existing research and propose a procedural framework for integrating data …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A fuzzy-based approach for classifying students' emotional states in online collaborative work",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7791863/",
            "Abstract": "Emotion awareness is becoming a key aspect in collaborative work at academia, enterprises and organizations that use collaborative group work in their activity. Due to pervasiveness of ICT's, most of collaboration can be performed through communication media channels such as discussion forums, social networks, etc. The emotive state of the users while they carry out their activity such as collaborative learning at Universities or project work at enterprises and organizations influences very much their performance and can actually determine the final learning or project outcome. Therefore, monitoring the users' emotive states and using that information for providing feedback and scaffolding is crucial. To this end, automated analysis over data collected from communication channels is a useful source. In this paper, we propose an approach to process such collected data in order to classify and assess emotional …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards complex collaborative learning objects by the virtualization of collaborative sessions",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=3733055936423353064&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:0KyAp5RtaNEC",
            "Publisher": "press"
        },
        {
            "Title": "Scheduling in Multiprocessor System Using Genetic Algorithms. 7th Computer Information Systems and Industrial Management Applications",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=11351768647334916471&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying the Suitability of Discourse Analysis Methods for Emotion Detection and Interpretation in Computer-Mediated Educational Discourse",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/studying-the-suitability-of-discourse-analysis-methods-for-emotion-detection-and-interpretation-in-computer-mediated-educational-discourse/153473",
            "Abstract": "Conversation analysis (CA) and discourse analysis (DA) methods have been widely used to analyse classroom interaction in conventional educational environments and to some extent in e-learning environments, paying more attention to the'quality'and purposes the discourse serves to accomplish in its specific context. However, CA and DA methods seem to ignore emotion detection and interpretation when analysing learners' interaction in online environments. Effective regulation of emotion, motivation and cognition in social interaction has been shown to be crucial in achieving problem-solving goals. The aim of this chapter is to provide an in-depth study on the possibility of applying discourse analysis methods in e-learning contexts with implications for emotion detection, interpretation and regulation. The result of this study shows whether a comprehensive approach that includes DA methodological solutions …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:ye4kPcJQO24C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Technology-enhanced systems and tools for collaborative learning scaffolding",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-19814-4.pdf",
            "Abstract": "Computer-Supported Collaborative Learning (CSCL) is one of the most influencing research paradigms dedicated to improve teaching and learning with the help of modern information and communication technology. On the one hand, collaborating in small groups may constitute a powerful means for promoting and enhancing learning, work and social interaction. Recent studies of e-learning have pointed out that involving learners in collaborative learning activities could positively contribute to extending and deepening their learning experiences, test out new ideas, improve learning outcomes and increase learner satisfaction, at the same time decreasing the isolation that can occur in an e-learning setting. On the other hand, during task realization, peers learning and working via CSCL technology and methods need guidance and support in order to collaborate effectively and achieve their tasks and learning …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Grid and peer-to-peer middleware for cooperative learning environments",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Thanasis-Daradoumis/publication/280851003_Grid_and_Peer-to-Peer_middleware_for_Cooperative_Learning_Environments/links/561cbfe808aea803672560c8/Grid-and-Peer-to-Peer-middleware-for-Cooperative-Learning-Environments.pdf",
            "Abstract": "This paper presents the work done by the research group of the Open University of Catalonia within the coordinated project towards the definition of adequate grid and peer-to-peer middleware for cooperative learning environments. The main results of our research consist in designing a layered framework for modelling online collaborative learning interactions which in turns leads to the development of a computational platform, called Collaborative Learning Purpose Library (CLPL), that can be used as a basis for the development of Collaborative Learning applications that achieve an efficient event (group activity) information management. To that end, we developed a Grid approach in order to increase the efficiency of processing event log files. Finally, we developed a middleware architecture, called LaCOLLA, that follows the peer-to-peer paradigm and can be used to build collaborative applications that provide general purpose collaborative functionalities while it pays special attention to the autonomy of its members and to self-organization of the components of the infrastructure. All these results were reflected in several publications in international journals, refereed conferences, as well as participations to new European projects.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring semantic description and matching technologies for enhancing the automatic composition of grid based learning services",
            "Publication year": 2007,
            "Publication url": "http://openaccess.uoc.edu/webapps/o2/handle/10609/1431",
            "Abstract": "In the implementation of e-learning frameworks, a problem still  unsolved is how to use and integrate low-level learning services to compose more  complex high-level services or tools that make sense to both tutors and learners. In  that sense semantic description of Grid learning Services appears like a powerful  tool to be used for discovering and matching learning services depending of a set  of parameters inside the learning framework. These parameters must represent  significant functional characteristics of a learning Grid environment formed by a  set of distributed e-learning resources and services. The main objective of this  article is to present a review of existing technologies related with semantic  description and matching and some techniques used at present to provide Grid  Learning Tools and Services automatic composition.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational intelligence for technology enhanced learning",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-11224-9.pdf",
            "Abstract": "In this book is presented up-to-date research on computational intelligence oriented to support technology-enhanced learning systems and processes. Regarding the topics of online work and learning, the book aims at providing both instructors and researchers with new approaches for effective and efficient means to assist elearning participants in enforcing and improving their online learning and working activities–both at individual and group levels. Moreover, the book appeals for providing software developers and researchers in the field of online learning systems with fresh and innovative ideas that allow them to extend current capabilities and functionalities of e-learning platforms. The goal here is to make an efficient use of these e-learning platforms in a distributed environment where learning design and material producers, service providers, and users–either instructors, learners, or academic coordinators …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:F9fV5C73w3QC",
            "Publisher": "Springer"
        },
        {
            "Title": "Towards collaborative complex learning objects by the virtualization of collaborative sessions",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35879-1_41",
            "Abstract": "On-line collaborative learning has demonstrated the benefits of using collaborative activities to increase the learning efficacy. However, collaborative learning approaches cannot be applied in every e-learning experience because they require people’s presence and collaboration, which is frequently difficult to achieve. In addition, collaborative learning resources lack of authentic interactivity, user empowerment and challenge, thus having a negative effect in learner motivation and engagement. To overcome these limitations, we propose a new paradigm named Collaborative Complex Learning Objects (CC-LO) defined as a special type of learning objects within Virtualized Collaborative Sessions (VCS) with the aim to leverage the knowledge elicited during live sessions of collaborative learning, which are augmented with author-generated information, in order to produce interactive and attractive resources …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Virtual Study Groups (VSG), an approach to networked collaborative learning",
            "Publication year": 2000,
            "Publication url": "https://www.learntechlib.org/p/16095/",
            "Abstract": "The Open University of Catalonia (UOC) is a new university model that provides distance learning through a Virtual Campus. With the application of new information and communications technologies, the\" virtual campus\" becomes an alternative to traditional correspondence education. Students are in permanent contact with University services, professors and other students from their own home, via a Virtual Campus and a personal computer. In the distance learning system that UOC offers, students have a wide range of institutional elements to stimulate, guide and help them during their process of learning: counsellors, tutors, and support centres. They also have other common virtual spaces where to pose and solve doubts: the community forum, a space for debates and a classroom forum.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:HE397vMXCloC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "An experimental study on peer selection in a P2P network over PlanetLab",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4346361/",
            "Abstract": "Peer selection is an important aspect in many P2P applications requiring efficient assignment and execution of jobs to peer nodes and search and file transfer, among others. Due to increasing interest of using P2P systems for distributed computing, peer selection is taking relevance and several models have been proposed in the P2P literature. Yet, there are very few experimental studies for peer selection in P2P networks deployed in real large scale networks. In this work we present an experimental study that aims at revealing empirical information about the efficiency of selecting peer nodes in a P2P network when deployed in a real geographically distributed network. To this end, we have used a JXTA-based P2P platform deployed in Planet- Lab, a planetary scale infrastructure, and have empirically evaluated several peer selection models. Our experimental study showed that in order to achieve efficient P2P …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards Collaborative Complex Learning Objects by the Virtualization of Collaborative Sessions. 4th World Summit on the Knowledge Society",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=17208921401417776717&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:tuHXwOkdijsC",
            "Publisher": "Springer"
        },
        {
            "Title": "A conceptual model for grid learning services automatic composition",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-76888-3_20.pdf",
            "Abstract": "This work proposes an initial model for the automatic composition of Grid based learning services based on the semantic capabilities and metadata of e-learning frameworks.There are three principal motivations for Learning Grid Services Composition: build a more powerful service using basic existing services, fulfill service requester’s requirement better, and enhance resource reuse while reducing the cost and time of a new service development.",
            "Abstract entirety": 1,
            "Author pub id": "5oD0RKcAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An ontological structure for gathering and sharing knowledge among scientists through experiment modeling",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/63508",
            "Abstract": "This chapter presents a proposal for modeling/simulating experiments conducted by scientists working in common scientific problems, based on gathering and exploiting knowledge elements produced among them. The authors’ approach enables the adaptation of knowledge structures (bounded to scientific problems) and is based on recurrent refining processes that are fed by indicators, which come from collaboration among the scientists involved. This scheme captures a web-based infrastructure, which allows scientists to collaborate on synthesizing experiments online. The proposed model is approached as an ontology that contains scientific concepts and actions. This ontology is linked to the scientific problem and represents both the “common understanding” for such a problem and the way it could be managed by the group. This dynamic ontology will change its structure according to the collaboration acts …",
            "Abstract entirety": 0,
            "Author pub id": "5oD0RKcAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IGI Global"
        }
    ]
}]