[{
    "name": "Αθανάσιος Γιαννακόπουλος",
    "romanize name": "Athanasios Giannakopoulos",
    "School-Department": "Στατιστικής",
    "University": "aueb",
    "Rank": "Καθηγητής",
    "Apella_id": 17551,
    "Scholar name": "A.N.Yannacopoulos",
    "Scholar id": "Goa2auQAAAAJ",
    "Affiliation": "Professor, National Technical University of Athens, SAMPS, Department of Mechanics",
    "Citedby": 9435,
    "Interests": [
        "Mechanics of Deformable Bodies",
        "Micromechanics",
        "Contact Mechanics",
        "Optomechanics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Goa2auQAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Development of strong surfaces using functionally graded composites inspired by natural teeth—a theoretical approach",
            "Publication year": 2010,
            "Publication url": "https://asmedigitalcollection.asme.org/materialstechnology/article-abstract/132/1/011009/403473",
            "Abstract": "In recent years functionally-graded composites have been proposed to develop strong surfaces that can withstand high contact and frictional forces. The present work presents a new graded composite that can be used for the development of surfaces with excellent strength properties. The composite is inspired by the human teeth, which nature builds as a hard and tough functionally-graded composite. The outer surface of teeth is of enamel, composed of prismatic hydroxyapatite crystallites, whereas the inner part of teeth is of dentine, composed collagen fibrils and hydroxyapatite. Enamel is hard, brittle, and wear resistant, while dentine is softer and flexible. The dentine-enamel junction is formed as a region at which enamel mixes with dentine in a continuous way. The nanomechanical properties of the transition zone have been recently revealed. Of particular interest in this investigation is the variation in the elastic …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Size effects on strength, toughness and fatigue crack growth of gradient elastic solids",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768308001856",
            "Abstract": "The present study investigates the microstructural size effect on the strength of a bar under axial loading, and on the toughness and crack growth of a beam under three-point bending within the framework of strain gradient elasticity. The gradient responses have been found considerably tougher as compared to the classical theory predictions and the observed deviation increases with increasing values of the non-dimensional parameter g/L (microstructural length over structural length). Based on the analytical solution of the strain energy release rate for the three-point bending case, a new, simple and universal, strain gradient elasticity, brittle fracture criterion and a new, size adjusted fatigue crack growth law have been established. Finally, the analytical predictions of the current modeling compare well with previous experimental data, based on three-point bending tests on single-edge notched concrete beams.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Uniformly moving screw dislocation in flexoelectric materials",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753819304309",
            "Abstract": "The anti-plane dynamic flexoelectric problem is stated as a dielectric solid that incorporates gradients of electric polarization and flexoelectricity due to strain gradients. It is shown that the coupling of the mechanical with the electrical problem can be condensed in a single mechanical problem that falls within the area of dynamic couple stress elasticity. Moreover, static and steady state dynamic anti-plane problems of flexoelectric or couple stress elastic materials can be modeled as anisotropic plates with a non-equal biaxial pre-stress. This analogy is materialized in a finite element code. Screw dislocations play prominent role in crystal growth, plasticity, development of thin epitaxial films, micro-components and opto-mechanical devices and are important for our modern understanding of seismology. In general, screw dislocations are treated in the context of anti-plane elasticity. In this work we solve the steady-state …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:a0OBvERweLwC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "The contact problem of a circular rigid punch on piezomagnetic materials",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768306005166",
            "Abstract": "In this project, a general theory for the axisymmetric indentation of piezomagnetic solids by a flat rigid punch is presented within the context of fully coupled linear model, in the absence of friction or adhesion. It is shown that the coupling has a significant effect on the indentation force and the magnetic flux through the contact area. In addition, an experiment on the material Terfenol-D was carried out to confirm the theoretical results.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:J-pR_7NvFogC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Plane asymptotic crack-tip solutions in gradient elasticity",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768309003436",
            "Abstract": "An asymptotic crack-tip solution under conditions of plane strain is developed for a material that obeys a special form of linear isotropic strain gradient elasticity. In particular, an elastic constitutive equation of the form τ= τ (0)-ℓ 2∇ 2 τ (0) is considered, where (τ, ε) are the stress and strain tensors, τ (0)= λ ε kk δ+ 2 μ ε,(λ, μ) are the Lamé constants, and ℓ is a material length. Both symmetric (mode-I) and antisymmetric (mode-II) solutions are developed. The asymptotic solution predicts finite strains at the crack-tip. The mode-I crack-tip displacement field u is of the form u 1= Ax 1+ ℓ r ℓ 3/2 A 1 u˜ 11 (θ, ν)+ A 2 u˜ 12 (θ, ν)+ O (r 2), u 2= Bx 2+ ℓ r ℓ 3/2 A 1 u˜ 21 (θ, ν)+ A 2 u˜ 22 (θ, ν)+ O (r 2), where (x 1, x 2) and (r, θ) are crack-tip Cartesian and polar coordinates, respectively, ν is Poisson’s ratio, and (A, B, A 1, A 2) are dimensionless constants determined by the complete solution of a boundary value problem. The A-and B …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Parametric study of the volume fraction of fibers in 1–3 PZT/Polyurethane piezoelectric composites during indentation",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00150190108225964",
            "Abstract": "The electrical response during indentation of 1–3 PZT/Polyurethane piezoelectric composites containing 25 vol. % PZT-4 and 15–50 vol. % PZT-5H fibers has been investigated. The current (quasistatic charge increment) induced in the indentor due to the polarised layer on the contact surface increases with load as the contact area increases. Excellent agreement was found between the measured currents as a function of load with those predicted using an analytical model. The current increases with increasing indentor diameter as expected. Further, the scatter in data is significantly reduced as the indentor diameter increases. The measured current for a given load increases as the volume fraction of PZT fibers in the composite increases and is larger for composites containing PZT-5H fibers as compared to those containing PZT-4 fibers. In addition, it demonstrates that linear elastic indentation with simultaneous …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:hkOj_22Ku90C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "The use of Knoop indentation for the assessment of the elastic properties of mortars and natural stones",
            "Publication year": 2016,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-2281b58a-2dc4-311a-9f89-6a1c7741994e",
            "Abstract": "The use of Knoop indentation for the assessment of the elastic properties of mortars and natural \nstones × Close The Infona portal uses cookies, ie strings of text saved by a browser on the \nuser's device. The portal can access those files and use them to remember the user's data, \nsuch as their chosen settings (screen view, interface language, etc.), or their login data. By \nusing the Infona portal the user accepts automatic saving and using this information for portal \noperation purposes. More information on the subject can be found in the Privacy Policy and \nTerms of Service. By closing this window the user confirms that they have read the information \non cookie usage, and they accept the privacy policy and the way cookies are used by the \nportal. You can change the cookie settings in your browser. I accept Polski English Login or \nregister account remember me Password recovery INFONA - science communication portal × of …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Suture line response of end-to-side anastomosis: A stress concentration methodology",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s13239-014-0206-6.pdf",
            "Abstract": "End-to-side vascular anastomosis has a considerable complexity regarding the suturing of the juncture line between the artery and the graft. The present study proposes a stress–concentration methodology for the prediction of the stress distribution at the juncture line, aiming to provide generic expressions describing the response of an end-to-side anastomosis. The proposed methodology is based on general results obtained from the analysis of pipe connections, a topic that has been investigated in recent years in the field of offshore structural engineering. A key aspect for implementing the stress–concentration–factor approach is the recognition that the axial load due to pressure and flow dynamics exerted along the graft axis controls the “hot spots” on the juncture line, which in turn affects the mechanical response of the sutures. Several parameters, identified to influence the suture line response, are …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Interface cracks in layered materials subjected to a uniform temperature change",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1010872200886",
            "Abstract": "Elastic and incremental elasto-plastic analyses have been used to evaluate the driving force for interface edge-crack growth initiation in tri-layered material systems subjected to a monotonic variation in temperature. Whenever possible, closed-form solutions are derived as functions of the thermo-mechanical material properties and the geometry of the layers. Analytical expressions for the different critical temperatures at which distinct transitions occur in thermally induced deformation are presented and are correlated with the three regimes of interface fracture; elastic, partially plastic and fully plastic. Furthermore, a large-scale contact model, which predicts the shielding effect of contact in the wake of an interface crack, is also presented and the attendant reduction in the energy release rate is estimated. Finite element results, showing the influence of layer geometry and strain hardening on the energy release …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Dipolar gradient elasticity of cables",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768312000480",
            "Abstract": "The increasing structural use of cables and cable-systems has given rise to a substantial technical literature concerning their static and dynamic response. However, the majority of these works is based on classical elasticity theory, according to which the rigidity of the cable is neglected. The present work re-examines in detail the behavior of steel cables under in-plane loading, taking into account the effect of the material microstructure on the overall stiffness, on the basis of the well-established simplified gradient elasticity theory. Accounting for two-dimensional deformations the generalized equilibrium equations under dipolar action are assessed and the corresponding boundary value problem is solved. Numerical results obtained for a characteristic cable segment indicate a much stiffer behavior than the one predicted by classical elasticity theory. This phenomenon is observed in the rod or cable-actuated braking …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Fracture experiments and flexoelectric response of PVDF",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mdp2.150",
            "Abstract": "Polyvinylidene fluoride (PVDF) is tested using single edge notch tensile (SENT) specimens under mode I and plane stress conditions. The novel aspect of the testing is the use of electrodes attached close to the crack tip which measured an electric potential. The electric potential was analyzed with a flexoelectric model that related the electric potential with the mechanical dilatation due to the stresses close to the crack tip.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of hyperelastic material properties based on instrumented indentation",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=60ycBwAAQBAJ&oi=fnd&pg=PA153&dq=info:s8XS4JIXryQJ:scholar.google.com&ots=yOsFU-TczS&sig=N4WZB9q2cno9hSQ0UhZMGweewBA",
            "Abstract": "It is well known that instrumented indentation tests are useful tools in probing mechanical properties of materials such as metals and ceramics. Instrumented indentation of hyperelastic materials such as rubbers, bio-materials, tissues etc. has not been examined in depth, especially the inverse problem of material characterization from instrumented indentation response. The difficulty of the inverse problem for such materials is that the unknown property is a function, the elastic energy density function. There are several such functions and each function is often characterized by more than one parameter. If the maximum indentation depth is low, we have shown that instrumented indentation of initially unstretched hyperelastic materials can only resolve a combination of the material parameters. If the maximum indentation depth is high, the indentation can provide independent material properties, however not in a unique way. Moreover, high indentation loads could lead to surface puncturing and so blur the test results. In this work, we show that we can use spherical indentation of a substrate at different but known prestretch levels to obtain the involved material properties of the energy density function. The present methodology can also incorporate a limit energy failure criterion and instrumented indentation can incorporate this behavior which we may call indentation strength.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:3fE2CSJIrl8C",
            "Publisher": "WIT Press"
        },
        {
            "Title": "Indentation of plastically graded substrates by sharp indentors",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768302001105",
            "Abstract": "The present paper investigates the indentation of plastically graded substrates by sharp indentors. Contact analysis of plastically graded surfaces can be particularly useful in the design of load-bearing devices such as gears, rollers and electric contacts found in many macro- and micro-electro-mechanical systems. Substrates made of plastically graded materials are often encountered in nature or are artificially produced as a result of chemical and/or physical surface treatments. The variation of the plastic properties depends on micro-structural or compositional changes of the material with depth. The analysis of indentation of plastically graded substrates by sharp indentors provide the load-penetration response, as well as the strains and stresses inside the substrate, at maximum loading and at complete unloading. The parametric analysis of the solutions enables the direct correlation of the plastic properties and …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Parametric control of self-sustained and self-modulated optomechanical oscillations",
            "Publication year": 2021,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.103.053513",
            "Abstract": "Optomechanical systems are known to exhibit a rich set of complex dynamical features including various types of chaotic behavior and multistability. Although this exotic behavior has attracted intense research interest, the utilization of optomechanical systems in technological applications in most cases necessitates a complex, yet predictable and controllable oscillatory response. In fact, the various types of robust oscillations supported by optomechanical systems are nested in either the same or neighboring regions of the parameter space, where chaos exists. In this work we systematically dissect the parameter space of the fundamental optomechanical oscillator in order to identify regions where stable self-sustained and self-modulated oscillations exist, by utilizing bifurcation analysis and advanced numerical continuation techniques. Moreover, in cases where bistability occurs, we study the accessibility of these …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:UHK10RUVsp4C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Left Atrium (LA)",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TqnFCgAAQBAJ&oi=fnd&pg=PA202&dq=info:9MzwmMrz4soJ:scholar.google.com&ots=eKVSWTRk5f&sig=7gyYJr_ZEBUOU2juhz7_0vSXvCM",
            "Abstract": "The heart is the pumping station of the human body. It has the size of a clenched first, is conically shaped and is a hollow muscular organ [1]. The left-side of the heart, is a self-contained pump which drives the oxygen-rich blood into the aortic semilunar outer valve. It does most of its work at high pressure to drive blood through the entire systemic circulation to every location of the body. The heart is divided into the aortic and the ventricle, Fig.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:1qzjygNMrQYC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Finite Element Analysis of Discrete Circular Dislocations (vol 60, pg 181, 2010)",
            "Publication year": 2014,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/26202",
            "Abstract": "Finite Element Analysis of Discrete Circular Dislocations (vol 60, pg 181, 2010) Toggle navigation \nEnglish Ελληνικά Deutsch français italiano español Ελληνικά English Ελληνικά Deutsch français \nitaliano español Σύνδεση Toggle navigation Προβολή τεκμηρίου Ιδρυματικό Αποθετήριο \nΠανεπιστημίου Θεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) Δημοσιεύσεις σε \nπεριοδικά, συνέδρια, κεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Ιδρυματικό Αποθετήριο \nΠανεπιστημίου Θεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) Δημοσιεύσεις σε \nπεριοδικά, συνέδρια, κεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Όλο το DSpace Κοινότητες & \nΣυλλογές Ανά ημερομηνία δημοσίευσης Συγγραφείς Τίτλοι Λέξεις κλειδιά Finite Element Analysis \nof Discrete Circular Dislocations (vol 60, pg 181, 2010) Thumbnail Συγγραφέας Baxevanakis, \nKP; Giannakopoulos, AE Ημερομηνία 2014 Λέξη-κλειδί Engineering, Multidisciplinary , :…",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Functionally-graded materials and the engineering of tribological resistance at surfaces",
            "Publication year": 2003,
            "Publication url": "https://patents.google.com/patent/US6641893B1/en",
            "Abstract": "An article is provided that is highly resistant to localized normal indentation, or indentation tensile stresses, against its surface. The article is a stacked array of at least five layer units each having local anisotropy in at least one direction. Each unit has an adjacent unit that differs in a mechanical property, or offset in principle axis of anisotropy by less than 45. The article forms part of a construction constructed and positioned to withstand indentation, or contact damage, detrimental to its use having a component normal to any tangent of the surface. The article can be a stacked array of fiber-reinforced polymeric material, ie, prepreg, with the fiber direction offset from each layer to the next by less than 45. Methods of making the article and methods of use of the article to resist impact are provided. Also provided are articles having surfaces, the surfaces being constructed and arranged to withstand sliding contact stress …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Derivation of strain gradient length via homogenization of heterogeneous elastic materials",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167663612001652",
            "Abstract": "We present explicit upper bound estimates of the microstructural length used in simple gradient elasticity. Our model is a two dimensional composite made of circular hard inclusions randomly dispersed in a soft matrix. Both inclusions and matrix are described by isotropic linear elastic constitutive laws. The composite, however, is described by an isotropic gradient elastic law. The elastic modulus and the Poisson’s ratio are given by the exact classic analysis of Christensen. The in-plane microstructural length is estimated by energy optimization, based on solutions of the gradient elastic hollow cylinder. It was shown that the microstructural length decreases with the composition of the particles, taking high values at low particle composition. Naturally, the microstructural length is proportional to the particle diameter and increases with the stiffness of the particles. It was shown that there can be no microstructural …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The adhesive contact of a flat punch on a hyperelastic substrate subject to a pull-out force or a bending moment",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167663610001559",
            "Abstract": "In the last decade, instrumented macro- and nano-indentation tests have become useful tools for probing mechanical properties of materials. In this context, little in-depth work has been done for soft bio-materials like biofilms, tissues, gels, cells, etc. Such materials show large elastic strains when subjected to relatively fast loading (excluding viscoelastic phenomena). The present work focuses on the adhesive contact of such materials. Flat punches of circular imprint are used and are subjected to pullout normal forces or bending moments. The materials are modeled as hyperelastic (fast-testing conditions), using the Mooney–Rivlin (M–R) strain energy density function. We examine both incompressibility and compressibility issues. The contact problem of half-space materials interacting with rigid indenters is solved explicitly for moderate deformations and is compared with finite element results. Experiments are …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Similarities of stress concentrations in contact at round punches and fatigue at notches: implications to fretting fatigue crack initiation",
            "Publication year": 2000,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=1483417",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An indentation methodology for measuring the elastic properties of biological patches used in human carotid endarterectomy",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2452321618300520",
            "Abstract": "Carotid endarterectomy (CEA) is one of the approaches available for the treatment of atherosclerosis, a common carotid artery disease. Patch angioplasty is the pertinent technique mostly preferred by vascular surgeons. It entails an arteriotomy followed by closure with a textile, polymer or biological tissue patch. We propose a novel indentation methodology as a technique for mechanically characterizing biological patches used in carotid artery repair. The proposed methodology is a simple, yet accurate one, requiring only one initial experimental measurement to support the relevant calculations. Bovine pericardium patches are indented herein. Results, including material properties, are then obtained analytically. The experimental results indicate that indentation is a reliable method to assess the elastic properties of bovine patches. The modulus of elasticity and relevant indentation metrics are obtained for two …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The use of Knoop indentation for the assessment of the plastic properties of mortars and natural stones",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1365160916304038",
            "Abstract": "The present work investigates the Knoop hardness of rocks and other pressure sensitive materials. We tested ten different types of rocks, a cement paste, and PMMA. We also analyzed existing experimental results for Mg-PSZ (magnesia-partially stabilized zirconia) and P b 40 N i 40 P 20 metal glass. We performed finite element indentation analysis for three types of material models: Mohr-Coulomb (associative), Drucker Prager (associative and non-associative), and foam-type. The material models assumed isotropic elasticity (with low elastic strains) and no strain-hardening effects. We compared our analytical results with our experimental results using material data from the literature. We found that different materials can be best described by either the Mohr-Coulomb or Drucker-Prager models. Highly porous materials showed unreasonably high Knoop hardness, raising questions on how their surface can be …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Method and apparatus for determining preexisting stresses based on indentation or other mechanical probing of a material",
            "Publication year": 2000,
            "Publication url": "https://patents.google.com/patent/US6155104A/en",
            "Abstract": "Provided are methods and apparatus for determining from indentation testing the preexisting stress and/or effective strain in a section of a material. The invention also provides methods and apparatus for determining the variation of the stress with depth in the material (eg the gradient). According to the invention, first data are provided from an indentation test of the stressed (or strained) section. The stress (or effective strain) can then be determined from the first data and from second data characteristic of the material, such as a stress-strain curve. Second data can also be obtained from an additional indentation test of a section having a known stress. The methods provided herein are suitable for programming on a general purpose computer or calculator.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Study on the dynamic behavior of arterial end-to-end anastomosis",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_261",
            "Abstract": "Vascular disorders, such as atherosclerosis and aneurysms are treated by vascular surgery operations, and involve the stitching of disconnected human arteries with themselves or with artificial grafts. Stitching techniques and related suture materials are of great importance. The aim of this study is to assess the mechanical behavior of the connecting region of two, initially separated, human arteries (end-to-end anastomosis) and to provide useful design parameters for a large number of problems, with different geometrical and mechanical properties.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An example of double forces taken from structural analysis",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768305002349",
            "Abstract": "The classic Bernoulli–Euler beam is revisited in relation to the Timoshenko beam, using a T-type cross-section. A practical example of double forces is worked out, where the double forces appear due to the shearing of the horizontal flange of the T-section. It is shown that a non-local estimate of the mean value of the vertical deflection of the beam leads to a shear gradient that is energetically consistent with the double force. Therefore, an additional energy term that includes the derivative of the beam’s curvature leads to a consistent non-local beam model, simple enough to be used in structural analysis. Such beam models are useful in micro- and nano-technology. Moreover, this simple example opens the discussion for the importance of non-local differentiation in the averaging theories of Mechanics.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:738O_yMBCRsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Finite element analysis of discrete edge dislocations: Configurational forces and conserved integrals",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768315000360",
            "Abstract": "We present a finite element description of Volterra dislocations using a thermal analogue and the integral representation of dislocations through stresses in the context of linear elasticity. Several analytical results are fully recovered for two dimensional edge dislocations. The full fields are reproduced for edge dislocations in isotropic and anisotropic bodies and for different configurations. Problems with dislocations in infinite medium, near free surfaces or bimaterial interfaces are studied. The efficiency of the proposed method is examined in more complex problems such as interactions of dislocations with inclusions, cracks, and multiple dislocation problems. The configurational (Peach–Koehler) force of the dislocations is calculated numerically based on energy considerations (Parks method). Some important integral conservation laws of elastostatics are considered and the connection between the material forces …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:8AbLer7MMksC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Depth sensing indentation and methodology for mechanical property measurements",
            "Publication year": 2001,
            "Publication url": "https://patents.google.com/patent/US6247355B1/en",
            "Abstract": "An indentation measurement apparatus is retrofittable onto any of a variety of load-applying frames and includes a mount for mounting an indenter of any geometry (for example blunt or sharp). The arrangement is very stiff and mechanical values including Young's modulus, strain hardening exponent, yield strength, and hardness can be obtained from a single load/unload versus displacement test. A wide variety of materials can be tested using the apparatus. An optical probe can measure displacement of the indenter head relative to a sample.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Steady-state antiplane crack considering the flexoelectrics effect: surface waves and flexoelectric metamaterials",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00419-020-01815-y",
            "Abstract": "The antiplane dynamic flexoelectric problem is stated as a dielectric solid that incorporates gradients of electric polarization and flexoelectricity due to strain gradients. The work examines dielectric materials without piezoelectric coupling or nonlinear ferroelectric switching and considers the inverse flexoelectric effect. It is shown that the coupling of the mechanical with the electrical problem can be condensed in a single mechanical problem that falls in the area of dynamic couple stress elasticity. Moreover, static and steady state dynamic antiplane problems of flexoelectric and couple stress elastic materials can be modeled as anisotropic plates with a non-equal biaxial pre-stress. This analogy was materialized in a finite element code. In this work, we solved the steady-state problem of a semi-infinite antiplane crack located in the middle of an infinite flexoelectric material, with its crack-tip moving with constant …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "WITHDRAWN: The adhesive contact of a flat punch on a rubber-like substrate subject to a pull-out force or a bending moment. Part II: Experiments",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167663612000373",
            "Abstract": "The Publisher regrets that this article is an accidental duplication of an article that has already been published, doi:10.1016/j.mechmat.2010.11.002. The duplicate article has therefore been withdrawn.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Structural analysis of gradient elastic components",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768306004069",
            "Abstract": "The present study investigates the size effects in the problems of cantilever beam bending and cracked bar tension within the gradient elasticity framework. Analytical solutions for metrics that characterize both the normalized stiffness and toughness are derived. It is found that the gradient elastic beam exhibits a significantly stiffer but also more brittle response, while the gradient cracked bar exhibits considerable toughening. These results compare well with respective finite element computations.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:KxtntwgDAa4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Dynamic behavior of suture-anastomosed arteries and implications to vascular surgery operations",
            "Publication year": 2015,
            "Publication url": "https://biomedical-engineering-online.biomedcentral.com/articles/10.1186/1475-925X-14-1",
            "Abstract": "Routine vascular surgery operations involve stitching of disconnected human arteries with themselves or with artificial grafts (arterial anastomosis). This study aims to extend current knowledge and provide better-substantiated understanding of the mechanics of end-to-end anastomosis through the development of an analytical model governing the dynamic behavior of the anastomotic region of two initially separated arteries. The formulation accounts for the arterial axial-circumferential deformation coupling and suture-artery interaction. The proposed model captures the effects of the most important parameters, including the geometric and mechanical properties of artery and sutures, number of sutures, loading characteristics, longitudinal residual stresses, and suture pre-tensioning. Closed-form expressions are derived for the system response in terms of arterial radial displacement, anastomotic gap, suture tensile force, and embedding stress due to suture-artery contact interaction. Explicit objective functionalities are established to prevent failure at the anastomotic interface. The mathematical formulation reveals useful interrelations among the problem parameters, thus making the proposed model a valuable tool for the optimal selection of materials and improved functionality of the sutures. By virtue of their generality and directness of application, the findings of this study can ultimately form the basis for the development of vascular anastomosis guidelines pertaining to the prevention of post-surgery implications.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:NaGl4SEjCO4C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Discrete and continuous deformation during nanoindentation of thin films",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645400000094",
            "Abstract": "This paper describes nanoindentation experiments on thin films of polycrystalline Al of known texture and different thicknesses, and of single crystal Al of different crystallographic orientations. Both single-crystalline and polycrystalline films, 400–1000 nm in thickness, are found to exhibit multiple bursts of indenter penetration displacement, h, at approximately constant indentation loads, P. Recent results from the nanoindentation studies of Suresh et al. (Suresh, S., Nieh T.-G. and Choi, B.W., Scripta mater., 1999, 41, 951) along with new microscopy observations of thin films of polycrystalline Cu on Si substrates are also examined in an attempt to extract some general trends on the discrete and continuous deformation processes. The onset of the first displacement burst, which is essentially independent of film thickness, appears to occur when the computed maximum shear stress at the indenter tip approaches the …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "STEADY-STATE ANTI-PLANE CRACKS IN FLEXOELECTRIC MATERIALS",
            "Publication year": 2019,
            "Publication url": "http://poznan.pan.pl/wp-content/uploads/2019/10/BoA-GGP-2019.pdf#page=11",
            "Abstract": "The anti-plane dynamic flexoelectric problem is stated as a dielectric solid that incorporates gradients of electric polarization and flexoelectricity due to strain gradients. It is shown that the coupling of the mechanical with the electrical problem can be condensed in a single mechanical problem that falls in the area of dynamic couple stress elasticity. Moreover, static and steady state dynamic anti-plane problems of flexoelectric and couple stress elastic materials can be modelled as anisotropic plates with a non-equal biaxial pre-stress.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Poznan University of Technology, Poland 2019"
        },
        {
            "Title": "Conical indentation of incompressible rubber-like materials",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768308004824",
            "Abstract": "In the last decade, the indentation test has become a useful tool for probing mechanical properties of small material volumes. In this context, little has been done for rubber-like materials (elastomers), although there is pressing need to use instrumented indentation in biomechanics and tissue examination. The present work investigates the quasi-static normal instrumented indentation of incompressible rubber-like substrates by sharp rigid cones. A second-order elasticity analysis was performed in addition to finite element analysis and showed that the elastic modulus at infinitesimal strains correlates well with the indentation response that is the relation between the applied force and the resulting vertical displacement of the indentor’s tip. Three hyperelastic models were analyzed: the classic Mooney–Rivlin model, the simple Gent model and the one-term Ogden model. The effect of the angle of the cone was …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Structural analysis using a dipolar elastic Timoshenko beam",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753812001519",
            "Abstract": "In recent years, several non-local beam theories have emerged in trying to model stiffness and strength phenomena observed in micro-beams used in micro-mechanical systems (MEMS) and sensors. Of particular importance are the theories that treat in a unified way both long and short beams, through Timoshenko beam kinematics. At the same time and in combination with experiments, beam models have been used to estimate material lengths that are necessary for the assessment of non-local elasticity theories. Aside from the particular details of the non-local assumptions used, boundary conditions play a considerable role in such problems, especially the non-classical boundary conditions that are required by the non-local theories. It is astonishing how few and simple beam configurations have been presented so far. They fall in the category of statically determinate beams and their key results are often given in …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:k_IJM867U9cC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Strength analysis of spherical indentation of piezoelectric materials",
            "Publication year": 2000,
            "Publication url": "https://asmedigitalcollection.asme.org/appliedmechanics/article-abstract/67/2/409/447181",
            "Abstract": "The present paper deals with theoretical and computational analysis of quasi-static, normal indentation of a transversely isotropic, linear elastic, piezoelectric half-space by a rigid spherical indenter. The contact is axisymmetric, nonconforming, monotonically advancing with load, frictionless and adhesionless. The indenter was modeled either as perfect conductor or as perfect insulator. The mechanical and electrical fields below the surface were examined. The issues of mechanical and dielectric strength due to indentation were examined using Weibull statistics of surface imperfections. The particular cases of PZT-4, PZT-5A,  and Ba0.917Ca0.083TiO3 indented by rigid punches having either zero electrical potential or zero electric charge were solved with finite element analysis. [S0021-8936(00)02502-2]",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Relation of the Vickers Hardness With the Loading Stiffness of Instrumented Vickers Indentation of Metal Substrates",
            "Publication year": 2010,
            "Publication url": "https://asmedigitalcollection.asme.org/materialstechnology/article-abstract/132/3/034501/384998",
            "Abstract": "The present paper presents a relation between the vickers hardness HV and the loading stiffness C of instrumented vickers indentation of metal substrates. The relation is based on the fact that the nonaxisymmetry of the plastic deformation of the vickers indenter leaves the corners of the indentation imprint at the surface of metal substrates after complete unloading. This relation can transform available HV data for metals to C data. It is also shown that the strain hardening details are important in the estimation of material properties and investigators should be cautions when using power-law strain hardening in all cases.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:rO6llkc54NcC",
            "Publisher": "American Society of Mechanical Engineers Digital Collection"
        },
        {
            "Title": "A quasi-continuum multi-scale theory for self-diffusion and fluid ordering in nanochannel flows",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10404-014-1390-2.pdf",
            "Abstract": "We present a quasi-continuum self-diffusion theory that can capture the ordering effects and the density variations that are predicted by non-equilibrium molecular dynamics (NEMD) in nanochannel flows. A number of properties that affect fluid ordering in NEMD simulations are extracted and compared with the quasi-continuum predictions. The proposed diffusion equation requires the classic diffusion coefficient D and a micro structural internal length g that relates directly to the shape of the molecular potential of the NEMD calculations. The quasi-continuum self-diffusion theory comes as an alternative to atomistic simulation, bridging the gap between continuum and atomistic behavior with classical hydrodynamic relations and reduces the computational burden as compared with fully atomistic simulations.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Gradients in elastic modulus for improved contact-damage resistance. Part I: The silicon nitride–oxynitride glass system",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645401002002",
            "Abstract": "Silicon nitride (Si3N4)-based graded materials were fabricated with controlled, unidirectional gradients in elastic modulus from the surface to the interior. This was accomplished by infiltrating a low modulus silicon oxynitride glass into a dense, higher modulus, Si3N4 ceramic. Elastic Hertzian indentation (spherical indenter) experiments were performed on both the graded and the monolithic Si3N4. While Hertzian indentation of the monolithic ceramic resulted in classical cone cracks, such cracks were completely suppressed in the graded materials at comparable load levels, despite the lower strength and lower toughness of the surface layer comprising glass. Finite element analysis (FEA) of the stresses associated with the indentation was also performed to gain insight into the mechanism for the enhanced contact damage resistance in the graded materials. The computational analysis revealed that the maximum …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Finite element analysis of Volterra dislocations in anisotropic crystals: A thermal analogue",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s00419-006-0065-1",
            "Abstract": "The present work gives a systematic and rigorous implementation of Volterra dislocations in ordinary two-dimensional finite elements using the thermal analogue and the integral representation of dislocations through the stresses. The full fields are given for edge dislocations in anisotropic crystals, and the Peach–Koehler forces are found for some important examples.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Fatigue of textiles used in vascular surgery: Application to carotid endarterectomy",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S175161612030669X",
            "Abstract": "Fatigue is a material-based phenomenon playing a significant role in the mechanical behavior of components and structures. Although fatigue has been well studied for traditional materials, such as metals, its underlying mechanisms are not thoroughly understood in novel applications such as the case of textiles used as patches to close the arteriotomy in carotid endarterectomy. The latter is a type of vascular surgery for the treatment of carotid artery disease in which after an arteriotomy and removal of atherosclerotic plaque closure is made with a patch sutured on the artery. Completion of the operation signals the initiation of complex mechanical and hemodynamic phenomena. Fatigue performance of the patch eventually determines the successful outcome of carotid endarterectomy. In this study, we evaluate with a two-fold approach the mechanics of patch angioplasty in carotid endarterectomy. First, an analytical …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A finite element approach for the analysis of variable core dislocations",
            "Publication year": 2018,
            "Publication url": "https://repository.lboro.ac.uk/articles/A_finite_element_approach_for_the_analysis_of_variable_core_dislocations/9552758/1",
            "Abstract": "A finite element description of variable core edge dislocations in the context of linear elasticity is presented in this work. The approach followed is based on a thermal analogue and the integral representation of dislocations through stresses. The objective of a variable core defect concept is to eliminate the stress singularity experienced at the dislocation core. This is accomplished assuming that the displacement discontinuity is achieved gradually over some distance. To implement this concept in a finite element scheme, we first model purely rotational crystal defects considering an appropriate pseudo-temperature distribution, which produces a dislocation array of increasing width. Accordingly, we simulate a discrete edge dislocation of linearly increasing width. This description of dislocation core is closer to experimental observations and has a physically anticipated behaviour reproducing the Volterra dislocation away from the core. Further, interactions of variable core dislocations with free boundaries and coupled dislocation partials are investigated. In all cases, we recover the analytical solutions for the stress distributions and the total strain energy",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:t6usbXjVLHcC",
            "Publisher": "Loughborough University"
        },
        {
            "Title": "Modeling of facesheet crack growth in titanium–graphite hybrid laminates, Part I",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0013794402000863",
            "Abstract": "Experimental observations have indicated that in titanium–graphite hybrid laminates, fatigue cracks in the titanium facesheets initiate at free edges as well as in areas of high stress concentration, such as holes and notches. In addition, a delaminated region between the facesheet and the intact plies develops and propagates in the wake of the facesheet crack. This paper investigates different modeling techniques for predicting the coupled damage growth. Two modeling approaches were applied; a two-dimensional bridged-crack (BC) model and the virtual crack closure technique (VCCT). The VCCT was applied in two and three-dimensional finite element models and the trends were shown to be the same for both cases. However, the trends predicted using the VCCT are significantly different than the BC model. The reasons for the discrepancies are discussed. The model predictions are compared to experimental …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Transport properties of fluids in nanochannels: bridging nano to macro",
            "Publication year": 2011,
            "Publication url": "https://bura.brunel.ac.uk/handle/2438/6749",
            "Abstract": "A method of calculating transport properties in nanochannels is presented in this work. The Molecular Dynamics simulation of a system of liquid argon flowing in a nanochannel formed by krypton walls was the basis for our analysis concerning transport properties and specifically diffusion coefficient, shear viscosity and thermal conductivity. It is shown that for confined systems, such as nanochannels, if one of the transport properties is known, then the others can be estimated. The simulation results reveal that all properties approach bulk values at relatively small channel widths, at about 6-7nm. Below this critical point, the wall effect on fluid atoms is strong and the transport properties change dramatically. In order to extend the calculations over rough-wall nanochannels, we apply the relation extracted for flat wall channels to channels with walls consisted of successive rectangular protrusions and cavities.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Brunel University"
        },
        {
            "Title": "Development of strong surfaces using functionally graded composites inspired by natural teeth—finite element and experimental verification",
            "Publication year": 2010,
            "Publication url": "https://asmedigitalcollection.asme.org/materialstechnology/article-abstract/132/1/011010/403493",
            "Abstract": "Functionally graded materials (FGMs) are composite materials that exhibit a microstructure that varies locally in order to achieve a specific type of local material properties distribution. In recent years, FGMs appear to be more interesting in engineering application since they present an enhanced performance against deformation, fracture, and fatigue. The purpose of the present work is to present evidence of the excellent strength properties of a new graded composite that is inspired by the human teeth. The outer surface of the teeth exhibits high surface strength while it is brittle and wear resistant, whereas the inner part is softer and flexible. The specific variation in Young’s modulus along the thickness of the presented composite is of particular interest in our case. The present work presents a finite element analysis and an experimental verification of an actual composite with elastic modulus that follows …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:tkaPQYYpVKoC",
            "Publisher": "American Society of Mechanical Engineers Digital Collection"
        },
        {
            "Title": "Rolling contact fatigue of rails",
            "Publication year": 2013,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/28319",
            "Abstract": "Rolling contact fatigue (RCF) has been of increasing concern in the recent years regarding the safe operation of high-speed railway track with high traffic intensity. The present paper summarizes the results of an on-going investigation of RCF damage encountered in the Athens Metro. The objective of the investigation has been to determine the initiation and propagation of RCF cracks and to determine their geometrical characteristics. A thorough metallographic investigation of track regarding shelling and spalling defects showed the development of a subsurface network of cracks. An analysis of the Hertzian stress field was employed in order to determine the conditions for first yield and shakedown limits as a function of loading conditions.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applications of fracture mechanics in fretting fatigue life assessment",
            "Publication year": 2000,
            "Publication url": "https://www.astm.org/DIGITAL_LIBRARY/STP/PAGES/STP14723S.htm",
            "Abstract": "Models based on fracture mechanics are developed in order to describe crack growth in fretting fatigue. Particular attention is given to a recently developed model, the ‘Crack Analogue’in which certain aspects of equivalence are recognized between contact mechanics and fracture mechanics. Here, an analogy is invoked between the sharp edged contact region between two contacting surfaces and the geometry of the near-tip regions of a double edge-cracked plate. Based on this approach, a new life prediction methodology is developed for fretting fatigue.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:ufrVoPGSRksC",
            "Publisher": "ASTM International"
        },
        {
            "Title": "Transport properties and structure of fluids in hydrophobic/hydrophilic nanochannels",
            "Publication year": 2014,
            "Publication url": "https://bura.brunel.ac.uk/handle/2438/9288",
            "Abstract": "When downsizing towards the nanoscale, system dimensions have been found to affect channel flows mainly because of the presence of the walls that interact strongly with fluid particles. Parameters which are not taken into account at the classical theory continuum theory at the macroscale, should be taken into account at the nano or even micro-scale where the surface to volume ratio increases significantly. Such property is the wall/fluid interaction which determines the wetting (hydrophilic behavior) or not (hydrophobic behavior) of a surface. We first investigate the effect of wall/fluid interaction on fluid atom distribution near the wall through the radial distribution function and, next, we calculate the three most important fluid transport properties, i.e., the diffusion coefficient, shear viscosity and thermal conductivity. Transport properties seem to be affected significantly in the channel region adjacent to the wall.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:isC4tDSrTZIC",
            "Publisher": "Brunel University London"
        },
        {
            "Title": "Pretwisted beam subjected to thermal loads: A gradient thermoelastic analogue",
            "Publication year": 2017,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/01495739.2017.1308810",
            "Abstract": "It is well known from the classical torsion theory that the cross section of a prismatic beam subjected to end torsional moments will rotate and warp in the longitudinal direction. Rotation is depicted through the angle of twist per unit length and depends in general on the position along the length of the beam, while the warping function addresses the longitudinal distortion of the unrotated cross sections. In the present study, we consider a prismatic beam that possesses an initial twist which is constant along its length. A thermal field is present along the beam and its ends are loaded with axial forces and torsional moments. The governing equilibrium equations and the corresponding boundary conditions were obtained using an energy variational statement. A one-dimensional gradient thermoelastic analogue is developed. The advantageous aspect of the present study is that the additional (and peculiar) boundary …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:dshw04ExmUIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Investigation of rolling contact fatigue cracks in a grade 900A rail steel of a metro track",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1460-2695.2006.01048.x",
            "Abstract": "Rolling contact fatigue (RCF) has been of increasing concern in the recent years in respect of the safe operation of high‐speed railway track with high traffic intensity. The present paper summarizes the results of the first investigation of RCF damage encountered in the Athens Metro. The objective of the investigation was to determine the initiation and propagation of RCF cracks and to determine their geometrical characteristics.A thorough metallographic investigation of track regarding shelling and spalling defects showed the development of a subsurface network of cracks. An analysis of the Hertzian stress field was used to determine the conditions for first yield and shakedown limits as a function of loading.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:Se3iqnhoufwC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Analysis of Knoop indentation",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768310003343",
            "Abstract": "Knoop indentation tests have long been a standard method for material characterization due to the fact that they provide an easy, inexpensive non destructive and objective method of evaluating basic properties from small volumes of materials. In spite of the broad use, Knoop indentation has never been analysed and its methodology is basically empirical. The present work presents an extensive finite element study on the adhesionless contact of flat surfaces by Knoop indenter. The aim of this work is to explore the theoretical foundation for the commonly used Knoop test and shed light to the interesting details that make the Knoop test so useful and simple. Both elastic and elastoplastic responses are explored. The material of the contacting solid is modeled as homogeneous and isotropic. The effect of the Coulomb friction at the contact region is also considered. Subsequently, the computational results presented in …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Variational analysis of gradient elastic flexural plates under static loading",
            "Publication year": 2010,
            "Publication url": "http://ikee.lib.auth.gr/record/228031",
            "Abstract": "Gradient elastic flexural Kirchhoff plates under static loading are considered. Their governing equation of equilibrium in terms of their lateral deflection is a sixth order partial differential equation instead of the fourth order one for the classical case. A variational formulation of the problem is established with the aid of the principle of virtual work and used to determine all possible boundary conditions, classical and non-classical ones. Two circular gradient elastic plates, clamped or simply supported at their boundaries, are analyzed analytically and the gradient effect on their static response is assessed in detail. A rectangular gradient elastic plate, simply supported at its boundaries, is also analyzed analytically and its rationally obtained boundary conditions are compared with the heuristically obtained ones in a previous publication of the authors. Finally, a plate with two opposite sides clamped experiencing cylindrical …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Uniformly moving antiplane crack in flexoelectric materials",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753820305246",
            "Abstract": "The antiplane dynamic flexoelectric problem is stated as a dielectric solid that incorporates gradients of electric polarization and flexoelectricity due to strain gradients. It is shown that the coupling of the mechanical with the electrical problem can be condensed in a single mechanical problem that falls in the area of dynamic couple stress elasticity. Moreover, static and steady state dynamic antiplane problems of flexoelectric and couple stress elastic materials can be modeled as anisotropic plates with a non-equal biaxial pre-stress. This analogy was materialized in a finite element code. In this work we solved the steady-state problem of a semi-infinite antiplane crack located in the middle of an infinite flexoelectric material, with its crack-tip moving with constant velocity. The particular type of loading investigated serves to relate the present solutions with known results from classic elasto-dynamics. We investigated the …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Erratum: Finite element analysis of discrete circular dislocations (CMES (2010) 60: 2 (181-198))",
            "Publication year": 2014,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/26203",
            "Abstract": "Erratum: Finite element analysis of discrete circular dislocations (CMES (2010) 60: 2 (181-198)) \nToggle navigation English Ελληνικά Deutsch français italiano español Ελληνικά English \nΕλληνικά Deutsch français italiano español Σύνδεση Toggle navigation Προβολή τεκμηρίου \nΙδρυματικό Αποθετήριο Πανεπιστημίου Θεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) \nΔημοσιεύσεις σε περιοδικά, συνέδρια, κεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Ιδρυματικό \nΑποθετήριο Πανεπιστημίου Θεσσαλίας Επιστημονικές Δημοσιεύσεις Μελών ΠΘ (ΕΔΠΘ) \nΔημοσιεύσεις σε περιοδικά, συνέδρια, κεφάλαια βιβλίων κλπ. Προβολή τεκμηρίου Όλο το \nDSpace Κοινότητες & Συλλογές Ανά ημερομηνία δημοσίευσης Συγγραφείς Τίτλοι Λέξεις κλειδιά \nErratum: Finite element analysis of discrete circular dislocations (CMES (2010) 60: 2 (181-198)) \nThumbnail Συγγραφέας Baxevanakis, KP; Giannakopoulos, AE Ημερομηνία 2014 Εμφάνιση …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of material properties of incompressible hyperelastic materials based on instrumented indentation of an equal-biaxial prestretched substrate",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768315001341",
            "Abstract": "It is well known that instrumented indentation tests are useful tools in probing mechanical properties of materials such as metals and ceramics. Instrumented indentation of hyperelastic materials such as rubbers, bio-materials, tissues etc has not been examined in depth, especially the inverse problem of material characterization from instrumented indentation response. The difficulty of the inverse problem for such materials is that the unknown property is a function, the elastic energy density function. There are several such functions and each function is often characterized by more than one parameter. If the maximum indentation depth is low, we have shown that instrumented indentation of initially unstretched hyperelastic materials can only resolve a combination of the material parameters. If the maximum indentation depth is high, the indentation can provide independent material properties, however not in a unique …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:M05iB0D1s5AC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Pretwisted beams in axial tension and torsion: analogy with dipolar gradient elasticity and applications to textile materials",
            "Publication year": 2015,
            "Publication url": "https://ascelibrary.org/doi/abs/10.1061/(ASCE)EM.1943-7889.0000917",
            "Abstract": "A technical theory for pretwisted beams that accounts for variable twist (constrained warping) is based on an approximate displacement field that is defined completely in terms of two unknown functions: the axial displacement  and the rotation  of the cross section about the centroidal axis of the beam,  being the coordinate along the axis of the beam. The primary unknowns are determined by minimizing the potential energy of the beam. The problem is then formulated in terms of , and an analogue between the technical theory and a one-dimensional dipolar gradient elasticity model is presented. The application of the theory to textile materials is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:ZeXyd9-uunAC",
            "Publisher": "American Society of Civil Engineers"
        },
        {
            "Title": "A von Karman plate analogue for solving anti-plane problems in couple stress and dipolar gradient elasticity",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768317303438",
            "Abstract": "The purpose of the present work is to present a direct analogy regarding the formulation and solution of anti-plane problems in the context of couple stress and dipolar gradient elasticity and the von Karman plate framework. We show aspects of boundary conditions in both theories of elasticity and propose a robust Finite Element methodology based on the von Karman plate theory in order to solve complex anti-plane (mode III) crack problems. Furthermore, we establish the equivalence between the anti-plane gradient elasticity J-Integral and the plate Ic-Integral (Sanders’ plate integral). In passing, we prove the path independency of the Ic-Integral. Finally we examine the near tip fields for both anti-plane and plate problems and establish possible strengthening effects due to the underlying microstructure.The proposed analogy is achieved through the von Karman plate theory where the plate is pre-stressed by a …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:geHnlv5EZngC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A structural gradient theory of torsion, the effects of pretwist, and the tension of pre-twisted DNA",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768313003107",
            "Abstract": "A structural gradient theory of torsion of thin-walled beams is developed. A non-local estimate of the mean value of the angle of twist of the beam leads to a shear gradient that is energetically consistent with a bi-moment, in the spirit of the averaging theory of Vardoulakis and Giannakopoulos (2006). The geometric details of the cross section play the role of the microstructure of the beam, introducing a size effect in the torsion problem. The appropriate boundary conditions are derived from the variational formulation of the problem. The proposed gradient elasticity theory is identical to Vlasov’s torsion theory of thin walled elastic beams. The tension of pre-twisted DNA is analyzed at high axial loads, where enthalpic elasticity prevails. A size effect is naturally introduced, indicating that shorter DNA lengths lead to stiffer response in torsion. It is shown also that the complete unwinding of DNA triggers the debonding of its …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:TFP_iSt0sucC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Determination of elasto-plastic properties by instrumented sharp indentation: guidelines for property extraction",
            "Publication year": 2000,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=1359159",
            "Abstract": "Pascal 001 Exact sciences and technology/001B Physics/001B60 Condensed matter: structure, mechanical and thermal properties/001B60B Mechanical and acoustical properties of condensed matter/001B60B20 Mechanical properties of solids/001B60B20F Deformation and plasticity (including yield, ductility, and superplasticity)",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and apparatus for determining preexisting stresses based on indentation or other mechanical probing of the material",
            "Publication year": 2001,
            "Publication url": "https://patents.google.com/patent/US6311135B1/en",
            "Abstract": "Provided are methods and apparatus for determining from indentation testing the preexisting stress and/or effective strain in a section of a material. The invention also provides methods and apparatus for determining the variation of the stress with depth in the material (eg the gradient). According to the invention, first data are provided from an indentation test of the stressed (or strained) section. The stress (or effective strain) can then be determined from the first data and from second data characteristic of the material, such as a stress-strain curve. Second data can also be obtained from an additional indentation test of a section having a known stress. The methods provided herein are suitable for programming on a general purpose computer or calculator.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The modified Rockwell test: a new probe for mechanical properties of metals",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11340-008-9184-7",
            "Abstract": "In the present work a novel methodology is proposed, based on the combination of the Rockwell and the Vickers tests, to provide estimates of the mechanical properties of metal substrates. The analysis is based on some novel invariants obtained from the finite element solution of the Vickers indentation (the imprint diagonal relates to the maximum indentation depth and the residual indentation depth with the average pressure and the elastic modulus). Several other useful results are discussed and experiments are performed with a modified Rockwell apparatus on steel and aluminium alloys. The results are important for the interpretation of micro indentation tests. Inverting the indentation data, reasonably accurate results can be obtained for strain hardening properties for “power law” behaviour, whereas more complex strain hardening would require further investigation.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Mechanical and electrical responses of piezoelectric solids to conical indentation",
            "Publication year": 2000,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.373562",
            "Abstract": "Mechanical and electrical responses of piezoelectric materials subjected to shallow cone indentation were evaluated. Theoretical analysis based on normal indentation of a transversely isotropic, piezoelectric solid by a conducting steel cone with zero potential bias was compared to experimental results on lead zirconate (PZT-4) and barium titanate ceramics. The effect of the cone angle on the linear elastic assumptions and the depoling of the material below the indenter tip was investigated. The load–displacement and the time–current relations were proven to be specific to the piezoelectric properties of the material. Therefore, instrumented cone indentation can be a viable test in assessing the mechanical and electrical responses of piezoelectric materials in small volumes.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Variational analysis of gradient elastic flexural plates under static loading",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768310002088",
            "Abstract": "Gradient elastic flexural Kirchhoff plates under static loading are considered. Their governing equation of equilibrium in terms of their lateral deflection is a sixth order partial differential equation instead of the fourth order one for the classical case. A variational formulation of the problem is established with the aid of the principle of virtual work and used to determine all possible boundary conditions, classical and non-classical ones. Two circular gradient elastic plates, clamped or simply supported at their boundaries, are analyzed analytically and the gradient effect on their static response is assessed in detail. A rectangular gradient elastic plate, simply supported at its boundaries, is also analyzed analytically and its rationally obtained boundary conditions are compared with the heuristically obtained ones in a previous publication of the authors. Finally, a plate with two opposite sides clamped experiencing cylindrical …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Micropolar 2D elastic cables with applications to smart cables and textiles",
            "Publication year": 2014,
            "Publication url": "https://ascelibrary.org/doi/abs/10.1061/(ASCE)EM.1943-7889.0000794",
            "Abstract": "Elastic cables are structural elements with a one-sided constitutive law (compression is not allowed) that obtain their equilibrium configuration by adjusting their shape to satisfy static equilibrium. The loading of a cable is applied through body-type forces and through appropriate boundary conditions at its ends. The classic cable constitutive law is easily implemented by assuming small strains and a coordinate system that follows the rigid-body motion. This approach was selected in the present analysis in the context of micropolar elasticity. The analysis is two-dimensional (2D) and static. The results indicate the important role of the couple-type body forces in the cable’s deformation. This, in turn, is very advantageous in the design of smart cables and textiles that can utilize electromagnetic fields to actuate couple body forces and in this way exert control on their deformation.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:u9iWguZQMMsC",
            "Publisher": "American Society of Civil Engineers"
        },
        {
            "Title": "Spherical indentation of incompressible rubber-like materials",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002250960600202X",
            "Abstract": "In recent years, indentation tests have been proven very useful in probing mechanical properties of small volumes of materials. However, a class of materials that very little has been done in this direction is rubber-like materials (elastomers). The present work investigates the spherical indentation of incompressible rubber-like materials. The analysis is performed in the context of second-order hyperelasticity and is accompanied by finite element computations and an extensive experimental program with spherical indentors of different radii. Uniaxial tensile tests were also performed and it was found that the initial elastic modulus correlates well with the indentation response. The experiments suggest stiffer indentation response than that predicted by linear elasticity, which is somehow counter-intuitive, if the uniaxial material response is to be considered. Regarding the uniqueness of the inverse problem, that is to …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:blknAaTinKkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Dynamics of Flexoelectric Materials: Subsonic, Intersonic, and Supersonic Ruptures and Mach Cone Formation",
            "Publication year": 2020,
            "Publication url": "https://asmedigitalcollection.asme.org/appliedmechanics/article-abstract/87/6/061004/1080844",
            "Abstract": "Motivated by recent, unexpected, experimental observations of “intersonic” rupture growth in which both shear and dilatational Mach fronts were observed at the tips of dynamic frictional ruptures propagating at rupture speeds below the dilatational wave speed of the surrounding solid, and we formulate the general dynamic flexoelectric problem and we investigate its plane strain/plane polarization specialization. The coupling of the mechanical problem is analogous to a problem of Toupin–Mindlin gradient elasticity, where two micromechanical characteristic lengths and two microinertial lengths emerge as a combination of the mechanical, dielectric, and flexoelectric constants. The solution of the rupture growth problem allows us to provide an explanation of the experimental results. This becomes possible since flexoelectricity predicts a new aspect that was not observed in the classical analysis: subsonic super …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:SP6oXDckpogC",
            "Publisher": "American Society of Mechanical Engineers"
        },
        {
            "Title": "Viscoelastic dynamic arterial response",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482517302524",
            "Abstract": "Arteries undergo large deformations under applied intraluminal pressure and may exhibit small hysteresis due to creep or relaxation process. The mechanical response of arteries depends, among others, on their topology along the arterial tree. Viscoelasticity of arterial tissues, which is the topic investigated in this study, is mainly a characteristic mechanical response of arteries that are located away from the heart and have increased smooth muscle cells content.The arterial wall viscosity is simulated by adopting a generalized Maxwell model and the method of internal variables, as proposed by Bonet and Holzapfel et al. The total stresses consist of elastic long-term stresses and viscoelastic stresses, requiring an iterative procedure for their calculation. The cross-section of the artery is modeled as a circular ring, consisting of a single homogenized layer, under a time-varying blood pressure. Two …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Unified description of size effects of transport properties of liquids flowing in nanochannels",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0017931012003213",
            "Abstract": "The present work connects transport properties of simple fluids flowing in nanochannels: the diffusion coefficient, the shear viscosity and the thermal conductivity. We used non-equilibrium molecular dynamics (NEMD) simulations of liquid argon flowing in a nanochannel formed by krypton walls, macroscopically equivalent to the planar Poiseuille flow, at constant temperature. All properties approach bulk values as the channel width increases. As the channel width decreases, the transport properties change dramatically: the diffusion coefficient decreases with the channel width, the shear viscosity increases with the channel width and the thermal conductivity increases with the channel width. The novel result of this work is that, if the size effect of one of the transport properties (say the diffusion coefficient) is known, then all the others can be estimated from results that apply to classic fluid mechanics.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Elastic and viscoelastic indentation of flat surfaces by pyramid indentors",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022509606000214",
            "Abstract": "The present work presents the results of frictionless and adhesionless contact of flat surfaces by pyramid indentors. The materials of the contacting solids were modelled as homogeneous and isotropic, linear elastic, as well as linear viscoelastic. The theoretical analysis is complemented by experiments and numerical calculations. The results include explicit relations between the normal applied load and the depth of penetration, details of the contact area shapes, the surface stresses and the contact pressure distributions. The standard shapes of the Vickers, Berkovich and Knoop pyramids were examined in particular. Certain aspects of geometrical imperfections, transverse isotropy and adhesion were considered. When elasticity or viscoelasticity provide adequate models of material behavior, micro- or nano-indentation by sharp pyramid indentors can be very useful and perhaps the only possible test in probing …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "STRUCTURAL, MECHANICAL, THERMODYNAMIC, AND OPTICAL PROPERTIES OF CONDENSED MATTER (PACS 61-68, 78)-Mechanical and electrical responses of piezoelectric solids to conical indentation",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=6423151300100957228&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:maZDTaKrznsC",
            "Publisher": "New York, NY: American Institute of Physics, c1937-"
        },
        {
            "Title": "A second gradient elasto‐plastic model for fatigue of small‐scale metal components",
            "Publication year": 2010,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17579861011092355/full/html",
            "Abstract": "As the dimensions of structures are scaled down to the micro‐ and nano‐domains, the mechanical behavior becomes size dependent and thus, the classical elasticity solutions cannot be expected to hold. In particular, recent experimental investigations of fatigue strength of metals show pronounced strengthening due to the influences of both grain size and small geometrical dimensions. This paper aims to provide a simple, yet rigorous analytical model in order to address the aforementioned size effects.The present study employs a framework based on the type II, strain gradient elasticity theory by Mindlin, embedded into a thermodynamics‐based formulation which considers both mechanical behavior parameters and material lengths, as internal variables, in order to model metal fatigue.A thermodynamics‐based, second gradient elasto‐plastic formulation …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:4TOpqqG69KYC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "The influence of initial elastic surface stresses on instrumented sharp indentation",
            "Publication year": 2003,
            "Publication url": "https://asmedigitalcollection.asme.org/appliedmechanics/article/70/5/638/462993",
            "Abstract": "The present work examines the influence of pre-existing, elastic surface stresses on instrumented sharp indentation. The surface is modeled as a homogeneous and isotropic elastoplastic solid in the context of linear elasticity and Mises plasticity with isotropic strain hardening and associative flow rule. Prior to indentation, a homogeneous, biaxial, elastic stress state may exist in the substrate. The influence of the initial elastic surface stresses on the force-depth response of instrumented sharp indentation tests, such as Vickers and Berkovich, was analyzed. The unique connection of the indentation loading response and the average initial stress is based on a relation of the stresses right under the indenter, which holds universally for nearly incompressible materials. ",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gradients in elastic modulus for improved contact-damage resistance. Part II: The silicon nitride–silicon carbide system",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645401002014",
            "Abstract": "In an effort to create elastic-modulus (E) graded materials for contact-damage resistance—free of substantial amounts of glass—silicon nitride (Si3N4)-silicon carbide (SiC) graded materials were processed. The structure of these graded materials is such that Si3N4 (E=300 GPa) is at the contact surface and SiC (E=400 GPa) is in the interior, with a stepwise gradient in composition existing between the two over a depth of 1.6 mm. A pressureless, liquid-phase co-sintering method, in conjunction with a powder-layering technique, was used to achieve this structure. The liquid phase used was yttrium aluminum garnet (YAG). Under spherical indentation, cone-cracks did not form in the graded material, but some inelastic shear deformation was observed. Cone cracks formed in both the monolithic Si3N4 and the monolithic SiC end member materials under identical indentation conditions. Finite element analysis (FEA) of …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Finite element models of strain-gradient elasticity: accuracy and error estimates",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=10790492382842480634&hl=en&oi=scholarr",
            "Abstract": "In recent years, the finite element implementation of strain-gradient constitutive models has been the subject of several publications. Such models include strain-gradient elasticity, deformation type of straingradient plasticity and gradient plasticity. The finite element strategies depend on the selection of the kinematic variables (which have to do with the solution approach) and with the continuity requirements (which have to do with the element type). It is the purpose of this work to investigate the issue of accuracy of the finite element models of strain-gradient elasticity. Special emphasis will be given to one dimensional problems. The results are expected to be useful in assessing singular stress fields around crack-tips and concentrated forces.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Molecular dynamics simulation on flows in nano-ribbed and nano-grooved channels",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00231-015-1601-8.pdf",
            "Abstract": "We present molecular dynamics simulation results on fluid and transport properties for nanochannel flows. The upper channel wall is constructed from periodic roughness elements and flows are simulated both in longitudinal (ribs) and transverse (grooves) direction and are compared to respective flat-wall channel flows. Various wall/fluid interaction strength ratios are considered for the simulations, covering typical hydrophilic and hydrophobic channels. We show that groove orientation (ribs and grooves) has a primitive effect on flow mainly due to slip length increase in a ribbed-wall channel. The transport properties of the fluid are significantly affected by wall wettability, as, in flows past an hydrophobic wall, the diffusion coefficient presents anisotropy, shear viscosity attains a minimum value and thermal conductivity increases.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Clinical relevance and treatment of carotid stent fractures",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0741521410002089",
            "Abstract": "To review all published reports and investigate the clinical relevance and need for treatment of carotid stent fractures.Electronic and hand-searching of the published literature and the Manufacturer and User Facility Device Experience (MAUDE) database.Thirteen articles were published. There are 10 case reports and 3 clinical studies. There are 26 reports of fractured stents in the MAUDE database. Fifty-five cases of carotid stent fractures are reported in total. A total of 201 carotid stents were examined in the 3 studies, and the incidence of fractures was 8.9% (18/201). Fractured stents were 22 Xact, 20 Acculink, 6 Precise, 2 Exponent, 1 Nexstent, 1 Genesis, 1 Symbiot, and 2 nonspecified nitinol self-expandable stents. Twenty-seven of the treated carotid lesions were atherosclerotic, 3 restenoses after carotid endarterectomy, 2 postradiational, 1 pseudoaneurysm, and 22 lesions of unknown …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:5nxA0vEk-isC",
            "Publisher": "Mosby"
        },
        {
            "Title": "A reciprocity theorem in linear gradient elasticity and the corresponding Saint-Venant principle",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768305003331",
            "Abstract": "In many practical applications of nanotechnology and in microelectromechanical devices, typical structural components are in the form of beams, plates, shells and membranes. When the scale of such components is very small, the material microstructural lengths become important and strain gradient elasticity can provide useful material modelling. In addition, small scale beams and bars can be used as test specimens for measuring the lengths that enter the constitutive equations of gradient elasticity. It is then useful to be able to apply approximate solutions for the extension, shear and flexure of slender bodies. Such approach requires the existence of some form of the Saint-Venant principle. The present work presents a statement of the Saint-Venant principle in the context of linear strain gradient elasticity. A reciprocity theorem analogous to Betti’s theorem in classic elasticity is provided first, together with …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A study of size effects and length scales in fracture and fatigue of metals by second gradient modelling",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1460-2695.2012.01668.x",
            "Abstract": "As the dimensions of structures are scaled down to the micro‐ and nano‐domains, the mechanical behaviour becomes size dependent and thus, we cannot expect the classical elasticity solutions to hold. In particular, recent experimental investigations of fatigue strength of metals show pronounced strengthening due to the influences of small geometrical dimensions. Based on second gradient elasticity framework as particularized on beams, closed form solutions to idealized problems of elastic cantilever bending, elastic three‐point bending and elasto‐plastic torsion have been found, showing considerable stiffening, toughening and hardening, respectively, compared to the classical theory predictions. In these models, the intrinsic material length scale was taken to be constant. Furthermore, we describe a gradient solid with a characteristic length which is not a fixed material parameter but depends on the amount …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Fluid ordering effects and density variations in nanochannel flows: a quasicontinuum theory",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.2902",
            "Abstract": "A quasicontinuum self‐diffusion theory that can capture the fluid ordering effects and density variations predicted by nonequilibrium molecular dynamics in nanochannel flows is presented. The physics of the problem suggests a fourth order diffusion equation for the concentration as a function of position and time requiring the classic diffusion coefficient D and a microstructural internal length g that relates directly to the shape of the molecular potential of the molecular dynamics simulations. Given the appropriate initial and boundary conditions, the aforesaid linear partial differential equation is analytically solved for the one‐dimensional steady state, whereas the case of symmetric as well as asymmetric wall conditions has been accounted for by examining different inhomogeneous diffusion distributions. Copyright © 2013 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High Temperature Fretting Fatigue Behavior in an XD™ gamma-base TiAl; Applications of Fracture Mechanics in Fretting Fatigue Life Assessment",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=1963800343067016814&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:LkGwnXOMwfcC",
            "Publisher": "AMERICAN TECHNICAL PUBLISHERS LTD"
        },
        {
            "Title": "Novel methods for the mechanical characterization of patches used in carotid artery repair",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0928493117348683",
            "Abstract": "Carotid endarterectomy (CEA) is one of the approaches available for the treatment of carotid artery disease, with carotid patch angioplasty the pertinent technique mostly preferred by vascular surgeons. This technique entails an arteriotomy succeeded by closure with a textile, polymer or biological tissue patch. In this work, we propose microbuckling and microindentation as novel methodologies for acquiring the mechanical properties of patches used in carotid artery repair. Regarding microbuckling, the patch is loaded by a sensitive dynamometer at one end and its motion is recorded, at three different levels of axial deformation: δ/ℓ = 0.1, 0.3 and 0.5 (in the post-buckling regime). The corresponding experimental loads are recorded, as well. Following pertinent closed-from equations, various material metrics are obtained, such as the Young's modulus of elasticity and the so-called frictional couple of the material …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Depth sensing indentation and methodology for mechanical property measurements",
            "Publication year": 2000,
            "Publication url": "https://patents.google.com/patent/US6134954A/en",
            "Abstract": "An indentation measurement apparatus is retrofittable onto any of a variety of load-applying frames and includes a mount for mounting an indenter of any geometry (for example blunt or sharp). The arrangement is very stiff and mechanical values including Young's modulus, strain hardening exponent, yield strength, and hardness can be obtained from a single load/unload versus displacement test. A wide variety of materials can be tested using the apparatus. An optical probe can measure displacement of the indenter head relative to a sample. A new method of calculating strain hardening directly from load/displacement measurement is presented as is a new method of calculating strain hardening exponent.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gradient elastodamage model for quasi-brittle materials with an evolving internal length",
            "Publication year": 2015,
            "Publication url": "https://ascelibrary.org/doi/abs/10.1061/(ASCE)EM.1943-7889.0000854",
            "Abstract": "The article presents a new approach based on a strain gradient damage constitutive law for modeling quasi-brittle materials such as concrete. The authors use a weak type nonlocal formulation of the problem, relying on Mindlin’s Form II strain gradient elasticity theory. Gibbs free energy is used and the influence of the positive and negative principal strains to damage evolution is separated. Additional energy dissipation due to the gradient of the positive principal strains is introduced. The model requires an internal length, which is treated as an internal variable dependent on the level of damage. The study shows that the internal length increases with damage, corroborating available experimental results. Calibration of the gradient internal length evolution with damage is established through experimental data from two independent tests: a uniaxial tension or compression test to establish the evolution of damage …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:0EnyYjriUFMC",
            "Publisher": "American Society of Civil Engineers"
        },
        {
            "Title": "The effect of strain hardening on the dynamic response of human artery segments",
            "Publication year": 2017,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc5748871/",
            "Abstract": "Background:When subjected to time-dependent blood pressure, human arteries undergo large deformations, exhibiting mainly nonlinear hyperelastic type of response. The mechanical response of arteries depends on the health of tissues that comprise the artery walls. Typically, healthy arteries exhibit convex strain hardening under tensile loads, atherosclerotic parts exhibit stiffer response, and aneurysmatic parts exhibit softening response. In reality, arterial dynamics is the dynamics of a propagating pulse, originating in heart ventricle, propagating along aorta, bifurcating, etc. Artery as a whole cannot be simulated as a lump ring, however its cross section can be simulated as a vibrating ring having a phase lag with respect to the other sections, creating a running pressure wave. A full mathematical model would require fluid-solid interaction modeling continuity of blood flow in a compliant vessel and a momentum …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "Large deformation of thin films and layered flat panels: effects of gravity",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1359645401002816",
            "Abstract": "A general theory is presented for the large deformation of thin films and layered flat panels in which gravitational forces have a marked influence on the evolution of curvature, shape and instability. Isotropic, linear elastic deformation is considered with small strains and moderate rotations. The thermomechanical properties of the layered material are allowed to vary through the panel thickness so as to derive a general result for multilayers and graded materials. Explicit analytical expressions are derived for the critical curvature and the critical “effective load” at which curvature bifurcation occurs. The analysis considers square, circular and rectangular panels that are simply supported at three points, with the thin film on the panel facing either up or down. A boundary layer analysis is presented for rectangular panels specifically to examine the effect of panel shape on curvature evolution and geometric stability …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:aqlVkmm33-oC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The Hertz contact problem in couple-stress elasticity",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768319301568",
            "Abstract": "The classical three-dimensional Hertz contact problem is re-examined in the present work within the context of couple-stress elasticity. This theory introduces characteristic material length scales that emerge from the underlying microstructure and has proved to be very effective yet rather simple for modeling complex microstructured materials. An exact solution of the axisymmetric contact problem is obtained through Hankel integral transforms and singular integral equations. The goal is to examine to what extend this gradient theory captures the experimentally observed indentation response and the related size effects in materials with microstructure. Furthermore, the present work extends the classical Hertz contact solution in the framework of a generalized continuum theory providing thus a useful theoretical background for the interpretation of spherical indentation tests of microstructured materials. The results …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Two-dimensional contact analysis of elastic graded materials",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002250969900068X",
            "Abstract": "The present paper examines two-dimensional contact of a rigid cylinder on an elastic graded substrate. The normal, sliding and rolling type of contact are addressed. The effect of adhesion in frictionless contact is also examined. The elastically graded substrate is modeled to be locally isotropic with constant Poisson ratio and elastic modulus that varies with depth, y, according to a power law, E= E 0 y k; 0≤ k< 1, y≥ 0. Such variation covers a fairly broad class of graded materials. Exact results are derived within the context of small deformation linear elasticity. The results show that the power law elastic gradation can be very advantageous in the design of strong and wear resistance sliding surfaces.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:lSLTfruPkqcC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Analytical Side-to-Side Related Anastomotic Strategies and Artery Patching",
            "Publication year": 2015,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc4415203/",
            "Abstract": "Suture line stress concentration and intimal hyperplasia are related to the long-term complications of end-toside and side-to-side anastomosis. Several factors, such as hemodynamic effects, biological activities and the mechanical properties of the blood vessels, are identified to influence the problem. Yet, it is not completely clear which are the factors that influence most the long-term complications and in what specific way. This study aims to examine if elastic (compliance) mismatch increases the stress concentration and intimal thickening at the suture line. Better compliance may be obtained by using grafts with similar mechanical properties to the host artery or by anastomosis techniques that utilize vein patches and cuffs (Taylor-patch and Miller-cuff anastomosis). The anastomosis model used in this study is a circular cylindrical system consisting of two semi-cylinders, interconnected by two hinges. The internal …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:P5F9QuxV20EC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "Finite element analysis of discrete circular dislocations",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Baxevanakis/publication/259784255_Finite_Element_Analysis_of_Discrete_Circular_Dislocations/links/53edd18c0cf26b9b7dc621d8/Finite-Element-Analysis-of-Discrete-Circular-Dislocations.pdf",
            "Abstract": "The present work gives a systematic and rigorous implementation of (edge type) circular Volterra dislocation loops in ordinary axisymmetric finite elements using the thermal analogue and the integral representation of dislocations through stresses. The accuracy of the proposed method is studied in problems where analytical solutions exist. The full fields are given for loop dislocations in isotropic and anisotropic crystals and the Peach-Koehler forces are calculated for loops approaching free surfaces and bimaterial interfaces. The results are expected to be very important in the analysis of plastic yield strength, giving quantitative results regarding the influence of grain boundaries, interstitial particles, microvoids, thin film constraints and nano-indentation phenomena. The interaction of few dislocations with various inhomogeneities gives rise to size effects in the yield strength which are of great importance in nano-mechanics.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of Knoop indentation strain hardening effects",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768311002678",
            "Abstract": "Knoop indentation tests are a standard method for material characterization due to the fact that they provide an easy, inexpensive non-destructive and objective method of evaluating basic properties from small volumes of materials. The aim of this work is to explore the theoretical foundation of Knoop test and shed light to the interesting details that make the Knoop test so useful and simple. Our study builds upon the preliminary analyses of Knoop indentation by Giannakopoulos and Zisis (2011). We present a finite element study, in the frame of large elasto-plastic deformations, on the adhesionless contact of between a Knoop indenter and flat surfaces that exhibit strain hardening behavior. The material of the contacting solid is modeled as homogeneous and isotropic while frictionless contact conditions are assumed throughout. Results are presented for Linear-Power and Ramberg–Osgood laws of hardening …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:-f6ydRqryjwC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The use of strain gradient elasticity in modelling tissues: The case of the human heart",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814322034_0021",
            "Abstract": "In recent years, strain gradient elasticity has been used to capture size effects in stiffness and toughness that appear in structures of different sizes. An important aspect of such theories, often taken of little notice, is the non-classical boundary conditions that appear as couple-stress tractions. Such tractions can provide deformation of the body they are acting on, without the need for classic type of supports that are usually needed when classic tractions are applied. Moreover such tractions seem to be \"invisible\", since no external pressure is acting and they can be related to non-mechanical sources, like electricity. The human heart seems to stand without support (bones etc), floating in the human body and electric pulses applied to its surface make it vibrate, inflating periodically the various chambers that circulate the blood in the body. We propose a model for the muscle tissues of the heart, in the context of gradient …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis of Knoop indentation of cohesive frictional materials",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016766361200186X",
            "Abstract": "During the last decades, pyramid micro and nano-indentation tests such as Vickers, Berkovich and Knoop have been used on cohesive-frictional (pressure sensitive) materials, such as hard metals, glasses and ceramics, and were found to give valuable mechanical and other physical information which may be otherwise difficult to obtain. Indentation experiments are attractive because they require only a small flat area of specimen and are relatively easy to perform on materials of high stiffness and brittleness. More important, at least in principle, a wide load range can be used, so that many mechanical properties can be inferred by recording continuously the force-depth response at loading and unloading. Despite of the broad use of the indentation experiments, and the theoretical analysis of the response of the first two indenters (Vickers and Berkovich), the Knoop indentation response has never been analysed on …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wedge indentation of elastic–plastic layered substrates: Designing against contact-induced plasticity",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0927025609003073",
            "Abstract": "The present paper investigates the indentation of plastically graded substrates by wedge indenters. Substrates made of graded materials are often encountered in nature or are artificially produced. The variation of the plastic properties depends on micro-structural or compositional changes of the material with depth. The introduction of certain controlled gradients in plastic properties can minimize plasticity and promote resistance to the onset of damage at contact surfaces during tribological applications. Contact analysis of plastically graded surfaces can be particularly useful in the design of load-bearing devices such as gears, rollers and electric contacts found in many macro- and micro-electro-mechanical systems. A comprehensive parametric finite element study of the mechanics of indentation of plastically graded materials by a rigid wedge is presented in the present paper. Of particular interest in the current …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Analysis of the impact of a sharp indenter",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020768301002153",
            "Abstract": "The present work investigates the impact of a sharp indenter at low impact velocities. A one-dimensional model is developed by assuming that the variation of indentation load as a function of depth under dynamic conditions has the same parabolic form (Kick's Law) as under static conditions. The motion of the indenter as it indents and rebounds from the target is described. Predictions are made of the peak indentation depth, residual indentation depth, contact time, and rebound velocity as functions of the impact velocity, indenter mass and target properties. Finite element simulations were carried out to assess the validity of the model for elastoplastic materials. For rate-independent materials agreement with the model was good provided the impact velocity did not exceed certain critical values. For rate-dependent materials the relationship between load and depth in the impact problem is no longer parabolic and the …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Instrumented indentation of a non-equal biaxial prestretched hyperelastic substrate",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0997753816300018",
            "Abstract": "The present work investigates the instrumented indentation of a prestretched hyperelastic substrate. The substrate is incompressible and has an elastic energy density which is isotropic in the reference frame. The analysis focuses on spherical indentation, but the results can be extended to all axisymmetric indenters. The substrate is prestretched biaxially, but it is not necessarily equal-biaxial. Due to the non-equal biaxial stretching, the contact region may obtain an elliptical form with principal axes along the stretching directions with the larger axis along the smallest surface stretch. The problem resembles that of the linear contact of an orthotropic substrate; however the problem under investigation is different. Based on the theoretical analysis we propose a methodology that can be used to solve the inverse problem of material characterization using instrumented indentation of a prestretched surface when the …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Determining large deformations and stresses of layered and graded structures to include effects of body forces",
            "Publication year": 2004,
            "Publication url": "https://patents.google.com/patent/US6781702B2/en",
            "Abstract": "Techniques for determining large deformation of layered or graded structures to include effects of body forces such as gravity, electrostatic or electromagnetic forces, and other forces that uniformly distribute over the structures, support forces, and concentrated forces. A real-time stress monitoring system is also disclosed to provide in-situ monitoring of a device based on the large deformation analytical approach. A coherent gradient sensing module, for example, may be included in such a system.",
            "Abstract entirety": 1,
            "Author pub id": "Goa2auQAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An experimental investigation of fretting fatigue in Ti-6Al-4V: the role of contact conditions and microstructure",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1007/s11661-001-0124-8",
            "Abstract": "A systematic investigation of the fretting fatigue behavior of the titanium alloy Ti-6Al-4V in both the mill-annealed (MA) and the solution-treated and overaged (STOA) conditions was carried out. A sphere-on-flat fretting fatigue device was used that facilitated real-time control and monitoring of all the relevant parameters such as the contact geometry, contact (normal and tangential) loads, and bulk alternating stress. While different sets of experiments were conducted to examine the influence of the bulk stress, the tangential load, and the normal load, respectively, on fretting fatigue response, the effect of microstructure on fretting fatigue was explored with experiments on the acicular, Widmanstätten, and martensitic microstructures as well. In experiments where the contact loads were maintained constant and the bulk stress was varied, fretting reduced the fatigue strength of Ti-6Al-4V. For this case, the “strength …",
            "Abstract entirety": 0,
            "Author pub id": "Goa2auQAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer-Verlag"
        }
    ]
}]