[{
    "name": "Αθανάσιος Σκόδρας",
    "romanize name": "Athanasios Skodras",
    "School-Department": "Ηλεκτρολόγων Μηχ. & Τεχνολογίας Υπολογιστών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 2250,
    "Scholar name": "Athanassios Skodras",
    "Scholar id": "dFBXodcAAAAJ",
    "Affiliation": "University of Patras",
    "Citedby": 6649,
    "Interests": [
        "Hand Gesture Recognition based on sEMG Signals and Deep Learning Signal",
        "Image and Video Coding / Processing / Analysis",
        "HDR Ima"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=dFBXodcAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Hand Gesture Recognition Based on EMG Data: A Convolutional Neural Network Approach",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-27950-9_10",
            "Abstract": "Deep learning (DL) has transformed the field of data analysis by dramatically improving the state of the art in various classification and prediction tasks. Especially in the area of computer vision and speech processing, DL has recently demonstrated better performance and generalisation properties, compared to classical machine learning approaches, which are based on the extraction of hand-crafted model-based features followed by classification. Hand gestures and speech constitute two of the most important modalities in human-to-human communication and man-machine interaction. In biomedical engineering, a lot of new work is directed towards electromyography-based gesture recognition. In this paper, we present a brief overview of DL methods for electromyography-based hand gesture recognition and then we select from literature a simple model based on Convolutional Neural Networks that we …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:121WXH0ir18C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the subjective assessment of the perceived quality of medical images and videos",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8463297/",
            "Abstract": "Medical professionals are viewing an increasing number of images and videos in their clinical routine. However, various types of distortions can affect medical imaging data, and therefore impact the viewers' experienced quality and their clinical practice. Thus it is necessary to quantify this impact and understand how the viewers, i.e., medical experts, perceive the quality of (distorted) images and videos. In this paper, we present an up-to-date review of the methodologies used in the literature for the subjective quality assessment of medical images and videos and discuss their merits and drawbacks depending on the use case.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:T0nwzvlCxs8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new platform for watermarking and management of digital images of the Hellenic cultural heritage",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027922/",
            "Abstract": "In the present communication the deployment of a system for the watermarking and management of digital images is described. A digital image repository is implemented, and a watermarking method integrated into a dedicated GUI for efficient management and copyright protection of digital images is proposed. The work described in this contribution has been gradually deployed to a Directorate of the Hellenic Ministry of Culture as part of the PRAXITELIS Project.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:NJ774b8OgUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Digital Rights Management System and Copyright Protection for Digital Images of the Official Web Portal of the Hellenic Culture",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0381-1_19",
            "Abstract": "The dissemination of Cultural Heritage involves the risk of copyright infringement and unauthorized use. This paper addresses the issue of the copyright protection and rights management of digital images for a web site related to culture. For this purpose, an innovative watermarking method is integrated into an advanced user-friendly interface that supports a digital rights management strategy. The test platform for this application is “Ulysses”, the Official Portal of the Hellenic Ministry of Culture (HMC). The whole practice indicates that the aforementioned problems are satisfactorily addressed.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Transfer Learning in sEMG-based Gesture Recognition",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9555555/",
            "Abstract": "The latest advancements in the field of deep learning and biomedical engineering have allowed for the development of myoelectric interfaces based on deep neural networks. A longstanding problem of these interfaces is that the models cannot easily be applied to new users due to the high variability and stochastic nature of the electromyography signals. Further training a new model for every new subject requires the collection of large volumes of data. Therefore, this work proposes a transfer learning (TL) scheme which allows reusing the knowledge of a pre-existing model for a new user. Firstly, a convolutional neural network (CNN) is trained on an initial dataset using the data of multiple subjects. Then, the weights of this model are fine-tuned for a new target subject. The approach is evaluated on the Ninapro datasets DB2 and DB7. The experimentation included three different CNN models and eight …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:Y1W0x10ZrwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the use of deeper CNNs in hand gesture recognition based on sEMG signals",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900709/",
            "Abstract": "In the past few years, a great interest for the classification of hand gestures with Deep Learning methods based on surface electromyography (sEMG) signals has been developed in the scientific community. In line with latest works in the field, the objective of our work is the construction of a novel Convolutional Neural Network architecture, for the classification of hand-gestures. Our model, while avoiding overfitting, did not perform significantly better compared to a much shallower network. The results suggest that the lack of diversity in the sEMG recordings between certain hand-gestures limits the performance of the model. In addition, the classification accuracy on a database we developed using a commercial device (Myo Armband) was substantially higher (approximately 24%) than a similar benchmark dataset recorded with the same device.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:MStqg_gSLBcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A synthetic stegano-crypto scheme for securing multimedia medical records and their associations",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5201144/",
            "Abstract": "The security of medical records is an important issue related to privacy and safety during storage and communication. Human errors in hospitals and medical centers are closed related with mishandling of multimedia medical records. Cryptography and steganography can offer not only information security but also secure association of multimedia records. This paper presents a new lossless synthetic methodology that combines cryptography and steganography techniques for achieving information security via encryption and information association via hiding in images. The proposed synthetic methodology merges SCAN encryption-compression-hiding, LSB (least significant bit) hiding and regional hiding with segmentation methodologies into a single information hiding and encryption methodology. The SCAN schemes are based on a 2D spatial accessing technique that can generate a very large number of …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compressed domain image retrieval: a comparative study of similarity metrics",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5150/0000/Compressed-domain-image-retrieval--a-comparative-study-of-similarity/10.1117/12.507669.short",
            "Abstract": "Content based image retrieval has gained considerable attention in nowadays as a very useful tool in a plethora of applications. Web has become the most important application, because over 70% of it is devoted to images, and looking for a specific image is a really daunting task. The vast majority of these images are JPEG compressed. An extensive study of eighteen similarity measures used for image retrieval has been conducted and the corresponding results are reported in the present communication. The energy histograms of the low frequency DCT coefficients have been used as the feature space for similarity testing. Query-by-image-example was used in all tests.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:4DMP91E08xMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Moving object detection in the H. 264 compressed domain",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548496/",
            "Abstract": "A new method for the automatic detection of moving objects directly in the H.264 compressed domain is proposed in this paper. The method takes advantage of the multiple block sizes, which are used during the inter-mode decision by the H.264 encoder. The different blocks/sub-blocks are combined with their associated motion vectors in order to denote a moving object. The method works in the compressed domain as the block-sizes and the motion vectors can be found by partially (entropy only) decoding the H.264 bitsream. Finally, the method can optionally extract the details of the moving object by fully decoding only the macroblocks that the object consists of.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Authentication and self-correction in sequential MRI slices",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10278-010-9340-3.pdf",
            "Abstract": "One of the new challenges of Information Technology in the medical world is the protection and authentication of a variety of digital medical files, datasets, and images. In this work, the ability of magnetic resonance imaging (MRI) slice sequences to hide digital data is investigated and more specifically the case that the hidden data are the regions of interest (ROI) of the MRI slices. The regions of non-interest (RONI) are used as cover. The hiding capacity of the whole sequence is taken into account. Any ROI-targeted tampering attempt can be detected, and the original image can be self-restored (under certain conditions) by extracting the ROI from the RONI.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "The upcoming JPEG2000 standard",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=11594138892331634322&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bit Signature Casting in the DCT domain",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=6260412658402040817&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:W5xh706n7nkC",
            "Publisher": "Technical Report, Computer Technology Institute"
        },
        {
            "Title": "Fast multiple reference frame selection method in H. 264 video encoding",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.454.2327&rep=rep1&type=pdf",
            "Abstract": "The new JVT H. 264 video coding standard is becoming the dominant standard, mainly due to its high coding efficiency. Among all modules in the encoder, motion estimation plays a key role since it can significantly affect the output quality of an encoded sequence. However, motion estimation requires a significant part of the encoding time. One reason is because H. 264 allows motion estimation based on multiple reference frames. In this paper, a new method for fast reference frame selection is proposed. The method performs a simple and quick test prior to motion estimation in order to choose the best reference frame.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An FPGA Design for the Two-Band Fast Discrete Hartley Transform",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7886052/",
            "Abstract": "The discrete Hartley transform finds numerous applications in signal and image processing. An efficient Field Programmable Gate Array implementation for the 64-point Two-Band Fast Discrete Hartley Transform is proposed in this communication. The architecture requires 57 clock cycles to compute the 64-point Two-Band Fast Discrete Hartley Transform and reaches a rate of up to 103.82 million samples per second at a 92 MHz clock frequency. The architecture has been implemented using VHDL and realized on a Cyclone IV FPGA of Altera.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A New Spatio-Temporal Fast Motion Estimation Algorithm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4383742/",
            "Abstract": "A new spatio-temporal approach is proposed for fast block motion estimation in video coding. The approach exploits the existing correlation of the spatio- temporal block neighborhood by utilizing the frequency of appearance of the neighborhood's motion vectors. Extensive simulations show that the proposed algorithm performs close to the full search algorithm (in terms of quality) with a significant computational gain. Under fine tuning of specific parameters, the algorithm becomes comparable to other fast search algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel approach on transform domain watermarking against geometrical deformations",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1579902/",
            "Abstract": "Most of the methods involved in transform domain watermarking perform very well in a great variety of attacks but fail miserably in the category of the attacks known as geometrical. Usually, even a small rotation or slight zoom in/out of the watermarked image, results to detection failure. These attacks can be modelled by means of the affine transform. There are some suggestions that cope with this problem and an overview of them is presented in this communication, along with a new improved solution to this.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The JPEG 2000 still image compression standard,‖ IEEE Signal Process",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=16878969896983796729&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:wyoMR1qFDH8C",
            "Publisher": "Mag"
        },
        {
            "Title": "Decentralising the digital rights management value chain by means of distributed license catalogues",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_81",
            "Abstract": "Digital Rights Management (DRM) systems’ interoperability is becoming one of the main obstacles for their wider adoption, especially from medium and small size users. Interoperability issues affect, among others, the management of content usage rules by third parties (authorities) and the automation of licensing procedures upon the purchase of digital content. The fundamental question of who is handling content licenses in the national or global DRM value chain is complex, with business, social and technological extensions. In this paper, we discuss current trends in DRM systems technology and business modelling and briefly present a proposal for handling digital content licensing, Distributed License Catalogues (DLCs). The DLC concept, borrowed from web engineering, makes available (“advertises”) content or services concerning DRM functionalities, enabling multi-party DRM eco-systems.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:mB3voiENLucC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "TECHNICAL REPORT No. TR2001/10/01",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.100.9770&rep=rep1&type=pdf",
            "Abstract": "Nowadays, there is an ongoing necessity of using digital watermarking techniques in order to protect medical data. In this work we present the way that a Gabor transform domain watermarking technique, which has been used in cases of grayscale and RGB images, can be applied in the medical field. In our experiments we tried to find the right combination between the increase of the robustness of the watermark and the reduction of the visual distortion of the medical image. We present the results of the experiments, which prove this technique quite suitable for use in medical imaging applications.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital Culture Imaging",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=4eOnNwXah7EC&oi=fnd&pg=PA353&dq=info:mhnt_7X_ocsJ:scholar.google.com&ots=CiB2uB_QO1&sig=lV82JNM_SxI5cRa9RQ-lzpEYDXs",
            "Abstract": "Cultural heritage institutions, such as Museums and Art Galleries, as well as Libraries and Archives, are in possession of very extensive collections of valuable assets. Many of them are not visible to the public because of display capacity or other reasons. These materials are gradually being digitized, thus giving the possibility for them to be accessed by all interested people from anywhere at any time. Dealing with the digital surrogates of the cultural assets is demanding and continuous work. It starts with the proper digitization of the asset and continues with its preservation. Digital preservation or digital curation is the managed activities necessary for ensuring both the long-term maintenance of digital information and the continued accessibility of its contents. The digital cultural information can be of all types of media, namely text, photographs, prints, plans and maps, drawings, documentaries and films, sound and video recordings, music, philately, microfilms, periodicals, newspapers, manuscripts, or even three-dimensional (3-D) objects (BCR, 2008; Desrochers and Thurgood, 2007; IST Cultural Heritage, 2005). 1 Digital imagery is likely to be the majority of the digital cultural heritage material. Huge image repositories, along with the associated metadata, constitute the Archival Information System. Such a system should flexibly and reliably allow the producers to ingest a digital asset and the managers to manage it, while it is distributed to the consumers (Figure 14.1). For digital cultural imagery, it is critically important to use widely adopted standards that increase the chance of longevity in the face of technological change (MacDonald,",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:u9iWguZQMMsC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Time series analysis of sunspot oscillations using the wavelet transform",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028234/",
            "Abstract": "By decomposing a time series into time-frequency space, one is able to determine both the dominant mode of variability and how those modes vary in time. We take advantage of this property of the wavelet analysis in order to examine the temporal variation of the period of the umbral oscillations using ground-based observations of the solar atmosphere. We use this real-life signal in order to test the capabilities of different wavelets and to see the problems that arise in analyzing such a signal. We use the continuous wavelet transform in order to perform the analysis and the \"a/spl grave/ trous\" algorithm as a detrending tool.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Alternative Astronomical FITS imaging",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1209.0442",
            "Abstract": "Astronomical radio maps are presented mainly in FITS format. Astronomical Image Processing Software (AIPS) uses a set of tables attached to the output map to include all sorts of information concerning the production of the image. However this information together with information on the flux and noise of the map is lost as soon as the image of the radio source in fits or other format is extracted from AIPS. This information would have been valuable to another astronomer who just uses NED, for example, to download the map. In the current work, we show a method of data hiding inside the radio map, which can be preserved under transformations, even for example while the format of the map is changed from fits to other lossless available image formats.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crowdsourcing-based evaluation of privacy in HDR images",
            "Publication year": 2014,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9138/913802/Crowdsourcing-based-evaluation-of-privacy-in-HDR-images/10.1117/12.2054541.short",
            "Abstract": "The ability of High Dynamic Range imaging (HDRi) to capture details in high-contrast environments, making both dark and bright regions clearly visible, has a strong implication on privacy. However, the extent to which HDRi affects privacy when it is used instead of typical Standard Dynamic Range imaging (SDRi) is not yet clear. In this paper, we investigate the effect of HDRi on privacy via crowdsourcing evaluation using the Microworkers platform. Due to the lack of HDRi standard privacy evaluation dataset, we have created such dataset containing people of varying gender, race, and age, shot indoor and outdoor and under large range of lighting conditions. We evaluate the tone-mapped versions of these images, obtained by several representative tone-mapping algorithms, using subjective privacy evaluation methodology. Evaluation was performed using crowdsourcing-based framework, because it is a popular …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:tkaPQYYpVKoC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Autopilot spatially-adaptive active contour parameterization for medical image segmentation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6627800/",
            "Abstract": "In this work, a novel framework for automated, spatially-adaptive adjustment of active contour regularization and data fidelity parameters is proposed and applied for medical image segmentation. The proposed framework is tailored upon the isomorphism observed between these parameters and the eigenvalues of diffusion tensors. Since such eigenvalues reflect the diffusivity of edge regions, we embed this information in regularization and data fidelity parameters by means of entropy-based, spatially-adaptive `heatmaps'. The latter are able to repel an active contour from randomly directed edge regions and guide it towards structured ones. Experiments are conducted on endoscopic as well as mammographic images. The segmentation results demonstrate that the proposed framework bypasses iterations dedicated to false local minima associated with noise, artifacts and inhomogeneities, speeding up contour …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Authentication and self-correction in DNA identification based on agarose-gel images",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5709572/",
            "Abstract": "Agarose gel electrophoresis is an ideal method for separating and analyzing DNA and RNA molecules. Analysis is based on digital images taken by cameras equipped with UV filters and finds its main use in DNA identification. It is thus of paramount importance that these images employ authentication mechanisms and if possible, self-restore capabilities against malicious tampering. The proposed approach achieves the required authentication and self-correction by hiding a copy of the regions-of-interest into the region-of-non-interest of the images.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:BFeJNCPbDVwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hardware implementation of CURUPIRA block cipher for wireless sensors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669325/",
            "Abstract": "An architecture and VLSI implementation of a new block cipher called Curupira is presented in this paper. This cipher is suitable for wireless sensors and RFID applications. Our 0.13 mum implementation requires resources of 9450 gate equivalences and is capable to encrypt a plaintext in 10 clock cycles. The cipher achieves a maximum throughput up to 2361 Mbps at 246 MHz for encrypting/decrypting. When clocked at 100 KHz a throughput of up to 960 Kbps is achieved and an average power of 0.04 mW is drawn.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deep Learning in Gesture Recognition Based on sEMG Signals",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=16699875251896687407&hl=en&oi=scholarr",
            "Abstract": "Over the past decades, there has been particular interest in gesture recognition for human-computer interaction (HCI). This particular combination finds many applications, including sign language recognition, robotic equipment control, virtual reality gaming, and prosthetics control [1]. Among the various sensor modalities that have been used to capture hand gesture information, electromyography (EMG) is considered more appropriate since it captures the muscle’s electrical activity; the physical phenomenon that results in hand gestures. EMG data can be recorded either with invasive or non-invasive methods. Surface electromyography (sEMG) is a technique that measures muscle’s action potential from the surface of the skin, contrary to invasive methods that penetrate the skin to reach the muscle.A popular approach to sEMG-based gesture recognition consists of using pattern recognition methods derived from …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:R8TPKZP7usQC",
            "Publisher": "Pan Stanford Series on Digital Signal Processing"
        },
        {
            "Title": "Color image-adaptive watermarking",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028192/",
            "Abstract": "A novel scheme for the watermarking of colour images is presented in this communication. The first objective is to find the most suitable alternative to RGB color space, which is highly correlated. Colour spaces with linear relation to RGB colour space with uncorrelated components are found to be most suitable for watermarking applications. Second objective is to make the scheme adaptive to o/spl circ/c$80a/spl ring/ colour image. This is achieved by keeping the PSNR in a predefined quality range, while timing the watermark strength parameter. Watermark detection is fast and blind, i.e. only the watermark generation and coefficient randomization keys are needed, and not the original image. The presented results demonstrate the robustness of the method against some common image processing attacks such as compression, scaling, uniform or gaussian noise addition, median filtering, cropping and multiple …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Abut, H., see Y.. Ozt. urk (3) 261–276 Aggoun, A., see R. Zaharia (3) 231–242! Alvarez-Rodr! ıguez, M. and F. P! erez-Gonz! alez, Analysis of pilot",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=11748802765667066996&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Self-authentication of natural color images in Pascal transform domain",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5201200/",
            "Abstract": "This paper proposes a self-authentication scheme for color images, using a fragile data hiding method based on the discrete Pascal transform (DPT). The main contribution of this work is in the development of a scheme that is able to detect whether a color image has been tampered or not, to locate the exact tampered position, and to attempt to restore the original image content. This is achieved by embedding a low bit-depth scaled version of the image itself, resulting in very good stego image quality and satisfactory restoration.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wavelet analysis of umbral oscillations",
            "Publication year": 2003,
            "Publication url": "https://iopscience.iop.org/article/10.1086/375268/meta",
            "Abstract": "We study the temporal behavior of the intensity and velocity chromospheric umbral oscillations, applying wavelet analysis techniques to four sets of observations in the Hα line and one set of simultaneous observations in the Hα and the nonmagnetic Fe I (5576.099 Å) line. The wavelet and Fourier power spectra of the intensity and the velocity at chromospheric levels show both 3 and 5 minute oscillations. Oscillations in the 5 minute band are prominent in the intensity power spectra; they are significantly reduced in the velocity power spectra. We observe multiple peaks of closely spaced cospatial frequencies in the 3 minute band (5-8 mHz). Typically, there are three oscillating modes present:(1) a major one near 5.5 mHz,(2) a secondary near 6.3 mHz, and (3) oscillations with time-varying frequencies around 7.5 mHz that are present for limited time intervals. In the frame of current theories, the oscillating mode near 5 …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:Se3iqnhoufwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Fast discrete Pascal transform",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/document/4027833/",
            "Abstract": "An efficient structure for the fast computation of the discrete Pascal transform (DPT) is presented. Only frac12N(N-1) additions are required for the computation of an N-point DPT as opposed to N 2   multiplications and N(N-1) additions. The reduced computational complexity of the proposed algorithm results in significant time savings and software/hardware simplicity",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IET"
        },
        {
            "Title": "On the use of the discrete Pascal transform in hiding data in images",
            "Publication year": 2010,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7723/77230L/On-the-use-of-the-discrete-Pascal-transform-in-hiding/10.1117/12.854220.short",
            "Abstract": "The Discrete Pascal Transform (DPT) has been proved remarkably useful for edge detection, filter design, discrete-time signal interpolation and data hiding. In the present work a new blind fragile data hiding technique for secretly embedding messages into color images, is proposed. The embedding procedure is based on dividing each color image component into even-sized blocks. Information embedding is determined by monitoring the lower-right corner of the DPT coefficient matrix. This particular coefficient suffers the highest change for small pixel modifications. The embedding affects the coefficient's sign. In case that the sign is not the desired one, i.e. negative for a message bit value of '0' and positive for a message bit value of '1', it is changed by repeatedly adding to the block or subtracting from the block the identity matrix. This process is based on the DPT properties and on the sensitivity of the lower-right …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:r0BpntZqJG4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A Hilbert-Based Approach to the ENF Extraction Problem",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ongoing standardization efforts",
            "Publication year": 2009,
            "Publication url": "https://infoscience.epfl.ch/record/147196",
            "Abstract": "The JPEG committee has been continuing its activities on definition of international standards related to still image coding systems in order to prepare the ground for interoperable solutions, products and services, which make use of digital images. Currently, JPEG committee is pursuing three such efforts, namely, JPSearch, which deals with annotation, search and retrieval of digital images and image sequences; JPEG XR, which seeks a solution for compression of high dynamic range images, in environments such as digital photography, where there is a need for solutions with strong complexity requirements; AIC, which aims at preparing the ground for advanced image compression systems, beyond JPEG 2000 family of standards. In the following section, each of these activities is briefly described.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "The ‘‘Trous’’wavelet transform versus classical methods for the improvement of solar images",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/31743100/ans-c48.pdf",
            "Abstract": "Solar observations are usually degraded due to seeing effects related to the turbulence of earth’s atmosphere. In order to study the fine structure of the solar surface it is necessary to apply techniques that enhance the images and improve the visibility of fine structures. In this paper we describe “classical methods” that are used in order to improve the visibility of several categories of solar features like sunspots, fine structures near the limb and Ellerman bombs. We further describe how these methods can be improved using the à trous wavelet transform and compare the results.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid watermarking based on chaos and histogram modification",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11760-012-0307-3",
            "Abstract": "A hybrid watermarking scheme for authentication is presented, which demonstrates robustness against various attacks. Due to the different nature of filtering and geometrical attacks, two different watermarks are used in this scheme. The first one is embedded in frequency domain combined with a chaotic function and is based on the correlation method. The second watermark is embedded in luminosity histogram of the image. In this way, this hybrid watermarking scheme combines the robustness of chaotic domain against filtering, noise and compression attacks with the robustness of histogram domain against geometrical attacks.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Compact FPGA architectures for the two-band fast discrete Hartley transform",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0141933118300358",
            "Abstract": "The discrete Hartley transform is a real valued transform similar to the complex Fourier transform that finds numerous applications in a variety of fields including pattern recognition and signal and image processing. In this paper, we propose and study two compact and versatile hardware architectures for the computation of the 8-point, 16-point and 32-point Two-Band Fast Discrete Hartley Transform. These highly modular architectures have a symmetric and regular structure consisting of two blocks, a multiplication block and an addition/subtraction block. The first architecture utilizes 8 multipliers and 16 adders/subtractors, achieving a maximum clock frequency of 95 MHz. The second architecture utilizes only 4 multipliers and 8 adders/subtractors, achieving a maximum clock frequency of 100 MHz; however it requires additional multiplexers and more clock cycles (from 1 to 58 clock cycles depends on the points …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:tvutLEwYQz8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "The Effect of Space-filling Curves on the Efficiency of Hand Gesture Recognition Based on sEMG Signals",
            "Publication year": 2021,
            "Publication url": "https://hrcak.srce.hr/index.php?show=clanak&id_clanak_jezik=374281",
            "Abstract": "Over the past few years, Deep learning (DL) has revolutionized the field of data analysis. Not only are the algorithmic paradigms changed, but also the performance in various classification and prediction tasks has been significantly improved with respect to the state-of-the-art, especially in the area of computer vision. The progress made in computer vision has produced a spillover in many other domains, such as biomedical engineering. Some recent works are directed towards surface electromyography (sEMG) based hand gesture recognition, often addressed as an image classification problem and solved using tools such as Convolutional Neural Networks (CNN). This paper extends our previous work on the application of the Hilbert space-filling curve for the generation of image representations from multi-electrode sEMG signals, by investigating how the Hilbert curve compares to the Peano-and Z-order space-filling curves. The proposed space-filling mapping methods are evaluated on a variety of network architectures and in some cases yield a classification improvement of at least 3%, when used to structure the inputs before feeding them into the original network architectures.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:JQPmwQThujIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "JPEG2000: The Next Generation Still Image Coding System",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=2303779417783174988&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new fingerprinting method for digital images",
            "Publication year": 2000,
            "Publication url": "http://www.ee.bilkent.edu.tr/~signal/BCSP/skodras2.pdf",
            "Abstract": "The wide use of digital media during the past few years, has led to an increase of digital piracy and tampering. To deal with these problems, the concept of watermarking has been introduced. The image is being altered and depending on the method used, these alterations can be from very slight to quite noticeable. We propose here a new scheme that identifies image tampering without altering the original image. To achieve that, we extract some unique information from the image that we use for authentication.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The JPEG2000 image compression standard in mobile health, chapter in: M-Health: Emerging Mobile Health Systems, RH Istepanian, S. Laxminarayan, and CS Pattichis, eds",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Springer Science"
        },
        {
            "Title": "Gabor transform domain watermarking",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/958540/",
            "Abstract": "The transform domain is the most commonly used space for watermarking applications. Most of the common frequency transforms have been used for this purpose. We investigate the use of the Gabor (1946) transform in traditional watermarking schemes. A casting method and detection results are thoroughly examined. It seems that traditional detection thresholds are not applicable in this transform, thus a modified approach is employed to overcome this problem. Experimental results are quite encouraging.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data hiding based on image texture classification. Signal Image Video Process",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=2772123555935269118&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Online"
        },
        {
            "Title": "Adaptive Image Watermarking Using Multiple Transforms",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=2961086531837699090&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Hardware Implementation of the MUGI Pseudorandom Number Generator",
            "Publication year": 2006,
            "Publication url": "https://dsmc2.eap.gr/wp-content/uploads/2017/05/Kitsos_c24.pdf",
            "Abstract": "MUGI pseudorandom number generator is presented in this paper. The MUGI generator is part of the ISO/IEC 18033-4: 2005 standard and it is expected to be used in many applications. The design has been coded in VHDL and FPGA devices have been used for its hardware implementation. A maximum throughput equal to 7 Gbps is achieved for a clock frequency of 110 MHz. As no other MUGI implementations do exist, the comparison with previous keystream generator implementations such as RC4, E0, A5/1, are given. These comparisons prove that the MUGI implementation is much faster compared to these implementations.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wiley-IS&T Series in Imaging Science and Technology",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The JPEG2000 still image coding system: an overview",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/920468/",
            "Abstract": "With the increasing use of multimedia technologies, image compression requires higher performance as well as new features. To address this need in the specific area of still image encoding, a new standard is currently being developed, the JPEG2000. It is not only intended to provide rate-distortion and subjective image quality performance superior to existing standards, but also to provide features and functionalities that current standards can either not address efficiently or in many cases cannot address at all. Lossless and lossy compression, embedded lossy to lossless coding, progressive transmission by pixel accuracy and by resolution, robustness to the presence of bit-errors and region-of-interest coding, are some representative features. It is interesting to note that JPEG2000 is being designed to address the requirements of a diversity of applications, e.g. Internet, color facsimile, printing, scanning, digital …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Discrete Gould transform-Fast realisations and data hiding",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6550157/",
            "Abstract": "The computational complexity of the discrete Gould transform (DGT) is studied and a fast realisation approach is proposed. The reversible difference expansion data hiding method is applied to the DGT coefficients and experimental results are given.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:LPZeul_q3PIC",
            "Publisher": "IET"
        },
        {
            "Title": "2002 14th International Conference on Digital Signal Processing, Proceedings: DSP 2002: July 1-3, 2002, Conference Centre\" PM NOMIKOS\", Santorini, Hellas (Greece)",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=291384842287128096&hl=en&oi=scholarr",
            "Abstract": "TT IS WITH GREAT PLEASURE THAT WE WELCOME YOU TO THE BEAUTIFUL ISLAND OF SANTORINI, FOR OUR 14TH I International Conference on Digital Signal Processing (DSP2002).The DSP Conference has truly come a long way! It was 34 years ago, in 1968, when the first International meeting on Digital Signal Processing was organised in London. Since then, this successful event continued in London every two years and in Florence every three years. The last two meetings took place in Cyprus in 1995 and on Santorini in 1997. The great desire of the General Chair is to succeed having this prominent",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital image watermarking: An overview",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/44645173/ans-b22.pdf",
            "Abstract": "During the last years, the world is rapidly becoming digital in many aspects. Among the most interesting of these aspects is multimedia. Many new technologies have come into our lives along with multimedia and one of the most recent is watermarking. Digital technology has offered users easy ways to create, process, and distribute digital assets. However, these facilities this may become disadvantages at the same time since it is also much easier to illegally copy and manipulate them. In 2000, the Motion Picture Association of America (MPAA) has calculated lost revenues for American motion picture companies from worldwide piracy to be of the amount $2.5 billion a year [1]. Copyright protection is a very important subject but not the only one in which watermarking appears as one of the very promising solutions. In this communication, we are attempting to go back to the early beginning of this exciting new research field, make an overview of its history, discuss the applications and stakes involved, classify the proposed methods, present the problems and benchmarking tools and finally, try to peak into the future.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "JPEG2000 ROI coding in medical imaging applications",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.128.7305&rep=rep1&type=pdf",
            "Abstract": "Region of interest (ROI) coding is one of the innovative functionalities supported by JPEG2000. It enables a non-uniform distribution of the available bit budget (ie image quality) between a selected region (ROI) and the rest of the image (background). This is achieved by appropriate scaling of the background wavelet coefficients. Two different methods are used for ROI coding, the MAXSHIFT method and the scaling-based method. In the present work it is subjectively and objectively verified that ROI coding offers higher diagnostic value for low bit rate (lossy) compression, as opposed to the non-ROI compression of medical images. The MAXSHIFT method, which is included in the baseline algorithm of the standard, proves to be very effective, thus greatly contributing to the use of lossy coding for medical imagery compression.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chaotic-correlation based watermarking scheme for still images",
            "Publication year": 2008,
            "Publication url": "https://dsmc2.eap.gr/wp-content/uploads/2017/05/Chrysochos_ae08.pdf",
            "Abstract": "In this work, a new blind watermarking scheme in frequency domain is presented. The proposed scheme is based on a chaotic function for embedding, and a correlation method for detection. Three-dimensional maps of PSNR and correlation are used for better selection of embedding parameters according to a quality threshold. The scheme shows increased robustness against JPEG compression and cropping. The watermark is also detectable after filtering attacks like low pass filtering, median filtering and Gaussian blur, noise attacks, as well as some geometrical attacks.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Hilbert Curve Based Representation of sEMG Signals for the Problem of Gesture Recognition",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Skodras/publication/333421713_A_Hilbert_Curve_Based_Representation_of_sEMG_Signals_for_the_Problem_of_Gesture_Recognition/links/5ced21d1a6fdcc18c8e77960/A-Hilbert-Curve-Based-Representation-of-sEMG-Signals-for-the-Problem-of-Gesture-Recognition.pdf",
            "Abstract": "Deep learning (DL) has transformed the field of data analysis by dramatically improving the state of the art in various classification and prediction tasks especially in the area of computer vision. In biomedical engineering, a lot of new work is directed towards surface electromyography (sEMG) based gesture recognition addressed as an image classification problem using Convolutional Neural Networks (CNN). In this paper, we utilize the Hilbert space filling curve for the generation of image representations of sEMG signals that can be classified by a CNN. The proposed method is evaluated on different network architectures and yields a classification improvement of more than 3%.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:EVKlETVVbN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Side-information-dependent correlation channel estimation in hash-based distributed video coding",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6111476/",
            "Abstract": "In the context of low-cost video encoding, distributed video coding (DVC) has recently emerged as a potential candidate for uplink-oriented applications. This paper builds on a concept of correlation channel (CC) modeling, which expresses the correlation noise as being statistically dependent on the side information (SI). Compared with classical side-information-independent (SII) noise modeling adopted in current DVC solutions, it is theoretically proven that side-information-dependent (SID) modeling improves the Wyner-Ziv coding performance. Anchored in this finding, this paper proposes a novel algorithm for online estimation of the SID CC parameters based on already decoded information. The proposed algorithm enables bit-plane-by-bit-plane successive refinement of the channel estimation leading to progressively improved accuracy. Additionally, the proposed algorithm is included in a novel DVC …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the use of color appearance modeling for efficient compressed-domain image enhancement",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5413744/",
            "Abstract": "In this paper we propose a compressed-domain image enhancement algorithm based on color appearance modeling. We aim at providing an efficient high-quality JPEG color image enhancement algorithm, in terms of color boosting and low computational cost. For that purpose, the high-performance recently proposed iCAM06 model has been adopted, where a wide range of color appearance phenomena are predicted in an efficient manner. In order to reduce the computational complexity, a pseudo-pixel extraction algorithm is applied to the four low-frequency DCT coefficients of each block, resulting in a scaled RGB version of the input image (directly in the DCT domain), where the iCAM06 model is then applied. To cope with the problem of inadequate information of small-sized images, as only 6.25% of the DCT coefficients are used, a 2-fold upsampling is performed at a preprocessing stage. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A reversible data hiding technique embedding in the image histogram",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/66453511/A_reversible_data_hiding_technique_embed20210421-8817-jbnmxm.pdf",
            "Abstract": "This report is about a data hiding technique based on the modification of the image histogram. It is fully reversible, that means, the original image can be recovered from the marked image, after the hidden data has been extracted. The technique was first presented by Zhicheng Ni et al. It has large embedding capacity, with very good signal–to–noise ratio (PSNR) of the marked image. PSNR is guaranteed to be above 48dB and the actual threshold is much higher than this. The algorithm has successfully been applied to a large number of images. It is also proved that it is a weak embedding algorithm, in which the message embedded is easily damaged by any alteration of the marked image. However, such data hiding techniques have a large number of applications in the areas of image authentication, tamper-proofing and secure medical image data systems.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A discrete Gould transform data hiding scheme",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.3041",
            "Abstract": "Discrete Gould transform has been recently introduced in image processing. This paper proposes a data hiding scheme that uses the discrete Gould transform in order to invisibly embed a secret message. The Gould coefficients represent the differences between neighboring pixels. Small changes of the coefficients generate even smaller changes to the pixels. By this, a high capacity fragile steganographic technique is achieved. The message is easily destroyed after any manipulation, and therefore, its absence can prove that the image has been altered in some way. Because of this property, the proposed technique finds application in image authentication and tamper proofing. Copyright © 2013 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The JPEG2000 still image coding system: an overview. 46 (4): 1103–1127",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=10012906817963443565&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Nov"
        },
        {
            "Title": "Data augmentation of surface electromyography for hand gesture recognition",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/811990",
            "Abstract": "The range of applications of electromyography-based gesture recognition has increased over the last years. A common problem regularly encountered in literature is the inadequate data availability. Data augmentation, which aims at generating new synthetic data from the existing ones, is the most common approach to deal with this data shortage in other research domains. In the case of surface electromyography (sEMG) signals, there is limited research in augmentation methods and quite regularly the results differ between available studies. In this work, we provide a detailed evaluation of existing (ie, additive noise, overlapping windows) and novel (ie, magnitude warping, wavelet decomposition, synthetic sEMG models) strategies of data augmentation for electromyography signals. A set of metrics (ie, classification accuracy, silhouette score, and Davies–Bouldin index) and visualizations help with the assessment and provides insights about their performance. Methods like signal magnitude warping and wavelet decomposition yield considerable increase (up to 16%) in classification accuracy across two benchmark datasets. Particularly, a significant improvement of 1% in the classification accuracy of the state-of-the-art model in hand gesture recognition is achieved. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:N7YTE_TVRugC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Self-authentication of colour images",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.511.2124&rep=rep1&type=pdf",
            "Abstract": "Digital watermarking along with recent cryptographic techniques are today’s most promising methods for copyright protection, authentication, labeling and monitoring of digital media. In this work a semi-fragile watermarking scheme is presented. This scheme is applied to digital images that represent pieces of art, like scanned paintings published in the web. The method aims at the authentication of a specific region of the image, which in the case of scanned paintings is the author’s signature. In this manner we extend the idea of embedding a binary logo for authentication purposes, by embedding a piece of information of the image itself (self authentication).",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Remote FPGA laboratory course development based on an open multimodal laboratory facility",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801950",
            "Abstract": "In this paper the implementation of a remote FPGA laboratory course is proposed, based on a low cost but powerful FPGA development board, the ALTERA DE0-Nano which is powered by an Altera Cyclone IV Field Programmable Gate Array (FPGA) IC. The course is developed based on an open multimodal laboratory facility at the Digital Systems and Media Computing Laboratory of the Hellenic Open University. The course consists of laboratory exercises in the form of VHDL (VHSIC Hardware Description Language) design experiments that the end user can conduct from his or her Personal Computer through a graphical web interface and Altera's Quartus II EDA (Electronic Design Automation) software on hardware that is connected and set-up on a remote server while observing the results in real time. The exercises created for this course are designed to be both educational and interesting while being geared …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "JPEG 2000 implementation on different computer platforms",
            "Publication year": 2000,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4115/0000/JPEG-2000-implementation-on-different-computer-platforms/10.1117/12.411576.short",
            "Abstract": "JPEG2000 is the new standard for the compression of still images. Its objective and subjective image quality performance is superior to existing standards. In this paper the Part I of the JPEG2000 standard is presented in brief, and its implementation complexity on different computer platforms is reported.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:J-pR_7NvFogC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "JPEG2000 parameters against watermarking",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028190/",
            "Abstract": "In the paper, the effects of the imminent JPEG2000 compression standard on watermarking techniques are investigated. It is shown that the choice of different coding parameters affects the performance of transform domain watermarking techniques. Compression ratio is of course important but not the only parameter that a watermarking scheme should take into account.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low bit depth representation motion estimation algorithms: a comparative study",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11554-009-0130-4",
            "Abstract": "A comparative study of low complexity motion estimation algorithms is presented. The algorithms included in the study are the 1-bit transform, the 2-bit transform, the constrained 1-bit transform and the multiplication free 1-bit transform which are using different motion estimation strategies compared to standard exhaustive search algorithm-mean absolute difference or similar combinations. These techniques provide better performance in terms of computational load compared to traditional algorithms. Although the accuracy of motion compensation is only slightly lower comparing to the other techniques, results in terms of objective quality (peak signal-to-noise ratio) and entropy are comparable. This fact, nominates them as suitable candidates for inclusion in embedded devices applications where lower complexity translates to lower power consumption and consequently improved device autonomy.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Managing intellectual property rights: from products to services",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1433816/",
            "Abstract": "Copyright protection is becoming an important issue for organisations that create, use and distribute digital content. One of the most promising methods for copyright protection is digital watermarking, an efficient and robust data hiding technique. In this paper we present the information and system architecture of an intellectual property rights (IPR) protection and management service based on watermarking. We argue that, in an networked world, IPR should migrate from tools to services in order to achieve more scalable and efficient solutions. The possibilities that new standards, and in particular JPEG2000, are offering is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A subband DCT approach to image watermarking",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075555/",
            "Abstract": "A subband-DCT approach for image watermarking is proposed in this communication. The watermark is casted in a selected number of coefficients of all four bands of a one-level decomposition. A great number of coefficients is being used. Each band gives a different detection output. The result is taken as the average detection result of all bands. It is shown that the final result is better than the detection output of each individual band, thus leading to a very robust watermarking scheme.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Medical image authentication and self-correction through an adaptive reversible watermarking technique",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696803/",
            "Abstract": "With the advent of Information Technology in the medical world, various radiological modalities produce a variety of digital medical files most often datasets and images. These files as any digital asset should be protected from unwanted modification of their contents, especially as they contain vital medical information. Thus their protection and authentication seems of great importance and this need will rise along with the future standardization of exchange of data between hospitals or between patients and doctors. Watermarking, a technique first introduced for multimedia files, provides a method for authentication and protection and has been recently applied to medical images. In this paper, we propose a novel watermarking technique where the region of non-interest (RONI) of medical Magnetic Resonance Imaging (MRI) images, is used to embed the region of interest (ROI). In this way, any tampering attempt, not …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Novel Finger Vein Recognition System Based on Enhanced Maximum Curvature Points",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8448746/",
            "Abstract": "Finger vein recognition is a biometric method of authentication that offers high security, efficiency and stability. In this paper we propose a new finger vein recognition system that utilizes the Enhanced Maximum Curvature Points (EMC) technique for finger vein pattern extraction and introduces a new pre-processing stage. In addition, it combines two matching methods, leading to better recognition performance in terms of EER, FAR, FRR and recognition rate than other methods. We present the experimental results obtained by applying our system on the databases SDUMLA-HMT, Tsingua, FV-USM and HKPU and compare them with similar approaches applied on these databases.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ae0xyBWlIcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The jpeg 2000 still image compression standard",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/952804/",
            "Abstract": "One of the aims of the standardization committee has been the development of Part I, which could be used on a royalty- and fee-free basis. This is important for the standard to become widely accepted. The standardization process, which is coordinated by the JTCI/SC29/WG1 of the ISO/IEC has already produced the international standard (IS) for Part I. In this article the structure of Part I of the JPFG 2000 standard is presented and performance comparisons with established standards are reported. This article is intended to serve as a tutorial for the JPEG 2000 standard. The main application areas and their requirements are given. The architecture of the standard follows with the description of the tiling, multicomponent transformations, wavelet transforms, quantization and entropy coding. Some of the most significant features of the standard are presented, such as region-of-interest coding, scalability, visual weighting …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Data Hiding Scheme Based on LBPROT Pattern.",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/66453331/22.pdf",
            "Abstract": "Texture classification is mainly used for segmentation of texture regions and content-based access to image databases. Lately these texture classification patterns have been applied in an additional area of computer science, the data hiding field. In this paper the use of Rotation-Invariant Local Binary Pattern (LBPROT) is described, in order to invisibly embed secret data into a cover image. Pixel values are modified in such a way that the texture satisfies the message requirements. The method is presented and studied in terms of capacity, image quality and robustness to geometrical attacks. This semi-blind data hiding scheme in spatial domain, was proven to be robust only in rotation attack, strictly rotated by angles of kπ/2. The LBPROT method is compared to the Local Binary Pattern (LBP), which is also used for data hiding. Comparison revealed that both LBPROT and LBP schemes perform well in images with smooth areas and can be used for authentication and secret communications.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multipurpose color image watermarking",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Skodras/publication/220085238_Multipurpose_Color_Image_Watermarking/links/0912f50eb227c541ba000000/Multipurpose-Color-Image-Watermarking.pdf",
            "Abstract": "A novel approach for color image watermarking is proposed in this communication. The aim of the work is to combine robust and fragile watermarking in order to construct a multipurpose watermarking scheme. Watermarking methods are com-plementing each other such that under any circumstance at least one of them may survive and prove the identity of the owner or the authenticity of the image content. A robust watermark is embedded into the frequency domain; the watermark is made adaptive to the cover image. A semi-fragile watermark is embedded into the spatial domain of the color image. Authentication is achieved by means of embedding an approximation of the image into itself. Specifically, the luminance of the image is inserted into the three color channels, using a mapping function. For image copyright protection, higher robustness can be achieved whereas for image authentication tampered regions can be detected and reconstructed. Both of the goals are accomplished in an oblivious manner. Experimental verifications indicate that the proposed unified image watermarking is an appropriate choice.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:WbkHhVStYXYC",
            "Publisher": "ISCA"
        },
        {
            "Title": "The JPEG 2000 suite",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=4eOnNwXah7EC&oi=fnd&pg=PR1&dq=info:o3GycnEXgoIJ:scholar.google.com&ots=CiB2uB_RFY&sig=WZ-G0jDe6k9ocB-bmxR7Uqdf2RA",
            "Abstract": "The JPEG 2000 Suite provides a comprehensive overview of the baseline JPEG 2000 standard and its extensions. The first part of the book sets out the core coding system, additions to the standard and reference software. The second part discusses the successful deployment of JPEG 2000 in application domains such as video surveillance, digital cinema, digital television, medical imaging, defence imaging, security, geographic imaging and remote sensing, digital culture imaging and 3D graphics. The book also presents implementation strategies accompanied by existing software and hardware solutions. Describes secure JPEG 2000 (JPSEC), interactivity protocols (JPIP), volumetric image data compression (JP3D) and image compression in wireless environments (JPWL), amongst others. Uses a structure which allows for easy cross-reference with the components of the standard. Sets out practical implementation examples and results. Examines strategies for future image compression techniques, including Advanced Image Coding and JPEG XR. Includes contributions from international specialists in industry and academia who have worked on the development of the JPEG 2000 standard. Additional material can be found at www. jpeg. org. The JPEG 2000 Suite is an excellent introduction to the JPEG 2000 standard and is of great appeal to practising electronics engineers, researchers, and hardware and software developers using and developing image coding techniques. Graduate students taking courses on image compression, digital archiving, and data storage techniques will also find the book useful, as will graphic designers, artists …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:IjCSPb-OGe4C",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "JPEG2000 image coding system theory and applications",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1693472/",
            "Abstract": "JPEG2000, the new standard for still image coding, provides a new framework and an integrated toolbox to better address increasing needs for compression. It offers a wide range of functionalities such as lossless and lossy coding, embedded lossy to lossless coding, progression by resolution and quality, high compression efficiency, error resilience and region-of-interest (ROI) coding. Comparative results have shown that JPEG2000 is indeed superior to established image compression standards. Overall, the JPEG2000 standard offers the richest set of features in a very efficient way and within a unified algorithm. The price of this is its additional complexity, but this should not be perceived as a disadvantage, as the technology evolves rapidly",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chromospheric evershed flow",
            "Publication year": 2003,
            "Publication url": "https://www.aanda.org/articles/aa/abs/2003/21/aa3078/aa3078.html",
            "Abstract": "We studied the chromospheric Evershed flow from filtergrams obtained at nine wavelengths along the Hα profile. We computed line-of-sight velocities based on Becker's cloud model and we determined the components of the flow velocity vector as a function of distance from the center of the sunspot, assuming an axial symmetry of both the spot and the flow. We found that the flow velocity decreases with decreasing height and that the maximum of the velocity shifts towards the inner penumbral boundary. The flow related to some fibrils deviates significantly from the average Evershed flow. The profile of the magnitude of the flow velocity as a function of distance from the spot center, indicates that the velocity attains its maximum value in the downstream part of the flow channels (assumed to have the form of a loop). This behavior can be understood in terms of a critical flow that pass from subsonic to supersonic near …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "EDP Sciences"
        },
        {
            "Title": "Protecting intellectual property rights and the JPEG2000 coding standard",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_67",
            "Abstract": "The ever-increasing use of the Internet and file sharing applications based on Peer to Peer networks has alarmed content authors, providers and resellers of digital content. Techniques proposed for protecting digital media include watermarking, use of metadata and self-protection and self-authentication. In this paper we review the most important of these methods and analyse their potential use in Digital Rights Management systems. The main focus is on IPR management through watermarking for digital images coded with the new and a lot promising compression standard: JPEG2000.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Discrete wavelet transform: an introduction",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Skodras/publication/288822448_Discrete_Wavelet_Transform_An_Introduction/data/5683ec6608ae1e63f1f1bfa6/DWT-intro.pdf",
            "Abstract": "In the present technical report the Discrete Wavelet Transform is introduced. The ztransform and the discrete Fourier transform along with their properties are first reviewed. Then the up-sampling and down-sampling processes are described. Subband transforms, two-channel analysis/synthesis filter banks and quadrature mirror filters follow. Finally, the discrete wavelet transform is introduced and its subband implementation is described.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the use of the Kinect Sensor in Rehabilitation",
            "Publication year": 2013,
            "Publication url": "https://researchportal.vub.be/en/publications/on-the-use-of-the-kinect-sensor-in-rehabilitation",
            "Abstract": "On the use of the Kinect Sensor in Rehabilitation — Vrije Universiteit Brussel Skip to main \nnavigation Skip to search Skip to main content Vrije Universiteit Brussel Logo Help & FAQ \nEnglish Nederlands Home Research Units Profiles Projects Research output Activities \nEquipment Prizes Press / Media Student theses Impacts Search by expertise, name or \naffiliation On the use of the Kinect Sensor in Rehabilitation Anna Mavriki, Bart Jansen, \nVasillis Fotopoulos, Jan Cornelis, Athanassios Skodras Electronics and Informatics \nResearch output: Chapter in Book/Report/Conference proceeding › Meeting abstract (Book) \nOverview Fingerprint Abstract nvt Original language English Title of host publication \nProceedings of the 5th Panhellenic Conference on Biomedical Technology Publication \nstatus Published - 6 Apr 2013 Event Unknown - Duration: 6 Apr 2013 → … Publication \nseries Name Proceedings of the 5th Panhellenic 6//…",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:dw5aoL0HVgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Colour image authentication based on a self-embedding technique",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028195/",
            "Abstract": "In the paper an approach for digital image authentication is described. The authentication process is achieved by means of a watermarking scheme that embeds an approximation of the image into itself. Specifically, the luminance of the image is inserted into the three colour channels, using a mapping function. The embedding process is implemented using a secret key k that maps the position of the pixel, where the luminance information is taken from, to the position of the pixel in which the watermark information is embedded. The quality of the watermarked images remains very high both subjectively and objectively. The proposed approach belongs to the category of semi-fragile techniques used for image authentication.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Two-band fast Hartley transform",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/document/7006871/",
            "Abstract": "Efficient algorithms have been developed over the past 30 years for computing the forward and inverse discrete Hartley transforms (DHTs). These are similar to the fast Fourier transform (FFT) algorithms for computing the discrete Fourier transform (DFT). Most of these methods seek to minimise the complexity of computations and/or the number of operations. A new approach for the computation of the radix-2 fast Hartley transform (FHT) is presented. The proposed algorithm, based on a two-band decomposition of the input data, possesses a very regular structure, avoids the input or out data shuffling, requires slightly less multiplications than the existing approaches, but increases the number of additions.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "IET"
        },
        {
            "Title": "Robust Image Watermarking By Subband DLT",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.534.6152&rep=rep1&type=pdf",
            "Abstract": "In the present communication an oblivious watermarking scheme is proposed, based on the subband Discrete Laguerre Transform (subband-DLT). A normally distributed watermark is embedded only in the approximations of the Haar decomposed DLT coefficients. As the watermark is embedded in the lower frequencies, it is more robust. The proposed algorithm is compared with a subband-DCT based scheme. The presented results demonstrate the robustness of the method against some common image processing operations such as compression, scaling, uniform noise, gaussian noise, median filtering, cropping and multiple watermarking.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The JPEG 2000 suite",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=6323369072587790439&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:fXCg-C-QWH4C",
            "Publisher": "Wiley"
        },
        {
            "Title": "An FPGA implementation of the ZUC stream cipher",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6037494/",
            "Abstract": "In this paper a hardware implementation of ZUC stream cipher is presented. ZUC is a stream cipher that forms the heart of the 3GPP confidentiality algorithm 128-EEA3 and the 3GPP integrity algorithm 128-EIA3, offering reliable security services in Long Term Evolution networks (LTE). A detailed hardware implementation is presented in order to reach satisfactory performance results in LTE systems. The design was coded using VHDL language and for the hardware implementation, a XILINX Virtex-5 FPGA was used. Experimental results in terms of performance and hardware resources are presented.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "C, Christopoulos, and T",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9493803964865757952&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Could DCT Reveal Photorealistic Images?",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900752/",
            "Abstract": "With the development of computer graphics rendering software, it has become extremely difficult to distinguish whether an image is computer generated or a natural one. Therefore, it is really important to device robust methods for correctly classifying these two categories of images. In this work, a new approach to face the above problem is developed that is based upon the discrete cosine transform (DCT) of an image, in the YCbCr color space. The statistical features extracted, have been tested in suitable databases and the remarkable results indicate that the proposed model has a great potential to be used in digital images forensics.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:7q08wCQPkLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hilbert sEMG Data Scanning for Hand Gesture Recognition based on Deep Learning",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-020-05128-7",
            "Abstract": "Deep learning has transformed the field of data analysis by dramatically improving the state of the art in various classification and prediction tasks, especially in the area of computer vision. In biomedical engineering, a lot of new work is directed toward surface electromyography (sEMG)-based gesture recognition, often addressed as an image classification problem using convolutional neural networks (CNNs). In this paper, we utilize the Hilbert space-filling curve for the generation of image representations of sEMG signals, which allows the application of typical image processing pipelines such as CNNs on sequence data. The proposed method is evaluated on different state-of-the-art network architectures and yields a significant classification improvement over the approach without the Hilbert curve. Additionally, we develop a new network architecture (MSHilbNet) that takes advantage of multiple scales of …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:EO1llL0aI9sC",
            "Publisher": "Springer"
        },
        {
            "Title": "Bit rate transcoding of H. 264 encoded movies by dropping frames in the compressed domain",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5606302/",
            "Abstract": "A new technique for controlling the bit-rate of H.264 encoded sequences is presented. The technique achieves bit-rate control by dropping frames directly in the compressed domain. The dropped frames are carefully selected so as to either eliminate or cause non perceptible drift errors in the decoder. The technique suits well for H.264 encoded sequences such as movies and tv news, which are transmitted over wireless networks.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA-based performance analysis of stream ciphers ZUC, Snow3g, Grain V1, Mickey V2, Trivium and E0",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014193311200169X",
            "Abstract": "In this paper, the hardware implementations of six representative stream ciphers are compared in terms of performance, consumed area and the throughput-to-area ratio. The stream ciphers used for the comparison are ZUC, Snow3g, Grain V1, Mickey V2, Trivium and E0. ZUC, Snow3g and E0 have been used for the security part of well known standards, especially wireless communication protocols. In addition, Grain V1, Mickey V2 and Trivium are currently selected as the final portfolio of stream ciphers for Profile 2 (Hardware) by the eStream project. The designs were implemented by using VHDL language and for the hardware implementations a FPGA device was used. The highest throughput has been achieved by Snow3g with 3330 Mbps at 104 MHz and the lowest throughput has been achieved by E0 with 187 Mbps at 187 MHz. Also, the most efficient cipher for hardware implementation in terms of throughput …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Adaptive color image watermarking",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=10248605604137212349&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Watermarking of Images in the DLT Domain",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9648616976605609709&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "JPEG2000: the new still picture compression standard",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/357744.357757",
            "Abstract": "This paper presents an overview of the upcoming JPEG2000 still picture compression standard. JPEG2000 is not only intended to provide rate-distortion and subjective image quality performance superior to existing JPEG standard, but to also provide functionality that the current JPEG standard can either not address efficiently nor address at all. Lossless and lossy compression, encoding of very large images, progressive transmission by pixel accuracy and by resolution, robustness to the presence of bit-errors and region-of-interest coding, are some representative examples of its features.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new data hiding scheme for scene change detection in H. 264 encoded video sequences",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4607425/",
            "Abstract": "A new data hiding scheme for scene change detection in H.264 streams is presented. The proposed scheme takes advantage of the different block sizes used by the H.264 encoder during the inter prediction stage in order to hide the scene change information inside the encoded sequence. This information enables real time scene change detection directly from the H.264 stream.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A smartphone-based fall detection system for the elderly",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8073568/",
            "Abstract": "Falls can be severe enough to cause disabilities especially to frail populations. Thus, prompt health care provision is essential to prevent and restore any harm. The purpose of this study is to develop a smartphone-based fall detection system that can distinguish between falls and activities of daily living (ADL). The typical fall detection system consists of a sensing component and a notification module. Android devices, equipped with sensors and communication services, are the best candidates for the development of such systems. This work incorporates a threshold based algorithm, whose accuracy is enhanced by a k Nearest Neighbor (kNN) classifier. In addition, this paper proposes the implementation of a personalization and power regulation system. It achieves high fall detection accuracy, (97.53% sensitivity and 94.89% specificity), which is comparable to related works.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:LGh1lRt-7sUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "JPEG2000: The upcoming still image compression standard",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865501000794",
            "Abstract": "With the increasing use of multimedia technologies, image compression requires higher performance as well as new features. To address this need in the specific area of still image encoding, a new standard is currently being developed, the JPEG2000. It is not only intended to provide rate-distortion and subjective image quality performance superior to existing standards, but also to provide functionality that current standards can either not address efficiently or not address at all.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:d1gkVwhDpl0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Compression of confocal microscopy images: a comparative study",
            "Publication year": 2008,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/7000/70000I/Compression-of-confocal-microscopy-images-a-comparative-study/10.1117/12.785077.short",
            "Abstract": "In the present communication an extensive study of lossless and lossy compression of laser confocal microscopy images is conducted. For the lossy (irreversible) case, both objective and subjective results are given. It is shown that the JPEG2000 compression standard outperforms all others, even the recently introduced HD Photo, in both the reversible and irreversible cases. More specifically, the JPEG2000 lossless performance is approximately 15% better than the next best image data compression algorithm tested (namely the PNG) and the JPEG2000 lossy compression objective performance results are at least 3dB better than that of HD Photo or JPEG.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:6B7w4NK6UsoC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Could Grid Facilitate Demanding Media Watermarking Applications?",
            "Publication year": 2004,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00190475/",
            "Abstract": "Copyright protection is becoming an important issue for organisations that distribute digital content through e-learning applications. One of the most promising methods for copyright protection is digital watermarking, a highly demanding application in terms of CPU load. In this communication, some specific cases are presented where GRID computing could be used as an enabling/assisting technology for watermarking. Specific cases of heavy load mathematical transformations for large media objects are discussed. A proposal for incorporating the watermarking procedure in the Grid architecture is also briefly presented.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Greek participation to Solar Orbiter development",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6064653/",
            "Abstract": "Greece, via its PRODEX membership intends to meaningfully participate to the instrument development of a flagship ESA mission, the Solar Orbiter (SolO). This involvement pertains to hardware development for SolO's Spectrometer/Telescope for Imaging X-rays (STIX), namely, STIX's movable attenuator. SolO will allow close-up and high-latitude studies of our mother star, the Sun, based mostly on remote-sensing measurements (imaging). STIX is a critical SolO instrument, enabling one of its major science goals: understanding and acceleration of electrons at the Sun and their transport into interplanetary space. The attenuator, or shutter, that will be developed by the Greek team, is a critical component of the STIX instrument. Attenuators are dictated by the substantial dynamical range of incident X-ray fluxes from solar flares: the largest X-ray flares can give as many as 10 5  more count rates in X-ray photons …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comparative study of hardware architectures for lightweight block ciphers",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790611001984",
            "Abstract": "A hardware-based performance comparison of lightweight block ciphers is conducted in this paper. The DESL, DESXL, CURUPIRA-1, CURUPIRA-2, HIGHT, PUFFIN, PRESENT and XTEA block ciphers have been employed in this comparison. Our objective is to survey what ciphers are suitable for security in Radio Frequency Identification (RFID) and other security applications with demanding area restrictions. A general architecture option has been followed for the implementation of all ciphers. Specifically, a loop architecture has been used, where one basic round is used iteratively. The basic performance metrics are the area, power consumption and hardware resource cost associated with the implementation resulting throughput of each cipher. The most compact cipher is the 80-bit PRESENT block cipher with a count of 1704 GEs and 206.4 Kbps, while the largest in area cipher is the CURUPIRA-1. The …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Efficient down-scaling of DCT compressed images",
            "Publication year": 2005,
            "Publication url": "https://patents.google.com/patent/US6868188B2/en",
            "Abstract": "In a method and a device for calculation of the Discrete Cosine Transform (DCT) only the DCT coefficients representing the first half and the second half of an original sequence are required for obtaining the DCT for the entire original sequence. The device and the method are therefore very useful when calculations of DCTs of a certain length is supported by hardware and/or software, and when DCTs of other sizes are desired. Areas of application are for example still image and video transcoding, as well as scalable image and/or video coding and decoding.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Content Identification By Maria Chatzigiorgaki And Athanassios N",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=9587167080701719699&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:rCuJAniQoLoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transform domain watermarking: adaptive selection of the watermark’s position and length",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5150/0000/Transform-domain-watermarking--adaptive-selection-of-the-watermarks-position/10.1117/12.505903.short",
            "Abstract": "Transform domain methods have dominated the watermarking field from its early stages. In these methods some coefficients are selected and modified according to certain rules. The two most important numbers in this process are the length and the position of the watermark. These are usually heuristically chosen. In order to handle this problem, an adaptive scheme for the selection of the proper coefficients is analysed in the present communication.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Efficient computation of the discrete Pascal transform",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071074/",
            "Abstract": "The recently proposed discrete Pascal transform possesses a computational complexity for an N-point vector of the order of N 2  for both multiplications and additions. In the present work an efficient structure is proposed, which eliminates the multiplications and halves the number of additions.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image Watermarking for Quality Control Based on Modified Key-Dependent DCT Basis Functions",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288636/",
            "Abstract": "The vast majority of the available watermarking schemes, operate in the frequency domain. Use of key-dependent transforms has been proposed as an extra level of security for these schemes while providing at the same time the ability to distribute different levels of quality to different customers. The major drawback of such schemes, is the computational complexity, both in the generation of such transforms and making them orthogonal. The proposed scheme, creates a modified DCT basis based on a secret key, which is approximately orthogonalized by means of a fast and simple algorithm. The method is very useful in cases of JPEG input images, since it can be applied directly into the compressed domain. The main focus here is both on speed issues as well as on the fact that only authorized users can enjoy the best quality from the marked medium.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint DC coefficient band decoding and motion estimation in Wyner-Ziv video coding",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6004904/",
            "Abstract": "In contrast to traditional predictive coding, Wyner-Ziv video coding enables low-cost encoding architectures, in which the computationally expensive tasks for performing motion estimation are shifted to the decoder-side. In Wyner-Ziv video coding, side-information generation is a key aspect profoundly affecting the compression capacity of the system. This paper presents a novel technique which enables side-information refinement after DC coefficient band decoding in a transform-domain Wyner-Ziv video codec. The proposed side-information refinement approach performs overlapped block motion estimation and compensation, utilizing multi-hypothesis pixel-based prediction. The experimental results show that the presented Wyner-Ziv video codec incorporating the proposed technique yields significant and systematic compression gains of up to 23.22% with respect to the state-of-the-art DISCOVER codec.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TECHNICAL REPORT No. TR2000/10/01",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/31053159/ans-e12.pdf",
            "Abstract": "Spread spectrum techniques have been successfully applied in still image watermarking. Pseudorandom noise sequences and transform coefficients of logo images are mostly used in these methods. In this report a new signature casting scheme is proposed. The watermark/signature is a 32-bit sequence and the casting domain is the DCT coefficients of the entire image. The 32 largest coefficients are selected for embedding. The original image is needed for the extraction of the signature. Various tests have been performed and results appear quite promising.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real time data hiding by exploiting the IPCM macroblocks in H. 264/AVC streams",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s11554-008-0100-2",
            "Abstract": "A new method for data hiding in H.264/AVC streams is presented. The proposed method exploits the IPCM encoded macroblocks during the intra prediction stage in order to hide the desired data. It is a blind data hiding scheme, i.e. the message can be extracted directly from the encoded stream without the need of the original host video. Moreover, the method exhibits the useful property of reusing the compressed stream for hiding different data numerous times without considerably affecting either the bit-rate or the perceptual quality. This property allows data hiding directly in the compressed stream in real time. The method perfectly suits to covert communication and content authentication applications. ",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Improved gesture recognition based on sEMG signals and TCN",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8683239/",
            "Abstract": "In recent years, the successful application of Deep Learning methods to classification problems has had a huge impact in many domains. In biomedical engineering, the problem of gesture recognition based on electromyography is often addressed as an image classification problem using Convolutional Neural Networks. In this paper, we approach electromyography-based hand gesture recognition as a sequence classification problem using Temporal Convolutional Networks. The proposed network yields an improvement in gesture recognition of almost 5% to the state of the art reported in the literature, whereas the analysis helps in understanding the limitations of the model and exploring new ways to improve its performance.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:Usae8uB1euoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power FPGA implementations of 256-bit Luffa Hash function",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5615575/",
            "Abstract": "Low power techniques in a FPGA implementation of the hash function called Luffa are presented in this paper. This hash function is under consideration for adoption as standard. Two major gate level techniques are introduced in order to reduce the power consumption, namely the pipeline technique (with some variants) and the use of embedded RAM blocks instead of general purpose logic elements. Power consumption reduction from 1.2 to 8.7 times is achieved by means of the proposed techniques compared with the implementation without any low power issue.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "IEEE Signal Process",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=10939124953611338004&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:-Rb0Dl3RFGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid fractal/DCT image compression method",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028341/",
            "Abstract": "DCT and fractal compression incorporate certain advantages and disadvantages. In the present communication, a hybrid fractal/DCT image compression technique is presented. DCT is employed whenever the quality of the decoding block is of sufficient quality or else fractal compression technique is used for the encoding that will also lead to great compression. Pruned DCT is used to lower even more the computational time. The result is faster coding than fractals, better compression ratios than the DCT and better image quality from both techniques.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high speed FPGA implementation of the 2D DCT for ultra high definition video coding",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622742/",
            "Abstract": "This paper presents two high performance FPGA architectures for the 2D DCT computation for Ultra High Definition video coding systems. Both architectures use Distributed Arithmetic to perform the necessary multiplications instead of traditional multipliers. The first architecture uses 105 clock cycles to transform an 8×8 block and reaches a rate of up to 206 samples per second at a 338.5 MHz frequency, while the second one requires 65 cycles for each 8×8 block and achieves a rate equal to 252 samples per second at 256 MHz. Both architectures have been implemented using VHDL. Virtex7 FPGA of Xilinx has been used for the realization of both implementations.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Digital Image Watermarking: On the Enhancement of Detector Capabilities",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/44645218/Digital_Image_Watermarking_On_the_Enhanc20160411-8140-1paz9mg.pdf",
            "Abstract": "Digital watermarking seems to be one of the most promising methods for copyright protection of digital images, authentication, labeling and monitoring. Since digital images can be published in the Internet, anyone can access and manipulate them. Such kind of manipulations (attacks) falls in one of the following categories:(a) those applied without malicious purposes and (b) those applied with the aim of removing or destroying the watermark. Our model recovers geometric transformations (ie rotation, scaling, translation or a combination of them). Geometric transformations are considered as some of the basic attacks in digital watermarking in both of the above-mentioned cases. The model focuses not on the watermarking method, but rather on the detector’s capabilities. This is achieved by selecting several regions in an attacked watermarked image, which hold sufficient information about the watermark, and trying to apply an inverse operation in order to extract the watermark. It is assumed that one or more watermarks are spread in the image. An analysis of the attack methods has given the information about the effectiveness of every function or combination of functions in the watermarked material, the amount of data needed in order to represent such an operation and the possibility of an operation to be inverted. By means of all this information we can give a solution to the blind image registration problem in watermarking of digital images, ie the process of inverting the distortion of the attack with the aim to detect the watermark.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "STESCAL3D: subjective evaluation of HD stereo video streaming using H. 264 SVC in diverse laboratory environments",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7148151/",
            "Abstract": "This paper presents a new 3D video database (STESCAL3D -Stereoscopic Scalable 3D), made up of 3D stereo video sequences affected by different types of degradations. A set of subjective quality grades have been collected in three geographically displaced sites. The database contents have been produced using scalable video coding to encode 3D stereo video clips with distinct encoding parameters, after which different transmission degradations have been applied to the encoded video streams. These sequences have been subjectively evaluated by observers from three countries, Croatia, Portugal and Greece, using a purpose-built web-based platform. The subjective quality data compiled were processed, analyzed and compared to quality estimates obtained using several well-known objective measures. It is shown that the correlation between objective quality estimates and the subjective quality grades …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the comparison of wearable sensor data fusion to a single sensor machine learning technique in fall detection",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/263886",
            "Abstract": "In the context of the ageing global population, researchers and scientists have tried to find solutions to many challenges faced by older people. Falls, the leading cause of injury among elderly, are usually severe enough to require immediate medical attention; thus, their detection is of primary importance. To this effect, many fall detection systems that utilize wearable and ambient sensors have been proposed. In this study, we compare three newly proposed data fusion schemes that have been applied in human activity recognition and fall detection. Furthermore, these algorithms are compared to our recent work regarding fall detection in which only one type of sensor is used. The results show that fusion algorithms differ in their performance, whereas a machine learning strategy should be preferred. In conclusion, the methods presented and the comparison of their performance provide useful insights into the problem of fall detection. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:Xxrp-jDxsD4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "SSCS Distinguished Lecturers Visit Athens and Varna",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4785698/",
            "Abstract": "The Society's Region 8 DL Tour, hosted by Athanassios Skodras (SSCS-Greece) and Jordan Kolev (SSCS-Varna) in September 2007, included Ian Galton, John Long, Mircea Stan and Takayasu Sakurai. Remote attendees in Greece were able to pose questions via email or skype to the Chapter Chair.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "color image adaptive watermarkkingJ",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13495873446479657374&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Watermarking by multiresolution Hadamard transform",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Skodras/publication/250864041_Watermarking_by_Multi-resolution_Hadamard_Transform/links/55b24fe008ae9289a08535db/Watermarking-by-Multi-resolution-Hadamard-Transform.pdf",
            "Abstract": "In this paper a watermarking algorithm for digital images is presented. The method operates in the multi-resolution Hadamard transform domain. The watermark is constructed as a normally distributed random vector and is inserted into the perceptually most significant spectral components of the image. It is found that insertion of watermark under these conditions makes the watermark robust to image processing and common geometric operations. By exploiting the statistical properties of the embedded sequence, the mark can be found without using the original image. The algorithm is benchmarked against StirMark and compared to an escrow watermarking technique.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Robust Watermarking Method Supported by an Image Registration Mechanism for Securing Digital Image Libraries",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/66453541/A_Robust_Watermarking_Method_Supported_b20210421-32010-1if4n8i.pdf",
            "Abstract": "The issue addressed in this work is the design and implementation of a robust watermarking method enhanced with an image registration scheme. The method is integrated into the framework of a Digital Image Library allowing advanced security features like copyright protection, copy control and transaction tracking. For the evaluation of the watermarking method widely accepted benchmarking tools are utilized.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dlt-based digital image watermarking",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/44645182/ans-c34.pdf",
            "Abstract": "The effectiveness of the discrete Laguerre transform (DLT) in digital image watermarking is examined in the present communication. Extensive performance comparisons between the DLT-and DCT-domain watermarking are conducted. It is seen that the quality of the DLT-domain watermarked images is higher than the corresponding DCT-domain watermarked images. From the robustness point of view, it is proved that both the DLT and DCT watermarking approaches have similar performance.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust watermarking of digital images based on chaotic mapping and DCT",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080492/",
            "Abstract": "In this paper, a new robust watermarking scheme is presented. The algorithm is based on a chaotic function and a correlation method for detection, operating in the frequency domain. The proposed scheme is blind and comparing to other chaos related watermarking methods, experimental results exhibit satisfactory robustness against a wide variety of attacks such as filtering, noise addition, geometric manipulations and JPEG compression with very low quality factors. The scheme also outperforms traditional frequency domain embedding both in terms of robustness and quality.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel approach to finger vein authentication",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7950606/",
            "Abstract": "Finger vein patterns are unique biometric features, which differentiate from individual to individual, so they are suitable for authentication applications. Systems based on the use of this feature have numerous advantages such as low cost and high accuracy. A new finger vein authentication approach is proposed, which is based on the efficient detection of the non-vein regions, in order to define the main vein patterns. The proposed method is robust in extracting and depicting not only the finger's vein pattern, but also other important features such as the veins' width. The authentication algorithm has been evaluated on a finger vein database of 400 images. The false acceptance and false rejection rates achieved are 0% and 0.5% respectively.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new approach to gradual video transition detection",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377399/",
            "Abstract": "In this paper the problem of shot boundary detection for gradual transitions within video sequences is treated using statistical tests in conjunction with the Iterative Self Organizing Data Analysis (ISODATA) classification algorithm for consecutive video frames. The confusion matrix from the classification results is formed in order to calculate the kappa coefficient and from this to identify the transition. Experimental and comparative results with recently proposed methods are promising.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evolving from a traditional distance learning model to e-learning",
            "Publication year": 2003,
            "Publication url": "https://www.scienceopen.com/hosted-document?doi=10.14236/ewic/2LEGE2003.4",
            "Abstract": "This paper presents experiences from the course of Informatics at the Hellenic Open University. Problems faced and lessons learned are presented relating to the introduction of e-learning capabilities into this course that was initially based on a traditional distance-learning model. The paper discusses the need that imposed the introduction of e-learning infrastructure and procedures into the course, the steps taken and the students’ attitude towards these changes. It also discusses points where the GRID infrastructure can aid in the educational procedure.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A New Spatio-Temporal Predictor for Motion Estimation in H. 264 Video Coding",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4279181/",
            "Abstract": "The new JVT H.264 video coding standard is becoming the dominant standard, mainly due to its high coding efficiency. Among all modules in the encoder, motion estimation plays a key role since it can significantly affect the output quality of an encoded sequence. However, motion estimation requires a significant part of the encoding time. Thus, various fast motion estimation algorithms have been proposed. The H.264 reference encoder has currently adopted three fast motion estimation algorithms. These algorithms aim at reducing the search area by predicting the search points using suitable predictors. In this paper we propose a new spatio-temporal predictor and we study the effectiveness of different predictors in order to find out whether these predictors truly contribute to the decrease of motion estimation time without affecting video quality and adding undesirable complexity to the encoder.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "GRID technologies=>‘Education’=‘Distance education’",
            "Publication year": 2005,
            "Publication url": "https://www.scienceopen.com/hosted-document?doi=10.14236/ewic/EL2005.21",
            "Abstract": "This paper discusses the new possibilities that Grid technologies create in education, presents current learning paradigms and makes a prediction about the way in which Grid technologies may affect the future of education. The case of the Hellenic Open University (HOU) is presented and the current educational technologies and tools used are illustrated. The paper also presents a scenario for the utilization of Grid technologies at HOU and discusses the challenges that such infrastructure creates, as well as the services that it can enable for HOU students.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The JPEG2000 image compression standard in mobile health",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-26559-7_23",
            "Abstract": "Provisionof expertadvice and consultation, in real time, to rural or remote communities or even in mobile emergency (ambulance) cases has always been a demanding need. The vast expansion of mobile and wireless networks can greatly contribute towards the fulfilment of this need. However, medical image transmission remains the main drawback in such applications. Medical imagery (X-ray, ultrasound, mammograms, MRI, etc) is of high volume and has to be compressed in a lossless (bit preserving) manner in order to maintain its diagnostic value unaffected. For example, digital X-ray images of size 2k x 2k with 12 bits of pixel accuracy have become a commodity. Lossless compression of such an image will result in a reduction of its file size by 2 to 3 times (Adams and Kossentini, 2000), namely it will need approximately 20Mbits of storage instead of 50Mbits. But even such an image size is prohibited for a …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "JPEG 2000 in 3‐D Graphics Terrain Rendering",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=4eOnNwXah7EC&oi=fnd&pg=PA421&dq=info:fYWHllDCZ1wJ:scholar.google.com&ots=CiB2uB_RF0&sig=aTrEjmIFYqkEB0cuyunGBnqzHbw",
            "Abstract": "Three-dimensional (3-D) content is an essential component in 3-D graphics applications (Figure 16.1) ranging from visually appealing geographic information systems (GIS)(Figure 16.2; see also Section 12.2. 5) to 3-D games (Figure 16.3) with walkthrough/flyover animations (Figure 16.4). 3-D content is typically modeled as a combination of geometry (ie the object’s 3-D shape) and appearance (ie textures and color rendering). A popular way for modeling the geometry is to tile the surface of the 3-D object with triangles (see Figure 16.1, left). The shape guides the 3-D rendering engine in calculating the screen pixels covered by the 3-D object. The color of these pixels is defined with a combination of a mathematical model of materials and 2-D textures (see Figure 16.1, right). 2-D textures add important visual information to graphical applications requiring a high level of realism and immersion (Figures 16.2 and 16.3). GIS and 3-D games applications–and especially their terrains–represent vast amounts of 2-D texture data (Figure 16.5). For example, terrains covering a horizon of 1 km width, at a three-color pixel density of 16× 16 pixels per m2 and a flyover speed of 20 m/s, trigger a texture transfer speed of 123 Mbit/s, hardly achievable even with performant LAN connections. Not all network connections and device processors are capable of providing such high bandwidth and associated processing demands, and hence special software and hardware precautions have to be taken into account to guarantee cross-network and cross-platform interoperability of 3-D content. A texture compression scheme with high compression capabilities as JPEG …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:tzM49s52ZIMC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "TECHNICAL REPORT No. TR2000/06/04",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.604.4298&rep=rep1&type=pdf",
            "Abstract": "The wide use of digital media during the past few years, has led to an increase of digital piracy and tampering. To deal with these problems, the concept of watermarking has been introduced. Transform based methods seem to be quite robust. The use of subband DCT for image watermarking is being proposed in this work. We cast the watermark in all four bands of a one level decomposition. The watermark is being detected in each individual band and the mean of all detection outputs is used as our final result. Numerous tests on many images for various attacks are performed. Results show that the scheme is quite robust.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:D90uR9ClOh8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time keyframe extraction towards video content identification",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5201141/",
            "Abstract": "Keyframe extraction constitutes a fundamental unit in many video retrieval-related applications. In the emerging research field of content-based video copy detection, efficient representation of video content at keyframe level is crucial, due to the fact that similarity search is mainly performed between content-representative frames. In this paper a sequential search algorithm that bypasses the process of temporal video segmentation is proposed for keyframe extraction in MPEG videos. We aim at providing an efficient, real-time and fully-automatic way of extracting keyframes in videos, where not only the laborious task of offline video database indexing is avoided, but also query video processing is performed in the same manner as the reference video database. Significant reduction in computational cost is achieved by exploiting DCT coefficients in feature extraction. The effectiveness of the proposed scheme is …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Profile of the IEEE SSCS Greece Chapter",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6499805/",
            "Abstract": "The SSCS Greece Chapter has provided a plethora of activities during its first year of operation: seven lectures by engineers from the industry, one workshop, one career event, and one Distinguished Lecture (DL). All of the activities were very useful and well attended. The audience of the lectures was mainly from the University of Patras (faculty and students), while that of the Distinguished Lecture was from nearby companies. The University hosted all the Chapter events, except the Distinguished Lecture, which was hosted by the Patras Science Park, the local incubator of hightech startups. The Chapter is grateful for the cooperation of the University and the Science Park for hosting these events. It is worth pointing out that the Chapter has helped bridge the gap between academia and industry by providing a bi-directional link for the flow of knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:R0GtuAMwyXEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An FPGA Implementation of the ZUC Stream Cipher",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=8789748138850318585&hl=en&oi=scholarr",
            "Abstract": "In this paper a hardware implementation of ZUC stream cipher is presented. ZUC is a stream cipher that forms the heart of the 3GPP confidentiality algorithm 128-EEA3 and the 3GPP integrity algorithm 128-EIA3, offering reliable security services in Long Term Evolution networks (LTE). A detailed hardware implementation is presented in order to reach satisfactory performance results in LTE systems. The design was coded using VHDL language and for the hardware implementation, a XILINX Virtex-5 FPGA was used. Experimental results in terms of performance and hardware resources are presented.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:YiZc1oW-E3oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital Image Watermarking using Subband DCT",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15014541752171784151&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved watermark detection based on similarity diagrams",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0923596502000024",
            "Abstract": "A great number of digital watermarking approaches do exist, but it seems that transform domain watermarking dominates the field. The detection of such schemes is based on thresholds extracted by statistic rules on which the method relies. In this work, we propose an improved detector for such techniques. It extends the traditional schemes by taking into account the similarity diagrams that are widely used until now as an evidence of the watermarks existence and uniqueness.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:5nxA0vEk-isC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An FPGA implementation and performance evaluation of the seed block cipher",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6004926/",
            "Abstract": "An FPGA implementation of the 128-bit SEED block cipher is presented in this paper. The proposed architecture achieves high-speed with little hardware resources using feedback logic and inner pipeline with negative edge-triggered registers. In this way, the delay of the critical path is reduced, without increasing the latency of cipher execution. The proposed implementation reaches a data throughput of 369.6 Mbps at 46.2 MHz clock frequency. The design was coded using VHDL language and for the hardware implementation, the Xilinx Spartan-3A FPGA device was used.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rate control of H. 264 encoded sequences by dropping frames in the compressed domain",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5595801/",
            "Abstract": "A new technique for controlling the bitrate of H.264 encoded sequences is presented. Bitrate control is achieved by dropping frames directly in the compressed domain. The dropped frames are carefully selected so as to either eliminate or cause non perceptible drift errors in the decoder. The technique suits well H.264 encoded sequences such as movies and tv news, which are transmitted over wireless networks.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiple channel watermarking of color images",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.198.3045",
            "Abstract": "A novel scheme for the watermarking of color images is presented in this communication. An attempt has been made to find the most appropriate alternative to the RGB color space. Color spaces with linear relation to the RGB color space with uncorrelated components are found to be most suitable for watermarking. Another objective has been to propose an adaptive watermarking scheme for any type of color image, including computer generated color images. The adaptivity is achieved by keeping the visibility metric (PSNR) in a predefined quality range while changing the watermark embedding strength. The length of the watermark is kept constant for each of the color channels. In order to select the suitable space for watermark casting each of the color channels is transformed through Discrete Wavelet Transform and then the Discrete Hadamard Transform is applied to the approximations only. By this multiple transformation we are in a position to select the most appropriate coefficients for the watermarking, which are close to the low frequencies and uncorrelated in nature. Higher level of security is achieved by introducing encryption among the selected transformed coefficients using a private encryption key. Detection is oblivious and only the watermark generation and the coefficient encryption keys are required for the detection, and not the original image. Scheme is tested against a variety of legitimate and illicit image processing operations including compression, scaling, uniform or gaussian noise addition, median filtering, cropping, multiple watermarking and StirMark benchmark.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data hiding based on image texture classification",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11760-011-0229-5.pdf",
            "Abstract": "In this paper, a new pattern-based fragile, semi-blind, spatial domain data hiding scheme is proposed. The Local Binary Pattern texture classification approach is used, in order to transparently and securely embed secret data into an image. Pixel values are modified in such a way that the texture satisfies the message requirements. The method is thoroughly studied and compared to other techniques in spatial domain in terms of capacity and image quality. The scheme performs well in images with smooth areas and can be used for authentication, tamper proofing, and secret communications.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A Hilbert curve based representation of sEMG signals for gesture recognition",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8787290/",
            "Abstract": "Deep learning (DL) has transformed the field of data analysis by dramatically improving the state of the art in various classification and prediction tasks, especially in the area of computer vision. In biomedical engineering, a lot of new work is directed towards surface electromyography (sEMG) based gesture recognition, often addressed as an image classification problem using Convolutional Neural Networks (CNN). In this paper, we utilize the Hilbert space-filling curve for the generation of image representations of sEMG signals that are then classified by CNN. The proposed method is evaluated on different network architectures and yields a classification improvement of more than 3%.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:OA9cGvo6324C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Down scaling of images",
            "Publication year": 2008,
            "Publication url": "https://patents.google.com/patent/US7388913B1/en",
            "Abstract": "A Discrete Cosine Transform (DCT) for an entire original sequence is obtained using the DCT coefficients representing the first half and the second half of the original sequence. This is useful when calculation of DCTs of a certain length is supported by hardware and/or software and different size DCTs must be calculated. Example areas of application include still image and video transcoding and scalable image and/or video coding.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the computation of the Discrete Pascal transform",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30972284/7-20-1-PB.pdf",
            "Abstract": "The recently proposed discrete Pascal transform possesses a computational complexity for an N-point vector of the order of N2 for both the multiplications and additions. In the present work an efficient structure is proposed, which eliminates the multiplications and halves the number of additions.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Point cloud subjective evaluation methodology based on 2D rendering",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8463406/",
            "Abstract": "Point clouds are one of the most promising technologies for 3D content representation. In this paper, we describe a study on quality assessment of point clouds, degraded by octree-based compression on different levels. The test contents were displayed using Screened Poisson surface reconstruction, without including any textural information, and they were rated by subjects in a passive way, using a 2D image sequence. Subjective evaluations were performed in five independent laboratories in different countries, with the inter-laboratory correlation analysis showing no statistical differences, despite the different equipment employed. Benchmarking results reveal that the state-of-the-art point cloud objective metrics are not able to accurately predict the expected visual quality of such test contents. Moreover, the subjective scores collected from this experiment were found to be poorly correlated with subjective scores …",
            "Abstract entirety": 0,
            "Author pub id": "dFBXodcAAAAJ:aJ-3-MYELVsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data hiding in H. 264 encoded video sequences",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4412894/",
            "Abstract": "A new method for high capacity data hiding in H.264 streams is presented. The proposed method takes advantage of the different block sizes used by the H.264 encoder during the inter prediction stage in order to hide the desirable data. It is a blind data hiding scheme, i.e. the message can be extracted directly from the encoded stream without the need of the original host video. This fragile data hiding approach can be mainly used for content-based authentication and covert communication.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The colour in the upcoming MPEG-7 standard",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7075609/",
            "Abstract": "The colour spaces supported by the different image and video coding standards are presented in the present communication. Extensive reference to the colour spaces and the relevant colour descriptors supported by the MPEG-7 standard is given, and experiments on colour-based image retrieval efficiency are illustrated.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Could grid facilitate demanding watermarking media applications?",
            "Publication year": 2004,
            "Publication url": "https://www.scienceopen.com/hosted-document?doi=10.14236/ewic/4LEGE2004.2",
            "Abstract": "Copyright protection is becoming an important issue for organisations that distribute digital content through e-learning applications. One of the most promising methods for copyright protection is digital watermarking, a highly demanding application in terms of CPU load. In this communication, some specific cases are presented where GRID computing could be used as an enabling/assisting technology for watermarking. Specific cases of heavy load mathematical transformations for large media objects are discussed. A proposal for incorporating the watermarking procedure in the Grid architecture is also briefly presented.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motion Estimation Improvement by means of Frame Projection Techniques",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Skodras/publication/267687531_Motion_Estimation_Improvement_by_means_of_Frame_Projection_Techniques/links/546da93c0cf26e95bc3cc250/Motion-Estimation-Improvement-by-means-of-Frame-Projection-Techniques.pdf",
            "Abstract": "The new JVT H. 264 video coding standard uses variable block sizes ranging from 16x16 to",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High capacity reversible data hiding using overlapping difference expansion",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5031447/",
            "Abstract": "Difference expansion (DE) has been widely used for reversible data hiding. In this work, a new DE based scheme is presented that uses consecutive, overlapping pairs, instead of the non-overlapping pairs or triads used by traditional DE derivatives. The scheme is superior to the existing approaches, both in capacity and PSNR terms. By applying multiple runs of the embedding process, a significant capacity gain is obtained at the expense of lower quality.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pascal transform based self-authentication of color images",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6208098/",
            "Abstract": "A new self-authentication scheme is presented in this paper, able to locate tampered regions of an image and partially restore the original color content. This is achieved by invisibly embedding a color scaled version of the image into the image itself. The data hiding algorithm used to embed the message-image is a fragile, blind algorithm based on discrete Pascal transform. Experimental results show that this scheme is able to restore the original image when tampered, by producing a sufficient quality representation of its original content.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating usability in a distance digital systems laboratory class",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5535218/",
            "Abstract": "This paper presents the usability evaluation of a digital systems laboratory class offered to distance-learning students. It details the way in which students can participate remotely in such a laboratory, the methodology employed in the usability assessment of the laboratory infrastructure (hardware and software), and also outlines the main findings and lessons learned. It has been shown that the setting up of such a laboratory requires careful design, pilot runs, and formal evaluation prior to scaling up for a large number of students in order to both foresee usability flaws in the infrastructure and ensure educational quality.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "andTouradj Ebrahimi,“",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:fSKd39tHJ84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new difference expansion transform in triplets for reversible data hiding",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207160.2010.539210",
            "Abstract": "Difference expansion (DE) has been widely used for reversible data hiding. In this paper, a novel transform which embeds two bits of information in a triplet of coefficients is presented. This transform can be applied in spatial or frequency domains and induces minimum distortion to the initial data or coefficients. The proposed method outperforms all similar DE methods using triplets in terms of computational cost, visual quality and bitrate.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Reversible image watermarking based on histogram modification",
            "Publication year": 2007,
            "Publication url": "https://www.ceid.upatras.gr/webpages/faculty/xenos/papers/C044.pdf",
            "Abstract": "In this paper, a new reversible watermarking scheme resistant to geometrical attacks is presented. The proposed scheme does not need the original image for extracting the watermark, and induces not noticeable distortion during the watermarking procedure. The embedding algorithm has low computational complexity, can be applied to very small images (down to 16 x 16), and provides capabilities of multicasting. The watermarked images show robustness against geometrical attacks like rotation, flipping, translation, aspect ratio changes and resizing, warping, shifting, drawing, scattered tiles, shaking as well as their combinations.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deep Learning in EMG-based Gesture Recognition",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Tsinganos/publication/327908348_Deep_Learning_in_EMG-based_Gesture_Recognition/links/5c80eb1d458515831f8b42fc/Deep-Learning-in-EMG-based-Gesture-Recognition.pdf",
            "Abstract": "In recent years, Deep Learning methods have been successfully applied to a wide range of image and speech recognition problems highly impacting other research fields. As a result, new works in biomedical engineering are directed towards the application of these methods to electromyography-based gesture recognition. In this paper, we present a brief overview of Deep Learning methods for electromyography-based hand gesture recognition along with an analysis of a modified simple model based on Convolutional Neural Networks. The proposed network yields a 3% improvement on the classification accuracy of the basic model, whereas the analysis helps in understanding the limitations of the model and exploring new ways to improve the performance.",
            "Abstract entirety": 1,
            "Author pub id": "dFBXodcAAAAJ:ZM__uENUXnMC",
            "Publisher": "Unknown"
        }
    ]
}]