[{
    "name": "Αλέξιος Μπίρμπας",
    "romanize name": "Alexios Birmpas",
    "School-Department": "Ηλεκτρ. Μηχ. και τεχν. Η/Υ",
    "University": "Παν/μιο Πατρών",
    "Rank": "Καθηγητής",
    "Apella_id": 19404,
    "Scholar name": "Alexios Birbas",
    "Scholar id": "kCHXN28AAAAJ",
    "Affiliation": "University Of Patras",
    "Citedby": 1238,
    "Interests": [
        "microelectronics"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=kCHXN28AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A capacitive-to-digital converter with automatic range adaptation for readout instrumentation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7332950/",
            "Abstract": "Capacitive sensors have profoundly found their way in everyday life. Devices and instrumentation ranging from specialty equipment to smartphones all employ in one way or the other a capacitive sensor and its associated readout circuit, making the latter ubiquitious. We present a capacitive readout system that automatically adapts its range to the unknown measured capacitance, thereby extending its functional input range, as well as its application and instrumentation compatibility. The proposed system achieves a constant resolution for a range of input capacitance up to 690 pF.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:pUxgyZctzPYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A High-Speed Analog Trellis Decoder with Low-Energy Consumption",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5755878/",
            "Abstract": "Recent analog implementations of channel decoders, which are used to decode powerful error correcting schemes, have shown promising results for lower-power consumption and higher-speed than their digital counterparts. This work presents the implementation of an analog trellis decoder that takes advantage of the high-speed features of SiGe HBTs. Its fast error correcting capability of 20nsec outperforms relevant analog decoders and digital decoders, as well. The simulated total throughput of the decoder, including the delay time introduced by the input and the output interfaces, is 55.55 Mbit/s for a total latency of 180nsec. The energy consumption per decoding bit is 8.57nJ/b for a total power consumption of 476mW. The design is based on AMS 0.35micrometer SiGe BiCMOS process.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:35N4QoGY0k4C",
            "Publisher": "VDE"
        },
        {
            "Title": "The prototype detection unit of the KM3NeT detector",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:1EqfMoDn7-AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semi-classical noise investigation for sub-40nm metal-oxide-semiconductor field-effect transistors",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4928424",
            "Abstract": "Device white noise levels in short channel Metal-Oxide-Semiconductor Field-Effect Transistors (MOSFETs) dictate the performance and reliability of high-frequency circuits ranging from high-speed microprocessors to Low-Noise Amplifiers (LNAs) and microwave circuits. Recent experimental noise measurements with very short devices demonstrate the existence of suppressed shot noise, contrary to the predictions of classical channel thermal noise models. In this work we show that, as the dimensions continue to shrink, shot noise has to be considered when the channel resistance becomes comparable to the barrier resistance at the source-channel junction. By adopting a semi-classical approach and taking retrospectively into account transport, short-channel and quantum effects, we investigate the partitioning between shot and thermal noise, and formulate a predictive model that describes the noise …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:xtRiw3GOFMkC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "A 60-GHz quadrature PLL in 90nm CMOS",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6122285/",
            "Abstract": "A 1.2 V 60 GHz 120 mW phase-locked loop employing a quadrature differential voltage-controlled oscillator, a programmable charge pump, and a frequency quadrupler is presented. Implemented in a 90 m CMOS process and operating at 60 GHz with a 1.2 V supply, the PLL achieves a phase noise of -91 dBc/Hz at a frequency offset of 1 MHz.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Asynchronous Combo 4/8/12bit, 140MS/s, 0.12mm2 ADC with binary tree structure",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5347207/",
            "Abstract": "A configurable asynchronous CMOS TSMC90 nm Analogue to Digital Converter (ADC) with 4, 8 or 12-bits resolution, using a binary tree structure is presented which needs very low silicon area and relatively low power consumption for its implementation. The sampling rate of the 12-bit ADC exceeds 140MS/s and requires only 0.12 mm 2  of area making it appropriate for ultra wideband time-interleaved parallel ADC architectures.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High-level co-simulation based on the extension of processor simulators",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1383762100000370",
            "Abstract": "Hardware–software co-design is the cornerstone in the design of complex systems that involve both hardware and software. This paper presents a co-design approach where the co-simulation between hardware and software takes place early enough in the design cycle. The proposed platform is based on the extension of existing instruction set processor simulators in order to encapsulate hardware block description in the required and adequate accuracy level. The simplicity of the proposed technique as well as the use of homogeneous simulation environment, leads to a co-simulation alternative that is easy to implement and use. The applicability of the co-simulation environment developed is exhibited through the design and co-simulation, at various abstraction layers, of a telecommunication application. The latter, is based on the MAC layer and the RF-IF part of the Physical layer of the DECT protocol stack.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:LkGwnXOMwfcC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Real-Time Transient State Estimation in Smart Grids Utilizing Industrial loT Data",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9460231/",
            "Abstract": "Industrial IoT has enabled the monitoring of one of the most complex existing CPS - the electric Grid - undergoing a de-centralized and ‘smart transition’. Sophisticated Advanced Monitoring Infrastructure (AMI) and sensing devices (PMUs, RTUs etc.) combined with advanced communications networking allow the monitoring of the Grid parameters while edge computing capabilities (including reconfigurable hardware) enable real time Transient State Estimation (TSE) of the grid nodes providing preventive maintenance, control and data analytics. In this work, we focus on the processing requirements of TSE and we present an FPGA-based accelerated architecture towards the mitigation of the bottlenecks imposed by the existence of remittent power assets even at the edge of the grid which degrade its performance and disturb its balance thus making the grid prone to failures.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:HqhvjgTjE9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Short Term Electric Load Forecasting Based on Data Transformation and Statistical Machine Learning",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/937340",
            "Abstract": "The continuous penetration of renewable energy resources (RES) into the energy mix and the transition of the traditional electric grid towards a more intelligent, flexible and interactive system, has brought electrical load forecasting to the foreground of smart grid planning and operation. Predicting the electric load is a challenging task due to its high volatility and uncertainty, either when it refers to the distribution system or to a single household. In this paper, a novel methodology is introduced which leverages the advantages of the state-of-the-art deep learning algorithms and specifically the Convolution Neural Nets (CNN). The main feature of the proposed methodology is the exploitation of the statistical properties of each time series dataset, so as to optimize the hyper-parameters of the neural network and in addition transform the given dataset into a form that allows maximum exploitation of the CNN algorithm’s advantages. The proposed algorithm is compared with the LSTM (Long Short Term Memory) technique which is the state of the art solution for electric load forecasting. The evaluation of the algorithms was conducted by employing three open-source, publicly available datasets. The experimental results show strong evidence of the effectiveness of the proposed methodology. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:CCeGMaHljPEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Asynchronous Analogue-to-Digital Conversion Techniques",
            "Publication year": 2010,
            "Publication url": "https://pdfs.semanticscholar.org/f61a/18bec23a0a931d683987dbc9ce002e9f3ae2.pdf",
            "Abstract": "The sensor values readout is a critical issue in Factory Automation systems and control applications in general. Analogue-to-Digital Converters (ADCs) are the circuits that accept as input the analogue indication of the sensors and provide as output the corresponding digital code representation of the analogue value that can be exploited by the digital part of the controller. The most important parameters that affect the selection of an appropriate ADC are the conversion resolution, the sampling rate, the power consumption and the die area required. Several architectures have been proposed for ADCs that target different application requirements. For example, cable TV and PAL/NTSC decoders require 8-12bits resolution with 10-20MS/s sampling rate while high speed logic analyzers require 5-7bits resolution with multi-GS/s sampling rate. The industrial systems that require ADC conversion are production lines, command-control facilities, product quality measurement, communication networks, security systems etc. Industrial systems may use ADCs for the control of simple sensors like temperature, humidity, pressure, etc as well as for the interface of input devices with increased complexity like high speed and precision imagers. The most popular ADC architectures are the Flash, Pipeline, Successive Approximation, Sigma-Delta and Folding-Interpolation ones. The Flash ADCs achieve the highest speed but occupy large silicon area and consume high power. For this reason, their resolution is practically limited to less than 8-bits. Furthermore, special analogue front-end components or technology processes need to be employed to design Flash …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:abG-DnoFyZgC",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Capacitive sensor estimation based on self-configurable reference capacitance",
            "Publication year": 2013,
            "Publication url": "https://www.ingentaconnect.com/content/ben/rptsp/2013/00000003/00000001/art00003",
            "Abstract": "A number of capacitance readout systems presented in the literature and covered by recent patents are briefly described while a biosensor array readout system developed by the authors is presented in this paper. This biosensor array readout system is based on a charge sensitive amplifier that estimates accurately the difference between a selfconfigurable reference capacitance and a biosensor. In the specific implementation, the self-configurable reference capacitance is automatically configured to a value between 0 and 630pF in steps of 10pF. The configuration of the reference capacitance is controlled by a simple finite state machine that can be implemented using a simple CPLD (Complex Programmable Logic Device) such as Altera EPM7064SLC44-10. The proposed system can be used to measure an absolute biosensor capacitance of up to 640pF with a theoretical sensitivity of 2.5fF. The 2.5fF resolution …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:isC4tDSrTZIC",
            "Publisher": "Bentham Science Publishers"
        },
        {
            "Title": "Use of interleaving and error correction to infrared patterns for the improvement of position estimation systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4638443/",
            "Abstract": "A system capable of estimating the position of a mobile target based on the error rate of the received infrared patterns has been presented recently in [1]. In the present work, we explore the effect of using different infrared patterns to the estimation accuracy, the instant noise immunity and the system speed. We apply interleaving and forward error correcting techniques to correct the burst errors stemming from instant noise. We achieved a 25%-50% stability improvement, retrieved 20% less failures and the convergence speed is enhanced by a factor of 4-12.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capacitive Sensor Readout Circuit for Organic Substance Analysis",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212017313000662",
            "Abstract": "Capacitive biosensors are often used for organic substance analysis like applications for food quality assurance. A biosensor readout circuit is presented in this paper capable of covering of very broad range of capacitance (up to hundreds of pF) with very good accuracy of a few fF. The readout circuit employs a current source that discharges the selected biosensor from an array of 64 ones, at time period that is proportional to its capacitance. A low cost microcontroller interfaces the fabricated integrated circuit with host computers through USB o RS232. A post processing technique implemented in the firmware of the microcontroller, filters noise and guarantees the stable operation of the proposed circuit. The high accuracy and the broad capacitance range covered, make the designed biosensor readout circuit appropriate for several applications like genetic analysis, food quality, surveillance of environmental …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Task concurrency management experiment for power-efficient speed-up of embedded MPEG4 IM1 player",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/869150/",
            "Abstract": "Addresses the concurrent task management of complex multimedia systems, like the MPEG4 IM1 (IMplementation 1) player. Starting with a critical part of the code in the IM1 player, we extracted the concurrency hidden by implementation decisions and represented it with our \"grey-box\" modeling approach. Based on this \"grey-box\" model, high-level transformations have been made to improve the concurrency. By scheduling the transformed graph, we have improved the performance of an important bottleneck in the system layer of the IM1 player while simultaneously lowering the system energy cost. A two-processor target platform is used in the experiment, combining processors running at a high Vdd (drain supply voltage) and a low Vdd respectively.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrated microelectronic capacitive readout subsystem for lab-on-a-chip applications",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/25/5/055702/meta",
            "Abstract": "A mixed-signal capacitive biosensor readout system is presented with its main readout functionality embedded in an integrated circuit, compatible with complementary metal oxide semiconductor-type biosensors. The system modularity allows its usage as a consumable since it eventually leads to a system-on-chip where sensor and readout circuitry are hosted on the same die. In this work, a constant current source is used for measuring the input capacitance. Compared to most capacitive biosensor readout circuits, this method offers the convenience of adjusting both the range and the resolution, depending on the requirements dictated by the application. The chip consumes less than 5 mW of power and the die area is 0.06 mm 2. It shows a broad input capacitance range (capable of measuring bio-capacitances from 6 pF to 9.8 nF), configurable resolution (down to 1 fF), robustness to various biological experiments …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:u_35RYKgDlwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A high-speed analog turbo decoder with low-energy consumption",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1412444/",
            "Abstract": "A new type of iterative decoder based on analog computing networks, which incorporates conventional BiCMOS or CMOS technologies, outperform its digital counterparts in terms of speed and/or power consumption. The paper presents the design and functionality of an all-analog turbo decoder taking advantage of the high-speed features of SiGe HBTs achieving throughput up to Gbits/s. Simulation results based on AMS 0.35 /spl mu/m SiGe BiCMOS technology demonstrate promising performance compared to existing designs.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of 10-Gb/s RSOA-based upstream transmission in WDM-PONs utilizing optical filtering and electronic equalization",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4663602/",
            "Abstract": "Enhanced upstream transmission at 10 Gb/s using a low-bandwidth reflective semiconductor optical amplifier is demonstrated and discussed for extended wavelength- division-multiplexing passive-optical-network applications. Significant improvement in terms of transmission performance is achieved with the use of electronic equalization and optimum filter offset placed at the receiver (optical line terminal) end only. According to filtering detuning, an analytical discussion is presented, explaining the bandwidth enhancement achieved with the proposed technique. The experimental studies consider the benefits of the electronic feed-forward and decision-feedback equalization as well as the required optimum offset optical filtering characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heterogeneous system level co-simulation for the design of telecommunication systems",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1383762105000548",
            "Abstract": "The advanced complexity and heterogeneity of modern telecommunication systems mostly lead to the incorporation of heterogeneous implementation technologies and design styles. Consequently, the design representation of such systems often requires the mixed use of distinct model of computations at different abstraction layers. Therefore, heterogeneous co-simulation is needed in order to enable the effective communication and interaction among the involved models of computation. This paper resolves this issue by proposing the heterogeneous co-modelling of telecom systems based on the combination of SDL semantics with C language running on an instruction set simulator, coupling in that way the specification and the first refinement steps of the co-design flow. The missing test link between the corresponding tools that support the SDL-C co-model is addressed by proposing a heterogeneous co …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:dhFuZR0502QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A SiGe BiCMOS analog SISO decoder with I/O interface",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10470-007-9104-2",
            "Abstract": "Although recent implementations of analog iterative decoders have proven their potential for higher decoding speed and less power consumption than their digital counterparts, the CMOS or conventional BiCMOS technologies used so far seem to be incapable to cope with the need for high throughput that high-speed applications require. Within this context this work presents the design and test results of a high-speed analog SISO (Soft-Input Soft-Output) channel decoder for an 8-bit trellis code by exploiting the high-speed features of SiGe heterojunction bipolar transistors (HBTs). It is one of the first successful implementations of an error-correcting decoder in SiGe BiCMOS technology, which incorporates a high-speed I/O interface. A high-level model of the mismatch effects indicates that there is no significant performance penalty. Moreover, simulations and performance evaluations of an analog Turbo …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Application of Forward Error Correcting Algorithms to Positioning Systems",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1040.6332&rep=rep1&type=pdf",
            "Abstract": "The indoor localisation of a mobile target is an important issue in many robotics, automation, virtual reality and pervasive computing environments. The most sophisticated method for indoor localisation is based on processing the images captured by cameras that are placed on the target in order to recognise familiar landmarks and their distance (Jin et al, 2004);(Porta & Krose, 2006);(Clerentin et al, 2005);(Tovar et al, 2006);(Se et al, 2002). Image processing in conjunction with other localisation approaches described below (Borenstein et al., 1996) is very popular in autonomous robotics applications making feasible the familiarisation of a robot with unknown areas. Stochastic processing is often applied in this case in order to evaluate an estimated position. Nevertheless, expensive sensors and processing units are required in order to support the high computational complexity of this approach.More popular lower cost approaches are based either on measuring the round trip time of a reflected wave or the strength of a signal. In the first case, the cost is higher if optical or laser scanning is employed since very short time intervals have to be measured with high precision (Miura et al, 2006);(Clerentin et al, 2005);(Victorino et al, 2003);(Arras et al, 2001). Ultrasonic signals can offer a lower cost alternative to this approach since the sonar waves travel with much lower speed than light but their main drawback is that this type of signal is not directional enough (Smith & Zografos, 2005);(Minami et al, 2004);(Tardos et al, 2002);(Bicho et al, 2000);(Baskent & Barshan, 1999). Moreover, it is more difficult to isolate the sonar transmitter from the receiver in …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:NhqRSupF_l8C",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Noise and uncertainty in comparator/TDC sensor readout circuits",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7985972/",
            "Abstract": "Time to Digital Conversion (TDC) is an efficient technique to transform sensor readout signals into digital read out output through the measurement of a time duration. It is applicable into low frequency capacitive sensor readout circuits as well as in high frequency event-sensing circuits. The choice of the measuring time affects the sensitivity range for a specific physical species and is prone to jitter (noise). The noise itself stems from the readout circuitry and from various parasitic elements. The identification of the noise origin is necessary since it affects not only the range but also the resolution of the sensor, as it appears in the jitter. In high frequency applications the thermal noise behavior of the output noise diminishes jitter as a function of the measurement time while in low frequency capacitive sensor applications, the measurement time increase in order to extend the measurement range, leads to an increased …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:oldoQiaHq2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An 8-bit voltage mode analog to digital converter based on integer division",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572779/",
            "Abstract": "An 8-bit subrange Analog to Digital Converter (ADC) designed in a CMOS TSMC90nm process consisting of a coarse 4-bit and a fine 4-bit ADC stage is presented in this paper. It occupies only 0.04mm 2  of die area and dissipates less than 22mW without sacrificing speed since the sampling rate is higher than 500MS/s and the achieved SNDR is higher than 40dB. These features have been estimated by post-layout simulations. In ordinary subrange architectures a Digital to Analog Converter (DAC) generates an analog value from the digital coarse ADC output that is subtracted by the input in order to produce a residue that serves as input to the fine ADC stage. In such an approach, the linearity errors of the coarse ADC, the DAC and the subtractor are accumulated. In the present work, a voltage mode modulo-16 integer divider is used at the input of the subrange ADC and a “thermometer to binary encoder” that is …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The prototype detection unit of the KM3NeT detector",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:a2necdfpwlEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A combo Analog-to-Digital/Analog-to-Multiple-Value converter with configurable resolution",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5289279/",
            "Abstract": "An analog-to-digital converter (ADC) with a configurable 4, 8 or 12-bit resolution is presented in this paper. It is based on a binary tree structure implemented with current-mode circuits whereas an appropriate integer division is performed at the nodes of the tree. The binary representation of the analog input value is produced at the leaves of the tree while its corresponding multi-value representation can be directly retrieved from the intermediate nodes of the tree thus avoiding additional encoding of the binary representation or expensive process technologies and specialized devices that are required by other approaches. The sampling speed of the 12-bit ADC is 140 MS/s and requires only 0.123 mm 2  of die area in 90 nm CMOS technology while the 6-digit Analog-to-Quaternary Conversion (AQC) achieves 155 MS/s rate.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lorentzian type noise as a detection mechanism of bio-chemical species on Si NW FETs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7288594/",
            "Abstract": "The fluctuations encountered on the surface of silicon nanowires during a protein detection experiment have been proved to exhibit a direct link to the analyte's receptor density. This dependence can be used to efficiently perform multi-target detection measurements. The proposed technique is based on utilizing a decomposition algorithm to individually identify each species present in an electrolyte solution.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:sJK75vZXtG0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low noise high-speed X-ray readout IC for imaging applications",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0168900201006532",
            "Abstract": "We present a mixed-signal, continuously sensitive, self-triggered IC designed for X-ray imaging applications. Both bipolar and CMOS devices were employed in order to achieve the speed and noise requirements associated with the particular application. Phenomena related to the submicron nature of the devices used have been also taken into consideration. The circuit is optimized to operate with a 3 pF Si-microstrip detector and it exhibits an equivalent noise charge of 225e− rms with a slope of 45e−/pF. The peaking time of the pulse at the output of the analog part is 28 ns and the circuit recovers to the baseline within 600 ns. Moreover, it has the ability of handling either positive or negative current pulses originating from the detector. The IC power consumption is 4.5 mW per channel and the chip was fabricated using a 0.8 μm BiCMOS technology.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:Se3iqnhoufwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Integrated circuit distributed oscillator",
            "Publication year": 2012,
            "Publication url": "https://patents.google.com/patent/US8149066B2/en",
            "Abstract": "An integrated circuit distributed radio frequency oscillator comprises a semiconductor chip which includes a differential input transmission line, a differential output transmission line and, coupled in parallel between these transmission lines at spaced apart portions, a number of differential amplifier cells with adjustable delay. The output end of the output transmission line is coupled back to the input end of the input transmission line by a feedback link with a pair of on-chip capacitors. The delay introduced by the amplifier cells is variable in response to a tuning voltage applied to a differential tuning input, making the oscillator suitable for use as a distributed VCO in, eg a phase-locked loop circuit. The layout of the oscillator on a semiconductor chip includes the series-connected arrangement of the differential transmission lines in a rectilinear spiral path.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Calibration Method for a CMOS 0.06 mm^ 2 150MS/s 8-bit ADC",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5350102/",
            "Abstract": "An ultra low area 8-bit Analog-to-Digital Converter (ADC) has been designed achieving a 150 MS/S sampling rate and dissipating 34 mW power. It is based on integer division circuits that are arranged in a binary tree structure. We emphasize on the digital calibration method of such an ADC in order to extend its operational temperature range and correct the effect of mismatch and process variations. The calibration is achieved by controlling the voltage supply of the root divider and the amplification and offset correction of the residue that is produced by this divider.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cloud-Edge Interoperability for Demand Response-Enabled Fast Frequency Response Service Provision",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9560071/",
            "Abstract": "The massive penetration of Renewables into the energy mix and the existence of IoT-enabled Distributed Energy Resources (DERs) in the emerging smart grid, while a blessing towards de-carbonization, increase considerably the operations and planning functions of the grid. Cloud processing of IoT/DER data facilitates the deployment of various Demand-Response (DR) and other DER asset scenarios, the organization of distribution grids into Local Energy Markets (LEM) and the efficient computation of load forecasting and power flow. Cloud computing enables a plethora of service provisions to the grid including frequency response. The decentralized nature of DERs at the edge of the distribution grid requires nodal approaches for the computation of power grid congestion constraints and power flow solutions. We present here a cloud-edge continuum approach, anchored on the new generation of …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:j8pvxH-kN2QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Noise modeling issues of nanoscale multi-gate FETs",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6578982/",
            "Abstract": "White noise in sub 10 nm MOSFET devices is a crucial parameter for the design of low noise high frequency IC's and for the readout capability of sensors. To create a SPICE type model explaining recent experimental results one should take into account the ballistic nature of the carriers' transport in the channel. Rather than thermal noise originating in the channel, one should focus on the diffusive nature of the carriers near the contacts leading to a suppressed shot type white noise, as that produced in a thermionic diode.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA-ENABLED REAL-TIME POWER GRID SIMULATION USING GRID PARTITIONING",
            "Publication year": 2021,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/icp.2021.1273",
            "Abstract": "The high penetration of Distributed Energy Resources (DERs) and the IoT devices in the grid, as a result of policy regulations and economic considerations, physically located everywhere, in all shapes and sizes, both in front (FTM) and behind the meter (BTM) are fundamentally transforming the grid into a decentralized network of new grid assets that participate in multiple hierarchical energy markets. This transformation, however, creates challenges that needs to be managed. In order to adequately capture the transient behavior of the various grid components, detailed component models and Real-Time (RT) simulations are required. Leveraging their inherent parallelism capabilities, FPGA platforms help to achieve high-speed simulation execution, becoming a useful validation and planning tool for power grid management. However, the hardware utilization in these solutions is directly proportional to the size of …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:I9gX6wnfuA8C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A Heterogeneous Co-simulation Environment for Complex Embedded Telecommunication Systems.",
            "Publication year": 2004,
            "Publication url": "https://esdalab.ece.uop.gr/pdf/21960449COSIBA_FDL_04.pdf",
            "Abstract": "Bridging the different abstraction layers stemming from heterogeneous tools used in hardware software co-design for creating, maintaining and refining various system models form often a bottleneck in the overall design process. The missing test link between the specification level and the first refinement steps reveals the need for an environment that will enable the effective communication among the corresponding tools. This will also enable IP components to be reused early enough in the development cycle, even if their abstraction levels are different. This paper proposes a heterogeneous co-simulation approach to address this lack at this design stage. The overall result is an efficient environment that verifies and evaluates the conformance of the specification of a complex embedded system to its refinement.*",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A High-Speed Analog Turbo Decoder",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/47668612/pp77-85.pdf",
            "Abstract": "A new type of iterative decoders based on analog computing networks, which are used to decode powerful error-correcting schemes, such as Turbo and Low-density parity-check (LDPC) codes, outperform their digital counterparts in terms of power consumption and speed. Only few analog Turbo decoders, all of them based on CMOS subthreshold technology have been implemented till now. This paper aims to present the design and enhanced functionality of an all-analog Turbo decoder taking advantage of high-speed features of SiGe HBTs achieving throughput up to Gbits/s. Simulation results based on AMS 0.35µm SiGe BiCMOS technology demonstrate promising performance compared to existing designs.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:WMtz-WDmgKQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Noise Injection/Machine Learning Fraud Detection Framework in Time Series Data",
            "Publication year": 2019,
            "Publication url": "https://infoscience.epfl.ch/record/269257/files/ICNF_2019_Full_Paper_67.pdf",
            "Abstract": "Internet connectivity (IoT) of ever increasing numbers of physical sensing devices, results in vast amounts of sensing (measurement) data which have to be transmitted and processed in order to extract information. Data exchange and manipulation raise several concerns regarding privacy, security and integrity of the measurement data (ie electricity smart meters). Noise injection into the measurement time-series data is proposed in order to enhance data resilience. This noise injection in combination with statistical analysis tests while operating in a machine learning framework enables the detection of malicious data (fraud detection) in the receiver. Statistical analysis is essential in the case of time-series data collection, since the statistical properties of any time-series can give a strong indication of whether the data is being maliciously changed or not.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:GiYFt9mpioMC",
            "Publisher": "ICLAB"
        },
        {
            "Title": "A hybrid cyber physical digital twin approach for smart grid fault prediction",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9274723/",
            "Abstract": "The massive penetration of Distributed Energy Resources (DER) and high speed power electronics, even at the distribution grid edge, increases the management and operational complexity of the network while necessitates predictive maintenance, control and failure prediction mechanisms in near real time. A distribution subsystem comprises a CPS (Cyber Physical System) where the Cyber part is enabled by a low latency IIoT network and computational resources at the edge (distribution grid subsystem controller) while the physical system is represented (Digital Twin) by a hybrid model of the grid: a data driven machine learning representation of a limited number of nodes, along with a discrete-time model-based transient state estimator which captures the near real time physical operation of the grid. In case of early warning measurements acquired through the IIoT, machine learning edge computations can …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:u0Mu_IsstPMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design characteristics for a full-duplex IM/IM bidirectional transmission at 10 Gb/s using low bandwidth RSOA",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-28-7-1094",
            "Abstract": "In this paper, the optimum design characteristics and the transmission             performance limits of an intensity modulation full-duplex bidirectional transmission             system at 10 Gb/s are experimentally studied and presented for application in             next-generation-extended wavelength-division-multiplexed passive optical networks. A             low-bandwidth ( GHz) reflective semiconductor optical amplifier             (RSOA) is utilized at the optical network unit (ONU) site of the system. Its             remodulation properties and performance are examined for both continuous wave and             modulated downstream signal, stemming from the optical line terminal (OLT). The             techniques adopted to optimize performance are: 1)the use of detuned optical filtering             at the OLT receiver that takes advantage of the RSOA chirp and 2) the use of decision             feedback equalization (DFE). The extinction ratio of the …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A biosensor readout circuit with 3fF resolution and broad configurable range",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7015912/",
            "Abstract": "Capacitance to digital conversion is often used for biosensor readout circuits based on charge sensitive amplifier Front Ends. Absolute capacitance can be measured by the time it takes to discharge a capacitance through a current source. Higher precision is obtained, if the difference between the unknown capacitance and a reference one is estimated but this is difficult to be achieved if the range of the biosensor capacitance is broad. In this paper, an absolute capacitance readout circuit appropriate for use with capacitive biosensors is presented. It can cover a capacitance range of 180pF with an experimentally measured capacitance accuracy of 3fF, close to the 2.44fF theoretical resolution (Integral Non Linearity-INL<;1 LSB). This mixed signal readout circuit has been implemented and successfully tested in 90nm TSMC CMOS technology occupying 0.04mm 2  of die area. This system is extended for a range of …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance improvement of low-cost 2.5-Gb/s rated DML sources operated at 10 Gb/s",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4627468/",
            "Abstract": "The transmission performance improvement of low-cost conventional directly modulated laser (DML) sources, fabricated for operation at 2.5 Gb/s but modulated at 10 Gb/s is presented and experimentally demonstrated. Performance improvement is achieved by electronic feed-forward and decision-feedback equalization as well as offset optical filtering at the receiver end. Experimental studies consider both transient and adiabatic chirp dominated DML sources. The transmission improvement is evaluated in terms of required optical signal-to-noise ratio (OSNR) for bit-error-rate values of 10 -9  versus transmission length over uncompensated links of standard single-mode fiber (SSMF). Additionally, the optimum filter position is examined in combination with equalization and in terms of OSNR versus detuning from the center wavelength.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The use of electronic equalization and offset filtering in the performance improvement of low-cost DML transmitters",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4598372/",
            "Abstract": "The use of electronic compensation techniques for the transmission improvement of low-cost directly modulated sources is studied and evaluated experimentally. More specifically the research efforts presented here targeting in enhancing the transmission reach of common DML sources with limited bandwidth fabricated for operation at 2.5 Gb/s, but operated at 10 Gb/s. Performance improvement is achieved by means of electronic feed-forward and decision-feedback equalization (FFE/DFE) as well as off-set optical filtering at the receiver end. Experimental studies consider both transient and adiabatic chirp dominated DMLs sources. Measurements presented both in terms of required OSNR for bit error rate (BER) values of 10 -9  versus transmission length and BER over OSNR for certain transmission distances. In all cases uncompensated links of standard single mode fibre (SSMF) are considered. Additionally, the …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fully Integrated Differential Distributed VCO in 0.35-SiGe BiCMOS Technology",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4061037/",
            "Abstract": "We present a fully integrated differential distributed voltage-controlled oscillator implemented in a 0.35-mum SiGe BiCMOS technology. The delay variation by a positive feedback tuning technique, adopted from the ring oscillators, is demonstrated as a fine-tuning alternative, which results to an approximately 420-MHz tuning range. The phase noise is -98 dBc/Hz at 1-MHz offset from the 14.25-GHz carrier. An integrated output buffer isolates the oscillator from the measurement equipment. The measured output power is -17.5 dBm and the overall power consumption of the chip is 138.1 mW employing two power supplies of 3.2 and 4.2 V, respectively",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Study of the electronic dispersion compensation for 2.5 and 10 Gb/s transient and adiabatic chirped directly modulated lasers",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4296341/",
            "Abstract": "In this paper we report the results of the effect of electronic dispersion compensation (EDC) when directly modulated lasers with different chirp characteristics at 2.5 and 10 Gb/s are used. The extracted parameters of directly modulated lasers that were used in this work have been previously verified by simulations and experiments. The performance efficiency of EDC is evaluated in terms of eye opening penalty degradation associated with the signal transmission over standard single mode fiber. Eye opening penalty measurements reveal significant performance improvement for all the examined cases. The transmission limits of standard single mode fiber links using electronic feedforward equalizer and decision feedback equalizer are presented. The benefit of electronic dispersion compensation on directly modulated based systems is that it offers great potential to applications in metro/access networks with high …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Asynchronous ADC with configurable resolution and binary tree structure",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5463484/",
            "Abstract": "An Analogue to Digital Converter (ADC) implemented in CMOS technology (90nm TSMC) is described in this paper which is based on a binary tree structure and has a configurable 4, 8 or 12-bits resolution. The function performed at the nodes of the binary tree is an integer division by a proper power of 2, that is implemented by a novel circuit. The developed ADC system is an asynchronous circuit operating in current mode needing only a small number of components. This fact in conjunction with the binary tree structure of the ADC architecture, lead to implementations with very low die area and power consumption (0.12mm2 and 72mW respectively for 12-bit resolution). The average sampling rate exceeds 140MS/s for 12-bit resolution. The proposed device can also be used in multi Gbps time-interleaved parallel ADC due to its very low die area and power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A mapping algorithm for computer-assisted exploration in the design of embedded systems",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/371254.371273",
            "Abstract": "We present a technique for automatic exploration of architectural alternatives in the design of complex electronic embedded systems and systems-on-a-chip. The technique transforms the problem into a set of simple model-to-model operations and a mapping algorithm that becomes the core of the entire design process. The mapping algorithm is formulated as an assignment-type problem (ATP), which is, in turn, solved by a straightforward optimization method. The result is a design assistance tool, which is demonstrated through a telecommunication systems example.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:M3ejUd6NZC8C",
            "Publisher": "ACM"
        },
        {
            "Title": "Full-duplex bidirectional transmission at 10 Gbps in WDM PONs with RSOA-based ONU using offset optical filtering and electronic equalization",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2009-OThA7",
            "Abstract": "Bidirectional full-duplex transmission at 10 Gbps over extended SSMF is demonstrated using a low-bandwidth RSOA (1.5 GHz) in the ONU, assisted by electronic equalization (DFE) and optimum offset filtering at the receiver (OLT) end.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Study of SPM tolerances of electronically compensated DML based systems",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-17-11-8913",
            "Abstract": "This paper experimentally investigates the effectiveness of electronic dispersion compensation (EDC) for signals limited by self phase modulation (SPM) and various dispersion levels. The sources considered are low-cost conventional directly modulated lasers (DMLs), fabricated for operation at 2.5 Gb/s but modulated at 10 Gb/s. Performance improvement is achieved by means of electronic feed-forward and decision-feedback equalization (FFE/DFE) at the receiver end. Experimental studies consider both transient and adiabatic chirp dominated DMLs sources. The improvement is evaluated in terms of required optical signal-to-noise ratio (ROSNR) for bit-error-rate (BER) values of 10-3 versus launch power over uncompensated links of standard single mode fiber (SSMF).",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:NaGl4SEjCO4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Analogue current quantizer architectures for implementing integer division-like functions",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5201208/",
            "Abstract": "An analogue current quantization circuit that can implement the integer division by a constant number, the integer floor function, and a function generator with a parametric ladder-like output is presented in this paper. These functions can be exploited in Analogue-to-Digital Converters (ADCs), fuzzy logic and neural networks as well as in signal processing units. Various architecture alternatives are presented which achieve different integer division resolution ranging from 1:2 to 1:65536 or more. High speed and low voltage supply are achieved in ADCs that are based on this divider due to the usage of current mode techniques. Nevertheless, the most important advantages of the presented architectures are the very low power consumption and die area that they require.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architecture of a modular, multichannel readout system for dense electrochemical biosensor microarrays",
            "Publication year": 2014,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0957-0233/26/1/015701/meta",
            "Abstract": "The architecture of a modular, multichannel readout system for dense electrochemical microarrays, targeting Lab-on-a-Chip applications, is presented. This approach promotes efficient component reusability through a hybrid multiplexing methodology, maintaining high levels of sampling performance and accuracy. Two readout modes are offered, which can be dynamically interchanged following signal profiling, to cater for both rapid signal transitions and weak current responses. Additionally, functional extensions to the described architecture are discussed, which provide the system with multi-biasing capabilities. A prototype integrated circuit of the proposed architecture's analog core and a supporting board were implemented to verify the working principles. The system was evaluated using standard loads, as well as electrochemical sensor arrays. Through a range of operating conditions and loads, the prototype …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:yD5IFk8b50cC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "The prototype detection unit of the KM3NeT detector",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:gmHTDCtJMcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A digitally configurable reference capacitance with mismatch compensation for biosensor readout circuits",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6209997/",
            "Abstract": "The most popular capacitance biosensor readout circuits are based on charge sensitive amplifiers. High precision results can be obtained if the difference between the biosensor and a reference capacitance is estimated but this is difficult to be achieved if the range of the biosensor capacitance is wide. In this paper, a novel algorithm implemented in hardware that is used to configure an appropriate reference capacitance close to the biosensor value is presented. The resulting readout circuit is capable of accurately monitoring the changes of a biosensor capacitance, regardless of its initial value. More specifically, the reference capacitance is automatically configured to a value between 0 and 630pF in steps of 10pF. The proposed system can be used to measure an absolute biosensor capacitance of up to 640pF with 2.5fF sensitivity. The 2.5fF resolution is achieved by using a 12-bit ADC instead of a 18-bit ADC that …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling of LF fluctuations induced to the power grid with renewable generation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7985955/",
            "Abstract": "Dynamics of modern grid are determined from the ever increasing penetration of renewable sources in the generation mix, even at the distribution level. Power electronics facilitate this penetration and allow the de-centralized control of the grid. Moreover they allow the transformation of the loads into “smart loads” so that they participate in grid dynamics, even at the LV grid operation. The interaction of smart loads with the grid through is performed by DR strategies, edge load management as well by mitigation of the fluctuations induced in the grid from the intermittent nature of the renewable generators. Since grid frequency fluctuations, stemming from renewable's output volatility, are connected to the electricity prices, the interaction of the grid with many smart loads allows the stochastic exploration of the grid dynamics of a decentralized grid.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:i91s68tWr-MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware/software co-design of complex embedded systems: an approach using efficient process models, multiple formalism specification and validation via co-simulation",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022388018837",
            "Abstract": "This paper presents a hardware/software co-design approachwhere different specification languages can be used in parallel, allowingeffective system co-modeling. The proposed methodology introduces a processmodel that extends the traditional spiral model so as to reflect the designneeds of modern embedded systems. The methodology is supported by an advancedtoolset that allows co-modeling and co-simulation using SDL, Statecharts andMATRIXX, and interactive hardware/software partitioning. The effectivenessof the proposed approach is exhibited through two applicati on examples: thedesign of a car window lift mechanism, and the design of a MAC layer protocolfor wireless ATM networks.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:qjMakFHDy7sC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "On the development of organized nodal local energy markets and a framework for the TSO-DSO coordination",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S037877962030465X",
            "Abstract": "In this paper we propose a market design for implementing organized nodal electricity markets for the distribution grid. Distribution System Operators (DSOs) are expected to manage a massive penetration of Distributed Energy Resources (DERs), such as Renewable Energy Resources (RES), Electric Vehicles (EVs), Storage and Demand response. A Day Ahead Market (DAM) and a Real-Time Market (RTM) is proposed to optimize and clear offers and bids submitted by the DERs. A Mixed Integer Programming (MIP) Security Constrained Unit Commitment (SCUC) and a Security Constrained Economic Dispatch (SCED) iterates with a detailed asymmetric and unbalanced three-phased Distribution Power Flow (DPF) to enforce all constraints in the distribution grid. The solution produces Distribution Locational Marginal Prices (DLMPs) for all phases at every node of the distribution grid. A general framework for the …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:B2rIPIGFPLEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Prototype 5G/IoT Implementation for Transforming a Legacy Facility to a Smart Factory",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-79157-5_5",
            "Abstract": "A typical factory consists of several low functionality sensors. This work presents an architecture that can enhance the day-to-day operation of the site by combining modern IoT and legacy equipment and transforming the site for the 5G era. Operation and security of the site will benefit from the low latency the proposed Mobile Edge Computing architecture offers. Constant and uninterrupted monitoring makes preventive maintenance decisions even more accurate. Multitier architecture allows monitoring of each site to be performed locally without delays, while overall monitoring and control of remote sites is feasible as well.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:ujxm2eEBZHIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "VCO phase noise model at high RF frequencies and sub90 nm processes",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6578959/",
            "Abstract": "We present a generic precise modular calculation method for the estimation of phase noise of LC oscillators. We expand the idea of nearly sinusoidal voltage output by analyzing the output characteristic with a linear system of equations, which are provided by a Fourier Series Expansion. With this procedure we increase the accuracy of the simulation at a low computational cost. The calculation is based on the devices' nonlinear responses on the fundamental sinusoid and on computing the high harmonics response through a linear set of equations, considering the nonlinearities known. In that way we achieve higher accuracy avoiding the solution of a nonlinear system. Various effects (i.e. variable parallel resistance) can be included, thus increasing the accuracy further. Upon voltage characteristic computation, Hajimiri's phase noise calculation method is employed to procure the final phase noise.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Upstream transmission in WDM PONs at 10Gbps using low bandwidth RSOAs assisted with optical filtering and electronic equalization",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4729363/",
            "Abstract": "Upstream transmission at 10 Gbps over extended access fibre links is demonstrated using a low-bandwidth RSOA assisted by electronic equalization and optimum filter offset at the receiver (OLT) end.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An ultra low area asynchronous combo 4/8/12-bit/quaternary A/D converter based on integer division",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269210000443",
            "Abstract": "An asynchronous A/D Converter architecture based on a binary tree structure is presented in this paper. Two alternative design strategies are presented that lead either to a high mismatch immunity ADC that requires a light calibration logic (area: 0.123 mm2, power: 72 mW) or a faster, tinier and even lower power ADC (area: 0.21 mm2, power: 25 mW) with lower mismatch immunity that needs a slightly more complicated calibration logic. Both alternative ADC design strategies require at least one or two orders of magnitude lower area than any known approach and a remarkable low power consumption without sacrificing speed. The designed A/D Converter can operate with a configurable resolution of either 4, 8, or 12-bits. Moreover, 6 quaternary digits or three 16-level outputs are also available from the intermediate nodes of the binary tree, for applications that require multi-valued communication lines. Simulation …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Selecting appropriate calibration points for an ultra low area 8-bit subrange ADC",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548929/",
            "Abstract": "An ultra low area 8-bit subrange Analogue/Digital Converter that consists of a pair of Flash 4-bit converter stages is described in this paper emphasising on the appropriate method for its real time calibration. Its active area occupies only 0.04 mm 2  and dissipates less than 22 mW. The sampling rate is higher than 500 MS/s and the achieved Signal to Noise and Distortion Ratio is higher than 40 dB. A voltage mode integer divider is used at the input of this Analogue/Digital Converter driving the two output Flash stages by its quotient and residue. The ultra low area and power is owed to the use of the integer divider at the input stage of the subrange converter and the employment of a “thermometer to binary encoder” instead of a full 4-bit Flash Analogue/Digital Converter for the generation of the 4 most significant bits. The calibration method employed for this Analogue/Digital Converter is based on the proper biasing …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compensating for moderate effective throughput at the desktop",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/833569/",
            "Abstract": "This article presents the design and development of a networking system architecture targeted to support high-speed TCP/IP communication over ATM. The discussed architecture has been developed in the form of an integrated system which incorporates state-of-the-art software and hardware subsystems, and an OC-12c ATM adapter (622 Mb/s). Moreover, the design of this embedded system has been based on the Chorus real-time operating system, which, in turn, hosts an accelerated TCP/IP protocol stack over ATM. Furthermore, the embedded system board has been developed according to the PCI specification to easily be plugged into a host platform. In addition, the OC-12c ATM adapter subsystem has been designed and developed in order to also be plugged into the same host. The developed architecture has proven very efficient and reliable, providing high-throughput and low-latency bulk data …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance of 2.5 Gb/s and 10 Gb/s transient and adiabatic chirped directly modulated lasers using electronic dispersion compensation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5758552/",
            "Abstract": "For the first time to our knowledge we study the efficiency of electronic dispersion compensation when transient and adiabatic chirped directly modulated lasers operating at 2.5 Gbps and 10 Gbps are used.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:4DMP91E08xMC",
            "Publisher": "VDE"
        },
        {
            "Title": "for Dr. Dimitrios Klonidis",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=4472568105774764204&hl=en&oi=scholarr",
            "Abstract": "I. Papagiannakis, D. Klonidis, J. Kikidis, AN Birbas and I. Tomkos,“The use of electronic equalization and offset filtering in the performance improvement of low-cost DML transmitters”, in proc. IEEE International Conf. on Transparent Optical Networks ICTON, vol. 4, pp. 59-62, Athens, Greece, Jun. 2008.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:pRWBApOjXDcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design optimization for 10Gb/s full-duplex transmission using RSOA-based ONU with electrical and optical filtering and equalization",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5287177/",
            "Abstract": "The optimum design characteristics to maximize the performance of 10 Gbps full-duplex bidirectional transmission are studied experimentally using a low-bandwidth RSOA assisted by electronic equalization and optimum filter offset at the receiver (OLT) end.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high-speed SiGe BiCMOS analog MAP decoder",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=8396781810818361027&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:QKtdBID3u5MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "NOISE MODELING OF INTERDIGITATED GATE CMOS DEVICES",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0045",
            "Abstract": "The shrinkage of the MOSFET device dimensions along with the relatively wide gate electrode devices needed to accommodate RF applications lead to reconsideration of the noise properties of submicron MOSFET's. In this paper we present the noise properties associated with interconnect resistors of an interdigitated structure and the resulting noise source (strong function of the number of fingers) is evaluated against the other noise sources present in the device such as channel thermal noise, induced gate noise and resistive gate voltage noise. Short channel effects have been taken into account for the evaluation of these noise sources and two-port analysis performed in order to calculate minimum noise figure and optimum input resistance for noise matching.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Next generation millimeter wave backhaul radio: overall system design for GbE 60GHz PtP wireless radio of high CMOS integration",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6122282/",
            "Abstract": "In this paper we present the implementation of an experimental FDD, QPSK, millimeter-wave radio modem (57-64 GHz) for Point to Point (PtP) wireless backhaul applications. The transceiver supports GbE targeting a two-chip solution plus the antenna subsystem, aiming at highly integrated functions in 90nm CMOS technology, for a range of more than 1km. Achieving these levels of overall integration and silicon implementation requires many technological challenges and innovative design approaches. Furthermore, it allows for drastic changes of relevant cost factors enabling the wireless backhaul deployment for broadband services. The present paper is an outcome of the NexGenMiliwave project aiming to prove that it is possible to provide integrated solutions in silicon, based on demanding high frequency PtP requirements and significantly reduce the cost of the relevant backhaul network deployment.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An automatic design framework for real-time power system simulators supporting smart grid applications",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/636814",
            "Abstract": "Smart grid technology is the next step to the evolution of classical power grids, providing robustness, reliability, and security throughout the network, enabling real-time management and control. To achieve these goals, distributed computing (microgrid concept) and intelligent control algorithms, tailored to the nature and needs of the network under study, are necessary. To deal with the vast diversity of power grids, being able to capture the dynamics of any given network, and create tools for network analysis, apparatus testing, and power grid management, an automatic design framework for real-time power system simulators is needed. In this article, a prototype of this approach is presented, employing Field Programmable Gate Array (FPGA) platforms due to their reconfigurability that enables low-power, low-latency, and high-performance designs, as a first attempt towards an open source platform, compatible with the majority of hardware design suites. It comprises two major parts:(i) a user-oriented section, built in Matlab/Simulink; and (ii) a hardware-oriented section, written in Matlab and Very High Speed Integrated Circuit (VHSIC)-Hardware Description Language (VHDL) code. To verify its functionality, two test power networks were given in a schematic format, analyzed through Matlab code and turned into dedicated hardware simulators with the aid of the VHDL template. Then, simulation results from Simulink and the prototype were compared for error estimation. The results show the prototype’s successful implementation with minimal resources utilization, high performance and low latency in the order of nanoseconds in Xilinx 6-and 7-series …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:NZNkWSpQBv0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Modeling of fluctuation processes on the biochemically sensorial surface of silicon nanowire field-effect transistors",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4914352",
            "Abstract": "Affinity-type silicon-based nanowire biosensors rely on the biochemical interaction between target molecules and their molecular complements (recognition probes), located on the SiO2 insulator layer. This biochemical reaction is associated with twofold fluctuations through the mechanisms of binding/unbinding and regular charge thermal equilibrium processes. These fluctuations have a direct implication on the surface potential fluctuations which in turn affect, through the field effect transduction process, the electrical characteristics of the sensor device. The resulting noise could potentially contain detectable information, which can be extracted through the time constants (characteristic frequencies) related to the kinetics of the molecules under detection and their charge fluctuations. In this work, we present a comprehensive model for the fluctuations on the surface of the biosensor and attribute them to the two …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:D03iK_w7-QYC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Effectiveness of electronic equalizer for filter concatenation effect of low-cost 2.5 Gb/s rated DML sources operated at 10 Gb/s",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401809003769",
            "Abstract": "The improvement on the impact of filter concatenation effect on optical signal quality is investigated and discussed for applications in metropolitan optical networks utilizing cost-effective 10-Gb/s transmitters. The sources are low-cost conventional directly modulated lasers (DMLs), fabricated for operation at 2.5 Gb/s but modulated at 10 Gb/s. Performance improvement is achieved by using decision-feedback equalization (DFE) at the receiver end. Experimental studies consider both transient and adiabatic chirp dominated DMLs sources with different chirp characteristics. Measurements have been obtained using a recirculating loop set-up and the performance improvement is evaluated in terms of bit-error-rate (BER) versus number of loops.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:TQgYirikUcIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Deep sea tests of a prototype of the KM3NeT digital optical module: KM3NeT Collaboration",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:zzCxg_vo7cAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computationally efficient representation of energy grid-cyber physical system",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8390789/",
            "Abstract": "The computation integrity of the cyber part of an Industrial Cyber Physical System requires a reliable executable model of the underneath physical system. This physical system is usually a continuous-time one and its model execution requires resources far beyond existing embedded computing capabilities. The need for capturing the real time transient behavior of a physical system imposes additional burden in CPS in terms of computational time steps. In this work, we present that it is feasible to emulate a physical system (the Distribution Energy Grid in this case) by direct mapping it on hardware computational resources while maintaining its real time transient behavior. The hardware mapped physical system model can then act as a co-processing element to the CPS computational part. The focus on the real time transient behavior of a modern distribution grid-CPS, is inevitable due to the extended use of power …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:Gb6Hms-Uo9kC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Noise associated with interdigitated gate structures in RF submicron MOSFETs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/861586/",
            "Abstract": "CMOS technologies have gained considerable attention and have raised expectations for employment in RF transceivers. The shrinkage of the MOSFET device dimensions along with the relatively wide gate electrode devices needed to accommodate RF applications lead to reconsideration of the noise properties of submicron MOSFETs. In this paper, we present the noise properties associated with interconnect resistors of an interdigitated structure and the resulting noise source (strong function of the number of fingers) is evaluated against the other noise sources present in the device such as channel thermal noise, induced gate noise, and resistive gate voltage noise. Short channel effects have been taken into account for the evaluation of these noise sources and two-port analysis performed in order to calculate minimum noise figure and optimum input resistance for noise matching.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transmission performance improvement studies for low-cost 2.5 Gb/s rated DML sources operated at 10 Gb/s",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4729188/",
            "Abstract": "Performance improvement methods for the operation of 2.5 Gbps rated low-cost DML sources at 10 Gbps over record distances are studied by means of chirp characteristics, offset receiver filtering and DFE equalization.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Techniques for calibrating differential signals in measurement instruments",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548540/",
            "Abstract": "Differential amplifiers are often used in several measurement instruments for fast processing of sensor data, images etc. Such circuits are sensitive to component mismatches, temperature and process variations that modify the amplitude and the level of the differential signals. A number of calibration techniques that can restore such differential signals are presented in this paper. These techniques include level shifting, frequency detection and signal delay adaptation and are applied to a novel integer divider circuit that is incorporated in an ultra low area and power 8bit subrange Analog/Digital Converter that has been developed in CMOS TSMC90nm process.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analog error-correcting decoders using SiGe BiCMOS technology",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=13035925567108978816&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:3BvdIg-l-ZAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electronic distortion equalisation by using decision-feedback/feed-forward equaliser for transient and adiabatic chirped directly modulated lasers at 2.5 and 10 Gb/s",
            "Publication year": 2009,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-opt_20070077",
            "Abstract": "A thorough study on the beneficial use of electronic distortion equalisation (EDE) in the transmission performance enhancement of conventional low-cost directly modulated lasers (DMLs) is provided. The studies focus first on the compensation of the chromatic dispersion effect and then on the compensation of cascaded filtering effects of DML generated transmission signals in a system, by means of the feed-forward and decision-feedback equalisers (FFE/DFE). The reported studies consider DMLs with different chirp characteristics operating at 2.5 and 10 Gb/s, using parameters that have been extracted from real lasers, previously verified by simulations and experiments. The performance efficiency of EDE is evaluated in terms of eye-opening penalty degradation associated with the signal transmission over a standard single mode fibre. Extensive simulations reveal significant performance improvement for all the …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Sample/hold, V2I and Output Latching Techniques for an asynchronous low area ADC",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5206181/",
            "Abstract": "The architecture of an asynchronous CMOS Analogue to Digital Converter (ADC) with a binary tree structure exhibiting ultra low die area and power consumption will be presented in this paper. It is based on integer division that is implemented by current mode circuits that operate without a clock signal. Special emphasis is given on the description of the Sample/Hold and Voltage to Current conversion method at the input of such an asynchronous ADC as well as in the selection of an appropriate clock for the latching of correct codes at the ADC output and the relevant trade offs. The designed 8-bit ADC occupies 0.06 mm 2  area and dissipates 32 mW power while its active throughput is 150 MS/s.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analytical Calculations For The Influence Of Carrier’s Phase Noise On Modulating Signals",
            "Publication year": 2005,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2036807",
            "Abstract": "We calculate the exact influence of the phase noise on the quality of modulated signals. Assuming that the noise origin (thermal, shot or flicker) is ergodic and stationary we give quantitative results for the distortion introduced due to the phase noise of the carrier oscillation. We give details for the AM modulation.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:J_g5lzvAfSwC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Electronic mitigation of the filter concatenation effect of low-cost 2.5 Gb/s rated DMLs sources operated at 10 Gb/s",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2009-OWE3",
            "Abstract": "We experimentally investigate (using a re-circulating loop) the benefit of electronic equalization in the mitigation of filter concatenation effects for low-cost DML transmitters rated for 2.5 Gb/s but operated at 10Gb/s, applicable in transparent metro networks.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A 100 ps multi-time over threshold data acquisition system for cosmic ray detection",
            "Publication year": 2018,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1361-6501/aadc48/meta",
            "Abstract": "High-energy cosmic rays are one of the primary sources of information for scientists investigating the elementary properties of matter. The need to study cosmic rays with energies many orders of magnitude larger than those encountered in particle accelerators led to the development of modern detection hardware and experimental methodologies. We present a low power, low complexity data acquisition (DAQ) system with 100 ps resolution, suitable for particle and radiation detection experiments. The system uses a multiple-time-over-threshold (MToT) technique for the treatment of the output signal of photo multiplier tubes (PMTs). The system has been designed for the Hellenic Open University cosmic ray telescope, where scintillator detectors are used for the detection of extensive air showers (EAS). The use of three thresholds offers a more accurate measurement of the PMT pulses' size and consequently of the …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:AFXcoJnoRH0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "A compact hybrid-multiplexed potentiostat for real-time electrochemical biosensing applications",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0956566313002388",
            "Abstract": "The architecture and design of a compact, multichannel, hybrid-multiplexed potentiostat for performing electrochemical measurements on continuously-biased electrode arrays is presented. The proposed architecture utilises a combination of sequential and parallel measurements, to enable high performance whilst keeping the system low-cost and compact. The accuracy of the signal readout is maintained by following a special multiplexing approach, which ensures the continuous biasing of all the working electrodes of an array. After sampling the results, a digital calibration technique factors out errors from component inaccuracies. A prototype printed circuit board (PCB) was designed and built using off-the-shelf components for the real-time measurement of the amperometric signal of 48 electrodes. The operation and performance of the PCB was evaluated and characterised through a wide range of testing …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Electronic distortion compensation in the mitigation of optical transmission impairments: the view of joint project on mitigation of optical transmission impairments by electronic means ePhoton/ONe1 project",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/document/4804869/",
            "Abstract": "The key design approaches and results in the field of compensation of optical impairment distortion by electronic means, as an outcome of the studies and research innovations developed within the joint project on mitigation of optical transmission impairments by electronic means work group of the ePhoton/ONe+ European project are presented. The research topics addressed are related to chromatic and polarisation mode dispersion, with particular reference to feed-forward/decision-feedback equaliser and maximum-likelihood sequence estimation-based equalisers as well as pre-distortion schemes. Additionally, the use of electronic compensation in metro/access applications is examined with reference to studies related to the performance enhancement of directly modulated laser transmitters, the compensation of the square-law characteristics of receivers and the equalisation of multi-level format schemes.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:ULOm3_A8WrAC",
            "Publisher": "IET"
        },
        {
            "Title": "Noise optimisation for the design of a reliable high speed X-ray readout integrated circuit",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026271400000706",
            "Abstract": "On the basis of the design of an X-ray readout integrated circuit, we present in this paper the noise analysis which has to be performed in order to implement a reliable system. In this context, we exploit the various noise sources originating both at the device and at the circuit level of the system. We present the crucial noise contributors, calculate the noise level and present optimisation methods to accommodate the best noise performance in readout circuits. The noise contribution of the input amplification stage to the overall system noise performance is treated in detail. The designer’s alternative choices regarding the input capacitance scaling (device level) and the feedback resistance (circuit level) are properly investigated. Other issues such as signal filtering and mixed signal design are also addressed.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A voltage mode integer divider for fast A/D Conversion",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5636307/",
            "Abstract": "An analog circuit capable of implementing an integer division by a constant number is presented in this paper. The quotient and the residue of the division are generated concurrently by a circuit operating in voltage mode that can be used in various A/D Conversion (ADC) architectures like subrange ADCs as well as signal processing units, neural networks, fuzzy controllers etc. A comparison with an integer divider that was implemented in current mode by the authors shows that the voltage mode implementation leads to higher speed operation due to a better equalization of the quotient and residue path delays of the divider. A fast, low area and power 8-bit subrange ADC that has been designed based on the voltage mode integer division architecture is presented as a case study. The comparison of this 8-bit subrange ADC with other similar resolution ADCs shows the advantages of the proposed integer division …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A very low area ADC architecture capable of supporting the analog front end of powerline communication systems",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30353796/WSPLC09_2306.pdf",
            "Abstract": "The Analog Front End (AFE) of the various Powerline Communication (PLC) standards like HomePlug, IEEE P. 1901 etc, requires an Analog to Digital Converter (ADC) at the side of the receiver to digitize the filtered analog signal that is transmitted over a domestic power line network. The sampling rate adopted by the contemporary commercial PLC systems is less than 20-30MHz but the IEEE P. 1901 proposes sampling frequencies up to 100MHz. A resolution of 8-12bits with a sampling rate of less than 100MS/s is adequate for most existing PLC commercial systems. On the other hand, ADCs with low cost, area and power are always valuable for this kind of applications due to the large number of adaptors required at the outlets of the power lines and their small dimensions.The ADC presented in this paper, is implemented in CMOS technology (90nm TSMC) and is based on a binary tree structure where integer division by a power of 2 is performed at each node. The developed ADC system is an asynchronous circuit operating in current mode needing only a small number of components and having a configurable 4, 8 or 12-bits resolution. This implementation requires very low die area and power consumption (0.12 mm2 and 72mW respectively for 12-bit resolution). The average sampling rate exceeds 140MS/s for 12-bit resolution. The low die area and power consumption that characterize this ADC architecture make it ideal for use in time interleaved ADC in order to achieve higher speed.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimization of a Local Energy Market Operation in a Transactive Energy Environment",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9221893/",
            "Abstract": "ICT advancements (low latency new generation networks) transform the Distributed Energy Resources (DERs) at the edge of the electrical grid gradually into grid assets and drive the energy system towards a decentralized transactive operation. Local Energy Markets (LEMs) have been proposed as a means to facilitate and orchestrate the vast penetration of DERs. We propose here a LEM operation which concludes into fair pricing with monetary gains for both prosumers and consumers participating in the LEM. For the Day-Ahead LEM operation we apply a chance-constrained optimization algorithm in order to tackle the uncertainties governing the Day-Ahead LEM operation. The proposed LEM architecture is validated upon an IEEE low voltage European test feeder benchmark.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:htyGaKyDgHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "FPGA-assisted distribution grid simulator",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-78890-6_51",
            "Abstract": "The inclusion of multiple Distributed Energy Resources in the modern distribution grid, which are integrated in the grid via high frequency power electronic components, imposes the need to incorporate the transient behavior of those components in the traditional node based simulation of distribution grid. The different simulation time steps associated with this interaction is addressed by incorporating hardware assisted (FPGA) co-simulation platforms. This co-simulation platform can capture simultaneously time-steps of tenths of μs and less than one μs. This is achieved by exploiting the inherent parallelism of FPGAs in combination with customized modeling of power electronic components so as to accurately simulate them. Those simulation models are fed to the node based grid simulation running in the general purpose machine, enabling the capture of all transient phenomena for ensuring operational …",
            "Abstract entirety": 0,
            "Author pub id": "kCHXN28AAAAJ:_mQi-xiA4oYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "10 Gb/s full-duplex bidirectional transmission with RSOA-based ONU using detuned optical filtering and decision feedback equalization",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-17-7-5008",
            "Abstract": "Full-duplex bidirectional transmission at 10 Gb/s is demonstrated for extended wavelength division multiplexed passive optical network (WDM-PON) applications, achieving transmission distances up to 25 km of standard single mode fiber (SSMF) when using a low-bandwidth (~1.2 GHz) reflective semiconductor optical amplifier (RSOA) for signal re-modulation at the optical network unit (ONU). The system is assisted by optimum offset filtering at the optical line terminal (OLT)-receiver and the performance is further improved with the use of decision-feedback equalization (DFE). Chromatic dispersion (CD) and Rayleigh Backscattering (RB) effects are considered and analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Comparison of electronic pre-compensation and post-compensation for cascaded optical filtering of 10 Gb/s NRZ-OOK signals",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Tomkos/publication/224585103_Comparison_of_Electronic_Pre-Compensation_and_Post-Compensation_for_Cascaded_Optical_Filtering_of_10_Gbs_NRZ-OOK_Signals/links/55ae266108aed614b09868e7/Comparison-of-Electronic-Pre-Compensation-and-Post-Compensation-for-Cascaded-Optical-Filtering-of-10-Gb-s-NRZ-OOK-Signals.pdf",
            "Abstract": "Using a recirculating loop, the performance improvement for cascaded optical filtering by using precompensation at the transmitter and post-compensation at the receiver is compared.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adhesive Low Frequency Noise (LFN) in Charge Trap Transistors (CTT) for Neuromorphic Analog Processing",
            "Publication year": 2019,
            "Publication url": "https://infoscience.epfl.ch/record/269256/files/ICNF_2019_Full_Paper_66.pdf",
            "Abstract": "Neuromorphic devices performing synaptic processes in the analog domain are preferable from their digital hardware counterparts for the implementation of Artificial Neural Networks (ANN). The reason is their reduced area and power requirements. Charge Trap Transistors (CTT) have been recently proposed as analog neural network computing engines due to their CMOS compatibility as well. Gate controlled differential change of the threshold voltage related to charge storage into the high-k dielectric layer (traps) is the transduction mechanism for the non-volatile device operation; the same mechanism serves the learning process when it is employed as a synaptic element. The stochastic nature of the trapping (de-trapping) procedure produces low frequency noise of RTS type and modulates the channel current. This non-desirable but unavoidable counterintuitive effect (detrimental to the device performance) could be adhesive if this internal noise is used in order to induce stochastic resonance (SR) into the synaptic operation of the CTT. Indeed since the synaptic element is a non-linear system, SR at an engineered range of noise intensities can improve system performance (making information at the input visible at the output). This expands the learning capability of CTT into multilayer fully connected neural networks with non linear activation functions.",
            "Abstract entirety": 1,
            "Author pub id": "kCHXN28AAAAJ:hKjooKYXoHIC",
            "Publisher": "ICLAB"
        }
    ]
}]