[{
    "name": "Ανδρέας Φλώρος ",
    "romanize name": "Andreas Floros ",
    "School-Department": "Τεχνών Ήχου και Εικόνας",
    "University": "ionio",
    "Rank": "Καθηγητής",
    "Apella_id": 18999,
    "Scholar name": "Andreas Floros",
    "Scholar id": "mb7ezlMAAAAJ",
    "Affiliation": "Professor, Audio Technology, Ionian University",
    "Citedby": 829,
    "Interests": [
        "Audio Technology"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=mb7ezlMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Teaching basic number theory to students with speech and communication disabilities using multimedia",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/44844703/ACON04_ICICTE_2008_mathematics_teaching_deliyannis.pdf",
            "Abstract": "Under this research we developed a system destined as a teaching aid for students with communication difficulties. Our methodology examines the underlying mathematical concepts from a highly analytical perspective and derives appropriate courseware material of equivalent quality. The case-studies described in this paper deliver basic courseware on number theory and generalised mathematical concepts by presenting the geometrical meaning of the underlying concepts and providing alternative representations that enable understanding of the underlying theory. This process has resulted in the development of a visual set of case-studies that teach basic mathematical and geometrical concepts which may subsequently be extended to algorithms such as division, Greatest Common Divider, multiplication, least common multiplier, attributes and requirements for division. Interactive multimedia technologies are used extensively in the development of the teaching environment. A game-like interface aided by realistic binaural audio and animation has proved to attract user-attention for longer periods than using traditional teaching methods, aiding the educational process by providing an immersive multimedia interactivelearning alternative, for students with communication problems.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interactive Evolution of 8–bit melodies with Genetic Programming towards finding aesthetic measures for sound",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29142-5_13",
            "Abstract": "The efficient specification of aesthetic measures for music as a part of modelling human conception of sound is a challenging task and has motivated several research works. It is not only targeted to the creation of automatic music composers and raters, but also reinforces the research for a deeper understanding of human noesis. The aim of this work is twofold: first, it proposes an Interactive Evolution system that uses Genetic Programming to evolve simple 8–bit melodies. The results obtained by subjective tests indicate that evolution is driven towards more user–preferable sounds. In turn, by monitoring features of the melodies in different evolution stages, indications are provided that some sound features may subsume information about aesthetic criteria. The results are promising and signify that further study of aesthetic preference through Interactive Evolution may accelerate the progress towards defining …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Waking up in the morning (WUIM): A transmedia project for daily living skills training",
            "Publication year": 2021,
            "Publication url": "https://content.iospress.com/articles/technology-and-disability/tad200326",
            "Abstract": "BACKGROUND:One of the most serious concerns of parents, caregivers, teachers and therapists is children’s independent living, particularly of those with special educational needs (SEN). Purpose-built programs for the acquisition of independent living skills are considered a priority in special education settings. The main problem is the inefficacy of detached interventions to meet the needs of as many students as possible.OBJECTIVE:Our response is to create transmedia applications for inclusive learning environments. To this end, we have taken a participatory design approach to develop a project for Daily Living Skills Training by combining special education pedagogies, filmic methods, game design and innovative technologies. In this paper, we present the design and development of Waking up In the Morning (WUIM), and its improvement through user-based and expert-based evaluations by students …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:LPZeul_q3PIC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A Paradigm for Wireless Digital Audio Home Entertainment",
            "Publication year": 2006,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=13469",
            "Abstract": "Despite recent advances in wireless networking technology, real-time streaming of CD-quality digital audio remains a challenging topic. In this work, a set of applications following the server-client model was developed, facilitating the transmission and playback of PCM-coded audio over wireless links. The implementation is based on typical Personal Computer (PC) platforms interconnected with off-the-shelf wireless networking hardware. Performance evaluation tests are presented under different networking parameters and link conditions, leading to an optimal set of parameters for high-quality wireless digital audio delivery.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:qUcmZB5y_30C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "WLAN technologies for audio delivery",
            "Publication year": 2007,
            "Publication url": "https://www.hindawi.com/journals/am/2007/012308/",
            "Abstract": "Audio delivery and reproduction for home or professional applications may greatly benefit from the adoption of digital wireless local area network (WLAN) technologies. The most challenging aspect of such integration relates the synchronized and robust real-time streaming of multiple audio channels to multipoint receivers, for example, wireless active speakers. Here, it is shown that current WLAN solutions are susceptible to transmission errors. A detailed study of the IEEE802.11e protocol (currently under ratification) is also presented and all relevant distortions are assessed via an analytical and experimental methodology. A novel synchronization scheme is also introduced, allowing optimized playback for multiple receivers. The perceptual audio performance is assessed for both stereo and 5-channel applications based on either PCM or compressed audio signals.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Hindawi Publishing Corp."
        },
        {
            "Title": "Wireless digital audio delivery analysis and evaluation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1661247/",
            "Abstract": "Real-time digital wireless playback of CD-quality audio in multipoint setups using quality of service enhancements is analyzed and evaluated in this work. A novel methodology is introduced for simulating wireless digital audio delivery as well as for theoretically deriving the playback distortions. This methodology allows the accurate wireless digital audio delivery and reproduction simulation and leads to significant results for both the wireless networking and audio playback performance, while it provides a framework for defining the optimal parameters for error-free wireless stereo audio reproduction",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-time drums transcription with characteristic bandpass filtering",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371456.2371482",
            "Abstract": "Real--time transcription of drum signals is an emerging area of research. Several applications for music education and commercial use can utilize such algorithms and allow for an easy-to-use way to interpret drum signals in real--time. The paper at hand proposes a system that performs real--time drums transcription. The proposed system consists of two subsystems, the real--time separation and the training module. The real--time separation module is based on the use of characteristic filters, combining simple bandpass filtering and amplification, a fact that diminishes computational cost and potentially renders it suitable for implementation on hardware. The training module employs Differential Evolution to create generations of characteristic filter combinations that optimally separate a set of given drum sources. Initial experimental results indicate that the proposed system is relatively accurate rendering it …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated tonal balance enhancement for audio mastering applications",
            "Publication year": 2013,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=16737",
            "Abstract": "Modern audio mastering procedures are involved with the selective enhancement or attenuation of specific frequency bands. The main reason is the tonal enhancement of the original/unmastered audio material. The aforementioned process is mostly based on the musical information and the mode of the audio material. This information can be retrieved from a listening procedure of the original stimuli, or the corespondent musical key notes. The current work presents an adaptive and automated equalization system that performs the aforementioned mastering procedure, based on a novel method of fundamental frequency tracking. In addition to this, the overall system is being evaluated with objective PEAQ analysis and subjective listening tests in real mastering audio conditions.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Towards the all-digital audio/acoustic chain: challenges and solutions",
            "Publication year": 2003,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=12318",
            "Abstract": "The obvious advantages of digital audio technology have up to now being manifested mainly in media storage and processing sub-components, witch are parts of a more elaborate audio/acoustic analog reproduction chain. It is envisaged that the remaining components such as cables, amplifiers and transducers will soon be also implemented in digital form, potentially leading to networked, integrated and highly optimized solutions. The paper examines theoretical and implementation aspects related to each of the modules that could constitute such an all-digital audio/acoustic transducer, namely:(a) the digital wireless receiver, via the Bluetooth and IEEE 802.11 protocols,(b) audio decoding and format adaptation (c) DSP for acoustic compensation, based on measured results for smoothed response equalization,(d) digital amplification, and,(e) all-digital transduction.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Corfunet: A mesh network providing wireless services AT metropolitan level",
            "Publication year": 2008,
            "Publication url": "https://users.ionio.gr/~emagos/Corfunet%202008.pdf",
            "Abstract": "This paper discusses the technology and commercialization challenges of a research initiative intended to establish a wireless metropolitan network for the city of Corfu. Key wireless mesh networking issues are discussed and value for the potential service providers and users of the network is specified. The network development builds on advanced features of wireless mesh networks, like multi-channel and multi-radio operation, connectivity to a fixed network infrastructure through multiple links and general purpose applications support, which overcome many of the limitations that are currently imposed by wireless ad-hoc networks. The proposed network is designed to provide apart from broadband Internet access a number of sophisticated services to the citizens, tourists and business visitors of the island. To assure viability and expansion for the CorfuNet initiative, the present study discusses scenarios on two alternative business models, namely the collaborative and the single provider models, differentiated on the basis of the network’s owner.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evaluation tool for wireless digital audio applications",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Floros/publication/228962715_An_evaluation_tool_for_wireless_digital_audio_applications/links/0fcfd50ad084d57797000000/An-evaluation-tool-for-wireless-digital-audio-applications.pdf",
            "Abstract": "Despite the recent advances in the wireless networking technology, wireless multichannel digital audio delivery is not yet efficiently realized, because of the additional implementation issues raised for managing possible distortions introduced. In this work, a novel, open-architecture, software platform for evaluating wireless digital audio distribution is presented. This tool facilitates the assessment of real-time playback distortions induced by variable packet reception delays and packet losses, typically encountered in WLAN transmissions. Moreover, this platform can be also employed for producing audio streams corresponding to the wirelessly delivered digital audio, in order to investigate the audibility of such distortions.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Audio Fingerprint Application Verification Using the Adapted Computational Geometry Algorithm.",
            "Publication year": 2013,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.301.6486&rep=rep1&type=pdf",
            "Abstract": "An earlier work of the authors introduced an adapted version of the Computational Geometry Algorithm (CGA) designed to analyse an audio stream and produce a unique coding-independent fingerprint. As the adaptability and the induced calculation load of the proposed algorithm form a key characteristic for multiple applications, our current investigation aims to measure its performance and stability in dynamic, real-time applications, ie, in large audio library indexing and dynamic audio recognition. In addition, we investigate the fact that context similarity is also evident across fingerprints; hence a number of comparisons are used to explore the possible uses of this highly desirable algorithmic feature.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accessible games for blind children, empowered by binaural sound",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2769493.2769546",
            "Abstract": "Accessible games have been researched and developed for many years, however, blind people still have very limited access and knowledge of them. This can pose a serious limitation, especially for blind children, since in recent years electronic games have become one of the most common and wide spread means of entertainment and socialization. For our implementation we use binaural technology which allows the player to hear and navigate the game space by adding localization information to the game sounds. With our implementation and user studies we provide insight on what constitutes an accessible game for blind people as well as a functional game engine for such games. The game engine developed allows the quick development of games for the visually impaired. Our work provides a good starting point for future developments on the field and, as the user studies show, was very well perceived by …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Loudness-based Adaptive Equalization Technique for Subjectively Improved Sound Reproduction",
            "Publication year": 2014,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=17231",
            "Abstract": "Sound equalization is a common approach for objectively or subjectively defining the reproduction level at specific frequency bands. It is also well-known that the human auditory system demonstrates an inner process of sound-weighting. Due to this, the perceived loudness changes with the frequency and the user-defined sound reproduction gain, resulting into a deviation of the intended and the perceived equalization scheme as the sound level changes. In this work we introduce a novel equalization approach that takes into account the above perceptual loudness effect in order to achieve subjectively constant equalization. A series of listening tests shows that the proposed equalization technique is an efficient and listener-preferred alternative for both professional and home audio reproduction applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Sonic representations in hyper-spaces: A creative approach",
            "Publication year": 2017,
            "Publication url": "https://www.ingentaconnect.com/content/intellect/ta/2017/00000015/00000002/art00015",
            "Abstract": "Man perceives three dimensions but this does not necessarily exclude the existence of higher spatial dimensions, also known as ‘hyperspace’. Higher dimensions have been and still are the object of study and source of inspiration for many artists and scientists. Many efforts have been made to perceive hyperspace through vision. The audio ‘visualization’ of hyperspace may result in a better outcome, perhaps due to similarities between sound and hyperspatial gravitational waves, or even because the corresponding audio centres in our brain are better suited for perceiving hyperspace. Focusing on Varèse, we proceed to a concise historical retrospective of the efforts to approach fourth dimension through music. The interaction between artists and the world of science, and the intuition that forms an integral part of art, have both been a decisive source of inspiration. Furthermore, we describe the characteristics of …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:p2g8aNsByqUC",
            "Publisher": "Intellect"
        },
        {
            "Title": "Stochastic packet reconstruction for subjectively improved audio delivery over WLANs.",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/51156624/Stochastic_packet_reconstruction_for_sub20170102-23622-1i5jl00.pdf",
            "Abstract": "Real time digital audio delivery over Wireless Local Area Networks (WLANs) represents an attractive, flexible and cost effective framework for realizing high-quality, multichannel home audio applications. However, the unreliable nature of WLANs IP link frequently imposes significant playback quality degradation, due to delay or permanent loss of a number of transmitted digital audio packets. In this paper, a novel packet error concealment technique is presented, based on the spectral reconstruction of the statistical equivalent of a previously successfully received audio data packet. It is shown that the proposed data reconstruction scheme outperforms previously published error concealment strategies, in both terms of objective and perceptual criteria.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "iReflectors–Έξυπνοι Ακουστικοί Ανακλαστήρες από Σύνθετα Υλικά",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=4299519253347810879&hl=en&oi=scholarr",
            "Abstract": "Η χρήση ανακλαστήρων οροφής για τη βέλτιστη διάδοση του ήχου σε αίθουσες ακροάσεων αποτελεί σηµαντικό στοιχείο του ακουστικού σχεδιασµού. Οι µέχρι σήµερα χρησιµοποιούµενοι ανακλαστήρες είναι σταθεροί ως προς τη θέση και το σχήµα και κατασκευάζονται από συµβατικά υλικά.Στο παρόν επιχειρείται η µελέτη της δυνατότητας αντικατάστασης των συµβατικών ανακλαστήρων από νέους, κατασκευασµένους από σύνθετα υλικά. Στόχος είναι η µελέτη και ο σχεδιασµός εύκαµπτων «έξυπνων» ανακλαστήρων µε εµβαπτισµένα σύρµατα από κράµατα µνήµης σχήµατος, τα οποία θα µπορούν να µεταβάλλουν το σχήµα του ανακλαστήρα κατά τις εκάστοτε ανάγκες. Η διαδικασία αλλαγής θα ελέγχεται από ηλεκτρονικό σύστηµα ενεργοποίησης. Οι ανακλαστήρες θα διαθέτουν εµβαπτισµένο δίκτυο οπτικών ινών για τον έλεγχο της ανάπτυξης και διάδοσης βλάβης.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and system for a quality of service mechanism for a wireless network",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060045050A1/en",
            "Abstract": "A quality of service mechanism for a wireless network includes providing an admission control policy for a quality of service access point (QAP) to manage bandwidth by accepting or denying service to admitted traffic streams of quality of service stations (QSTAs) Further included is renegotiating different access category parameters in the QAP for enhancing performance in the wireless network. An additional aspect also includes monitoring in the QSTAs for enhanced networking to determine whether bandwidth allocation to a specific access category meets QoS requirements under time-varying network conditions and renegotiating admitted access category bandwidth if necessary.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatial enhancement for immersive stereo audio applications",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6005001/",
            "Abstract": "In this work, we propose a stereo recording spatial enhancement technique which retains the original panning/source location, proportionally mapped into the perceived expanded sound stage. The technique uses a time-frequency domain metric for retrieving the panning coefficients applied during the initial stereo mixing. Panning information is also used for separating the original single channel audio streams and finally for synthesizing the expanded sound field using binaural processing. The technique is mainly intended for playback applications over short-distant loudspeaker setups or headphones and, in the context of this work, it is subjectively evaluated in terms of the perceived sound field expansion and the sound-source spatial distribution accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Binaural mixing using gestural control interaction",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1859799.1859803",
            "Abstract": "In this work a novel audio binaural mixing platform is presented which employs advanced gestural-based interaction techniques for controlling the mixing parameters. State-of-the-art binaural technology algorithms are used for producing the final two-channel binaural signal. These algorithms are optimized for realtime operation, able to manipulate high-quality audio (typically 24bit/96kHz) for an arbitrary number of fixed-position or moving sound sources in closed acoustic enclosures. Simple gestural rules are employed, which aim to provide the complete functionality required for the mixing process, using low cost equipment. It is shown that the proposed platform can be efficiently used for general audio mixing/mastering purposes, providing an attractive alternative to legacy hardware control designs and software-based mixing user interfaces.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hearing the buildings: Smart Monitoring through Advanced Sonification Approaches",
            "Publication year": 2015,
            "Publication url": "https://www.scientific.net/KEM.628.231",
            "Abstract": "Risk prevention of historical buildings through sensor network monitoring represents a challenging and together promising task towards an optimized buildings’ protection plan. Due to the significant character that historical buildings have within the history and identity of local and consequently national communities, the monitoring approach above is nowadays considered a fundamental component of cultural preservation. Modern trends on sensor networks nowadays allow the installation of wireless monitoring equipment, able to collect a large volume and variety of data that can be further processed in order to support prevention modelling techniques and strategies. Despite the valuable post-processing outcome of the above modelling techniques, in several real-time monitoring cases, an aspect that may significant impact the data analysis accuracy from the monitoring engineer is to create an audiovisual …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "Accessible electronic games for blind children and young people",
            "Publication year": 2018,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/bjet.12628",
            "Abstract": "We present a suite of inclusive games designed to address the needs of people with blindness or low vision. Particularly, through the employment of modern sonification strategies that achieves efficient perceptual representation of the game‐play, several audio‐games with different scenarios and application scope (entertainment and education) were developed and demonstrated. A platform called “Memor‐i studio” that allows nontechnical users (including blind ones under supervision) to create such inclusive games has also been developed. The overall presentation includes the detailed description of the outcome of the evaluation process involved children and young people aged between 7 and 20 years old from the Special Elementary School for the Blind in Athens and the Education and Rehabilitation Centre for the Blind in Athens, Greece. The description is also extended to include the design framework of …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Eidola: An interactive augmented reality audio-game prototype",
            "Publication year": 2009,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=15067",
            "Abstract": "Augmented reality audio represents a new trend in digital technology that enriches the real acoustic environment with synthesized sound produced by virtual sound objects. On the other hand, an audio-game is based only on audible feedback rather than on visual. In this work, an audio-game prototype is presented which takes advantage of the characteristics of augmented reality audio for realizing more complex audio-game scenarios. The prototype was realized as an audiovisual interactive installation, allowing the further involvement of the physical game space as the secondary component for constructing the game ambient environment. A sequence of tests has shown that the proposed prototype can efficiently support complex game scenarios provided that the necessary advanced interaction paths are available.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Intelligent real-time music accompaniment for constraint-free improvisation",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6495079/",
            "Abstract": "Computational Intelligence encompasses tools that allow the fast convergence and adaptation to several problems, a fact that makes them eligible for real-time implementations. The paper at hand discusses the utilization of intelligent algorithms (i.e. Differential Evolution and Genetic Algorithms) for the creation of an adaptive system that is able to provide real-time automatic music accompaniment to a human improviser. The main goal of the presented system is to generate accompanying music based on the local human musician's tonal, rhythmic and intensity playing style, incorporating no prior knowledge about the improvisers intentions. Compared to existing systems previously proposed, this work introduces a constraint-free improvisation environment where the most important musical characteristics are automatically adapted to the human performer's playing style, without any prior information. This fact allows …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancement of IEEE 802.11 in handling multiple broadcasting audio data in wireless ad-hoc networks",
            "Publication year": 2013,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=16702",
            "Abstract": "Audio networking is a growing field, introducing new and exiting possibilities in the professional audio industry [1]; but it also drastically changes the way audio systems will be designed, built, and used. Today’s networks have enough bandwidth to transport hundreds of high quality audio channels, replacing hundreds of kilograms of cabling in conventional analog audio systems [2]. Currently there are many systems on the market that distribute audio over Ethernet but the majority of sound engineers are not using them yet. There are mainly two reasons that audio networks are not as popular as expected. First, many of the systems are based on a proprietary implementation that does not allow interoperability between different vendors. Second, wired networks, like the conventional analog audio networks, also need a cable installation. It is therefore understood that the development of a wireless digital audio …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:f2IySw72cVMC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Bringing digital multimedia in mathematics education",
            "Publication year": 2008,
            "Publication url": "http://www.ionio.gr/~yiannis/publications/ACON03_ECEL_2008_mathematics_deliyannis.pdf",
            "Abstract": "The increased interest for developing new representation techniques and tools for proving and demonstrating basic mathematical propositions and concepts is the forefront of educational research worldwide in the area of e-learning for mathematics. Although many novel ideas have been proposed for illustrating basic mathematical (ie geometrical) concepts, currently there is a lack of effective methods to dynamically reproduce an alternative representation of the underlying concepts. The proposed approach introduces valuable explanatory tools for efficiently supporting the learning objectives, enabling students to reach the core of each notion. In this work, a digital multimedia methodology is presented which implements the above dynamic representation approach. Recent, state-of-the-art trends in multimedia technology related to modern two or three-dimensional (2D or 3D) object modelling are utilised in order to efficiently reproduce a virtual mathematical environment in which selected mathematical concepts. Apart from the time-dependent dynamic representation, advanced user interaction features are also supported for determining various representation parameters (such as the view and lighting position, as well as the time resolution/speed). Additionally, accurate 3D sound projection techniques are employed in cases that the spatial sound information enhances the illustrated perceptual effect. For convenient access of the multimedia content, the proposed methodology includes a web interface and a multimedia database, offering advanced searching capabilities. In order to evaluate the performance of the proposed multimedia framework …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:Se3iqnhoufwC",
            "Publisher": "Academic Conferences Limited"
        },
        {
            "Title": "On digitising the Greek music tradition: simulation of the Cretan lyre for mobile devices",
            "Publication year": 2020,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJART.2020.108610",
            "Abstract": "In this paper, an application, which simulates the Greek traditional musical instrument 'Cretan lyre' in mobile devices and is the first of its kind, is presented. This instrument was selected on the grounds that it is quite interesting in terms of its playing technique and there has never been a similar attempt to do so to date. Moreover, music in Cretan tradition has been in the spotlight and intrigued a lot of people, not only those originating from Crete. The cretanlyra.app constitutes a recreational and educational application that features a presentation of the Cretan lyre and offers the user the capability of simulated playing, using the same gestures as an actual musician would. The user is instructed by the application so that they will familiarise themselves with playing some well-known melodies of the Cretan tradition. In addition, they can combine the lute sound with playing the lyre.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:geHnlv5EZngC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Towards Citizen Science for Smart Cities: A Framework for a Collaborative Game of Bird Call Recognition Based on Internet of Sound Practices",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2103.16988",
            "Abstract": "Citizen Science aims to engage people in research activities on important issues related to their well-being. Smart Cities aim to provide them with services that improve the quality of their life. Both concepts have seen significant growth in the last years, and can be further enhanced by combining their purposes with IoT technologies that allow for dynamic and large-scale communication and interaction. However, exciting and retaining the interest of participants is a key factor for such initiatives. In this paper we suggest that engagement in Citizen Science projects applied on Smart Cities infrastructure can be enhanced through contextual and structural game elements realized through augmented audio interactive mechanisms. Our inter-disciplinary framework is described through the paradigm of a collaborative bird call recognition game, in which users collect and submit audio data, which are then classified and used for augmenting physical space with virtual soundscape maps. We discuss the Playful Learning, Internet of Audio Things, and Bird Monitoring principles that shaped the design of our paradigm, and analyze its potential technical implementation.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stochastic modeling and simulation of olive fruit fly outbreaks",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S221201731300145X",
            "Abstract": "Lately lot of work has been done in the area of modeling insect population dynamics based on the emergency of new information technologies. In this paper we propose a real-time online alert information system for estimating the population evolution of the olive fruit fly. The proposed system simulates the evolution of the biological cycle of olive fruit fly as well as its activity in real field using mobile platforms (smartphones, tablets) for the distributed collection of data from traps and local climate and topological data thus predicting timely olive fruit fly outbreaks. Simulation results are depicted validating the robustness of the proposed information system and revealing the importance of appropriate population control measures in the right time and place.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Optimized binaural modeling for immersive audio applications",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=3229724856421687161&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Emergency voice/stress-level combined recognition for intelligent house applications",
            "Publication year": 2012,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=16253",
            "Abstract": "Legacy technologies for word recognition can benefit from emerging affective voice retrieval, potentially leading to intelligent applications for smart houses enhanced with new features. In this work we introduce the implementation of a system, capable to react to common spoken words, taking into account the estimated vocal stress level, thus allowing the realization of a prioritized, affective aural interaction path. Upon the successful word recognition and the corresponding stress level estimation, the system triggers particular affective-prioritized actions, defined within the application scope of an intelligent home environment. Application results show that the established affective interaction path significantly improves the ambient intelligence provided by an affective vocal sensor that can be easily integrated with any sensor-based home monitoring system.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:r0BpntZqJG4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Method and system for a quality of service mechanism for a wireless network",
            "Publication year": 2005,
            "Publication url": "https://patents.google.com/patent/US20060045050A1/en",
            "Abstract": "A quality of service mechanism for a wireless network includes providing an admission control policy for a quality of service access point (QAP) to manage bandwidth by accepting or denying service to admitted traffic streams of quality of service stations (QSTAs) Further included is renegotiating different access category parameters in the QAP for enhancing performance in the wireless network. An additional aspect also includes monitoring in the QSTAs for enhanced networking to determine whether bandwidth allocation to a specific access category meets QoS requirements under time-varying network conditions and renegotiating admitted access category bandwidth if necessary.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effective Bandwidth Control Policies for QoS-enabled Wireless Networks",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.595.7202&rep=rep1&type=pdf",
            "Abstract": "In this paper, an admission control policy is introduced, suitable for efficiently controlling traffic admissions under the Enhanced Distributed Channel Access (EDCA) method, which is employed as the basic access scheme in the latest IEEE802. 11e draft specification. Moreover, based on a novel traffic renegotiation strategy, an adaptive bandwidth allocation scheme is presented, which monitors the admitted traffic bandwidth resources and provides constant QoS guarantees under unpredictable wireless environment conditions, such as channel degradation and data bursting.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time spatial representation of moving sound sources",
            "Publication year": 2007,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14336",
            "Abstract": "methods) or in time  frequency representations. Parameter cross  fading is usually used in the time domain, where the HRTFs are either approximated by IIR filters, or minimum phase filters where the interaural time differences ITDs are pre-calculated and simulated by time varying digital time delays. For the case of frequency domain processing output cross  fading can be applied (or alternatively an overlap on the input data), which smoothes out the transients occurring when filters are changed [18]. The main drawback of time  domain methods is that they are based on alteration of the features of the HRTFs (minimum-phase or IIR approximations). On the other hand, simple output cross-fading, apart from being computationally burdensome, as a mixture of two different systems might not resemble that of a single system intermediate between the two [12]. Authentic representation of moving sound sources in …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A socially-intelligent multi-robot service team for in-home monitoring",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878763/",
            "Abstract": "The objective of this study is to develop a socially-intelligent service team comprised of multiple robots with sophisticated sonic interaction capabilities that aims to transparently collaborate towards efficient and robust monitoring by close interaction. In the distributed scenario proposed in this study, the robots share any acoustic data extracted from the environment and act in-sync with the events occurring in their living environment in order to provide potential means for efficient monitoring and decision-making within a typical home enclosure. Although each robot acts as an individual recognizer using a novel emotionally-enriched word recognition system, the final decision is social in nature and is followed by all. Moreover, the social decision stage triggers actions that are algorithmically distributed among the robots' population and enhances the overall approach with the potential advantages of the team work within …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An rss-feed auditory aggregator using earcons",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2095667.2095681",
            "Abstract": "In this work we present a data sonification framework based on parallel/concurrent sonic earcons' representations for monitoring in real-time information related to stock market. The information under consideration is conveyed through the well-known Really Simple Syndication (RSS) feed Internet mechanism and includes both text and numeric values, converted to speech and earcons using existing speech synthesis techniques and sonic design guidelines. Due to the considered application characteristics, particular emphasis is provided on information representation concurrency, mainly achieved using sound source spatialization techniques and different timbre characteristics. Spatial positioning of sound sources is performed through typical binaural processing and reproduction. A number of systematic, subjective assessments performed have shown that the overall perceptual efficiency and sonic representation …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A high-quality digital audio delivery bluetooth platform",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1706488/",
            "Abstract": "The recent growth of home networking applications has raised the requirement for cable-free audio streaming. In this work, the \"BlueDAT\" digital audio platform is presented, which employs the Bluetooth wireless technology for real-time, CD-like quality, stereo reproduction. It is shown that, despite the strict throughput limitations imposed by the Bluetooth protocol, the BlueDAT application setup can efficiently accommodate cable-free, high-quality audio streaming and playback over one or two receivers for home environments, through the employment of a set of novel mechanisms for the automatic adaptation of both the transmission rate and the audio coding bitrate",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ambiStar: A virtual space representation using 3D human interaction",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5514532/",
            "Abstract": "Nowadays, interaction represents an attractive approach for deploying new forms of entertainment and art. Towards this aim, novel technologies can make possible advanced concepts of interaction, hence supporting complicated application scenarios. In this work, an interactive audiovisual installation is presented, which aims to make the participant interact with the stars in the space. Human gesture based interaction is employed in order to control the visual and audio reproduction in real time.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart microphone sensor system platform",
            "Publication year": 2012,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=16604",
            "Abstract": "A platform for a flexible, smart microphone system using available hardware components is presented. Three subsystems are employed, specifically:(a) a set of digital MEMs microphones, with a one-bit serial output (b) a preprocessing/Digital-to-Digital converter and (c) an CPU/DSP-based embedded system with I2S connectivity. Basic preprocessing functions, such as noise gating and filtering can be performed in the preprocessing stage, while application-specific algorithms such as word spotting, beam-forming and reverberation suppression, can be handled by the embedded system. Widely used high-level operating systems are supported including drivers for a number of peripheral devices. Finally, an employment scenario for a wireless home automation speech activated front-end sensor system using the platform is analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reproduction of audiovisual interactive events in virtual ancient Greek spaces",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/6283859/387-0.pdf",
            "Abstract": "This paper presents a novel methodology that fully integrates auralization, visualization and navigation techniques for producing interactive virtual spaces and events. This methodology is mainly addressed, but not limited to, to the subjective evaluation of the acoustical analysis and simulation of spaces. In this work, the proposed methodology is demonstrated with two typical open and closed ancient Greek spaces. The motivation for using such spaces is the ancient Greek’s experience and achievements on the construction of Theatres and Cultural places. The goal is the virtual reproduction of the atmosphere of the events occurred in these spaces. The acoustic navigation and auralization is performed in real time using modern acoustic, computer-based simulation methods, while real-time visualization techniques allow accurate navigation and listener positioning in the virtual space. A number of acoustical and …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Study of Wireless Compressed Digital-Audio Transmission",
            "Publication year": 2002,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=11358",
            "Abstract": "The paper examines the transmission of audio coded according to the MPEG-I Layer III standard over the Bluetooth Wireless Digital protocol. The study presents the effect of the transmission parameters (such as distance, packet type and length) on the achieved wireless bit rate. The paper also analyzes several aspects concerning the real-time implementation of complete Bluetooth-based audio playback setups and addresses the effects of using single-channel, stereo or multichannel audio streams.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "An adaptive complex data investigation methodology using interactive multi-menus",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-77745-0_38",
            "Abstract": "Multimedia presentation of dynamic rheological experimental and simulated data sets is a complex process, due to the dynamic interrelation of the data. In this work we address the problem of direct data interaction, focusing particularly on the case where the application has to dynamically handle changes at runtime. Interactivity modeling relies on visual metadata representations, which are both used to relate directly to the underlying system-graph and formally describe content-connectivity. Under this context a novel user-interaction structure (Multi-Menu) is introduced, allowing valid-only data comparison across the vast number of possible results combinations, supporting discussion-based data combinations and user-driven scenarios, which can in turn trigger automated simulation execution to generate missing data. The proposed methodology applies to other complex data investigation scenarios and systems …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Interactive music composition driven by feature evolution",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s40064-016-2398-8",
            "Abstract": "Evolutionary music composition is a prominent technique for automatic music generation. The immense adaptation potential of evolutionary algorithms has allowed the realisation of systems that automatically produce music through feature and interactive-based composition approaches. Feature-based composition employs qualitatively descriptive music features as fitness landmarks. Interactive composition systems on the other hand, derive fitness directly from human ratings and/or selection. The paper at hand introduces a methodological framework that combines the merits of both evolutionary composition methodologies. To this end, a system is presented that is organised in two levels: the higher level of interaction and the lower level of composition. The higher level incorporates the particle swarm optimisation algorithm, along with a proposed variant and evolves musical features according to user ratings. The …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:P5F9QuxV20EC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Affectively Enhanced Subs: Visualization of Auditory Events With Color Scales and Animation",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/chapter/affectively-enhanced-subs/243531",
            "Abstract": "This chapter presents the framework for a system that enhances the subtitles of a video file by detecting affective audio content. A model for the visualization of general and emotional information that is typically included in the audio material of a video file (TV/movies) is implemented. Depending on its nature, the content is visualized as an animated cartoon (sound assistant) and/or in the corresponding subtitle text channel, thereby supporting the monitoring of the above material in cases of hearing-impaired viewers, or in general cases that perception of sound during playback is problematic. An animated cartoon is proposed as a way of representing the emotional content of an audio event (speech) and the general content of an audio event (type of sound) in video, while color scales on the subtitles' fonts are used to represent basic emotions.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Affective acoustic ecology: Towards emotionally enhanced sound events",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2371456.2371474",
            "Abstract": "Sound events can carry multiple information, related to the sound source and to ambient environment. However, it is well-known that sound evokes emotions, a fact that is verified by works in the disciplines of Music Emotion Recognition and Music Information Retrieval that focused on the impact of music to emotions. In this work we introduce the concept of affective acoustic ecology that extends the above relation to the general concept of sound events. Towards this aim, we define sound event as a novel audio structure with multiple components. We further investigate the application of existing emotion models employed for music affective analysis to sonic, non-musical, content. The obtained results indicate that although such application is feasible, no significant trends and classification outcomes are observed that would allow the definition of an analytic relation between the technical characteristics of a sound …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Frequency-domain stochastic error concealment for wireless audio applications",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-008-0059-z",
            "Abstract": "Real time digital audio delivery over Wireless Local Area Networks (WLANs) represents an attractive, flexible and cost effective framework for realizing high-quality, multichannel home audio applications. However, the unreliable nature of WLANs IP link frequently imposes significant playback quality degradation, due to delay or permanent loss of a number of transmitted digital audio packets. In this paper, a novel packet error concealment technique is presented, based on the spectral reconstruction of the statistical equivalent of a previously successfully received audio data packet. It is shown that the proposed data reconstruction scheme outperforms previously published error concealment strategies, in both terms of objective and perceptual criteria.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Enhancement of IEEE 802.11 in handling multiple broadcasting audio data in wireless ad-hoc networks",
            "Publication year": 2013,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=16702",
            "Abstract": "Audio networking is a growing field, introducing new and exiting possibilities in the professional audio industry [1]; but it also drastically changes the way audio systems will be designed, built, and used. Today’s networks have enough bandwidth to transport hundreds of high quality audio channels, replacing hundreds of kilograms of cabling in conventional analog audio systems [2]. Currently there are many systems on the market that distribute audio over Ethernet but the majority of sound engineers are not using them yet. There are mainly two reasons that audio networks are not as popular as expected. First, many of the systems are based on a proprietary implementation that does not allow interoperability between different vendors. Second, wired networks, like the conventional analog audio networks, also need a cable installation. It is therefore understood that the development of a wireless digital audio …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:35N4QoGY0k4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Educational audio gamification: Theory and practice",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Emmanouel-Rovithis/publication/330369176_Educational_Audio_Gamification_Theory_and_Practice/links/5c3ccb97458515a4c725b10c/Educational-Audio-Gamification-Theory-and-Practice.pdf",
            "Abstract": "Electronic computer games used for educational purposes currently constitute an essential component of the learning process. By combining entertaining elements with interactive technologies to deliver the respective curricula they can enhance the development of various skills, as well as serve as platforms for the application of modern educational theories. Audio Games (AG) are a particular genre of electronic games, in which all information is conveyed mainly or exclusively through sound. Thus, players need to employ their sense of hearing to understand and accomplish the necessary tasks, a process that promotes their concentration, memory, fantasy, emotion, perception, data management and cooperation. Even though research findings have shown that both game and audio interaction have positive effects on the user, there has been no systematic approach in designing educational AG and implementing them in the learning process. In this paper the authors attempt to establish the theoretical frame for the design of educational AG by arguing that their features comply with the goals of music education, as these are formulated in the official Program of Music Studies by the Greek Ministry of Education, and in the Primary Years Program on learning Arts by the International Baccalaureate Institution, on local and global level respectively. In that context, three different audio gamification approaches developed by the authors are discussed as suggestions for incorporation into formal education. The first one aims at raising users’ awareness about the harmful impact of noize on the acoustic environment, the second one introduces players to …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Investigating the impact of sound angular position on the listener affective state",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7010884/",
            "Abstract": "Emotion recognition from sound signals represents an emerging field of recent research. Although many existing works focus on emotion recognition from music, there seems to be a relative scarcity of research on emotion recognition from general sounds. One of the key characteristics of sound events is the sound source spatial position, i.e. the location of the source relatively to the acoustic receiver. Existing studies that aim to investigate the relation of the latter source placement and the elicited emotions are limited to distance, front and back spatial localization and/or specific emotional categories. In this paper we analytically investigate the effect of the source angular position on the listener's emotional state, modeled in the well-established valence/arousal affective space. Towards this aim, we have developed an annotated sound events dataset using binaural processed versions of the available International …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Artificial intelligence methods for music generation: a review and future perspectives",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128197141000245",
            "Abstract": "Applying artificial intelligence (AI) methods for music generation has been attracting the interest of researchers since the first days of computing. Music has self-referentiality, i.e., does not necessarily relate to extramusical concepts, and is organized on multiple interrelated levels of abstraction, a fact that makes it a peculiar test-bed for AI methods. This chapter focuses on how different AI methods model abstractions from musical surfaces, how they model knowledge, and knowledge acquisition mechanisms. The main categories presented herein are (i) nonadaptive methods that rely on user modeling for generating interesting and meaningful music, (ii) probabilistic approaches that learn, either implicitly or explicitly, from data, and (iii) evolutionary methods that allow intuitive user interaction. Based on the review of such methods, this chapter attempts to highlight some recent algorithmic developments that might lead …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:sSrBHYA8nusC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A clustering strategy for the key segmentation of musical audio",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6792257/",
            "Abstract": "Key changes are common in Western classical music. The precise segmentation of a music piece at instances where key changes occur allows for further analysis, like self-similarity analysis, chord recognition, and several other techniques that mainly pertain to the characterization of music content. This article examines the automatic segmentation of audio data into parts composed in different keys, using clustering on chroma-related spaces. To this end, the  k -means algorithm is used and a methodology is proposed so that useful information about key changes can be derived, regardless of the number of clusters or key changes. The proposed methodology is evaluated by experimenting on the segmentation of recordings of existing compositions from the Classic-Romantic repertoire. Additional analysis is performed using artificial data sets. Specifically, the construction of artificial pieces is proposed as a means to …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:vV6vV6tmYwMC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "Intelligent generation of rhythmic sequences using Finite L-systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6274273/",
            "Abstract": "Algorithmic music synthesis with intelligent methodologies is a subject of research under both unsupervised and supervised forms, with the production of rhythm being an important aspect of the compositional process. Unsupervised algorithms tend to produce rhythms that are described either as simplistic and repetitive, or very complex and unstable. This work examines a modification of the legacy L-systems that are hereby termed as Finite L-systems (FL-systems). With this modification, the produced symbolic sequences are more controllable, offering a rhythm production alternative that is more flexible than the L-systems. In particular, when used for unsupervised rhythm production, FL-systems construct rhythmic sequences with great variability in terms of complexity and repetitiveness. This trend indicates that their combination with learning algorithms may provide a flexible supervised rhythm production system.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Audio fingerprint extraction using an adapted computational geometry algorithm",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Marios-Poulos/publication/243971077_Audio_Fingerprint_Extraction_Using_an_Adapted_Computational_Geometry_Algorithm/links/5809130c08ae993dc0509ed3/Audio-Fingerprint-Extraction-Using-an-Adapted-Computational-Geometry-Algorithm.pdf",
            "Abstract": "This work presents an adapted version of the Computational Geometry Algorithm (CGA) used for the development of audio-based applications and services. The CGA algorithm analyses an audio stream and produces a unique set of points that can be considered to be the audio data “fingerprint”. It is shown that this fingerprint is coding-independent, a fact that can render the proposed algorithm suitable for multiple purposes, including the categorisation of content identity and the identification of audio clips, hence providing support for the realisation of audio sorting/searching tasks and services. Additionally, based on specific novel applications and services, the overall algorithmic performance and efficiency characteristics of the CGA algorithm are discussed and analysed.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Canadian Center of Science and Education"
        },
        {
            "Title": "Real-time spatial mixing using binaural processing",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/44844675/48.pdf",
            "Abstract": "In this work, a professional audio mastering/mixing software platform is presented which employs stateof-the-art binaural technology algorithms for efficient and accurate sound source positioning. The proposed mixing platform supports high-quality audio (typically 96kHz/24bit) for an arbitrary number of sound sources, while room acoustic analysis and simulation models are also incorporated. All binaural calculations and audio signal processing/mixing are performed in real-time, due to the employment of an optimized binaural 3D Audio Engine developed by the authors. Moreover, all user operations are performed through a user-friendly graphical interface allowing the efficient control of a large number of binaural mixing parameters. It is shown that the proposed mixing platform achieves subjectively high spatial impression, rendering it suitable for high-quality professional audio applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bringing quality in the 802.11 wireless arena",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=14455842709568593073&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EvoDrummer: Deriving rhythmic patterns through interactive genetic algorithms",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-36955-1_3",
            "Abstract": "Drum rhythm automatic construction is an important step towards the design of systems which automatically compose music. This work describes a novel mechanism that allows a system, namely the evoDrummer, to create novel rhythms with reference to a base rhythm. The user interactively defines the amount of divergence between the base rhythm and the generated ones. The methodology followed towards this aim incorporates the utilization of Genetic Algorithms and allows the evoDrummer to provide several alternative rhythms with specific, controlled divergence from the selected base rhythm. To this end, the notion of rhythm divergence is also introduced, based on a set of 40 drum–specific features. Four population initialization schemes are discussed and an extensive experimental evaluation is provided. The obtained results demonstrate that, with proper population initialization, the evoDrummer is …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Error–Concealment Technique for Wireless Digital Audio Delivery",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/49001643/pub_fpr.pdf",
            "Abstract": "Real-time digital audio streaming over unreliable wireless IP networks, such as WLANs, encounters playback quality degradation, due to late arrivals or permanent loss of the transmitted packets. In this paper we present a perceptually efficient error concealment technique, which, combined with playback synchronization correction schemes and a high-rate wireless transmission protocol with Qualityof-Service support, can significantly improve the overall audio playback quality of typical multichanel home-theater wireless applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distortion-free 1-bit PWM coding for digital audio signals",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2007/94386.pdf",
            "Abstract": "Although uniformly sampled pulse width modulation (UPWM) represents a very efficient digital audio coding scheme for digital-to-analog conversion and full-digital amplification, it suffers from strong harmonic distortions, as opposed to benign non-harmonic artifacts present in analog PWM (naturally sampled PWM, NPWM). Complete elimination of these distortions usually requires excessive oversampling of the source PCM audio signal, which results to impractical realizations of digital PWM systems. In this paper, a description of digital PWM distortion generation mechanism is given and a novel principle for their minimization is proposed, based on a process having some similarity to the dithering principle employed in multibit signal quantization. This conditioning signal is termed\" jither\" and it can be applied either in the PCM amplitude or the PWM time domain. It is shown that the proposed method achieves …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A paradigm for wireless digital audio home entertainment",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Floros/publication/228750408_A_Paradigm_for_Wireless_Digital_Audio_Home_Entertainment/links/0fcfd50ad085037e47000000/A-Paradigm-for-Wireless-Digital-Audio-Home-Entertainment.pdf",
            "Abstract": "Despite recent advances in wireless networking technology, real-time streaming of CD-quality digital audio remains a challenging topic. In this work, a set of applications following the server-client model was developed, facilitating the transmission and playback of PCM-coded audio over wireless links. The implementation is based on typical Personal Computer (PC) platforms interconnected with off-the-shelf wireless networking hardware. Performance evaluation tests are presented under different networking parameters and link conditions, leading to an optimal set of parameters for high-quality wireless digital audio delivery.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towars an interactive E-learning system based on emotions and affective cognition",
            "Publication year": 2010,
            "Publication url": "http://www.ionio.gr/~mgiannak/ICICTE_2010.pdf",
            "Abstract": "In order to promote a more dynamic and flexible communication between the learner and the system, we present a structure of a new innovative and interactive e-learning system which implements emotion and level of cognition recognition. The system has as inputs the emotional and cognitive state of the user and re-organises the content and adjusts the flow of the course. Our concept aims to increase the learning efficiency of intelligent tutoring systems by using a combination of characteristics, such as content customization and user’s emotion recognition, and adapting all these features into a learner-centered educational system.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmenting virtual-reality environments with social-signal based music content",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6004944/",
            "Abstract": "Virtual environments and computer games incorporate music in order to enrich the audiovisual experience and further immerse users. Selecting musical content during design-time can have a controversial result based on the preferences of the users involved, while limiting the interactivity of the environment, affecting thus the effectiveness of immersion. In this work, we introduce a framework for the selection and incorporation of user preferable musical data into interactive virtual environments and games. The framework designates guidelines for both design and run-time annotation of scenes. Consequently, personal music preferences collected through local repositories or social networks can be processed, analysed, categorised and prepared for direct incorporation into virtual environments. This permits automated audio selection based on scene characteristics and scene characters' interaction, enriching or …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An evaluation tool for Wireless Digital Audio applications",
            "Publication year": 2005,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=13102",
            "Abstract": "Despite the recent advances in the wireless networking technology, wireless multichannel digital audio delivery is not yet efficiently realized, because of the additional implementation issues raised for managing possible distortions introduced. In this work, a novel, open-architecture, software platform for evaluating wireless digital audio distribution is presented. This tool facilitates the assessment of real-time playback distortions induced by variable packet reception delays and packet losses, typically encountered in WLAN transmissions. Moreover, this platform can be also employed for producing audio streams corresponding to the wirelessly delivered digital audio, in order to investigate the audibility of such distortions.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:TQgYirikUcIC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Interactive audio realities: An augmented/mixed reality audio game prototype",
            "Publication year": 2011,
            "Publication url": "http://www.aes.org/e-lib/online/browse.cfm?elib=15826",
            "Abstract": "Audio-games represent a game alternative based on audible feedback rather than on visual. They may benefit from parametric sound synthesis and advanced audio technologies (ie augmented reality audio), in order to effectively realize complex scenarios. In this work, a multiplayer game prototype is introduced which employs the concept of controlled mixed reality in order to augment the sound environment of each player. The prototype is realized as multiple user audiovisual installations, which are interconnected in order to communicate the status of the selected control parameters in real-time. The prototype reveals significant relevance to the-well known on-line multiplayer games, with its novelty originating from the fact that user interaction is realized in augmented reality audio environments.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:-f6ydRqryjwC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Gestural user interface for audio multitrack real-time stereo mixing",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2544114.2544123",
            "Abstract": "Sound mixing is a well-established task applied (directly or indirectly) in many fields of music and sound production. For example, in the case of classical music orchestras, their conductors perform sound mixing by specifying the reproduction gain of specific groups of musical instruments or of the entire orchestra. Moreover, modern sound artists and performers also employ sound mixing when they compose music or improvise in real-time. In this work a system is presented that incorporates a gestural interface for real-time multitrack sound mixing. The proposed gestural sound mixing control scheme is implemented on an open hardware micro-controller board, using common sensor modules. The gestures employed are as close as possible to the ones particularly used by the orchestra conductors. The system overall performance is also evaluated in terms of the achieved user experience through subjective tests.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Audio games as educational tools: Design principles and examples",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7048083/",
            "Abstract": "Audio-Games (AGs) are electronic games that mainly (or exclusively) implement auditory means to express the game's plot, mechanics and content. AG players need to concentrate on perceiving sound, in order to understand and play the game. Recent developments in the field of edutainment suggest that AGs can be implemented not only as entertaining systems, but also as valid tools for research and education on any curriculum related (but no limited) to acoustics and sound studies. This paper will first discuss existing approaches to organizing the sonic content of an AG. Then it will propose a methodology for designing an AG for educational purposes. Finally, a case-study consisting of the development of two educational AGs related to the issue of noise will be demonstrated, on which the proposed methodology is applied.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Elevator: Emotional Tracking using Audio/visual Interaction",
            "Publication year": 2009,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?elib=14853",
            "Abstract": "The research interest on modeling everyday human emotions and controlling them through typical multimedia content (ie audio and video data) has recently increased. In this work, an interactive methodology is introduced for detecting, controlling and tracking emotions. Based on the above methodology, an interactive audiovisual installation termed “Elevator” was realized, aiming to analyze and manipulate simple emotions of the participants (such as anger) using simplified emotion detection audio signal processing techniques and specifically selected combined audio/visual content. As a result, the human emotions are “elevated” to pre-defined levels and appropriately mapped to visual content which corresponds to the emotional “thumbnail” of the participants.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "A distortion-free PWM coder for all-digital audio amplifiers",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=349011007350003339&hl=en&oi=scholarr",
            "Abstract": "Using analytic PCM-to-PWM mapping, combined with a novel method for eliminating PWM-induced distortions (“Jithering”), a distortion-free, all-digital and high-quality PWM coder was developed. High efficiency and performance is achieved at switching frequencies between 44.1-176.4 kHz. A Field Programmable Gate Array-based environment was used for the implementation of the PWM converter, which is suitable for any digital audio applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:ufrVoPGSRksC",
            "Publisher": "Audio Engineering Society; 1999"
        },
        {
            "Title": "Optimized Binaural Modeling for Immersive Audio Applications",
            "Publication year": 2007,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14085",
            "Abstract": "Recent developments related to immersive audio systems are mainly originating from binaural audio processing technology. In this work, a novel high-quality binaural modeling engine is presented suitable for supporting a wide range of applications in the area of virtual reality, mobile playback and computer games. Based on a set of optimized algorithms for Head-Related Transfer Functions (HRTF) equalization, acoustic environment modeling and crosstalk cancellation, it is shown that the proposed binaural engine can achieve significantly improved authenticity for 3D audio representation in real-time. A complete binaural synthesis application is also presented that demonstrates the efficiency of the proposed algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Audio legends: investigating sonic interaction in an augmented reality audio game",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/573154",
            "Abstract": "Augmented Reality Audio Games (ARAG) enrich the physical world with virtual sounds to express their content and mechanics. Existing ARAG implementations have focused on exploring the surroundings and navigating to virtual sound sources as the main mode of interaction. This paper suggests that gestural activity with a handheld device can realize complex modes of sonic interaction in the augmented environment, resulting in an enhanced immersive game experience. The ARAG “Audio Legends” was designed and tested to evaluate the usability and immersion of a system featuring an exploration phase based on auditory navigation, as well as an action phase, in which players aim at virtual sonic targets and wave the device to hit them or hold the device to block them. The results of the experiment provide evidence that players are easily accustomed to auditory navigation and that gestural sonic interaction is perceived as difficult, yet this does not affect negatively the system’s usability and players’ immersion. Findings also include indications that elements, such as sound design, the synchronization of sound and gesture, the fidelity of audio augmentation, and environmental conditions, also affect significantly the game experience, whereas background factors, such as age, sex, and game or music experience, do not have any critical impact. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Stereo goes mobile: Spatial enhancement for short-distance loudspeaker setups",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6274275/",
            "Abstract": "Modern mobile, hand-held devices offer enhanced capabilities for video and sound reproduction. Nevertheless, major restrictions imposed by their limited size render them inconvenient for headset-free stereo sound reproduction, since the corresponding short-distant loudspeakers placement physically narrows the perceived stereo sound localization potential. In this work, we aim at evaluating a spatial enhancement technique for small-size mobile devices. This technique extracts the original panning information from an original stereo recording and spatially extends it using appropriate binaural rendering. A sequence of subjective tests performed shows that the derived spatial perceptual impression is significantly improved in all test cases considered, rendering the proposed technique an attractive approach towards headset-free mobile audio reproduction.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent music composition",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780124051638000107",
            "Abstract": "Automatic music composition has blossomed with the introduction of intelligent methodologies in computer science. Thereby, many methodologies for automatic music composition have been or could be described as “intelligent,” but what exactly is it that makes them intelligent? Furthermore, is there any categorization of intelligent music composition (IMC) methodologies that is both consistent and descriptive? This chapter aims to provide some insights on what IMC methodologies are, through proposing and analyzing a detailed categorization of them. Toward this perspective, methodologies that incorporate bioinspired intelligent algorithms (such as cellular automata, L-systems, genetic algorithms, swarm intelligence, among others) as well as their combinations are considered and briefly reviewed. At the same time, a consistent categorization of these methodologies is proposed, taking into account the utilization …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Perceptually-optimized error concealment for audio over WLANs",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/6612560/published_paper.pdf",
            "Abstract": "Digital audio delivery over Wireless Local Area Networks (WLANs) represents an attractive framework for realizing high quality, multichannel audio applications in home and small office enclosures, offering increased setup flexibility and cable-free, low cost audio system interconnections. However, real-time digital audio streaming over unreliable wireless IP networks, such as WLANs, may encounter significant playback quality degradation, due to the unpredictable and variable link quality that causes delayed audio delivery or even permanent loss of the transmitted packets. In this paper, we present a perceptually efficient error concealment technique which combined with playback synchronization correction schemes, and a high-rate wireless transmission protocol with Quality-of-Service (QoS) support that can significantly enhance the overall audio playback quality of typical multichannel home-theater wireless applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the Impact of Sound Events’ Rhythm Characteristics to Listener’s Valence",
            "Publication year": 2015,
            "Publication url": "https://www.aes.org/e-lib/online/browse.cfm?elib=17573",
            "Abstract": "While modern sound researchers generally focus on speech and music, mammalian hearing arose from the need to sense those events in the environment that produced sound waves. Such unorganized sound stimuli, referred to as Sound Events (SEs), can also produce an affective and emotional response. In this research, the investigators explore valence recognition of SEs utilizing rhythm-related acoustics cues. A well-known data set with emotionally annotated SEs was employed; various rhythm-related attributes were then extracted and several machine-learning experiments were conducted. The results portray that the rhythm of a SE can affect the listener’s valence up to an extent and, combined with previous works on SEs, could lead to a comprehensive recognition of the rhythm’s effect on the emotional state of the listener.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:_xSYboBqXhAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Adaptive Audio Mixing for Enhancing Immersion in Augmented Reality Audio Games",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3395035.3425325",
            "Abstract": "In this work we present an adaptive audio mixing technique to be implemented in the design of Augmented Reality Audio (ARA) systems. The content of such systems is delivered entirely through the acoustic channel: the real acoustic environment is mixed with a virtual soundscape and returns to the listener as\" pseudoacoustic\" environment. We argue that the proposed adaptive mixing technique enhances user immersion in the augmented space in terms of the localization of sound objects. The need to optimise our ARA mixing engine emerged from our previous research, and more specifically from the analysis of the experimental results regarding the development of the Augmented Reality Audio Game (ARAG)\" Audio Legends\" that was tested on the field. The purpose of our new design was to aid sound localization, which is a crucial and demanding factor for delivering an immersive acoustic experience. We …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AstroSonic: an educational audio gamification approach",
            "Publication year": 2018,
            "Publication url": "http://ceur-ws.org/Vol-2811/Paper17.pdf",
            "Abstract": "This paper introduces the work-in-progress AstroSonic, an educational audio-only game on the subject of Astronomy that aims to investigate the efficiency of applying game mechanics on non-speech audio content to convey non-musical, scientific curricula. First, the authors establish the theoretical framework by analyzing the positive impact of audio interaction in the context of educational and game environments, discussing the directions, in which educational audio games have been developed, and describing the ways, in which sound has been implemented for the sonification of astronomical data. Then, the first two levels of the game are presented in terms of concept, sound, and mechanics design, as well as how these reflect on the targeted curriculum by guiding players to fly their spaceship into low earth orbit and collect hazardous space debris.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Augmented Reality Audio Live Network for Live Electroacoustic Music Concerts",
            "Publication year": 2016,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=18503",
            "Abstract": "Augmented reality audio (ARA) represents a well-established and widely investigated concept that typically relies on mixing of the real acoustic environment of a listener with a virtual one. In this work, we conceptually extend this legacy ARA framework, aiming to the increment of the synthesized acoustic field spatial scale primarily in the real world domain. Such an increment actually acts as a virtual wide-angle sound focuser of wide area acoustic fields. We demonstrate the above Augmented Reality Audio Network (ARAN) concept in terms of a live electroacoustic music concert. A subjective evaluation derived strong and secure indications that the proposed ARAN framework may represent a strong alternative potential of legacy ARA in the artistic and creative domain.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:KxtntwgDAa4C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Genetic evolution of L and FL-systems for the production of rhythmic sequences",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2330784.2330855",
            "Abstract": "Music composition with algorithms inspired by nature has led to the creation of systems that compose music with rich characteristics. Nevertheless, the complexity imposed by unsupervised algorithms may arguably be considered as undesired, especially when considering the composition of rhythms. This work examines the composition of rhythms through L and Finite L-systems (FL-systems) and presents an interpretation from grammatical to rhythmic entities that expresses the repetitiveness and diversity of the output of these systems. Furthermore, we utilize a supervised training scheme that uses Genetic Algorithms (GA) to evolve the rules of L and FL-systems, so that they may compose rhythms with certain characteristics. Simple rhythmic indicators are introduced that describe the density, pauses, self similarity, symmetry and syncopation of rhythms. With fitness evaluations based on these indicators we assess …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "BlueBox: a cable-free digital jukebox for compressed-quality audio delivery",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1467998/",
            "Abstract": "The recent growth of home networking applications has raised the requirement for cable-free distribution of an increasing amount of media to portable playback devices, which lack the resources for local storage. In this work, the \"BlueBox\" wireless digital jukebox application is presented, which employs the Bluetooih wireless technology for distributing on demand, high-quality compressed audio, originally stored in a Bluetooth-enabled digital jukebox to remote portable client devices. It is shown that despite the strict throughput limitations imposed by the early-defined Bluetooth protocols, the BlueBox application setup can efficiently accommodate cable-free, high-quality audio distribution over an adequate number of receivers for home environments.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sonic perceptual crossings: A tic-tac-toe audio game",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2095667.2095680",
            "Abstract": "The development of audio-only computer games imposes a number of challenges for the sound designer, as well as for the human machine interface design approach. Modern sonification methods can be used for effective data and game-environment or conditions representation through sound, including earcons and auditory icons. In this work we take advantage of earcons fundamental characteristics, such as spatialization usually employed for concurrent/parallel reproduction, in order to implement a tic-tac-toe audio game prototype. The proposed sonic design is transparently integrated with a novel user control/interaction mechanism that can be easily implemented in state-of-the-art mobile devices incorporating movement sensors (ie accelerometers and gyroscope). The overall prototype design efficiency is assessed in terms of the employed sonification accuracy, while the playability achieved through the …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sound events and emotions: Investigating the relation of rhythmic characteristics and arousal",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6623709/",
            "Abstract": "A variety of recent researches in Audio Emotion Recognition (AER) outlines high performance and retrieval accuracy results. However, in most works music is considered as the original sound content that conveys the identified emotions. One of the music characteristics that is found to represent a fundamental means for conveying emotions are the rhythm-related acoustic cues. Although music is an important aspect of everyday life, there are numerous non-linguistic and nonmusical sounds surrounding humans, generally defined as sound events (SEs). Despite this enormous impact of SEs to humans, a scarcity of investigations regarding AER from SEs is observed. There are only a few recent investigations concerned with SEs and AER, presenting a semantic connection between the former and the listener's triggered emotion. In this work we analytically investigate the connection of rhythm-related characteristics of …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cyberstalking victimization: The role of online lifestyles and routine activities",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=12512338176449099956&hl=en&oi=scholarr",
            "Abstract": "Despite decades of research on the dark side of the web and more than a decade of inquiry specifically on the phenomenon of cyberstalking, researchers have yet to find a theoretical scheme that can sufficiently account for this type of online victimization. The paper at hand reports on an ongoing research project that tests the extent to which the core concepts and analytic framework of a traditional etiology of crime and victimization could be transposed to online (or virtual) settings.  More specifically, our work examines whether a modified version of lifestyle/routine activities theory is able to explain stalking victimization on the World Wide Web. Lifestyle/routine activities theory argues that individuals who lead lifestyles (or have routine activities) that are characterized by four key factors are more susceptible to victimization than individuals who do not lead such lifestyles. These four factors include a lifestyle or routines …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A low complexity IEEE802. 11e scheduling scheme for efficient wireless delivery",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4537181/",
            "Abstract": "In this work, a novel algorithm is presented, suitable for deriving effective service scheduling schemes under the Hybrid Controlled Channel Access (HCCA) method employed as the centralized polling mechanism for parameterized channel access in the IEEE802.11e specification. Compared to existing service schedulers, the proposed novel algorithm demonstrates a significant bandwidth management improvement and optimal QoS performance, especially for high-quality audio/video streaming applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cable-Free Audio Delivery for Home Theater Entertainment Systems",
            "Publication year": 2008,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14524",
            "Abstract": "Real time, multichannel audio content delivery over the air is expected to significantly simplify the interconnection complexity required for setting up typical home theater applications. However, despite the technological advantages of wireless networking standards related to high transmission rates and Quality4of4Service support, a number of issues have to be additionally addressed, such as multiple loudspeaker synchronization and packet delay/losses containing compressed quality and multiplexed audio data. In this work, further developments in the area of wireless audio delivery are presented by considering in detail multichannel reproduction for wireless home theater applications. Using both subjective and objective performance evaluation criteria, it is shown that cable4free multichannel audio playback is feasible under specific networking and audio coding conditions.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Delivering high-quality audio over WLANs",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=6166087403282715801&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances on calculating effective dither for audio signals",
            "Publication year": 2006,
            "Publication url": "http://www.wseas.us/e-library/conferences/2006cscc/papers/534-928.pdf",
            "Abstract": "Dithering represents a well-established, attractive technique for minimizing the audibility of the error produced during requantization of digital audio signals. However, it is also known that, as dither is applied as controlled, additive random noise prior requantisation, it also increases the overall quantization noise level and audibility. In this work, a novel dither generator is presented, based on a novel stochastic approach that derives a statistically equivalent signal to the original input. Using a sequence of tests as well as objective and psychoacoustic measurements, it is shown that the addition of the proposed dither generator output to the initial input signal and the application of a low-order noise shaper significantly suppresses the quantization error perception.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Beads: A dataset of binaural emotionally annotated digital sounds",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878749/",
            "Abstract": "Emotion recognition from generalized sounds is an interdisciplinary and emerging field of research. A vital requirement for this kind of investigations is the availability of ground truth datasets. Currently, there are 2 freely available datasets of emotionally annotated sounds, which, however, do not include sound evenets (SEs) with manifestation of the spatial location of the source. The latter is an inherent natural component of SEs, since all sound sources in real-world conditions are physically located and perceived somewhere in the listener's surrounding space. In this work we present a novel emotionally annotated sounds dataset consisting of 32 SEs that are spatially rendered using appropriate binaural processing. All SEs in the dataset are available in 5 spatial positions corresponding to source/receiver angles equal to 0, 45, 90, 135 and 180 degrees. We have used the IADS dataset as the initial collection of SEs …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Distortion-free PWM Coder for All-digital Audio Amplifiers",
            "Publication year": 2001,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=9999",
            "Abstract": "Using analytic PCM-to-PWM mapping, combined with a novel method for eliminating PWM-induced distortions (“Jithering”), a distortion-free, all-digital and high-quality PWM coder was developed. High efficiency and performance is achieved at switching frequencies between 44.1-176.4 kHz. A Field Programmable Gate Array-based environment was used for the implementation of the PWM converter, which is suitable for any digital audio applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Swarm Intelligence and Bio-Inspired Computation: 10. Intelligent Music Composition",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=pD91DAAAQBAJ&oi=fnd&pg=PP7&dq=info:ABBOpaNSw14J:scholar.google.com&ots=s9v3dYL3AT&sig=ygLgVRJctTnbt65W04fHa2kPTjU",
            "Abstract": "Automatic music composition has blossomed with the introduction of intelligent methodologies in computer science. Thereby, many methodologies for automatic music composition have been or could be described as “intelligent,” but what exactly is it that makes them intelligent? Furthermore, is there any categorization of intelligent music composition (IMC) methodologies that is both consistent and descriptive? This chapter aims to provide some insights on what IMC methodologies are, through proposing and analyzing a detailed categorization of them. Toward this perspective, methodologies that incorporate bioinspired intelligent algorithms (such as cellular automata, L-systems, genetic algorithms, swarm intelligence, among others) as well as their combinations are considered and briefly reviewed. At the same time, a consistent categorization of these methodologies is proposed, taking into account the utilization of their intelligent algorithm in accordance to their overall compositional aims. To this end, three main categories can be defined: the “unsupervised,” the “supervised,” and the “interactive” IMC methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Elsevier Inc. Chapters"
        },
        {
            "Title": "Emotional control and visual representation using advanced audiovisual interaction",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJART.2011.043446",
            "Abstract": "Modern interactive means combined with new digital media processing and representation technologies can provide a robust framework for enhancing user experience in multimedia entertainment systems and audiovisual artistic installations with non-traditional interaction/feedback paths based on user affective state. In this work, the ‘Elevator’ interactive audiovisual platform prototype is presented, which aims to provide a framework for signalling and expressing human behaviour related to emotions (such as anger) and finally produce a visual outcome of this behaviour, defined here as the emotional ‘thumbnail’ of the user. Optimised, real-time audio signal processing techniques are employed for monitoring the achieved anger-like behaviour, while the emotional elevation is attempted using appropriately selected combined audio/visual content reproduced using state-of-the-art audiovisual playback technologies …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Method and system for a quality of service mechanism for a wireless network",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060045051A1/en",
            "Abstract": "A quality of service mechanism for a wireless network includes reserving time for contention-based transmissions of station devices under a polling-based channel access function in an access point. Also included is deriving a scheduled polling service under access rules of the polling-based channel access function, wherein admission capability and bandwidth management of the wireless network are enhanced.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WLAN Technologies for Audio Delivery",
            "Publication year": 2007,
            "Publication url": "https://www.hindawi.com/journals/am/2007/012308/",
            "Abstract": "Audio delivery and reproduction for home or professional applications may greatly benefit from the adoption of digital wireless local area network (WLAN) technologies. The most challenging aspect of such integration relates the synchronized and robust real-time streaming of multiple audio channels to multipoint receivers, for example, wireless active speakers. Here, it is shown that current WLAN solutions are susceptible to transmission errors. A detailed study of the IEEE802.11e protocol (currently under ratification) is also presented and all relevant distortions are assessed via an analytical and experimental methodology. A novel synchronization scheme is also introduced, allowing optimized playback for multiple receivers. The perceptual audio performance is assessed for both stereo and 5-channel applications based on either PCM or compressed audio signals.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Music synthesis based on nonlinear dynamics",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.403.7376&rep=rep1&type=pdf",
            "Abstract": "Music composition from nonlinear dynamics has been a subject of thorough research, producing interesting music tracks. Simple chaotic maps or even more complex iterative schemes have been proposed, taking advantage of the “structured spontaneity” of nonlinear dynamics by directly transforming the mathematical objects to musical entities. In this work we examine the music compositions produced by two nonlinear systems in terms of complexity, expressed through the Shannon Information Entropy of their Pitch Class Profiles. We present a methodology to interpret the information obtained by the iterative equations to several tonal and rhythmic attributes. This methodology is implemented in real-time software. A Graphical User Interface is provided that allows the user to adjust several variables while listening to and observing the derived results.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "METHOD AND SYSTEM FOR A QUALITY OF SERVICE MECHANISM FOR A WIRELESS NETWORK",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060045050A1/en",
            "Abstract": "A quality of service mechanism for a wireless network includes providing an admission control policy for a quality of service access point (QAP) to manage bandwidth by accepting or denying service to admitted traffic streams of quality of service stations (QSTAs) Further included is renegotiating different access category parameters in the QAP for enhancing performance in the wireless network. An additional aspect also includes monitoring in the QSTAs for enhanced networking to determine whether bandwidth allocation to a specific access category meets QoS requirements under time-varying network conditions and renegotiating admitted access category bandwidth if necessary.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Controlling interactive evolution of 8-bit melodies with genetic programming",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00500-012-0872-y.pdf",
            "Abstract": "Automatic music composition and sound synthesis is a field of study that gains continuously increasing attention. The introduction of evolutionary computation has further boosted the research towards exploring ways to incorporate human supervision and guidance in the automatic evolution of melodies and sounds. This kind of human–machine interaction belongs to a larger methodological context called interactive evolution (IE). For the automatic creation of art and especially for music synthesis, user fatigue requires that the evolutionary process produces interesting content that evolves fast. This paper addresses this issue by presenting an IE system that evolves melodies using genetic programming (GP). A modification of the GP operators is proposed that allows the user to have control on the randomness of the evolutionary process. The results obtained by subjective tests indicate that the utilization of …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Hearing the buildings: Smart Monitoring through Advanced Sonification Approaches",
            "Publication year": 2015,
            "Publication url": "https://www.scientific.net/KEM.628.231",
            "Abstract": "Risk prevention of historical buildings through sensor network monitoring represents a challenging and together promising task towards an optimized buildings’ protection plan. Due to the significant character that historical buildings have within the history and identity of local and consequently national communities, the monitoring approach above is nowadays considered a fundamental component of cultural preservation. Modern trends on sensor networks nowadays allow the installation of wireless monitoring equipment, able to collect a large volume and variety of data that can be further processed in order to support prevention modelling techniques and strategies. Despite the valuable post-processing outcome of the above modelling techniques, in several real-time monitoring cases, an aspect that may significant impact the data analysis accuracy from the monitoring engineer is to create an audiovisual …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:vRqMK49ujn8C",
            "Publisher": "Trans Tech Publications Ltd"
        },
        {
            "Title": "On the impact of the semantic content of sound events in emotion elicitation",
            "Publication year": 2016,
            "Publication url": "https://trepo.tuni.fi/handle/10024/125849",
            "Abstract": "Sound events are known to have an influence on the listener’s emotions, but the reason for this influence is less clear. Take for example the sound produced by a gun firing. Does the emotional impact arise from the fact that the listener recognizes that a gun produced the sound (semantic content) or does it arise from the attributes of the sound created by the firing gun? This research explores the relation between the semantic similarity of the sound events and the elicited emotions. Results indicate that the semantic content seems to have a limited role in the conformation of the listener’s affective states. However, when the semantic content is matched to specific areas in the Arousal-Valence space or when the source’s spatial position is considered, the effect of the semantic content is higher, especially for the cases of medium to low valence and medium to high arousal or when the sound source is at the lateral positions of the listener’s head.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Close miking empirical practice verification: A source separation approach",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1802.05132",
            "Abstract": "Close miking represents a widely employed practice of placing a microphone very near to the sound source in order to capture more direct sound and minimize any pickup of ambient sound, including other, concurrently active sources. It is used by the audio engineering community for decades for audio recording, based on a number of empirical rules that were evolved during the recording practice itself. But can this empirical knowledge and close miking practice be systematically verified? In this work we aim to address this question based on an analytic methodology that employs techniques and metrics originating from the sound source separation evaluation field. In particular, we apply a quantitative analysis of the source separation capabilities of the close miking technique. The analysis is applied on a recording dataset obtained at multiple positions of a typical musical hall, multiple distances between the microphone and the sound source multiple microphone types and multiple level differences between the sound source and the ambient acoustic component. For all the above cases we compute the Source to Interference Ratio (SIR) metric. The results obtained clearly demonstrate an optimum close-miking performance that matches the current empirical knowledge of professional audio recording.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmented audio-only games: A new generation of immersive acoustic environments through advanced mixing",
            "Publication year": 2019,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=20336",
            "Abstract": "Audio-only games represent an alternative type of gaming genres that continuously evolves following the technological trends that boost the video-games market. Since augmented reality is now a widespread approach for producing new kind of immersive applications, including games, it is expected that audio-only games will be influenced by this approach. This work represents the beginning of an attempt to investigate the process of delivering augmented audio-only games, focusing on specific technical factors that can improve the user interaction and the overall game-play experience. In particularly, it focuses on a new augmented reality audio mixing process that is optimized for variable acoustic environments, allowing the development of new attractive titles of audio-only games.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:tOudhMTPpwUC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Chaos and Music: From time series analysis to evolutionary composition",
            "Publication year": 2013,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/s0218127413501812",
            "Abstract": "Music is an amalgam of logic and emotion, order and dissonance, along with many combinations of contradicting notions which allude to deterministic chaos. Therefore, it comes as no surprise that several research works have examined the utilization of dynamical systems for symbolic music composition. The main motivation of the paper at hand is the analysis of the tonal composition potentialities of several discrete dynamical systems, in comparison to genuine human compositions. Therefore, a set of human musical compositions is utilized to provide \"compositional guidelines\" to several dynamical systems, the parameters of which are properly adjusted through evolutionary computation. This procedure exposes the extent to which a system is capable of composing tonal sequences that resemble human composition. In parallel, a time series analysis on the genuine compositions is performed, which firstly …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:HoB7MX3m0LUC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Interactive Evolution of 8–bit melodies with Genetic Programming towards finding aesthetic measures for sound",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-29142-5_13",
            "Abstract": "The efficient specification of aesthetic measures for music as a part of modelling human conception of sound is a challenging task and has motivated several research works. It is not only targeted to the creation of automatic music composers and raters, but also reinforces the research for a deeper understanding of human noesis. The aim of this work is twofold: first, it proposes an Interactive Evolution system that uses Genetic Programming to evolve simple 8–bit melodies. The results obtained by subjective tests indicate that evolution is driven towards more user–preferable sounds. In turn, by monitoring features of the melodies in different evolution stages, indications are provided that some sound features may subsume information about aesthetic criteria. The results are promising and signify that further study of aesthetic preference through Interactive Evolution may accelerate the progress towards defining …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "dots: an Audio Entertainment Installation using Visual and Spatial-based Interaction",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/6283867/audiomostly_2008_paper.pdf",
            "Abstract": "“dots” is an interactive sound installation that takes into account the spatial position of an arbitrary number of participants in order to algorithmically synthesize an audio stream in real-time. The installation core is a software application developed during this work, which employs advanced video and audio processing techniques in order to detect the exact participants’ positions and to weight-mix short audio granules. Audio mixing is performed using a virtual spatial gridding of the installation space in two dimensions. The synthesized audio stream reproduction is combined with a number of appropriately designed visual effects, which aim to enhance the participants’ comprehension and render the “dots” installation a high-quality interactive audiovisual platform.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sonic perceptual crossings: A tic-tac-toe audio game",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2095667.2095680",
            "Abstract": "The development of audio-only computer games imposes a number of challenges for the sound designer, as well as for the human machine interface design approach. Modern sonification methods can be used for effective data and game-environment or conditions representation through sound, including earcons and auditory icons. In this work we take advantage of earcons fundamental characteristics, such as spatialization usually employed for concurrent/parallel reproduction, in order to implement a tic-tac-toe audio game prototype. The proposed sonic design is transparently integrated with a novel user control/interaction mechanism that can be easily implemented in state-of-the-art mobile devices incorporating movement sensors (ie accelerometers and gyroscope). The overall prototype design efficiency is assessed in terms of the employed sonification accuracy, while the playability achieved through the …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating Auditory Human-Machine Interaction: Analysis and Classification of Sounds Commonly Used by Consumer Devices",
            "Publication year": 2013,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=134&papernum=8812",
            "Abstract": "Many common consumer devices use a short sound indication for declaring various modes of their functionality, such as the start and the end of their operation. This is likely to result in an intuitive auditory human-machine interaction, imputing a semantic content to the sounds used. In this paper we investigate sound patterns mapped to\" Start\" and\" End\" of operation manifestations and explore the possibility such semantics’ perception to be based either on users’ prior auditory training or on sound patterns that naturally convey appropriate information. To this aim, listening and machine learning tests were conducted. The obtained results indicate a strong relation between acoustic cues and semantics along with no need of prior knowledge for message conveyance.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:70eg2SAEIzsC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "AES WHITE PAPER",
            "Publication year": 2009,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=14839",
            "Abstract": "Analog audio needs a separate physical circuit for each channel. Each microphone in a studio or on a stage, for example, must have its own circuit back to the mixer. Routing of the signals is inflexible. Digital audio is frequently wired in a similar way to analog. Although several channels can share a single physical circuit (eg, up to 64 with AES10), thus reducing the number of cores needed in a cable. Routing of signals is still inflexible and any change to the equipment in a location is liable to require new cabling. Networks allow much more flexibility. Any piece of equipment plugged into the network is able to communicate with any other. However, installers of audio networks need to be aware of a number of issues that affect audio signals but are not important for data networks and are not addressed by current IT networking technologies such as IP. This white paper examines these issues and provides guidance to …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Delivering High-quality Audio over Wireless LANs",
            "Publication year": 2004,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=12623",
            "Abstract": "Based on the current version of the forthcoming IEEE802. 11e standard, the paper examines the wireless, real-time transmission of high-quality audio streams. The required procedures that provide the necessary Quality of Service (QoS) support are presented and optimized for digital audio applications, and their effect on the achieved playback quality is estimated through a sequence of tests, in terms of the achieved wireless bit rate and the end-to-end packet delay. Both two-channel and multi-channel audio playback setups are considered, in order to accurately simulate typical stereo and home theater wireless applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:dhFuZR0502QC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Method and system for a quality of service mechanism for a wireless network",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060045051A1/en",
            "Abstract": "A quality of service mechanism for a wireless network includes reserving time for contention-based transmissions of station devices under a polling-based channel access function in an access point. Also included is deriving a scheduled polling service under access rules of the polling-based channel access function, wherein admission capability and bandwidth management of the wireless network are enhanced.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Tool for Simulating IEEE 802.11 E Contention-based Access",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/6612473/EDCASimulatorPaper_Final.pdf",
            "Abstract": "In this paper, a simulation tool is presented, suitable for evaluating the performance of the 802.11 e contention-based access. 802.11 e is a very recent amendment to the IEEE 802.11 standard, describing the MAC layer enhancements required for Quality of Service (QoS) provision. Aim of the developed simulator is to provide an accurate and efficient tool for evaluating significant parameters of the 802.11 e protocol, mainly in terms of traffic differentiation for QoS support. To evaluate the accuracy and demonstrate the use of the simulation tool, a number of simulations are performed, following the basic 802.11 e interoperability test procedures.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the nature of digital audio PWM distortions",
            "Publication year": 2000,
            "Publication url": "http://www.aes.org/e-lib/browse.cfm?elib=9215",
            "Abstract": "Using a novel mathematical methodology, based on the analytic time and spectral description of the instantaneously-sampled PCM signal and the Analytic PCM-to-PWM mapper, the exact nature of the PWM-induced distortions is derived and an exact description for the generated mapping error in both time and frequency domains is presented. The effect of the input PCM signal and the conversion parameters is also assessed for several cases of PCM to PWM conversion.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Educational audio game design: sonification of the curriculum through a role-playing scenario in the audio game'Kronos'",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2636879.2636902",
            "Abstract": "Audio-Games (AGs) are electronic games that feature partially or completely auditory interfaces to express the game's plot and mechanics. The required concentration on sonic information makes AGs a suitable medium not only for entertainment, but also for education on (and not limited to) music and sound studies curricula. This paper presents a novel educational AG entitled Kronos that implements a role-playing scenario to facilitate the sonification of the relevant curriculum and to create an educational platform that combines an audio-based gaming environment with a musical instrument. In that process a methodology suggested by the authors has been used. The sonic symbols assigned to create the game's narrative content will be explained and future developments will be mentioned.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Affective Audio Synthesis for Sound Experience Enhancement",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/affective-audio-synthesis-for-sound-experience-enhancement/135126",
            "Abstract": "With the advances of technology, multimedia tend to be a recurring and prominent component in almost all forms of communication. Although their content spans in various categories, there are two protuberant channels that are used for information conveyance, ie audio and visual. The former can transfer numerous content, ranging from low-level characteristics (eg spatial location of source and type of sound producing mechanism) to high and contextual (eg emotion). Additionally, recent results of published works depict the possibility for automated synthesis of sounds, eg music and sound events. Based on the above, in this chapter the authors propose the integration of emotion recognition from sound with automated synthesis techniques. Such a task will enhance, on one hand, the process of computer driven creation of sound content by adding an anthropocentric factor (ie emotion) and, on the other, the …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Binaural Rendering for Enhanced 3D Audio Perception",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.89.9421&rep=rep1&type=pdf#page=123",
            "Abstract": "Despite the recent advantages on multichannel audio coding and playback technologies, 3D audio positioning is frequently required to be performed over legacy stereo loudspeaker setups, due to certain application limitations and restrictions mainly presented in portable and low cost systems. In this work, a 3D audio platform is introduced which allows the real-time conversion of any stereo audio signal to a high-quality immersive audio stream using binaural technology. Due to a number of advanced binaural processing algorithms and features, the proposed conversion platform demonstrates perceptually improved 3D audio spatialization, rendering it suitable for implementing high-quality immersive audio applications.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "METHOD AND SYSTEM FOR A QUALITY OF SERVICE MECHANISM FOR A WIRELESS NETWORK",
            "Publication year": 2006,
            "Publication url": "https://patents.google.com/patent/US20060045050A1/en",
            "Abstract": "A quality of service mechanism for a wireless network includes providing an admission control policy for a quality of service access point (QAP) to manage bandwidth by accepting or denying service to admitted traffic streams of quality of service stations (QSTAs) Further included is renegotiating different access category parameters in the QAP for enhancing performance in the wireless network. An additional aspect also includes monitoring in the QSTAs for enhanced networking to determine whether bandwidth allocation to a specific access category meets QoS requirements under time-varying network conditions and renegotiating admitted access category bandwidth if necessary.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bridging Audio and Augmented Reality towards a New Generation of Serious Audio-Only Games.",
            "Publication year": 2019,
            "Publication url": "https://eric.ed.gov/?id=EJ1223618",
            "Abstract": "Educational practices are constantly adjusting to technological advances, in order to improve their effectiveness in delivering knowledge and preparing students for the challenges of modern digital society. Electronic games and augmented reality environments are two such media that can shape powerful modes of interactive and immersive experiences. Audio games in particular, ie electronic games that utilise data sonification and audio interaction techniques to express all narrative and gameplay content, have been proven to enhance players’ skills, such as concentration, memory, fantasy, emotional response, perception, data management and cooperation. However, despite the promising research findings reported in literature, there has been no systematic approach in integrating systems based on audio interaction into formal education. This article suggests that audio games can be designed and implemented for the delivery of targeted curricula through an engaging learning experience, whereas fusing audio game mechanics into new interactive technologies, such as augmented reality environments, will further enhance the students’ immersiveness in the learning process. Towards establishing the theoretical framework for the design of educational audio games, as well as educational augmented reality audio games, the authors review existing approaches and argue that the inherent features of both audio interaction and augmented reality systems agree with the official educational goals formulated by the Greek Ministry of Education and the International Baccalaureate Institution. Then, they discuss four original projects in terms of …",
            "Abstract entirety": 0,
            "Author pub id": "mb7ezlMAAAAJ:08ZZubdj9fEC",
            "Publisher": "Academic Conferences Limited. Curtis Farm, Kidmore End, Nr Reading, RG4 9AY, UK"
        },
        {
            "Title": "Swarm lake: a game of swarm intelligence, human interaction and collaborative music composition",
            "Publication year": 2014,
            "Publication url": "https://trepo.tuni.fi/handle/10024/129006",
            "Abstract": "In this work we aim to combine a game platform with the concept of collaborative music synthesis. We use bioinspired intelligence for developing a world-the Lakewhere multiple tribes of artificial, autonomous agents live within, having survival as their ultimate goal. The tribes exhibit primitive social swarm-based behavior and intelligence, which is used for taking actions that will potentially allow to dominate the game world. Tribes’ populations also demonstrate a number of physical properties that restrict their ability to act illimitably. Multiuser intervention is employed in parallel, affecting the automated decisions and the physical parameters of the tribes, thus infusing the gaming orientation of the application context. Finally, sound synthesis is achieved through a complex mapping scheme established between the events occurring in the Lake and the rhythmic, harmonic and dynamic-range parameters of an advanced, collaborative sound composition engine. This complex mapping scheme allows the production of interesting and complicated sonic patterns that follow the performance evolution in both objective and conceptual levels. The overall synthesis process is controlled by the conductor, a virtual entity that determines the synthesis evolution in a way that is very similar to directing an ensemble performance in real world.",
            "Abstract entirety": 1,
            "Author pub id": "mb7ezlMAAAAJ:pyW8ca7W8N0C",
            "Publisher": "INTERNATIONAL COMPUTER MUSIC ASSOCIATION"
        }
    ]
}]