[{
    "name": "Ανδρέας Λανίτης",
    "romanize name": "Andreas Lanitis",
    "School-Department": " Multimedia and Graphic Arts",
    "University": "Cyprus University of Technology",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 8086,
    "Scholar name": "Andreas Lanitis",
    "Scholar id": "LV7ud3IAAAAJ",
    "Affiliation": "Cyprus University of Technology",
    "Citedby": 6363,
    "Interests": [
        "Digital Image Processing and Computer Vision"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=LV7ud3IAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Visualizing the 3D structure of medical objects based on 2D data",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5394337/",
            "Abstract": "3D imaging allows the detailed visualization of medical structures that can be very important in the process of treating patients. In this paper we describe a method for generating 3D models representing medical structures, using data derived from a single image showing a single cross-section of an object. The proposed method utilizes a 3D deformable model that is allowed to deform in order to approximate the shape of a medical structure as seen in a single cross-section, allowing in this way the estimation of the complete 3D structure of the object. Experimental results using synthetic data prove the potential of this approach in generating 3D pelvis models.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Hands-Free Non-Invasive Human Computer Interaction System",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-5263-4_38",
            "Abstract": "Conventional Human Computer Interaction requires the use of hands for moving the mouse and pressing keys on the keyboard. As a result paraplegics are not able to use computer systems unless they acquire special Human Computer Interaction equipment. In this paper we describe a system that aims to provide paraplegics the opportunity to use computer systems without the need for additional invasive hardware. Our system uses a standard web camera for capturing face images showing the user of the computer. Image processing techniques are used for tracking head movements, making it possible to use head motion in order to interact with a computer. The performance of the proposed system was evaluated using a number of specially designed test applications. According to the quantitative results, it is possible to perform most HCI tasks with the same ease and accuracy as in the case that a touch …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "A contact-less interactive tool for exploring archaeological data",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/278",
            "Abstract": "We describe a contact-less system that allows interactive information retrieval and exploration. In particular we focus our attention on the development of a contact-less interactive system that can be used for the exploration and visualization of artefacts with archeological interest, using a GIS-based system. The basis of our approach is a tracking algorithm that is able to track head movements of the user. Based on head motion it is possible to move a cursor and select different options, in order to enable data exploration and presentation. The work for this project is in progress. We are currently in the process of implementing an information retrieval system that allows users to retrieve and view information related to Cypriot archaeological artefacts. Although the primary scope of our work is to develop a system that can be used in museums, it is possible to use such systems in other environments such as airports, information kiosks and for general internet browsing. The only extra requirement for using our system is a standard web camera used for capturing images of the user. When compared with other systems currently is use in similar applications (i.e. systems using touch screens), the proposed system offers similar functionality at significantly reduced cost. The results of a preliminary experimental investigation, demonstrate the potential of using the proposed system in applications involving the dissemination of cultural heritage related information.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using virtual reality to train designers to develop friendly interfaces for achromatic vision patients",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3030024.3038270",
            "Abstract": "An investigation in the use of Virtual Reality as a means of training designers to design interfaces accessible to achromatic vision patients is presented. Within this context virtual environments incorporating real life environments are visualised through the eyes of achromatic vision patients and designers are given the opportunity to navigate and interact with the virtual environment using different types of interaction schemes. Through the process designers assess the applicability of different interaction methods adjusted to the needs of achromatic vision patients. According to the results of an experimental investigation, the idea of using Virtual Reality-based training is deemed effective.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A 3D virtual environment for training teachers to identify bullying",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495417/",
            "Abstract": "Incidents involving bullying in schools present a difficult challenge for educators who need to identify potentially dangerous behaviors in comparison to `innocent' types of inter-student interactions. In this paper we investigate the use of a dedicated Virtual Reality application as a means of training educators to identify alarming bullying activities. The Virtual Reality environment simulates a typical middle school, where different bullying-related incidents take place. The virtual environment is visualized using a Virtual Reality headset in conjunction with eye tracking techniques that facilitate user interaction. In order to make realistic animations that resemble human motions, state of the art motion tracking equipment was used for generating realistic avatar movements. According to the scenario of the application, the user witness different types of student behavior and he/she has to take decisions on how to control and …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A semiotic-pedagogic framework for the design of a virtual museum of Byzantine art",
            "Publication year": 2012,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3342",
            "Abstract": "This paper presents the semiotic-pedagogic framework which assists the design of a virtual museum of Byzantine art. The proposal explains how the framework helps the design process by clarifying issues around the multifaceted problems concerning the knowledge required to use technology for educational purposes and the interpretation of signs and sign processes. The framework takes into consideration the affinity of important principles from cultural semiotics and semiotic aesthetic theories with Vygotsky’s “signs” and “tools” and the symbolic function of Byzantine art.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:M05iB0D1s5AC",
            "Publisher": "IDE Europe"
        },
        {
            "Title": "Computer-Based Age Progression Methodologies",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780815515845500077",
            "Abstract": "Age progression is a process, where the future facial appearance of a subject is predicted. Artists who use a photograph of a subject as the input, and modify certain features to generate a picture of an age-progressed face, do age progression. The process of generating age-progressed images relies on observations pertaining to standard age related deformations of facial features coupled with hereditary traits as observed from pictures showing close relatives of the subject in the target age. Due to certain factors outlined in this chapter, the generation of age-progressed images is restricted only for use in special cases, such as the generation of age portraits of missing children and the generation of images showing the current facial appearance of wanted criminals. The chapter reviews all the technologies used in age progression. Automatic age progression systems could figure in numerous …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:hFOr9nPyWt4C",
            "Publisher": "William Andrew Publishing"
        },
        {
            "Title": "On the Application of Biometric Techniques for Locating Damaged Artworks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13386-7_20",
            "Abstract": "The continuously increasing art market activity and international art transactions lead the market for stolen and fraudulent art to extreme levels. According to US officials, art crime is the third-highest grossing criminal enterprise worldwide. As a result, art forensics is a rising research field dealing with the identification of stolen or looted art and their collection and repatriation. Photographs of artwork provide, in several cases, the only way to locate stolen and looted items. However, it is quite common these items to be damaged as a result of excavation and illegal movement. Digital processing of photographs of damaged artwork is therefore of high importance in art forensics. This processing emphasizes on “object restoration” and although techniques from the field of image restoration can be applied it is of high importance to take into account the semantics of the artwork scene and especially the structure of …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "forthcoming:“The Use of Information Technology Applications for Supporting the Study and Interpretation of Terracotta Figurines from the House of Orpheus in Nea Paphos”",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digitization, restoration and visualization of terracotta figurines from the ‘House of Orpheus’, Nea Paphos, Cyprus",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34234-9_56",
            "Abstract": "The terracotta figurines from the so-called ‘House of Orpheus’ in Nea Paphos,Cyprus, and in particular the terracotta figurines excavated between 1982-1992, form part of a significant material assemblage that spans in time from Hellenistic to Roman times. These high quality terracotta figurines fall within the mainstream of Cypriot art and its associated ancient technological and cultural systems. The research project presented here, aims at a systematic assessment of this assemblage employing stylistic, analytical, computational and theoretical methods of study. Emphasis is given to the digitization process that involves 3D scanning of items of interest; and the subsequent processing that aims to reconstruct and visualize specific fragmented specimens in their anticipated full shape and colour. Also presented are our plans for developing interactive applications that utilize 3D models of the specimens.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Visual lifelogs retrieval: state of the art and future challenges",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8864803/",
            "Abstract": "The use of wearable cameras covers several areas of application nowadays, where the need for developing smart applications providing the sustainability and well-being of citizens it is more necessary than ever before. The tremendous amount of lifelogging data to extract valuable knowledge about the every day life of the wearers requires state of the art retrieval techniques to efficiently store, access, search and retrieve useful information. Several works have been proposed combining computer vision and machine learning techniques to analyze the content of the data captured from visual wearable devices on a daily basis. This paper presents an overview of the progress in visual lifelogging retrieval and indicates the current advances and future challenges, highlighting the prospects of incorporating visual lifelogging retrieval in social computing applications.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Quantification of Aging Effects on Biometric Features",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_47",
            "Abstract": "Biometric templates are often used in intelligent human computer interaction systems that include automated access control and personalization of user interaction. The effectiveness of biometric systems is directly linked with aging that causes modifications on biometric features. For example the long term performance of person identification systems decreases as biometric templates derived from aged subjects may display substantial differences when compared to reference templates whereas in age estimation, aging variation allows the age of a subject to be estimated. In this paper we attempt to quantify the effects of aging for different biometric modalities facilitating in that way the design of systems that use biometric features. In this context the homogeneity of statistical distributions of biometric features belonging to certain age classes is quantified enabling in that way the definition of age sensitive and …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the significance of different facial parts for automatic age estimation",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028265/",
            "Abstract": "In this paper we describe an experimental investigation into the significance of different facial parts in the task of age estimation. For this purpose we use an automatic age estimation algorithm capable of producing an estimate of the age of a subject based on his/her face image. We perform automatic age estimation experiments using different facial parts of varying resolution so that the significance of facial parts in this application can be assessed. According to the results obtained, the internal part of the face and in particular the area around the eyes proved to be the most significant for the task of automatic age estimation.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the development and evaluation of a serious game for forensic examination training",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495415/",
            "Abstract": "Training for forensic investigations is an important aspect of the overall training procedure in Police Academies around the world. However, the overall complexity of forensic examinations and the sensitive nature of data available in crime scenes limit the possibility of exposing police cadets in different types of real crime scenes. In this paper the plausibility of using dedicated computer games and Virtual Environments for forensic examination training is investigated in order to support the development of computer-based systems for training cadets to perform forensic examinations. This effort, that was carried out in cooperation with the local Police Authorities, involved the collection of information of procedures adopted during forensic investigations, the design and implementation of a computer game to support relevant educational activities and the evaluation phase where the end product was thoroughly evaluated …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating the performance of 3D face reconstruction algorithms",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3775",
            "Abstract": "The use of 3D data in face image processing applications received increased attention during the recent years. However, the development of efficient 3D face processing applications (i.e face recognition) relies on the availability of appropriate 3D scanning technology that enables real time, accurate, non-invasive and low cost 3D data acquisition. 3D scanners currently available do not fulfill the necessary criteria. As an alternative to using 3D scanners, 3D face reconstruction techniques, capable of generating a 3D face from a single or multiple face images, can be used. Although numerous 3D reconstruction techniques were reported in the literature so far the performance of such algorithms was not evaluated in a systematic approach. In this paper we describe a 3D face reconstruction performance evaluation framework that can be used for assessing the performance of 3D face reconstruction techniques. This approach is based on the projection of a set of existing 3D faces into 2D using different orientation parameters, and the subsequent reconstruction of those faces. The comparison of the actual and reconstructed faces enables the definition of the reconstruction accuracy and the investigation of the sensitivity of an algorithm to different conditions. The use of the proposed framework is demonstrated in evaluating the performance of two 3D reconstruction techniques. Springer ScienceBusiness Media B.V. 2010.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessing facial age similarity: a framework for evaluating the robustness of different feature sets",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7029431/",
            "Abstract": "A framework that can be used for assessing the suitability of different feature vectors in the task of determining the age similarity between a pair of faces is introduced. This framework involves the use of a dataset containing images displaying compounded types of variation along with the use of an ideal dataset, containing pairs of age-separated face images captured under identical imaging conditions. The use of the ideal dataset in conjunction with deliberate introduction of controlled noise, allows the extraction of conclusions related to the robustness of different feature vectors to different types of noise effects. The ultimate aim of this work is the derivation of comprehensive and accurate set of metrics for evaluating the performance of age progression algorithms in order to support comparative age progression evaluations.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assessing the emotional impact of virtual reality-based teacher training",
            "Publication year": 2019,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/IJILT-11-2018-0127/full/html",
            "Abstract": "The purpose of this paper is to propose the use of a virtual reality (VR)-based approach to improve teacher education and life-long professional development. Through constant training in real-life based situations but within a safe three-dimensional virtual school environment, teachers are given the opportunity to experience and learn how to react to different types of incidents that may take place in a school environment.The current paper presents the design cycle that was followed for the implementation of the VR teacher training system. The effectiveness of the proposed approach is demonstrated with a case study that aimed to promote teachers’ understanding of student’s problematic situations related to substance use. As part of the experimental investigation, the impact of the VR system on participants’ emotions and mood states is evaluated through …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Emerald Publishing Limited"
        },
        {
            "Title": "Computer Analysis of Images and Patterns: 19th International Conference, CAIP 2021, Virtual Event, September 28–30, 2021, Proceedings, Part I",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=uXdLEAAAQBAJ&oi=fnd&pg=PR5&dq=info:k1fp_mOYwN4J:scholar.google.com&ots=C3r8DiL99f&sig=jz43zEiNiRCxDIGi5mi0kOsobHE",
            "Abstract": "The two volume set LNCS 13052 and 13053 constitutes the refereed proceedings of the 19th International Conference on Computer Analysis of Images and Patterns, CAIP 2021, held virtually, in September 2021. The 87 papers presented were carefully reviewed and selected from 129 submissions. The papers are organized in the following topical sections across the 2 volumes: 3D vision, biomedical image and pattern analysis; machine learning; feature extractions; object recognition; face and gesture, guess the age contest, biometrics, cryptography and security; and segmentation and image restoration.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Assessing the Willingness of Elder Users in Using Virtual and Augmented Reality Technologies",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:4MWp96NkSFoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Product packaging evaluation through the eyes of elderly people: personas vs. aging suit vs. virtual reality aging simulation",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-02053-8_86",
            "Abstract": "In the content of Universal Design, various methods and techniques are used to allow designers to step into elderly users’ shoes to understand their specific characteristics and needs and design elderly-friendly products. Examples include the use of personas, aging suits and virtual reality aging simulation. However, there is no comparison that documents the advantages and disadvantages of each method. In the present study, the use of personas, aging suit and a virtual reality-based approach are compared in the evaluation stage of a product design process. According to the results, both the aging suit and the virtual reality aging simulation have important advantages compared to personas in terms of effectiveness. Virtual reality is advantageous in terms of helpfulness and embodiment of the designer, while aging suit precedes in terms of easiness to use.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "FG2015 age progression evaluation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7163157/",
            "Abstract": "The topic of face-aging received increased attention by the computer vision community during the recent years. This interest is motivated by important real life applications where accurate age progression algorithms can be used. However, age progression methodologies may only be used in real applications provided that they have the ability to produce accurate age progressed images. Therefore it is of utmost importance to encourage the development of accurate age progression algorithms through the formulation of performance evaluation protocols that can be used for obtaining accurate performance evaluation results for different algorithms reported in the literature. In this paper we describe the organization of the, first ever, pilot independent age progression competition that aims to provide the basis of a robust framework for assessing age progression methodologies. The evaluation carried out involves the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Detection of Images Containing Child-Pornographic Material",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7998260/",
            "Abstract": "The vast increase in the use of social networks and other internet-based communication tools contributed to the escalation of the problem of exchanging child pornographic material over the internet. The problem of dissemination of child pornographic material could be addressed using dedicated image detection algorithms capable of rating the inappropriateness level of images exchanged through computer networks so that images with inappropriate content involving children are blocked. However, the complexity of the image detection task coupled with the nonexistence of suitable datasets, inhibit the development of efficient algorithms that can be used for detecting offensive images containing children. To deal with the problem, we propose a methodological approach that can be used for supporting the development of child pornography detectors through the generation of synthetic datasets and through the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Person identification from heavily occluded face images",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.967905",
            "Abstract": "In numerous occasions there is need to identify subjects shown in heavily occluded face images. Typical examples include the recognition of criminals whose facial images are captured by surveillance cameras. In such cases a significant part of the subjects face is occluded making the process of identification extremely difficult, both for automatic face recognition systems and human observers. In this paper we propose a face recognition algorithm, which can be used for identifying individuals with hidden facial parts. During the face recognition procedure, occluded facial regions are detected so that the model-based face recognition algorithm implemented makes use of information only from the non-occluded facial regions. With our approach information from occluded facial regions is not utilized during the process of face recognition hence the occlusions do not destruct the recognition process and as a result the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A VIRTUAL REALITY ENVIRONMENT SIMULATING DRUG USE IN SCHOOLS: EFFECT ON EMOTIONS AND MOOD STATES",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest Editorial: Selected Papers from the International Workshop on Biometrics and Forensics (IWBF2016)",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A Semi-Automated Quality Assurance Toolbox for Diagnostic Radiological Imaging.",
            "Publication year": 2006,
            "Publication url": "https://www.scitepress.org/papers/2006/24458/24458.pdf",
            "Abstract": "Magnetic Resonance (MRI), Computed Tomography (CT) and Ultrasound (US) are three of the most commonly used clinical imaging modalities. The aim of this study was to establish a Quality Assurance program for MRI, CT and US scanners. A well-designed quality assurance program is of utmost importance in the clinical setting, because it indicates whether diagnostic imaging modalities meet the minimum criteria of acceptable performance and because it helps determine those scanner parameters that need adjustment in order to ensure optimum performance. Quality assurance programs that rely on manual data collection and analysis are tedious and time consuming and are often abandoned due to the significant workload required for their implementation. In this paper we describe an integrated software system for automating the process of data collection and management in Quality Assurance for diagnostic radiological imaging. The developed system is comprised of two main units: The Image Processing Unit (IPU) and the Data Management Unit (DMU). The IPU is used for analysing images from different diagnostic modalities in order to extract measurements. The IPU is dynamically linked to the DMU so that measurements are transferred directly to the DMU. This process allows the generation of quality assurance reports for all such modalities.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formulating design guidelines for cultural heritage multimedia systems with Byzantine art content",
            "Publication year": 2011,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/5196",
            "Abstract": "The development of future multimedia systems for the presentation and preservation of Byzantine art necessitates the formulation of special design guidelines, which brings Byzantine art and new technologies in a constructive technocultural symbiosis. The e-learning and pedagogical effectiveness of multimedia projects with Byzantine art content, the visualisation of Byzantine imagery, the deeper and devoted research in issues like the aesthetics of Byzantine art, the spiritual communication of Byzantine art promote the need of a technocultural approach synthesized by two distinct elements, multimedia and Byzantine art. With a proposed evaluation experiment for a website with a Byzantine theme, we investigate the reactions and perceptions of young people for Byzantine art, in order to create design guidelines applied on future projects with relevant content. The results of this survey evaluation study, targeting a group of Cypriot young people 15-30 age, superimpose the argument that multimedia e-learning projects specialising in Byzantine art, should promote design strategies that will enchase the communication of Byzantine art in new media.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Isolating stock prices variation with neural networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03969-0_37",
            "Abstract": "In this study we aim to define a mapping function that relates the general index value among a set of shares to the prices of individual shares. In more general terms this is problem of defining the relationship between multivariate data distributions and a specific source of variation within these distributions where the source of variation in question represents a quantity of interest related to a particular problem domain. In this respect we aim to learn a complex mapping function that can be used for mapping different values of the quantity of interest to typical novel samples of the distribution. In our investigation we compare the performance of standard neural network based methods like Multilayer Perceptrons (MLPs) and Radial Basis Functions (RBFs) as well as Mixture Density Networks (MDNs) and a latent variable method, the General Topographic Mapping (GTM). According to the results, MLPs and RBFs …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automatic Age Progression: Methodologies and Performance Evaluation",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/811",
            "Abstract": "Age progression is the process of predicting the future facial appearance of faces appearing in images. The ability to produce accurate age progressed faces is important in a number of key applications including the identification of missing persons, development of age-invariant face recognition systems and automatic update of photographs in smart documents. Automatic age-progression is a challenging task, mainly due to the diversity of aging variation and the dependence of the aging process on external factors that include health conditions and hereditary trends. Recently an escalated research interest in the area is recorded and as a result a number of face aging algorithms were reported in the literature. In this paper we present key techniques reported in the literature with emphasis on techniques developed by the author. In particular we present a face-aging algorithm based on the definition of aging trajectories (the so called aging functions) and algorithms based on modelling the distributions of faces belonging to different subjects and different age groups. Special emphasis is given to the topic of performance evaluation of age progression methodologies based on dedicated metrics. Work in this area is considered an important research direction in the field, since it will enable the evolution of the most promising age progression methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Review of ageing with respect to biometrics and diverse modalities",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=12938891749228452359&hl=en&oi=scholarr",
            "Abstract": "Biometric systems are related to the extraction and analysis of personal characteristics in an attempt to derive information and/or interpret human actions. Biometric systems aim to extract information about attributes such as identity, emotional state and age or to interpret human actions such as speech, handwritten text and behaviour.The endless possibilities in embedding biometric modules in existing systems along with the great potential of developing contemporary applications involving biometric units have caused a dramatic rise in the market share of biometric systems. At the same time, the general topic of biometrics has attracted a considerable amount of interest by researchers who aim to develop new methods for extending the effectiveness, accuracy and scope of application of biometric systems. Among different possible applications of biometric systems the problem of secure access is regarded as a major problem and as a result on many occasions biometric systems are associated with identity recognition and/or verification. Indeed the increased need for fast, secure and automatic access to real and electronic sites has prompted the development of biometric systems that can replace traditional identity verification methods. The major difficulty in developing biometric systems is the variability encountered in biometric traits that causes variation in biometric features belonging to the same class, a situation known as intra-class variation. A successful biometric system should be able to isolate and use the right type of variability for a particular application while other types of variation, which impede the process of correct interpretation …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IET"
        },
        {
            "Title": "Towards non-invasive patient monitoring through iris tracking and pain detection",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_71",
            "Abstract": "Patient monitoring is an important operation taking place in hospitals. It usually involves the use of dedicated invasive equipment that requires the co-operation of patients and also involves remarkable purchase and maintenance costs. In this paper we describe a feasibility study of using image analysis techniques for implementing a low-cost non-invasive patient monitoring system based on iris tracking and pain detection in image sequences captured with ordinary video cameras. Within this context iris tracking can be used for activity monitoring and also as a means for communication in cases where body movement is disabled. Automatic pain detection can be used for detecting increasing pain levels and automatically request help for the patient. As part of our preliminary investigation pain detection is achieved based on a number of texture features extracted from the shape-normalized facial regions in …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Automatic Landmark Location for Analysis of Cardiac MRI Images",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32909-8_21",
            "Abstract": "This paper addresses the problem of automatic location of landmarks used for the analysis of MRI cardiac images. Typically the landmarks of shapes in MRI images are located manually which is a time consuming process requiring human expertise and attention to detail. As an alternative a number of researchers use shape modelling and image search techniques for locating the required landmarks automatically. Usually these techniques require human expertise for initializing the search and in addition they require high quality, noise free images so that the image-based landmark location is successful. With our work we propose the use of neural network methods for learning the geometry of sets of points so that it is possible to predict the positions of all required landmarks based on the positions of a small subset of the landmarks rather than using image-data during the process of landmark-location. As …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:BqipwSGYUEgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Evaluating the Performance of 3D Face Reconstruction Algorithms",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-90-481-3658-2_27",
            "Abstract": "The use of 3D data in face image processing applications received increased attention during the recent years. However, the development of efficient 3D face processing applications (i.e face recognition) relies on the availability of appropriate 3D scanning technology that enables real time, accurate, non-invasive and low cost 3D data acquisition. 3D scanners currently available do not fulfill the necessary criteria. As an alternative to using 3D scanners, 3D face reconstruction techniques, capable of generating a 3D face from a single or multiple face images, can be used. Although numerous 3D reconstruction techniques were reported in the literature so far the performance of such algorithms was not evaluated in a systematic approach. In this paper we describe a 3D face reconstruction performance evaluation framework that can be used for assessing the performance of 3D face reconstruction techniques …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Fg-net aging data base",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=8441441872998186785&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Paintings alive: A virtual reality-based approach for enhancing the user experience of art gallery visitors",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48974-2_27",
            "Abstract": "Visits to art museums are not appealing to a wide sector of the public, limiting in that way the exposure of art works to the wider community and especially the younger generation. In this paper we investigate the use of Virtual Reality (VR) for displaying animated artworks as a means for creating an enhanced user experience that could make visits to art-galleries more appealing. A key point of the proposed technique is the analysis of the art-works that enables the determination of a most appropriate setting and animation that best promotes the original message of the painter. The promise of this approach has been validated through an experimental user evaluation where users clearly indicated the benefits of using interactive virtual environments for presenting animated art paintings.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Student Action Recognition as a Means of Supporting Remote Learning",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual reality-based simulation of age-related visual deficiencies: Implementation and evaluation in the design process",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-25629-6_41",
            "Abstract": "Age-related changes significantly affect elderly users’ interaction with specific products and services. Nevertheless, the challenges experienced by elderly users are difficult to be perceived and understood, especially by younger people. Inspired by the concept of aging suits, we propose a Virtual Reality-based approach, where age-related visual impairments are simulated in virtual environments. The aim is to provide an approximation of the experience of viewing and interacting with a product, from the perspective of elderly persons with specific age-related visual problems. The effectiveness of the proposed approach is examined through an experiment involving package design evaluation. The experimental results demonstrate that Virtual Reality can play an important role on understanding the challenges that elderly users face, thus support the design of elderly-friendly products.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:fEOibwPWpKIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Virtual restoration of faces appearing in byzantine icons",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1296207412000027",
            "Abstract": "Virtual restoration of cultural heritage (CH) artefacts is an important task that aims to digitally recreate the original appearance of damaged items. In this paper, a method that can be used for virtual restoration of faces appearing in damaged Byzantine icons is presented. Given a damaged face, the complete three-dimensional (3D) geometry of the face is reconstructed using data from the non-damaged facial parts and the texture of the damaged areas is restored. A key aspect of the proposed method is the use of a customized 3D deformable face model suitable for representing the geometry of Byzantine faces, the so-called Byzantine Style Specific Model (BSSM). A BSSM is generated by enforcing rule-based constraints on a deformable model trained using 3D scans of human faces. The use of a BSSM ensures that the Byzantine style is preserved during the process of shape restoration.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:k_IJM867U9cC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Comparative evaluation of automatic age-progression methodologies",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/242",
            "Abstract": "Automatic age-progression is the process of modifying an image showing the face of a person in order to predict his/her future facial appearance. In this paper, we compare the performance of two age-progression methodologies reported in the literature against two novel approaches to the problem. In particular, we compare the performance of a method based on age prototypes, a method based on aging functions defined in a low-dimensional parametric model space, and two methods based on the distributions of samples belonging to different individuals and different age groups. Quantitative comparative results reported in the paper are based on dedicated performance evaluation metrics that assess the ability of each method to produce accurate predictions of the future/previous facial appearance of subjects. The framework proposed in this paper promotes the idea of a standardized performance evaluation protocol for age-progression methodologies, using images from a publicly available image database.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Non-Invasive Hands Free Computing: A Myth or a Reality?",
            "Publication year": 2004,
            "Publication url": "http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=10122591&AN=40923670&h=Nl2%2BSRRAUq2AI0uEkiFEbc8PNpQlTiIz9QrQvcfLRaHoF%2FkZnbnXABtk%2FR5CCIDsU4ffgaRCotgsUTHqRK%2BQuQ%3D%3D&crl=c",
            "Abstract": "The enormous increase in the use of personal computers in work-related applications, educational applications and pleasure has stressed the importance of enabling all members of a society to use computer systems. However, traditional human computer interaction systems mainly rely on the use of hands, making computers inaccessible to paraplegics. In this paper we present a system that can be used for hands-free computing in an attempt to enable hand mobility impaired persons to use a computer. Our system uses a standard web camera in order to capture face images showing the user of the computer. Image processing techniques are used for tracking head movements of the user, making it possible to use head motion in order to move the cursor, perform mouse-click actions and even type text. A number of paraplegics and non-paraplegics who tested our system pointed out the potential of our system in …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmented Reality Cultural Route at the Xeros River Valley, Larnaca, Cyprus",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-73043-7_61.pdf",
            "Abstract": "Landscape studies have evolved into a significant branch of historical archaeological research, by placing emphasis on the ecological, economic, political and cultural values of pre-modern settled and sacred landscapes. The aim of our work is to support the systematic exploration of landscape archaeology in the Xeros River valley in Cyprus, through time, from prehistory to today, through the design and development of an Augmented Reality (AR) application. The AR application supports the exploration of pre-modern monuments and archaeological sites in the Xeros River valley, serving as a guided tour for visitors of the area. By employing image recognition and utilizing a location-based practice, the application provides the users with an immersive and educational experience. Initial reactions by experts in landscape studies indicate the potential of the application in enabling the narration and visualization of the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Cultural Semiotic Aesthetic Approach for a Virtual Heritage Project: Part B—Evaluation and Design for Virtual Heritage and Theoretical Extensions",
            "Publication year": 2018,
            "Publication url": "https://www.pdcnet.org/techne/content/techne_2018_0999_4_5_81",
            "Abstract": "Continuing from Part A (2016), in which we discuss the semiotic foundation for designing a virtual museum of Byzantine art, Part B presents an applied methodology for the representation of cultural artifacts through virtual technologies and semiotic techniques. We discuss how our semiotic model, case study semiosphere, contributes to design and evaluation research of such unique art-form representation and why the approach contributes as a whole to the field of Virtual Heritage (VH). Theorizing further the design implications integrating the overall approach including the evaluation experiment of three VH applications with the participation of young users and its semiotic analysis, we formulate design guidelines that can be applied also to other types of cultural heritage and art.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey of the effects of aging on biometric identity verification",
            "Publication year": 2010,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBM.2010.030415",
            "Abstract": "The performance of biometric authentication systems is affected by discrepancies between data stored in biometric templates and corresponding data derived from the actual owners of biometric templates. Such discrepancies are mainly attributed to within-person variations of biometric features. Among all types of within-person variations, aging-related variation displays unique characteristics that make the process of dealing with aging a challenging task. In this paper we discuss how aging affects different types of biometric features and discuss possible approaches that aim to eliminate the effects of aging so that deterioration in the long-term performance of biometric authentication systems is minimised.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Artwork Recognition Using Wearable Cameras: Methodologies, Challenges and Potential Uses",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualizing the 3D structure of medical objects based on 2D data",
            "Publication year": 2009,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/7090",
            "Abstract": "3D imaging allows the detailed visualization of medical structures that can be very important in the process of treating patients. In this paper we describe a method for generating 3D models representing medical structures, using data derived from a single image showing a single cross-section of an object. The proposed method utilizes a 3D deformable model that is allowed to deform in order to approximate the shape of a medical structure as seen in a single cross-section, allowing in this way the estimation of the complete 3D structure of the object. Experimental results using synthetic data prove the potential of this approach in generating 3D pelvis models.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing reflection and empathy skills via using a virtual reality based learning framework",
            "Publication year": 2019,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13710",
            "Abstract": "The last few years Virtual Reality (VR) based approaches have emerged as a new education paradigm. This paper addresses the possibility to cultivate reflection and empathy skills using a VR based framework targeting to maximize the professional development of teachers. Reflection and empathy are skills of paramount importance for teachers and an integral part of their professional development. The current research aims to investigate possible differences in cultivating reflection and empathy skills between participants who used a VR system and the control group who were trained in a real classroom environment. Experimental results indicate that the participants using the virtual classroom environment were able to better reflect and empathize with the students whereas participants from the control group tended to be more undecided. Moreover, the VR system gave the participants the opportunity to enter the students' virtual body and understand the different perspectives affecting at a higher level the reflection process than the control group.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Model-based generation of realistic 3D full body avatars from uncalibrated multi-view photographs",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44654-6_35",
            "Abstract": "In today’s world of rapid technological advancement, we find an increasing demand for low-cost systems that are capable of fast and easy generation of realistic avatars for use in Virtual Reality (VR) applications. For example, avatars can enhance the immersion experience of users in video games and facilitate education in virtual classrooms. Therefore, we present here a novel model-based technique that is capable of real-time generation of personalized full-body 3D avatars from orthogonal photographs. The proposed method utilizes a statistical model of human 3D shape and a multi-view statistical 2D shape model of its corresponding silhouettes. Our technique is automatic, requiring minimal user intervention, and does not need a calibrated camera. Each component of our proposed technique is extensively evaluated and validated.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Generating lifetime biometric templates: an overview of challenges, requirements and approaches",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/4057",
            "Abstract": "Generating lifetime biometric templates: an overview of challenges, requirements and \napproaches | Ktisis Cyprus University of Technology Skip navigation Ktisis Tepak Home \nCollections Research Outputs Researchers Faculty & Departments Theses Patents Projects \nJournals Conferences Explore by Research Outputs Researchers Faculty & Departments \nTheses Patents Projects Journals Conferences Language Ελληνικά English Sign on to: \nLogin Receive email updates Edit Account details 1.Ktisis Cyprus University of Technology 2.Cyprus \nUniversity of Technology (Research Output) 3.Δημοσιεύσεις σε συνέδρια /Conference \npapers or poster or presentation Please use this identifier to cite or link to this item: https://ktisis.cut.ac.cy/handle/10488/4057 \nTitle: Generating lifetime biometric templates: an overview of challenges, requirements and \napproaches Authors: Tsapatsoulis, Nicolas Lanitis, Andreas Major Field of : : : ;:…",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An integrated framework for evaluating the performance of age progression algorithms",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBM.2017.086644",
            "Abstract": "Facial age progression can play an important role in biometric authentication as it enables the long-term person identification based on age progressed facial renderings. In this paper, a systematic evaluation approach that can be used for assessing the performance of age progression algorithms is presented. The proposed method relies on the use of a dedicated dataset in conjunction with the development and use of machine-based performance evaluation metrics that allow the assessment of the intensity of aging effects added on a face along with an assessment of the identity preservation in age progressed images. The proposed performance evaluation framework can form the basis of implementing comprehensive comparative performance evaluation between different age progression methodologies, allowing in that way the evolution of the best algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "Designing and evaluating an expert system for restoring damaged byzantine icons",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-014-2149-1",
            "Abstract": "The use of image processing techniques in cultural heritage applications has been gaining increasing interest in the research community. In this paper, an integrated framework that can be used for virtual restoration of the facial region of damaged Byzantine icons is presented. A key aspect of the proposed methodology is the integration of practices adopted by expert icon restorers into a machine-based expert system that incorporates the modules of damage detection, shape and texture restoration. Damage detection is performed based on a residual-based approach, while the shape restoration method utilizes a 3D shape model generated by incorporating a set of geometrical rules defined by expert Byzantine style iconographers. Texture restoration is based on the recursive Principal Component Analysis (PCA) technique so that combinations of colors learned from a training set are applied to the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Example based 3D face reconstruction",
            "Publication year": 2007,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/723",
            "Abstract": "The use of 3D data in face image processing applications can be of utmost importance in developing truly robust face image processing systems. However, a limiting factor towards the widespread use of 3D face image processing systems is the failure of the 3D scanning technology to become small, robust and cheap. As an alternative, considerable effort has been invested in developing 3D face reconstruction methods that allow the generation of a 3D face model based on a single face image. In this paper we review example-based 3D face reconstruction methods reported in the literature, discuss the limitations of existing methods and outline future trends for further work in this area.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Potential of Using Virtual Reality for Teacher Education",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-58509-3_15",
            "Abstract": " Virtual reality technology has the potential to be used in teacher training as it can provide innovative virtual teaching environments, offering teachers the ability to gain in-training feedback and knowledge that can be transferred and applied to real-life situations. As part of an initial investigation into the applicability of using VR for teacher training, two experiments were conducted. The first experiment had to do with teachers’ understanding and detection of students’ possible disorders such as vision disorders. The second experiment had to do the ability of teachers to identify and deal with bullying-related activities among students. The results indicated that through a VR-based role-changing mechanism teachers could enter students’ position and understand their problems, while they experienced incidents that were like real-life incidents making the application a valuable training tool. The overall results of …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying Levels of Presence in a Virtual Environment Simulating Drug Use in Schools: Effect on Different Character Perspectives.",
            "Publication year": 2018,
            "Publication url": "https://diglib.eg.org/bitstream/handle/10.2312/egve20181329/163-170.pdf?sequence=1&isAllowed=n",
            "Abstract": "This paper studies the aspect of presence in a Virtual Reality (VR) environment that can be used for training purposes in the education sector and more specifically for teacher training and professional development. During the VR experience trainees had the chance to view the world from different perspectives through the eyes of different characters appearing in the scene. The experimental evaluation conducted aims to examine the effect of viewing the experience from different perspectives and viewpoints in relation to the overall user experience and the level of presence achieved. To accomplish these objectives an experiment was performed investigating presence and the correlation between presence and different viewpoints/perspectives. To measure presence a combination of methods were used including two different questionnaires, the use of an eeg device, EMOTIV EPOC+ and the analysis of heart rates …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-Modal Hands-Free Human Computer Interaction: A Prototype System.",
            "Publication year": 2006,
            "Publication url": "https://www.scitepress.org/papers/2006/24439/24439.pdf",
            "Abstract": "Conventional Human Computer Interaction requires the use of hands for moving the mouse and pressing keys on the keyboard. As a result paraplegics are not able to use computer systems unless they acquire special Human Computer Interaction (HCI) equipment. In this paper we describe a prototype system that aims to provide paraplegics the opportunity to use computer systems without the need for additional invasive hardware. The proposed system is a multi-modal system combining both visual and speech input. Visual input is provided through a standard web camera used for capturing face images showing the user of the computer. Image processing techniques are used for tracking head movements, making it possible to use head motion in order to interact with a computer. Speech input is used for activating commonly used tasks that are normally activated using the mouse or the keyboard. Speech input improves the speed and ease of executing various HCI tasks in a hands free fashion. The performance of the proposed system was evaluated using a number of specially designed test applications. According to the quantitative results, it is possible to perform most HCI tasks with the same ease and accuracy as in the case that a touch pad of a portable computer is used. Currently our system is being used by a number of paraplegics.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "One-to-many neural network mapping techniques for face image synthesis",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S095741741200440X",
            "Abstract": "This paper investigates the performance of neural network-based techniques applied to the problem of defining the relationship between a particular type of variation in face images and the multivariate data distributions of these images. In this respect the problem of defining a mapping associating a quantified facial attribute and the overall typical facial appearance is addressed. In particular the applicability of formulating a mapping function using neural network-based methods like Multilayer Perceptrons (MLPs), Radial Basis Functions (RBFs), Mixture Density Networks (MDNs) and a latent variable method, the General Topographic Mapping (GTM) is investigated. Quantitative and visual results obtained during the experimental investigation, suggest that for one-to-many problems, where the entire variance of the distribution is not required, the RBFs are the best options when compared to MLPs, MDNs and GTM …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Procedurally Generated Age-related Visual Deficits in Virtual Reality Environments",
            "Publication year": 2021,
            "Publication url": "https://diglib.eg.org/bitstream/handle/10.2312/egve20211323/019-024.pdf?sequence=1&isAllowed=y",
            "Abstract": "The simulation of visual deficits associated with aging has been the subject of numerous investigations both in real environments with the use of aging suits and in immersive environments with the use of Extended Reality experiences. However, there is a dearth of heterogeneity and randomness, which characterize the age-related conditions and are important aspects in human-like simulations. Towards this end, procedurally generated age-related deficits are simulated in Virtual Reality environments, giving the possibility to experience these deficits and their nuances in real time. Our work is drawing upon state-of-the-art featurebased approaches, such as foveated rendering and procedural noise, to provide realistic effects. A pilot assessment is conducted through a visual performance task, while eye-tracking data are recorded. The preliminary results provide a first evaluation of the simulation’s effectiveness in …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:EYYDruWGBe4C",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Quantitative evaluation of the effects of aging on biometric templates",
            "Publication year": 2011,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-cvi.2010.0197",
            "Abstract": "The long-term performance of biometric authentication systems is highly depended on the permanence of biometric features stored in biometric templates. Aging variation causes modifications on biometric features that affect the matching between stored and captured biometric templates causing in that way deterioration in the performance of biometric authentication systems. In this study the authors attempt to quantify the effects of aging for different biometric modalities, so that it is possible to draw conclusions related to the effect of aging on different types of biometric templates. In this context variations between distributions containing biometric features from different age groups are quantified, allowing in that way the definition of age-sensitive and age-invariant biometric features. An important aspect of the proposed approach is the standardised and generic nature of the approach that allows the derivation of …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A general framework for selecting biometric features for automatic user profiling",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5706843/",
            "Abstract": "In automatic user profiling a number of features related to the user of a system are extracted in an attempt to deduct key information that can be used for adapting the interface and content of computer applications. In this context the identity, emotion, age and head orientation can provide important cues that enable efficient customization of the content of an application. In order to develop automated user profiling applications facial features are often used for providing the required information related to the user. A key issue that arises is the applicability of different facial features for different user profiling tasks. In this paper we present a generalized framework that can be used for quantifying the invariance of different facial features for different classification tasks assisting in that way the implementation of efficient adaptive user profiling in computer applications. Preliminary experimental results demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Facial Age Simulation Using Age-Specific 3D Models and Recursive PCA",
            "Publication year": 2013,
            "Publication url": "https://www.scitepress.org/papers/2013/42906/42906.pdf",
            "Abstract": "Facial age simulation is a topic that has been gaining increasing interest in computer vision. In this paper, a novel age simulation method that utilizes age-specific shape and texture models is proposed. During the process of generating age-specific shape models, 3D face measurements acquired from real human faces are used in order to tune a generic 3D face shape model to represent face shapes belonging to certain age groups. A number of diagnostic studies have been conducted in order to validate the compatibility of the tuned shape models with the corresponding age groups. The shape age-simulation process utilizes agespecific shape models that incorporate age-related constraints during a 3D shape reconstruction phase. Age simulation is completed by predicting the texture at the target age based on a recursive PCA method that aims to superimpose age-related texture modifications in a way that preserves identity-related characteristics of the subject in the source image. Preliminary results indicate the potential of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building statistical appearance models using residual information",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.96.2783&rep=rep1&type=pdf",
            "Abstract": "Statistical appearance models are generated by applying statistical analysis on the color and shape variation in an ensemble of image objects belonging to the same class. Statistical appearance models have proved useful for locating, reconstructing and interpreting image objects that undergo systematic appearance variation. In this paper we demonstrate how residual information can be incorporated in the model building process in an attempt to generate models robust to local occlusions and models that can deal effectively with subtle types of variation. With our approach we first train a statistical appearance model using the standard technique and then estimate the residual obtained by reconstructing the samples from the training set. The analysis of the residual information allows us to define the areas of the object that the model fails to model correctly. Further statistical analysis is applied locally to such areas of the object. Quantitative results prove that statistical appearance models built using the proposed method are capable of reconstructing more accurately the appearance of previously unseen objects belonging to the same class.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the performance of face-aging algorithms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4813349/",
            "Abstract": "An important aspect related to the development of face-aging algorithms is the evaluation of the ability of such algorithms to produce accurate age-progressed faces. In most studies reported in the literature, the performance of face-aging systems is established based either on the judgment of human observers or by using machine-based evaluation methods. In this paper we perform an experimental evaluation that aims to assess the applicability of human-based against typical machine based performance evaluation methods. The results of our experiments indicate that machines can be more accurate in determining the performance of face-aging algorithms. Our work aims towards the development of a complete evaluation framework for age progression methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Age interval and gender prediction using PARAFAC2 applied to speech utterances",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7449694/",
            "Abstract": "Important problems in speech soft biometrics include the prediction of speaker's age or gender. Here, the aforementioned problems are addressed in the context of utterances collected during a long time period. A unified framework for age and gender prediction is proposed based on Parallel Factor Analysis 2 (PARAFAC2). PARAFAC2 is applied to a collection of three matrices, namely the speech utterance-feature matrix whose columns are the auditory cortical representations, the speaker age matrix whose columns are indicator vectors of suitable dimension, and the speaker gender matrix whose columns are proper indicator vectors associated to speaker's gender. PARAFAC2 is able to reduce the dimensionality of the auditory cortical representations by projecting these representations onto a semantic space dominated by the age and the gender concepts, yielding a sketch (i.e., a feature vector of reduced …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of virtual reality and augmented reality for teaching the lesson of geometric solids to primary school children",
            "Publication year": 2019,
            "Publication url": "http://lib.uib.kz/edulearn19/files/papers/895.pdf",
            "Abstract": "Young students often find it difficult to understand the three-dimensional structure of solids. New technologies that support three-dimensional representations, such as Virtual and Augmented Reality, can provide the basis for implementing teaching tools that will allow students to better understand topics in mathematics involving three-dimensional structures. In this paper we present the methodology used as part of an investigation that aims to evaluate the potential and compare Virtual and Augmented Reality technologies for teaching the lesson of geometric solids to primary school children. Emphasis is given on the development of dedicated tools used as part of the evaluation. Early results indicate that as far as the learning outcomes and the student satisfaction are concerned, both VR and AR technologies show similar promise.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:yB1At4FlUx8C",
            "Publisher": "IATED Academy"
        },
        {
            "Title": "A feasibility study on using virtual reality for understanding deficiencies of high school students",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495418/",
            "Abstract": "A significant number of high school students face different types of problems that prevent them from attending adequately classes. On the other hand teachers are faced with the daunting task of identifying and addressing problems faced by students. Correcting actions towards student deficiencies imply that teachers are able to fully understand the implications on student activities caused by different types of problems. In this paper we describe a feasibility study that aims to assess the potential of using Virtual Reality as a tool for training teachers to fully understand the difficulties of students suffering from different types of deficiencies. As part of the proposed work, teachers are given the opportunity to participate in a virtual class in the role of students that face certain deficiencies allowing them to experience problems faced by students so that teachers learn how to deal effectively with such cases in real classrooms …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image based 3d face reconstruction: a survey",
            "Publication year": 2009,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467809003411",
            "Abstract": "The use of 3D data in face image processing applications has received considerable attention during the last few years. A major issue for the implementation of 3D face processing systems is the accurate and real time acquisition of 3D faces using low cost equipment. In this paper we provide a survey of 3D reconstruction methods used for generating the 3D appearance of a face using either a single or multiple 2D images captured with ordinary equipment such as digital cameras and camcorders. In this context we discuss various issues pertaining to the general problem of 3D face reconstruction such as the existence of suitable 3D face databases, correspondence of 3D faces, feature detection, deformable 3D models and typical assumptions used during the reconstruction process. Different approaches to the problem of 3D reconstruction are presented and for each category the most important advantages and …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:ULOm3_A8WrAC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "PROSOPO-A face image synthesis system",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-38076-0_20",
            "Abstract": "In this paper we address the problem of synthesizing face images displaying prede.ned facial attributes, such as the shape and color of the overall face, the shape and color of individual facial features and the age of the subject shown in the synthesized image. The face image synthesis method is based on a statistical face model that enables the reversible representation of face images using a small number of parameters. By manipulating the parameters of the face model it is possible to generate di.erent instances of faces. We describe how the mathematical relationship between the model-based representation of faces and facial attributes of interest can be de.ned and used for transforming a set of facial attributes to model parameters, so that a face image consistent with the description provided can be synthesized. Our methodology can be applied to the problem of generating facial images of suspects …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Facial age estimation",
            "Publication year": 2010,
            "Publication url": "http://www.scholarpedia.org/article/Age_Estimation",
            "Abstract": "Age estimation is the determination of a person’s age based on biometric features. Although age estimation can be accomplished using different biometric traits, this article is focused on facial age estimation that relies on biometric features extracted from a person’s face. The main issues presented in the article involve typical applications where facial age estimation can be used, problem and challenges associated with facial age estimation, typical approaches reported in the literature and future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-modal contact-less human computer interaction",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77581-2_28",
            "Abstract": "We describe a contact-less Human Computer Interaction (HCI) system that aims to provide paraplegics the opportunity to use computers without the need for additional invasive hardware. The proposed system is a multi-modal system combining both visual and speech input. Visual input is provided through a standard web camera used for capturing face images showing the user of the computer. Image processing techniques are used for tracking head movements, making it possible to use head motion in order to interact with a computer. Speech input is used for activating commonly used tasks that are normally activated using the mouse or the keyboard. The performance of the proposed system was evaluated using a number of specially designed test applications. According to the quantitative results, it is possible to perform most HCI tasks with the same ease and accuracy as in the case that a touch pad …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "e-Restoration of Faces Appearing In Cultural Heritage Artefacts",
            "Publication year": 2009,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/1121",
            "Abstract": "Virtual restoration of Cultural Heritage (CH) artefacts is an important task that aims to re-create the original appearance of damaged items. In this paper we describe a method that can be used for virtual restoration of faces appearing in cultural heritage artefacts. Given a damaged face appearing in a 2D image we estimate the complete 3D shape of a face using data from the non-damaged face and we predict the texture of the damaged regions. As a result it is possible to generate a restored 3D model of the face which can be mapped back on the 2D image in order to complete the restoration process. Both visual and quantitative results prove the potential of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis of 3D face modeling",
            "Publication year": 2015,
            "Publication url": "https://www.academia.edu/download/40699171/2.pdf",
            "Abstract": "This article presents the topic of Three Dimensional facial reconstruction approaches and some used methods. In this paper, we implement three-dimensional facial reconstruction algorithms based on various face databases using single image as an input and analyzing their performance on several aspects. Researchers proposed many applications for this issue, but most have their drawbacks and limitations. Secondly, we discuss about three-dimensional shapes and models based on facial techniques in detail. It concludes with an analysis of several implementations and with some technical discussions about 3D facial reconstruction.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artwork Identication in a Museum Environment: A Quantitative Evaluation of Factors Affecting Identication Accuracy",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-73043-7_50.pdf",
            "Abstract": "The ability to identify the artworks that a museum visitor is looking at, using first-person images seamlessly captured by wearable cameras can be used as a means for invoking applications that provide information about the exhibits, and provide information about visitors’ activities. As part of our efforts to optimize the artwork recognition accuracy of an artwork identification system under development, an investigation aiming to determine the effect of different conditions on the artwork recognition accuracy in a gallery/exhibition environment is presented. Through the controlled introduction of different distractors in a virtual museum environment, it is feasible to assess the effect on the recognition performance of different conditions. The results of the experiment are important for improving the robustness of artwork recognition systems, and at the same time the conclusions of this work can provide specific guidelines to …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual reality-based learning environments in teacher training: new opportunities and challenges",
            "Publication year": 2017,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13005",
            "Abstract": "Nowadays, teachers face unprecedented challenges due to the diversity of the student population that is characterized by different cultural and language backgrounds, different levels of knowledge, different learning needs and increased levels of antisocial behavior. Classrooms have become more complex and dynamic environments and thus teachers need to constantly adapt their practices to the needs of individual learners and groups. Nevertheless, research reveals that teachers are not trained for the demanding and constantly changing requirements of the profession. Additionally, the lack of university-school connection deprives beginning teachers from learning through mentoring from experienced colleagues.   To address the above challenges, our work aims to contribute to the strengthening of the profile of the teaching profession through the enhancement of teachers’ professional development, using a contemporary virtual reality-based framework. Virtual Reality (VR) offers engaging and immersive experiences, allowing teachers to experience real world classroom situations which require rapid thinking and quick analysis for effective management. The long term goal is to offer, a contemporary, safe and low-cost in-service and pre-service teacher VR-based training instrument that allows users to learn from their mistakes without consequence for the students. The project approach is both innovative and complementary towards other projects already carried out as well as focused on teacher training.   The logical framework approach used to support the development of the proposed tool is divided into five main phases. The first phase …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A SYSTEMATIC VIRTUAL REALITY-BASED APPROACH TO SUPPORT THE PROFESSIONAL DEVELOPMENT OF TEACHERS",
            "Publication year": 2018,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13004",
            "Abstract": "The purpose of this paper is to present a virtual reality (VR)-based approach to teacher in-class training that will allow teachers to experience an entirely new way of training. The proposed virtual reality tool aims to provide strong support for teachers’ professional development through dedicated applications that address real training needs. The overall concept of the VR tool is to address specific teachers’ competences, defined based on an extensive documentation of existing teachers’ competence models and significant guidance by experts. The implementation of the VR application followed a full design cycle, a five-phase process like that of the ADDIE model, targeting mainly the cultivation of empathy and reflection skills among the users. After conducting several experiments with in-service and pre-service teachers, promising results regarding the cultivation of empathy and reflection skills were observed.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of research on facial ageing using the FG-NET ageing database",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/document/7475805/",
            "Abstract": "The face and gesture recognition network (FG-NET) ageing database was released in 2004 in an attempt to support research activities aimed at understanding the changes in facial appearance caused by ageing. Since then the database was used for carrying out research in various disciplines including age estimation, age-invariant face recognition and age progression. On the basis of the analysis of published work where the FG-NET ageing database was used, conclusions related to the type of research carried out in relation to the impact of the dataset in shaping up the research topic of facial ageing are presented. This study also includes a review of key articles from different thematic areas, where the FG-NET ageing database was used and the presentation of benchmark results. The ultimate aims of this study are to present concrete facts related to research activities in facial ageing during the past decade …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:VLnqNzywnoUC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Comparative evaluation of virtual and augmented reality for teaching mathematics in primary education",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-019-09973-5",
            "Abstract": "Primary school students often find it difficult to understand the differences between two dimensional and three-dimensional geometric shapes. Taking advantage of the ability of virtual and augmented reality to visualize 3D objects, we investigate the potential of using virtual and augmented reality technologies for teaching the lesson of geometric solids to primary school children. As part of the study 30 fourth, fifth and sixth class primary school students were divided into three groups that include a control group and two experimental groups. The first and second experimental groups used dedicated virtual and augmented reality applications to learn about geometric solids, while students from the control group used traditional printed material as part of the learning process. The results indicate that the implementation of new technologies in education of virtual and augmented reality improve interactivity and …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Leveraging image-to-image translation generative adversarial networks for face aging",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8682965/",
            "Abstract": "Here, face images of a specific age class are translated to images of different age classes in an unsupervised manner that enables training on independent sets of images for each age class. In order to learn pairwise translations between age classes, we adopt the UNsupervised Image-to-image Translation framework that employs Variational AutoEncoders and Generative Adversarial Networks. By mapping face images of different age classes to shared latent representations, the most personalized and abstract facial characteristics are preserved. To effectively diffuse age class information, a pyramid of local, neighbour, and global encoders is employed so that the latent representations progressively cover an increased age range. The proposed framework is applied to the FGNET aging database and compared to state-of-the-art techniques and the ground truth. Appealing experimental results demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lessons learned from the application of biometric-tests on a real case involving identity verification of a missing child",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6914263/",
            "Abstract": "The topic of identity verification and age progression received considerable attention among researchers in the computer vision research community leading to the development of a variety of promising techniques that have been developed and tested using dedicated datasets. However, a key question that arises is whether biometric-based techniques could be used in real identity verification of age separated faces with the same effectiveness as other identity verification tests or at least as a soft filtering approach before applying more reliable but intrusive tests such as DNA tests. Towards this end we apply biometric-based techniques in an attempt to verify the identity of a missing child, using real data. The aim of the paper is not to provide answers to the aforementioned question but to report the problems faced in similar scenarios and propose future research directions that aim to make biometric-based techniques …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Restoration of partially occluded shapes of faces using neural networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-32390-2_90",
            "Abstract": "One of the major difficulties encountered in the development of face image processing algorithms, is the possible presence of occlusions that hide part of the face images to be processed. Typical examples of facial occlusions include sunglasses, beards, hats and scarves. In our work we address the problem of restoring the overall shape of faces given only the shape presentation of a small part of the face. For this purpose a novel technique which utilizes combination of Hopfield and Multi-Layer Perceptron (MLP) neural networks was used. According to the experimental results it is possible to recover with reasonable accuracy the overall shape of faces even in the case where a substantial part of the shape of a given face is not visible. The presented technique could form the basis for developing face image processing systems capable of dealing with occluded faces.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Preparing student mobility through a VR application for cultural education",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75789-6_16",
            "Abstract": "The potential of VR as a basis for developing dedicated applications for Cultural Education is explored through the design and development of a VR application called Celestial Breeze. Celestial Breeze is a dedicated application that aims to provide knowledge about the culture of different European countries. The design of the application is based on multimedia learning theories in an attempt to maximize the learning outcomes of the users. Emphasis is given in examining the effectiveness of Celestial Breeze as a tool of information dissemination in relation to the age and gender of the audience. We evaluated the application through a user study with 20 participants - half of whom were under aged- but all belong to Generation Y. The comparison of pre- and post- test results pinpoints the positive learning outcomes of Celestial Breeze on participants indicating in that way the potential of using immersive …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Virtual-Reality Based Crisis Management Training for Teachers",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:vbGhcppDl1QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A general framework for selecting biometric features for automatic user profiling",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/7015",
            "Abstract": "In automatic user profiling a number of features related to the user of a system are extracted in an attempt to deduct key information that can be used for adapting the interface and content of computer applications. In this context the identity, emotion, age and head orientation can provide important cues that enable efficient customization of the content of an application. In order to develop automated user profiling applications facial features are often used for providing the required information related to the user. A key issue that arises is the applicability of different facial features for different user profiling tasks. In this paper we present a generalized framework that can be used for quantifying the invariance of different facial features for different classification tasks assisting in that way the implementation of efficient adaptive user profiling in computer applications. Preliminary experimental results demonstrate the potential of the proposed method in selecting the most useful features for different tasks",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE Xplore"
        },
        {
            "Title": "Reconstructing 3D faces in cultural heritance applications",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=3753575373759474134&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Neural network methods for one-to-many multi-valued mapping problems",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-010-0483-4",
            "Abstract": "An investigation of the applicability of neural network-based methods in predicting the values of multiple parameters, given the value of a single parameter within a particular problem domain is presented. In this context, the input parameter may be an important source of variation that is related with a complex mapping function to the remaining sources of variation within a multivariate distribution. The definition of the relationship between the variables of a multivariate distribution and a single source of variation allows the estimation of the values of multiple variables given the value of the single variable, addressing in that way an ill-conditioned one-to-many mapping problem. As part of our investigation, two problem domains are considered: predicting the values of individual stock shares, given the value of the general index, and predicting the grades received by high school pupils, given the grade for a …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "An Automated methodology for assessing the damage on Byzantine icons",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34234-9_32",
            "Abstract": "Byzantine art is overwhelmed by a multitude of icons that portray sacred faces. However, a large number of icons of historical value are either partially or totally damaged and thus in need of undergoing conservation. The detection and assessment of damage in cultural heritage artifacts comprise an integral part of the conservation process. In this paper, a method that can be used for assessing the damage on faces appearing in Byzantine icons is presented. The main approach involves the estimation of the residuals obtained after the coding and reconstruction of face image regions using trained Principal Component Analysis texture models. The extracted residuals can be used as the basis for obtaining information about the amount of damage and the positions of the damaged regions. Due to the specific nature of Byzantine icons several variations of the basic approach are tested through a quantitative …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards automatic face identification robust to ageing variation",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/840664/",
            "Abstract": "A large number of high-performance automatic face recognition systems have been reported in the literature. Many of them are robust to within class appearance variation of subjects such as variation in expression, lighting of subjects such as variation in expression, lighting and pose. However, most of the face identification systems developed are sensitive to changes in the age of individuals. We present experimental results to prove that the performance of automatic face recognition systems depends on the age difference of subjects between the training and test images. We also demonstrate that automatic age simulation techniques can be used for designing face recognition systems, robust to ageing variation. In this context, the perceived age of the subjects in the training and test images is modified before the training and classification procedures, so that ageing variation is eliminated. Experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing a virtual environment for teacher training: Enhancing presence and empathy",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3208159.3208177",
            "Abstract": "Virtual Reality (VR) is still an emerging technology in terms of recognizing its full potential in education and specifically in teacher education. A key issue of a VR-based approach for teacher training, is the level of presence along with the empathy inflicted on the trainees that will allow them to experience realistic and emotion-rich classroom situations in a virtual environment. This paper describes an experiment that aims to assess the influence of the graphical realism of a virtual classroom to the levels of presence and development of empathy skills for trainee teachers. Moreover, a second objective is to investigate whether there are significant differences between training in a VR classroom and a real physical classroom and how this affects the trainee teacher. The overall conclusion of the experiment is that the design of the VR classroom environment influenced the levels of immersion and presence. Moreover …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An overview of research activities in facial age estimation using the fg-net aging database",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16181-5_56",
            "Abstract": "The FG-NET aging database was released in 2004 in an attempt to support research activities related to facial aging. Since then a number of researchers used the database for carrying out research in various disciplines related to facial aging. Based on the analysis of published work where the FG-NET aging database was used, conclusions related to the type of research carried out in relation to the impact of the dataset in shaping up the research topic of facial aging, are presented. In particular we focus our attention on the topic of age estimation that proved to be the most popular among users of the FG-NET aging database. Through the review of key papers in age estimation and the presentation of benchmark results the main approaches/directions in facial aging are outlined and future trends, requirements and research directions are drafted.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An Integrated tool for virtual restoration of Byzantine icons",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6623685/",
            "Abstract": "An integrated tool that can be used for damage detection, shape restoration and texture restoration of faces appearing in Byzantine icons, is presented. The damage detection process involves the estimation of residuals obtained after the coding and reconstruction of face image regions using trained Principal Component Analysis (PCA) texture models. Shape restoration is accomplished using a model-based approach that employs a 3D shape model generated by taking into account a set of geometrical rules adopted by Byzantine style iconographers. Texture restoration is performed using a customized version of the recursive PCA technique. For this purpose dedicated PCA texture models representing different categories of faces appearing in icons, are used. All methods developed as part of the project are incorporated into a user-friendly application, which can be utilized by both amateurs and professionals …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Age interval and gender prediction using PARAFAC2 and SVMs based on visual and aural features",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/document/7959336/",
            "Abstract": "Parallel factor analysis 2 (PARAFAC2) is employed to reduce the dimensions of visual and aural features and provide ranking vectors. Subsequently, score level fusion is performed by applying a support vector machine (SVM) classifier to the ranking vectors derived by PARAFAC2 to make gender and age interval predictions. The aforementioned procedure is applied to the Trinity College Dublin Speaker Ageing database, which is supplemented with face images of the speakers and two single-modality benchmark datasets. Experimental results demonstrate the advantage of using combined aural and visual features for both prediction tasks.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Toward automatic simulation of aging effects on face images",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/993553/",
            "Abstract": "The process of aging causes significant alterations in the facial appearance of individuals. When compared with other sources of variation in face images, appearance variation due to aging displays some unique characteristics. Changes in facial appearance due to aging can even affect discriminatory facial features, resulting in deterioration of the ability of humans and machines to identify aged individuals. We describe how the effects of aging on facial appearance can be explained using learned age transformations and present experimental results to show that reasonably accurate estimates of age can be made for unseen images. We also show that we can improve our results by taking into account the fact that different individuals age in different ways and by considering the effect of lifestyle. Our proposed framework can be used for simulating aging effects on new face images in order to predict how an …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Facial Biometric Templates and Aging: Problems and Challenges for Artificial Intelligence.",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Lanitis/publication/40723341_Facial_Biometric_Templates_and_Aging_Problems_and_Challenges_for_Artificial_Intelligence/links/00463533817d77b74c000000/Facial-Biometric-Templates-and-Aging-Problems-and-Challenges-for-Artificial-Intelligence.pdf",
            "Abstract": "The performance of face recognition and/or authentication systems is greatly affected by within-person variations encountered in human faces. Within person facial variations distort the appearance of faces leading to inconsistencies between facial features stored in templates and features derived from a face, of the corresponding subject, captured at a different instance. For this reason a considerable amount of effort has been devoted to the development of methods for eliminating within person-variations during face recognition/authentication. Among all types of within-person variations encountered, aging-related variations display unique characteristics that make the process of dealing with this type of variation a challenging task. In this paper we describe experiments that enable the quantification of the effects of aging on the performance of face recognition systems. We also review typical approaches that aim to eliminate the effects of aging in face recognition and outline future research directions for this area.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Methodological Approach for Supporting Automatic Detection of Images Containing Child Pornographic Material",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the analysis of factors influencing the performance of facial age progression",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7449697/",
            "Abstract": "Facial age progression is the process of synthesizing a face image at an older age based on images showing a person at a younger age. The ability to generate accurate age progressed face images is important for a number of forensic investigation tasks. In this paper we analyze the performance of a number of publicly available age progression applications, with respect to different parameters encountered in age progression including imaging conditions of input images, presence of occluding structures, age of input/target faces, and age progression range. Through the analysis and quantification of age progression accuracy in the presence of different conditions, we extract a number of conclusions that take the form of a set of guidelines related to factors that forensic artists and age progression researchers should focus their attention in order to produce improved age progression methodologies.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Age estimation based on head movements: A feasibility study",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5463396/",
            "Abstract": "The ability to estimate the age of a machine user is a highly important task that can be used as the basis for developing age adaptive human computer interaction systems. Recently a considerable number of researchers described work on facial age estimation, where facial features are used for estimating the age of a subject. Usually in facial age estimation systems, static images are used so that the dynamics of face movements are not taken into consideration during the process of age estimation. In this paper we present a framework for age estimation based on head movements. The feasibility of the proposed framework is evaluated using a dedicated experimental procedure where we compare the performance of age estimation using head movements against age estimation based on mouse movements and age estimation based on face images. Preliminary results demonstrate the potential of using head …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating the impact of a virtual reality application in raising awareness toward the destruction of cultural heritage sites",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-01765-1_17",
            "Abstract": "The aim of our work is to investigate the applicability of Virtual Reality (VR) in raising awareness of users in relation to the destruction of important monuments. The proposed methodology involves the exposure of users to three virtual environments displaying the original state of a monument, the current state and the predicted future state of the same monument in the case that the monument is not maintained. The exposure to the three states of the same building allows the user to experience the “glorious days” of a monument and compare them to the current and future states in an attempt to realize the level of destruction that could occur to the building if the monument is not maintained properly. As part of a pilot case study, a number of volunteers were asked to navigate in virtual environments depicting the three chronological states of a landmark building. Preliminary results indicate a significant increase …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Smartphone Application Designed to Detect Obstacles for Pedestrians' Safety",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-76063-2_25",
            "Abstract": "Encouraging people to walk rather than using other means of transportation is an important factor towards personal health and environmental sustainability. However, given the large number of pedestrian accidents recorded every year, the need for safe urban environments is increasing. Taking advantage of the potential of citizen-science for crowdsourcing data and creating awareness, we developed a smartphone application for enhancing the safety of pedestrians while walking in cities. Using the application, citizens will monitor the urban sidewalks and update a crowdsourcing platform with the detected barriers and damages that hinder safe walking, along with their location on a city map. To help users assign the correct type of obstacle, and authorities to assess the urgency, a Convolutional Neural Network (CNN) model for barrier and damage recognition is embedded in the application. The results of a user …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A semi-automated quality assurance toolbox for diagnostic imaging",
            "Publication year": 2014,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBET.2014.059345",
            "Abstract": "A prototype software system for supporting the process of data collection and management in Quality Assurance (QA) for diagnostic imaging is presented. The developed system comprises two main units: the Image Processing Unit (IPU) and the Data Management Unit (DMU). The IPU is implemented to analyse images from different diagnostic modalities to allow extraction of quantitative measurements for further processing or immediate storage. The IPU is dynamically linked to the DMU so that measurements are transferred directly to the DMU. This process allows the automated generation of quality assurance reports for all such modalities. Apart from its low cost, flexibility for expandability and portability, the developed system extensively and comprehensively tests diagnostic modalities for compliance with international guidelines and standards, offering a structured approach to a comprehensive QA methodology.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Virtual reality environments (VREs) for training and learning",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-13-8265-9_10",
            "Abstract": "VR technologies are gaining momentum in the field of education and particularly in the use of Virtual Reality (VR)-based learning. Within Virtual Reality Environments (VREs) realistic world situations are simulated, facilitating the transfer of the knowledge and skills gained within the virtual world to the real one. In this chapter, we provide a review of several advantages of using VR technology in education and training. In addition, we examine different challenges and potential problems that need to be considered in order to successfully integrate VR in training activities. We also exemplify the promising prospect of this technology in education by describing two novel VR applications. The first one aims to support educators in improving their teaching practice. Using VR technology, the teacher is given the opportunity to experience the student’s point of view during a classic room and cultivate their empathy skills …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:evX43VCCuoAC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "A first-person database for detecting barriers for pedestrians",
            "Publication year": 2020,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/19400",
            "Abstract": "Egocentric vision, which relates to the continuous interpretation of images captured by wearable cameras, is increasingly being utilized in several applications to enhance the quality of citizens life, especially for those with visual or motion impairments. The development of sophisticated egocentric computer vision techniques requires automatic analysis of large databases of first-person point of view visual data collected through wearable devices. In this paper, we present our initial findings regarding the use of wearable cameras for enhancing the pedestrians safety while walking in city sidewalks. For this purpose, we create a first-person database that entails annotations on common barriers that may put pedestrians in danger. Furthermore, we derive a framework for collecting visual lifelogging data and define 24 different categories of sidewalk barriers. Our dataset consists of 1796 annotated images covering 1969 instances of barriers. The analysis of the dataset by means of object classification algorithms, depict encouraging results for further study.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing different classifiers for automatic age estimation",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1262530/",
            "Abstract": "We describe a quantitative evaluation of the performance of different classifiers in the task of automatic age estimation. In this context, we generate a statistical model of facial appearance, which is subsequently used as the basis for obtaining a compact parametric description of face images. The aim of our work is to design classifiers that accept the model-based representation of unseen images and produce an estimate of the age of the person in the corresponding face image. For this application, we have tested different classifiers: a classifier based on the use of quadratic functions for modeling the relationship between face model parameters and age, a shortest distance classifier, and artificial neural network based classifiers. We also describe variations to the basic method where we use age-specific and/or appearance specific age estimation methods. In this context, we use age estimation classifiers for each …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Addressing the cultivation of teachers’ reflection skills via virtual reality based methodology",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_28",
            "Abstract": "Virtual Reality (VR) based approaches have emerged lately as a new learning and training paradigm. This paper addresses the possibility to cultivate teacher’s reflection skills using a VR based approach targeting to maximize their professional development. Reflection has been considered as a skill of paramount importance for teachers and an integral part of their professional development. The research aimed to investigate possible difference in cultivating reflection skills between participants who used a VR system and the control group who participated in a real classroom setting. The results indicate that the process of reflection is essential for the participants of all groups. However, the participants using the virtual classroom environment scored higher to the reflective items that the control group that tended to be undecided. Moreover, the VR system gave the participants the opportunity to enter the …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:WqliGbK-hY8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The history of Commandaria: digital journeys back to time",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/277",
            "Abstract": "Commandaria is considered one of the oldest types of wines and it has been ranked as one of the best wines of the last millennium. Production of Commandaria in Cyprus is associated with historical and political events that took place at the island, especially during the last millennium, hence studies related to Commandaria are heavily related to the culture and history of Cyprus. Unfortunately up to now the issue of preserving the history and traditions related to the production of Commandaria over the years did not receive adequate attention and as result the danger of losing important aspects of the relevant Cypriot cultural heritage is obvious. With our work we aim to develop an interactive system through which the history of the production of Commandaria at different areas in Cyprus and different time periods will be presented along with historical events that took place in the island and can be related with Commandaria production. As part of the project we will establish a multimedia digital library that will contain items related to the history and production of Commandaria in Cyprus. All multimedia database entries will be sorted according to various criteria, including the chronological period, the geographical location they refer to and the actual contents of the item, and could be searched via semantic-based queries with the aid of an ontology. In addition, an interactive application will be created where users will have the opportunity to explore the history of Commandaria in Cyprus at different geographical locations and different time periods. The final system will operate both as a web application and as a stand alone application in information …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Increasing User Engagement in Re-designed Classic Video Games",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Presenting cypriot cultural heritage in virtual reality: A user evaluation",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13695-0_57",
            "Abstract": "This paper presents a user evaluation related to the overall experience of a number of volunteers obtained by visiting two virtual museums populated with digitized Cypriot cultural heritage/art items using different virtual reality display systems. The two virtual museums used are replicas of an engraving museum and a virtual Byzantine icons museum. During the experiment visitors were able to use a Head Mounted Display or a stereoscopic Powerwall projection in order to obtain an immersive 3D experience. The results of the user evaluation indicate that both ways of presenting the museum received an equal usability score among the users but at the same time a number of drawbacks of each method were indicated. The findings of the research are crucial in enabling the use of a user-centered design process approach to improve the prototypes and develop virtual experiences for additional museums. The …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the presentation of byzantine art in virtual environments",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962084/",
            "Abstract": "This paper deals with a main theoretical research question which asks how to best represent Byzantine art in virtual environments. The two options of photo realistic and non photo realistic rendering are researched in the background of topics related to digital reproduction of Byzantine art, Byzantine art aesthetics and system evaluation studies in order to derive appropriate design methodologies according to the scopes set. The problem is studied within the framework of developing a Byzantine virtual museum that aims to represent the authentic expressivity of Byzantine artifacts of a real Byzantine art museum located in a UNESCO World Heritage Site - the Monastery of St John Lampadistis.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An EEG-based evaluation for comparing the sense of presence between virtual and physical environments",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3208159.3208179",
            "Abstract": "The current study concerns the identification of possible differences in perception between the virtual and the real world in terms of the effect on brain activity. For this reason, an EEG device was used to capture participants' brain activity in different brain areas during their exposure to different virtual and real environments. The environments considered in this study portray a classroom environment with a scenario suitable for teacher training and professional development. The first aim of the experiment is to investigate if exposure to a virtual environment can affect motor, cognitive or other function of the users, and the second aim is to test if the graphics content and nature of such an environment can influence the user experience. During the study, the optimum duration of exposure in a virtual environment was also assessed by measuring the time that the brain needs to perceive and adapt to the new state. Our …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robust face recognition using automatic age normalization",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/879974/",
            "Abstract": "A large number of automatic face recognition systems have been reported in the literature. Many of them are robust to within class appearance variation of subjects such as variation in expression, lighting and pose. However, most of the face identification systems developed, are sensitive to changes in the age of individuals. In this paper we demonstrate that automatic age simulation techniques can be used for designing face recognition systems, robust to ageing variation. In this context, the perceived age of the subjects in the training and test images is modified before the training and classification procedures, so that ageing variation is eliminated. Experimental results demonstrate that the performance of our face recognition system can be improved significantly, when this approach is adopted.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Model-based generation of personalized full-body 3D avatars from uncalibrated multi-view photographs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-016-3808-1",
            "Abstract": "According to a number of studies, the use of personalized avatars in virtual environments can enhance the immersion experience of users and the effectiveness of communication between different players. The benefits of using personalized avatars in conjunction with recent technological developments in Virtual Reality (VR) prompted an increasing demand for low-cost systems that are capable of fast and easy generation of personal avatars for use in VR applications. In this paper we present a novel model-based technique that is capable of generating personalized full-body 3D avatars from orthogonal photographs. The proposed method utilizes a statistical model of human 3D shape and a multi-view statistical 2D shape model of its corresponding silhouettes. Our technique is automatic, requiring minimal user intervention, and does not need a calibrated camera. Each component of our proposed …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "E-Restoration of faces appearing in cultural heritage artefacts",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5306036/",
            "Abstract": "Virtual restoration of Cultural Heritage (CH) artefacts is an important task that aims to re-create the original appearance of damaged items. In this paper we describe a method that can be used for virtual restoration of faces appearing in cultural heritage artefacts. Given a damaged face appearing in a 2D image we estimate the complete 3D shape of a face using data from the non-damaged face and we predict the texture of the damaged regions. As a result it is possible to generate a restored 3D model of the face which can be mapped back on the 2D image in order to complete the restoration process. Both visual and quantitative results prove the potential of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "LV7ud3IAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selecting effective colors for high-visibility safety apparel",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925753520303751",
            "Abstract": "The proper use of high-visibility safety apparel (HVSA) increases conspicuity and reduces accident rates. The main factor affecting daytime conspicuity is the color contrast between HVSA and the ambient background environment. Selecting HVSA without considering their contrast to the worksite environment may result in unsafe situations where HVSA not only fail to provide the desired conspicuity but also act as camouflage. One such situation is the use of red HVSA on oil tankers with brown decks. This paper presents a methodology for selecting the most effective HVSA color for a particular worksite. Using image analysis techniques, we can assess the contrast between a set of high-visibility colors and the colors present at a worksite in order to determine the most effective HVSA color for the particular site. The methodology was experimentally validated with the help of 50 volunteers and the use of a purpose-built …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:ipzZ9siozwsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An age simulated virtual environment for improving elderly wellbeing",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-32703-7_174",
            "Abstract": "Aging effects cause significant changes in the functionality and abilities of the elderly that affect the overall interaction of elder people with their environment and other people. However, since the aging process occurs gradually in a person’s life, it is not possible for humans who belong to younger generations to experience the effects of aging. Towards this end we propose the use of a Virtual Reality (VR) based application that allows users to experience the effects of aging before such changes affect their body and mind. The proposed application targets two main objectives: The first objective is to allow product and software designers to experience problems faced by the elderly so that they design products friendly to older people. The second objective is to increase the appreciation and social inclusion towards the elderly. The development of this application relies on an extensive study of the literature that …",
            "Abstract entirety": 0,
            "Author pub id": "LV7ud3IAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Cham"
        }
    ]
}]