[{
    "name": "Ανδρέας Ανδρέου",
    "romanize name": "Andreas Andreou",
    "School-Department": "Τμήμα Ηλεκτρολόγων Μηχανικών και Τεχνολογιών Πληροφορικής",
    "University": "cut",
    "Rank": " Καθηγητής",
    "Apella_id": 9921,
    "Scholar name": "Andreas Andreou",
    "Scholar id": "CqlJG_IAAAAJ",
    "Affiliation": "Professor, Cyprus University of Technology, Dept. of Computer Engineering & Informatics",
    "Citedby": 2238,
    "Interests": [
        "Software Engineering",
        "Web Engineering and Mobile Software Engineering",
        "Computational Intelligence in Software Engineering and In"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=CqlJG_IAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Reliable confidence intervals for software effort estimation",
            "Publication year": 2009,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13755",
            "Abstract": "This paper deals with the problem of software effort estimation through the use of a new machine learning technique for producing reliable confidence measures in predictions. More specifically, we propose the use of Conformal Predictors (CPs), a novel type of prediction algorithms, as a means for providing effort estimations for software projects in the form of predictive intervals according to a specified confidence level. Our approach is based on the well-known Ridge Regression technique, but instead of the simple effort estimates produced by the original method, it produces predictive intervals that satisfy a given confidence level. The results obtained using the proposed algorithm on the COCOMO, Desharnais and ISBSG datasets suggest a quite successful performance obtaining reliable predictive intervals which are narrow enough to be useful in practice.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:8moDcb_GFzgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing Quality Web Applications Using Patterns.",
            "Publication year": 2004,
            "Publication url": "https://www.scitepress.org/Papers/2004/26379/26379.pdf",
            "Abstract": "Patterns are commonly utilized by Web developers for reusability purposes. However, this paper shows how Web patterns can also enhance the quality of Web applications. Firstly, Web quality is divided into five major components, namely usability, functionality, reliability, efficiency, and maintainability. Secondly, the relationship of these quality components with certain Web patterns is demonstrated and a set of guidelines for designing quality Web applications using these patterns is proposed. A successful Web site is then used as a case-study to demonstrate the efficacy of the proposed guidelines. The Web patterns utilized by the site under study are identified and matched with the proposed list of patterns. Finally, we investigated how these patterns contribute to the success of the specific Web application.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tree-Structured Multi-Layer Fuzzy Cognitive Maps for Modelling Large Scale, Complex Problems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1631457/",
            "Abstract": "This paper proposes tree structured multi-layer fuzzy cognitive maps for modelling large-scale and complex real world problems and supporting the decision making process. Large-scale problems are characterized by a large number of parameters, concepts, variables, nonlinearities and uncertainties that make their analysis and modelling a very difficult task. The objective of the proposed methodology is to give an alternative approach for dealing with the aforementioned difficulties, offering a new computational algorithm designed so as to support the creation of layers of parameters and variables describing the system under study, as well as the simulation of its evolution dynamics",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel software tool for supporting and automating the requirements engineering process with the use of natural language",
            "Publication year": 2013,
            "Publication url": "http://www.ijcte.org/papers/727-C0247.pdf",
            "Abstract": "This paper presents NALASS, a novel software tool that attempts to automate a large part of the Requirements Engineering (RE) process. The tool is based on a methodology that utilizes elements of natural language syntax and semantics to formalize activities of requirements discovery, analysis and specification. NALASS automates the creation of specific question sets for the elicitation stage, the organisation and classification of requirements for the analysis stage, with the use of predefined patterns, and the generation of diagrammatic notations, use case specifications and the SRS document.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IACSIT Press"
        },
        {
            "Title": "Healthcare telematic applications in Cyprus",
            "Publication year": 2002,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0038-1634455",
            "Abstract": " Objectives: a) To present a review of ongoing health telematic applications in Cyprus. b) To promote the use of these health telematic applications in the Cyprus region. c) To help in the spin off of other health telematic applications thus enabling the offering of a better health service to the citizens. Methods and Results: The health telematics applications include a medical system for emergency telemedicine (AMBULANCE and EMERGENCY-112 projects), a system for the evaluation of the risk of stroke by telemedicine (EROS), a diagnostic telepathology network in gynaecological cancer (TELEGYN), a collaborative virtual medical team for home healthcare of cancer patients (DITIS), and a health telematics training network (HEALTHNET). The paper refers to the set-up and characteristics of these applications and tries to relate them with the health policies that should be applied in Cyprus. Conclusions: It is …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Schattauer GmbH"
        },
        {
            "Title": "ParkChain: An IoT Parking Service Based on Blockchain",
            "Publication year": 2019,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11703",
            "Abstract": "The IoT ecosystem is evolving quickly, developing several applications in different sectors. The majority of these applications use centralized infrastructures something that poses several challenges especially related to trust and data security. Recently, blockchain has been introduced as an effective solution to IoT applications trying to provide solutions to these challenges. In this paper, we introduce a new decentralized IoT application using blockchain technology, namely, ParkChain. The ParkChain application operates in a way that no one can delete, revert, hack or question the time a registered vehicle securely entered a parking area. In order to evaluate ParkChain, we have implemented the smart contract on top of Ethereum Blockchain along with a traditional Image Processing / Computer Vision approach for License Plate Recognition, and using a Raspberry Pi we control the access on a parking place. We report on several experiments that assess the performance of ParkChain application.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:rsrKZ8bNWIsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Genetic Programming Approach to Software Cost Modeling and Estimation.",
            "Publication year": 2010,
            "Publication url": "https://www.scitepress.org/papers/2010/29116/29116.pdf",
            "Abstract": "This paper investigates the utilization of Genetic Programming (GP) as a method to facilitate better software cost modeling and estimation. The aim is to produce and examine candidate solutions in the form of representations that utilize operators and operands, which are then used in algorithmic cost estimation. These solutions essentially constitute regression equations of software cost factors, used to effectively estimate the dependent variable, that is, the effort spent for developing software projects. The GP application generates representative rules through which the usefulness of various project characteristics as explanatory variables, and ultimately as predictors of development effort is investigated. The experiments conducted are based on two publicly available empirical datasets typically used in software cost estimation and indicate that the proposed approach provides consistent and successful results.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Facing Multicollinearity in a Fuzzy Cognitive Maps Environment Using Bias Nodes",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4530017/",
            "Abstract": "This paper presents an improvement in the fuzzy cognitive maps (FCMs) theory used in modelling dynamical systems. The dynamic behaviour of a system focuses on a stable behaviour reaching equilibrium state at fixed points. Multicollinearity in FCMs, is examined as a phenomenon possibly present in any dynamic modelling. Cases in which the activation level of a concept is constantly driven towards +1 or -1 are investigated. In addition, concepts stabilizing at levels other than those reflecting the actual environment are also considered. These experiments are performed by selectively inserting bias nodes in the map so as to increase the reliability of the dynamic model. Following the theoretical background of FCMs and the mathematical formulation of bias nodes we demonstrate their use and contribution in terms of a case study that deals with the Cyprus issue in view of the Turkish full EU membership.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automatic matching of software component requirements using semi-formal specifications and a CBSE ontology",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7320344/",
            "Abstract": "One of the most significant tasks of component-based software development is concerned with finding suitable components for integration. This paper introduces a novel development framework that promotes reusability and focuses on assessing the suitability level of candidate components. A specifications profile is first created using a semi-formal natural language that describes the desired functional and non-functional properties of the component(s) sought. A parser automatically recognizes parts of the profile and translates them into instance values of a dedicated CBSE ontology, the latter addressing issues of components' reusability. Available components on the market are also stored as instances of the CBSE ontology. Matching between required and offered component properties takes place automatically at the level of the ontology items and a suitability ratio is calculated that suggests which components to …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:kk7MRXTjMocC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BuildingNet: Learning to Label 3D Buildings",
            "Publication year": 2021,
            "Publication url": "http://openaccess.thecvf.com/content/ICCV2021/html/Selvaraju_BuildingNet_Learning_To_Label_3D_Buildings_ICCV_2021_paper.html",
            "Abstract": "We introduce BuildingNet:(a) a large-scale dataset of 3D building models whose exteriors are consistently labeled, and (b) a graph neural network that labels building meshes by analyzing spatial and structural relations of their geometric primitives. To create our dataset, we used crowdsourcing combined with expert guidance, resulting in 513K annotated mesh primitives, grouped into 292K semantic part components across 2K building models. The dataset covers several building categories, such as houses, churches, skyscrapers, town halls, libraries, and castles. We include a benchmark for evaluating mesh and point cloud labeling. Buildings have more challenging structural complexity compared to objects in existing benchmarks (eg, ShapeNet, PartNet), thus, we hope that our dataset can nurture the development of algorithms that are able to cope with such large-scale geometric data for both vision and graphics tasks eg, 3D semantic segmentation, part-based generative models, correspondences, texturing, and analysis of point cloud data acquired from real-world buildings. Finally, we show that our mesh-based graph neural network significantly improves performance over several baselines for labeling 3D meshes. Our project page www. buildingnet. org includes our dataset and code.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:8xglSJ46CyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolutionary Fuzzy Cognitive Maps: A Hybrid System for Crisis Management and Political Decision-Making",
            "Publication year": 2003,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/51482",
            "Abstract": "This paper proposes an extension of Certainty Neuron Fuzzy Cognitive Maps (CNFCMs) used in crisis management and decision-making, aiming at increasing their reliability. The objective of the Genetically Evolved Certainty Neuron Fuzzy Cognitive Map (GECNFCM) as it is introduced here is to overcome the main weakness of CNFCMs, which lies with the recalculation of the weights corresponding to each concept every time a new strategy is adopted. The problem is overcome through the introduction of a Genetic Algorithm (GA), which produces a set of solutions and new weights following a strategy change. The GA concepts are very appealing since they offer the optimal solution without a problem-solving strategy, once the requirements are defined. It is interesting to point out that the hybrid approach is reflected in both the implementation of the GA and in the methodology applied for solving the problem. In fact, the reasoning behind this hybrid methodology is to use it for obtaining the optimal values of the weights corresponding to the variables of the model rather than the optimal values of the variables themselves.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FINANCIAL VERSUS HUMAN RESOURCES IN THE GREEK–TURKISH ARMS RACE 10 YEARS ON: A FORECASTING INVESTIGATION USING ARTIFICIAL NEURAL NETWORKS",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10242694.2010.539858",
            "Abstract": "This paper looks into the Greek–Turkish arms race a decade after an earlier contribution to the issue that relied heavily on artificial neural networks. The time period between the two papers contributes to the reliability of the results derived, not just by increasing the number of observations, but also mainly by incorporating the progress made in the realm of artificial intelligence. The focus on the case of both countries unlike the paper mentioned above that dealt with just the Greek side provides ample room for comparative purposes regarding the determinants of defense expenditure on both sides. The results derived in terms of input significance estimation support the findings of the earlier research as indicated above, pointing to the leading role of the demographic preponderance of Turkey over Greece. The paper also points to the fact that 10 years later, Turkey continues to set the arms race rules against its rival by …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:ldfaerwXgEUC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Key issues for the design and development of mobile commerce services and applications",
            "Publication year": 2005,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/14028",
            "Abstract": "This paper suggests a new approach for developing m-commerce services and applications based on a scheme that divides m-applications into directory- and transaction-oriented classes, identifies mobile user requirements, and takes into consideration the constraints of current technologies for mobile and wireless computing. The efficacy of the proposed approach in a real scenario is discussed. Copyright © 2005 Inderscience Enterprises Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:6_6x9JMR98MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Critical factors in the socio-cultural e-Learning engineering process",
            "Publication year": 2007,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13807",
            "Abstract": "The transfer of the traditional teaching and learning process into the new environment is not always successful. In this paper, we identify the most important factors that need to be included in the e-Learning engineering process with emphasis on the human, social and cultural factors and how these affect the successful development of e-Learning systems. The critical factors are divided in three axons Human, Social and Cultural Factors, Quality Components and Pedagogy Requirements. Finally, we propose an e-Learning engineering process incorporating these axons. The process is demonstrated through a case study showing the efficacy of our process. Copyright © 2007 Inderscience Enterprises Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:Qs68GpkTGbMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving the performance of classification models with fuzzy cognitive maps",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8015422/",
            "Abstract": "This paper presents a novel approach to improve the accuracy of classification models used for prediction purposes by integrating a Fuzzy Cognitive Map (FCM) to produce a hybrid model. The proposed methodology first uses the FCM to discover latent correlations that exist between the data in order to form a single variable. This variable is then fed in the classification model as part of the training and testing phases to enhance its accuracy. Experimental results using datasets describing two different problems suggested noteworthy improvements in the accuracy of various classification models.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:W8gSVh4kTHQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying hard and fuzzy k-modes clustering for dynamic web recommendations",
            "Publication year": 2014,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/9590",
            "Abstract": "This paper proposes a dynamic Recommender System for the Web, which uses Entropy based Hard and Fuzzy K-modes algorithms to group items in clusters according to certain data features. Recommendations are then produced from those clusters that have their centers closer to the user's search preferences. The system starts operating with a learning session which allows the user to conduct various searches in order to identify her/his initial preferences. The ongoing searching behavior of the user is dynamically recorded and inserted in the recommendation engine, adjusting user preferences in real-time and enabling the system to maintain high levels of accuracy. The proposed approach is validated on a movie dataset containing information on stars, categories and production companies, with the user being able to search for an item based on one or more of these features. The results indicate successful performance for the two clustering algorithms, while a short comparison to variations of the KNN algorithm suggests superiority of the proposed approaches.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:b8wqy9DyMDUC",
            "Publisher": "CRL Publishing"
        },
        {
            "Title": "Automatic, evolutionary test data generation for dynamic software testing Fe: 160",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=5677195674073341270&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Locating and correcting software faults in executable code slices via evolutionary mutation testing",
            "Publication year": 2013,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13731",
            "Abstract": "Software testing is an important phase of software development that helps eliminating the possibility of project failure. As software systems get more complicated and larger in size, testing needs to constantly evolve and provide more ‘‘sophisticated’’ techniques, like automatic, self-adaptive mutation testing, targeting at improving the efficiency and effectiveness of the testing phase by handling the increased complexity that leads to increased demands in time and effort. Mutation testing is the procedure of applying a series of operators on correctly functioning programs so as to induce ‘‘faults’’ that correspond to real, common programming errors and then assess the ability of a set of test cases to reveal those errors. We introduce a novel approach for identifying and correcting faults in Java source code with the use of code slicing, mutation testing and Genetic Algorithms. Three different categories of experiments are used to assess the effectiveness of the proposed solution, demonstrating its applicability on a variety of programs and type of errors. The results are quite encouraging suggesting that the approach is able to dynamically detect faults and propose the appropriate corrections.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:-XtG2q47PdUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Specification-based automated gui testing",
            "Publication year": 2011,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3834",
            "Abstract": "GUI testing is currently one of the most expensive and time consuming processes in the software life-cycle and according to some estimates this cost can reach up to 50 to 70% of the whole cost of the project. This paper proposes a framework for specification-based automated GUI testing which employs a GUI analyzer for dynamic analysis and extraction of GUI object information, a system for automatic test case generation driven by Spec#, a test-case execution algorithm that executes test-cases automatically and a verifier that compares the expected with the actual result of the test. Preliminary experimental results demonstrate the efficiency and effectiveness of the framework.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:m8MyhXdlT-4C",
            "Publisher": "ICEIS"
        },
        {
            "Title": "A hybrid software cost estimation approach utilizing decision trees and fuzzy logic",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218194012500106",
            "Abstract": "Software cost estimation (SCE) is one of the critical activities in software project management. During the past decades various models have been proposed for SCE. However, developing accurate and useful models is limited in practice despite the considerable financial gain they could offer to software stakeholders. Traditional techniques, such as regression, by-analogy and machine learning, face the difficulty of handling the dynamic nature of the software process and the problematic nature of the public data available. This paper addresses the issue of SCE proposing an alternative approach that combines robust decision tree structures with fuzzy logic. Fuzzy decision trees are generated using the CHAID and CART algorithms in a systematic manner, while development effort is treated as the dependent variable against two subsets of factors: The first contains selected attributes from the ISBSG, COCOMO and …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:NhqRSupF_l8C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "WAQE: a web application quality evaluation model",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2007.011529",
            "Abstract": "Developing and maintaining web applications that have high quality demands the provision of certain assessment and monitoring mechanisms to afford such a success. Continuous evaluation of the web applications to check if they meet functional and non-functional requirements, as well as the organisational goals, necessitates the use of quality evaluation models in a fast-changing environment. This paper proposes an efficient web application quality evaluation model that is based on two axons: internal (within the organisation) and external (the users). The model places emphasis on quality issues as defined by ISO 9126 and other web quality factors and utilises importance-based criteria for evaluating requirements. Finally, the applicability and efficiency of the model are demonstrated through the evaluation of two different types of web applications.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:roLk4NBRz8UC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "An evolutionary methodology to eliminate the limit cycle phenomenon in fcm-based models",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1684632/",
            "Abstract": "This paper presents the dynamic behaviour of a hybrid system comprising fuzzy cognitive maps (FCM) and genetic algorithms, and focuses on the behaviour of the former under equilibrium at fixed points or limit cycle. More specifically, the theoretical background of both the equilibrium and limit cycle behaviours is examined and a new methodology for eliminating the limit cycle phenomenon is proposed. An evolutionary algorithm is designed based on the correction of the weight matrix, the origin of which is responsible for the creation of the limit cycle phenomenon. The system traces the presence of a limit cycle or chaotic behaviour and then searches the weight matrix using evolutionary techniques to identify which weight or group of weights are responsible for the cause of the limit cycle. This process continues until the system reaches equilibrium, a state which is necessary for the execution of simulations and the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measuring Relative Military Security",
            "Publication year": 2003,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/78660",
            "Abstract": ". This paper aims at attracting the reader’s attention to certain important issues, which may contribute to drawing a number of conclusions regarding the usefulness or otherwise of the Integrated Defence Space doctrine, in view of the latest developments concerning the relations of the three countries involved, namely Greece, Cyprus and Turkey.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:QxlgOPrhsAcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multipurpose health care telemedicine system",
            "Publication year": 2001,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13834",
            "Abstract": "In this study we present a multipurpose health care telemedicine system, which can be used for emergency or patient monitoring cases. Ambulances, Rural Health Centers (RHC) or other remote health location, Ships navigating in wide seas and Airplanes in flight are common examples of possible emergency sites, while critical care telemetry and telemedicine home follow-ups are important issues of patient monitoring. The telemedicine system is a combined real-time and store and forward facility that consists of a base unit and a telemedicine (mobile) unit. The telemedicine unit (patient site) allows the transmission of vital biosignals (3-12 lead ECG, SPO2, NIBP, IBP, Temp) and still images of the patient from the incident place to the base unit (consultation site). The transmission is performed through GSM, Satellite links or POTS. Using this device a specialist doctor can telematically \"move\" to the patient site and instruct medical personnel when handling a patient. The consultation site is equipped with a multimedia database able to store and manage the data collected by the system. The system was validated in four different countries using a standardized medical protocol.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:SZzxPo9m4nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classification and Prediction of Software Cost through Fuzzy Decision Trees",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-01347-8_20",
            "Abstract": "This work addresses the issue of software effort prediction via fuzzy decision trees generated using historical project data samples. Moreover, the effect that various numerical and nominal project characteristics used as predictors have on software development effort is investigated utilizing the classification rules extracted. The approach attempts to classify successfully past project data into homogeneous clusters to provide accurate and reliable cost estimates within each cluster. CHAID and CART algorithms are applied on approximately 1000 project cost data records which were analyzed, pre-processed and used for generating fuzzy decision tree instances, followed by an evaluation method assessing prediction accuracy achieved by the classification rules produced. Even though the experimentation follows a heuristic approach, the trees built were found to fit the data properly, while the predicted effort …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "An effective resource management approach in a FaaS environment.",
            "Publication year": 2018,
            "Publication url": "http://ceur-ws.org/Vol-2330/paper1.pdf?utm_campaign=Up%20%26%20Running%20Weekly&utm_medium=email&utm_source=Revue%20newsletter",
            "Abstract": "Serverless computing introduces a new Cloud service which consist an increasingly popular architecture for building distributed applications. This paper investigates and proposes a new resource management approach in a FaaS platform, based on intelligent techniques. A number of experiments applied through an indicative framework consisting of a client application and a Lambda function. Three Genetic Algorithms were employed to deliver optimal solutions in a multiobjective environment.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:tswL-GKFg8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introducing a process framework for implementing models of large‐scale real‐world systems in software",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/spip.202",
            "Abstract": "The analysis and modeling of difficult, complex systems of the real world is nowadays feasible because of major advances in the computer science field and in mathematical models and theories that provide a reliable study framework of nonlinear, nondeterministic behavior in nature and society. The development of software products for the study of this behavior is growing fast, aiming at completing the required scientific framework and at providing a computationally powerful environment. A software process for modeling such large‐scale, complex systems is proposed and analyzed in the present work, and a consistent methodology is described through a series of steps for handling the peculiarities and difficulties observed in these systems. The proposed framework is demonstrated through modeling and software implementation of a system that serves as a predictor of the Greek currency market. The …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:RHpTSmoSYBkC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "A requirements engineering methodology based on natural language syntax and semantics",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1531080/",
            "Abstract": "The present paper proposes a methodology for engineering requirements in a precise, comprehensive, understandable and time-saving way based on concepts and principles of natural language syntax and semantics (NLSS). The NLSS methodology copes with the following phases: (i) requirements discovery, by emphasizing on the creation and application of specific questions sets; (ii) requirements analysis, by stressing issues such as classification, decomposition and terminology of requirements; and (iii) requirements specification, by focusing on the writing formalization of the requirements.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cloud adoption decision support model using influence diagrams",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_16",
            "Abstract": "Cloud Computing has become nowadays a significant field of Information and Communication Technology (ICT), and this has led many organizations moving their computing operations to the Cloud. Decision makers are facing strong challenges when assessing the feasibility of the adoption of Cloud Computing for their organizations. The decision to adopt Cloud services falls within the category of complex and difficult to model real-world problems. In this paper we propose an approach based on Influence Diagrams modeling, aiming to support the Cloud adoption decision process. The developed ID model combines a number of factors which were identified through litterature review and input received from field experts. The proposed approach is validated against four experimental cases, two realistic and two real-world, and its performance proved to be highly capable of estimating and predicting …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automatic Search-based Testing with the Required k-tuples Criterion.",
            "Publication year": 2010,
            "Publication url": "https://www.scitepress.org/papers/2010/29023/29023.pdf",
            "Abstract": "This paper examines the use of data flow criteria in software testing and uses evolutionary algorithms to automate the generation of test data with respect to the required k-tuples criterion. The proposed approach is incorporated into an existing test data generation framework consisting of a program analyzer and a test data generator. The former analyses JAVA programs, creates control and data flow graphs, generates paths in relation to data flow dependencies, simulates test cases execution and determines code coverage on the control flow graphs. The test data generator takes advantage of the program analyzer capabilities and generates test cases by utilizing a series of genetic algorithms. The performance of the framework is compared to similar methods and evaluated using both standard and randomly generated JAVA programs. The preliminary results demonstrate the efficacy and efficiency of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:olpn-zPbct0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A requirements engineering methodology based on natural language syntax and semantics",
            "Publication year": 2005,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13818",
            "Abstract": "The present paper proposes a methodology for engineering requirements in a precise, comprehensive, understandable and time-saving way based on concepts and principles of Natural Language Syntax and Semantics (NLSS). The NLSS methodology copes with the following phases: (i) requirements discovery, by emphasizing on the creation and application of specific questions sets; (ii) requirements analysis, by stressing issues such as classification, decomposition and terminology of requirements; and (Hi) requirements specification, by focusing on the writing formalization of the requirements. © 2005 IEEE.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:yRRszJvrVdAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cost Modeling and Estimation in Agile Software Development Environments using Influence Diagrams.",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/Papers/2011/35539/35539.pdf",
            "Abstract": "Software development according to agile principles seeks to promote adaptive processes, teamwork and collaboration throughout the life-cycle of a project. In contrast, traditional software development focuses on the various phases and activities of the life-cycle while seeking for repeatable, predictable processes to maximize productivity and quality. Additionally, project management in conventional development processes aims to plan and predict the future, whereas in agile development environments, aims to adapt according to any future change. In this paper we investigate, through modeling with Influence Diagrams, the benefit of switching from traditional software development to agile in terms of productivity, expected value and cost. Additionally, we examine how software costs might differentiate if traditional or agile development methodologies are followed. We explore the factors that contribute in successful software development and draw our main conclusions through hypothetical and real case scenarios recorded in agile surveys on Information Technology practices. One of our main conclusions includes verification of the need for a skillful manager and small development team to lead to successful agile projects.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:polMJLZb0X8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing the analysis phase of e-commerce systems development with human, social, cultural and organizational factors",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=7182709679976405406&hl=en&oi=scholarr",
            "Abstract": "E-commerce systems’ poor and incomplete design fail to meet users expectations and businesses goals. A major factor of failure of these systems is ignoring important requirements that result from human, cultural, social and organizational factors. The present work introduces a new Web engineering methodology for performing requirements elicitation through a model called SpiderWeb. This is a cross-relational structure comprised of three main axons: Country Characteristics, User Requirements and Application Domain. The purpose of this model is to provide a simple way for analysts to identify these requirements which otherwise could be missed or given little attention. Factors gathering is performed based on a certain form of ethnography analysis, which is conducted in a short-scale and time-preserving manner, considerating the importance of immediacy in deploying e-commerce applications. Two e …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Maximum entropy discrimination poisson regression for software reliability modeling",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7024109/",
            "Abstract": "Reliably predicting software defects is one of the most significant tasks in software engineering. Two of the major components of modern software reliability modeling approaches are: 1) extraction of salient features for software system representation, based on appropriately designed software metrics and 2) development of intricate regression models for count data, to allow effective software reliability data modeling and prediction. Surprisingly, research in the latter frontier of count data regression modeling has been rather limited. More specifically, a lack of simple and efficient algorithms for posterior computation has made the Bayesian approaches appear unattractive, and thus underdeveloped in the context of software reliability modeling. In this paper, we try to address these issues by introducing a novel Bayesian regression model for count data, based on the concept of max-margin data modeling, effected in the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:m03se8k-GH0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computational Intelligence in Software Cost Estimation: Evolving conditional sets of effort value ranges",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Andreou-8/publication/221786366_Computational_Intelligence_in_Software_Cost_Estimation_Evolving_Conditional_Sets_of_Effort_Value_Ranges/links/0912f50cd74e8cc5c1000000/Computational-Intelligence-in-Software-Cost-Estimation-Evolving-Conditional-Sets-of-Effort-Value-Ranges.pdf",
            "Abstract": "In the area of software engineering a critical task is to accurately estimate the overall project costs for the completion of a new software project and efficiently allocate the resources throughout the project schedule. The numerous software cost estimation approaches proposed are closely related to cost modeling and recognize the increasing need for successful project management, planning and accurate cost prediction. Cost estimators are continually faced with problems stemming from the dynamic nature of the project development process itself. Software development is considered an intractable procedure and inevitably depends highly on several complex factors (eg, specification of the system, technology shifting, communication, etc.). Normally, software cost estimates increase proportionally to development complexity rising, whereas it is especially hard to predict and manage the actual related costs. Even for well-structured and planned approaches to software development, cost estimates are still difficult to make and will probably concern project managers long before the problem is adequately solved. During a system’s life-cycle, one of the most important tasks is to effectively describe the necessary development activities and estimate the corresponding costs. This estimation, once successful, allows software engineers to optimize the development process, improve administration and control over the project resources, reduce the risks caused by contingencies and minimize project failures (Lederer & Prasad, 1992). Subsequently, a commonly investigated approach is to accurately estimate some of the fundamental characteristics related to …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:lSLTfruPkqcC",
            "Publisher": "INTECH Open Access Publisher"
        },
        {
            "Title": "skillsChain: A Decentralized Application That Uses Educational Robotics and Blockchain to Disrupt the Educational Process",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1274342",
            "Abstract": "Our epoch is continuously disrupted by the rapid technological advances in various scientific domains that aim to drive forward the Fourth Industrial Revolution. This disruption resulted in the introduction of fields that present advanced ways to train students as well as ways to secure the exchange of data and guarantee the integrity of those data. In this paper, a decentralized application (dApp), namely skillsChain, is introduced that utilizes Blockchain in educational robotics to securely track the development of students’ skills so as to be transferable beyond the confines of the academic world. This work outlines a state-of-the-art architecture in which educational robotics can directly execute transactions on a public ledger when certain requirements are met without the need of educators. In addition, it allows students to safely exchange their skills’ records with third parties. The proposed application was designed and deployed on a public distributed ledger and the final results present its efficacy.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:bNB6FdaCRgEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A neural network measurement of relative military security-The case of Greece and Cyprus",
            "Publication year": 2001,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13835",
            "Abstract": "This paper aims at introducing a relative security measure, applicable to evaluating the impact of arms races on the military security of allies. This measure is based on demographic criteria, which play a dominant role in a number of arms races involving military alliances. The case of Greece and Cyprus, on one hand, and Turkey on the other, is the one to which our relative security measure is applied and tested. Artificial neural networks were trained to forecast the future behaviour of relative security. The high forecasting performance permitted the application of alternative scenarios for predicting the impact of the Greek-Turkish arms race on the relative security of the Greek-Cypriot alliance.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:BzPC9jo9PWgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending and enhancing a basic program analysis system",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Andreou-8/publication/264859196_Extending_and_enhancing_a_basic_program_analysis_system/links/54d899090cf24647581acd74/Extending-and-enhancing-a-basic-program-analysis-system.pdf",
            "Abstract": "Many researchers have investigated the utilization of control flow graphs in various software engineering areas, such as software testing, program slicing, program analysis and debugging. In this paper, we extend our earlier work on a dedicated program analysis architecture and we describe a tool for automatic production of the control flow graph that offers some dedicated and practically useful features, such as vertices grouping that allows the visualization of large and complex programs, ergonomic code coverage visualization via the simulation of the program’s execution and enhanced user interaction.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software cost modelling and estimation using artificial neural networks enhanced by input sensitivity analysis",
            "Publication year": 2012,
            "Publication url": "http://www.jucs.org/jucs_18_14/software_cost_modelling_and/jucs_18_14_2041_2070_papatheocharous.pdf",
            "Abstract": "This paper addresses the issue of Software Cost Estimation (SCE) providing an alternative approach to modelling and prediction using Artificial Neural Networks (ANN) and Input Sensitivity Analysis (ISA). The overall aim is to identify and investigate the effect of the leading factors in SCE, through ISA. The factors identified decisively influence software effort in the models examined and their ability to provide sufficiently accurate SCEs is examined. ANN of variable topologies are trained to predict effort devoted to software development based on past (finished) projects recorded in two publicly available historical datasets. The main difference with relevant studies is that the proposed approach extracts the most influential cost drivers that describe best the effort devoted to development activities using the weights of the network connections. The approach is validated on known software cost data and the results …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Verlag der Technischen Universität Graz"
        },
        {
            "Title": "A Smart Product Co-design and Monitoring Framework Via Gamification and Complex Event Processing",
            "Publication year": 2019,
            "Publication url": "http://hephaestus.nup.ac.cy/handle/11728/11702",
            "Abstract": "In the traditional software development cycle, requirements gathering is considered the most critical phase. Getting the requirements right early has become a dogma in software engineering because the correction of erroneous or incomplete requirements in later software development phases becomes overly expensive. For product-service systems (PSS), this dogma and standard requirements engineering (RE) approaches are not appropriate because classical RE is considered concluded once a product service is delivered. This paper proposes a novel framework that enables the customer and the product engineer to co-design smart products by integrating three novel and advanced technologies to support: view-based modelling, visualization and monitoring, i.e., Product-Oriented Configuration Language (PoCL), gamification and Complex Event Processing (CEP), respectively. These create a “digital-twin” model of the connected ‘smart’ factory of the future. The framework is formally founded on the novel concept of manufacturing blueprints, which are formalized knowledge-intensive structures that provide the basis for actionable PSS and production “intelligence” and a move toward more fact-based manufacturing decisions. Implementation and validation of the proposed framework through real-life case studies are ongoing to validate the applicability, utility and efficacy of the proposed solutions.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:dYRx7efp7U0C",
            "Publisher": "ICEIS"
        },
        {
            "Title": "An effective resource management approach in a FaaS environment",
            "Publication year": 2018,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13712",
            "Abstract": "Serverless computing introduces a new Cloud service which consist an increasingly popular architecture for building distributed applications. This paper investigates and proposes a new resource management approach in a FaaS platform, based on intelligent techniques. A number of experiments applied through an indicative framework consisting of a client application and a Lambda function. Three Genetic Algorithms were employed to deliver optimal solutions in a multi-objective environment.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:YXeC4bxG7-IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Doing things right or doing the right things? Proposing a documentation scheme for small to medium enterprises",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.692.3507",
            "Abstract": "Coping with the initial and finest systems’ functionality and performance is indeed one of the major problems nowadays, due to the rapid increase and continuous change of customer demands. Hence, it is crucial to move on with a research analysis in an attempt to identify whether documentation, the most reliable source for preserving a software system’s quality over the years, is properly created, updated and used in Small to Medium Enterprises (SME) operating in small EU markets, focusing both on the development process and the maintenance activities. Henceforth, the main objective of this paper is to propose a minimum documentation set required to fulfil both the Software Engineering principles and the SME practical needs by comparing literature suggestions with empirical findings. In further support of our documentation set suggestion, we present and discuss the results of a small survey conducted in nine IT-oriented SME in Cyprus and Greece. 1",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:MbTKqoTs-1EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Cyprus puzzle and the Greek-Turkish arms race: forecasting developments using genetically evolved fuzzy cognitive maps",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10242690302931",
            "Abstract": "The scope of this paper is to forecast the extent to which a settlement of the Cyprus issue may be possible given the decisions taken during the Copenhagen EU summit. It aims, in addition, at investigating the possibilities of improvement in Greek-Turkish relations which may lead, in turn, to reducing the arms race between the two countries. The paper uses a Genetically Evolved Certainty Neuron Fuzzy Cognitive Map algorithm to consider a number of scenarios examining the possible reactions of all sides involved in the Cyprus issue, namely Greece, Turkey, Cyprus, the Turkish-Cypriot community and the international environment. All simulation exercises suggest that the Greek and the Cypriot side should not necessarily rely on the decisions taken during the Copenhagen summit conference. The forecasts point out, in addition, that the optimism of the Greek government concerning the outlook of its relations with …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Automatic, evolutionary test data generation for dynamic software testing",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121208000101",
            "Abstract": "This paper proposes a dynamic test data generation framework based on genetic algorithms. The framework houses a Program Analyser and a Test Case Generator, which intercommunicate to automatically generate test cases. The Program Analyser extracts statements and variables, isolates code paths and creates control flow graphs. The Test Case Generator utilises two optimisation algorithms, the Batch-Optimistic (BO) and the Close-Up (CU), and produces a near to optimum set of test cases with respect to the edge/condition coverage criterion. The efficacy of the proposed approach is assessed on a number of programs and the empirical results indicate that its performance is significantly better compared to existing dynamic test data generation methods.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Selected papers from the 9th IFIP international conference on artificial intelligence applications and innovations (AIAI 2013)",
            "Publication year": 2014,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/9591",
            "Abstract": "Segmentation of electronic dance music Tim Scarfe, Wouter M Koolen and Yuri Kalnishkan Adaptive evolutionary algorithm for a multi-objective VRP Andreas Konstantinidis, Savvas Pericleous and Christoforos Charalambos Unsupervised clustering and multi-optima evolutionary search Vassilis P Plagianakos Applying hard and fuzzy K-modes clustering for dynamic web recommendations Panayiotis Christodoulou, Marios Lestas and Andreas S Andreou A fuzzy cognitive map system to explore the repercussions of Greek PSI and bank recapitalization on the Cyprus economy Maria Papaioannou, Costas K Neocleous, Charalambos Papageorgiou and Christos N Schizas Fusion and gene and imaging information enhances derivation of robust composite disgnostic biomarkers in the case of melanoma Ioannis Valavanis, Ilias Maglogiannis and Aristotelis Chatziioannou Classification of osteoporosis clinical data using genetic clustering George C Anastassopoulos, Adam Adamopoulos, Georgios Drosos, Konstantinos Kazakos and Harris Papadopoulos Computational intelligence modeling and assessment of industrial noise: the case of wood manufacturing Vasiliki Dimou, Lazaros S Iliadis and Ilias Bougoudis",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:N5XbD978G_MC",
            "Publisher": "CRL Publishing"
        },
        {
            "Title": "A variational recurrent neural network for session-based recommendations using bayesian personalized ranking",
            "Publication year": 2017,
            "Publication url": "https://aisel.aisnet.org/isd2014/proceedings2017/CogScience/1/",
            "Abstract": "This work introduces VRNN-BPR, a novel deep learning model, which is utilized in session-based Recommender systems tackling the data sparsity problem. The proposed model combines a Recurrent Neural Network with an amortized variational inference setup (AVI) and a Bayesian Personalized Ranking in order to produce predictions on sequence-based data and generate recommendations. The model is assessed using a large real-world dataset and the results demonstrate its superiority over current state-of-the-art techniques.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:pk6FPx6l9xIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artificial Intelligence Applications and Innovations: 9th IFIPWG 12.5 International Conference, AIAI 2013 Paphos, Cyprus, September 30-October 2, 2013 Proceedings",
            "Publication year": 2013,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/9798",
            "Abstract": "Artificial Intelligence Applications and Innovations: 9th IFIPWG 12.5 International Conference, AIAI \n2013 Paphos, Cyprus, September 30 - October 2, 2013 Proceedings | Ktisis Cyprus University of \nTechnology Skip navigation Ktisis Tepak Home Collections Research Outputs Researchers Faculty \n& Departments Theses Patents Projects Journals Conferences Explore by Research Outputs \nResearchers Faculty & Departments Theses Patents Projects Journals Conferences Language \nΕλληνικά English Sign on to: Login Receive email updates Edit Account details 1.Ktisis Cyprus \nUniversity of Technology 2.Cyprus University of Technology (Research Output) 3.Βιβλία/Books \nPlease use this identifier to cite or link to this item: https://ktisis.cut.ac.cy/handle/10488/9798 \nTitle: Artificial Intelligence Applications and Innovations: 9th IFIPWG 12.5 International \nConference, AIAI 2013 Paphos, Cyprus, September 30 - October 2, 2013 /…",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:HKuYlFsi-qEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Intelligent information systems for defence problems",
            "Publication year": 2003,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/38637",
            "Abstract": "The purpose of this book is to provide such a platform or framework that will describe the Cyprus problem as a major issue affecting the relations between Greece and Turkey and the arms race between the two countries. It is very important to point out, however, that solving the Cyprus issue is not exactly a prerequisite for settling all disputes between Greece and Turkey. The Greek-Turkish relations and the Cyprus problem must be regarded as being two very important, however entirely distinct issues. It goes without saying, however, that a mutually acceptable solution to the latter will contribute to the improvement of the former to a large extent. Going back to the construction of our platform, what we have decided to do is to resort to the help of mathematics, always bearing in mind that they can be a useful servant, however a very bad master. In other words we have applied a number of mathematical techniques that have contributed just to the point at which the key determinants in this conflict are underlined thus offering a clear description of the relations between the two sides with emphasis on the issue of Cyprus. The picture thus obtained is then used for suggesting answers on a number of key questions, much more effectively, we believe, compared to the results of any panel discussion. In any case, however, the responsibility of the final decision concerning policies employed on such complicated issues certainly burdens the politicians’ shoulders. As far as we are concerned, we will be happy to know that the conclusions reached in this book are taken in consideration during the decision-making process in the interest of peace. After all, it is only …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:irE4lMk4wWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approaching Software Cost Estimation Using an Entropy-Based Fuzzy k-Modes Clustering Algorithm.",
            "Publication year": 2009,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.156.975&rep=rep1&type=pdf",
            "Abstract": "A new software cost estimation approach is proposed in this paper, which attempts to cluster empirical, non-homogenous project data samples via an entropy-based fuzzy k-modes clustering algorithm. The target is to identify groups of projects sharing similar characteristics in terms of cost attributes or descriptors, and utilise this grouping information to provide estimations of the effort needed for a new project that is classified in a certain group. The effort estimates produced address the uncertainty and fuzziness of the clustering process by yielding interval predictions based on the mean and standard deviation of the samples having strong membership within a cluster. Empirical validation of the proposed methodology was conducted using a filtered version of the ISBSG dataset and yielded encouraging results both in terms of practical usage of the clustered groups and of approximating effectively project costs.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid software component clustering and retrieval scheme using an entropy-based fuzzy k-modes algorithm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410284/",
            "Abstract": "Modern software development is currently seeking new paths to improve quality and meet time and cost constraints. Reuse of existing software components is considered one of these paths. However, this process experiences significant problems related to efficiently maintaining component repositories, and, moreover, providing the means to discover and retrieve the most suitable ones. This paper aims to provide a methodology to improve the component-based software development process. Specifically, its objective is to introduce an approach that reduces the time to locate suitable software components. The suggested methodology meets the requirements for the efficient searching of components in repositories and also addresses the need for adequate retrieval of the most suitable software components based on the needs of developers. To achieve this we employ a combination of partitional clustering …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software Effort Estimation with Ridge Regression and Evolutionary Attribute Selection",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1012.5754",
            "Abstract": "Software cost estimation is one of the prerequisite managerial activities carried out at the software development initiation stages and also repeated throughout the whole software life-cycle so that amendments to the total cost are made. In software cost estimation typically, a selection of project attributes is employed to produce effort estimations of the expected human resources to deliver a software product. However, choosing the appropriate project cost drivers in each case requires a lot of experience and knowledge on behalf of the project manager which can only be obtained through years of software engineering practice. A number of studies indicate that popular methods applied in the literature for software cost estimation, such as linear regression, are not robust enough and do not yield accurate predictions. Recently the dual variables Ridge Regression (RR) technique has been used for effort estimation yielding promising results. In this work we show that results may be further improved if an AI method is used to automatically select appropriate project cost drivers (inputs) for the technique. We propose a hybrid approach combining RR with a Genetic Algorithm, the latter evolving the subset of attributes for approximating effort more accurately. The proposed hybrid cost model has been applied on a widely known high-dimensional dataset of software project samples and the results obtained show that accuracy may be increased if redundant attributes are eliminated.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy Influence Diagrams: an alternative approach to decision making under uncertainty",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1631242/",
            "Abstract": "This paper proposes a strategic management methodology using influence diagrams to represent and model decision problems. While decision trees have been extensively used for this purpose and are still highly useful, fuzzy influence diagrams, a new representation for decision problems, outperform them in many respects. This paper describes influence diagrams, proposes their extension via fuzzy logic and demonstrates their use in crisis management and decision making. Simulation experiments using the proposed fuzzy influence diagrams indicate specific conditions and constraints that enable political analysts and decision makers to set targets and plan their actions on a prediction basis",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The development of a quality e-learning environment based on human, social, and cultural factors",
            "Publication year": 2004,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13827",
            "Abstract": "A methodology called MATHISI, for developing a quality e-learning environment based on human, social and cultural factors is presented. The three axons on which it is based are the country characteristics in which it will be implemented, the user requirements, and the application domain axon. MATHISI follows a quality development approach based on the general software quality standards as defined by the ISO 9126 and the Web engineering guidelines. The methodology incorporates learning processes and templates for developing a dynamic e-learning environment, a requirements analyzer tool to identify new user requirements and several other features.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:X41XOdD1uaEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multilayer fuzzy cognitive maps approach to the cloud adoption decision support problem",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7338056/",
            "Abstract": "As modern computing relies more and more on distributed solutions of services and resources over the cloud, the need of potential users to assess whether the transition from traditional software systems to the cloud would be to their benefit becomes even greater. Cloud vendors also seek ways to study beforehand the behavior of potential users with respect to their decision to adopt the cloud environment so as to take actions towards enhancing the positive side. Therefore, the study of the parameters forming the environment behind the cloud adoption decision is of paramount importance to both users and vendors. In this context the present paper proposes a multi-layer FCM approach which models a number of factors which play a decisive role to the cloud adoption issue and offers the means to study their influence. The factors are organized in different layers which focus on specific aspects of the cloud …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:xyzrkeHX5M4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Financial versus human Resources in the Greek-Turkish Arms Race 10 Years on: A forecasting Investigation using Artificial Neural Networks",
            "Publication year": 2010,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/38408",
            "Abstract": "This paper looks into the Greek–Turkish arms race a decade after an earlier contribution to the issue that relied heavily on artificial neural networks. The time period between the two papers contributes to the reliability of the results derived, not just by increasing the number of observations, but also mainly by incorporating the progress made in the realm of artificial intelligence. The focus on the case of both countries unlike the paper mentioned above that dealt with just the Greek side provides ample room for comparative purposes regarding the determinants of defense expenditure on both sides. The results derived in terms of input significance estimation support the findings of the earlier research as indicated above, pointing to the leading role of the demographic preponderance of Turkey over Greece.  The paper also points to the fact that 10 years later, Turkey continues to set the arms race rules against its rival by determining the defense expenditure of Greece, whereas the role of the latter in affecting the military spending of Turkey is non-existent.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:csTP5AdqY_wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Patterns for use case context and content",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38977-1_18",
            "Abstract": "Patterns are well-proven solutions to common problems. They can increase the quality of a model, reduce the time to identify and specify requirements, and diminish redundancies, inconsistencies and omissions. Use case modeling is a very popular way of describing requirements. However, very limited work is done on uniting the concepts of patterns and use cases. This paper presents an attempt to provide a thorough set of use case patterns for both the context and the content of a use case. Furthermore, to ensure well-formedness and accuracy, the patterns are written in EBNF and tested in ANTLR.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Creating and Manipulating Control Flow Graphs with Multilevel Grouping and Code Coverage.",
            "Publication year": 2006,
            "Publication url": "https://www.scitepress.org/papers/2006/24488/24488.pdf",
            "Abstract": "Various researchers and practitioners have proposed the use of control flow graphs for investigating software engineering aspects, such as testing, slicing, program analysis and debugging. However, the relevant software applications support only low level languages (eg C, C++) and most, if not all, of the research papers do not provide information or any facts showing the tool implementation for the control flow graph, leaving it to the reader to imagine either that the author is using third party software for creating the graph, or that the graph is constructed manually (by hand). In this paper, we extend our previous work on a dedicated program analysis architecture and we describe a tool for automatic production of the control flow graph that offers advanced capabilities, such as vertices grouping, code coverage and enhanced user interaction.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:8EvVLpklxGMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolving conditional value sets of cost factors for estimating software development effort",
            "Publication year": 2007,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13805",
            "Abstract": "The software cost estimation process is one of the most critical managerial activities related to project planning, resource allocation and control. As software development is a highly dynamic procedure, the difficulty of providing accurate cost estimations tends to increase with development complexity. The inherent problems of the estimation process stem from its dependence on several complex variables, whose values are often imprecise, unknown, or incomplete, and their interrelationships are not easy to comprehend. Current software cost estimation models do not inspire enough confidence and accuracy with their predictions. This is mainly due to the models' sensitivity to project data values, and this problem is amplified because of the vast variances found in historical project attribute data. This paper aspires to provide a framework for evolving value ranges for cost attributes and attaining mean effort values using the AI-oriented problem-solving approach of genetic algorithms, with a twofold aim. Firstly, to provide effort estimations by analogy to the projects classified in the evolved ranges and secondly, to identify any present correlations between effort and cost attributes. © 2007 IEEE.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:7xtfDMUJqJkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Promoting software quality through a human, social and organisational requirements elicitation process",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1007/s00766-003-0176-y",
            "Abstract": "Human, social and organisational (HSO) factors play a decisive role in software development in terms of determining functional and non-functional characteristics of software products. The significance of these factors is underlined by the need to produce applications that fit nicely in a working setting, supporting the working procedures followed and promoting users' content and productivity. In this context, a new requirements elicitation process is proposed, a part of which utilises a short-scale ethnography analysis. The process introduces specific steps for recording HSO factors based on certain software quality characteristics that are treated as principal components for conducting requirements identification. The output of the process is the HSO document, which can be used in conjunction with the classic requirements document to identify structural and functional aspects of the system.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer London"
        },
        {
            "Title": "A Specifications-Based Mutation Engine for Testing Programs in C#",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Andreou-8/publication/264859373_A_Specifications-Based_Mutation_Engine_for_Testing_Programs_in_C/links/54d899090cf24647581acd72/A-Specifications-Based-Mutation-Engine-for-Testing-Programs-in-C.pdf",
            "Abstract": "This paper presents a simple and efficient engine which produces mutations of source code written in C#. The novelty of this engine is that it produces mutations that do not contradict with the specifications of the program. The latter are described by a set of pre-and post-conditions and invariants. The engine comprises two parts, a static analysis and syntactic verification component and a mutation generation component. Preliminary experiments showed that the proposed engine is more efficient than a simple mutations generator in terms of producing only valid mutations according to the specifications posed, thus saving time and effort during testing activities.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Testing Object-Oriented Code Through a Specifications-Based Mutation Engine",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.362.689&rep=rep1&type=pdf#page=46",
            "Abstract": "This paper presents a simple, yet efficient and effective mutation engine that can produce mutations of objectoriented source code written in the C# and Visual Basic languages as an extension of previous work on the topic [1]. The engine produces mutants based on user selected mutation operators the number of which is bounded by the specifications declared in the source code with the aid of Code Contracts. The specifications are described using a set of pre-and postconditions and invariants. The engine consists of four distinct and integrated components; a syntactic verification component, a static analysis component, a mutation generation component, and a test case quality assessment component. A series of experiments are conducted which show that the proposed engine is able to locate a fault and efficiently propose the proper correction. In addition, the scalability of the proposed approach is assessed in terms of time and performance with respect to different program sizes.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Preserving quality in the development of mobile commerce services and applications",
            "Publication year": 2005,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13764",
            "Abstract": "Mobile commerce is nowadays a continuously growing area, driving the need for advances in both the network characteristics and infrastructure, as well as in the available mobile devices used. The same need requires the development of quality software applications to facilitate and service m-commerce activities. This paper focuses on aspects of software quality for m-commerce services and applications, and proposes a set of quality characteristics and attributes to take into consideration during development. These quality characteristics are integrated during the analysis and engineering phases of the MobE process, which is a revised version of the spiral software process used in web engineering. The efficacy of the proposed approach in a real scenario is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:YIdQ7BAI8VoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Migration to and Synthesis of (Micro-) services: The Use of Intelligent Techniques",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73203-5_4",
            "Abstract": "This chapter investigates the use of Computational Intelligence (CI) to tackle two challenges in the area of services. The first is involved with providing efficient decision support for migrating from monolithic to service-oriented software, while the latter addresses automatic service composition, which is a special form of service migration. Migration to service-oriented architecture (SOA) is influenced by a number of different and intertwined factors. These factors are identified through literature review and expert consultation. Different CI models, such as Fuzzy Influence Diagrams and Fuzzy Cognitive Maps, are employed to organize the factors and study their behavior. Various simulations are conducted that enable decision makers to execute what-if scenarios and take informed decisions as to whether to migrate or not to SOA, as well as to study the decisive factors contributing in favor or against this migration. Service …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:9w-KRoa3VEQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Size and Effort-Based Computational Models for Software Cost Prediction.",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/Papers/2008/17088/17088.pdf",
            "Abstract": "Reliable and accurate software cost estimations have always been a challenge especially for people involved in project resource management. The challenge is amplified due to the high level of complexity and uniqueness of the software process. The majority of estimation methods proposed fail to produce successful cost forecasting and neither resolve to explicit, measurable and concise set of factors affecting productivity. Throughout the software cost estimation literature software size is usually proposed as one of the most important attributes affecting effort and is used to build cost models. This paper aspires to provide size and effort-based estimations for the required software effort of new projects based on data obtained from past completed projects. The modelling approach utilises Artificial Neural Networks (ANN) with a random sliding window input and output method using holdout samples and moreover, a Genetic Algorithm (GA) undertakes to evolve the inputs and internal hidden architectures and to reduce the Mean Relative Error (MRE). The obtained optimal ANN topologies and input and output methods for each dataset are presented, discussed and compared with a classic MLR model.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:Ef4XXjhdXvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software Cost Estimation using Fuzzy Decision Trees",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4639344/",
            "Abstract": "This paper addresses the issue of software cost estimation through fuzzy decision trees, aiming at acquiring accurate and reliable effort estimates for project resource allocation and control. Two algorithms, namely CHAID and CART, are applied on empirical software cost data recorded in the ISBSG repository. Approximately 1000 project data records are selected for analysis and experimentation, with fuzzy decision trees instances being generated and evaluated based on prediction accuracy. The set of association rules extracted is used for providing mean effort value ranges. The experimental results suggest that the proposed approach may provide accurate cost predictions in terms of effort. In addition, there is strong evidence that the fuzzy transformation of cost drivers contribute to enhancing the estimation process.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart shop-floor monitoring via manufacturing blueprints and complex-event processing",
            "Publication year": 2019,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/19081",
            "Abstract": "Nowadays, Product-Service-Systems (PSS) are being modernized into smart connected products that target to transform the industrial scenery and unlock unique prospects. This concept enforces a new technological heap and lifecycle models to support smart connected products. The intelligence that smart, connected products embed paves the way for more sophisticated data gathering and analytics capabilities ushering in tandem a new era of smarter supply and production chains, smarter production processes, and even end-to-end connected manufacturing ecosystems. The main contribution of this paper is a smart shop-floor monitoring framework and underpinning technological solutions, which enables the proactive identification and resolution of shop-floor distributions. The proposed monitoring framework is based on the synergy between the novel concept of Manufacturing Blueprints and Complex Event Processing (CEP) technologies, while it encompasses a middleware layer that enables loose coupling and adaptation in practice. The framework provides the basis for actionable PSS and production “intelligence” and facilitates a shift toward more fact-based manufacturing decisions. Implementation and validation of the proposed framework is performed through a real-world case study which demonstrates its applicability, and assesses the usability and efficiency of the proposed solutions.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:9mnZQYLiiboC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crisis Management and Political Decision Making Using Genetically Evolved Fuzzy Cognitive Maps",
            "Publication year": 2003,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/51639",
            "Abstract": "This paper examines the use of Fuzzy Cognitive Maps (FCMs) as a technique for modeling political and crisis situations and supporting the decision-making process. FCMs use notions borrowed from artificial intelligence and neural networks to combine concepts and causal relationships, in the form of dynamic models that describe a given political setting. The present work proposes the use of the Genetically Evolved Certainty Neuron Fuzzy Cognitive Map (GECNFCM) as an extension of Certainty Neuron Fuzzy Cognitive Maps (CNFCMs) aiming at overcoming the main weaknesses of the latter, namely the recalculation of the weights corresponding to each concept every time a new strategy is adopted. This novel technique combines CNFCMs with Genetic Algorithms (GAs), the advantage of which lies with their ability to offer the optimal solution without a problem-solving strategy, once the requirements are defined. We demonstrate the value of such a hybrid technique in the context of a model reflecting the complexity of the Cyprus problem. The scenario analysis performed makes decision makers aware of political uncertainties, while multiple scenario analysis brings uncertainty into the decision process by combining it with different future states.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:cG0OFEevkNgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "John Capstaff, Krishna Paudyal and William Rees",
            "Publication year": 2001,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/46711",
            "Abstract": "John Capstaff, Krishna Paudyal and William Rees Toggle navigation English Ελληνικά English \nEnglish Ελληνικά Login Toggle navigation View Item Home Δημοσιεύσεις ΠΚ / UCY Publications \n005 Σχολή Οικονομικών Επιστημών και Διοίκησης / Faculty of Economics and Management \nΤμήμα Λογιστικής και Χρηματοοικονομικής / Department of Accounting and Finance View Item \nHome Δημοσιεύσεις ΠΚ / UCY Publications 005 Σχολή Οικονομικών Επιστημών και Διοίκησης \n/ Faculty of Economics and Management Τμήμα Λογιστικής και Χρηματοοικονομικής / \nDepartment of Accounting and Finance View Item Article John Capstaff, Krishna Paudyal and \nWilliam Rees Thumbnail Date 2001 Author ORCID logo Charitou, Andreas Clubb, Colin \nAndreou, Andreas Cheng, Peter Source Journal of Business Finance & Accounting Volume \n28 Google Scholar check Metadata Show full item record URI http://gnosis.library.ucy.ac.cy//7/…",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic generation of a Software Requirements Specification (SRS) document",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687039/",
            "Abstract": "The lack of a software tool to automate the creation of a well-defined, Natural Language Software Requirements Specification (SRS) document is an obstacle to the process of efficient Requirements Engineering (RE). This paper provides an overview of a methodology and a novel software tool that attempt to formalize and automate the RE process, and it expands on the use of the SRS Documentation component of the tool that generates automatically a well-structured Natural Language SRS document.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Preserving Quality in the Development of Mobile Commerce Services and Applications.",
            "Publication year": 2005,
            "Publication url": "http://www1.cs.ucy.ac.cy/~panic/papers/iasted05.pdf",
            "Abstract": "Mobile commerce is nowadays a continuously growing area, driving the need for advances in both the network characteristics and infrastructure, as well as in the available mobile devices used. The same need requires the development of quality software applications to facilitate and service m-commerce activities. This paper focuses on aspects of software quality for m-commerce services and applications, and proposes a set of quality characteristics and attributes to take into consideration during development. These quality characteristics are integrated during the analysis and engineering phases of the MobE process, which is a revised version of the spiral software process used in web engineering. The efficacy of the proposed approach in a real scenario is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Batch-optimistic test-cases generation using genetic algorithms",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410278/",
            "Abstract": "This paper proposes a dynamic software testing framework, which is able to analyse the source code of a program, create the necessary data structures for automatic testing, such as control flow graphs, and generate a near to optimum set of test cases with reference to a test coverage criterion. The framework consists of two sub-systems: the first is a program analysis system that identifies the type of statements and the complexity of conditions, performs analysis of variables, extracts code paths and creates the control flow graph (CFG) of the program under testing. The second is a test system that uses the CFG for automatically generating test data based on evolutionary computing. The latter system utilises a specially designed genetic algorithm to produce the set of test cases satisfying the selected coverage criterion. The efficacy and performance of the proposed testing approach is assessed and validated using a …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Symbolic Execution for Dynamic, Evolutionary Test Data Generation.",
            "Publication year": 2009,
            "Publication url": "https://www.scitepress.org/papers/2009/19927/19927.pdf",
            "Abstract": "This paper combines the advantages of symbolic execution with search based testing to produce automatically test data for JAVA programs. A framework is proposed comprising two systems which collaborate to generate test data. The first system is a program analyser capable of performing dynamic and static program analysis. The program analyser creates the control flow graph of the source code under testing and uses a symbolic transformation to simplify the graph and generate paths as independent control flow graphs. The second system is a test data generator that aims to create a set of test cases for covering each path. The implementation details of the framework, as well as the relevant experiments carried out on a number of JAVA programs are presented. The experimental results demonstrate the efficiency and efficacy of the framework and show that it can outperform the performance of related approaches.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Message from the ICTAI 2014 General Chair",
            "Publication year": 2014,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13725",
            "Abstract": "Presents the introductory welcome message from the conference proceedings. May include the conference officers' congratulations to all involved with the conference event and publication of the proceedings record.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:1Lk_dUza_R0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "DevOps-Based Software Engineering for the Cloud",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-63161-1_22",
            "Abstract": "This paper describes briefly DOSSIER-Cloud, an ongoing H2020 project called that implements a series of coordination and support actions, aiming at promoting research in the area of Software Engineering for Distributed Systems development. According to the call, two internationally recognized scientific groups from the Netherlands (University of Tilburg – UvT) and Italy (Politecnico di Milano – POLIMI) collaborate with the Cyprus University of Technology (CUT) to facilitate transfer of scientific knowledge and expertise, as well as of best research practices from UvT and POLIMI to CUT, and ultimately strengthen the research and scientific profile of the partners in the relevant area.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:vYYylRVofzEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A novel prototype tool for intelligent software project scheduling and staffing enhanced with personality factors",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6495057/",
            "Abstract": "Software project managers are often faced with challenges when trying to effectively staff and schedule projects. Incorrectly planning and estimating the execution of tasks frequently causes software projects to be delivered late and/or over budget, whereas not selecting the appropriate developers to carry out tasks may produce lower-quality, defective software products. To combat these challenges, this paper presents IntelliSPM -- a tool aiming to support software project management activities consisting of several optimization mechanisms borrowed from the area of Computational Intelligence. The tool takes into account technical aspects but also significant human factors, which have been found to play a crucial role in software quality and developer productivity. The purpose of IntelliSPM is to offer suggestions to project managers containing a set of possible project schedules and staffing strategies that minimizes …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hybrid prediction model integrating fuzzy cognitive Maps with Support vector machines",
            "Publication year": 2017,
            "Publication url": "https://www.scitepress.org/papers/2017/63294/63294.pdf",
            "Abstract": "This paper introduces a new hybrid prediction model combining Fuzzy Cognitive Maps (FCM) and Support Vector Machines (SVM) to increase accuracy. The proposed model first uses the FCM part to discover correlation patterns and interrelationships that exist between data variables and form a single latent variable. It then feeds this variable to the SVM part to improve prediction capabilities. The efficacy of the hybrid model is demonstrated through its application on two different problem domains. The experimental results show that the proposed model is better than the traditional SVM model and also outperforms other widely used supervised machine-learning techniques like Weighted k-NN, Linear Discrimination Analysis and Classification Trees.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:vPKCt-r_nWsC",
            "Publisher": "SciTePress"
        },
        {
            "Title": "Designing Quality Web Applications Using Web Patterns",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=12288618598567484626&hl=en&oi=scholarr",
            "Abstract": "Patterns are commonly utilized byWeb developers for reusability purposes. However, this paper shows howWeb patterns can also enhance the quality ofWeb applications. Firstly,Web quality is divided into five major components, namely usability, functionality, reliability, efficiency, and maintainability. Secondly, the relationship of these quality components with certain Wet patterns is demonstrated and a set of guidelines for designing quality Web applications using these patterns is proposed. A successful Web site is then used as a case-study to demonstrate the efficacy of the proposed guidelines. The Web patterns utilized by the site under study are identified and matched with the proposed list of patterns. Finally, we investigated how these patterns contribute to the success of the specific Web application.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a CBSE framework for enhancing software reuse: matching component properties using semi-formal specifications and ontologies",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-30243-0_6",
            "Abstract": "A novel Component-based Software Engineering (CBSE) framework is proposed in this work that focuses on enhancing the reuse process by offering support for locating appropriate components. The architecture of the framework comprises of five interrelated layers, namely Description, Location, Analysis, Recommendation and Build. The scope of this work is to describe in detail the first and third layers, and provide the means to evaluate the suitability of candidate software components for reuse. The overall aim is to facilitate components’ profiling and offer efficient matching of system and software requirements to increase the reusability potential of components. A specifications profile is created for each component using a semi-formal natural language that describes certain properties. A dedicated parser recognizes parts of the profile and translates them into instance values of a dedicated CBSE ontology …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:tFyepMjQr3wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "IFIP Advances in Information and Communication Technology: Preface",
            "Publication year": 2010,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13754",
            "Abstract": "IFIP Advances in Information and Communication Technology: Preface | Ktisis Cyprus \nUniversity of Technology Skip navigation Ktisis Tepak Home Collections Research Outputs \nResearchers Faculty & Departments Theses Patents Projects Journals Conferences Explore by \nResearch Outputs Researchers Faculty & Departments Theses Patents Projects Journals \nConferences Language Ελληνικά English Sign on to: Login Receive email updates Edit Account \ndetails 1.Ktisis Cyprus University of Technology 2.Cyprus University of Technology (Research \nOutput) 3.Δημοσιεύσεις σε συνέδρια /Conference papers or poster or presentation Please use \nthis identifier to cite or link to this item: https://ktisis.cut.ac.cy/handle/10488/13754 Title: IFIP \nAdvances in Information and Communication Technology: Preface Authors: Andreou, Andreas \nS. Papadopoulos, Harris Major Field of Science: Engineering and Technology Field : - - : -: , …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:54SpJiyHbzwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid software component clustering and retrieval scheme using an entropy-based fuzzy k-modes algorithm",
            "Publication year": 2007,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13801",
            "Abstract": "Modern software development is currently seeking new paths to improve quality and meet time and cost constraints. Reuse of existing software components is considered one of these paths. However, this process experiences significant problems related to efficiently maintaining component repositories, and, moreover, providing the means to discover and retrieve the most suitable ones. This paper aims to provide a methodology to improve the component-based software development process. Specifically, its objective is to introduce an approach that reduces the time to locate suitable software components. The suggested methodology meets the requirements for the efficient searching of components in repositories and also addresses the need for adequate retrieval of the most suitable software components based on the needs of developers. To achieve this we employ a combination of partitional clustering algorithms borrowed from the field of computational intelligence and fuzzy logic thus creating a subset of the available components that are most suitable to the developers' preferences. © 2007 IEEE.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:Sw8WaQuuSIgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic Localisation and Automatic Correction of Software Faults using Evolutionary Mutation Testing.",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/39920/39920.pdf",
            "Abstract": "Software testing has recently turned to more “sophisticated” techniques, like automatic, self-adaptive mutation testing, aiming at improving the effectiveness of the testing process and handling the associated complexity that increases the level of time and effort spent. Mutation testing refers to the application of mutation operators on correctly functioning programs so as to induce common programming errors and then assess the ability of a set of test cases to reveal them. In the above context the present paper introduces a novel methodology for identifying and correcting faults in Java source code using dynamic slicing coupled with mutation testing and enhanced by Genetic Algorithms. A series of experiments was conducted to assess the effectiveness of the proposed approach, using different types of errors and sample programs. The results were quite encouraging as regards the ability of the approach to localise the faults, as well as to suggest the appropriate correction (s) to eliminate them.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:UPMPWMAU16oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software Component Clustering and Retrieval: An Entropy-based Fuzzy k-Modes Methodology",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/43938157/Software_Component_Clustering_and_Retrie20160320-16842-whyv8m.pdf",
            "Abstract": "Component-based software engineering is a stepwise software development process that relies on integrating small, independent software pieces into one larger fully-functioning system. However, a delay in any of the steps may negatively affect a project’s schedule and, even worse, jeopardise its completion. Furthermore, given that the process is ultimately evaluation-oriented it is very difficult to find ways to accelerate certain stages in the process since developers are unwilling to compromise quality over time. Consequently, the only substantial means of reducing development time is to make components more easily and readily accessible to reusers in order to shorten the time taken for locating them. For this reason, component repositories have been introduced to store and organise software components. However, with an ever-increasing number of components, covering a wider variety of functionalities, there has been a parallel increase in the need for techniques to search and retrieve software components from repositories. Thus, the main motive of the research activity discussed in this chapter is to attempt to minimise the time necessary to discover any or all of the components to be reused in a component-based system by proposing an intelligent clustering methodology to aid the searching and retrieval of components stored in a repository.To date there has been a number of attempts for clustering and classifying software components for reuse which have lead to the formation of various techniques. Several of these rely on structuring a formal specification of software components using classification methods based on natural language …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:GnPB-g6toBAC",
            "Publisher": "INTECH Open Access Publisher"
        },
        {
            "Title": "Mandola: A big-data processing and visualization platform for monitoring and detecting online hate speech",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3371276",
            "Abstract": "In recent years, the increasing propagation of hate speech in online social networks and the need for effective counter-measures have drawn significant investment from social network companies and researchers. This has resulted in the development of many web platforms and mobile applications for reporting and monitoring online hate speech incidents. In this article, we present MANDOLA, a big-data processing system that monitors, detects, visualizes, and reports the spread and penetration of online hate-related speech using big-data approaches. MANDOLA consists of six individual components that intercommunicate to consume, process, store, and visualize statistical information regarding hate speech spread online. We also present a novel ensemble-based classification algorithm for hate speech detection that can significantly improve the performance of MANDOLA’s ability to detect hate speech. To …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:ECvNt0vk_34C",
            "Publisher": "ACM"
        },
        {
            "Title": "Investigating the Predictability of Empirical Software Failure Data with Artificial Neural Networks and Hybrid Models",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_61",
            "Abstract": "Software failure and software reliability are strongly related concepts. Introducing a model that would perform successful failure prediction could provide the means for achieving higher software reliability and quality. In this context, we have employed artificial neural networks and genetic algorithms to investigate whether software failure can be accurately modeled and forecasted based on empirical data of real systems.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A Three-Dimensional Requirements Elicitation and Management Decision-Making Scheme for the Development of New Software Components.",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.221.6241&rep=rep1&type=pdf#page=104",
            "Abstract": "Requirements analysis and general management issues within the development process of new software components are addressed in this paper, focusing on factors that result from requirements elicitation and significantly affect management decisions and development activities. A new methodology performing a certain form of requirements identification and collection prior to developing new software components is proposed and demonstrated, the essence of which lays on a three-entity model that describes the relationship between different types of component stakeholders: Developers, reusers and end-users. The model is supported by a set of critical factors analysed in the context of three main directions that orient the production of a new component, that is, the generality of the services offered, the management approach and the characteristics of the targeted market. The investigation of the three directions produces critical success factors that are closely connected and interdependent. Further analysis of the significance of each factor according to the priorities set by component developers can provide a detail picture of potential management implications during the development process and more importantly can support management decisions related to if and how development should proceed.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling and decision support of the mobile software development process using influence diagrams",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39259-7_21",
            "Abstract": "Mobile devices are increasingly becoming one of the most popular and common computing tools with mobile users relying on them for carrying out their everyday working, social and amusement activities. As a result, mobile software has gained the lion’s share in the software industry with millions of Dollars/Euros being spent for purchasing mobile applications worldwide. This paper investigates certain aspects of mobile software development through a promising decision making approach, namely Influence Diagrams (ID). Two key models are developed which aim to provide an answer to the questions, “should a developer proceed with producing a new mobile application?” and “what would be the estimated level of user acceptance for a new mobile application?”, respectively. The IDs are composed of a number of interrelated factors which were identified through literature review and input received from …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optimization in genetically evolved fuzzy cognitive maps supporting decision-making: the limit cycle case",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1307788/",
            "Abstract": "This paper proposes an extension of genetically evolved fuzzy cognitive maps (GEFCMs) aiming at increasing their reliability by overcoming its weakness appearing in cases of a limit cycle behavior. FCMs use notions borrowed from artificial intelligence and neural networks to combine concepts and causal relationships, aimed at creating dynamic models that describe a given cognitive setting. The activation level of the nodes participating in an FCM model can be calculated using specific updating equations in a series of iterations.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal versus required defence expenditure: The case of the Greek-Turkish arms race",
            "Publication year": 2002,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13833",
            "Abstract": "The aim of this paper is to indicate the extent to which the arms race against Turkey, in which Greece and Cyprus have been entangled, imposes a defence expenditure burden that is tough for the two allies to bear. To do so we have resorted to evaluating the optimal military expenditure for the two countries, allied in the context of the Integrated Defence Doctrine, which is compatible with the constraints imposed by the resources of their economies. All experiments and scenarios examined lead to the conclusion that the current defence burden of the two allies seems to be driving their economies beyond capacity limits. The fact remains, however, that under the circumstances, a one-sided disarmament policy like the one currently followed by Greece, is a risky choice given that the long-term armament programmes pursued by Turkey, whose role in this arms race has been proven as leading, leave very small room to the Greek and Cypriot sides to reduce their own defence expenditure.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:cAUKuAERoUMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nonlinear analysis and forecasting of a brackish karstic spring",
            "Publication year": 2000,
            "Publication url": "https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/1999WR900353",
            "Abstract": "Nonlinear methods and artificial neural network techniques are applied to the study of the regime and the possibility of short‐term forecasting of discharges of the spring of Almyros, Iraklion, Crete. Questions regarding the nonlinearity and chaotic characteristics of the system necessitate the examination of dynamical properties. Toward this objective the time series of daily average discharges is analyzed in detail. First, the dimensionality of the dynamics in the reconstructed phase space is found to be quite low, ∼3–4. Then several tests are applied to examine the nonlinearity and the presence of noise in the data. Using the surrogate time series test, a high degree of nonlinearity and a deterministic nature are revealed, while the differentiation test showed that the presence of high‐frequency noise in the series of the discharge is not dynamically important. These suggest that an attempt to forecast the short‐term future …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid fuzzy cognitive map modeller: a novel software tool for decision making",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-32391-0_89",
            "Abstract": "This paper presents the key concepts of an integrated software tool designed to contribute to the decision-making process in the field of crisis modelling and management. The tool relies on the use of Fuzzy Cognitive Maps (FCMs), which combine elements of fuzzy logic and neural networks to depict a cognitive scene of interacting concepts (nodes/levels) and their causal relationships (edges/weights). The proposed application provides the policy maker with the ability to input data from various domain experts in the form of activation levels and weight values, and to model the parameters of a certain environment. Simulations may then be performed and their results are presented and analysed for inference purposes and decision-making.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Software cost estimation using artificial neural networks with inputs selection.",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/52464476/Software_cost_estimation_using_artificia20170404-26487-txcyfd.pdf",
            "Abstract": "Software development is an intractable, multifaceted process encountering deep, inherent difficulties. Especially when trying to produce accurate and reliable software cost estimates, these difficulties are amplified due to the high level of complexity and uniqueness of the software process. This paper addresses the issue of estimating the cost of software development by identifying the need for countable entities that affect software cost and using them with artificial neural networks to establish a reliable estimation method. Input Sensitivity Analysis (ISA) is performed on predictive models of the Desharnais and ISBSG datasets aiming at identifying any correlation present between important cost parameters at the input level and development effort (output). The degree to which the input parameters define the evolution of effort is then investigated and the selected attributes are employed to establish accurate prediction of software cost in the early phases of the software development life-cycle.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:1DAnfT_YoJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Size-Based Software Cost Modelling with Artificial Neural Networks and Genetic Algorithms",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=UM2gDwAAQBAJ&oi=fnd&pg=PA167&dq=info:S1B9zSQpNxwJ:scholar.google.com&ots=BqY0ew-cOQ&sig=6HmT-XOQ39c4pQ80MJhI-RNnbHc",
            "Abstract": "Accurate software cost estimation has always been a major concern especially for people involved in project management, resource control and schedule planning. A high-quality and reliable development effort estimate could provide more efficient planning and control over the whole software process and guide a project to success. As literature shows many researchers proposed a plethora of methods and techniques to model the relationship between software size and the actual development costs (Jørgensen & Shepperd, 2007). However, the track record of IT projects shows that often a large number fails. Most IT experts agree that such failures occur more regularly than they should (Charette, 2005). According to the 10th edition of the annual CHAOS report from the Standish Group that studied over 40,000 projects in 10 years, it seems that success rates increased to 34% and failures declined to 15% of the projects. Even though success rates increased, still, 51% of the projects overrun time/budget, lack critical features and requirements and/or important quality requirements are compromised. Furthermore, average software costs are apparently overrun by 43%(Software Magazine, 2004). One of the main reasons for these figures is failure to estimate the actual effort required to develop a software project. A reliable software cost estimation model has always been a major challenge and demand for project managers at the initiation phase of the project and also an important asset for the whole process of software development. In addition, there is a large discussion on the discovery of the relationship between cost drivers and effort, especially …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-commerce engineering: A short vs long software process for the development of e-commerce applications",
            "Publication year": 2003,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13830",
            "Abstract": "The immediacy in developing e-commerce applications, the quality of the services offered by these systems band the need for continuous evolution are primary issues that must be fully analysed and understood prior and during the development process. In this context, the present work suggests a new development framework which aims at estimating the level of complexity a certain e-commerce system encompasses and driving the selection of a long or short software process in terms of time and effort. The proposed framework utilizes a special form of Business Process Re-engineering (BPR) to define and assess critical business and organizational factors within small-to-medium enterprises (SMEs) whishing to go ecommerce. This set of factors is enriched with other critical issues belonging to the quality requirements of the system and to the application type of services it aspires to offer. The set of critical factors identified is used to estimate the average complexity level of the system using numerical values to describe the contribution of each factor to the overall complexity. The level of complexity estimated dictates the adoption of either a short or a long version of the well-known WebE process for analysing, designing and implementing the e-commerce system required by an SME.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:vkDViGfkvYEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A review of the application of fuzzy cognitive maps in the policy decision-making life cycle",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/a-review-of-the-application-of-fuzzy-cognitive-maps-in-the-policy-decision-making-life-cycle/116660",
            "Abstract": "Fuzzy cognitive maps are a qualitative modeling technique that uses expert knowledge to attempt to represent the interactions between problem-specific factors aiming to simulate how these interactions alter the factors and drive the current state of a problem to a different state. Recent years have seen an increase in the number of research attempts that propose the adoption of Fuzzy cognitive maps (FCMs) as a means to forecast the effect of a policy in a number of interesting domains, including land use, urban (re) development, and other social, political, or economic issues or to simulate the current state of affairs to pinpoint possible hotspots for creating a policy. This chapter presents an overview of these research attempts where fuzzy cognitive maps have been employed as a simulation tool in order to support decision makers in their assessment of the impact of policies and help them adopt the most suitable …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:GO2DTSf4MZMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Artificial intelligence applications and innovations",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-16239-8.pdf",
            "Abstract": "The abundance of information and increase in computing power currently enable researchers to tackle highly complicated and challenging computational problems. Solutions to such problems are now feasible using advances and innovations from the area of Artificial Intelligence. The general focus of the AIAI conference is to provide insights on how Artificial Intelligence may be applied in real-world situations and serve the study, analysis and modeling of theoretical and practical issues. This volume contains papers selected for presentation at the 6th IFIP Conference on Artificial Intelligence Applications and Innovations (AIAI 2010) and held in Larnaca, Cyprus, during October 6–7, 2010. IFIP AIAI 2010 was co-organized by the University of Cyprus and the Cyprus University of Technology and was sponsored by the Cyprus University of Technology, Frederick University and the Cyprus Tourism Organization. AIAI …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Recurrent latent variable networks for session-based recommendation",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3125486.3125493",
            "Abstract": "In this work, we attempt to ameliorate the impact of data sparsity in the context of session-based recommendation. Specifically, we seek to devise a machine learning mechanism capable of extracting subtle and complex underlying temporal dynamics in the observed session data, so as to inform the recommendation algorithm. To this end, we improve upon systems that utilize deep learning techniques with recurrently connected units; we do so by adopting concepts from the field of Bayesian statistics, namely variational inference. Our proposed approach consists in treating the network recurrent units as stochastic latent variables with a prior distribution imposed over them. On this basis, we proceed to infer corresponding posteriors; these can be used for prediction and recommendation generation, in a way that accounts for the uncertainty in the available sparse training data. To allow for our approach to easily scale …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:wyCGhLAOp5UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Adequacy of Accounting Mandatory Disclosures: A Field Study in Cyprus",
            "Publication year": 2019,
            "Publication url": "https://core.ac.uk/download/pdf/229470669.pdf",
            "Abstract": "Objectives: This research attempts to explore professional accountants and investors’ perceptions on the adequacy of the quality and quantity of current accounting mandatory disclosure, within the Cyprus environment. Prior work: Listed companies from different countries have divergent disclosure policies and regulations which create challenges. On the one hand, professional accountants find difficulties in the auditing and reporting process, while on the other hand investors are struggling to comprehend and compare annual reports. Approach: This study is mainly based on a mixed method approach, and involves gathering data from a group of specialists in the accounting field and a group of investors in the Cypriot stock market. Results: Investors and professional accountants agree that the reporting framework can be considered as adequate both in terms of quality and quantity. Implications: Despite the fact that the current accounting principles are perceived to be adequate in the eyes of investors and professional accountants, there is still space for improvement and a requisite for disclosures of non-financial information. Value: The information provided by accountants and investors alike is helpful towards reforming and developing an enriched disclosure era in financial reports so as to meet decision maker needs under the current financial crisis.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:j33aPA1ap8EC",
            "Publisher": "J ournalof A ccountingand Ma nag em ent"
        },
        {
            "Title": "A framework for developing intelligent decision support systems using evolutionary fuzzy cognitive maps",
            "Publication year": 2008,
            "Publication url": "https://content.iospress.com/articles/journal-of-intelligent-and-fuzzy-systems/ifs00389",
            "Abstract": "This paper focuses on developing Intelligent Decision Support Systems within the framework of Genetically Evolved Fuzzy Cognitive Maps, thus at modelling real world problems and supporting the decision making process. The proposed framework is based on encoding experts' assessments on the nature of the problem under consideration. This assessment is inputted in a fuzzy knowledge base that uses a linguistic form following which it is modelled and processed by means of Fuzzy Cognitive Maps. The optimisation that follows with the help of Genetic Algorithms facilitates the simulation of hypothetical scenarios, while the defuzzification process implemented interprets the results along human reasoning lines. The effectiveness and reliability of the method proposed has been demonstrated by means of a case study on the Cyprus issue shortly before the April, 24 referendum.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:WF5omc3nYNoC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A Unified Web-based Framework for Java Code Analysis and Evolutionary Automatic Test-cases Generation.",
            "Publication year": 2010,
            "Publication url": "https://www.scitepress.org/Papers/2010/29117/29117.pdf",
            "Abstract": "This paper describes the implementation and integration of code analysis and testing systems in a unified web-enabled framework. The former analyses basic programs written in Java and constructs the controlflow, data-flow and dependence graph (s), whereas the testing system collaborates with the analysis system to automatically generate and evaluate test-cases with respect to control flow and data flow criteria. The present work describes the design and implementation details of the framework and presents preliminary experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic production of test data with a multiple batch-optimistic method",
            "Publication year": 2009,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213009000044",
            "Abstract": "Recent research on software testing focuses on integrating techniques, such as computational intelligence, with special purpose software tools so as to minimize human effort, reduce costs and automate the testing process. This work proposes a complete software testing framework that utilizes a series of specially designed genetic algorithms to generate automatically test data with reference to the edge/condition testing coverage criterion. The framework utilizes a program analyzer, which examines the program's source code and builds dynamically program models for automatic testing, and a test data generation system that utilizes genetic algorithms to search the input space and determine a near to optimum set of test cases with respect to the testing coverage criterion. The performance of the framework is evaluated on a pool of programs consisting of both standard and random-generated programs. Finally, the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:R3hNpaxXUhUC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Investigating cloud adoption using influence diagrams as a decision support model",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213015600052",
            "Abstract": "The fact that Cloud Computing is steadily becoming one of the most significant fields of Information and Communication Technology (ICT) has led many organizations to consider the benefits of migrating their business operations to the Cloud. Decision makers are facing strong challenges when assessing the feasibility of the adoption of Cloud Computing for their organizations. Cloud adoption is a multi-level decision which is influenced by a number of intertwined factors and concerns thus characterizing it as a complex and difficult to model real-world problem. In this paper we propose two decision support modeling approaches based on Influence Diagrams (ID) aiming to model the answer to the question “Adopt Cloud Services or Not?” Two models are developed and tested, the first is a generic ID with nodes interacting in a probabilistic manner, while the second is a more flexible version that utilizes Fuzzy Logic …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:C2yK8tfAHAgC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "A Semantic Formalization for Use Case Modeling.",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/40013/40013.pdf",
            "Abstract": "It has been recognized that a certain level of formalization is needed to produce precise and well-defined use case models, thus tackling problematic issues such as the lack of a specific, semantic classification of use cases, the vagueness of the use case specifications written in free natural language (NL), and the limited tool support that makes use case driven analysis a time-consuming and error-prone activity. This paper presents a formal semantics for the basic use case model elements, including specific semantic types of use cases, specific types of basic and alternative flow actions, and specific functional roles actors can play. To maintain a high-degree of readability and understandability and to minimize ambiguity, the proposed approach provides a semi-formal, NL-based specification syntax, tailored to each semantic use case type, with a specific sequence of basic and alternative flow actions. The formalization is facilitated by utilizing elements of a novel methodology named Natural Language Syntax and Semantics Requirements Engineering.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:SC9kKMAi-DoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Size and effort-based computational models for software cost prediction",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13794",
            "Abstract": "Reliable and accurate software cost estimations have always been a challenge especially for people involved in project resource management. The challenge is amplified due to the high level of complexity and uniqueness of the software process. The majority of estimation methods proposed fail to produce successful cost forecasting and neither resolve to explicit, measurable and concise set of factors affecting productivity. Throughout the software cost estimation literature software size is usually proposed as one of the most important attributes affecting effort and is used to build cost models. This paper aspires to provide size and effort-based estimations for the required software effort of new projects based on data obtained from past completed projects. The modelling approach utilises Artificial Neural Networks (ANN) with a random sliding window input and output method using holdout samples and moreover, a Genetic Algorithm (GA) undertakes to evolve the inputs and internal hidden architectures and to reduce the Mean Relative Error (MRE). The obtained optimal ANN topologies and input and output methods for each dataset are presented, discussed and compared with a classic MLR model.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:6MVT8mER-OMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Epistemic Game Development to Teach Software Development Skills",
            "Publication year": 2020,
            "Publication url": "https://www.igi-global.com/article/using-epistemic-game-development-to-teach-software-development-skills/262194",
            "Abstract": "This paper presents a pilot study on the evaluation of instruments for data gathering for an epistemic game development competition for high school students. The initial results show that a significant percentage of the students who participated in the competition appear to exhibit a skillset of professional attitude, software-related knowledge, and employability traits, and this skillset may be attributed to the intervention. The data was validated through a two-method triangulation technique that utilized expert evaluation and participant interviews. The data analysis shows early indicators of the desired learning outcomes, although a more thorough methodology is needed to verify this. Furthermore, the competition acts as an awareness campaign that promotes computer science studies through a gamification process. It is proposed that competitions of this type are held and evaluated on an annual basis to maximize the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:QC-2xSqExF4C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Feature subset selection for software cost modelling and estimation",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1210.1161",
            "Abstract": "Feature selection has been recently used in the area of software engineering for improving the accuracy and robustness of software cost models. The idea behind selecting the most informative subset of features from a pool of available cost drivers stems from the hypothesis that reducing the dimensionality of datasets will significantly minimise the complexity and time required to reach to an estimation using a particular modelling technique. This work investigates the appropriateness of attributes, obtained from empirical project databases and aims to reduce the cost drivers used while preserving performance. Finding suitable subset selections that may cater improved predictions may be considered as a pre-processing step of a particular technique employed for cost estimation (filter or wrapper) or an internal (embedded) step to minimise the fitting error. This paper compares nine relatively popular feature selection methods and uses the empirical values of selected attributes recorded in the ISBSG and Desharnais datasets to estimate software development effort.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software defect prediction using doubly stochastic Poisson processes driven by stochastic belief networks",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121216301601",
            "Abstract": "Accurate prediction of software defects is of crucial importance in software engineering. Software defect prediction comprises two major procedures: (i) Design of appropriate software metrics to represent characteristic software system properties; and (ii) development of effective regression models for count data, allowing for accurate prediction of the number of software defects. Although significant research effort has been devoted to software metrics design, research in count data regression has been rather limited. More specifically, most used methods have not been explicitly designed to tackle the problem of metrics-driven software defect counts prediction, thus postulating irrelevant assumptions, such as (log-)linearity of the modeled data. In addition, a lack of simple and efficient algorithms for posterior computation has made more elaborate hierarchical Bayesian approaches appear unattractive in the context of …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:00hq1xGbIBsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "DESIGNING AND IMPLEMENTING A MULTI-LAYER ARCHITECTURE FOR DYNAMIC AND INTERACTIVE PROGRAM ANALYSIS",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Andreou-8/publication/264859295_DESIGNING_AND_IMPLEMENTING_A_MULTI-LAYER_ARCHITECTURE_FOR_DYNAMIC_AND_INTERACTIVE_PROGRAM_ANALYSIS/links/54d899090cf2970e4e782053/DESIGNING-AND-IMPLEMENTING-A-MULTI-LAYER-ARCHITECTURE-FOR-DYNAMIC-AND-INTERACTIVE-PROGRAM-ANALYSIS.pdf",
            "Abstract": "This paper addresses certain critical aspects of static and dynamic program analysis. Significant problems still exist in several areas of program analysis that deal with the creation and presentation of the control flow graph, the initialization sequence, the support of large and complex programs in programming languages, the path extraction, the variable scope and the method identification. Our proposition involves a multi-layer architecture featuring runtime and non-runtime embedded cooperating modules that offer specific solutions to the aforementioned problems. One of the special features we describe is the dynamic creation of the control flow information, which interacts with the program transformation and program analysis. The proposed architecture is designed to support and promote scalability, applicability and usability, while it can prove useful in a wide range of aspects in the context of program analysis.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:H0nRGT7Dr7IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crisis management and political decision making using fuzzy cognitive maps: the Cyprus issue",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=4152545543266453287&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent Classification and Retrieval of Software Components",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4020136/",
            "Abstract": "This work proposes a new methodology for intelligent classification and retrieval of software components based on user-defined requirements. The classification scheme utilizes a dedicated genetic algorithm which evolves a small number of classifiers by dividing the set of available components stored in a database into certain subsets (clusters). Each classifier thus becomes the leader-representative of its cluster. When a user wishes to trace a component he/she identifies the desired characteristics (component profile) which are then compared with the characteristics of the available classifiers. The closest classifier matching the required characteristics over a user-defined threshold will result in the \"winning\" set of components belonging to its cluster, which are presented to the user in descending matching fitness. We have validated our methodology over a synthetic dataset of components and the results obtained …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigating the predictability of empirical software failure data with artificial neural networks and hybrid models",
            "Publication year": 2006,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/13812",
            "Abstract": "Software failure and software reliability are strongly related concepts. Introducing a model that would perform successful failure prediction could provide the means for achieving higher software reliability and quality. In this context, we have employed artificial neural networks and genetic algorithms to investigate whether software failure can be accurately modeled and forecasted based on empirical data of real systems. © 2006 International Federation for Information Processing.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:0kYikfLtzSYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evolving Conditional Value Sets of Cost Factors for Estimating Software Development Effort",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410279/",
            "Abstract": "The software cost estimation process is one of the most critical managerial activities related to project planning, resource allocation and control. As software development is a highly dynamic procedure, the difficulty of providing accurate cost estimations tends to increase with development complexity. The inherent problems of the estimation process stem from its dependence on several complex variables, whose values are often imprecise, unknown, or incomplete, and their interrelationships are not easy to comprehend. Current software cost estimation models do not inspire enough confidence and accuracy with their predictions. This is mainly due to the models' sensitivity to project data values, and this problem is amplified because of the vast variances found in historical project attribute data. This paper aspires to provide a framework for evolving value ranges for cost attributes and attaining mean effort values …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "E-commerce engineering: A short vs long software process for the development of e-commerce applications",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/53513",
            "Abstract": "The immediacy in developing e-commerce applications, the quality of the services offered by these systems band the need for continuous evolution are primary issues that must be fully analysed and understood prior and during the development process. In this context, the present work suggests a new development framework which aims at estimating the level of complexity a certain e-commerce system encompasses and driving the selection of a long or short software process in terms of time and effort. The proposed framework utilizes a special form of Business Process Re-engineering (BPR) to define and assess critical business and organizational factors within small-to-medium enterprises (SMEs) whishing to go ecommerce. This set of factors is enriched with other critical issues belonging to the quality requirements of the system and to the application type of services it aspires to offer. The set of critical factors identified is used to estimate the average complexity level of the system using numerical values to describe the contribution of each factor to the overall complexity. The level of complexity estimated dictates the adoption of either a short or a long version of the well-known WebE process for analysing, designing and implementing the e-commerce system required by an SME.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:BqipwSGYUEgC",
            "Publisher": "Escola Superior de Tecnologia do Instituto Politecnico de Setubal"
        },
        {
            "Title": "Human and technological issues in the e-learning engineering process",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/George-Papadopoulos-22/publication/228806194_Human_and_Technological_Issues_in_the_E-Learning_Engineering_Process/links/0912f50aa41fb30b73000000/Human-and-Technological-Issues-in-the-E-Learning-Engineering-Process.pdf",
            "Abstract": "During the past few years we have experienced the development of several E-Learning systems. Unfortunately, several of these systems fail to satisfy the learners’ needs and requirements due to the absence of key human and technological issues in the engineering process. The successful development of E-Learning systems requires the identification of human issues such as, social and cultural factors, quality components and pedagogy requirements as well as, technological issues such as the learning environment. In this paper, these issues are examined and presented addressing their importance in developing a learner-centric environment through the use of an E-Learning engineering process.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Searching for the Optimal Defence Expenditure",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4757-5226-7_7",
            "Abstract": "This paper aims at evaluating the extent to which the defence expenditure of Greece and Cyprus given their arms race against Turkey in the context of the Integrated Defence Doctrine policy constitutes a burden feasible to bear. The evaluation takes place using an Optimal Control solution constrained by a model emphasising on Greek and Cypriot defence expenditure. Various experiments and scenarios have been tested leading to the general conclusion that the defence expenditure in both allied countries seems to be driving their economies beyond capacity limits. This, however, by no means justifies the one sided disarmament policy currently followed by Greece, since the long-term armament programmes pursued by Turkey, the role of which in this arms race has been proven as leading, leave very small room to the Greek and Cypriot sides to reduce their defence expenditures.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "SPECIFICATION-BASED AUTOMATED GUI TESTING",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/Papers/2011/35481/35481.pdf",
            "Abstract": "GUI testing is currently one of the most expensive and time consuming processes in the software life-cycle and according to some estimates this cost can reach up to 50 to 70% of the whole cost of the project. This paper proposes a framework for specification-based automated GUI testing which employs a GUI analyzer for dynamic analysis and extraction of GUI object information, a system for automatic test case generation driven by Spec#, a test-case execution algorithm that executes test-cases automatically and a verifier that compares the expected with the actual result of the test. Preliminary experimental results demonstrate the efficiency and effectiveness of the framework.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:K1AqHrCRkPsC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "A framework for static and dynamic analysis of multi-layer fuzzy cognitive maps",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231216315764",
            "Abstract": "Fuzzy Cognitive Maps (FCMs) have progressively become a well-researched and extensively used set of tools for modeling real-world, complex decision making problems. Despite their fast growth, researchers and modelers are faced with the lack of a framework to analyze such models and help them assess their performance and efficiency. Moreover, when multi-layered FCM (ML-FCM) structures are used, which consist of a rich number of nodes and interconnections organized in different layers, this need becomes imperative. The present paper introduces an integrated analysis framework and a series of steps to gather useful static and dynamic information regarding ML-FCM models, as well as to interpret the corresponding results. The proposed type of analysis provides significant information on the model's complexity, the strength of its nodes and its tendency to promote or inhibit activation levels as a result of …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:38eRAUXPO10C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Nonlinear time-series analysis of the Greek exchange-rate market",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127400001110",
            "Abstract": "Using concepts from the theory of chaos and nonlinear dynamical systems, a time-series analysis is performed on four major currencies against the Greek Drachma. The R/S analysis provided evidence for fractality due to noisy chaos in only two of the data series, while the BDS test showed that all four systems exhibit nonlinearity. Correlation dimension and related tests, as well as Lyapunov exponents, gave consistent results, which did not rule out the possibility of deterministic chaos for the two possibly fractal series, rejecting though the occurrence of a simple low-dimensional attractor, while the other two series seemed to have followed a behavior close to that of a random signal. SVD analysis, used to filter away noise, strongly supported the above findings and provided reliable evidence for the existence of an underlying system with a limited number of degrees-of-freedom only for those series found to exhibit …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Singapore: World Scientific, 1991-"
        },
        {
            "Title": "A cloud adoption decision support model based on fuzzy cognitive maps",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39259-7_20",
            "Abstract": "Cloud Computing has become nowadays a significant field of Information and Communication Technology (ICT). Both cloud providers and customers invest time and resources in an endeavor of the former to serve effectively the needs of the latter so as to adopt efficiently such cloud services, based their needs. The decision to adopt cloud services falls within the category of complex and difficult to model real-world problems. Aiming to support the cloud adoption decision process, we propose in this paper an approach based on Fuzzy Cognitive Maps (FCM) which models the parameters that potentially influence such a decision. The construction and analysis of the map is based on factors reported in the relevant literature and the utilization of experts’ opinion. The proposed approach is evaluated through four real-world experimental cases and the suggestions of the model are compared with the customers …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The development of a quality e-learning environment based on human, social, and cultural factors",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1307635/",
            "Abstract": "We have experienced a huge increase in the development and usage of e-learning, particularly by academic institutions. Among the greatest advantages offered by distance learning to both academics and students is accessibility, mobility and collaboration. These advantages address only one aspect of the learning process. Other factors, such as the adoption of classical pedagogical methods to the new environment, the incorporation of human, social and cultural factors in the e-learning tools and the opening of the educational process for continuous learning to all people regardless of their background need to be addressed as well. We aim to continue the MEDFORIST's attempt by presenting a methodology for developing a quality e-learning environment based on human, social and cultural factors.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new traversing and execution algorithm for multilayered fuzzy cognitive maps",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4630677/",
            "Abstract": "This paper introduces a new algorithm for traversing and executing multilayered fuzzy cognitive maps (ML-FCMs) that aim to enhance this methodology, which is designed for handling complicated large scale problems. The methodology is based on the decomposition of the parameters of the problem under investigation into smaller quantities, organised in a hierarchical structure forming a multilayered FCM model. The present work aspires to eliminate the weaknesses of the existing ML-FCM algorithm, which reside in the way activation levels are calculated for those concepts decomposed into a set of parameters at lower layers in the map. The current algorithm calculates these levels by completing a full iteration cycle at the lower level thus losing the information produced between the iterative steps. We attempt to solve this problem by introducing the enhanced ML-FCM algorithm, (EML-FCM) which allows …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A decentralized application for logistics: Using blockchain in real-world applications",
            "Publication year": 2018,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13713",
            "Abstract": "A prototypical smart contract (wrapped as a decentralized application) is presented for investigating the potential benefits for applying Blockchain for Logistics. The decentralized application proposed exposes the various design challenges that programmers are likely to face when realizing the implementation of the application. The proposed methodolog y utilises the implementation of a dedicated smart contract that was developed based on a special-purpose structure for satisfying the requirements of the usecase. The evaluation was based on the execution of each of the functions measuring the gas costs and execution time. The prototype design was deployed and evaluated on a real-world Blockchain framework and can be considered as a first solution to how the Blockchain technolog y can be utilized within Logistics to overcome any barriers that may exist between professionals. In this paper we present a real implementation of a smart contract for the Logistics industry. The proposed dApp provides a live example of how Blockchain can be utilized within Logistics as it enables users to send and track products.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:96M4k3P_OWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "To spend or not to spend? The case of defence expenditure in the context of the Greek crisis",
            "Publication year": 2014,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/9763",
            "Abstract": "The aim of this paper is to evaluate the recipe that requires defence expenditure reductions in an environment of severe budget cuts together with rising costs. The case of Greece, a country that is in the process of recovering from a six-year economic crisis, provides an example of an economy in which an import – substitution strategy via the promotion of the Hellenic Defence Industrial Base potential can contribute to both economic growth and unemployment reduction, thus adding to the effectiveness of the import-substitution policies employed and compromising between an austerity programme and the defence needs of the country.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:ipvhVhH6zQ8C",
            "Publisher": "Praise Worthy Prize"
        },
        {
            "Title": "On the Problem of Attribute Selection for Software Cost Estimation: Input Backward Elimination Using Artificial Neural Networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_38",
            "Abstract": "Many parameters affect the cost evolution of software projects. In the area of software cost estimation and project management the main challenge is to understand and quantify the effect of these parameters, or ‘cost drivers’, on the effort expended to develop software systems. This paper aims at investigating the effect of cost attributes on software development effort using empirical databases of completed projects and building Artificial Neural Network (ANN) models to predict effort. Prediction performance of various ANN models with different combinations of inputs is assessed in an attempt to reduce the models’ input dimensions. The latter is performed by using one of the most popular saliency measures of network weights, namely Garson’s Algorithm. The proposed methodology provides an insight on the interpretation of ANN which may be used for capturing nonlinear interactions between variables in …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "Special Issue on Selected Papers from the 9th IFIP International Conference on Artificial Intelligence Applications & Innovations (AIAI 2013)",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=11703832334616187010&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:LLUdpdcEW3AC",
            "Publisher": "WORLD SCIENTIFIC PUBL CO PTE LTD"
        },
        {
            "Title": "Investigating the impact of developer productivity, task interdependence type and communication overhead in a multi-objective optimization approach for software project planning",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S096599781630076X",
            "Abstract": "One of the most important activities in software project planning involves scheduling tasks and assigning them to developers. Project managers must decide who will do what and when in a software project, with the aim of minimizing both its duration and cost. However, project managers often struggle to efficiently allocate developers and schedule tasks in a way that balances these conflicting goals. Furthermore, the different criteria used to select developers could lead to inaccurate estimation of the duration and cost of tasks, resulting in budget overruns, delays, or reduced software quality. This paper proposes an approach that makes use of multi-objective optimization to handle the simultaneous minimization of project cost and duration, taking into account several productivity-related attributes for better estimation of task duration and cost. In particular, we focus on dealing with the non-interchangeable nature of …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:GUJN1xMjMHAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evaluating Risks in Software Negotiations through Fuzzy Cognitive Maps.",
            "Publication year": 2009,
            "Publication url": "https://www.scitepress.org/Papers/2009/20176/20176.pdf",
            "Abstract": "Risks are inevitably and permanently present in software negotiations and they can directly influence the success or failure of negotiations. Risks should be avoided when they represent a threat and encouraged when they denote an opportunity. This work examines the influence of some negotiation elements in the area of risk and cost estimation, which are both factors that directly influence software development negotiation. In this work, risk quantification is proposed to translate its impact to measurable values that may be taken into consideration during negotiations. The model proposed involves an assessment tool based on basic negotiation elements–namely relationship, interests, cost and time–quantifying the influences among each other, and makes use of Fuzzy Cognitive Maps (FCMs) for developing the associations around basic risk elements on one hand and attaining an innovative risk quantification model for improved software negotiations on the other. Indicative scenarios are presented to demonstrate the efficacy of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artificial Intelligence Applications and Innovations 2010",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=12549080955086283634&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Locating and correcting software faults in executable code slices via evolutionary mutation testing",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40654-6_13",
            "Abstract": "Software testing is an important phase of software development that helps eliminating the possibility of project failure. As software systems get more complicated and larger in size, testing needs to constantly evolve and provide more “sophisticated” techniques, like automatic, self-adaptive mutation testing, targeting at improving the efficiency and effectiveness of the testing phase by handling the increased complexity that leads to increased demands in time and effort. Mutation testing is the procedure of applying a series of operators on correctly functioning programs so as to induce “faults” that correspond to real, common programming errors and then assess the ability of a set of test cases to reveal those errors. We introduce a novel approach for identifying and correcting faults in Java source code with the use of code slicing, mutation testing and Genetic Algorithms. Three different categories of experiments …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Towards The Identification Of Human, Social, Cultural And Organizational Requirements For Successful E-Commerce Systems Development",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812562586_0011",
            "Abstract": "E-commerce systems' poor and incomplete design fail to meet users expectations and businesses goals. A major factor of failure of these systems is ignoring important requirements that result from human, cultural, social and organizational factors. The present work introduces a new Web engineering methodology for performing requirements elicitation through a model called SpiderWeb. This is a cross-relational structure comprised of three main axons: Country Characteristics, User Requirements and Application Domain. The purpose of this model is to provide a simple way for analysts to identify these hidden requirements which otherwise could be missed or given little attention. Factors gathering is performed based on a certain form of ethnography analysis, which is conducted in a short-scale and time-preserving manner, taking into consideration the importance of immediacy in deploying e-commerce …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new traversing and execution algorithm for multilayered fuzzy cognitive maps",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13797",
            "Abstract": "This paper introduces a new algorithm for traversing and executing Multilayered Fuzzy Cognitive Maps (ML-FCMs) that aim to enhance this methodology, which is designed for handling complicated large scale problems. The methodology is based on the decomposition of the parameters of the problem under investigation into smaller quantities, organised in a hierarchical structure forming a multilayered FCM model. The present work aspires to eliminate the weaknesses of the existing ML-FCM algorithm, which reside in the way activation levels are calculated for those concepts decomposed into a set of parameters at lower layers in the map. The current algorithm calculates these levels by completing a full iteration cycle at the lower level thus losing the information produced between the iterative steps. We attempt to solve this problem by introducing the Enhanced ML-FCM algorithm, (EML-FCM) which allows calculations in-between iterations and takes into consideration the change of activation levels in a more detailed form. The strong features of the proposed EML-FCM algorithm are presented and discussed, in addition to the provision of a comparison between the two algorithms. © 2008 IEEE.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:LYDvBi7O6RsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parkchain: An iot parking service based on blockchain",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8804765/",
            "Abstract": "The IoT ecosystem is evolving quickly, developing several applications in different sectors. The majority of these applications use centralized infrastructures something that poses several challenges especially related to trust and data security. Recently, blockchain has been introduced as an effective solution to IoT applications trying to provide solutions to these challenges. In this paper, we introduce a new decentralized IoT application using blockchain technology, namely, ParkChain. The ParkChain application operates in a way that no one can delete, revert, hack or question the time a registered vehicle securely entered a parking area. In order to evaluate ParkChain, we have implemented the smart contract on top of Ethereum Blockchain along with a traditional Image Processing / Computer Vision approach for License Plate Recognition, and using a Raspberry Pi we control the access on a parking place. We …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:7uOkfv6XYJ4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multi-objective genetic algorithm for software development team staffing based on personality types",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33409-2_5",
            "Abstract": "This paper proposes a multi-objective genetic algorithm for software project team staffing that focuses on optimizing human resource usage based on technical skills and personality traits of software developers. Human factors are recognized as critical aspects affecting the rate of success of software projects, as well as other properties, such as productivity, software quality, performance, and job satisfaction. However, managers often rely solely on technical criteria to staff their projects, which risks overlooking these important aspects of software development, such as the abilities and work styles of developers. The behaviour and scalability of the algorithm was validated against a series of hypothetical projects of varying size and complexity, and also through a real-world project of an SME in the local IT industry. The approach demonstrated a sufficient ability to generate both feasible and optimal staffing …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Soft computing for crisis management and political decision making: the use of genetically evolved fuzzy cognitive maps",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s00500-004-0344-0",
            "Abstract": "This paper examines the use of fuzzy cognitive maps (FCMs) as a technique for modeling political and strategic issues situations and supporting the decision-making process in view of an imminent crisis. Its object domain is soft computing using as its basic elements different methods from the areas of fuzzy logic, cognitive maps, neural networks and genetic algorithms. FCMs, more specifically, use notions borrowed from artificial intelligence and combine characteristics of both fuzzy logic and neural networks, in the form of dynamic models that describe a given political setting. The present work proposes the use of the genetically evolved certainty neuron fuzzy cognitive map (GECNFCM) as an extension of certainty neuron fuzzy cognitive maps (CNFCMs) aiming at overcoming the main weaknesses of the latter, namely the recalculation of the weights corresponding to each concept every time a new …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Supporting the decision of migrating to microservices through multi-layer fuzzy cognitive maps",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-69035-3_34",
            "Abstract": "Microservices architectures are gaining momentum for the development of applications as suites of small, autonomous, and conversational services, which are then easy to understand, deploy and scale. However, one of today’s problems is that microservices introduce new complexities to the system and, despite the hype, many factors should be considered when deciding to adopt a microservices architecture. This paper proposes the first Decision Support System (DSS) to migrate to microservices, by identifying the key concepts and drivers regarding through a literature review and feedback from a group of experts from industry and academia. Then, these concepts are organized as a Multi-Layer Fuzzy Cognitive Map (ML-FCM), a graph-based computational intelligence model that captures the behavior of a given problem in nodes that represent knowledge in the domain, and offers the means to study …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:esGtpfCv0y8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Critical factors in the socio-cultural e-Learning engineering process",
            "Publication year": 2007,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2007.013663",
            "Abstract": "The transfer of the traditional teaching and learning process into the new environment is not always successful. In this paper, we identify the most important factors that need to be included in the e-Learning engineering process with emphasis on the human, social and cultural factors and how these affect the successful development of e-Learning systems. The critical factors are divided in three axons Human, Social and Cultural Factors, Quality Components and Pedagogy Requirements. Finally, we propose an e-Learning engineering process incorporating these axons. The process is demonstrated through a case study showing the efficacy of our process.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:35N4QoGY0k4C",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Exchange-rates forecasting: A hybrid algorithm based on genetically optimized adaptive neural networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1020989601082",
            "Abstract": "The use of neural networks trained by a new hybrid algorithm is employed on forecasting the Greek Foreign Exchange-Rate Market. Four major currencies, namely the U.S. Dollar (USD), the Deutsche Mark (DEM), the French Franc (FF) and the British Pound (GBP), versus the Greek Drachma, were used as experimental data. The proposed algorithm combines genetic algorithms and a training method based on the localized Extended Kalman Filter (EKF), in order to evolve the structure and train Multi-Layered Perceptron (MLP) neural networks. The goal of this effort is to predict, as accurately as possible, exchange-rates future behavior. Simulation results show that the method gives highly successful results, while the diversification of the structure between the four currencies has no effect on the performance.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Evolutionary multilayered fuzzy cognitive maps: a hybrid system design to handle large-scale, complex, real-world problems",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1684634/",
            "Abstract": "This paper proposes an extension to multilayered fuzzy cognitive maps (ML-FCMs) and introduces a new methodology based on ML-FCMs aiming at enhancing their capabilities for scenario analysis and forecasting. The main issue here is the decomposition of the parameters into smaller, more manageable quantities, organised in a hierarchical structure forming a model, which consists of subsystems working together and supporting a central objective. The modelling of a particular large scale system is primarily represented by a main, central FCM, with distinct sub-models (layers) implemented also as FCMs and linked together in a hierarchical tree structure. The sub-models represent and implement (in computational terms) the decomposed parameters and variables of the system, thus offering the ability of isolating and studying critical parts of the system. The objective of the evolutionary multilayered FCM …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A security tunnel for conducting mobile business over the TCP protocol",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Pitsillides/publication/228359876_A_security_tunnel_for_conducting_mobile_business_over_the_TCP_protocol%27/links/0912f50f0480feff19000000/A-security-tunnel-for-conducting-mobile-business-over-the-TCP-protocol.pdf",
            "Abstract": "This paper discusses security issues in the Mobile Business area with emphasis on the significance of mobile commerce and provides a framework to address and analyse common security problems of m-Business services and applications. We propose a new model to address efficiently some security problems in mobile environments, which rescinds Gateway/Proxy intermediates and establishes a secure end-to-end communication between mobile users and service providers over the TCP protocol. In this context, an application prototype is developed in J2ME, which implements and demonstrates the proposed model.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The evaluation of the Cultural Journeys in the Information Society environment as an educational aid",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504000776",
            "Abstract": "The Cultural Journeys in the Information Society is a dynamic hypermedia environment, which proposes the Electronic Roads as a meta-form for exploring cultural information that can form Cultural Journeys. The Electronic Roads meta-form facilitates travelers to explore the information space in a natural and continuous way similar to the exploration of physical roads. This meta-form is advantageous over existing cultural exploration approaches, which usually apply only to discrete information spaces, failing to provide users with continuous explorations and as a result users may lose their intended destinations. The proposed environment provides extendable cultural and historical content for three Mediterranean countries, i.e. Cyprus, Jordan and Egypt.Such a system could be ideal for teaching history and culture; therefore several Learning Activities have been developed in this context. The learning effectiveness …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:TQgYirikUcIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Dynamic Search-Based Test Data Generation Focused on Data Flow Paths.",
            "Publication year": 2008,
            "Publication url": "https://www.scitepress.org/papers/2008/16926/16926.pdf",
            "Abstract": "Test data generation approaches produce sequences of input values until they determine a set of test cases that can test adequately the program under testing. This paper focuses on a search-based test data generation algorithm. It proposes a dynamic software testing framework which employs a specially designed genetic algorithm and utilises both control flow and data flow graphs, the former as a code coverage tool, whereas the latter for extracting data flow paths, to determine near to optimum set of test cases according to data flow criteria. Experimental results carried out on a pool of standard benchmark programs demonstrate the high performance and efficiency of the proposed approach, which are significantly better compared to related search-based test data generation methods.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:LiF7i2gyBHwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Smart connected digital factories: Unleashing the power of industry 4.0",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-29193-8_5",
            "Abstract": "Recent initiatives such as the Industrial IoT, or Industry 4.0, as it has been dubbed, are fundamentally reshaping the industrial landscape by promoting connected manufacturing solutions that realize a “digital thread” which connects all aspects of manufacturing including all data and operations involved in the production of goods and services. This paper focuses on Industry 4.0 technologies and how they support the emergence of highly-connected, knowledge-enabled factories, referred to as Smart Manufacturing Networks. Smart Manufacturing Networks comprise an ecosystem of connected factory sites, plants, and self-regulating machines able to customize output, and allocate resources over manufacturing clouds optimally to offer a seamless transition between the physical and digital worlds of product design and production.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:geVfx-PNG5EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Enhancing Recommender Systems Development with Human, Social, Cultural and Organizational Factors.",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Stephanos-Mavromoustakos/publication/220709450_Enhancing_Recommender_Systems_Development_with_Human_Social_Cultural_and_Organizational_Factors/links/5a94b167aca272140567534b/Enhancing-Recommender-Systems-Development-with-Human-Social-Cultural-and-Organizational-Factors.pdf",
            "Abstract": "Recommender Systems (RS) aim at suggesting filtered Web information adapted to the needs or interests of users by predicting their access behavior using a certain strategy or algorithm. The creation of RS is usually approached focusing mostly on user behavior modeling, while the recommendation engine often neglects critical, non-technical aspects of software systems development. Conceiving a RS primarily as a selfcontained or part of a Web-application, the present paper utilizes the SpiderWeb methodology and takes into account important requirements that result from human, cultural, social and organizational factors (HSCO) so as to drive the RS development activities.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:gNZucvRojEcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel telemedicine system for the handling of emergency cases",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=9006345083701254644&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Study of social, ethical and human-computer interactionaspects of the MEDARIST II system.",
            "Publication year": 2004,
            "Publication url": "http://www.wseas.us/e-library/conferences/tenerife2004/papers/473-219.rtf",
            "Abstract": "Electronic Patient Record Systems (EPRS) hold an exceptional position in the field of Medical Informatics. The aim of such systems is to replace the traditional paper-based patient recording, offering at the same time a set of advanced data exchange functionalities modern computers and networks can offer. MEDARIST II is a flexible and efficient EPRS, designed to serve surgery wards. This paper focuses on the analysis of certain social and ethical factors that must be taken into account when designing EPRS from an end-user's point of view. Furthermore the paper aims at demonstrating the methods used by the MEDARIST II system to cover usability and human-computer interaction aspects.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multipurpose health care telemedicine system",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1019597/",
            "Abstract": "In this study we present a multipurpose health care telemedicine system, which can be used for emergency or patient monitoring cases. Ambulances, Rural Health Centers (RHC) or other remote health location. Ships navigating in wide seas and airplanes in flight are common examples of possible emergency sites, while critical care telemetry and telemedicine home follow-ups are important issues of patient monitoring. The telemedicine system is a combined real-time and store and forward facility that consists of a base unit and a telemedicine (mobile) unit. The telemedicine unit (patient site) allows the transmission of vital biosignals (3-12 lead ECG, SPO2, NIBP, IBP, Temp) and still images of the patient from the incident place to the base unit (consultation site). The transmission is performed through GSM, Satellite links or POTS. Using this device a specialist doctor can telematically \"move\" to the patient site and …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A dynamic Web Recommender System using Hard and Fuzzy K-modes clustering",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_5",
            "Abstract": "This paper describes the design and implementation of a new dynamic Web Recommender System using Hard and Fuzzy K-modes clustering. The system provides recommendations based on user preferences that change in real time taking also into account previous searching and behavior. The recommendation engine is enhanced by the utilization of static preferences which are declared by the user when registering into the system. The proposed system has been validated on a movie dataset and the results indicate successful performance as the system delivers recommended items that are closely related to user interests and preferences.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:W5xh706n7nkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Evidence of agile adoption in software organizations: An empirical survey",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39179-8_21",
            "Abstract": "This paper aims at empirically investigating the levels of agile adoption by software development organizations in comparison with the type of practices followed, the business sectors and the countries of origin, as well as revealing the geographical organization and distribution of teams both within agile and traditional development environments. Through a dedicated survey conducted, the paper also discovers, analyzes and presents the business strategies, levels of expertise, benefits and concerns of agile adoption within the various participating organizations. The results obtained indicate that agile methods seem to offer opportunities for improved products in terms of quality and suggest a number of critical factors that affect the software process and the adoption of agile methods in general.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A generic tool for building fuzzy cognitive map systems",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16239-8_9",
            "Abstract": "A generic system for simulating complex dynamical systems along the paradigm of fuzzy cognitive maps (FCM) has been created and tested. The proposed system enables a user to design appropriate FCM structures, by specifying the desired concepts and the various parameters such as sensitivities, as well as a variety of shaping functions. The user is able to see the results, change the parameters, modify the functions, and rerun the system using an alteration of the final results and make new conclusions. The system is introduced and demonstrated using a simple real case. The results of a usability test of the system suggest that the system is capable of simulating complicated FCM structures in an effective manner, helping the user to reduce the degree of risks during decision making.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "2015 Index IEEE Transactions on Neural Networks and Learning Systems Vol. 26",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7369473/",
            "Abstract": "This index covers all technical items—papers, correspondence, reviews, etc.—that appeared in this periodical during 2015, and items from previous years that were commented upon or corrected in 2015. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the coauthors’ names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author’s name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:MUocvVTjX6cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FOR SUCCESSFUL E-COMMERCE SYSTEMS DEVELOPMENT",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4756884949653761963&hl=en&oi=scholarr",
            "Abstract": "While there is a plethora of research works in e-commerce. there is lack of methods for revealing HSCO factors, which otherwise stay well hidden within the working environment analyzed. The risk of missing the requirements resulting from these factors leads us to propose a new methodology to uncover and analyze HSCO factors, as well as to translate them to system requirements. The methodology utilizes a new model called SpiderWeb. aspiring at recording critical factors that must be incorporated as functional or non-functional features in the e-commerce application under development. Taking into consideration the importance of immediacy in deploying e-commerce applications, an oriented form of ethnography analysis is introduced. which can be conducted in a non-time consuming manner to identify requirements sourcing from HSCO factors, based on a certain informational",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:hMod-77fHWUC",
            "Publisher": "World Scientific Publishing Company Incorporated"
        },
        {
            "Title": "Symbolic execution for dynamic, evolutionary test data generation",
            "Publication year": 2009,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13756",
            "Abstract": "This paper combines the advantages of symbolic execution with search based testing to produce automatically test data for JAVA programs. A framework is proposed comprising two systems which collaborate to generate test data. The first system is a program analyser capable of performing dynamic and static program analysis. The program analyser creates the control flow graph of the source code under testing and uses a symbolic transformation to simplify the graph and generate paths as independent control flow graphs. The second system is a test data generator that aims to create a set of test cases for covering each path. The implementation details of the framework, as well as the relevant experiments carried out on a number of JAVA programs are presented. The experimental results demonstrate the efficiency and efficacy of the framework and show that it can outperform the performance of related approaches.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:3ssty3PwuTgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reliable confidence intervals for software effort estimation",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.232.3732&rep=rep1&type=pdf#page=218",
            "Abstract": "This paper deals with the problem of software effort estimation through the use of a new machine learning technique for producing reliable confidence measures in predictions. More specifically, we propose the use of Conformal Predictors (CPs), a novel type of prediction algorithms, as a means for providing effort estimations for software projects in the form of predictive intervals according to a specified confidence level. Our approach is based on the well-known Ridge Regression technique, but instead of the simple effort estimates produced by the original method, it produces predictive intervals that satisfy a given confidence level. The results obtained using the proposed algorithm on the COCOMO, Desharnais and ISBSG datasets suggest a quite successful performance obtaining reliable predictive intervals which are narrow enough to be useful in practice.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Migration of software components to microservices: Matching and synthesis",
            "Publication year": 2019,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/19062",
            "Abstract": "Nowadays more and more software companies, as well as individual software developers, adopt the microservice architecture for their software solutions. Although many software systems are being designed and developed from scratch, a significant number of existing monolithic solutions tend to be transformed to this new architectural style. What is less common, though, is how to migrate component-based software systems to systems composed of microservices and enjoy the benefits of ease of changes, rapid deployment and versatile architecture. This paper proposes a novel and integrated process for the decomposition of existing software components with the aim being to fully or partially replace their functional parts with by a number of suitable and available microservices. The proposed process is built on semi-formal profiling and utilizes ontologies to match between properties of the decomposed functions of the component and those offered by microservices residing in a repository. Matching concludes with recommended solutions yielded by multi-objective optimization which considers also possible dependencies between the functional parts.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:AmQcmOVUwm0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Key issues for the design and development of mobile commerce services and applications",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMC.2005.006586",
            "Abstract": "This paper suggests a new approach for developing m-commerce services and applications based on a scheme that divides m-applications into directory- and transaction-oriented classes, identifies mobile user requirements, and takes into consideration the constraints of current technologies for mobile and wireless computing. The efficacy of the proposed approach in a real scenario is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Dynamic localisation and automatic correction of software faults using evolutionary mutation testing",
            "Publication year": 2012,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3831",
            "Abstract": "Software testing has recently turned to more sophisticated techniques, like automatic, self-adaptive mutation testing, aiming at improving the effectiveness of the testing process and handling the associated complexity that increases the level of time and effort spent. Mutation testing refers to the application of mutation operators on correctly functioning programs so as to induce common programming errors and then assess the ability of a set of test cases to reveal them. In the above context the present paper introduces a novel methodology for identifying and correcting faults in Java source code using dynamic slicing coupled with mutation testing and enhanced by Genetic Algorithms. A series of experiments was conducted to assess the effectiveness of the proposed approach, using different types of errors and sample programs. The results were quite encouraging as regards the ability of the approach to localise the faults, as well as to suggest the appropriate correction(s) to eliminate them.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:gPamCmV4epEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Facing multicollinearity in a Fuzzy Cognitive Maps environment using bias nodes",
            "Publication year": 2008,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13799",
            "Abstract": "This paper presents an improvement in the Fuzzy Cognitive Maps (FCMs) theory used in modelling dynamical systems. The dynamic behaviour of a system focuses on a stable behaviour reaching equilibrium state at fixed points. Multicollinearity in FCMs, is examined as a phenomenon possibly present in any dynamic modelling. Cases in which the activation level of a concept is constantly driven towards +1 or -1 are investigated. In addition, concepts stabilizing at levels other than those reflecting the actual environment are also considered. These experiments are performed by selectively inserting bias nodes in the map so as to increase the reliability of the dynamic model. Following the theoretical background of FCMs and the mathematical formulation of bias nodes we demonstrate their use and contribution in terms of a case study that deals with the Cyprus Issue in view of the Turkish full EU membership.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:SNyOjmPOlygC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CORPO-DS: A tool to support decision making for component reuse through profiling with ontologies",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-35122-3_29",
            "Abstract": "This paper introduces a software tool that supports the activities of a novel, reuse-based development framework, which focuses on assessing the suitability level of candidate components. The tool enables the creation of a specifications profile using a semi-formal natural language, which describes the desired functional and non-functional properties of the component(s) sought. It also offers the means to parse the profile automatically and translate it into instance values of a dedicated CBSE ontology. Finally, the tool performs matching between required and offered component properties at the level of ontology items and suggests the most suitable components to consider for integration based on a suitability ratio calculated.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:e0CZ6poB34oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Mobile commerce applications and services: a design and development approach",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/43937820/Mobile_commerce_applications_and_service20160320-3201-1e61rq2.pdf",
            "Abstract": "Mobile Commerce is an evolving area of e-Commerce, where users can interact with the service providers through a mobile and wireless network, using mobile devices for information retrieval and transaction processing. M-Commerce services and applications can be adopted through different wireless and mobile networks, with the aid of several mobile devices. However, constraints of both mobile networks and devices influence their operational performance; therefore, there is a strong need for taking into consideration those constraints in the design and development phases of m-Commerce services and applications. Another important factor in designing m-Commerce services and applications is the identification of mobile users requirements. Furthermore, m-Commerce services and applications need to be classified based on the functionality they provide to the mobile users. This kind of classification results in two major classes: the directory and the transaction-oriented services and applications. This paper suggests a new approach for designing and developing m-Commerce services and applications. This approach relies on mobile users needs and requirements, the classification of the m-Commerce services and applications, as well as the current technologies for mobile and wireless computing and their constraints.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid computational models for software cost prediction: an approach using artificial neural networks and genetic algorithms",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00670-8_7",
            "Abstract": "Over the years, software cost estimation through sizing has led to the development of various estimating practices. Despite the uniqueness and unpredictability of the software processes, people involved in project resource management have always been striving for acquiring reliable and accurate software cost estimations. The difficulty of finding a concise set of factors affecting productivity is amplified due to the dependence on the nature of products, the people working on the project and the cultural environment in which software is built and thus effort estimations are still considered a challenge. This paper aims to provide size- and effort-based cost estimations required for the development of new software projects utilising data obtained from previously completed projects. The modelling approach employs different Artificial Neural Network (ANN) topologies and input/output schemes selected heuristically …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "NONPARAMETRIC ANALYSIS OF SOFTWARE RELIABILITY Revealing the Nature of Software Failure Dataseries",
            "Publication year": 2005,
            "Publication url": "https://scitepress.org/papers/2005/25176/",
            "Abstract": "Software reliability is directly related to the number and time of occurrence of software failures. Thus, if we were able to reveal and characterize the behavior of the evolution of actual software failures over time then we could possibly build more accurate models for estimating and predicting software reliability. This paper focuses on the study of the nature of empirical software failure data via a nonparametric statistical framework. Six different time-series data expressing times between successive software failures were investigated and a random behavior was detected with evidences favoring a pink noise explanation.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:-Z8x4v2cOtkC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "An investigation of effort distribution among development phases: A four‐stage progressive software cost estimation model",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smr.1881",
            "Abstract": "Software cost estimation is a key process in project management. Estimations in the initial project phases are made with a lot of uncertainty that influences estimation accuracy which typically increases as the project progresses in time. Project data collected during the various project phases can be used in a progressive time‐dependent fashion to train software cost estimation models. Our motivation is to reduce uncertainty and increase confidence based on the understanding of patterns of effort distributions in development phases of real‐world projects. In this work, we study effort distributions and suggest a four‐stage progressive software cost estimation model, adjusting the initial effort estimates during the development life‐cycle based on newly available data. Initial estimates are reviewed on the basis of the experience gained as development progresses and as new information becomes available. The …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:5kvG9DmRKWYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal Versus Required Defence Spending",
            "Publication year": 2003,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/78663",
            "Abstract": "The recent rescheduling of the Turkish long-term defence procurement programmes following the economic crisis in the country and the reaction of the Greek authorities to reduce their own by about 25% has become the subject of extensive discussions. The issues involved in such discussions concern the possibility of a causal relationship between the developments in the two countries and the extent to which the two sides entangled, for ages now, in an expensive arms race, can afford a reduction of their defence expenditure. This leads to the next question, which involves the calculation of an “optimal” defence burden providing for maximum security in the face of an outside threat bounded by the constraints imposed by the economy.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:52neCvzbxIwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Investigation of Optimal Project Scheduling and Team Staffing in Software Development using Particle Swarm Optimization.",
            "Publication year": 2012,
            "Publication url": "https://www.scitepress.org/Papers/2012/40010/40010.pdf",
            "Abstract": "1Department of Computer Engineering and Informatics, Cyprus University of Technology, 31 Archbishop Kyprianou Ave., PO Box 50329, Lemesos, 3036, Cyprus 2Department of Computer Science, University of Cyprus, 75 Kallipoleos Ave., PO Box 20537, Lefkosia, 1678, Cyprus",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A neural network measurement of relative military security‐the case of Greece and Cyprus",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10430710108404990",
            "Abstract": "This paper aims at introducing a relative security measure, applicable to evaluating the impact of arms races on the military security of allies. This measure is based on demographic criteria, which play a dominant role in a number of arms races involving military alliances. The case of Greece and Cyprus, on one hand, and Turkey on the other, is the one to which our relative security measure is applied and tested. Artificial neural networks were trained to forecast the future behaviour of relative security. The high forecasting performance permitted the application of alternative scenarios for predicting the impact of the Greek‐Turkish arms race on the relative security of the Greek‐Cypriot alliance.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "The arms race between Greece and Turkey: commenting on a major unresolved issue",
            "Publication year": 2006,
            "Publication url": "https://www.degruyter.com/document/doi/10.2202/1554-8597.1092/html",
            "Abstract": "This paper focuses on the controversy that prevails concerning the extent to which an arms race is going on between Greece and Turkey. An examination of the recent contributions on this major issue beginning the year 2000 onwards suggests that the pronounced discrepancies among the conclusions drawn in these papers may be attributed to two major reasons among others: the effectiveness of the techniques employed, as well as the inadequacy of certain policy recipes to treat actual defense incidents.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software cost estimation using artificial neural networks with inputs selection",
            "Publication year": 2007,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13802",
            "Abstract": "Software development is an intractable, multifaceted process encountering deep, inherent difficulties. Especially when trying to produce accurate and reliable software cost estimates, these difficulties are amplified due to the high level of complexity and uniqueness of the software process. This paper addresses the issue of estimating the cost of software development by identifying the need for countable entities that affect software cost and using them with artificial neural networks to establish a reliable estimation method. Input Sensitivity Analysis (ISA) is performed on predictive models of the Desharnais and ISBSG datasets aiming at identifying any correlation present between important cost parameters at the input level and development effort (output). The degree to which the input parameters define the evolution of effort is then investigated and the selected attributes are employed to establish accurate prediction of software cost in the early phases of the software development life-cycle.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:ExBYd_ZNEOYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "eTracer: an innovative object tracking and tracing platform",
            "Publication year": 2011,
            "Publication url": "http://b-dig.iie.org.mx/BibDig2/P11-0295/COMCOM-19.pdf",
            "Abstract": "Near real-time tracking of objects is becoming a critical requirement in transportation business today since competition is increasing and customers are becoming more demanding in obtaining information on services and delivery of products. The technological advancements in the fields of networking (eg, 3G, HSDPA), near field communications (eg, RFID) and location identification (eg, AGPS) provide the potential for the creation of an advanced intelligent tracking platform that identifies and captures an object all across its lifecycle. In the current paper we present such an innovative platform; eTracer which is an end-to-end near realtime tracking platform for objects. In addition, the architecture of eTracer is analyzed and the research issue of reducing the computational intensiveness of processing is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzification and defuzzification process in genetically evolved fuzzy cognitive maps(GEFCMs)",
            "Publication year": 2004,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/51376",
            "Abstract": "This paper describes the fuzzification and defuzzification process in the framework of hybrid systems comprising Fuzzy Cognitive Maps (FCMs) and Genetic Algorithms (GAs). More specifically, it provides a stepwise methodology for fuzzification and defuzzification aiming at both an improved approach of the human reasoning pattern and an increase of the decision-making potentials. The fuzzification process is primarily based on producing fuzzy information provided by a group of experts. Each concept is analyzed into trapezoidal membership functions of either fixed or variable widths, with these intervals labeled and stored for the defuzzification process later on, during which the levels are matched according to the membership functions of each concept. The defuzzification process is more complicated than the fuzzification one and consists of four basic iterative stages: The Iteration, the Max-Min Average Computation, the Categorization and, finally, the Realization Inference Stage.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "World Scientific and Engineering Academy and Society, Ag. Ioannou Theologou 17-23, Athens, 15773, Zographou, Greece,"
        },
        {
            "Title": "A variational latent variable model with recurrent temporal dependencies for session-based recommendation (VLaReT)",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-74817-7_4",
            "Abstract": "This paper presents an innovative deep learning model, namely the Variational Latent Variable Model with Recurrent Temporal Dependencies for Session-Based Recommendation (VLaReT). Our method combines a Recurrent Neural Network with Amortized Variational Inference (AVI) to enable increased predictive learning capabilities for sequential data. We use VLaReT to build a session-based Recommender System that can effectively deal with the data sparsity problem. We posit that this capability will allow for producing more accurate recommendations on a real-world sequence-based dataset. We provide extensive experimental results which demonstrate that the proposed model outperforms currently state-of-the-art approaches.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:AdGrMoNItN4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Supporting decision making in mobile software development: A fuzzy cognitive maps approach",
            "Publication year": 2013,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/9825",
            "Abstract": "Mobile Software Development has rapidly evolved from the closed environments of in-house development performed by the manufacturers of mobile devices to the widely available Software Development Kits that made development available to practically everyone. The easy distribution of applications on online markets like App Store and Google Play makes their development very tempting for developers who move from traditional software to mobile applications. As with desktop systems, mobile application developers face a number of difficult decisions that need to take prior to and during the development process. This paper proposes a decision support model based on Fuzzy Cognitive Maps that assists developers to assess whether they should go ahead and develop a mobile application or not based on a number of factors and specifications. In fact the map models the outcome of the complex interaction between competing factors and estimates which ones will finally prevail. A validation process with realistic and real-world cases proved that the model performs quite successfully.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:cocyvO7vrcwC",
            "Publisher": "Insticc"
        },
        {
            "Title": "Long-term dependence in exchange rates",
            "Publication year": 2000,
            "Publication url": "https://www.hindawi.com/journals/ddns/2000/637682/",
            "Abstract": "The extent to which exchange rates of four major currencies against the Greek Drachma exhibit long-term dependence is investigated using a   analysis testing framework. We show that both classic  analysis and the modified  statistic if enhanced by bootstrapping techniques can be proven very reliable tools to this end. Our findings support persistence and long-term dependence with non-periodic cycles for the Deutsche Mark and the French Franc series. In addition a noisy chaos explanation is favored over fractional Brownian motion. On the contrary, the US Dollar and British Pound were found to exhibit a  much more random behavior and lack of any long-term structure.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multi-objective genetic algorithm for intelligent software project scheduling and team staffing",
            "Publication year": 2013,
            "Publication url": "https://content.iospress.com/articles/intelligent-decision-technologies/idt00151",
            "Abstract": "Allocation of human resources is considered one of the most important activities carried out by software project managers, since human resources are essentially the only type of resource utilized in software development. Part of human resource allocation involves the scheduling of tasks and the staffing of teams with suitable developers, which for project managers are activities that are often very difficult to carry out due to the large number of possible permutations and factors influencing selection. In addition, no standardized technique is available for software project managers that can be adopted to carry out these activities. Consequently, proper human resource allocation is now gradually being regarded as a critical factor that can influence software project success and can directly contribute to providing customers with software products on time, within budget and with the adequate level of quality. The aim of the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A novel methodology to formalize the requirements engineering process with the use of natural language",
            "Publication year": 2010,
            "Publication url": "http://www.iadisportal.org/digital-library/a-novel-methodology-to-formalize-the-requirements-engineering-process-with-the-use-of-natural-language",
            "Abstract": "Paper Abstract: The lack of a formal approach with high expressiveness close to that of natural language drives systems analysts to use their own informal ways to engineer requirements. This paper describes a novel methodology that attempts to formalize a large part of the Requirements Engineering (RE) process, including Discovery, Analysis and Specification of requirements. The formalization is achieved by utilizing elements of natural language syntax and semantics, with the focus being on keeping ambiguities low and expressiveness high. In particular, Requirements Engineering is converted to a series of predefined steps, through which the analyst is guided in advance what specific types of data and functions to use, how to form and document them, and, more importantly, what (predefined) questions to ask the stakeholders in order to correctly elicit their needs. The proposed methodology can take an object …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Empirical evidence and state of practice of software agile teams",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smr.1664",
            "Abstract": "The paper provides an in depth analysis of empirical evidence on the state of practice within the agile domain obtained through a survey conducted in 2012. The context of focus is agile software processes and teams and the particular topics of interest revolve around three axes: (i) communication; (ii) project management; and (iii) quality assurance and validation. The aim of the survey is to deliver the current levels of agile adoption and practices as these are recorded in the responses of professionals in IT services and the software industry. The goal of the survey is to provide evidence‐based assessment of the level of agile adoption by software development organizations, in relation to the general profile of the respondents (country of origin, business sectors, roles, etc.) and compared with different types of practices followed, such as agile techniques adopted, team organization and communication techniques …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:7CU1mCQUTf4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Greek Current Account Deficit: Is it Sustainable after all?",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/43937811/Paper200998.pdf",
            "Abstract": "The large Greek current account deficit figures reported during the past few years have become the source of increasing concern regarding its sustainability. Bearing in mind the variety of techniques employed and the views expressed as regards the analysis and the assessment of the size of the current account deficit, this paper resorts to using neural network architectures to demonstrate that, despite its size, the current account deficit of Greece can be considered sustainable. This conclusion, however, is not meant to neglect the structural weaknesses that lead to such a deficit. In fact, even in the absence of any financing requirements these high deficit figures point to serious competitiveness losses with everything that these may entail for the future performance of the Greek economy.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:mB3voiENLucC",
            "Publisher": "Bank of Greece"
        },
        {
            "Title": "A quality framework for developing and evaluating original software components",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950584906000437",
            "Abstract": "Component-based software development is being identified as the emerging method of developing complex applications consisting of heterogeneous systems. Although more research attention has been given to Commercial Off The Shelf (COTS) components, original software components are also widely used in the software industry. Original components are smaller in size, they have a narrower functional scope and they usually find more uses when it comes to specific and dedicated functions. Therefore, their need for interoperability is equal or greater, than that of COTS components. A quality framework for developing and evaluating original components is proposed in this paper, along with an application methodology that facilitates their evaluation. The framework is based on the ISO9126 quality model which is modified and refined so as to reflect better the notion of original components. The quality model …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Multi-purpose HealthCare Telemedicine Systems with mobile communication link support",
            "Publication year": 2003,
            "Publication url": "https://biomedical-engineering-online.biomedcentral.com/articles/10.1186/1475-925x-2-7",
            "Abstract": "The provision of effective emergency telemedicine and home monitoring solutions are the major fields of interest discussed in this study. Ambulances, Rural Health Centers (RHC) or other remote health location such as Ships navigating in wide seas are common examples of possible emergency sites, while critical care telemetry and telemedicine home follow-ups are important issues of telemonitoring. In order to support the above different growing application fields we created a combined real-time and store and forward facility that consists of a base unit and a telemedicine (mobile) unit. This integrated system: can be used when handling emergency cases in ambulances, RHC or ships by using a mobile telemedicine unit at the emergency site and a base unit at the hospital-expert's site, enhances intensive health care provision by giving a mobile base unit to the ICU doctor while the telemedicine unit remains at the ICU patient site and enables home telemonitoring, by installing the telemedicine unit at the patient's home while the base unit remains at the physician's office or hospital. The system allows the transmission of vital biosignals (3–12 lead ECG, SPO2, NIBP, IBP, Temp) and still images of the patient. The transmission is performed through GSM mobile telecommunication network, through satellite links (where GSM is not available) or through Plain Old Telephony Systems (POTS) where available. Using this device a specialist doctor can telematically \"move\" to the patient's site and instruct unspecialized personnel when handling an emergency or telemonitoring case. Due to the need of storing and archiving of all data interchanged during …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:u5HHmVD_uO8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "The Greek-Turkish Arms Race Using Artificial Neural Networks",
            "Publication year": 2003,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/78576",
            "Abstract": "The aim of this paper is to forecast the pressure due to this arms race between Greece and Turkey exercised on the economy of the former. This forecast, established on the basis of the most appropriate explanatory variables, will provide the opportunity to comment on the nature and relative importance of the explanatory variables that determine the burden of this arms race on the Greek economy, as this is approximated by either the military debt of the country or the defence share of GDP. The method of analysis used is that of Artificial Neural Networks, which has been considered preferable to the conventional estimation methods for the purposes of the present analysis for reasons analyzed later on in this paper.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:pxLfhFzThFYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal versus required defence expenditure: The case of the Greek-Turkish arms race",
            "Publication year": 2002,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10242690212360",
            "Abstract": "The aim of this paper is to indicate the extent to which the arms race against Turkey, in which Greece and Cyprus have been entangled, imposes a defence expenditure burden that is tough for the two allies to bear. To do so we have resorted to evaluating the optimal military expenditure for the two countries, allied in the context of the Integrated Defence Doctrine, which is compatible with the constraints imposed by the resources of their economies. All experiments and scenarios examined lead to the conclusion that the current defence burden of the two allies seems to be driving their economies beyond capacity limits. The fact remains, however, that under the circumstances, a one-sided disarmament policy like the one currently followed by Greece, is a risky choice given that the long-term armament programmes pursued by Turkey, whose role in this arms race has been proven as leading, leave very small room to …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:8k81kl-MbHgC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Multi-objective evolutionary fuzzy cognitive maps for decision support",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1554768/",
            "Abstract": "This paper proposes an extension of genetically evolved fuzzy cognitive maps (GEFCMs) used for decision-making, aiming at increasing their reliability and overcoming its main weakness which lies with the recalculation of weights corresponding to more than one concept every time a new multiple scenario is introduced. A new evolutionary approach is proposed to support multi-objective decision-making based on the introduction of a dedicated genetic algorithm (GA), which is responsible for finding an optimal weight matrix that satisfies two or more activation levels among the participating concept nodes. This evolutionary methodology is very appealing since it offers the optimal solution without a problem-solving strategy once the requirements are defined",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent Software Project Scheduling and Team Staffing with Genetic Algorithms",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-23960-1_21",
            "Abstract": "Software development organisations are under heavy pressure to complete projects on time, within budget and with the appropriate level of quality, and many questions are asked when a project fails to meet any or all of these requirements. Over the years, much research effort has been spent to find ways to mitigate these failures, the reasons of which come from both within and outside the organisation’s control. One possible risk of failure lies in human resource management and, since humans are the main asset of software organisations, getting the right team to do the job is critical. This paper proposes a procedure for software project managers to support their project scheduling and team staffing activities – two areas where human resources directly impact software development projects and management decisions – by adopting a genetic algorithm approach as an optimisation technique to help solve …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "Computational intelligence in exchange-rate forecasting",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/43937815/Paper200649.pdf",
            "Abstract": "This paper applies computational intelligence methods to exchange rate forecasting. In particular, it employs neural network methodology in order to predict developments of the Euro exchange rate versus the US Dollar and the Japanese Yen. Following a study of our series using traditional as well as specialized, non-parametric methods together with Monte Carlo simulations we employ selected Neural Networks (NNs) trained to forecast rate fluctuations. Despite the fact that the data series have been shown by the Rescaled Range Statistic (R/S) analysis to exhibit random behaviour, their internal dynamics have been successfully captured by certain NN topologies, thus yielding accurate predictions of the two exchange-rate series.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:UebtZRa9Y70C",
            "Publisher": "Bank of Greece"
        },
        {
            "Title": "A smart product co-design and monitoring framework via gamification and complex event processing",
            "Publication year": 2019,
            "Publication url": "https://ktisis.cut.ac.cy/handle/10488/19082",
            "Abstract": "In the traditional software development cycle, requirements gathering is considered the most critical phase. Getting the requirements right early has become a dogma in software engineering because the correction of erroneous or incomplete requirements in later software development phases becomes overly expensive. For product-service systems (PSS), this dogma and standard requirements engineering (RE) approaches are not appropriate because classical RE is considered concluded once a product service is delivered. This paper proposes a novel framework that enables the customer and the product engineer to co-design smart products by integrating three novel and advanced technologies to support: view-based modelling, visualization and monitoring, i.e., Product-Oriented Configuration Language (PoCL), gamification and Complex Event Processing (CEP), respectively. These create a “digital-twin” model of the connected ‘smart’ factory of the future. The framework is formally founded on the novel concept of manufacturing blueprints, which are formalized knowledge-intensive structures that provide the basis for actionable PSS and production “intelligence” and a move toward more fact-based manufacturing decisions. Implementation and validation of the proposed framework through real-life case studies are ongoing to validate the applicability, utility and efficacy of the proposed solutions.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:mzRTpvMFn3IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formalizing and automating use case model development",
            "Publication year": 2012,
            "Publication url": "https://benthamopen.com/ABSTRACT/TOSEJ-6-21",
            "Abstract": "This paper proposes an approach that formalizes specific elements and activities of the use case modeling process in order to overcome problematic issues common to the conventional use case methods, namely the lack of systematic elicitation support in the identification of use case elements, the vagueness introduced by the use of informal natural language to define use case specifications, and the limited support of dedicated software tools that makes UCDA a timeconsuming and error-prone activity. In particular, with the use of our approach, formalization of the stage for identifying the use case elements is achieved with the use of predefined types of use cases and actors, specific guidelines to define associations, relationships and business rules, and formalized sentential patterns. Formalization and clarity of the use case specification is achieved with the use of specific types of actions and guidelines, on one hand, and natural language-based authoring rules, on the other. A dedicated software tool supports the automation of the proposed approach including the automated generation of use case diagrams and specifications. Preliminary empirical evaluation of the proposed approach indicated its effectiveness and efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hybrid Computational Models for So ware Cost Prediction: An Approach Using Artificial Neural Networks and Genet...",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/43937803/Hybrid_Computational_Models_for_Software20160320-12805-1mczj09.pdf",
            "Abstract": "Over the years, software cost estimation through sizing has led to the development of various estimating practices. Despite the uniqueness and unpredictability of the software processes, people involved in project resource management have always been striving for acquiring reliable and accurate software cost estimations. The difficulty of finding a concise set of factors affecting productivity is amplified due to the dependence on the nature of products, the people working on the project and the cultural environment in which software is built and thus effort estimations are still considered a challenge. This paper aims to provide size-and effort-based cost estimations required for the development of new software projects utilising data obtained from previously completed projects. The modelling approach employs different Artificial Neural Network (ANN) topologies and input/output schemes selected heuristically, which target at capturing the dynamics of cost behavior as this is expressed by the available data attributes. The ANNs are enhanced by a Genetic Algorithm (GA) whose role is to evolve the network architectures (both input and internal hidden layers) by reducing the Mean Relative Error (MRE) produced by the output results of each network.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:s-mE-ZzancgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A real-time targeted recommender system for supermarkets",
            "Publication year": 2017,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/12689",
            "Abstract": "Supermarket customers find it difficult to choose from a large variety of products or be informed for the latest offers that exist in a store based on the items that they need or wish to purchase. This paper presents a framework for a Recommender System deployed in a supermarket setting with the aim of suggesting real-Time personalized offers to customers. As customers navigate in a store, iBeacons push personalized notifications to their smart-devices informing them about offers that are likely to be of interest. The suggested approach combines an Entropy-based algorithm, a Hard k-modes clustering and a Bayesian Inference approach to notify customers about the best offers based on their shopping preferences. The proposed methodology improves the customer's overall shopping experience by suggesting personalized items with accuracy and efficiency. Simultaneously, the properties of the underlying techniques used by the proposed framework tackle the data sparsity, the cold-start problem and other scalability issues that are often met in Recommender Systems. A preliminary setup in a local supermarket confirms the validity of the proposed methodology, in terms of accuracy, outperforming the traditional Collaborative Filtering approaches of user-based and item-based.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:HkunuPqSaCsC",
            "Publisher": "SciTePress"
        },
        {
            "Title": "Integrating non-parametric models with linear components for producing software cost estimations",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121214002088",
            "Abstract": "A long-lasting endeavor in the area of software project management is minimizing the risks caused by under- or over-estimations of the overall effort required to build new software systems. Deciding which method to use for achieving accurate cost estimations among the many methods proposed in the relevant literature is a significant issue for project managers. This paper investigates whether it is possible to improve the accuracy of estimations produced by popular non-parametric techniques by coupling them with a linear component, thus producing a new set of techniques called semi-parametric models (SPMs). The non-parametric models examined in this work include estimation by analogy (EbA), artificial neural networks (ANN), support vector machines (SVM) and locally weighted regression (LOESS). Our experimentation shows that the estimation ability of SPMs is superior to their non-parametric …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:Qy-rCirNo-8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "ETracer: An innovative object tracking and tracing platform",
            "Publication year": 2011,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13753",
            "Abstract": "Near real-time tracking of objects is becoming a critical requirement in transportation business today since competition is increasing and customers are becoming more demanding in obtaining information on services and delivery of products. The technological advancements in the fields of networking (e.g., 3G, HSDPA), near field communications (e.g., RFID) and location identification (e.g., AGPS) provide the potential for the creation of an advanced intelligent tracking platform that identifies and captures an object all across its lifecycle. In the current paper we present such an innovative platform; eTracer which is an end-to-end near realtime tracking platform for objects. In addition, the architecture of eTracer is analyzed and the research issue of reducing the computational intensiveness of processing is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:AOwgc6nnr1EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Department of Computer Engineering & Informatics, School of Engineering, University of Patras",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=EQX3BwAAQBAJ&oi=fnd&pg=PA461&dq=info:ONtXKDRLLvAJ:scholar.google.com&ots=jW5g8a8jY0&sig=mUV0DEwLLrqjJLHs6mRMbTbPKSI",
            "Abstract": "In recent years, there has been an increasing number of papers in the literature that use neural networks for financial time-series prediction. This paper focuses on the Greek Foreign Exchange Rate Currency Market. Using four major currencies, namely the US Dollar (USD), the Deutsche Mark (DM), the French Franc (FF) and the British Pound (BP), against the Greek Drachma, on a daily basis for a period of 11 years, we try to forecast the above time-series, using two different approaches. The first one involves RBF training using a Kalman filter, while the second one uses genetic algorithms in order to optimize the RBF network parameters. The goal of this effort, is, first, to predict, as accurately as possible, currencies future behaviour, in a daily predicting horizon and second, to have a comparison between the two methods.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:3UHJKpZgG5wC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Financial vs human resources in the Greek-Turkish arms race 10 years on",
            "Publication year": 2010,
            "Publication url": "https://mpra.ub.uni-muenchen.de/id/eprint/38505",
            "Abstract": "This paper looks into the Greek – Turkish arms race a decade after an earlier contribution on the issue that relied heavily on Artificial Neural Networks. The time period between the two papers contributes to the reliability of the results derived, not just by increasing the number of observations, but mainly by incorporating the progress made in the realm of Artificial Intelligence. The focus on the case of both counties unlike the paper mentioned above which dealt with just the Greek side provides ample room for comparative purposes regarding the determinants of defence spending on both sides.  The results derived in terms of input significance estimation support the findings of earlier research as indicated above, pointing to the leading role of the demographic preponderance of Turkey over Greece. The paper also points to the fact that ten years later, Turkey continues to set the arms race rules against its rival by determining the defence expenditure of Greece while the role of the latter in affecting the military spending of Turkey is non-existent.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:XJogQLJr2CkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An automatic software test-data generation scheme based on data flow criteria and genetic algorithms",
            "Publication year": 2007,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13806",
            "Abstract": "Software test-data generation research primarily focuses on using control flow graphs for producing an optimum set of test cases. This paper proposes the integration of a data flow graph module with an existing testing framework and the utilisation of a specially designed genetic algorithm for automatically generating test cases based on data flow coverage criteria. The enhanced framework aims to explore promising aspects of software testing that have not yet received adequate research attention, by exploiting the data information of a program and provide a different testing coverage approach compared to existing control flow-oriented ones. The performance of the proposed approach is assessed and validated on a number of sample programs of different levels of size and complexity. The associated experimental results indicate successful performance in terms of testing coverage, which is significantly better when compared to those of existing dynamic data flow-oriented test data generation methods. © 2007 IEEE.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:2hrGa7H818QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Recurrent Latent Variable Model for Supervised Modeling of High-Dimensional Sequential Data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8466296/",
            "Abstract": "In this work, we attempt to ameliorate the impact of data sparsity in the context of supervised modeling applications dealing with high-dimensional sequential data. Specifically, we seek to devise a machine learning mechanism capable of extracting subtle and complex underlying temporal dynamics in the observed sequential data, so as to inform the predictive algorithm. To this end, we improve upon systems that utilize deep learning techniques with recurrently connected units; we do so by adopting concepts from the field of Bayesian statistics, namely variational inference. Our proposed approach consists in treating the network recurrent units as stochastic latent variables with a prior distribution imposed over them. On this basis, we proceed to infer corresponding posteriors; these can be used for prediction generation, in a way that accounts for the uncertainty in the available sparse training data. To allow for our …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:fHS53ZCY-AEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analyzing SoCial InteraCtion and Usability of MediCal InformatiCs: The Case of the Aristophanes System",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Athina-Lazakidou/publication/228742355_Analysing_Social_Interaction_and_Usability_of_Medical_informatics_The_Case_of_the_Aristophanes_System/links/0912f5108d680f1f92000000/Analysing-Social-Interaction-and-Usability-of-Medical-informatics-The-Case-of-the-Aristophanes-System.pdf",
            "Abstract": "Electronic Patient Record Systems (EPRS) hold an exceptional position in the field of Medical Informatics. The aim of such systems is to replace the traditional paper-based patient recording, offering at the same time a set of advanced data exchange functionalities modern computers and networks can offer. ARISTOPHANES is a flexible and efficient EPRS, designed to serve surgery wards. This paper focuses on the analysis of certain social and ethical factors that must be taken into account when designing EPRS from an end-user’s point of view. Furthermore the paper aims at demonstrating the methods used by the ARISTOPHANES system to cover usability and human-computer interaction aspects.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An alliance between Cyprus and Greece: assessing its partners’ relative security contribution",
            "Publication year": 2004,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10242690420001688224",
            "Abstract": "The issue that this paper tackles is the assessment of the relative security benefits that Cyprus and Greece derive in the context of their cooperation on defence matters. This form of cooperation, known as the ‘Integrated Defence Space Doctrine’, aims at defending their interests in the Aegean Sea and the broader East Mediterranean theatre. The paper relies heavily on earlier research on this topic, which deals with the Greek–Cypriot alliance facing an arms race against Turkey, and uses a coefficient especially designed to assess the optimal levels of security and the associated defence expenditure of the two allies. A comparison of the relative security coefficient values for the two allies suggests that the security benefit that Greece derives thanks to its alliance with Cyprus exceeds the corresponding Cypriot benefit by far. Given the importance assigned to human resources by this index, in conjunction with the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:M05iB0D1s5AC",
            "Publisher": "Taylor & Francis Ltd"
        },
        {
            "Title": "Testing the predictability of the Cyprus Stock Exchange: The case of an emerging market",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/859422/",
            "Abstract": "A systematic investigation of the effect of different neural network architecture alternatives for predicting the future course of stock prices in the Cyprus Stock Exchange (CSE) market is conducted. This market exhibited an abrupt increase in the general index price during the last year, thus forming a very interesting case for research purposes. The influence of various economic and political factors, from both the local and the international scene, have also been examined. The main conclusion drawn is that the CSE market is governed by unique conditions which when properly modeled can yield successful predictions.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Human resource allocation and scheduling for software project management",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-55035-5_4",
            "Abstract": "Software project management consists of a number of planning, organizing, staffing, directing and controlling activities. Human resources feature prominently in all of these activities and, as a consequence, they can affect and determine project management decisions. Therefore, in order to help guarantee the success of a software project, managers must take into consideration this type of resource when performing the aforementioned activities. This chapter specifically investigates human resources from a planning perspective and, in particular, focuses on the responsibilities of allocating developers and teams to project tasks, scheduling developers and teams, as well as forming development teams. These responsibilities are often challenging to undertake because they are accompanied by time, budget and quality constraints, which software project managers find difficult to balance correctly. The purpose …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:zTJoPluU4X4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On defence expenditure reduction: balancing between austerity and security in Greece",
            "Publication year": 2013,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/peps-2013-0030/html",
            "Abstract": "This paper aims at contributing a literature update by assessing the impact of policies focusing on defence-procurement spending on the growth rate of the Greek economy with special reference to the recent crisis environment using artificial neural networks. The main conclusion drawn in the case of the Greek economy in general and during austerity times in particular, is that defence-procurement policy is considerably inflexible concerning both increases and reductions. In fact any further decreases will have a direct impact on the security of the country given the dramatic reduction of the defence budget and the arms race against Turkey. By contrast, any increases will only burden the balance of payments without adding to the GDP, once the bulk of the defence equipment is imported due to the inefficiency of the domestic defence industrial base. A compromise, therefore, between security and austerity would call …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:kzcrU_BdoSEC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "An investigation of software effort phase distribution using compositional data analysis",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6328177/",
            "Abstract": "One of the most significant problems faced by project managers is to effectively distribute the project resources and effort among the various project activities. Most importantly, project success depends on how well, or how balanced, the work effort is distributed among the project phases. This paper aims to obtain useful information regarding the correlation of the composition of effort attributed in phases for around 1,500 software projects of the ISBSG R11 database based on a promising statistical method called Compositional Data Analysis (CoDA). The motivation for applying this analysis is the observation that certain types of project data (effort distributions and attributes) do not relate in a direct way but present a spurious correlation. Effort distribution is compared to the project life-cycle activities, organization type, language type, function points and other prime project attributes. The findings are beneficial for …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An automatic software test-data generation scheme based on data flow criteria and genetic algorithms",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4385194/",
            "Abstract": "Software test-data generation research primarily focuses on using control flow graphs for producing an optimum set of test cases. This paper proposes the integration of a data flow graph module with an existing testing framework and the utilisation of a specially designed genetic algorithm for automatically generating test cases based on data flow coverage criteria. The enhanced framework aims to explore promising aspects of software testing that have not yet received adequate research attention, by exploiting the data information of a program and provide a different testing coverage approach compared to existing control flow-oriented ones. The performance of the proposed approach is assessed and validated on a number of sample programs of different levels of size and complexity. The associated experimental results indicate successful performance in terms of testing coverage, which is significantly better …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multivariate statistical framework for the analysis of software effort phase distribution",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950584914002420",
            "Abstract": "In software project management, the distribution of resources to various project activities is one of the most challenging problems since it affects team productivity, product quality and project constraints related to budget and scheduling.The study aims to (a) reveal the high complexity of modelling the effort usage proportion in different phases as well as the divergence from various rules-of-thumb in related literature, and (b) present a systematic data analysis framework, able to offer better interpretations and visualisation of the effort distributed in specific phases.The basis for the proposed multivariate statistical framework is Compositional Data Analysis, a methodology appropriate for proportions, along with other methods like the deviation from rules-of-thumb, the cluster analysis and the analysis of variance. The effort allocations to phases, as reported in around 1500 software projects of the …",
            "Abstract entirety": 0,
            "Author pub id": "CqlJG_IAAAAJ:vbti4gW_9XwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Evaluating risks in software negotiations through fuzzy cognitive maps",
            "Publication year": 2009,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/13757",
            "Abstract": "Risks are inevitably and permanently present in software negotiations and they can directly influence the success or failure of negotiations. Risks should be avoided when they represent a threat and encouraged when they denote an opportunity. This work examines the influence of some negotiation elements in the area of risk and cost estimation, which are both factors that directly influence software development negotiation. In this work, risk quantification is proposed to translate its impact to measurable values that may be taken into consideration during negotiations. The model proposed involves an assessment tool based on basic negotiation elements - namely relationship, interests, cost and time - quantifying the influences among each other, and makes use of Fuzzy Cognitive Maps (FCMs) for developing the associations around basic risk elements on one hand and attaining an innovative risk quantification model for improved software negotiations on the other. Indicative scenarios are presented to demonstrate the efficacy of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:jvrRlaHg2sAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing recommender systems development with human, social, cultural and organizational factors",
            "Publication year": 2011,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/3835",
            "Abstract": "Recommender Systems (RS) aim at suggesting filtered Web information adapted to the needs or interests of users by predicting their access behavior using a certain strategy or algorithm. The creation of RS is usually approached focusing mostly on user behavior modeling, while the recommendation engine often neglects critical, non-technical aspects of software systems development. Conceiving a RS primarily as a self-contained or part of a Web-application, the present paper utilizes the SpiderWeb methodology and takes into account important requirements that result from human, cultural, social and organizational factors (HSCO) so as to drive the RS development activities.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:UFuRdyijzaAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "In search of a warning strategy against exchange-rate attacks: Forecasting tactics using artificial neural networks",
            "Publication year": 2000,
            "Publication url": "https://www.hindawi.com/journals/ddns/2000/870207/",
            "Abstract": "“Heart attacks and devaluations are not predictable and, certainly, are never preannounced”. (The usual remark made by government spokesmen shortly after a domestic currency devaluation has taken place.) The contribution that this paper aspires to make is the prediction of an oncoming attack against the domestic currency, something that is expected to increase the possibilities of successful hedging by the authorities. The analysis has focused on the Greek Drachma, which has suffered a series of attacks during the past few years, thus offering a variety of such “shock” incidents accompanied by frequent interventions by the authorities. The prediction exercised here is performed in a discrete dynamics environment, based on the daily fluctuations of the interbank overnight interest rate, using artificial neural networks enhanced by genetic algorithms. The results obtained on the basis of the forecasting performance have been considered most encouraging, in providing a successful prediction of an oncoming attack against the domestic currency.",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:p2g8aNsByqUC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Jinius-link: A distributed architecture for mobile services based on localization and personalization",
            "Publication year": 2004,
            "Publication url": "http://www.iadisportal.org/digital-library/jinius-link-a-distributed-architecture-for-mobile-services-based-on-localization-and-personalization",
            "Abstract": "Paper Abstract: This paper proposes a new distributed architecture for mobile services called JINIUS-Link, based on localization and personalization of mobile users. The JINIUS-Link comprises a PDA device, a web server, service-agents and Jini platforms. The Jini platform is utilized as an intermediary for the location of a user and its agent, which coordinates and retrieves the requested services. Agents are developed to assist users in finding information, storing personal preferences, as well as supporting and informing users even at non-connection periods. The JINIUS-Link allows for immediate updates of information providing fault tolerance, flexibility and efficiency, something which significantly improves the quality of service",
            "Abstract entirety": 1,
            "Author pub id": "CqlJG_IAAAAJ:IwGqIHSOC8kC",
            "Publisher": "Unknown"
        }
    ]
}]