[{
    "name": "Αναστάσιος Μικρόπουλος",
    "romanize name": "Anastasios Mikropoulos",
    "School-Department": "Παιδαγωγικό Δημοτικής Εκπαίδευσης",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 9865,
    "Scholar name": "Tassos Anastasios Mikropoulos",
    "Scholar id": "3ZaLmnkAAAAJ",
    "Affiliation": "Professor of Virtual Realitry in Education, University of Ioannina",
    "Citedby": 2694,
    "Interests": [
        "ICT in education",
        "Virtual learning environments",
        "ICT in Special Education"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=3ZaLmnkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Pandemien und Ethik",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-662-63530-8.pdf",
            "Abstract": "Pandemien und Ethik Andreas Reis Martina Schmidhuber Andreas Frewer Hrsg. \nPandemien und Ethik Entwicklung–Probleme–Lösungen Page 2 Pandemien und Ethik \nPage 3 Andreas Reis• Martina Schmidhuber Andreas Frewer Hrsg. Pandemien und Ethik \nEntwicklung–Probleme–Lösungen Page 4 ISBN 978-3-662-63529-2 ISBN 978-3-662-63530-8 \n(eBook) https://doi. org/10.1007/978-3-662-63530-8 Die Deutsche Nationalbibliothek \nverzeichnet diese Publikation in der Deutschen Nationalbibliografie; detaillierte \nbibliografische Daten sind im Internet über http://dnb. d-nb. de abrufbar. Springer © Der/die \nHerausgeber bzw. der/die Autor (en), exklusiv lizenziert durch Springer-Verlag GmbH, DE, \nein Teil von Springer Nature 2021 Das Werk einschließlich aller seiner Teile ist \nurheberrechtlich geschützt. Jede Verwertung, die nicht ausdrücklich vom \nUrheberrechtsgesetz zugelassen ist, bedarf der vorherigen des . Das , …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer Berlin"
        },
        {
            "Title": "Embodiment of the Communicative “Other”: Mode of Communication and Social Presence in Educational Virtual Environments",
            "Publication year": 2014,
            "Publication url": "https://www.learntechlib.org/p/147852/",
            "Abstract": "Embodiment of the communicative “other” and. mode of communication seem to be important factors for social presence. This study investigates the impact of these factors on social presence in an Educational Virtual Environment. Eighty two students participated in a 2x2 experiment (embodiment vs. non-embodiment x voice-chat vs. text chat), which was designed as a guided-teaching activity in Second Life. Results show that embodiment of the communicative other does not affect social presence and other presence dimensions, while communicating via voice elicits higher levels of social presence than communicating via text. More research is needed in order to identify the role of each one of the above factors to social presence in Educational Virtual Environments.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:isC4tDSrTZIC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Design of virtual environments for the comprehension of planetary phenomena based on students' ideas",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09500690305027",
            "Abstract": "Children enter the classroom with a wide range of misconceptions about planetary phenomena. Conventional teaching methods usually cannot overcome these difficulties, which we consider may be because of the lack of appropriate teaching aids. The purpose of the present study is the design and development of an educational virtual environment for the support of the teaching of planetary phenomena, particularly of the movements of the Earth and Sun, the day and night cycle and the change of seasons. Our interactive three-dimensional (3D) virtual environment was based on the results of an empirical study of 102 secondary school students and provides students with new experiences, personal involvement and close-up examination of the phenomena under study. Our first results after the use of the virtual environment showed that the majority of students enthused about interacting with it and modified their …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Presence in a collaborative science learning activity in second life",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-1083-6_18",
            "Abstract": "Multi-user virtual environments (MUVEs) are surrounded by hype regarding their impact on and potential in education. Many issues regarding the educational affordances of MUVEs and the learning experience of users are still under research. Presence is an important phenomenon users experience when interacting with and via virtual environments and seems to play an important role in learning. This chapter presents empirical data gathered from an exploratory study regarding a problem-based physics learning activity in Second Life (SL). Our aim is to gain knowledge and experience about the sense of presence (spatial and social) that emerges while students collaborate in MUVEs. Students (n = 30) collaborated “in-world” to solve a problem. Data were gathered using the Temple Presence Inventory questionnaire. Results indicate higher scores of social presence than spatial presence. Correlations …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "The use of robotics in introductory programming for elementary students",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-55553-9_14",
            "Abstract": " Studies have shown that teaching programming to students is often a difficult task. The programming language itself is not as much a challenge as the concepts and structures, which define it. This paper explores the use of educational robotics to introduce basic programming concepts through meaningful teaching and learning activities with the hands-on use of bee-bots. The results from an empirical study show that students can successfully develop algorithmic thinking and programming skills based on their knowledge acquired by the bee-bots. Thanks to the tactile interaction with robots, students developed their creativity and imagination as built systems with Lego WeDo, all the while enjoying the course through teamwork activities. ",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Being inside the Quantum Atom",
            "Publication year": 2008,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/14940",
            "Abstract": "Repository of UOI \"Olympias\": Being inside the Quantum Atom Skip navigation Home Browse \nCommunities & Collections Browse Items by: Issue Date Author Title Subject Item Type Advanced \nSearch Help About DSpace Sign on to: My DSpace Receive email updates Edit Profile Saved \nSearches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \n\"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών Αγωγής 4.Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης 5.Άρθρα \nσε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link to \nthis item: https://olympias.lib.uoi.gr/jspui/handle/123456789/14940 Institution and \nSchool/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών Αγωγής. \nΠαιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης Keywords: Quantum Mechanics, Atomic Model, \nEducational Virtual Environments, Presence, Learning Outcomes URI: https://olympias.lib.uoi.gr////: …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agency affects learning outcomes with a serious game",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-50506-6_20",
            "Abstract": "Clark’s (2013) prediction-action cognitive architecture predicts that active learners are more likely to learn. Even though this vision is widely spread in education, it has not been rigorously tested yet. This study investigated if agency while playing Mecanika, a serious educational game about Newtonian Physics knowledge, is beneficial to learning. Participants were 74 French-speaking undergraduate students with a novice background in Physics. Participants were paired and randomly designated as an active player or a passive watcher. Players played Mecanika for two hours while watchers were looking in real time on a separate screen a duplicate of the player’s screen. Dual-EEG was recorded to derive cognitive load and cognitive engagement metrics. Before and after the experiment, participants filled a Physics knowledge questionnaire, the Force Concept Inventory (Hestenes et al. 1992), where each of the five …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Brain Activity and Visual Scientific Content: A Study on Earthquake Precaution",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22933-1_4",
            "Abstract": "Scientific thinking and science education involve, among others, cognitive processes. The cognitive processes can be detected through neuroimaging techniques and contribute to a better understanding of the environmental stimuli used in science education. Electric brain activity of 15 female students was analysed at theta and alpha frequency bands while interacting with affective visual stimuli in a digital learning environment for earthquake precaution measures. The participants recognized all the ten objects, showed visual awareness and mental effort and distinguished their meaning as useful and non-useful items. These results indicate that brain activity can be used for the design and assessment of digital learning environments and contribute to the field of educational neuroscience.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The role of environment design in an educational M ulti‐U ser V irtual E nvironment",
            "Publication year": 2014,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/bjet.12056",
            "Abstract": "This paper presents empirical results from an exploratory study conducted in an authentic educational situation with preservice education students enrolled in an undergraduate course, which was partially taught in Second Life. The study investigated the effect of environment design on presence, learning outcomes and the overall experience of the students. Two different educational virtual environments (a traditional university auditorium and an open‐air setting) were designed and presented to different groups of students (n = 51). Results indicate that students' experience from the educational activities, their attitudes toward the environment and the induced sense of presence are not affected by the design of the educational setting. Learning outcomes seem to be slightly better in virtual educational settings that replicate traditional educational settings. Experience shows that undergraduate university classes …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital learning objects for teaching computer programming in primary students",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_19",
            "Abstract": "The current learning environments focus on the development of skills which are related to problem solving, creativity and critical thinking addressing the needs of learners in today’s society. Computer programming includes this kind of skills and it is placed at the center of attention of the educational policy. Approaching programming is a difficult task because of its complex concepts, thus educators are seeking effective methods for teaching it. This paper presents the design of digital learning objects for teaching programming concepts and the results of a pilot empirical study with special users. The results reveal that the proposed learning objects seem to be a useful tool for teachers, aligned with the learning goals and can be employed in authentic scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Bill Davey",
            "Publication year": 2020,
            "Publication url": "https://search.proquest.com/openview/c419ce3060fa3703c1cd9f6385095997/1?pq-origsite=gscholar&cbl=55384",
            "Abstract": "Acknowledgement to reviewers Acknowledgement to reviewers Full Text Acknowledgement \nto reviewers Published online: 19 February 2020 # Springer Science+Business Media, LLC, \npart of Springer Nature 2020 Education and Information Technologies relies heavily on the \ngenerous contributions of all reviewers who assist in reviewing manuscripts submitted to the \njournal. For the reviews received in the calendar year 2019, we would like to gratefully \nacknowledge the reviewers listed below who willingly shared their expertise and time. \nEducation and Information Technologies (2020) 25:1459–1461 https://doi.org/10.1007/s10639-020-10131-5 \nBill Davey Yaacov Katz Mohamed Amasha Paul Juinn Bing Tan Yaw Owusu-Agyeman Arthur \nTatnall Abbas Pourhosein Gilakjani Milorad Cerovac Michail Kalogiannakis Therese Keane \nMadhury Khatun Ahmad Zam Samsudin Gaurav Kumar Maria Liashenko Shah Miah B N…",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Development of a General Purpose Interface for a Microcomputer-Based Laboratory",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_6",
            "Abstract": "In this work, a general-purpose interface is proposed for an open, low-cost Microcomputer-Based Laboratory (MBL) system. The Arduino Uno board is programmed to act as a data acquisition device that receives and processes data from analogue or digital sensors and transmits the results to a computer via a USB connection. At the same time, on the computer, the libreMBL-GUI application, developed with the Python programming language, enables serial communication to be set up for interactive user-system communication, the start and end control of real-time graphical representation of the measurements, interactive student navigation on graphs, and data storage for later processing. The proposed system is open-source, cross-platform, and transparent to the material. Thus, it can support different Arduino types, while it can display the measurements of any compatible sensor connected to the Arduino …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Investigation of the relation between interaction and sense of presence in educational virtual environments",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5432499/",
            "Abstract": "The sense of presence is considered to be one of the fundamental features in Virtual Environments (VE). An important question that arises is how much interaction influences the user's sense of presence in a VE. This study investigates the relation between sense of presence and interaction in Educational Virtual Environments (EVEs), through a review of researching projects that have taken place up to now. A list of representative EVEs is presented along with their typical characteristics in relation to the sense of presence. The results from this study showed that there is a positive relation between interaction and sense of presence. This means that, in EVEs with strong interaction, the users presented an increased sense of presence. Moreover, the use of virtual representatives (avatars) contributed in the user's sense of presence and in the achievement of educational aims of EVE.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Delphi Study on the Design of Digital Educational Games",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-23560-4_32",
            "Abstract": "The biggest challenge for the Digital Educational Games Design refers to how to integrate game mechanics and learning mechanics into the gameplay in order to enhance motivation and engagement and improve learning outcomes. This study is the pilot phase of a Delphi method that proposes guidelines for the design of Digital Educational Games. The participants of the Delphi study were academic experts from the scientific field of Digital Educational Game Design. In the first round of the study, a questionnaire of six open-ended questions was sent. The second round questionnaire consisted of 46 closed-ended questions in order to estimate agreement between the participants. The third round questionnaire consisted of one open-ended question. According to the results of the study, the learning and game mechanics elements that have been suggested by the participants as the most important …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Potential for school familiarisation using Virtual Environments",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Tassos-Mikropoulos/publication/228813895_Potential_for_school_familiarisation_using_Virtual_Environments/links/0912f50f43033db904000000/Potential-for-school-familiarisation-using-Virtual-Environments.pdf",
            "Abstract": "Children generally find it traumatic to change schools. They fear losing their way or arriving late at classes as a result of their not knowing the spatial layout of the new school campus. Spatial disorientation is a source of anxiety and probably delays their academic progress. This may be especially so for children with motoric or cognitive disabilities, or children who are temperamentally unsuited to coping with change. There is great potential for the use of virtual environments to provide groups of children with the opportunity to explore the school environment before they arrive. Each “VE” child will be provided with a virtual version of their new school which they can navigate at ease within their own home, as many times as they like, prior to the start of their first term. Previous studies have confirmed that children (including pupils with disabilities) do acquire extremely good\" cognitive spatial maps\" of schools from virtual exposure alone. Following VE exposure, children will be tested for their spatial knowledge in school, emotional responses to school attendance, speed of settling-in, attitudes to teachers and other pupils, feelings of confidence, and anxiety level, also the speed with which they make academic progress in the first weeks at the new school. The VE-trained children will be compared with equivalent control groups given either a tour of the real campus, or no prior exposure. Subgroups of children might particularly benefit from virtual spatial pre-training, including children with disabilities or having poor directional sense.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Brain activity on navigation in virtual environments",
            "Publication year": 2001,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.2190/D1W3-Y15D-4UDW-L6C9",
            "Abstract": "This article reports a first attempt to assess the cognitive processing that takes place in virtual environments, by measuring subjects' electrical brain activity using Fast Fourier Transform analysis. The aim of the study was the evaluation of virtual learning environments using the above methodology in addition to the standard methodology of social sciences and educational research, namely quantitative and qualitative empirical research. Twelve university students, undergraduates and postgraduates, were asked to perform the same task in a real and a virtual environment. During the two processes, their brain signals were recorded and analyzed. Eye-movement measurements showed that all the subjects were more attentive when navigating in the virtual world. The difference between alpha and beta rhythms for the virtual task indicated that students placed more attention in the virtual environment and were more …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Scratch-based learning objects for novice programmers: exploring quality aspects and perceptions for primary education",
            "Publication year": 2021,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10494820.2021.1956546",
            "Abstract": "Learning computer programming can be challenging for primary school students due to its abstract concepts. While teachers seek effective ways to introduce such concepts, the application of learning objects (LOs) can potentially reduce the effort of creating new material from and allows teachers to adapt LOs to students’ needs. Although numerous LOs have been developed for multiple disciplines, there is a current research gap using LOs in teaching and learning computer programming at the primary school level. The current paper aims to explore the quality of five Scratch-based LOs created to facilitate teaching and learning programming in primary education. We followed a single instrumental case study collecting data from 25 in-service teachers and 91 primary school students, who, using the LORI instrument, evaluated Scratch-based LOs created in real learning contexts. The results showed that participants …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Educational robotics as mindtools",
            "Publication year": 2013,
            "Publication url": "http://earthlab.uoi.gr/ojs/theste/index.php/theste/article/view/114",
            "Abstract": "Although there are many studies on the constructionist use of educational robotics, they have certain limitations. Some of them refer to robotics education, rather than educational robotics. Others follow a constructionist approach, but give emphasisonly to design skills, creativity and collaboration. Some studies use robotics as an educational tool in engineering education, science and programming learning implying mindtools, but they do not give evidence of mindtool characteristics. This work proposes educational robotics as mindtools based on constructivism and especially constructionism. The positive learning results from two case studies on physics and programming teaching indicate that educational robotics can be used as mindtool ssupporting knowledge construction through the design of meaningful authentic projects, learning by doing in both the virtual and real world, facing cognitive conflicts and learning by reflection and collaboration.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The unique features of educational virtual environments",
            "Publication year": 2010,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.4324/9780203852057-23/unique-features-educational-virtual-environments-tassos-mikropoulos-joan-bellou",
            "Abstract": "Information and Communication Technologies (ICT) are considered to be the most powerful tool for the support of the learning process. Their main contribution comes from their technological characteristics, the ways they record, represent, manage and transfer information. These characteristics concern the management of high volume of data and information in a short time, information presentation through dynamic interactive and multiple representations, as well as the communication and motives they provide. The essential contribution of ICT to the learning process comes indirectly, through their pedagogical exploitation and certain features that arise for the technological characteristics. This mainly involves tasks for the active participation of students and teachers, action and counteraction through interactive activities, as well as processes that support the creation of mental models.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Routledge"
        },
        {
            "Title": "Cognitive load and attentional demands during objects’ position change in real and digital environments",
            "Publication year": 2017,
            "Publication url": "http://earthlab.uoi.gr/ojs/theste/index.php/theste/article/view/232",
            "Abstract": "Studies showed that two-dimensional (2D) and three-dimensional (3D) educational content contributes to learning. Although there were many studies with 3D stereoscopic learning environments, only a few studies reported on the differences between real, 2D, and 3D scenes, as far as cognitive load and attentional demands were concerned. We used electroencephalographic measurements to study and compare the theta (θ), alpha (α), beta (β) and gamma (γ) frequency bands of 36 adult female participants. The participants observed three environments with the same content, a real, a 3D and a 2D environment. Brain activity was recorded for each environment and their two versions, ie, a before version and an after version, where the position of specific objects changed. Our study’s findings indicated that all participants perceived the three environments, their depicted objects, and the change of the objects’ position. The participants’ cognitive load and attentional demands were higher in all environments before the change of the objects’ position. Working memory load, working and spatial memory, were also higher in the two digital environments (3D and 2D) before the change of the objects’ position. However, the opposite was observed in the case of the real environment. This was attributed to the participants observing the real environment firstly. Overall, we propose that empirical studies with biometric data on cognitive load and attentional demands will support the design of better learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "In memoriam: David H. Jonassen",
            "Publication year": 2013,
            "Publication url": "http://earthlab.uoi.gr/ojs/theste/index.php/theste/article/viewFile/113/61",
            "Abstract": "David wrote a monumental collection of top-level research works that influence scholars, educators and students around the world. Over his outstanding academic career, David has published 37 books, 182 journal articles, and 67 book chapters and gave innumerable presentations and speeches in the United States and 28 countries around the globe. He received many scholarly awards, including awards for outstanding publications and books, the 2001 Presidential Service Award, and the Lifetime Achievement Award for Excellence in Research and Theory, both for Association for Educational Communications and Technology. Recently David was nominated and selected as a Fellow of the American Educational Research Association.Themes in Science and Technology Education was bound to Dave for his contribution as a distinguished member of the editorial board. In addition, David joined the Greek …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile Augmented Reality Applications in Teaching: A Proposed Technology Acceptance Model",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9459343/",
            "Abstract": "This study proposed MARAM, a mobile augmented reality acceptance model that determines the factors that affect teachers' intention to use AR applications in their teaching. MARAM extends TAM by adding the variables of perceived relative advantage, perceived enjoyment, facilitating conditions, and mobile self - efficacy. MARAM was tested in a pilot empirical study with 127 teachers who used educational mobile AR applications and developed their own ones. The results of regression analysis showed that MARAM can predict a satisfactory percentage of the variance in teachers' intention, attitude, perceived usefulness and perceived ease of use. Attitude, perceived usefulness, and facilitating conditions affected intention. Both perceived usefulness and perceived enjoyment affected attitude. Furthermore, perceived relative advantage and perceived enjoyment affected perceived usefulness. In addition, mobile …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the pedagogy of open and distance learning systems",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.493.6595&rep=rep1&type=pdf",
            "Abstract": "The purpose of this study was to investigate the pedagogical issues concerning Open and Distance Learning (ODL) systems through a critical review of the relevant published work. The review categorized articles into three categories, namely theoretical approaches, technological approaches and evaluation studies. The review showed that open and distance learning is mainly technology driven. Researchers exploit the technological features of Information and Communication Technologies for the design and development of ODL environments, without paying much attention to and applying theoretical models, pedagogical principles and instructional goals. They rather seem to follow the conventional, general instructional design guidelines concerning stand-alone educational software applications, mostly based on hypermedia systems. The main theoretical approach implied by the majority of the published work is constructivism together with collaborative learning, without referring to or applying social constructivism. Our proposal for effective open and distance learning environments is the exploitation of the tools Information and Communication Technologies offer in a constructivist environment involving specific didactic goals and learning outcomes.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning activities as enactments of learning affordances in MUVEs: A review-based classification",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-018-9690-x",
            "Abstract": "Three Dimensional Multi-User Virtual Environments (MUVEs) are promising tools in education because of the unique affordances they offer. These learning affordances imply certain actions that in turn can lead to corresponding learning activities. There seems to be a lack of reports on which of the affordances of MUVEs for learning and teaching are used and how they are enacted by relevantly designed learning activities. This study investigates the learning activities conducted in Second Life, the most popular and widely used among the \"sandbox\" type MUVE platforms, as reported in 205 empirical studies, by associating them with the learning affordances they enact. As necessary step towards this goal, the study proposes a new classification of learning affordances of MUVEs and a new concrete set of learning activities based on the literature review. Learning affordances include free navigation, creation …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Virtual realities in animal production and natural resources utilisation research and education",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ahHTDwAAQBAJ&oi=fnd&pg=PA462&dq=info:8BY5AfhGNYUJ:scholar.google.com&ots=Qi2fyeSM_S&sig=yAXTdJb2MP7VYE5ilnWtG_LEqbg",
            "Abstract": "Virtual Reality (VR), a differentapproachin human–machine interaction, offers new opportunities for scientific research, education and training. It can be seen as away for humans to visualise, manipulate and interact with computers and complex data. This paper proposes the exploitation of VR in research and education in the animal production and natural resources utilisation domains. We propose virtual field trips for the study of natural resources in places where access is difficultoreven impossible. Our applications concern visualisations of real or imaginary landscapes, such as the Ioannina basin 7000 000 years ago till now, for the study of their natural resources for future utilisation. We also propose immersive ordesktop virtual environments foreducation and training purposes in agricultural and animal sciences. EIKONis an integrated openenvironment used to supportagricultural technology courses athigh school and university levels. The simulation of a dairy fortraining on milk pasteurisation is anotherapplication that has shown good results among educators and students of a technical secondary school.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:hqOjcs7Dif8C",
            "Publisher": "EAAP; 1999"
        },
        {
            "Title": "Educational virtual environments: A ten-year review of empirical research (1999–2009)",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131510003052",
            "Abstract": "This study is a ten-year critical review of empirical research on the educational applications of Virtual Reality (VR). Results show that although the majority of the 53 reviewed articles refer to science and mathematics, researchers from social sciences also seem to appreciate the educational value of VR and incorporate their learning goals in Educational Virtual Environments (EVEs). Although VR supports multisensory interaction channels, visual representations predominate. Few are the studies that incorporate intuitive interactivity, indicating a research trend in this direction. Few are the settings that use immersive EVEs reporting positive results on users’ attitudes and learning outcomes, indicating that there is a need for further research on the capabilities of such systems. Features of VR that contribute to learning such as first order experiences, natural semantics, size, transduction, reification, autonomy and …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Information and Communication Technologies (ICT) play a major role in our lives. However, ICT development, which is indifferent to the concerns of social inclusion, may raise barriers and increase the gap between the average user and those with special needs, instead of contributing to eliminating this gap and promoting equal rights and opportunities for all. Senior citizens and others with special needs are often faced with multiple minor disabilities that",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Tassos-Mikropoulos/publication/260363667_Preface_of_5th_International_Conference_on_Software_Development_and_Technologies_for_Enhancing_Accessibility_and_Fighting_Info-exclusion/links/544bc6db0cf2d6347f43a0b4/Preface-of-5th-International-Conference-on-Software-Development-and-Technologies-for-Enhancing-Accessibility-and-Fighting-Info-exclusion.pdf",
            "Abstract": "Information and Communication Technologies (ICT) play a major role in our lives. However, ICT development, which is indifferent to the concerns of social inclusion, may raise barriers and increase the gap between the average user and those with special needs, instead of contributing to eliminating this gap and promoting equal rights and opportunities for all.Senior citizens and others with special needs are often faced with multiple minor disabilities that prevent them from enjoying the benefits of technology and higher quality of life standards. According to the UN Convention on the Rights of Persons with Disabilities, technology design should take into account accessibility and usability features for the protection and promotion of the human rights of persons with disabilities, in all policies and programmes.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual environments in biology teaching",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00219266.2003.9655879",
            "Abstract": "This article reports on the design, development and evaluation of an educational virtual environment for biology teaching. In particular it proposes a highly interactive three-dimensional synthetic environment involving certain learning tasks for the support of teaching plant cell biology and the process of photosynthesis. The environment has been evaluated using a sample of 37 in-service teachers. Their attitudes towards virtual reality for educational use were positive. Almost all the teachers managed to integrate the process of photosynthesis inside the virtual cell and answer the relevant questions. One problem was that the teachers were unable to answer questions beyond the certain learning tasks, indicating that any educational software should also involve an integrated approach to the subject under study.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "SciLOET: A Framework for Assessing Digital Learning Objects for Science Education",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73988-1_27",
            "Abstract": "There is a growing interest in Open Educational Resources building up in the last decade. Among them Digital Learning Objects (DLOs) attract the interest of educational research and practice as there is evidence that they have a positive effect on learning. Especially in Science Education, DLOs are considered as important tools to support achieving high-level learning outcomes. Evaluation of DLOs is critical. A handful of tools are available, but they are too generic. There seems to be a lack of evaluation methods and tools specifically for Science Education DLOs. This work presents the SciLOET (Science Learning Objects Evaluation Tool), a DLOs’ evaluation tool specialized in Science Education. The tool is meant mainly to be used by teachers who are in the process of evaluating, selecting, and using DLOs in their teaching. It could also prove useful for education researchers who design empirical studies and …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:08ZZubdj9fEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Robotics Interventions for Improving Educational Outcomes-A Meta-analysis",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_7",
            "Abstract": "The present study reviews the literature in the field of educational robotics with the aim to identify its potential effects in students’ academic performance. After a systematic search in various databases, we ended up with a total of 12 studies satisfying the eligibility criteria. The majority of studies were observational and only 4 of them were quasi-experimental. For each study we extracted data for the type of robot used, the research method used, the sample characteristics (sample size, age range of students and level of education) and the results observed in terms of scores. We synthesized results from these 12 studies using random-effects meta-analysis and found that robotic interventions have an overall positive effect in students’ academic performance (0.7, 95% CI 0.283 to 1.112). We used the Cochrane Collaboration ‘Risk of bias’ tool to assess the quality of the 12 included studies. Most studies are at …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:_xSYboBqXhAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Teaching intervention through a hypermedia application for children with learning and communication difficulties",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050912008101",
            "Abstract": "Two separate studies have been undertaken in order to evaluate a hypermedia application designed to help children with learning and communication difficulties acquire pre-mathematical concepts. First, an intervention study with six cases of children who had learning and communication difficulties is described. Second, a separate study examined twenty five educator's perspectives after having used the application. Overall, it was evident that the application has the potential to serve as an assistive teaching tool, but there are concerns emerging from the empirical evaluation regarding its usability and utility.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Teachers' Implementation of a Hypermedia Application for Children with Severe Learning Disabilities",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5702105/",
            "Abstract": "The aim of the present research has been to examine the effectiveness of teacher implementation of a hypermedia application for children with severe learning disabilities. LT125ThinkingMind is an application developed to support pre-mathematical concepts learning for children who experience severe learning disabilities. Thirty three teachers participated in the study. They had been attending a course on special needs and had received instruction on the application during one semester. They were asked to develop tasks using the application as part of a class exam. The results indicated that most of the teachers have a sound approach in the implementation of the application as evident by their aims and task development. Problems emerge when they try to use the application for purposes it is not designed for and they do not comply with its conventions. Both teachers and their instructors should be aware of the …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EEG Systems for Educational Neuroscience",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-23563-5_45",
            "Abstract": "Numerous studies suggest that digital technology has an important role to play in physical and mental functioning and generally in the quality of life of elderly people. Many digital serious games have been developed to enhance cognitive functions. These games incorporate a multitude of multimedia elements that are perceived as sensory stimuli. To implement an effective digital environment, all sensory representations have to be investigated in order to be compatible with the visual, acoustic and tactile perception of the user. An effective way to examine those stimuli is to study the users’ brain functioning and especially the electric activity by using electroencephalographic recording systems. In recent years, there has been a growth of low-cost EEG systems. These are used in various fields such as educational research, serious games, mental and physical health, entertainment, etc. This study …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Virtual environments for vocational training: user experience in culinary education",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=5656160061686032821&hl=en&oi=scholarr",
            "Abstract": "Although Virtual Environments (VE) with various levels of immersion have been used and evaluated in vocational and adult training with positive results, no such environments exist for culinary education. The aim of this study was to design a VE for culinary education and evaluate it in terms of user experience with two different levels of immersion: low (desktop) and high (Head Mounted Display-HMD). Twenty-four students and graduates of an Institute of Vocational Training specializing in either ICT or Culinary arts participated in this study. Results showed no significant differences in terms of spatial presence, usability and workload between the two interfaces. Nevertheless, participants using the HMD interface needed more time to complete a recipe and experienced much higher simulator sickness. It seems that the lower immersion interface is more appropriate for this specific VE.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Being inside the Quantum Atom.",
            "Publication year": 2008,
            "Publication url": "http://www.psychnology.org/File/PNJ6(1)/PSYCHNOLOGY_JOURNAL_6_1_KONTOGEORGIOU.pdf",
            "Abstract": "This article explores the possibility of using dynamic Educational Virtual Environments (EVEs) for helping students with limited background in physics and mathematics to deeply understand Quantum Mechanics principles and create the correct mental images of atomic models. Taking under consideration the results of our pilot study we have created “The Quantum Atom”, an educational environment with which 38 students interacted during welldesigned learning tasks based on the social constructivist approach. The sense of presence seems to play an important role in our positive learning outcomes. Further research must be done in this domain focusing on the main features of Virtual Reality as many researchers argue that they support knowledge construction.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting secondary school students' performance utilizing a semi-supervised learning approach",
            "Publication year": 2019,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0735633117752614",
            "Abstract": "Educational data mining constitutes a recent research field which gained popularity over the last decade because of its ability to monitor students' academic performance and predict future progression. Numerous machine learning techniques and especially supervised learning algorithms have been applied to develop accurate models to predict student's characteristics which induce their behavior and performance. In this work, we examine and evaluate the effectiveness of two wrapper methods for semisupervised learning algorithms for predicting the students' performance in the final examinations. Our preliminary numerical experiments indicate that the advantage of semisupervised methods is that the classification accuracy can be significantly improved by utilizing a few labeled and many unlabeled data for developing reliable prediction models.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:u_35RYKgDlwC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Seeing the unseen: user experience and technology acceptance in Augmented Reality science literacy",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9155934/",
            "Abstract": "Augmented Reality (AR) appears to have great potential in education and training. Although this technology has become mainstream through the use of handheld mobile devices, consumer-grade AR glasses are beginning to become available. These glasses could unlock the potential of AR by increasing freedom of movement, performance and safety. This preliminary study explores user experience and acceptance of state-of-the-art AR glasses. A simple activity was created to visualize electromagnetic radiation for science literacy purposes and then evaluated by university students (N=154). The results showed moderate spatial presence, low simulator sickness and high levels of acceptance and satisfaction.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Language processing in visually and non-visually impaired individuals: the use of Auditory Event-Related Potentials",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3218585.3218663",
            "Abstract": "This study examines the electrical brain activity of visually impaired individuals. Its aim is to identify differences in latency and signal amplitude between visually and non-visually impaired individuals in order to improve the school experience of students with visual impairment. The experiment included five visually impaired and five non-visually impaired subjects. Auditory stimuli included words with and without semantic content, ie actual words and pseudo-words, and Auditory Evoked Potentials were recorded. Results show that visually impaired individuals process auditory stimuli faster, regardless if the words lack semantic content, in comparison to their non-visually impaired counterparts. The study also showed variations in signal amplitude between the two groups.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An online expert system for diagnostic assessment procedures on young children's oral speech and language",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050912008113",
            "Abstract": "Internet has influenced many aspects of modern life, as it gave people the opportunity to access massive amount of information. Information & Communication Technologies (ICT) offer the option to analyze, organize, synthesize and transmit information and therefore contribute and reveal valuable clinical and educational tools.The aim of the present study is to report on the development of an Internet based Speech Pathology Expert System in Greek, named APLo, intended to be used by clinicians and teachers involved in oral language learning and strengthening of four to seven year old children. This system embeds the expert's knowledge on oral language assessment. A hybrid approach that integrates symbolic rules with neural networks is being used to model and represent the knowledge in the system. Particular attention is given to the validation and verification of the system. Potentials, further use and …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Do children in the spectrum of autism interact with real-time emotionally expressive human controlled avatars?",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050915031142",
            "Abstract": "Children in Autism Spectrum Disorder (ASD) are characterized by impairments in social skills and they usually face difficulties in recognizing facial emotion expressions. Early intervention and treatment is of major concern and therefore a number of detection and teaching methods have been developed, including the use of ICT. This article presents a brief but extensive literature review on the way tutors are represented in digital environments. The results showed that there is a need for further investigation on the effectiveness of the methods used for the interaction of children on ASD with technology tools, as well as on knowledge transfer. Since there is a lack of empirical data concerning the preference of different interaction modalities by children with ASD, this article also reports on an exploratory study conducted to investigate the acceptance and preference of three different real-time modalities used in facial …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Visualizing the quantum atom",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-5032-9_35",
            "Abstract": "Students from the advanced high school classes up to the last university years have difficulties in grasping the notions involved in the description of the Quantum Atomic Model (QAM). Many researchers suggest that using Information and Communication Technologies (ICT) for visualizing the QAM would improve students’ understanding. An empirical study was conducted with 20 first-year students of the Department of Primary Education. They interacted with two Internet-based software packages, considered as representative 3D visualizations of the QAM. For the analysis of our results, a qualitative approach was taken by using SOLO (Structure of the Observed Learning Outcomes) taxonomy. Our results indicated that software packages concerning the 3D representations of QAM do not help students to understand scientific concepts and the atomic shape. The article proposes the use of Virtual Reality …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Primary school students' attitude towards gesture based interaction: a comparison between Microsoft Kinect and Mouse",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901575/",
            "Abstract": "This paper attempts an empirical study regarding the attitude of primary education students (n=32) towards gesture based interfaces in educational contexts. A simple construction activity was designed and tested both with Microsoft Kinect and the traditional mouse. The main finding was that Kinect was preferred over mouse, even though it was less easy to use. It seems that gesture based interfaces increase student's motivation and engagement. Nevertheless, in order to fully exploit their potential as educational tools, the following are needed: more robust motion sensing technology, exploitation of the kinesthetic taxonomy and customized educational software.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Event-Related Brain Potentials from Pictures Relevant to Disaster Education",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-67615-9_13",
            "Abstract": "Decision-making can be regarded as a cognitive process integrated in our interaction with the environment. This interaction comprises of a plethora of sensory or mental stimuli. Among them, visual awareness and semantic recognition during decision-making tasks are of main importance. Nowadays, disaster education becomes a part of the curricula to foster a more resilient population, and relevant research emerges. The purpose of this exploratory study was to investigate visual awareness and semantic recognition during a visual decision-making task concerning earthquakes, by measuring brain activity and especially event-related potentials. The task consisted of digital images, representing useful and non-useful items constituting a survival kit in case of an earthquake. The subjects, seven adult males, had to distinguish between those useful and non-useful items. A late positive component (P300) and …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A study of students' spatial abilities with the use of virtual environments",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=8912702259548112609&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing a collaborative learning activity in second life-an exploratory study in physics",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5571258/",
            "Abstract": "Multi-user virtual environments (MUVEs) seem to have great potential in education. Current educational uses of MUVEs seem to exploit them more as group interaction platforms and less as worlds where users learn by interacting and modifying the environment in a constructivist approach. There is also a need for systematic research efforts that will lead to guidelines and principles for designing and evaluating effective learning activities in MUVEs. This paper presents preliminary empirical results from an exploratory study with university students. A collaborative problem-based physics learning activity was designed in Second Life® (SL), following a constructivist approach. Students (n=30) collaborated “in-world” in pairs assisted by a tutor, in order to solve the problem. Data were gathered using a questionnaire and session recordings. The study focused on issues related to educational environment design …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A virtual reality test for the identification of memory strengths of dyslexic students in higher education.",
            "Publication year": 2013,
            "Publication url": "http://www.jucs.org/jucs_19_18/a_virtual_reality_test/jucs_19_18_2698_2721_kalyvioti.pdf",
            "Abstract": "Research suggests that Virtual Reality has a key role in the development of new diagnostic tools in neuropsychology and shows great rehabilitative potentials for individuals with specific neurological, intellectual and cognitive disabilities. In the case of dyslexia, a neurodevelopmental reading disorder, the use of Virtual Reality technologies has only been recently documented in a handful of studies. The main focus of these studies has been the identification of visuospatial strengths, the exploration of nonverbal problem solving treatment and the increase of awareness in educators and parents with children with dyslexia. Even fewer are the studies of Virtual Reality and the lifelong memory difficulties of adult individuals with dyslexia. With a more clinical, rather than technological, perspective the goal of this paper was to design specialized tasks in virtual environments to be part of a screening process/assessment of …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital learning technologies in chemistry education: A review",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73417-0_4",
            "Abstract": "This study is a systematic review of empirical research on digital learning technologies and their educational applications in primary and secondary Chemistry Education, during the period 2002–2016. Despite the importance of digital learning technologies in Chemistry Education, this review comes to light because of the current lack of similar works, in that it outlines and organizes the existing literature highlighting the technologies and pedagogical approaches adopted. Forty-three related studies published in peer-reviewed scientific journals were identified and reviewed. Results show that most researchers are interested in chemistry topics related to the particulate nature of matter and use digital learning technologies, to mainly create and present visualizations of simulations and models of structural elements of matter and their phenomena. Researchers are interested overall in assessing digital …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Factors that influence presence in educational virtual environments",
            "Publication year": 2004,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/cpb.2004.7.582",
            "Abstract": "The present article is a part of a project for the measurement of presence in educational virtual environments (VEs), since presence is correlated with higher levels of cognitive performance and emotional development, factors that contribute to knowledge construction. The aim of our study was to investigate the sense of presence of 12-year-old pupils within an educational VE representing an ancient Greek house through a sense of embodiment and the ability to handle task performance, while using various peripheral devices. This is the first report on presence measurement with children, based on the indication that children and adults may apply very unrelated criteria. Our results showed statistically significant differences on the level of tiredness and ease of use in using six different input devices. The combination of the keyboard and mouse and the keyboard on its own were the least tedious and easiest input …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Phonological Awareness Software for Dyslexic Children.",
            "Publication year": 2011,
            "Publication url": "https://eric.ed.gov/?id=EJ1131287",
            "Abstract": "The improvement in the ability to process sounds in oral language (phonological awareness) through the contribution of Information and Communication Technologies (ICT) is reported by many researchers. However, deficits in phonological awareness may persist despite intervention. There is increasing research interest on how educational technology may assist the development of this critical ability. In this article we present the ‘Phonological Awareness Educational Software’(PHAES) which is a hypermedia application for helping dyslexic readers, using phonological awareness training. Τhe PHAES learning activities use the small units of language (phoneme/grapheme) presented alone, at the word and sentence level, both in spoken and written format. This work was based on the theoretical conceptualization of children’s reading difficulties originating in the phonological domain and aimed to develop a useful tool to assist teaching efforts in helping dyslexic readers. The empirical results show that PHAES is a user friendly educational application and has the potential to set an example for future research in the area.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Themes in Science and Technology Education. The Educational Approaches to Virtual Reality Technologies Laboratory, University of Ioannina, Ioannina, GR 45110, Greece"
        },
        {
            "Title": "Augmented and virtual environments for students with intellectual disability: design issues in Science Education",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9499839/",
            "Abstract": "The number of students with Intellectual Disability (ID) enrolled in general classes increases. They appear to meet difficulties in acquiring basic science literacy skills and addressing grade-aligned curriculum. Digital technology seems to contribute to this challenge by engaging students in augmented and virtual environments, especially by enabling 3D representations of abstract and difficult to visualize physical magnitudes and phenomena. This work investigates design issues regarding the development of digital learning environments that contribute to Science Education for students with ID. In this phase, the study explores the perceptions of different groups of professionals and a student with ID regarding the structure of matter. They interacted with different versions of both an augmented and a virtual environment simulating the water vapor in microscopic view. A focus group discussion revealed important data …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Educational software",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=12113227034129022544&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The evolution of Educational Technology based on a bibliometric study",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-6501-0_2",
            "Abstract": "Educational technology and technology-enhanced learning are now mature interdisciplinary research areas, and there are already literature studies aiming at the study of scientific communities, the identification and evolution of salient topics, and the emergence of the trends in the field. Such studies are important since they can provide insights into the development of a particular research area. In this chapter, we aim to investigate the evolution of the educational technology field in a European Union member state, namely, Greece, through the analysis of trends between three different categories of targeted research outcomes (theory, technology, practice) and the corresponding key topics of interest that have been emerged in all papers presented at the main national scientific conference of this field between 2000 and 2012. The analysis of the results demonstrates that there is a wide involvement of …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Social Presence, Satisfaction, and Learning Outcomes in an Undergraduate Computer Programming Distance Course",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-73988-1_23",
            "Abstract": "This study investigated the social presence, satisfaction and learning outcomes of undergraduate students based on their participation in an emergency remote online course entitled “Educational Programming Environments” during the COVID-19 pandemic. Instruction was delivered using a student-centered design and discovery learning to teach computer programming problem solving. Data were collected from 39 students who did not undertake prior preparation for engaging in distance education. Social presence, learning outcomes and satisfaction towards the course were measured by previous well-established scales, respectively. The students’ learning outcomes were evaluated through their code development. At the end of the course, the students filled out an online questionnaire which measured these three variables. The results of this study showed that all three variables were evaluated as satisfactory …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Technological factors, user characteristics and didactic strategies in educational virtual environments",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6268170/",
            "Abstract": "Technological factors, user characteristics and didactic strategies do not function consistently across Educational Virtual Environments. This study investigates the impact of viewing condition and didactic strategy on attention allocation, suspension of disbelief, spatial presence, and learning outcomes in an Educational Virtual Environment concerning ancient Greek pottery. Our results show that the viewing condition does not affect attention allocation, suspension of disbelief, and spatial presence. Learning outcomes are better in the monoscopic viewing condition. Didactic strategy has an impact on suspension of disbelief and learning outcomes. Domain specific interest associates with higher level of attention allocation and spatial presence, while spatial presence is not related to learning outcomes. More research is needed in order to identify the role of each one of the above factors in Educational Virtual …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An ensemble-based semi-supervised approach for predicting students’ performance",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95059-4_2",
            "Abstract": "Educational data mining has gained popularity due to its ability to provide useful knowledge hidden in data of students’ records for better educational decision-making support. During the last years, a variety of methods have been applied to develop accurate models to monitor students’ behavior and performance, while most of these studies examine the efficiency of supervised classification methods. In this work, we propose a new ensemble-based semi-supervised method for the prognosis of students’ performance in the final examinations at the end of academic year. Our experimental results reveal that our proposed method is proved to be effective and practical for early student progress prediction as compared to some existing semi-supervised learning methods.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:a0OBvERweLwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Attributing human properties to computer artifacts: Developmental changes in children's understanding of the animate-inanimate distinction",
            "Publication year": 2003,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/bitstream/123456789/14946/1/mikropoulos-2003-Attributing%20human%20properties.pdf",
            "Abstract": "In the last twenty years, the objects in children's lives have come to include\" intelligent\" machines such as computers and robots. Answers to questions about children's developing ability to make the animate-inanimate distinction must thus be renegotiated in the context of these new artifacts. We report a study about the attributional judgements of 54 children aged 3-5 years, to a person, a robot. and a computer. Questions were asked about these items':(i) unobservable internal properties, ability to (ii) initiate action,(iii) have mental states,(v) experience emotions,(vi) bodily sensations and, finally,(vii) their life status. The results showed a clear difference in response patterns for the three test items. At all ages participants demonstrated a coherent understanding of the properties of humans. In contrast, they tended to attribute animate properties to the two computer artifacts. Robots attracted more animistic attributions …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Educational Neuroscience Approach in the Design of Digital Educational Games.",
            "Publication year": 2019,
            "Publication url": "https://eric.ed.gov/?id=EJ1251162",
            "Abstract": "A number of models, methodologies and conceptual frameworks have been proposed on how to design digital educational games aiming at better learning outcomes, while offering a fun experience. Our study combines two different methods, namely Delphi study and electroencephalograms (EEG), in order to provide an integrated digital educational game design model. Firstly, a Delphi survey was conducted in order academic experts in the field of digital educational games give their opinion and propose guidelines for designing digital educational games. Secondly, EEG recordings were used to examine how the game element of feedback for earned and lost points would be best incorporated in the game and how these elements affect players’ experience. The results from the Delphi survey showed that the most important features to be included in the games are constructive elements, learning environments suitable for authentic learning, as well as elements which promote fun. Moreover, the experts highlighted that learning objectives should be included in activities in a way that the learners will not realize the actual learning process, but feel that they participate in everyday life experiences and examples. Bloom’s taxonomy was also proposed as a way to match the learning elements with the game elements. EEG data combined with empirical data from questionnaires showed that players prefer to have audio feedback when gaining or loosing points during the gameplay rather than visual feedback or no feedback at all and contributed to the development of our digital educational game design guidelines.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:NhqRSupF_l8C",
            "Publisher": "Themes in eLearning. Web site: http://earthlab. uoi. gr/tel/index. php/themeselearn"
        },
        {
            "Title": "A virtual environment for training in culinary education: Immersion and user experience",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95059-4_22",
            "Abstract": "Although virtual environments (VE) with various levels of immersion have been used and evaluated in vocational and adult training with positive results, no such environments exist for culinary education. The aim of this study was to design a VE for culinary education and evaluate it in terms of user experience with two different levels of immersion: low (desktop) and high (head-mounted display—HMD). Twenty-four students and graduates of an Institute of Vocational Training specializing in either ICT or culinary arts participated in this study. Results showed no significant differences in terms of spatial presence, usability, and workload between the two groups. Nevertheless, participants using the HMD interface needed more time to complete a recipe and experienced much higher simulator sickness. It seems that the lower immersion interface is more appropriate for this specific  VE.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Memory performance of dyslexic adults in virtual environments",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050912008095",
            "Abstract": "The use of virtual reality technologies in the evaluation process of the dyslexia syndrome has yet to be explored and is a true challenge for the scientists involved. The goal of this study was to design specialized tasks with the use of virtual reality, as a screening process of characteristic memory difficulties for undergraduate students diagnosed with dyslexia. Results showed that there were no statistically significant differences in the performance of students with dyslexia and students without dyslexia, a finding which highlights the development and successful use of compensatory memory strategies by individuals with dyslexia. Taking into consideration the realistic design of the specialized and targeted assessment tasks, the study's insight results and the recorded positive attitude of the participants, it seems that use of such virtual environments, like our VIRDA-MS, could mark a significant breakthrough in the …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:hC7cP41nSMkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Elevating and Safeguarding Culture Using Tools of the Information Society: Dusty Traces of the Muslim Culture",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=optXTg3ovBYC&oi=fnd&pg=PA3&dq=info:subDGzCRNSAJ:scholar.google.com&ots=OLP6pmjU04&sig=f-blNYQbffMBj7zfi50cVveGEg4",
            "Abstract": "The University as an academic institution, beyond its primary goal of new knowledge construction and high quality education, must have close connections with and contribute to society. This is even more important for a peripheral institution and especially for the University of Ioannina which is located in western Greece, an area with a great tradition in culture and a crucial geographical location.In western Greece (Epirus, Aitoloakarnania and northwestern Peloponnesus) and in Cyprus, which are at the frontiers of the historic Muslim–Ottoman world, as well as in southeastern Italy which is its western European border, a large amount of evidence exists that documents the history of a multicultural society.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:0EnyYjriUFMC",
            "Publisher": "Earthlab"
        },
        {
            "Title": "Measuring presence in a collaborative physics learning activity in Second Life",
            "Publication year": 2010,
            "Publication url": "http://korinthos.uop.gr/~hcicte10/proceedings/58.pdf",
            "Abstract": "Multi-user virtual environments (MUVEs) are surrounded by hype regarding their impact on and potential in education. Many issues regarding the educational affordances of MUVEs and the learning experience of users are still under research. Presence is an important phenomenon users experience when interacting with and via virtual environments and seems to play an important role in learning. This paper presents empirical data gathered from an exploratory study regarding a problem-based physics learning activity in Second Life (SL). Our aim is to gain knowledge and experience about the sense of presence (spatial and social) that emerges while students collaborate in MUVEs. Students (n= 30) collaborated “in-world” in order to solve a problem. Data were gathered using the Temple Presence Inventory (TPI) questionnaire. Results indicate higher scores of social presence than spatial presence. Correlations were found between dimensions of presence, subjective computer expertise and tendency to become involved in activities.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Research on E-Learning and ICT in Education: Technological, Pedagogical and Instructional Perspectives",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-95059-4.pdf",
            "Abstract": "In the field of education, the unique features of ICTs “afford actions that may be used in teaching and learning and consequently lead to learning benefits”(Mantziou et al., 2018). Thus, the learning affordances of mobiles include creation, multichannel communication, collaboration and cooperation, experimentation, real-time/anytime/anywhere information, and content delivery. In the same vein, MUVEs’ learning affordances are free navigation, modeling and simulation, creation, multichannel communication, collaboration and cooperation, and content delivery. The potential of ICTs in teaching and learning is the perception and enactment of learning affordances of the environment by designing and implementing meaningful learning activities that can lead to learning outcomes (Dalgarno & Lee, 2012; Mantziou et al., 2018). These learning activities implement a series of instructional strategies that are based on …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer"
        },
        {
            "Title": "Acceptance and User Experience of an Augmented Reality System for the Simulation of Sensory Overload in Children with Autism",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9155113/",
            "Abstract": "Sensory-perceptual difficulties are a common characteristic in Autism Spectrum Disorders (ASD). Studies in children with ASD describe an array of challenging behaviors regarding sensory simulation. Parents, special educators, and therapists are often witnessing these behaviors throughout the day. This study aimed to use an Augmented Reality (AR) system for the simulation of the sensory overload that children with ASD experience. A total of seventy (N=70) parents, special educators, and therapists of children with ASD responded to researchers' invitation for this study. Researchers held individual sessions with each participant who wore a head-mounted AR device (Magic Leap One™). Six visual and two auditory stimuli were individually and consecutively administered via the AR device. Participants experienced autism-like sensory overload under controlled conditions. Their acceptance and experience of the …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Learning efficiency of two ICT-based instructional strategies in Greek sheep farmers",
            "Publication year": 2016,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/1389224X.2015.1095775",
            "Abstract": "Purpose: The objective of the present study was to compare the learning efficiency of two information and communications technology (ICT)-based instructional strategies (multimedia presentation (MP) and concept mapping) in a sample (n = 187) of Greek sheep farmers operating mainly in Western Greece. Design/methodology/approach: In total, 15 instructional sessions have taken place. The knowledge assessment of the farmers, before and after the instructional interventions, was based on answers given to five questions of graded difficulty and the SOLO (Structure of Observed Learning Outcomes) taxonomy. Findings: The two instructional strategies showed comparable learning outcomes. Furthermore, prior participation to training sessions as well as the participants’ advanced education level enhanced the learning outcome. Practical implications: Simple applications of ICTs such as MPs and concept maps …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Stereoscopic Perception of Women in Real and Virtual Environments: A Study towards Educational Neuroscience.",
            "Publication year": 2013,
            "Publication url": "https://eric.ed.gov/?id=EJ1131096",
            "Abstract": "Previous studies report the involvement of specific brain activation in stereoscopic vision and the perception of depth information. This work presents the first comparative results of adult women on the effects of stereoscopic perception in three different static environments; a real, a two dimensional (2D) and a stereoscopic three dimensional (3D), all with the same content. Electric brain activity of 36 female students was analyzed at θ, α, β and γ frequency bands. Results in alpha rhythm as well as alpha desynchronization showed that the topology of cerebral activity is the same in the three environments. The participants experienced three similar and non-demanding environments without specific memory requirements and information encoding. Statistical differences in theta activity showed that the real and 3D environments caused similar cognitive processes, while the 2D caused an increase of anxiety indicating that perhaps participants were looking for the third dimension. Beta and gamma activity showed that participants perceived the third dimension of the stereoscopic environment as in the real one, something that did not happen in the 2D environment. Our findings indicate that stereoscopic 3D virtual environments seem to approximate the real ones as far as it regards the cognitive processes they cause. Three dimensional stereoscopic environments increase users’ attention over the 2D and cause less mental effort. These experimental results support the new field of educational neuroscience and its potential to the design of digital learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Themes in Science and Technology Education. The Educational Approaches to Virtual Reality Technologies Laboratory, University of Ioannina, Ioannina, GR 45110, Greece"
        },
        {
            "Title": "A comparison between oculus rift and a low-cost smartphone VR headset: immersive user experience and learning",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8001837/",
            "Abstract": "Differences in technological characteristics between expensive head-mounted displays like Oculus Rift and low-cost mobile-based Virtual Reality (VR) devices may affect the experience of the user and learning in virtual environments with an educational content and therefore are important to be studied. This paper describes a study that aims at finding differences in levels of spatial presence, usability, simulator sickness, satisfaction, workload and learning outcome between Oculus Rift and a low cost smartphone VR Headset, when users interact with an educational virtual environment. Our results do not show differences in the variables studied. It seems that mobile-based VR systems could provide acceptable levels of immersive user experience and contribute to the pedagogical use of VR.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using SOLO to evaluate an educational virtual environment in a technology education setting",
            "Publication year": 2010,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.13.3.233.pdf",
            "Abstract": "The present research investigates the contribution of an interactive educational virtual environment on milk pasteurization to the learning outcomes of 40 students in a technical secondary school using SOLO taxonomy. After the interaction with the virtual environment the majority of the students moved to higher hierarchical levels of understanding on the structure and operation of the pasteurization apparatus, the different paths and temperatures of fresh and pasteurized milk, hot and cold water, and the way heat is exchanged. The functional nature knowledge the students constructed, led them to develop physical nature knowledge, knowledge of the relationship between physical and functional nature, and finally process knowledge. The design of the three dimensional virtual environment, its content and the meaningful learning tasks are important for technology knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Presence: a unique characteristic in educational virtual environments",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10055-006-0039-1.pdf",
            "Abstract": "This article investigates the effect of presence on learning outcomes in educational virtual environments (EVEs) in a sample of 60 pupils aged between 11 and 13 years. We study the effect of personal presence, social presence and participant’s involvement on certain learning outcomes. We also investigate if the combination of the participant’s representation model in the virtual environment (VE) with the way it is presented gives a higher sense of presence that contributes to learning outcomes. Our results show that the existence of an avatar as the pupils’ representation enhanced presence and helped them to successfully perform their learning tasks. The pupils had a high sense of presence for both cases of the EVE presentation, projection on a wall and through a head mounted display (HMD). Our socialized virtual environment seems to play an important role in learning outcomes. The pupils had a …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Virtual Environments and Dyslexia: A literature review",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050914000192",
            "Abstract": "This study is a critical review of published scientific literature on the use of Virtual Reality and its applications in developmental dyslexia. The purpose of this research is to: (a) present a synthesis of the available empirical evidence, (b) identify the potential contribution of Virtual Environments (VEs) in the disorder's screening, intervention, awareness process and assessment, and (c) define future research perspectives concerning the applications of VEs in this particular research field. The results show that the research in the field focuses on: (a) visuospatial skills, (b) nonverbal problem skills, (c) memory performance, and (d) awareness increase for dyslexia. The majority of the articles found are pilot or small-scale studies that can only provide indications on the VEs and their beneficial results, but can provide useful guidance for researchers, educators, practitioners and parents.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "EIKON: Teaching a high-school technology course with the aid of virtual reality",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1012005624624",
            "Abstract": "This paper presents EIKON, an integrated open educational environment used to support high-school technology courses. EIKON combines state-of-the-art information technologies, such as virtual reality, hypermedia and networking. Our pedagogical approach is constructivism and collaborative learning. Students using EIKON study the evolution of agricultural technology since the prehistoric times. The environment could be used as a starting point for the exploration of virtual reality microworlds and the discovery of multidisciplinary information, which relates to most of the courses taught in modern high-schools (history, geography, physics, chemistry, biology, environmental care, ecological awareness etc). A case study with a sample of nineteen information technology high-school teachers reports on content, pedagogical, and software quality issues. The results indicate competence of multimedia …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:qjMakFHDy7sC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Objective presence measures through electric brain activity",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Tassos-Mikropoulos/publication/228971828_Objective_presence_measures_through_electric_brain_activity/links/0912f509004a04e0a0000000/Objective-presence-measures-through-electric-brain-activity.pdf",
            "Abstract": "This article presents results on objective measures concerning the sense of presence in virtual environments. Electric brain activity of seven students was recorded and analyzed during their interaction with four different versions of the same virtual environment, a representation of a room. Our aim was to detect if some sensory, realism and distraction factors that are related with presence result on differences in electric brain activity, indicating attentional activity and visual awareness as a virtual environment is enriched with textures and objects. Our results show both an alpha band decrease and a gamma band increase with the virtual environment enrichment with textures and objects. These are indications that factors related with the sense of presence in virtual environments affect electric brain activity. Electric brain activity could be considered as an objective measure of presence in virtual environments.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Students' performance towards computer simulations on kinematics",
            "Publication year": 2000,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/14978",
            "Abstract": "Repository of UOI \"Olympias\": Students' performance towards computer simulations on \nKinematics Skip navigation Home Browse Communities & Collections Browse Items by: \nIssue Date Author Title Subject Item Type Advanced Search Help About DSpace Sign on to: \nMy DSpace Receive email updates Edit Profile Saved Searches Favorites Repository of \nUOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Επιστημών \nΑγωγής 4.Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης 5.Άρθρα σε επιστημονικά περιοδικά ( \nΑνοικτά) Ελληνικά English Please use this identifier to cite or link to this item: https://olympias.lib.uoi.gr/jspui/handle/123456789/14978 \nInstitution and School/Department of submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Επιστημών \nΑγωγής. Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης URI: https://olympias.lib.uoi.gr/jspui/handle/123456789/14978 \nAppears in Collections: Άρθρα σε επιστημονικά '…",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "STUDENTS’VIEWS ON DIFFERENT LEARNING OBJECTS TYPES",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=14514028288252718341&hl=en&oi=scholarr",
            "Abstract": "The paper attempts to compare students’ views on three different Learning Objects (LOs), also known as Web-Based Learning Tools (WBLTs), which are used for educational purposes aiming at natural disaster readiness. Following an iterative development process, 100 LOs of various types are being produced. The LOs are addressed to pupils ranging from 5-16 years old who attend Greek schools. Through the LOs to be produced students will be equipped with the necessary knowledge as well as they will be taught safety measures, behavioral rules and measures for the practical confrontation of natural disasters phenomena.  This paper discusses briefly the design and development of the learning objects and more extensively the first student evaluation conducted during the development phase. 90 students aged 11 and 12 years old from a Greek elementary school interacted with three learning objects of …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IATED"
        },
        {
            "Title": "Learning outcome, presence and satisfaction from a science activity in Second Life",
            "Publication year": 2016,
            "Publication url": "https://ajet.org.au/index.php/AJET/article/view/2164",
            "Abstract": "Although problem-based learning (PBL) has many advantages, it often fails to connect to the real world outside the classroom. The integration with the laboratory setting and the use of information and communication technologies (ICTs) have been proposed to address this deficiency. Multi-user virtual environments (MUVEs) like Second Life (SL) are 3D collaborative virtual environments that could act as complementary or alternative worlds for the implementation of laboratory PBL activities offering low-cost, safe, and always available environments. The aim of this study was to compare a simple laboratory PBL activity implemented in both the real and virtual worlds, in terms of learning outcome, satisfaction, and presence. The sample consisted of 150 undergraduate university students. The results show that the MUVE provided similar learning outcome and satisfaction to the real-world condition. Presence was positively correlated to satisfaction but not to the learning outcome. Finally, there are indications that the MUVE was perceived as more pleasurable and informal learning environment, while reality was perceived as more stressful. [Author abstract]",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Second language teaching in elementary school with a multimedia gloss",
            "Publication year": 2011,
            "Publication url": "http://www.ipedr.com/vol26/12-ICLLL%202011-L00023.pdf",
            "Abstract": "This work investigates the effects of a special designed multimedia gloss on learning outcomes concerning vocabulary learning in German as a second language in elementary school pupils. The gloss involves annotations of unknown words in three different representations: text translation from German into Greek, presentation of the word in German and its translation pronounced in Greek, and word interpretation by using a picture. Thirty one pupils of ages 10-11 years interacted with the multimedia gloss and participated in computer-based learning activities. The outcomes on vocabulary learning were positive, with the majority of pupils to prefer the aural annotations of the unknown words. The attitude of all pupils towards use of the multimedia gloss and activities was also positive. Our findings support Mayer’s cognitive theory of multimedia learning in the field of language learning.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital Learning Objects Support Grade-Aligned Physics Instruction For High School Students With Mild Intellectual Disability: DLOs in Physics instruction for students with MID",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3439231.3439267",
            "Abstract": "The purpose of the study was to examine the impact of digital learning objects (DLOs) on Physics knowledge improvement for three students with mild intellectual disability in a high school setting. A multiple probe across participants design was used to examine the effectiveness of the intervention. The results indicated a functional relation between the intervention and the correct answers in Physics probes. The study highlighted the positive effects of the use of the DLOs instruction to teach Physics content to students with mild intellectual disability. Implications for practice and suggestions for future research are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Brain research in science education research",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-0165-5_37",
            "Abstract": "Recently, neuroscientists, psychologists and pedagogues work on cognition, learning and teaching involving instructional technologies, each of them from their own point of view, towards a biological basis of learning.This paper proposes the exploitation of neuropsychological methods and non-invasive imaging techniques for the study of mental conditions and especially of cognitive tasks in technologically enriched educational environments for science learning. It proposes the study of brain waves coming from different areas of the cortex and their spectral analysis using Fast Fourier Transforms for the understanding of various cognitive processes taking place during specific tasks of users interacting with computer-based educational environments, and especially virtual reality (VR) systems. The model proposed is supported by recent experimental findings reflecting greater alertness and task …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "A Review of Literature",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=QVaRAAAAQBAJ&oi=fnd&pg=PA279&dq=info:HniB5NC2SC8J:scholar.google.com&ots=COrWO44qLh&sig=4n0QU3fraNLZmowaiYd7g6DSdXU",
            "Abstract": "In today’s knowledge economy formal education establishments are faced with a number of challenges regarding the improvement of students’ learning. With respect to the need for promoting educational reforms, technology can play a catalytic role by providing unique opportunities for creating effective learning environments. Digital games constitute an example of a technological facilitator that can be exploited for the design and implementation of pedagogical innovations. Existing research provides evidence for the effectiveness of digital games with respect to achieving subject-speciﬁc learning objectives. However, there are relatively few efforts concerned with the investigation of their impact on the development of higher-order cognitive skills, as well as emotional and motivational outcomes. Furthermore, the lack of appropriate game-based assessment methods makes imperative the need for further research that will allow for establishing evidence-based conclusions about the learning effectiveness of digital games. Within this context, the aim of this book chapter is to provide an overview of research issues related to digital game-based learning with an emphasis on its application in formal education settings identifying differences between school and higher education.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Forecasting students’ performance using an ensemble SSL algorithm",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-20954-4_43",
            "Abstract": "Educational data mining is a growing academic research area which aims to gain significant insights on student behavior, interactions and performance by applying data mining methods on educational data. During the last decades, a variety of accurate models has been developed to monitor students’ future progress, while most of these studies are based on supervised classification methods. In this work, we propose an ensemble semi-supervised algorithm for the prediction of students’ performance in the final examinations at the end of academic year. The experimental results demonstrate the efficiency and robustness of the proposed algorithm compared to some classical classification algorithms, in terms of accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:f2IySw72cVMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Ιδιότητες Εκπαιδευτικών Εικονικών Περιβαλλόντων 1: Επιτραπέζια Συστήματα",
            "Publication year": 2008,
            "Publication url": "http://ecourse.uoi.gr/pluginfile.php/136302/mod_resource/content/1/2008IdiotitesEVE1ETPE.pdf",
            "Abstract": "Η παρούσα αποτελεί το πρώτο μέρος από δυο εργασίες που έχουν ως στόχο τη διερεύνηση των ιδιοτήτων της εικονικής πραγματικότητας που αξιοποιούν Εκπαιδευτικά Εικονικά Περιβάλλοντα (ΕΕΠ) και μπορούν να συνεισφέρουν σε θετικά μαθησιακά αποτελέσματα. Από εκτενή βιβλιογραφική επισκόπηση και κριτική θεώρηση της βιβλιογραφίας αναδεικνύεται ότι τα ΕΕΠ αποτελούν ένα πολλά υποσχόμενο εκπαιδευτικό εργαλείο διαφορετικό από άλλες τεχνο λογικές υλοποιήσεις, με κύριο χαρακτηριστικό την παροχή ή ενίσχυση των εμπειριών των μαθητών. Επισημαίνεται όμως και μια στασιμότητα στη διαδι κασία αποδοχής τους και κατ’επέκταση εισαγωγής τους στην εκπαιδευτική διαδικασία. Οι ιδιότητες που κυριαρχούν στα ΕΕΠ είναι η ελευθερία πλοήγη σης και η οπτική γωνία πρώτου προσώπου, που δηλώνουν την αναζήτηση για μαθησιακά περιβάλλοντα που μεταφέρουν τις λειτουργίες του ανθρώπου σε τρισδιάστατες …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design, Development and Evaluation of Advanced Learning Environments. An Overall Approach",
            "Publication year": 2000,
            "Publication url": "https://www.researchgate.net/profile/Tassos-Mikropoulos/publication/317690915_Design_Development_and_Evaluation_of_Advanced_Learning_Environments_An_Overall_Approach/links/5949495b4585158b8fd5ac50/Design-Development-and-Evaluation-of-Advanced-Learning-Environments-An-Overall-Approach.pdf",
            "Abstract": "This work comments on an overall approach to the design, development and evaluation of advanced learning environments. After a critical review of the related bibliography, it seems that there are no guidelines and questionnaires for an integrated design and evaluation process, covering all the factors involved and addressed to different groups of evaluators. This article tries to give an overall approach proposing three groups of interconnected factors for the design and evaluation of educational software. These are the information content, the context, and the evaluation process. These groups of factors are represented in three-dimensional graphs. The space under each graph integrates the design and evaluation criteria for educational software.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Appreciation to EAIT reviewers",
            "Publication year": 2011,
            "Publication url": "https://search.proquest.com/openview/d36f0948e26e6d0843fcbec89c67fde1/1?pq-origsite=gscholar&cbl=55384",
            "Abstract": "For helping us deliver timely decisions to our authors, the Editor-in-Chief and Publisher would like thank the following individuals who contributed reviews from 2010 through June 2011. We applaud your efforts and dedication to the community.",
            "Abstract entirety": 1,
            "Author pub id": "3ZaLmnkAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A decision support system for predicting students’ performance",
            "Publication year": 2016,
            "Publication url": "https://www.learntechlib.org/p/174254/",
            "Abstract": "Educational data mining is an emerging research field concerned with developing methods for exploring the unique types of data that come from educational context. These data allow the educational stakeholders to discover new, interesting and valuable knowledge about students. In this paper, we present a new user-friendly decision support tool for predicting students’ performance concerning the final examinations of a school year. Our proposed tool is based on a hybrid predicting system incorporating a number of possible machine learning methods and achieves better performance than any examined single learning algorithm. Furthermore, significant advantages of the presented tool are that it has a simple interface and it can be deployed in any platform under any operating system. Our objective is that this work may be used to support student admission procedures and strengthen the service system in …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Themes in Science and Technology Education"
        },
        {
            "Title": "Digital games as tools for designing and implementing pedagogical innovations: A review of literature",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-7366-4_14",
            "Abstract": "In today’s knowledge economy formal education establishments are faced with a number of challenges regarding the improvement of students’ learning. With respect to the need for promoting educational reforms, technology can play a catalytic role by providing unique opportunities for creating effective learning environments. Digital games constitute an example of a technological facilitator that can be exploited for the design and implementation of pedagogical innovations. Existing research provides evidence for the effectiveness of digital games with respect to achieving subject-specific learning objectives. However, there are relatively few efforts concerned with the investigation of their impact on the development of higher-order cognitive skills, as well as emotional and motivational outcomes. Furthermore, the lack of appropriate game-based assessment methods makes imperative the need for further …",
            "Abstract entirety": 0,
            "Author pub id": "3ZaLmnkAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, New York, NY"
        }
    ]
}]