[{
    "name": "Αντώνιος Μπόγρης",
    "romanize name": "Antonios Bogris",
    "School-Department": "Μηχανικών Πληροφορικής και Υπολογιστών Πανεπιστήμιο Δυτικής Αττικής  (Μηχανικών Πληροφορικής Τ.Ε.)",
    "University": "uniwa",
    "Rank": "Καθηγητής",
    "Apella_id": 18905,
    "Scholar name": "Adonis Bogris",
    "Scholar id": "3lXJLxwAAAAJ",
    "Affiliation": "Department of Informatics and Computer Engineering, University of West Attica, Greece",
    "Citedby": 3595,
    "Interests": [
        "photonics",
        "optical communications and networks",
        "neuromorphic computing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=3lXJLxwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "WDM Switching Module Based on Active Microring Resonators: Applications to Metro Networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377411/",
            "Abstract": "The switching properties of a resonator consisting of two serially cascaded active micro rings are reported. The switching is achieved through the variation of the refractive index and the losses of the micro rings with current injection, which alters the overall output spectral response. The switch is suitable for optical burst switching systems and metro architectures as it provides fast optical switching in the ns scale with contrast ratio higher than 30 dB for 10 Gbps intensity modulated signals. Its potential applications to a metro network node are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WDM transmission of chaotic signals",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4729142/",
            "Abstract": "The transmission performance of wavelength division multiplexed chaotic signals is numerically investigated. The impact of transmitted power, bit-rate and channel arrangement on the overall performance is highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ten gigabit per second optical transmissions at 1.98 µm in centimetre-long SiGe waveguides",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/iel7/2220/8024183/08024214.pdf",
            "Abstract": "Error-free transmission of 10 Gbit/s non-return to zero optical signals along 2.5 cm long silicon germanium waveguides at a wavelength of 1.98 μm is demonstrated. Bit error rate measurements confirm the absence of penalty during the transmission through a subwavelength of 1.3 and 2.2 μm wide waveguides.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:WM2K3OHRCGMC",
            "Publisher": "IET"
        },
        {
            "Title": "Compensation of Fiber Nonlinearities in Digital Coherent Systems Leveraging Long Short-Term Memory Neural Networks",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-38-21-5991",
            "Abstract": "We introduce for the first time the utilization of Long short-term memory (LSTM) neural network architectures for the compensation of fiber nonlinearities in digital coherent systems. We conduct numerical simulations considering either C-band or O-band transmission systems for single channel and multi-channel 16-QAM modulation format with polarization multiplexing. A detailed analysis regarding the effect of the number of hidden units and the length of the word of symbols that trains the LSTM algorithm and corresponds to the considered channel memory is conducted in order to reveal the limits of LSTM based receiver with respect to performance and complexity. The numerical results show that LSTM Neural Networks can be very efficient as post processors of optical receivers which classify data that have undergone non-linear impairments in fiber and provide superior performance compared to digital back …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:3_f9JqYsqVQC",
            "Publisher": "https://ieeexplore.ieee.org/document/9136902"
        },
        {
            "Title": "Parallel optical random bit generator",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-44-10-2446",
            "Abstract": "We present an optical approach for high-speed parallel random bit generation based on stochastic pulse-to-pulse fluctuation in the supercontinuum (SC). Through spectrally demultiplexing the SC pulse sequence into different wavelength channels, we simultaneously extract multiple independent fast random bit streams from each SC pulse subsequence via associated comparators in parallel. Proof-of-concept experiments demonstrate that using our method, four 10 Gb/s random bit streams are obtained from a SC pulse source with verified randomness. Moreover, this method also provides a promising strategy to fabricate ultrafast random bit generators with Tb/s throughput capacity just by increasing additional wavelength channels.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:1_W9tMSvGuwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "50 Gbaud homodyne coherent receivers relying on line-coding and injection locking in lasers: A potential low-cost modem for short reach optical networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801955",
            "Abstract": "We present a numerical analysis of 50 Gbaud coherent detection enabled by injection locked lasers and line coding. The coherent receiver was tested with respect to an ideal receiver for two higher order modulation formats (16-QAM, QPSK) and under diverse operating regimes relating to the slave laser linewidth properties, the injection level and the frequency detuning between the incoming signal and the slave laser. The impact of the slave laser properties and line coding techniques on the receiver performance is highlighted showing that the technique could be used as a practical solution in order to enable low-cost and short reach nx 100 Gb/s Ethernet communication systems with the potential of flexible in terms of rate transmission.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:2Q0AJrNhS-QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-optical phase regeneration of 40Gbit/s DPSK signals in a black-box phase sensitive amplifier",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=nfoec-2010-PDPC3",
            "Abstract": "We present a black-box four wave mixing based bit-rate-flexible phase sensitive amplifier and use it in the first demonstration of 40 Gbit/s DPSK phase regeneration.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:uEM9VtRl8xsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Microwave frequency dissemination systems as sensitive and low-cost interferometers for earthquake detection on commercially deployed fiber cables",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2111.02957",
            "Abstract": "We experimentally demonstrate a microwave frequency dissemination system operating as a sensitive interferometric sensor of seismic waves on commercially deployed fiber networks in Attika, Greece. Efficient detection of seismic waves from distant epicenters (>400km)",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:dhpJJ7xvgBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Black-box optical regenerator exploiting non-degenerate phase-sensitive amplification",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5621356/",
            "Abstract": "An optical regeneration scheme based on non-degenerate phase-sensitive amplification in highly-nonlinear fibers is proposed. The regenerator exhibits significant amplitude and phase noise suppression properties and eliminates the need for precise phase and frequency locking with the input signal.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "SOA-Induced Noise Effects on Chaos Generation and Synchronization of Semiconductor Lasers",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4336152/",
            "Abstract": "In this letter, the noise effects induced by semiconductor optical amplification within a cavity with external optical feedback are studied, in terms of chaos complexity of the generated emitter's signal, as well as the ability of an appropriate receiver to synchronize with the emitted signal in a chaos-based optical communication system.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Field demonstrator of a chaos encrypted optical transmission system",
            "Publication year": 2005,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/cp_20050780",
            "Abstract": "We report on the successful demonstration of a chaos encrypted gigabit optical transmission system utilizing a commercially available optical network installed in the metropolitan area of Athens. (2 pages)",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Phase locking and carrier extraction schemes for phase sensitive amplification",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5549276/",
            "Abstract": "We demonstrate two schemes which enable simultaneous phase locking, carrier extraction and frequency shifting for use in stand-alone phase sensitive amplifiers. The schemes provide phase locked pumps at appropriate frequency spacing for a number of non-degenerate PSA configurations.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Colorless regenerative amplification of constant envelope phase-modulated optical signals based on injection-locked Fabry–Pérot lasers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6045308/",
            "Abstract": "An efficient phase preserving amplitude noise limiter suitable for constant envelope phase-modulated signals is experimentally demonstrated for 10-Gb/s differential phase-shift-keying (DPSK) signals exploiting injection locking in Fabry-Pérot lasers. The limiter operates successfully over a 16.4-nm tuning range leading to 12 dB of power penalty reduction for 10 -3  of bit-error-rate (BER) performance.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polarization insensitive wavelength conversion in a low-birefringence SiGe waveguide",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7416159/",
            "Abstract": "We report the first demonstration of a single-pass dual-orthogonal-pump four-wave mixing-based wavelength conversion scheme in a silicon-based waveguide. The silicon germanium waveguide used was designed to exhibit strong TE/TM mode similarity across a broad wavelength range as well as a large nonlinear coefficient. A polarization-dependent loss of just 0.42 dB was measured, and the conversion of 40-Gb/s differential phase-shift keying signals was demonstrated with 1.5-dB power penalty at a bit error ratio of 10 -9 .",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:BCdnXsLIVDwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental investigation of intensity noise in injection locked mid-infrared quantum cascade lasers",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9382/938210/Experimental-investigation-of-intensity-noise-in-injection-locked-mid-infrared/10.1117/12.2079462.short",
            "Abstract": "The intensity noise properties of injection locked mid-infrared quantum cascade lasers are experimentally investigated. The injection locking is realized below and near the threshold of the free running slave laser, resulting in an efficient technique to achieve low noise operation. It is found that below threshold the locking characteristics (locking range shape and bandwidth) are different in comparison to those above threshold. Furthermore, an alternative injection locking realization is also investigated: injection locking into longitudinal side modes of the slave laser. Here, similar characteristics were observed, however, with the potential to achieve even higher relative intensity noise reduction suppression with respect to the quantum noise limit. The measurements are confirmed by numerical simulations with a travelling-wave model which takes into account the multi-mode spectrum of the slave laser and the spectral …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:VjBpw8Hezy4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Photonic integrated device for chaos applications in communications",
            "Publication year": 2008,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.100.194101",
            "Abstract": "A novel photonic monolithic integrated device consisting of a distributed feedback laser, a passive resonator, and active elements that control the optical feedback properties has been designed, fabricated, and evaluated as a compact potential chaotic emitter in optical communications. Under diverse operating parameters, the device behaves in different modes providing stable solutions, periodic states, and broadband chaotic dynamics. Chaos data analysis is performed in order to quantify the complexity and chaoticity of the experimental reconstructed attractors by applying nonlinear noise filtering.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Research Data for Polarization Insensitive Wavelength Conversion in a Dispersion-Engineered SiGe Waveguide",
            "Publication year": 2016,
            "Publication url": "https://eprints.soton.ac.uk/386211/",
            "Abstract": "Research Data for Polarization Insensitive Wavelength Conversion in a Dispersion-Engineered \nSiGe Waveguide - ePrints Soton The University of Southampton Courses University life \nResearch Business Global About Visit Alumni Departments News Events Contact × Search the \nSite Search Filter your search: All Courses Projects Staff University of Southampton Institutional \nRepository Search Advanced Search Policies & Help Latest Download Statistics Browse by \nYear Browse by Divisions LeftRight Research Data for Polarization Insensitive Wavelength \nConversion in a Dispersion-Engineered SiGe Waveguide Ettabib, Mohamed, Kapsalis, \nAlexandros, Bogris, Adonis, Parmigiani, Francesca, Fernandez Rancano, Victor, Bottrill, Kyle, \nBrun, M., Labeye, Pierre, Nicoletti, Sergio, Hammani, Kamal, Syvridis, Dimitris, Richardson, \nDavid and Petropoulos, Periklis (2016) Research Data for Polarization Insensitive Wavelength -…",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:j2GSQqY3pL0C",
            "Publisher": "University of Southampton"
        },
        {
            "Title": "3D P-Torus: Wavelength-Based Switching in Packet Granularity for Edge Data Center Networks",
            "Publication year": 2022,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-16-1781-2_25",
            "Abstract": "In this paper, we introduce 3D P-Torus, a novel intra-DC architecture, based on the 3-dimensional torus topology, that utilizes wavelength switching at the packet level to achieve improved latency and throughput performance compared to earlier variants of the P-Torus architecture and other wavelength switching intra-DC architectures. By a single-hop communication design between On-Rack Switches, 3D P-Torus achieves great latency and throughput performance, as calculated through detailed simulations. All buffering needs are covered through electronic buffering, avoiding hard to implement and expensive optical buffering. 3D P-Torus can support, with no need for amplification, medium-sized-DCs up to 10k servers, making it an excellent candidate for Edge Data Centers, taking into account its excellent low end-to-end latency.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:F9HO9s0W2bwC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Statistical properties of broadband chaotic signals for ultrafast true random bit sequence generation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6647812/",
            "Abstract": "Optical chaotic carriers can be exploited as sources for true random bit sequence (TRBS) generation at ultrafast rates for securing data transmission. An experimental investigation on the statistical properties of such signals is performed and associated to TRBS generation performance.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:p2g8aNsByqUC",
            "Publisher": "IET"
        },
        {
            "Title": "All-optical regeneration based on pump-depletion effect in fiber parametric amplification",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6116/61160J/All-optical-regeneration-based-on-pump-depletion-effect-in-fiber/10.1117/12.647798.short",
            "Abstract": "A novel all-optical regeneration approach based on fiber-optic parametric amplification operating under the strong pump depletion regime is numerically demonstrated. The key point for the regenerator's operation is related to the fact that a high-power intensity modulated signal depletes the continuous wave pump in such a manner that the latter becomes intensity modulated and inverted compared to the signal. Using a cascade of two such devices a non-inverted, either wavelength converted or not, amplitude modulated output, which exhibits regenerative characteristics with respect to the input signal can be provided. Extended numerical simulations have been carried out on one hand to estimate the transfer characteristics of the regenerator and on the other hand to assess the cascadability performance on a typical 40Gb/s transmission system. Through the latter analysis very promising results have been derived …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:hC7cP41nSMkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Electronic distortion compensation in the mitigation of optical transmission impairments: the view of joint project on mitigation of optical transmission impairments by electronic means ePhoton/ONe1 project",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/document/4804869/",
            "Abstract": "The key design approaches and results in the field of compensation of optical impairment distortion by electronic means, as an outcome of the studies and research innovations developed within the joint project on mitigation of optical transmission impairments by electronic means work group of the ePhoton/ONe+ European project are presented. The research topics addressed are related to chromatic and polarisation mode dispersion, with particular reference to feed-forward/decision-feedback equaliser and maximum-likelihood sequence estimation-based equalisers as well as pre-distortion schemes. Additionally, the use of electronic compensation in metro/access applications is examined with reference to studies related to the performance enhancement of directly modulated laser transmitters, the compensation of the square-law characteristics of receivers and the equalisation of multi-level format schemes.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IET"
        },
        {
            "Title": "Implementation of 140 Gb/s true random bit generator based on a chaotic photonic integrated circuit",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/fulltext.cfm?uri=oe-18-18-18763",
            "Abstract": "In the present work a photonic integrated circuit (PIC) that emits broadband                 chaotic signals is employed for ultra-fast generation of true random bit sequences.                 Chaotic dynamics emerge from a DFB laser, accompanied by a monolithic integrated                 1-cm long external cavity (EC) that provides controllable optical feedback. The                 short length minimizes the existence of external cavity modes, so flattened                 broadband spectra with minimized intrinsic periodicities can emerge. After sampling                 and quantization - without including optical de-correlation techniques and using                 most significant bits (MSB) elimination post-processing - truly random bit streams                 with bit-rates as high as 140 Gb/s can be generated. Finally, the extreme robustness                 of the random bit generator for adaptive bit-rate operation and for various                 operating conditions of the PIC …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "An Optoelectronic PLL Synthesizer with Optical Comb Reference",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8535557/",
            "Abstract": "A tunable synthesizer based on optoelectronic phase locked loop is proposed, for the generation of microwave and mmwave frequencies using optical modulation, frequency division and phase locking processes. The synthesizer maintains the fractional stability of the optical comb reference.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:YGhAHpnIhDoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "2014 Index IEEE Journal of Quantum Electronics Vol. 50",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7024230/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the co-authors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:u_mOZUIutIEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance characterization of a closed-loop chaotic communication system including fiber transmission in dispersion shifted fibers",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1327784/",
            "Abstract": "The transmission performance of an all-optical closed-loop chaotic communication system is numerically studied, assuming various span lengths of dispersion shifted fiber between transmitter and receiver. Calculation of the mean synchronization error and Q-factor values obtained from the corresponding eye diagrams has been carried out for two encoding methods (chaotic modulation and chaos shift keying) and two repetition rates (2.4 and 5 Gbps). It is shown that transmission impairments including chromatic dispersion, fiber nonlinearity, fiber losses, and amplified spontaneous emission noise of the inline amplifiers degrade significantly the synchronization quality especially when high-bit-rate message encoding is applied. The influence of key system parameters such as launched optical power, amplifier spacing, positive or negative dispersion, etc., to the transmission performance has been investigated …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multilevel quantization of optical phase in a novel coherent parametric mixer architecture",
            "Publication year": 2011,
            "Publication url": "https://www.nature.com/articles/nphoton.2011.254",
            "Abstract": "The exponentially increasing capacity demand in information systems will be met by carefully exploiting the complementary strengths of electronics and optics 1, 2. Optical signal processing provides simple but powerful pipeline functions that offer high speed, low power, low latency and a route to densely parallel execution 3. A number of functions such as modulation and sampling 4, 5, 6, 7, complex filtering 8 and Fourier transformation 9 have already been demonstrated. However, the key functionality of all-optical quantization has still not been addressed effectively. Here, we report an all-optical signal processing architecture that enables, for the first time, multilevel all-optical quantization of phase-encoded optical signals. A four-wave-mixing process is used to generate a comb of phase harmonics of the input signal, and a two-pump parametric process to coherently combine a selected harmonic with the input …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:-f6ydRqryjwC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Broadband chaos generated by photonic monolithically integrated oscillators",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4729143/",
            "Abstract": "A novel photonic monolithic integrated device has been designed, fabricated and evaluated as a compact potential emitter for high-speed optical communication systems that employ chaos data encryption.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of the Performance of Microring Lasers as Tunable Transmitters for Application in Future WDM/Ultra Wideband (UWB)‐over‐Fiber Hybrid Networks",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3521337",
            "Abstract": "The performance of tunable directly modulated 1.55‐μm InGaAsP/InP microring lasers is investigated for the case of multiband orthogonal frequency division multiplexing (MB‐OFDM) signal transmission, for application in ultra wideband (UWB)‐over‐fiber links. The assessment is based on numerical results derived from a multimode rate equation model. The properties of the microring laser are examined both qualitatively and quantitatively via typical constellation diagrams and error vector magnitude (EVM) calculations, respectively. The results depict a minimum EVM of less than 10% when the modulation ratio is in the order of 0.17 to 0.27.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:O3NaXMp0MMsC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "10 GBit/s Optical Transmissions at 1.98 µm in cm-long SiGe Waveguides",
            "Publication year": 2017,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01558568/document",
            "Abstract": "We demonstrate error-free transmission of 10-Gbit/s non-return to zero optical signals along 2.5-cm long SiGe waveguides at a wavelength of 1.98  µm. Bit error rate measurements confirm the absence of penalty during the transmission through a subwavelength 1.3 µm-wide waveguide as well as through a 2.2 µm wide waveguide.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:1wZ_wKGpLuwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A microwave optoelectronic PLL synthesizer based on optical comb reference",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8653392/",
            "Abstract": "A tunable high-resolution synthesizer based on optoelectronic phase locked loop is proposed for the generation of microwave and mmWave frequencies. Optical modulation, frequency division, and phase locking processes are deployed to generate a tunable lower frequency exhibiting suppressed phase noise. Moreover, a dense tunable optical comb locked to the widely spaced reference is produced. A suite of microwave and mmWave frequencies in multiple frequency bands emerges from the beating of the generated optical frequency components and optical or electrical filtering may isolate the frequency bands of interest. The phase noise of the synthesized frequencies depends on the optical power of the input reference comb. The experimental evaluation, including Allan deviation and phase noise measurements, prove the high stability performance of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:hB2aVRuWZNwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis between the noise properties of single-pump and dual-pump fiber optical parametric amplifiers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1576501/",
            "Abstract": "A comparison between the noise characteristics of single-pump and dual-pump fiber optical parametric amplifiers is theoretically carried out in terms of the noise figure, accounting for the amplified quantum noise and the excess pump noise",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:HDshCWvjkbEC",
            "Publisher": "IET"
        },
        {
            "Title": "Neuromorphic Integrated Photonics as Hardware Accelerators for Ultra-high Speed Telecom and Imaging Applications",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=PSC-2021-W1C.2",
            "Abstract": "In this paper we propose a new neuromorphic photonic integrated architecture based on recurrent optical filters as core reservoir computing building blocks forming an efficient hardware accelerator for pattern recognition in telecom and imaging applications.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:RgznTc0nqo4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Micro-ring-resonator based passive photonic spike-time-dependent-plasticity scheme for unsupervised learning in optical neural networks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9083359/",
            "Abstract": "In this work, a photonic spike-time-dependent-plasticity scheme based on high-order passive ring resonators is demonstrated. Numerical simulations confirmed the validity of the approach assuming post and pre-synaptic quantum dot laser neurons.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:lRPiJ3GhvscC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feature Articles: Communications & Information Security 4 Architectural Approaches to Network and Service Access Authentication",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Adonis-Bogris/publication/230765744_Chaos-based_Applications_in_Secure_Optical_Communications/links/0fcfd50fd81f6b41b3000000/Chaos-based-Applications-in-Secure-Optical-Communications.pdf",
            "Abstract": "Feature Articles: Communications & Information Security 4 Architectural Approaches to \nNetwork and Service Access Authentication China Communications June 2007 3 Feature \nArticles: Communications & Information Security Contents Feature Articles: \nCommunications & Information Security 4 Architectural Approaches to Network and Service \nAccess Authentication Marcin Dabrowski Piotr Pacyna 17 Analysis of Security \nVulnerabilities and Countermeasures of Ethernet Passive Optical Network (EPON) Di Jin, \nStamatios V. Kartalopoulos, Pramode K. Verma 30 Analysis on the Resilience of Key Pre-distribution \nin Sensor Networks Shen Yulong Ma Jianfeng Pei Qingqi 38 Hierarchical Spectrum Sharing \nNetworks Jie Chen, Chuan Han, Chulin Liao, and Shaoqian Li 48 Security Measures \nAgainst CBRN Threats: Case Study Olympic Games P. Stavroulakis, Professor 54 \nCustomized Biometric Architecture for Access in on -…",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:Q3-QASNKTMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical phase processor with enhanced phase quantization properties for higher order modulation formats relying on phase sensitive amplification and limiting amplifiers",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2015-CI_P_13",
            "Abstract": "Phase sensitive amplifiers (PSA) in fibers have been the basis of a number of diverse demonstrations in optical regeneration experiments for advanced coherent modulation formats such as BPSK, QPSK, QAM [1-3]. The most recent demonstrations propose solutions which are compatible with polarization multiplexing. The unique property of phase sensitive processes that differentiate them from other regeneration techniques is the perfect phase quantization they offer in two discrete phase states differing by π. When higher order modulation formats are targeted, for instance QPSK, either two typical PSAs should be incorporated, each for each quadrature, or a multi-format PSA, which however is not capable of providing ideal quantization [2]. It is obvious that for polarization multiplexed M-PSK signals, the former solution is not scalable. Therefore, a multi-format processor with potential for ideal multi-level phase …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:L7vk9XBBNxgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Chaos-on-a-chip secures data transmission in optical fiber links",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-18-5-5188",
            "Abstract": "Security in information exchange plays a central role in the deployment of modern communication systems. Besides algorithms, chaos is exploited as a real-time high-speed data encryption technique which enhances the security at the hardware level of optical networks. In this work, compact, fully controllable and stably operating monolithic photonic integrated circuits (PICs) that generate broadband chaotic optical signals are incorporated in chaos-encoded optical transmission systems. Data sequences with rates up to 2.5 Gb/s with small amplitudes are completely encrypted within these chaotic carriers. Only authorized counterparts, supplied with identical chaos generating PICs that are able to synchronize and reproduce the same carriers, can benefit from data exchange with bit-rates up to 2.5Gb/s with error rates below 10^−12. Eavesdroppers with access to the communication link experience a 0.5 probability to …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Transmission performance of a chaotic communication system consisting of semiconductor lasers with electro-optical feedback",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4801382/",
            "Abstract": "The transmission performance of a chaos-based communication system utilizing semiconductor lasers with electro-optical feedback is numerically assessed. The results reveal the possibility of long-distance, high-speed transmission.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Feedback phase in optically generated chaos: A secret key for cryptographic applications",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4418443/",
            "Abstract": "The feedback phase in a chaotic system consisting of a semiconductor laser subject to delayed optical feedback is considered for the first time as a secret key for secure chaotic communications not exclusively based on hardware uniqueness. Extensive numerical simulations illustrate that the feedback phase is of extreme importance as far as synchronization is concerned. The ability of an eavesdropper to attack the intensity-modulated message when a pseudorandom variation of the feedback phase is imposed at the transmitter's side is numerically quantified by bit-error-rate calculations. The analysis demonstrates that the eavesdropper is not able to synchronize and hence to extract the message when he is not aware of the phase variations even if he is equipped with an identical chaotic device.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Radio-over-fibre technologies arising from the building the future optical network in Europe (BONE) project",
            "Publication year": 2010,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-opt.2009.0062",
            "Abstract": "This study describes a wide range of salient radio-over-fibre system issues. Impulse radio and multi-band ultra-wideband signal distribution over both single-mode fibre and multi-mode fibre (MMF) implementations are considered. Carrier frequencies ranging from 3.1 to 10.6 GHz, up to 60 GHz, are featured, and the use of microring laser transmitters is discussed. A cost–performance comparative analysis of competing distributed antenna system topologies is presented, and a theoretical approach to understanding the factors underlying radio-over-MMF performance for within-building applications is discussed. Finally, techniques to minimise thermal impacts on performance are described and novel energy-efficient schemes are introduced. Overall, this study provides a snap-shot of research being undertaken by European institutes involved in the Building the future Optical Network in Europe (BONE) project.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Modulation format identification in fiber communications using single dynamical node-based photonic reservoir computing",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=prj-9-1-B1",
            "Abstract": "We present a simple approach based on photonic reservoir computing (P-RC) for modulation format identification (MFI) in optical fiber communications. Here an optically injected semiconductor laser with self-delay feedback is trained with the representative features from the asynchronous amplitude histograms of modulation signals. Numerical simulations are conducted for three widely used modulation formats (on–off keying, differential phase-shift keying, and quadrature amplitude modulation) for various transmission situations where the optical signal-to-noise ratio varies from 12 to 26 dB, the chromatic dispersion varies from −500 to 500 ps/nm, and the differential group delay varies from 0 to 20 ps. Under these situations, final simulation results demonstrate that this technique can efficiently identify all those modulation formats with an accuracy of >95% after optimizing the control parameters of the P-RC layer …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:DUFsPKDdMi0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Phase synchronization scheme for a practical phase sensitive amplifier of ASK-NRZ signals",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-19-13-12384",
            "Abstract": "We present a phase locking scheme that enables the demonstration of a practical dual pump degenerate phase sensitive amplifier for 10 Gbit/s non-return to zero amplitude shift keying signals. The scheme makes use of cascaded Mach Zehnder modulators for creating the pump frequencies as well as of injection locking for extracting the signal carrier and synchronizing the local lasers. An in depth optimization study has been performed, based on measured error rate performance, and the main degradation factors have been identified.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "High speed optical transmission at 2 μm in subwavelength waveguides made of various materials",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=iprsn-2018-ITu4I.6",
            "Abstract": "We report the transmission of a 10 Gbps telecommunication signal at 2 μm in waveguides made of three different materials: Si, SiGe and TiO 2. Bit error rates below 10− 9 can be achieved after transmission in the devices with subwavelength dimensions.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:cOfwuRB03ygC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Ultralow noise, broadband phase-sensitive optical amplifiers, and their applications",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6096352/",
            "Abstract": "Frequency nondegenerate phase-sensitive amplifiers (PSAs) have the potential to realize broadband and noiseless amplification. However, the rigorous requirement of phase- and wavelength-locking of the input waves has significantly hampered their progress. In this paper, we review recent research on this type of optical amplifier. This work is based on a copier-PSA scheme, which consists of a parametric phase-insensitive copier followed by one or more PSAs. Broadband gain and noise performance of a fiber-based nondegenerate PSA has been characterized, both theoretically and experimentally. A record-low 1.1 dB noise figure was measured at >;26 dB gain, and a clear phase dependent gain was observed. Moreover, potential applications including phase noise squeezing and ultralow noise, multichannel and modulation-format-transparent linear amplification with up to 6 dB link noise figure advantage …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mid-infrared gas sensor based on mutually injection locked quantum cascade lasers",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7553524/",
            "Abstract": "We present experimental investigations of a novel mid-infrared gas sensor relying on a laser system consisting of two quantum cascade sources mutually coupled with each other. The free-space path between the two lasers contains the sensing cell which is filled with the gas of interest. This laser system proves to be a very interesting dynamical system which can offer enhanced detectivity when compared to a conventional direct absorption spectrometer utilizing a laser, the gas cell, and a detector. We present comprehensive investigations of the operation regimes under which the laser system behaves as an efficient sensor and demonstrate its dependence on critical parameters such as the coupling strength between the two lasers and their bias currents. The experimental study is supported by numerical simulations, which provide a theoretical understanding of the underlying mechanisms. A six fold improvement …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:IyxfXMz2bNAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transient chirp suppression in directly modulated microring lasers",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4770142/",
            "Abstract": "The effect of internal feedback through bus waveguide reflectivity has been numerically evaluated as a key parameter for the improvement of direct modulation properties of microring lasers. According to calculations, appropriate values of feedback power result in damped relaxation oscillations and consequent transient chirp reduction. An evaluation of the above technique at 10 Gb/s including fiber transmission over 10 and 20 km indicates that microring lasers could efficiently operate as low-cost directly modulated transmitters in metro/access networks.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental evaluation of subcarrier modulation in chaotic optical communication systems",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-35-2-199",
            "Abstract": "Data streams with bit rates of up to 1 Gbit/s have been applied though the subcarrier modulation technique in an experimentally deployed optical communication system based on chaos data encryption and have been recovered efficiently. By shifting the spectral components of the encrypted data in regions where the chaotic carrier is powerful, a more efficient encryption and final message recovery is recorded with respect to the baseband modulation technique, improving the up-to-date performance of analogous systems.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Slow Light in Photonic Crystal Waveguides as a Key Enabler for Future Optical Network Technologies",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2645791.2645803",
            "Abstract": "All-optical technologies promise to alleviate bottleneck effects associated with electroptic conversions currently required in major network nodes. Nanophotonic structures such as photonic crystals may be used to manipulate light thereby adding intelligence in the optical physical layer. All-optical applications like optical buffering, optical switching, signal regeneration etc. are only a few applications that can be considered in future network nodes with integrated photonic crystal devices. Slow light propagation, ie reducing the group velocity of the propagating optical signals in photonic crystal waveguides can further enhance the signal processing capabilities of nanophotonic devices. Slow light is ideal for realizing optical buffers in integrated form while at the other hand it can lead to large increase of nonlinearities. In this paper, we focus on the capabilities and restrictions of slow-light photonic crystal waveguides in a …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:cdwqcPQS8ssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Linear and nonlinear properties of sige waveguides at telecommunication wavelengths",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6532526/",
            "Abstract": "We report the characterization of the optical properties of Silicon-Germanium (SiGe) waveguides. The evolution of these properties is presented as a function of the Ge concentration and the waveguide width.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel transmitter based on orthogonal modulation schemes for future passive optical networks",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=nfoec-2008-JThA102",
            "Abstract": "A low-cost technique for the upgrade of access passive optical networks based on multitone frequency shift keying (FSK) modulation format combined with conventional intensity modulation is proposed and numerically evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Towards precise one-way fiber-based frequency dissemination using phase-sensitive amplification",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-44-3-550",
            "Abstract": "In this Letter, we conceptually demonstrate the potential of a phase-sensitive amplifier to operate as an active detector of stochastic phase changes in fiber-based frequency dissemination systems with two orders of magnitude better sensitivity than state-of-the-art one-way systems relying on two-wavelength dissemination schemes. Theoretical and experimental analyses show that these stochastic phase changes (caused by environmental changes, e.g., due to temperature) can be detected with high sensitivity via optical phase comparison performed within the phase-sensitive amplifier. Experimental results are in close agreement with theoretical predictions showing that phase-sensitive amplifiers may find a niche application in metrology, with potential to significantly improve one-way fiber-based frequency dissemination systems.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:cww_0JKUTDwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Double sideband suppressed carrier modulation for stable fiber delivery of radio frequency standards",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401816306599",
            "Abstract": "We theoretically and experimentally investigate the properties of a double sideband suppressed carrier modulation transmission scheme for long distance microwave frequency standard dissemination. The proposed method effectively doubles the transmitted frequency obtaining enhanced phase noise and stability performance. Suppressing the optical carrier also eliminates the dispersion induced signal fading. Important transmission parameters like optical modulation depth and linearity are also improved. Allan deviation and phase noise measurements prove the superior performance of the proposed modulation format.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:TeJ9juy8vcMC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Investigation of an all-optical wavelength converter with reshaping properties based on four-wave mixing in passive microring resonators",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-22-12-2743",
            "Abstract": "The properties of an all-optical wavelength converter with reshaping characteristics,based on four-wave mixing (FWM) in a passive GaAs-AlGaAs microring resonator side-coupled to a bus waveguide, are investigated in this paper. The reshaping properties are based on the nonlinear FWM transfer function as a result of the two-photon absorption enhanced by the resonance effect. A detailed study of the static and dynamic reshaping characteristics of the wavelength converter has been carried out. Its performance, evaluated by extinction ratio and  Q-factor calculations, showed satisfactory regenerative properties up to 10 Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Full characterization of noise figure spectrum in a single-pumped fiber parametric amplifier",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2010-OWT5",
            "Abstract": "For the first time, an asymmetric NF spectrum induced by both Raman induced excess noise and Raman modified pump transferred noise of a fiber parametric amplifier has been measured. Experimental results agree well with theory.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:isC4tDSrTZIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Performance and complexity evaluation of recurrent neural network models for fibre nonlinear equalization in digital coherent systems",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9333288/",
            "Abstract": "We investigate the complexity and performance of recurrent neural network models as postprocessing units for the compensation of fibre nonlinearities in digital coherent systems carrying polarization multiplexed 16-QAM signals. We show that RNNs are promising nonlinearity compensators especially in dispersion unmanaged systems at reasonable complexity.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:IExZWSxeYXUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Broadband telecom to mid-infrared supercontinuum generation in a dispersion-engineered silicon germanium waveguide",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-40-17-4118",
            "Abstract": "We demonstrate broadband supercontinuum generation (SCG) in a dispersion-engineered silicon-germanium waveguide. The 3 cm long waveguide is pumped by femtosecond pulses at 2.4 μm, and the generated supercontinuum extends from 1.45 to 2.79 μm (at the −30  dB point). The broadening is mainly driven by the generation of a dispersive wave in the 1.5–1.8 μm region and soliton fission. The SCG was modeled numerically, and excellent agreement with the experimental results was obtained.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:vjZqxyZ7hS4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Converting mid-infrared signals to near-infrared through optomechanical transduction",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9370/93700T/Converting-mid-infrared-signals-to-near-infrared-through-optomechanical-transduction/10.1117/12.2078204.short",
            "Abstract": "Mid-infrared silicon photonics emerge as the dominant technology to bridge photonics and electronics in multifunctional high-speed integrated chips. The transmission and processing of optical signals lying at the mid-infrared wavelength region is ideal for sensing, absorption-spectroscopy and free-space communications and the use of group IV materials becomes principally promising as the vehicle towards their realization. In parallel, optical forces originating from modes and cavities can reach to outstandingly large values when sizes drop into the nanoscale. In this work, we propose the exploitation of large gradient optical forces generated between suspended silicon beams and optomechanical transduction as a means of converting signals from the mid-infrared to the near-infrared region. A midinfrared signal is injected into the waveguide system so as to excite the fundamental symmetric mode. In the 2-5μm …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:cF7EPgIk0B4C",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Chaos-based Applications in Secure Optical Communications",
            "Publication year": 2007,
            "Publication url": "https://old.kt.agh.edu.pl/~pacyna/journal_papers/pacyna-authentication-china07.pdf#page=67",
            "Abstract": "A comprehensive study of an all-optical chaotic communication system, including experimental realization, real-world testing and performance characterization through bit-error-rate analysis, is presented. Pseudorandom bit sequences that are effectively encrypted in a broadband carrier produced by a chaotic emitter and sent for transmission are recovered at the receiver side. Bit-error-rate (BER) values as low as 10-7 for 1 Gb/s data rate have been achieved. Different data code lengths and bit-rates at the Gb/s region have been tested. The application of optical transmission using 100km fiber spools in an in-situ experiment and 120km in an installed optical network showed that transmission effects do not act as a considerably deteriorating factor in the final performance of chaos-based optical communication systems.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-speed all-optical first-and second-order differentiators based on cross-phase modulation in fibers",
            "Publication year": 2008,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-26-18-3269",
            "Abstract": "An ultrafast all-optical differentiator generating the first- and the second-order temporal derivative of the intensity of optical signals is presented in this paper. Differentiation is obtained via an optical fiber that plays the role of an optical phase modulator, an optical bandpass filter and a photodetector. The operation of the proposed device is theoretically studied in order to highlight significant parameters that affect the performance of the differentiator, namely the filter transfer function, the power of the propagating waves and the fiber characteristics (length and nonlinear coefficient). The comparison between the numerically calculated derivatives and the theoretically expected ones is performed by estimating the correlation coefficient between them. According to the numerical analysis, high correlation coefficients can be achieved in certain operating regimes. The same device can be utilized in order to produce …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Photonic Spiking Convolutional Neural Networks for High-Speed Image Processing* Note: Sub-titles are not captured in Xplore and should not be used",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9505862/",
            "Abstract": "A multi-layer photonic spiking convolutional neural network is presented, based on miniaturized VCSELs, targeting image classification. Spatial information is encoded using a time multiplexing scheme providing a radical reduction of physical neuron-count. Hardware-friendliness is enhanced by exploiting unsupervised spike-timing dependent plasticity.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:mJbmKSuM8toC",
            "Publisher": "IEEE"
        },
        {
            "Title": "COMMENTS AND CORRECTIONS-Correction to\" Performance Characterization of a Closed-Loop Chaotic Communication System Including Fiber Transmission in Dispersion Shifted Filters\"",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=6727862700377369063&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:jKT558fuBk8C",
            "Publisher": "[New York: Institute of Electrical and Electronics Engineers, c1965-"
        },
        {
            "Title": "Numerical analysis of 50 Gbaud homodyne coherent receivers relying on line-coding and injection locking in lasers",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1068520015001261",
            "Abstract": "We present a numerical analysis of 50 Gbaud coherent detection enabled by injection locked lasers and line coding. The coherent receiver was tested with respect to an ideal receiver for two higher order modulation formats (16-QAM, QPSK) and under diverse operating regimes relating to the slave laser linewidth properties, the injection level and the frequency detuning between the incoming signal and the slave laser. The impact of the slave laser properties and line coding techniques on the receiver performance is highlighted showing that the technique could be used as a practical solution in order to enable low-cost and short reach n × 100 Gb/s Ethernet communication systems with the potential of flexibility in terms of the data rate.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:E8ajGqO0XoUC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Transmission induced limitations in optical communication systems with chaotic signals",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4801055/",
            "Abstract": "The transmission impairments induced by the optical medium in optical communication systems that employ chaotic carrier data encryption are discussed after theoretical consideration and experimental evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Encryption efficiency analysis of chaotic communication systems based on photonic integrated chaotic circuits",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5565358/",
            "Abstract": "A system-oriented analysis of the encryption efficiency of chaos communication systems consisting of lasers subject to all-optical feedback is presented in this paper. Two codification methods are considered, namely external baseband and subcarrier modulation. The robustness of each codification method to two attack scenarios, which are the filtering of the directly detected signal and the usage of an arbitrary receiver to synchronize and extract the message, is numerically evaluated through error counting. The results show that subcarrier modulation offers a much higher discrimination in bit error rate performance between the authorized receiver and the eavesdropper.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polarization-insensitive 2R-regenerator based on two-pump fiber optical parametric amplifier",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4771724/",
            "Abstract": "An all optical parametric 2R-regenerator is numerically investigated in terms of its polarization insensitivity. The proposed device is based on the use of a fiber optical parametric amplifier with two pumps at orthogonal polarization states.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing coherent optical wireless systems for high speed indoor telecom applications",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0030401815300961",
            "Abstract": "This paper focuses on several design issues of coherent optical wireless systems as a means of providing high data rate optical links in indoor environments enabling the realization of ultra-broadband wireless local area networks. We show how the performance specifications can be translated into signal-to-noise ratio requirements inside the coverage area, taking into account the laser phase noise mitigation scheme. We then discuss the power budget details using Gaussian beam optics incorporating the transceiver positioning and the optical systems used at the transmitter and receiver side. We also treat the influence of ambient light noise. We show that coherent optical wireless systems are characterized by excellent signal-to-noise performance enabling networking at very high data rates. Our results indicate that 2 Gb/s and 10 Gb/s data rates can be easily sustained at 3 m distances over a circular coverage …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:e3CVSTJ63dQC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Free space intra-datacenter interconnection utilizing 2D optical beam steering",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2018-Tu2I.7",
            "Abstract": "We evaluate the performance and benefits of novel integrated Free-Space-Optics (FSO) transceivers, supporting optical beam steering at low power consumption with ns steering speed. A proper intra-datacenter network architecture is also presented.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:-38epGy1wY0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Amplitude regeneration of phase encoded signals using injection locking in semiconductor lasers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5875674/",
            "Abstract": "A phase preserving limiter based on injection locking in semiconductor lasers is experimentally investigated for 10Gb/s phase encoded signals. The proposed scheme exhibits significant amplitude noise squeezing in conjunction with extreme simplicity.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient orthogonal modulation enabled by injection locked limiting amplifiers",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6461056/",
            "Abstract": "We propose and experimentally demonstrate a novel receiver architecture based on injection locking for demodulating a DPSK/ASK orthogonally modulated signal. The receiver exploits the limiting amplification of an injection locked laser to discriminate the two data streams, enhance the performance of DPSK, and increase the ASK extinction ratio up to 8 dB, making this modulation format suitable for the cost-efficient capacity upgrade of metro networks.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fabry-Perot Lasers as Enablers for Parallel Reservoir Computing",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9149642/",
            "Abstract": "We introduce the use of Fabry-Perot (FP) lasers as potential neuromorphic computing machines with parallel processing capabilities. With the use of optical injection between a master FP laser and a slave FP laser under feedback we demonstrate the potential for scaling up the processing power at longitudinal mode granularity and perform real-time processing for signal equalization in 25 Gbaud intensity modulation direct detection optical communication systems. We demonstrate the improvement of classification performance as the number of modes multiplies the number of virtual nodes and offers the capability of simultaneous processing of arbitrary data streams. Extensive numerical simulations show that up to 8 longitudinal modes in typical Fabry-Perot lasers can be leveraged to enhance classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:9tXw7Op4-u0C",
            "Publisher": "https://ieeexplore.ieee.org/document/9149642"
        },
        {
            "Title": "Full characterization of the signal and idler noise figure spectra in single-pumped fiber optical parametric amplifiers",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-18-3-2884",
            "Abstract": "For the first time, four different noise sources, which are amplified quantum noise, Raman phonon seeded excess noise, pump transferred noise (PTN), and pump residual noise, are considered simultaneously to model the wavelength-dependent noise figure in a single-pumped fiber optical parametric amplifier. An asymmetric signal NF spectrum induced by both Raman phonon seeded excess noise and Raman gain modified PTN is measured in the electrical domain. Theoretical results agree very well with the experimental data. The idler NF spectrum is also analyzed and measured, which shows a more symmetric profile.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Future directions to realise ultra-high bit-rate transmission systems",
            "Publication year": 2010,
            "Publication url": "https://research.aston.ac.uk/en/publications/future-directions-to-realise-ultra-high-bit-rate-transmission-sys",
            "Abstract": "In this paper we examine two potential future directions for the realization of ultra-high bit rate transmission systems.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical properties of silicon germanium waveguides at telecommunication wavelengths",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-21-14-16690",
            "Abstract": "We present a systematic experimental study of the linear and nonlinear optical properties of silicon-germanium (SiGe) waveguides, conducted on samples of varying cross-sectional dimensions and Ge concentrations. The evolution of the various optical properties for waveguide widths in the range 0.3 to 2 µm and Ge concentrations varying between 10 and 30% is considered. Finally, we comment on the comparative performance of the waveguides, when they are considered for nonlinear applications at telecommunications wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Coherent all-optical phase and amplitude regenerator of binary phase-encoded signals",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5782926/",
            "Abstract": "The performance of future ultralong-haul communication systems exploiting phase-encoded signals is likely to be compromised by nonlinear phase noise generated during signal transmission. One potential way to mitigate against nonlinear phase noise is to use phase-sensitive amplifiers (PSAs) that have been demonstrated to help remove such phase noise as well as to provide simultaneous signal amplitude noise suppression when operated in saturation. Recently, we have shown that a PSA-based signal regenerator based on degenerate four-wave mixing could be implemented in a network-compatible manner in which only the (noisy) signal is present at the device input (black-box operation). However, this scheme was tested only with relatively high-frequency deterministic perturbations applied to the signal. Here, we address both theoretically and experimentally the important issue of how such a …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical investigation of a 160-Gb/s reconfigurable photonic logic gate based on cross-phase modulation in fibers",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4116756/",
            "Abstract": "A simple reconfigurable all-optical logic gate based on cross-phase modulation in highly nonlinear fibers is numerically demonstrated. Fine performance at 160 Gb/s is obtained for five logic functions (xor, or, nand, nor and not). The implementation simplicity and the high-bit-rate operation make the proposed device suitable for ultrafast applications in the emerging all-optical networks",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "P-Torus: wavelength-based switching in packet granularity for intra-data-center networks",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-11-9-491",
            "Abstract": "In this work we introduce P-Torus, a wavelength switching architecture for intra-data-center networks that exploits optical-packet-based transport and is based on 2D torus interconnected clusters. P-Torus does not require optical buffers, as all buffering takes place at the end hosts. The proposed architecture combines torus connectivity richness, time-slotted operation, and efficient wavelength routing in order to provide single-hop, contentionless, and low-latency interconnection among all top-of-rack switches. Wavelength switching is performed in wavelength or waveband granularity with the use of fast wavelength-tunable transmitters, in compliance with the optimal solution of the routing and wavelength assignment problem of the generic torus topology. Numerical simulations are carried out to evaluate the latency and throughput performance of the proposed architecture. Results show that P-Torus exhibits low end …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:37Fl7vPTsUIC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Data transmissions at 1.98 µm in cm-long SiGe waveguides",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8024942/",
            "Abstract": "We demonstrate an error-free transmission of 10-Gbit/s optical signals along a SiGe waveguide at a wavelength of 1.98 μm. Bit error rate measurements confirm the absence of penalty during the transmission through a 2.5-cm long waveguide having a width of 2.2 μm.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:IvSMUa3B7yYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance and Complexity Analysis of Bi-Directional Recurrent Neural Network Models Versus Volterra Nonlinear Equalizers in Digital Coherent Systems",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9465676/",
            "Abstract": "We investigate the complexity and performance of recurrent neural network (RNN) models as post-processing units for the compensation of fibre nonlinearities in digital coherent systems carrying polarization multiplexed 16-QAM and 32-QAM signals. We evaluate three bi-directional RNN models, namely the bi-LSTM, bi-GRU and bi-Vanilla-RNN and show that all of them are promising nonlinearity compensators especially in dispersion unmanaged systems. Αs far as inference is concerned, οur simulations show that the three models provide similar compensation performance, therefore, in real-life systems, the simplest scheme based on Vanilla-RNN units should be preferred. We compare bi-Vanilla-RNN in its many-to-many form with Volterra nonlinear equalizers and exhibit its superiority both in terms of performance and complexity, thus highlighting that RNN processing is a very promising pathway for the …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:KqW5X_olkfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "First experimental demonstration of an all-optical chaos encrypted transmission system",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=5664630537782830878&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-speed all-optical pattern recognition of dispersive Fourier images through a photonic reservoir computing subsystem",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-40-14-3416",
            "Abstract": "In this Letter, we present and fully model a photonic scheme that allows the high-speed identification of images acquired through the dispersive Fourier technique. The proposed setup consists of a photonic reservoir-computing scheme that is based on the nonlinear response of randomly interconnected InGaAsP microring resonators. This approach allowed classification errors of 0.6%, whereas it alleviates the need for complex high-cost optoelectronic sampling and digital processing.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:uoRD4RTSUPoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Full Characterization of Noise Figure Spectrum in a Single Pumped Fiber Optical Parametric Amplifiers",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=582272287213313673&hl=en&oi=scholarr",
            "Abstract": "For the first time, an asymmetric NF spectrum induced by both Raman induced excess noise and Raman modified pump transferred noise of a fiber parametric amplifier has been measured. Experimental results agree well with theory.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:oH8HCDhqVGsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "40 Gb/s all-optical regeneration based on the pump depletion effect in fiber parametric amplification",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1068520007000387",
            "Abstract": "A novel all-optical regeneration scheme based on fiber-optic parametric amplification operating under the strong pump depletion regime is numerically demonstrated and investigated. It is shown that a high-power intensity modulated signal depletes the continuous wave pump in such a manner that the latter becomes intensity modulated and inverted compared to the signal. A cascade of two such devices that are working under strong pump-depletion has the potential to provide a noninverted, either wavelength converted or not, amplitude modulated output, which exhibits regenerative characteristics with respect to the input signal. In this work, an extended numerical analysis accompanied with theoretical support provides the power transfer characteristics and the phase analysis of the proposed regenerator under various operating conditions. Dynamic numerical simulations are also carried out in order to evaluate …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:5nxA0vEk-isC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Temporal resolution enhancement in quantum-dot laser neurons due to ground state quenching effects",
            "Publication year": 2020,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2020-M2K.1",
            "Abstract": "We present experimental results for an all-optical quantum-dot neuron, biased to a ground-state quenching regime alongside emission from the excited state. This regime, allows reduction of the temporal width of spikes down to 500 ps and enhanced firing rate.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:kvJssbFybhEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Subcarrier modulation boosts chaotic optical communication systems to error-free performance",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=NFOEC-2009-JWA45",
            "Abstract": "The subcarrier modulation technique is applied in an optical communication system based on chaos data encryption in order to exploit the spectral distribution of the chaotic carrier and provide error-free performance for Gb/s data.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Dynamic properties of a WDM switching module based on active microring resonators",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5373928/",
            "Abstract": "The switching properties of a resonator consisting of two serially cascaded active microrings (MRs) are reported. The switching is achieved through the variation of the refractive index and the losses of the MRs with current injection, which alters the overall output spectral response. The switch is suitable for optical burst switching systems and metro architectures as it provides fast optical switching in the nanosecond scale with contrast ratio higher than 30 dB for 10-Gb/s intensity modulated signals. The capacity of the switch can be remarkably increased if multiwavelength switching is employed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Various materials for 2-µm telecom applications",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03147579/",
            "Abstract": "Various materials for 2-µm telecom applications - Archive ouverte HAL Accéder directement au \ncontenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL \nMédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org \nRevues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les \nderniers dépôts Par type de publication Par discipline Par année de publication Par structure \nde recherche Les portails de l'archive Recherche Documentation hal-03147579, version 1 \nCommunication dans un congrès Various materials for 2-µm telecom applications Manon \nLamy Christophe Finot 1 Julien Fatome Jean Claude Weeber Bart Kuyken Gunther Roelkens \nM Brun Pierre Labeye S. Nicoletti A. Bogris D. Syvridis MA Ettabib DJ Richardson Periklis \nPetropoulos Kamal Hammani Détails 1 LICB - Laboratoire Interdisciplinaire Carnot de [Dijon…",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:6Zm5LS9gQ5UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "We4. P. 134 Comparison Analysis between the Noise Properties of Single-Pump and Dual-Pump Fibre Optical Parametric Amplifiers",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=17966316052283171686&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "London; Institution of Electrical Engineers; 1999"
        },
        {
            "Title": "An Optical Regenerator for Long Distance Stable Fiber Delivery of Radio Frequency Standards Based on Two Mode Injection Locked FP Lasers",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2015-CI_5_3",
            "Abstract": "High-precision distribution of frequency and time standards through a kilometer-scale network is demanded for several precision applications, such as atomic clock comparison and synchronization and long-baseline array synchronization of phase-coherent radio telescopes [1]. Optical fiber is the best long-distance medium for transferring microwave frequency standards. To achieve the required stability through the transmission link, the transmitted and the round-trip signal are compared and the phase error extracted is used to actively cancel out the phase jitter. For long distance frequency dissemination, regenerator nodes are required to provide acceptable SNR and high loop bandwidth, especially for cascaded optical links via the telecommunication network [2]. In this paper, we propose novel intermediate node and receiver architecture for the dual wavelength approach, based on the Two Mode Injection …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:GHsHDPAyICYC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Phase-encoded signal regeneration exploiting phase sensitive amplification",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ecoc-2011-Mo.1.A.3",
            "Abstract": "We discuss recent advances in phase-sensitive amplification technology and review its application to the regeneration of multi-level phase-encoded signals.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:GnPB-g6toBAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Highly Efficient Discrete Band Mid-Infrared to Near-Infrared Wavelength Conversion Relying on Si1− xGex Alloys",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=cleo_europe-2013-CD_P_33",
            "Abstract": "The use of group IV materials becomes particularly promising for the transmission and processing of optical signals lying at the mid-infrared (MIR) wavelength region which is ideal for sensing, absorption-spectroscopy and free-space communications. One optical function provided by Si-based nano-waveguides is the frequency translation between near-IR (NIR) and MIR regions exploiting the parametric amplification mechanisms [1].",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:urP0JZOBBUsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Intensity noise properties of midinfrared injection locked quantum cascade lasers: II. Experiments",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6945821/",
            "Abstract": "We present experimental investigations of the intensity noise properties of injection-locked midinfrared emitting quantum cascade lasers. Following the theoretical approach by Simos et al., the injection locking is realized below and near the threshold of the free running slave laser, resulting in an efficient technique to achieve low-noise operation. We find that below the threshold, the locking characteristics as locking range, shape and bandwidth, are different in comparison with those above threshold. In addition, we also investigate injection locking into longitudinal side modes of the slave laser apart by several longitudinal mode hops, and observe similar characteristics, however, with the potential to achieve higher relative intensity noise suppression. The measurements are confirmed by additional numerical simulations with a new model, which considers the multimode spectrum of the slave laser and the spectral …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:tgTmbKTkO1IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Device for non-linear signal conversion by four-wave mixing",
            "Publication year": 2016,
            "Publication url": "https://patents.google.com/patent/US9377668B2/en",
            "Abstract": "A device for non-linear conversion of first infrared signal into a second infrared signal with a wavelength that is less than that of the first infrared signal by means of four-wave mixing, which includes at least one portion of SiGe arranged on at least one first layer of material with a refractive index which is less than that of silicon, a germanium concentration in the portion of SiGe which varies continuously between a first value and a second value which is greater than the first value, in a direction which is approximately perpendicular to a face of the first layer on which the portion of SiGe is arranged, and in which a summital part of the portion of SiGe where the germanium concentration is equal to the second value is in contact with a gas and/or a material with a refractive index which is less than that of the silicon.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:nOiSByfp82kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RZ-DPSK signal regeneration based on dual-pump phase-sensitive amplification in fibers",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1705512/",
            "Abstract": "All-optical regeneration of differential phase-shift keying signals by means of a phase-sensitive amplification scheme solely based on highly efficient four-wave mixing in fibers is theoretically and numerically studied. The analytical and numerical investigation demonstrates almost ideal phase regeneration accompanied with enhanced amplitude noise suppression in the regime of pump depletion",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical chaotic communications by means of strong injection in open loop schemes",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474667015364491",
            "Abstract": "We report here on polarization dynamics in VCSELs subject to a time-delayed optical feedback from a short external cavity. We find the emergence of pulse packages exhibiting characteristics which originate from the interplay of time-delay induced dynamics and polarization mode competition. We provide detailed analysis of the polarization dynamics applying complementary cross-correlation and spectral analysis techniques. Our results emphasize the significance of polarization mode competition for PP dynamics in VCSELs, contrasting the observed behavior to that reported for edge emitters.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "First demonstration of all-optical QPSK signal regeneration in a novel multi-format phase sensitive amplifier",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5621403/",
            "Abstract": "We propose a novel black-box optical phase sensitive amplifier (PSA) configuration and describe its application to the regeneration of multi-level phase encoded signals. The concept is demonstrated with a 10 Gbaud quadrature phase shift keyed (QPSK) input.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance and complexity analysis of bi-directional recurrent neural network models vs. volterra nonlinear equalizers in digital coherent systems",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2103.03832",
            "Abstract": "We investigate the complexity and performance of recurrent neural network (RNN) models as post-processing units for the compensation of fibre nonlinearities in digital coherent systems carrying polarization multiplexed 16-QAM and 32-QAM signals. We evaluate three bi-directional RNN models, namely the bi-LSTM, bi-GRU and bi-Vanilla-RNN and show that all of them are promising nonlinearity compensators especially in dispersion unmanaged systems. Our simulations show that during inference the three models provide similar compensation performance, therefore in real-life systems the simplest scheme based on Vanilla-RNN units should be preferred. We compare bi-Vanilla-RNN with Volterra nonlinear equalizers and exhibit its superiority both in terms of performance and complexity, thus highlighting that RNN processing is a very promising pathway for the upgrade of long-haul optical communication systems utilizing coherent detection.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:QeguYG95ZbAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Message origin authentication and integrity protection in chaos-based optical communication",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5401124/",
            "Abstract": "In this paper, a message authentication and integrity protection scheme based on optically generated chaos is proposed. The introduced protocol relies physically on the dependence of chaos synchronization on the phase experienced by the delayed portion of the optical field inside the external cavity. The protocol's security is analytically evaluated, considering data modification and impersonation attack scenarios, and issues related to the practical implementation of the scheme are investigated.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "FWM-based wavelength conversion of 40 Gbaud PSK signals in a silicon germanium waveguide",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-21-14-16683",
            "Abstract": "We demonstrate four wave mixing (FWM) based wavelength conversion of 40 Gbaud differential phase shift keyed (DPSK) and quadrature phase shift keyed (QPSK) signals in a 2.5 cm long silicon germanium waveguide. For a 290 mW pump power, bit error ratio (BER) measurements show approximately a 2-dB power penalty in both cases of DPSK (measured at a BER of 10^−9) and QPSK (at a BER of 10^−3) signals that we examined.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:SP6oXDckpogC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Subcarrier modulation in all-optical chaotic communication systems",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-32-15-2134",
            "Abstract": "The enhancement of the encryption properties of chaotic signals generated by a semiconductor laser subject to optical feedback is numerically demonstrated by applying subcarrier modulation. The numerical analysis shows that the message can be very efficiently encrypted when the radio frequency carrier is within the frequency range where the chaos power density is maximized. Decoding performance is also numerically assessed considering both open- and closed-loop schemes at the receiver side. The impact of subcarrier modulation on system's performance under the influence of parameter mismatch is highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:Se3iqnhoufwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "QPSK phase and amplitude regeneration at 56 Gbaud in a novel idler-free non-degenerate phase sensitive amplifier",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2011-OMT4",
            "Abstract": "We introduce a novel input-idler-free non-degenerate phase sensitive amplifier (PSA) configuration and use it for simultaneous phase and amplitude regeneration of quadrature phase shift keyed (QPSK) signals demonstrated at symbol rates up to 56 Gbaud.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Low-Noise Operation of Mid-Infrared Quantum Cascade Lasers Using Injection Locking",
            "Publication year": 2017,
            "Publication url": "https://www.intechopen.com/books/quantum-cascade-lasers/low-noise-operation-of-mid-infrared-quantum-cascade-lasers-using-injection-locking",
            "Abstract": "Quantum cascade lasers are the most promising optical source for emission in the mid-infrared and THz region, and they are already used in a large number of applications such as free-space communications, absorption spectroscopy, sensing and so on. In all these applications, the noise properties of the optical sources are critical for the system performance. In this work, the authors present a theoretical study on the intensity noise characteristics of quantum cascade lasers (QCLs) under external non-coherent optical injection. The injection locking has been proven in the past beneficial for noise properties of bipolar lasers, and thus this technique is utilized here in quantum cascade lasers. With the help of various analytical and numerical models, it is shown that intensity noise reduction can be achieved in the operation of the so-called locked slave laser compared to its free-running values. The detailed analysis reveals the contribution of the various noise sources to the intensity noise of the laser and how they affect the injection locking process. Using different numerical models, two distinct schemes are investigated, analysed and discussed, injection on the lasing mode or on non-lasing residual modes of the slave laser cavity.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:yCjxvIMm6_oC",
            "Publisher": "IntechOpen"
        },
        {
            "Title": "Low Noise Optical Buffering Based on Non-degenerate Phase Sensitive Parametric Amplification",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_Europe-2019-ci_p_16",
            "Abstract": "Optical buffers are devices which can store optical signals for a period of time and could be valuable tools for applications such as optical storage, optical packet switching and all-optical signal processing providing the storage functionality in the optical domain, thus avoiding unwanted opto-electronic and eletro-optical conversions. During the last twenty years, there have been proposed many approaches for the implementation of optical buffers. The most straightforward scheme is the use of a fiber spool playing the role of a long-time optical delay line which requires either direct or indirect amplitude modulation to maintain the bit timing [1]. Other interesting techniques referring to optical buffering are slow-light [2], temporal solitons in optical cavities [3], excitability properties of optical devices [4] and photonic crystal nanocavities [5].",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:5F1dSjz1ScoC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Noise properties of degenerate dual pump phase sensitive amplifiers",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-28-8-1209",
            "Abstract": "The noise properties of phase sensitive amplifiers based on degenerate                         four-wave mixing in optical fibers are studied taking into account the                         quantum noise amplification, the amplitude and phase noise properties of the                         pump sources. An analytical tool is presented for the direct calculation of                         the amplifier noise figure also verified by extensive numerical simulations.                         The signal power dependence of noise figure is both analytically and                         numerically accented. The need for high speed and precise phase locking is                         also revealed in order to diminish the effect of phase noise on the noise                         properties of the amplifier.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical signal reshaping by four-wave mixing in passive microring resonators",
            "Publication year": 2004,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5451/0000/All-optical-signal-reshaping-by-four-wave-mixing-in-passive/10.1117/12.545691.short",
            "Abstract": "A novel approach for realization of all-optical pulse reshaping in an integrated microring resonator is proposed. The concept presented in this study is based on four-wave mixing in a passive GaAs/AlGaAs microring resonator side coupled to a bus waveguide, taking into account all higher order non-linear effects such as self-phase modulation (SPM), cross-phase modulation (XPM), pump depletion and two-photon absorption (TPA), the latter being the dominant process here. We also include in the description changes in absorption and refractive indexes induced by free-carriers generated by TPA. This scheme is investigated for its regenerative characteristics using an optical pump modulation scheme. The application of the modulation bit stream in the pump wave leads in a conjugate wave power being proportional to the square of the pump power, resulting in a corresponding extinction ratio improvement …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:4TOpqqG69KYC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Complexity and synchronization in chaotic fiber-optic systems",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016727890700351X",
            "Abstract": "In this work we investigate experimentally the complexity of chaotic attractors generated by a semiconductor laser subjected to optical feedback and associate their dimensionality with the synchronization efficiency of the corresponding chaotic transmitter–receiver configuration. The complexity is characterized by calculating the correlation dimension D 2 of experimental chaotic time series for different values of the optical feedback η. We present the effect of D 2 on the synchronization efficiency and determine the optimal operating condition that leads to the most complex chaotic carrier and, simultaneously, to the most successful synchronization. Lastly, we associate and explain our experimental results with theoretical predictions in the research literature.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Record phase sensitive extinction ratio in a silicon germanium waveguide",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7184015/",
            "Abstract": "A binary step-like phase response and phase-sensitive extinction ratio in excess of 28dB under CW pump operation was demonstrated in a 20mm-long low birefringence SiGe waveguide, using a polarization-assisted phase sensitive amplifier scheme.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:5rMqqAh47xYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Influence of the decoding process on the performance of chaos encrypted optical communication systems",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-24-1-335",
            "Abstract": "Two different decoding methods of an all-optical chaotic communication system are investigated when chaotic modulation (CM) encoding format is employed. The transmitter consists of an external cavity semiconductor laser generating, thus, a chaotic carrier, modulated using an external modulator. The receiver is either a solitary semiconductor laser diode identical to that of the transmitter or a laser diode coupled to an external cavity, forming an open-or a closed-loop configuration, respectively. The performance of the system is then evaluated by means of calculating the Q-factor extracted by the eye diagram of the recovered data when two different approaches of the decoding process for the receiver are adopted. The first decoding method relies on the widely proposed, normalized to the receiver's amplitude output, difference of the two lasers' optical amplitude outputs, while the second one corresponds to a more …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards nonlinear conversion from mid-to near-infrared wavelengths using Silicon Germanium waveguides",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-22-8-9667",
            "Abstract": "We demonstrate the design, fabrication and characterization of a highly nonlinear graded-index SiGe waveguide for the conversion of mid-infrared signals to the near-infrared. Using phase-matched four-wave mixing, we report the conversion of a signal at 2.65 µm to 1.77 µm using a pump at 2.12 µm.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:ZysSsiWj_g4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Resonate and Fire Neuromorphic Node based on two-section Quantum Dot Laser with multi-waveband dynamics",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9333335/",
            "Abstract": "We present the experimental results regarding an excitable, two – section quantum dot laser exhibiting resonate and fire dynamics. Moreover, we explore the beneficial role of quantum dot assisted multi – waveband emission in enhancing the firing rate and the temporal resolution of photonic neuromorphic processors.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:koF6b02d8EEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reservoir Computing based on Mutually Injected Phase Modulated Lasers: A monolithic integration approach suitable for short-reach communication systems",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2021-W6A.4",
            "Abstract": "We propose a reservoir computing system consisting of two mutually coupled phase modulated lasers. The scheme can be monolithic integrated and extends the reach of 25Gbaud PAM-4 signals up to 55 km in the C-band.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:ovGv7akYl-cC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Towards One-Way Fibre-Based Frequency Dissemination Enabled by Phase Sensitive Amplification Receivers",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8535335/",
            "Abstract": "We demonstrate the potential of a phase sensitive amplifier to operate as an active detector of stochastic phase changes in fibre-based dissemination systems with an order of magnitude better sensitivity than state of the art one-way systems.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:jRIwE-1ttnoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantum Dot Photodetectors Design Consideration and Demonstration of Resonant-Cavity-Enhanced Quantum Dot Infrared Photo Detectors in Mid-Infrared Wavelength Regime (3–5µm)....................... T. Asano, C. Hu, Y. Zhang, M. Liu, JC Campbell, and A. Madhukar 1484 Avalanche Photodiodes Analysis of Single-Photon-Detection Characteristics of GaInAs/InP Avalanche Photodiodes...................................",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5586672/",
            "Abstract": "Design Consideration and Demonstration of Resonant-Cavity-Enhanced Quantum Dot Infrared Photo Detectors in Mid-Infrared",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "2015 Index IEEE Journal of Quantum Electronics Vol. 51",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7390338/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the co-authors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:Ul_CLA4dPeMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling and measurement of the noise figure of a cascaded non-degenerate phase-sensitive parametric amplifier",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-18-14-14820",
            "Abstract": "Semi-classical noise characteristics are derived for the cascade of a non-degenerate phase-insensitive (PI) and a phase-sensitive (PS) fiber optical parametric amplifier (FOPA). The analysis is proved to be consistent with the quantum theory under the large-photon number assumption. Based on this, we show that the noise figure (NF) of the PS-FOPA at the second stage can be obtained via relative-intensity-noise (RIN) subtraction method after averaging the signal and idler NFs. Negative signal and idler NFs are measured, and <2 dB NF at >16 dB PS gain is estimated when considering the combined signal and idler input, which is believed to be the lowest measured NF of a non-degenerate PS amplifier to this date. The limitation of the RIN subtraction method attributed to pump transferred noise and Raman phonon induced noise is also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:UebtZRa9Y70C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Novel 60 GHz CPW array antennas with beam-forming features for indoor wireless over fiber networks",
            "Publication year": 2013,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8645/86450H/Novel-60-GHz-CPW-array-antennas-with-beam-forming-features/10.1117/12.2000414.short",
            "Abstract": "In this study two types of coplanar waveguide (CPW) array antennas are designed and analyzed for use in a 60GHz Radio over Fiber indoor network. The first one is based on high permittivity Rogers 6010 and Indium Phosphide (InP) substrates incorporating slots as radiating elements. The second one utilizes stacked geometry based on the above substrates. Both arrays present more 1 GHz bandwidth and 10dBi gain. Furthermore they can provide beam-forming operation by properly adjusting the signal’s amplitude and phase. A Least Mean Square (LMS) algorithm is generated for this purpose and the radiation pattern is steered accordingly. At last, a photodiode is simulated using equivalent circuit and is adopted with the proposed arrays, and an optical beam forming scenario is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:abG-DnoFyZgC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Th3. 1.2 Field Demonstrator of a Chaos Encrypted Optical Transmission System",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=6484238114935339775&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:RYcK_YlVTxYC",
            "Publisher": "London; Institution of Electrical Engineers; 1999"
        },
        {
            "Title": "BER estimation of a long-haul transmission system with phase-sensitive amplifiers",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4771722/",
            "Abstract": "The impact of phase-sensitive amplification on the BER performance of a phase-modulated link is semi-analytically estimated revealing its effectiveness in handling nonlinear phase noise.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical injection in semiconductor lasers: Physics and applications",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7550304/",
            "Abstract": "This paper presents a comprehensive overview of the underlying physics of optical injection mechanisms in lasers highlighting the determining influence of important parameters as the injection strength, the frequency detuning and the free running oscillation frequency of the interacting lasers. The paper particularly sheds light on the different properties exhibited by inter-band diode lasers and intersubband quantum cascade lasers under external injection. Finally, the paper presents experimental results which demonstrate the utilization of optical injection in telecom, metrology and mid-infrared gas sensing applications leveraging its optical signal processing capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:x2hKVfJWtf0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Phase regeneration of optical signals",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5953712/",
            "Abstract": "We present recent advances in phase-sensitive amplification technology and its application to the regeneration of phase-encoded signals. Using a combination of parametric effects in fibers and optical injection locking of lasers, it is possible to observe phase regeneration in signals with multiple levels of phase encoding.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical phase and amplitude regeneration properties of a 40Gbit/s DPSK black-box phase sensitive amplifier",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5621331/",
            "Abstract": "We experimentally study the pure amplitude and phase regeneration capabilities of a black-box degenerate four wave mixing (FWM) based bit-rate-flexible phase sensitive amplifier (PSA) for a 40 Gbit/s differential phase-shift keyed (DPSK) signal.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Amplitude noise limiting amplifier for phase encoded signals using injection locking in semiconductor lasers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6097001/",
            "Abstract": "In this study, a phase-preserving limiter based on injection locking a semiconductor laser is fully investigated as an amplitude limiter for 10 Gb/s constant envelope phase encoded signals. A theoretical analysis on the modulation bandwidth and the modulation transfer function of the injection locked laser is carried out targeting to identify the operational characteristics and the regeneration properties of the proposed amplitude limiter. The theoretical analysis demonstrates the potential of the specific limiter to amplify 25 Gbaud phase modulated signals with simultaneous regeneration of its amplitude properties. Subsequently an experimental investigation demonstrates the performance of the proposed regenerator and addresses its potential exploitation in future optical networks. The specific limiter exhibits significant amplitude noise squeezing capability and extreme implementation simplicity.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Noise characteristics of dual-pump fiber-optic parametric amplifiers",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-23-9-2788",
            "Abstract": "The noise figure (NF) properties of an undepleted and lossless dual-pump fiber-optic parametric amplifier (FOPA) are theoretically and numerically investigated. The theoretical study takes into account the noise characteristics of the two pump waves that are considered to have parallel polarization states for gain maximization. It is shown that noisy pump waves degrade the amplifier's NF, especially when the amplifier is operating at high gain values and when the input signal is high. The theoretical observations are validated by Monte Carlo numerical simulations, and the agreement between them is excellent. Finally, a comparative study concerning the noise characteristics of dual-pump and single-pump FOPAs is performed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatial Photonic Reservoir Computing based on Non-Linear Phase-to-Amplitude Conversion in Micro-Ring Resonators",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2101.04487",
            "Abstract": "We present a photonic reservoir computing, relying on a non-linear phase-to-amplitude mapping process, able to classify in real-time multi-Gbaud time traces subject to transmission effects. This approach delivers an all-optical, low-power neuromorphic dispersion compensator.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:I2jIoRS3jIgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancement of the encryption efficiency of chaotic communications based on all-optical feedback chaos generation by means of subcarrier modulation",
            "Publication year": 2007,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=iqec-2007-JSI3_1",
            "Abstract": "A crucial issue in chaotic communications is the provided security that is mainly related to the degree of complexity of the chaotic carrier, since it is known that high-dimensional chaos may prohibit the interception of the message in contrast to low-dimensional attractors [1]. The degree of complexity of a chaotic signal can be assessed by means of the Lyapunov exponents from which the Kaplan-Yorke dimension (d KY), and the Kolmogorov-Sinai entropy are calculated [2]. In this paper, the encryption efficiency of the chaotic carrier, which is defined as the signal-to-noise ratio (SNR) of the encrypted message after filtering the combined signal of chaos and signal, is considered as the basic measure of the offered security. Hence, the lower the SNR of the filtered signal is, the higher the encryption efficiency of the system that is achieved. For the numerical calculations of this work we have considered a typical …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:8k81kl-MbHgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Intensity noise properties of mid-infrared injection locked quantum cascade lasers: I. Modeling",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6690160/",
            "Abstract": "In this paper, we numerically investigate the effect of optical injection locking on the noise properties of mid-infrared quantum cascade lasers. The analysis is carried out by means of a rate equation model, which takes into account the various noise contributions and the injection of the master laser. The obtained results indicate that the locked slave laser may operate under reduced intensity noise levels compared with the free running operation. In addition, optimization of the locking process leads to further suppression of the intensity noise when the slave laser is biased close to the free-running threshold current. The main factors that significantly affect the locking process and the achievable noise levels are the injected optical power and the master-slave frequency detuning.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:XtJa11BXPS4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Free space intra-datacenter interconnects based on 2D optical beam steering enabled by photonic integrated circuits",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/322318",
            "Abstract": "Data centers are continuously growing in scale and can contain more than one million servers spreading across thousands of racks; requiring a large-scale switching network to provide broadband and reconfigurable interconnections of low latency. Traditional data center network architectures, through the use of electrical packet switches in a multi-tier topology, has fundamental weaknesses such as oversubscription and cabling complexity. Wireless intra-data center interconnection solutions have been proposed to deal with the cabling problem and can simultaneously address the over-provisioning problem by offering efficient topology re-configurability. In this work we introduce a novel free space optical interconnect solution for intra-data center networks that utilizes 2D optical beam steering for the transmitter, and high bandwidth wide-area photodiode arrays for the receiver. This new breed of free space optical interconnects can be developed on a photonic integrated circuit; offering ns switching at sub-μW consumption. The proposed interconnects together with a networking architecture that is suitable for utilizing those devices could support next generation intra-data center networks, fulfilling the requirements of seamless operation, high connectivity, and agility in terms of the reconfiguration time. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:KIRwYnRZzWQC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Performance comparison of different dispersion management techniques in an all-optical closed-loop chaotic transmission system",
            "Publication year": 2004,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5452/0000/Performance-comparison-of-different-dispersion-management-techniques-in-an-all/10.1117/12.545728.short",
            "Abstract": "The performance of an all-optical closed-loop chaotic communication system in a transmission link consisting of single mode fibers (SMF) applying two different dispersion management techniques is numerically studied. The first technique is implemented by the usage of dispersion compensating fibers (DCFs), while the second utilizes optical phase conjugators (OPCs). The latter is implemented by means of four wave mixing (FWM) in a dispersion shifted fiber (DSF), where the chaotic carrier corresponds to the signal wave and a high power continuous wave corresponds to the pump wave. Calculation of the recovered message Q-factor values obtained from the corresponding eye diagrams has been carried out applying chaotic modulation (CM) and chaos shift keying (CSK) encryption techniques for two repetition rates (2.4Gbps, 5Gbps). It is shown that the optical phase conjugation is an effective dispersion and …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:SeFeTyx0c_EC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Artificial neuron based on integrated semiconductor quantum dot mode-locked lasers",
            "Publication year": 2016,
            "Publication url": "https://www.nature.com/articles/srep39317",
            "Abstract": "Neuro-inspired implementations have attracted strong interest as a power efficient and robust alternative to the digital model of computation with a broad range of applications. Especially, neuro-mimetic systems able to produce and process spike-encoding schemes can offer merits like high noise-resiliency and increased computational efficiency. Towards this direction, integrated photonics can be an auspicious platform due to its multi-GHz bandwidth, its high wall-plug efficiency and the strong similarity of its dynamics under excitation with biological spiking neurons. Here, we propose an integrated all-optical neuron based on an InAs/InGaAs semiconductor quantum-dot passively mode-locked laser. The multi-band emission capabilities of these lasers allows, through waveband switching, the emulation of the excitation and inhibition modes of operation. Frequency-response effects, similar to biological neural …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:vofGIMt6cyEC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Impact of dispersion fluctuations on the noise properties of fiber optic parametric amplifiers",
            "Publication year": 2006,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-24-5-2171",
            "Abstract": "The effects of zero-dispersion wavelength (ZDWL) fluctuations on the noise characteristics of fiber optical parametric amplifiers (FOPAs) are investigated. The numerical derivation of the noise figure (NF) in terms of the amplifier operating conditions and the magnitude of ZDWL fluctuations is achieved by utilizing a simulation method based on the three-coupled propagation equations. The numerical analysis shows that the average NF of FOPAs is increased compared with the case of uniform dispersion, especially at high-gain operation. Apart from the NF, the gain-to-NF ratio is also evaluated to assess the amplifier performance for a variety of amplifier operating conditions and dispersion profiles.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical regeneration based on phase-sensitive nondegenerate four-wave mixing in optical fibers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5607290/",
            "Abstract": "An optical regeneration scheme based on nondegenerate phase-sensitive amplification in highly nonlinear fibers is numerically investigated. The proposed regenerator exhibits significant amplitude and phase noise suppression properties and eliminates the need for precise phase and frequency locking with the input return-to-zero differential phase-shift keying signal.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Unsupervised Image Classification Through Time-Multiplexed Photonic Multi-Layer Spiking Convolutional Neural Network",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9333320/",
            "Abstract": "We present results of a deep photonic spiking convolutional neural network, based on two-section VCSELs, targeting image classification. Training is based on unsupervised spike-timing dependent plasticity, whereas neuron time-multiplexing and ultra-fast response are exploited towards a a reduction of the physical neuron count by 90%.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:jq04SsiGh3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reservoir Computing based on Mutually Injected Phase Modulated Semiconductor Lasers as a monolithic integrated hardware accelerator",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.11972",
            "Abstract": "In this paper we propose and numerically study a neuromorphic computing scheme that applies delay-based reservoir computing in a laser system consisting of two mutually coupled phase modulated lasers. The scheme can be monolithic integrated in a straightforward manner and alleviates the need for external optical injection, as the data can be directly applied on the on-chip phase modulator placed between the two lasers. The scheme also offers the benefit of increasing the nodes compared to a reservoir computing system using either one laser under feedback or laser under feedback and optical injection. Numerical simulations assess the performance of the integrated reservoir computing system in dispersion compensation tasks in short-reach optical communication systems. We numerically demonstrate that the proposed platform can recover severely distorted 25 Gbaud PAM-4 signals for transmission distances exceeding 50km and outperform other competing delay-based reservoir computing systems relying on optical feedback. The proposed scheme, thanks to its compactness and simplicity, can play the role of a monolithic integrated hardware accelerator in a wide range of application requiring high speed real time processing.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:qCaWouos7ogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optical sources for chaos based communications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4771688/",
            "Abstract": "Two new types of integrated broadband optical sources generating a wide range of nonlinear dynamics are presented. The new sources are compact potential emitters for high-speed optical communication systems employing chaos data encryption.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PSA-based phase regeneration of DPSK signals in a silicon germanium waveguide",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7342011/",
            "Abstract": "We demonstrate a polarization-assisted PSA-based phase regenerator in a passive low-birefringence SiGe waveguide at low CW pump power. A PSER of 28.6-dB enables a six-fold reduction in phase-error and BER improvement of approximately 2-dB in the regenerated signal.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:KqnX2w3egDsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation on a microring laser coupled with phase-section bus waveguide as a tunable transmitter for application in future optical/wireless hybrid networks",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1569441010001008",
            "Abstract": "In this paper, semiconductor microring lasers with integrated phase sections in the bus waveguide are numerically evaluated, using a dynamic multimode laser model, and investigated as low-cost, integrated, potential tunable directly modulated transmitters for future hybrid optical–wireless networks. The effect of optical feedback through bus waveguide is revealed as a promising mechanism for improving nonlinear distortion. Additionally, tunability is achieved with the aid of phase-tuning. The underlying laser dynamics beyond this behavior are analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:rO6llkc54NcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hurst exponents and cyclic scenarios in a photonic integrated circuit",
            "Publication year": 2008,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.78.066215",
            "Abstract": "We experimentally report the cyclic scenario of birth and annihilation of periodic orbits in a photonic integrated circuit as the feedback phase of the electric field varies. The latter is also shown to result in minimal alterations in the statistical properties of the chaotic attractor, with simultaneously transiting the Hurst exponent H, erratically, below and above the critical value of H= 0.5 that indicates regular Brownian motion. Consequently there is an indication of the most effective operating regions with minimized predictability, which hinders eavesdropping and the progress of forecasting the development of the chaotic light carrier.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Demonstration of high speed optical transmission at 2 µm in various material based waveguides",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02054733/",
            "Abstract": "Archive ouverte HAL - Demonstration of high speed optical transmission at 2 µm in various \nmaterial based waveguides Accéder directement au contenu Accéder directement à la \nnavigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails \nAURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation \nSciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de \npublication Par discipline Par année de publication Par structure de recherche Les portails de \nl'archive Recherche Documentation hal-02054733, version 1 Communication dans un congrès \nDemonstration of high speed optical transmission at 2 µm in various material based waveguides \nManon Lamy 1 Christophe Finot 1 Julien Fatome 1 Juan Arocas 1 Jean-Claude Weeber 1 Bart \nKuyken 2 G. Roelkens M. Brun P. Labeye 3 S. Nicoletti 3 A. Bogris D. Syvridis 4 MA Ettabib ['…",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:U3qCfcK-7lkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrated devices for optical chaos generation and communication applications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5291953/",
            "Abstract": "Two different configurations of compact optical chaos generators, based either on fiber or monolithic photonic integration, have been designed, fabricated, and experimentally characterized in terms of their potential to generate a broadband chaotic optical spectrum. The architectures considered have the potential to offer various types of dynamics depending on the design and operational conditions-from periodic states to complex chaos. Their application in an optical chaos communication scheme is also studied, through the capability of such complex carriers to synchronize with the appropriate receiver and regenerate the carrier locally. Numerical simulations confirm the behavior of these emitters in terms of chaos generation and identify the preferable operating conditions and limitations for the optimum performance.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical demultiplexing of 16-QAM signals into QPSK tributaries using four-level optical phase quantizers",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-39-7-1775",
            "Abstract": "The potential of four-level optical phase quantizers toward coherent processing of advanced modulation formats, such as 16-QAM, is proposed and numerically demonstrated. The work shows that phase quantization achieved in fiber-based phase-sensitive amplifiers can demultiplex 16-QAM into two quadrature phase shift keying (QPSK) signals, enabling subchannel switching. The numerical study highlights the impact of the quantizer transfer function on the performance of the demultiplexing process and numerically calculates the bit error rate for each QPSK tributary after the demultiplexing procedure.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:xii_ZKWM4-0C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Investigation of a 2R all-optical regenerator based on four-wave mixing in a semiconductor optical amplifier",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-22-2-595",
            "Abstract": "The properties of an all-optical 2R regenerator based on four-wave mixing (FWM) in a semiconductor optical amplifier (SOA) are investigated. The regeneration is based on the nonlinear FWM transfer function and a study of the system's static behavior reveals the operating conditions, under which the transfer function approaches most the ideal, step-like discrimination characteristic function. A fiber Bragg grating (FBG) is employed in order to overcome the SOAs speed limitations due to limited carrier dynamics. The simulations with dynamic input data by means of extinction ratio (ER) and Q-factor calculations, showed satisfactory regenerative behavior up to 40 Gb/s.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Field-trial of an all-optical PSK regenerator/multicaster in a 40 Gbit/s, 38 channel DWDM transmission experiment",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6064857/",
            "Abstract": "The performance of future ultra-long haul communication systems exploiting phase-encoded signals is likely to be compromised by noise generated during signal transmission. One potential way to mitigate such noise is to use Phase Sensitive Amplifiers (PSAs) which have been demonstrated to help remove phase as well as amplitude noise from phase-encoded signals. Recently, we showed that a PSA-based signal regenerator based on degenerate four-wave mixing can be implemented in a network-compatible manner in which only the (noisy) signal is present at the device input (black-box operation). The developed regenerator was also able to perform simultaneous wavelength conversion and multicasting, details/analysis of which are presented herein. However, this scheme was tested only with artificial noise generated in the laboratory and with the regenerator placed in front of the receiver, rather than in …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transmission effects in wavelength division multiplexed chaotic optical communication systems",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-28-21-3107",
            "Abstract": "In this study we present the influence imposed by the coexistence of                         wavelength division multiplexed (WDM) channels on a chaotic optical                         communication system tested in an installed network environment. Both                         conventional carriers that carry 10 Gb/s data sequences and chaotic carriers                         used for data-encrypted channel transmission have been considered in a dense                         WDM configuration. Inter-channel interference, channel polarization and                         cross-phase modulation are some dominant phenomena identified to affect the                         synchronization process of well-match chaotic optical oscillators. The                         efficiency of data recovery of the conventional and chaos encrypted channels                         is analyzed. 1.25 Gb/s data sequences, that are completely hidden propagate                         along the transmission link, are finally …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectral synchronization in chaotic optical communication systems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1432981/",
            "Abstract": "The ability of chaotic carriers to synchronize in optical chaotic communication systems is studied experimentally under a spectral domain analysis. Synchronization of high-frequency components up to tens of gigahertz of the chaotic carriers can thus be evaluated. On the contrary, the traditional method of measuring the synchronization through chaotic carrier time-traces is constrained by the limited bandwidth of the real-time oscilloscopes used for such measurements, excluding the contribution of the high-frequency components of the chaotic carriers to the synchronization characterization of the system.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Noise figure measurements in phase-insensitive and phase-sensitive fiber parametric amplifier cascade",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2010-OWT4",
            "Abstract": "By cascading two non-degenerate inline fiber-optic parametric amplifiers, we observe NF~ 2dB (beating phase-insensitive quantum limit) at 16-dB gain for the second (phase-sensitive) stage after subtracting the excess noise from the first (phase-insensitive) stage.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Spectrally efficient and high extinction ratio DPSK/ASK orthogonal modulation schemes based on injection locking limiting amplifiers",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6706002/",
            "Abstract": "We experimentally demonstrate a novel receiver architecture based on injection locking for demodulating DPSK/ASK modulated signal with ASK extinction ratio exceeding 8 dB. The receiver exploits the limiting amplification of injection locking and enhances the performance of the DPSK stream.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Coherent optical wireless: realizing fiber-like connections out of thin air",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2802005",
            "Abstract": "In this paper, coherent optical wireless (COWs) technology is proposed for indoor high data rate communication applications. We discuss several design issues and the architecture of the optical wireless coherent transceiver. We also present an initial system demonstrator along with some initial performance results.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:_IsBomjs8bsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "P-torus: Torus-based optical packet switching architecture for intra-data centre networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8751276/",
            "Abstract": "We introduce an intra-Data Centre, WDM-based, optical packet switching architecture. P-Torus demonstrates low energy footprint, CapEx/OpEx and low end-to-end latency relying on the combination of passive switching schemes and Torus architectures that enable single-hop interconnects for 256 ToR switches.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:g30IDTdgJMgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel Mid-infrared Gas Sensor Based on Mutually Coupled Quantum Cascade Lasers",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=AIO-2016-JT3A.6",
            "Abstract": "We demonstrate a gas sensor utilizing two mutually coupled Quantum Cascade lasers. Experiments show a six time improvement in the sensitivity with respect to a common Laser Absorption Spectroscopy setup.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:za7pDTvVV8kC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Analysis of the optical amplifier noise effect on electrooptically generated hyperchaos",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4252267/",
            "Abstract": "A theoretical analysis regarding the determination of the optical amplifier noise effect on the performance of optical chaos communications using semiconductor lasers with electrooptical feedback is carried out. Analytical expressions for the synchronization error and the signal-to-noise ratio of the extracted message are obtained and verified by extensive numerical simulations. Fiber transmission simulations are also carried out to identify under which circumstances the amplifier noise effect is the dominant impairment.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-time and ultrafast optical pulse quantization based on slicing the supercontinuum",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=col-19-8-081901",
            "Abstract": "All-optical analog-to-digital conversion is a paramount issue in modern science. How to implement real-time and ultrafast quantization to optical pulses with different intensities in an all-optical domain is a central problem. Here, we report a real-time demonstration of an all-optical quantization scheme based on slicing the supercontinuum in a nonlinear fiber. In comparison with previous schemes through off-line analysis of the power of different optical spectral components in the supercontinuum, this, to the best of our knowledge, is the first demonstration of such functionality online in the time domain. Moreover, the extinction ratio among the quantized outputs can exceed 10 dB, which further confirms the feasibility of the proposed quantization scheme. The current 3 bit resolution in the proof-of-principle experiment is limited by the current experimental condition, but it can be expected to be greatly enhanced through …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:5bfplxN71z4C",
            "Publisher": "Chinese Optical Society"
        },
        {
            "Title": "All-optical signal processing for 16-QAM using four-level optical phase quantizers based on phase sensitive amplifiers",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6647633/",
            "Abstract": "The potential of four-level optical phase quantizers towards coherent processing of advanced modulation formats such as 16-QAM is proposed and numerically demonstrated. The work shows that phase quantization can demultiplex 16-QAM into two QPSK signals enabling sub-channel switching and optical regeneration of 16-QAM modulation formats.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:u9iWguZQMMsC",
            "Publisher": "IET"
        },
        {
            "Title": "Performance comparison of different receiver configurations in an all-optical chaotic transmission system",
            "Publication year": 2004,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5452/0000/Performance-comparison-of-different-receiver-configurations-in-an-all-optical/10.1117/12.545697.short",
            "Abstract": "A detailed investigation of the decoding properties of different receiver configurations in an all-optical chaotic transmission system is presented for two data-encoding techniques and for various dispersion compensation maps. A semiconductor laser subjected to optical feedback generates the chaotic carrier while data is encoded either by Chaotic Modulation (CM) or Chaotic Shift Keying (CSK) methods. The complete transmission module consists of various dispersion management maps, in-line amplifiers and Gaussian optical filters. The receiver, employing a high facet reflectivity laser, is either forming a closed-loop configuration operating at the non-amplification regime or a strongly injected open-loop one. For the latter configuration the possibility of utilizing an anti-reflection (AR) coated laser is also investigated. System's performance is numerically tested by calculating the Q-factor of the eye diagram of the 1 Gb …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:RGFaLdJalmkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Observation of flat chaos generation using an optical feedback multi-mode laser with a band-pass filter",
            "Publication year": 2019,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-27-13-17859",
            "Abstract": "We demonstrate experimentally that flat and broadband chaotic signals can be easily generated by combining a multi-mode laser diode subject to optical feedback with a band-pass filter. Measurements are made of the RF spectra of multi-mode and single-mode outputs from an external cavity Fabry-Perot (FP) semiconductor laser before and after the filtering procedure. In this way it is found that in the chaos regime the low-frequency energy of the single-mode output is enhanced by about 25 dB comparing with that of the multi-mode output. Moreover, the associated 3-dB chaos bandwidth can reach around 6 GHz for the single mode case. Numerical demonstrations show mode competition is the physical origin of the low-frequency enhancement in the single-mode chaotic outputs.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:o-PowTg_VKEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A Novel Monolithic Integrated Optical Chaos Emitter: Experiment, Data Analysis and Numerical Predictions",
            "Publication year": 2009,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789814271349_0008",
            "Abstract": "A novel photonic integrated device has been designed and evaluated as a transmitter for chaos applications in optical communications. The device consists of a semiconductor laser integrated with a semiconductor optical amplifier, a phase section and a waveguide, forming thus an integrated external cavity laser with adjustable optical feedback and phase. Under diverse operating parameters the device behaves in different modes, from stable operation to limit cycles and hyperchaotic broadband behavior. Chaos data analysis from experimental data is performed in order to quantify the complexity of the experimental reconstructed attractors under the influence of noise. Calculation of the correlation dimension and Kolmogorov entropy are compared with numerical predictions from well-known theoretical models.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "All-optical phase regeneration with record PSA extinction ratio in a low-birefringence silicon germanium waveguide",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-34-17-3993",
            "Abstract": "We report a low-power continuous wave-pumped phase sensitive amplifier (PSA)-based phase regenerator implemented in a passive silicon-based waveguide. A polarization assisted-PSA, consisting of two orthogonally-polarized pumps and a phase-locked signal copolarized to one of them, was implemented in a low-birefringence silicon germanium (SiGe) waveguide. The strong TE/TM modal symmetry of the waveguide and its large nonlinear coefficient enabled the achievement of an extremely large phase sensitive extinction ratio of approximately 29 dB for a total input power of only 21.3 dBm. This SiGe-based PSA was used to demonstrate phase regeneration on a 20 Gb/s differential phase-shift keying signal, thereby reducing its error vector magnitude and phase error by three and six times respectively and enabling a bit-error ratio improvement of up to 2 dB.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:8gBurD7jEYQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure communications links based on chaotic optical carriers",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.511.3154&rep=rep1&type=pdf",
            "Abstract": "Optical communications systems are well established in the infrastructure of the global communications net, providing enormous bandwidth for present and future applications. Various approaches have been tried over the last decade to assure the utmost privacy and security of these systems. Among the approaches, chaotic optical carriers are very promising for secure communications.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new scheme for regenerative 40 Gb/s NRZ wavelength conversion using a hybrid integrated SOA-MZI",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=OFC-2010-OThS6",
            "Abstract": "We present a new NRZ wavelength conversion scheme based on SOA-MZI. Experimental verification of its superior 2R regenerative capabilities are demonstrated for 40 Gb/s NRZ data signals.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Wavelength conversion of complex modulation formats in a compact SiGe waveguide",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=oe-25-4-3252",
            "Abstract": "We report a nonlinear signal processing system based on a SiGe waveguide suitable for high spectral efficiency data signals. Four-wave-mixing (FWM)-based wavelength conversion of 10-Gbaud 16-Quadrature amplitude modulated (QAM) and 64-QAM signals is demonstrated with less than −10-dB conversion efficiency (CE), 36-dB idler optical signal-to-noise ratio (OSNR), negligible bit error ratio (BER) penalty and a 3-dB conversion bandwidth exceeding 30nm. The SiGe device was CW-pumped and operated in a passive scheme without giving rise to any two-photon absorption (TPA) effects.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:j7XjBeKFbTsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Ultrawide-band pulse generation based on cross phase modulation in fibers",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4444414/",
            "Abstract": "An ultrawide-band impulse signal's generator based on the cross-phase modulation effect (XPM) in optical fibers performed by optical filtering is experimentally demonstated. Electrical monocycle pulses have be obtained at the output of the photodetector (PD).",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical investigation of fiber transmission of a chaotic encrypted message using dispersion compensation schemes",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-22-10-2256",
            "Abstract": "A detailed numerical investigation of the transmission properties of all-optical chaotic communication systems is presented for two data-encoding techniques and for various dispersion compensation maps. A semiconductor laser subjected to optical feedback generates the chaotic carrier, and the data is encoded on it by chaotic modulation (CM) or chaotic-shift-keying (CSK) methods. The complete transmission module consists of different types of fiber,inline amplifiers, and Gaussian optical filters. Different dispersion maps based on either Nonzero dispersion-shifted fibers (NZ-DSFs) or combinations of single-mode fibers (SMF) along with dispersion-compensating fibers (DCF) were considered. The system's performance is numerically tested by calculating the Q factor of the eye diagram of the received data for 1 and 2.4 Gb/s. The influence of the optical power launched into fiber and the transmission distance to the …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dual pump wave generation from NRZ-ASK signal enabling a “black-box” phase sensitive amplifier",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2011-OWL7",
            "Abstract": "We present a phase locking scheme that enables the demonstration of the first black-box dual pump degenerate phase sensitive amplifier for 10 Gbit/s NRZ-ASK signals.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:KxtntwgDAa4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Highly nonlinear tellurite glass fiber for broadband applications",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6886926/",
            "Abstract": "We report the characterization of loss and nonlinearity of a broadband tellurite glass fiber both at 1.55μm and 2μm wavelengths. The study is accompanied by a demonstration of wavelength conversion at both of these wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:4oJvMfeQlr8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An All-optical buffer based on non-degenerate phase-sensitive parametric amplification",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-36-24-5949",
            "Abstract": "The scheme of an optical buffer exploiting phase-sensitive amplification based non-degenerate four-wave mixing is presented and theoretically analyzed. The noise figure of the proposed buffer is analytically and numerically estimated as a function of the number of circulations inside the buffer cavity. Two principal configurations are studied depending on the position of the amplification unit inside the cavity. The analysis is supported by split-step Fourier simulations, which reveal different aspects of the buffer's operation. The performance is also estimated for modulated signals in terms of Q-factor and compared to buffers utilizing phase-insensitive amplification.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:-vzq6BoH5oUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancement of chaos encryption potential by combining all-optical and electrooptical chaos generators",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5565350/",
            "Abstract": "We propose a new architecture for optical chaos communication combining previously studied all-optical and electrooptical schemes. We investigate a cascaded system in terms of complexity and encryption efficiency in a transmitter-receiver setup. It is shown that the feedback delay time of the transmitter can be successfully hidden and that synchronization is very sensitive to delay mismatches, thus preventing the eavesdropper from reproducing the system.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Operation properties of a reconfigurable photonic logic gate based on cross phase modulation in highly nonlinear fibers",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1068520008000369",
            "Abstract": "The operation features of a 160 Gb/s reconfigurable all-optical logic gate based on cross phase modulation in highly nonlinear fibers are numerically investigated for six logic functions (XOR, OR, NAND, NOR, NOT, and AND). High bit rate operation is numerically demonstrated for a wide input signal wavelength range (> 20 nm). Performance enhancement of the proposed setup operating at 160 Gb/s for different signal wavelengths is exhibited by using a 2R regenerator based on the self-phase modulation effect in highly nonlinear fibers at the gate's output. The operation of the multi-functional logic gate is investigated considering either a pulsed or a continuous wave probe.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Performance-enhanced Amplified O-band WDM Transmission using Machine Learning based Equalization",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_SI-2021-STh1F.3",
            "Abstract": "We investigate the performance of a machine learning-based equalization in an amplified 4× 50-Gb/s O-band WDM system. The results show that the scheme offers significant receiver sensitivity improvements over decision-feedback equalization, especially at more dispersive wavelengths.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:QAOzB4mb83kC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Novel mid-infrared gas sensor based on mutually coupled quantum cascade lasers",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7788430/",
            "Abstract": "A gas sensor relying on mutually coupled Quantum Cascade Lasers is studied. Experiments show a six times improvement in the detectivity compared to a typical spectrometer consisting of laser, absorption cell and photodetector.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:5VjbC5aozO0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Polarization insensitive wavelength conversion of 40 Gb/s DPSK signals in a silicon germanium waveguide",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2015-Tu2F.1",
            "Abstract": "We demonstrate polarization insensitive FWM-based wavelength conversion of 40-Gb/s DPSK signals in a SiGe waveguide, with 0.42-dB polarization-dependent loss. A 1.5-dB power penalty was measured at a BER of 10− 9.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:HKviVsUxM5wC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Distributed Optical Parametric Amplification at 1.3: Performance and Applications in Optical Access Networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6146400/",
            "Abstract": "The gain and noise properties of distributed optical parametric amplification at 1.3 μm in typical single-mode fibers are numerically investigated. The analysis shows remarkable amplification performance over 100 km of single-mode optical fiber. The potential of direct use of the method in next-generation passive optical networks is numerically demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A chaotic photonic integrated circuit for Gb/s true random number generation",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5621522/",
            "Abstract": "Broadband chaotic signals generated by a photonic integrated circuit are employed to provide true random bit streams at Gb/s rates. Chaotic waveforms with appropriate spectral distribution and statistics succeed, after sampling, to pass randomness tests specified by NIST organization.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Correction to “Performance Characterization of a Closed-Loop Chaotic Communication System Including Fiber Transmission in Dispersion Shifted Filters”",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/47756234/jqe.2005.84498720160803-12654-18k43o0.pdf",
            "Abstract": "Correction to “Performance Characterization of a Closed-Loop Chaotic Communication System \nIncluding Fiber Transmission in Disp Page 1 IEEE JOURNAL OF QUANTUM ELECTRONICS, \nVOL. 41, NO. 3, MARCH 2005 469 Correction to “Performance Characterization of a Closed-Loop \nChaotic Communication System Including Fiber Transmission in Dispersion Shifted Filters” \nAdonis Bogris, Dimitris Kanakidis, Apostolos Argyris, and Dimitris Syvridis In the above paper [1], \nFig. 10(a) was printed incorrectly. The correct Fig. 10(a) follows. Manuscript received November \n12, 2004. The authors are with the Department of Informatics and Telecommunications, \nUniversity of Athens, GR-15784 Athens, Greece (e-mail: abogris@di.uoa.gr). Digital Object \nIdentifier 10.1109/JQE.2005.844987 Fig. 10. (a) Q-factor values obtained for the two \nencoding techniques as a function of the ML power launched into the fiber. [1] A. Bogris, D…",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced nonlinear signal processing in silicon-based waveguides",
            "Publication year": 2015,
            "Publication url": "https://core.ac.uk/download/pdf/188702152.pdf",
            "Abstract": "This talk presents recent progress in optical signal processing based on compact waveguides fabricated mainly using silicon germanium alloys. Applications include supercontinuum generation, wavelength conversion and signal regeneration.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:hEXC_dOfxuUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced multi-level phase quantizer for the optical processing of M-PSK signals",
            "Publication year": 2016,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-34-10-2571",
            "Abstract": "This paper presents a novel multi-level phase quantizer with the potential of almost ideal step like transfer function. Its operation relies on the proper combination of phase sensitive amplification in highly nonlinear fibers and amplitude limitation offered by injection locked lasers. Thorough investigation of the quantization properties of the scheme is theoretically and numerically conducted under ideal and non-ideal operating conditions. The properties of the limiter and their impact on the quantization performance are highlighted. The regenerative operation is demonstrated numerically by showing that a regenerated differentially decoded quaternary shifted keyed signal exhibits almost identical bit error rate performance with homodyne detection.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:dFKc6_kCK1wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Chaos-based communications at high bit rates using commercial fibre-optic links",
            "Publication year": 2006,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/6353/63531K/Chaos-based-communications-at-high-bit-rates-using-commercial-fibre/10.1117/12.692719.short",
            "Abstract": "A thorough study of an all-optical chaotic communication system, including experimental realization real-world testing  and performance characterization through bit-error-rate analysis, is presented. Pseudorandom data that are effectively  encrypted in the chaotic emitter and sent for transmission are recovered at the receiver with bit-error-rate (BER) values  as low as 10-7 for 1 Gb/s data rate. Different data code lengths and bit-rates at the Gb/s region have been tested. Optical  transmission using 100km fiber spools in an in-situ experiment and 120km in an installed optical network showed that  chaotic communication systems does not act as a considerably deteriorating factor in the final performance.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:zA6iFVUQeVQC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "FWM-based wavelength conversion in a silicon germanium waveguide",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2013-OTh1C.4",
            "Abstract": "We demonstrate four-wave mixing based wavelength conversion of 40 Gbaud DPSK and QPSK signals in a 2.5-cm long silicon germanium waveguide with a nonlinearity coefficient of 25.8/W/m.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Experimental study of neuromorphic node based on a multiwaveband emitting two-section quantum dot laser",
            "Publication year": 2021,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=prj-9-4-B87",
            "Abstract": "In this work, we present experimental results concerning excitability in a multiband emitting quantum-dot-based photonic neuron. The experimental investigation revealed that the same two-section quantum dot laser can be tuned through a simple bias adjustment to operate either as a leaky integrate and fire or as a resonate and fire neuron. Furthermore, by exploiting the inherent multiband emission of quantum-dot devices revealed by the existence of multiple lasing thresholds, a significant enhancement in the neurocomputational capabilities, such as spiking duration and firing rate, is observed. Spike firing rate increased by an order of magnitude that leads to an enhancement in processing speed and, more importantly, neural spike duration was suppressed to the picosecond scale, which corresponds to a significant temporal resolution enhancement. These new regimes of operation, when combined with thermal …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:nroGzMJTTpEC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Chaotic Communication System-Performance Characterization of a Closed-Loop Chaotic Communication System Including Fiber Transmission in Dispersion Shifted Fibers",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=1110156832284559937&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:k_IJM867U9cC",
            "Publisher": "[New York: Institute of Electrical and Electronics Engineers, c1965-"
        },
        {
            "Title": "Transformation of nonlinear phase noise statistics in a phase-sensitive amplifier",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Thomas-Kamalakis/publication/4316759_Transformation_of_nonlinear_phase_noise_statistics_in_a_phase-sensitive_amplifier/links/55d20e1108aec1b0429dcdad/Transformation-of-nonlinear-phase-noise-statistics-in-a-phase-sensitive-amplifier.pdf",
            "Abstract": "The nonlinear phase noise statistics of a phase modulated signal coming through a phase-sensitive amplifier are semi-analytically analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Raman-induced asymmetric pump noise transfer in fiber-optical parametric amplifiers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5419282/",
            "Abstract": "In this letter, a theoretical model accounting for the asymmetric transfer of pump noise in the gain spectrum of a single-pump fiber parametric amplifier due to the Raman effect is presented. The model is satisfactorily verified by the experiments. The experiments demonstrate that the pump electrical signal-to-noise ratio remains unchanged in contrast to the optical signal-to-noise ratio which decreases along the fiber.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "All-optical phase and amplitude regenerator for next-generation telecommunications systems",
            "Publication year": 2010,
            "Publication url": "https://www.nature.com/articles/nphoton.2010.203",
            "Abstract": "Fibre-optic communications systems have traditionally carried data using binary (on− off) encoding of the light amplitude. However, next-generation systems will use both the amplitude and phase of the optical carrier to achieve higher spectral efficiencies and thus higher overall data capacities 1, 2. Although this approach requires highly complex transmitters and receivers, the increased capacity and many further practical benefits that accrue from a full knowledge of the amplitude and phase of the optical field 3 more than outweigh this additional hardware complexity and can greatly simplify optical network design. However, use of the complex optical field gives rise to a new dominant limitation to system performance—nonlinear phase noise 4, 5. Developing a device to remove this noise is therefore of great technical importance. Here, we report the development of the first practical (‘black-box’) all-optical …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Silicon germanium platform enabling mid-infrared to near-infrared conversion for telecom and sensing applications",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6964166/",
            "Abstract": "This paper presents the potential of silicon germanium waveguides in the nonlinear conversion of light from mid-infdrared wavelengths to the telecom band utilizing four-wave mixing. Design aspects and first characterization results of fabricated devices are presented.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:4E1Y8I9HL1wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experimental evaluation of an open-loop all-optical chaotic communication system",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1366363/",
            "Abstract": "An experimental investigation of the performance of an open-loop optical chaotic communication system has been carried out under different optical injection conditions. The most popular message encoding techniques have been considered, tested and compared at gigabit rates and for different levels of optical injection to the receiver, by bit-error-rate (BER) measurements. Different low-pass electrical filters have been implemented for the various message bit-rates tested, in order to employ the most appropriate one for message decoding. The best performance of all the examined encryption methods for messages of 1.5 Gb/s bit-rate emerged for the chaos modulation encryption method and was characterized by Q-factor values up to 5.1, after synchronizing in the strong injection regime, while the corresponding BER of the decoded message was as low as 7/spl middot/10/sup -5/. In order to confirm the secure …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Measurement of sub-1dB noise figure in a non-degenerate cascaded phase-sensitive fibre parametric amplifier",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5287291/",
            "Abstract": "Noise figure (NF) spectrum as well as its signal-power-dependence in a non-degenerate cascaded phase-sensitive fibre parametric amplifier was characterized. A 0.8 dB NF (2 dB below the conventional quantum limit) was achieved at 11 dB gain.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Two-mode injection-locked FP laser receiver: a regenerator for long-distance stable fiber delivery of radio-frequency standards",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-40-6-886",
            "Abstract": "We propose and experimentally validate a new cost-effective optical receiver–regenerator scheme for long-distance microwave-frequency standard dissemination, based on the properties of dual-wavelength injection locked Fabry–Perot (FP) lasers. The regenerator FP laser is injection locked to one of its longitudinal modes by the incoming intensity-modulated light carrying the microwave-frequency standard. The light of a local CW laser is also injected in the regenerator FP, locking it to an adjacent mode. The dual-injection locked laser reproduces the sinusoidal microwave-frequency standard on both wavelengths. The regenerated original signal is transmitted to the next node, whilst the local wavelength is fed back to the previous node for phase error extraction and link compensation. The performance of the proposed regenerator is demonstrated with Allan deviation and phase-noise measurements.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:rpSJNIKeXWsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "2012 Index IEEE Journal of Selected Topics in Quantum Electronics Vol. 18",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6420981/",
            "Abstract": "This index covers all technical items - papers, correspondence, reviews, etc. - that appeared in this periodical during the year, and items from previous years that were commented upon or corrected in this year. Departments and other items may also be covered if they have been judged to have archival value. The Author Index contains the primary entry for each item, listed under the first author's name. The primary entry includes the co-authors' names, the title of the paper or other item, and its location, specified by the publication abbreviation, year, month, and inclusive pagination. The Subject Index contains entries describing the item under all appropriate subject headings, plus the first author's name, the publication abbreviation, month, and year, and inclusive pages. Note that the item title is found only under the primary entry in the Author Index.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time-Multiplexed Spiking Convolutional Neural Network Based on VCSELs for Unsupervised Image Classification",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/985214",
            "Abstract": "In this work, we present numerical results concerning a multilayer “deep” photonic spiking convolutional neural network, arranged so as to tackle a 2D image classification task. The spiking neurons used are typical two-section quantum-well vertical-cavity surface-emitting lasers that exhibit isomorphic behavior to biological neurons, such as integrate-and-fire excitability and timing encoding. The isomorphism of the proposed scheme to biological networks is extended by replicating the retina ganglion cell for contrast detection in the photonic domain and by utilizing unsupervised spike dependent plasticity as the main training technique. Finally, in this work we also investigate the possibility of exploiting the fast carrier dynamics of lasers so as to time-multiplex spatial information and reduce the number of physical neurons used in the convolutional layers by orders of magnitude. This last feature unlocks new possibilities, where neuron count and processing speed can be interchanged so as to meet the constraints of different applications.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:onKP9CxGSkIC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Analysis of 50 Gbaud homodyne coherent receivers relying on line-coding and injection locking in lasers",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=CLEO_AT-2014-JTh2A.11",
            "Abstract": "We present a numerical analysis of 50 Gbaud coherent detection enabled by injection locked lasers and line coding. The impact of the slave laser properties and line coding techniques on the receiver performance is highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:1xBWf43XMUgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Regenerative properties of a pump-modulated four-wave mixing scheme in dispersion-shifted fibers",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1230168/",
            "Abstract": "A new scheme for all-optical signal reshaping is proposed. It is shown that proper adjustment of the operating conditions of a wavelength converter based on four-wave mixing (FWM) in dispersion-shifted fiber (DSF) results in significant extinction ratio enhancement and noise suppression of the converted signal. The key issue in the proposed idea is the application of the modulation bitstream on the input pump wave. Detailed numerical simulation shows that it is possible to achieve a wavelength-converted output with extinction ratio of 20 dB when the extinction ratio of the input signal is 10.5 dB, while at the same time, the improvement in the Q-factor is almost 6 (from 6.5 at the input, it becomes more than 12 at the output). The theoretical predictions have been experimentally confirmed by measuring the transfer function of the FWM in a 17-km-long DSF under different operating conditions. The obtained results are in …",
            "Abstract entirety": 0,
            "Author pub id": "3lXJLxwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Telecom to mid-infrared supercontinuum generation in a silicon germanium waveguide",
            "Publication year": 2015,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ofc-2015-Tu2C.5",
            "Abstract": "We report the first demonstration of broadband supercontinuum generation in silicon-germanium waveguides. Upon propagation of ultra-short femtosecond pulses in a 3-cm-long waveguide, the broadening extended from 1.455 µm to 2.788 µm (at the-30-dB point).",
            "Abstract entirety": 1,
            "Author pub id": "3lXJLxwAAAAJ:DGzKIA18-3YC",
            "Publisher": "Optical Society of America"
        }
    ]
}]