[{
    "name": "Αντώνιος Αλετράς",
    "romanize name": "Antonios Aletras",
    "School-Department": "Ιατρικής",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 19178,
    "Scholar name": "Anthony H. Aletras",
    "Scholar id": "1O0vvE0AAAAJ",
    "Affiliation": "Professor, Aristotle University of Thessaloniki",
    "Citedby": 11675,
    "Interests": [
        "MRI",
        "Medical Imaging"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=1O0vvE0AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Edematous peri-infarct myocardium has a greater extracellular volume fraction compared with normal myocardium-implications for late gadolinium enhancement",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=15959835887596156116&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "OXFORD UNIV PRESS"
        },
        {
            "Title": "Phase‐sensitive inversion recovery for detecting myocardial infarction using gadolinium‐delayed hyperenhancement",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.10051",
            "Abstract": "After administration of gadolinium, infarcted myocardium exhibits delayed hyperenhancement and can be imaged using an inversion recovery (IR) sequence. The performance of such a method when using magnitude‐reconstructed images is highly sensitive to the inversion recovery time (TI) selected. Using phase‐sensitive reconstruction, it is possible to use a nominal value of TI, eliminate several breath‐holds otherwise needed to find the precise null time for normal myocardium, and achieve a consistent contrast. Phase‐sensitive detection is used to remove the background phase while preserving the sign of the desired magnetization during IR. Experimental results are presented which demonstrate the benefits of both phase‐sensitive IR image reconstruction and surface coil intensity normalization for detecting myocardial infarction (MI). The phase‐sensitive reconstruction method reduces the variation in …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:qjMakFHDy7sC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Manganese enhanced magnetic resonance imaging of normal and ischemic canine heart",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.20516",
            "Abstract": "The ability of MnCl2 to enhance canine myocardium and to delineate ischemic areas is demonstrated. A dose–response curve was measured using T1 weighted images in 11 dogs. MnCl2 (36, 113, 360, and 3600 μmol) was infused over a period of 3 min. Signal intensity increased linearly with MnCl2 dose. At 113 μmol (∼10 μmol/kg) the steady‐state increase in intensity averaged 212 ± 34%. No significant physiologic effects due to the infused MnCl2 were detected except at the highest dose where there was a cardiac depressive effect. Ischemia was induced by occluding the left anterior descending coronary artery in 5 dogs. At an infused dose of 113 μmol, MnCl2 clearly demarcated the ischemic zone during coronary occlusion. Contrast enhancement in the ischemic zone was less than 30% compared with normal tissue (P < 0.03). In conclusion, the intracellular contrast agent MnCl2 enhances the canine heart …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:_kc_bZDykSQC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Basic mri physics",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-59745-306-6_1",
            "Abstract": "Magnetic resonance imaging (MRI) basic physics can be described at many different levels, ranging from purely descriptive all the way to quantum mechanics. Here, MRI physics is dealt with mostly in a descriptive manner, and simple mathematics are introduced only if necessary. The simple vector-based model for representing the magnetization is presented because it can deal with most aspects of MRI without the additional complexity of quantum mechanics. In this chapter, nuclear magnetic resonance (NMR) signal generation and its properties are discussed first. Subsequently, image formation in terms of localizing the NMR signal in three dimensions is presented.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:maZDTaKrznsC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Fetal Cardiac Magnetic Resonance Imaging with self-gated iGRASP",
            "Publication year": 2016,
            "Publication url": "https://lup.lub.lu.se/record/a4577195-8010-482e-9300-022502723f7d",
            "Abstract": "Fetal Cardiac Magnetic Resonance Imaging with self-gated iGRASP LUND UNIVERSITY \nLUND UNIVERSITY LIBRARIES Lund University Lund University Publications LUND \nUNIVERSITY LIBRARIES Register publications | Statistics | Marked list 0 | Saved searches \n0 Advanced Home | Publications | Departments Fetal Cardiac Magnetic Resonance \nImaging with self-gated iGRASP Haris, Kostas LU ; Hedström, Erik LU ; Bidhult, Sebastian \nLU ; Testud, Frederik ; Kantasis, George ; Engblom, Henrik LU ; Carlsson, Marcus LU ; \nMaglaveras, Nicos ; Heiberg, Einar LU and Hansson, Stefan R LU , et al. (2016) ISMRM \n24th Annual Meeting Mark Links Research Portal page Alternative location Google Scholar \nfind title Please use this url to cite or link to this publication: https://lup.lub.lu.se/record/a4577195-8010-482e-9300-022502723f7d \nDetails BibTeX author Haris, Kostas LU ; Hedström, Erik LU ; Bidhult, Sebastian LU ; , ; , ; …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nitrite anion provides potent cytoprotective and antiapoptotic effects as adjunctive therapy to reperfusion for acute myocardial infarction",
            "Publication year": 2008,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circulationaha.107.748814",
            "Abstract": "Background— Accumulating evidence suggests that the ubiquitous anion nitrite (NO2−) is a physiological signaling molecule, with roles in intravascular endocrine nitric oxide transport, hypoxic vasodilation, signaling, and cytoprotection. Thus, nitrite could enhance the efficacy of reperfusion therapy for acute myocardial infarction. The specific aims of this study were (1) to assess the efficacy of nitrite in reducing necrosis and apoptosis in canine myocardial infarction and (2) to determine the relative role of nitrite versus chemical intermediates, such as S-nitrosothiols.Methods and Results— We evaluated infarct size, microvascular perfusion, and left ventricular function by histopathology, microspheres, and magnetic resonance imaging in 27 canines subjected to 120 minutes of coronary artery occlusion. This was a blinded, prospective study comparing a saline control group (n=9) with intravenous nitrite during the …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Surface coil intensity correction and non-linear intensity normalization improve pixel-resolution parametric maps of myocardial MRI perfusion",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39903-2_130",
            "Abstract": "We present a systematic approach to generate pixel-wise parametric maps from contrast-enhanced MR myocardial perfusion images. A surface coil intensity correction algorithm is used to compensate the myocardial intensity inhomogeneity. Non-linear intensity normalization is applied to color encode the pixel intensity. The preliminary result shows our technique is valuable in differentiating perfusion defects within myocardial regions of interest.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Absolute myocardial perfusion in canines measured by using dual-bolus first-pass MR imaging",
            "Publication year": 2004,
            "Publication url": "https://pubs.rsna.org/doi/abs/10.1148/radiol.2323030573",
            "Abstract": "PURPOSE: To compare fluorescent microsphere measurements of myocardial blood flow (MBF) with qualitative, semiquantitative, and fully quantitative measurements of first-pass perfusion at magnetic resonance (MR) imaging.MATERIALS AND METHODS: Coronary artery occlusion or intracoronary adenosine infusion was successfully performed in 16 beagles; both procedures were performed simultaneously in one animal. MBF was assessed at microsphere analysis. First-pass myocardial perfusion MR imaging was performed during a dual-bolus administration of gadopentetate dimeglumine (0.0025 mmol/kg followed by 0.10 mmol/kg). The absolute myocardial perfusion at MR imaging was calculated by using Fermi function deconvolution methods. Qualitative, semiquantitative, and absolute myocardial perfusion MR imaging measurements were compared with microsphere MBF measurements by using …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Radiological Society of North America"
        },
        {
            "Title": "Navigated DENSE strain imaging for post-radiofrequency ablation lesion assessment in the swine left atria",
            "Publication year": 2014,
            "Publication url": "https://academic.oup.com/europace/article-abstract/16/1/133/464598",
            "Abstract": "Prior work has demonstrated that magnetic resonance imaging (MRI) strain can separate necrotic/stunned myocardium from healthy myocardium in the left ventricle (LV). We surmised that high-resolution MRI strain, using navigator-echo-triggered DENSE, could differentiate radiofrequency ablated tissue around the pulmonary vein (PV) from tissue that had not been damaged by radiofrequency energy, similarly to navigated 3D myocardial delayed enhancement (3D-MDE).A respiratory-navigated 2D-DENSE sequence was developed, providing strain encoding in two spatial directions with 1.2 × 1.0 × 4 mm3 resolution. It was tested in the LV of infarcted sheep. In four swine, incomplete circumferential lesions were created around the right superior pulmonary vein (RSPV) using ablation catheters, recorded with electro-anatomic mapping, and imaged 1 h …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:uWQEDVKXjbEC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A new automatic algorithm for quantification of myocardial infarction imaged by late gadolinium enhancement cardiovascular magnetic resonance: experimental validation and comparison to expert delineations in multi-center, multi-vendor patient data",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s12968-016-0242-5",
            "Abstract": "Late gadolinium enhancement (LGE) cardiovascular magnetic resonance (CMR) using magnitude inversion recovery (IR) or phase sensitive inversion recovery (PSIR) has become clinical standard for assessment of myocardial infarction (MI). However, there is no clinical standard for quantification of MI even though multiple methods have been proposed. Simple thresholds have yielded varying results and advanced algorithms have only been validated in single center studies. Therefore, the aim of this study was to develop an automatic algorithm for MI quantification in IR and PSIR LGE images and to validate the new algorithm experimentally and compare it to expert delineations in multi-center, multi-vendor patient data. The new automatic algorithm, EWA (Expectation Maximization, weighted intensity, a priori information), was implemented using an intensity threshold by Expectation Maximization (EM) and a …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:tzM49s52ZIMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Regional adenosine-induced hypoperfusion without hyperenhancement on LGE-MRI in young HCM patients: comparison to subjects at risk of HCM and healthy volunteers",
            "Publication year": 2015,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-17-S1-Q51",
            "Abstract": "BackgroundThe relation between hypoperfusion and fibrosis is not completely understood in hypertrophic cardiomyopathy (HCM). One hypothesis is that hypoperfusion is a primary cause of fibrosis. Therefore, the aim of this study was to use cardiac magnetic resonance (CMR) to 1) measure if regional perfusion is decreased in young patients with HCM and in subjects at risk of HCM compared to normal controls and 2) determine if regional myocardial perfusion is decreased in areas with left ventricular hypertrophy (LVH) without detectable fibrosis.MethodsStudy participants were divided into either 1) HCM patients (wall thickness> 13mm or> 3SD on z-score with echocardiography and/or fibrosis), 2) HCM-risk subjects (HCM present among first-degree relatives, but without LVH/fibrosis on CMR), and 3) healthy controls.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:_B80troHkn4C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "T2-weighted magnetic resonance imaging has high diagnostic accuracy for myocardial haemorrhage in myocardial infarction: a preclinical validation study in swine",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=1682438093886672433&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Super‐Resolution Cine Image Enhancement for Fetal Cardiac Magnetic Resonance Imaging",
            "Publication year": 2021,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.27956",
            "Abstract": "Fetal cardiac magnetic resonance imaging (MRI) improves the diagnosis of congenital heart defects, but is sensitive to fetal motion due to long image acquisition time. This may be overcome with faster image acquisition with low resolution, followed by image enhancement to provide clinically useful images.To combine phase‐encoding undersampling with super‐resolution neural networks to achieve high‐resolution fetal cine cardiac MR images with short acquisition time.Prospective.Twenty‐eight fetuses (gestational week 36 [interquartile range 33–38 weeks]).1.5 T, balanced steady‐state free precession (bSSFP) cine sequence.Images were acquired using fully sampled Doppler ultrasound‐gated clinical bSSFP cine as reference, with equivalent cine sequences with decreased phase‐encoding resolution (25%, 33%, and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:0N-VGjzr574C",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Imaging of urea using chemical exchange‐dependent saturation transfer at 1.5 T",
            "Publication year": 2000,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/1522-2586(200011)12:5%3C745::AID-JMRI12%3E3.0.CO;2-H",
            "Abstract": "The purpose of this study was to screen for slow proton chemical exchange between water and kidney metabolites using a standard clinical 1.5‐T scanner. Imaging was performed using a fast spin‐echo sequence with a magnetization transfer (MT) preparation pulse train. Off‐resonance saturation ranging from ±50 to ±1000 Hz was used on urea and urine phantoms and normal human subjects imaged through the kidneys. The positive frequency was used as the control for each frequency pair. Results of frequency sweeps show an asymmetric MT effect peaking at approximately 100 Hz (∼︁1 ppm) for urea, urine, and renal parenchyma. Varying differences (5%–25%) occurred with different human subjects. Few differences were observed from phantom water or subject muscle tissue. Chemical exchange is detectable in the kidney near 1 ppm at 1.5 T, attributable to urea. This technique was used to produce in vivo …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Quantification of blood flow in the fetus with cardiovascular magnetic resonance imaging using Doppler ultrasound gating: validation against metric optimized gating",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1186/s12968-019-0586-8",
            "Abstract": "Fetal cardiovascular magnetic resonance (CMR) imaging is used clinically and for research, but has been previously limited due to lack of direct gating methods. A CMR-compatible Doppler ultrasound (DUS) gating device has resolved this. However, the DUS-gating method is not validated against the current reference method for fetal phase-contrast blood flow measurements, metric optimized gating (MOG). Further, we investigated how different methods for vessel delineation affect flow volumes and observer variability in fetal flow acquisitions. To 1) validate DUS gating versus MOG for quantifying fetal blood flow; 2) assess repeatability of DUS gating; 3) assess impact of region of interest (ROI) size on flow volume; and 4) compare time-resolved and static delineations for flow volume and observer variability. Phase-contrast CMR was acquired in the fetal descending aorta (DAo) and umbilical vein by DUS gating …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:SpbeaW3--B0C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Quantitative myocardial infarction on delayed enhancement MRI. Part II: Clinical application of an automated feature analysis and combined thresholding infarct sizing algorithm",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.20495",
            "Abstract": "To compare global and regional myocardial infarction (MI) measurements on clinical gadolinium‐enhanced magnetic resonance (MR) images using human manual contouring and a computer algorithm previously validated by histopathology, and to study the degree to which visual assessment and human contouring of infarct extent agreed with the computer algorithm.Infarct size in 20 patients was measured by human manual contouring and with an automated feature analysis and combined thresholding (FACT) computer algorithm. Short‐axis slices were divided into myocardial sectors for regional analysis. Extent of infarction was also graded visually by consensus of expert readers and compared to human and computer contouring.Despite good correlations (R = 0.93–0.95) between human contouring and the FACT algorithm, human contouring overestimated infarct …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:Se3iqnhoufwC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "The importance of absolute quantitation for multislice MRI myocardial perfusion during vasodilator stress",
            "Publication year": 2002,
            "Publication url": "https://www.jacc.org/doi/pdf/10.1016/S0735-1097%2802%2981564-9",
            "Abstract": "Background: Atherosclerosis can simultaneously affect different vascular areas. Previous studies have shown the high incidence of coronary artery disease (20-73%) in patients undergoing aortic aneurysm repair. However, routine coronary angiography in all patients with aortic aneurysm may increase unnecessary risks and costs. The purpose of this study was to evaluate the value of stress first-pass myocardial perfusion and delayed enhanced MR imaging for predicting significant coronary stenoses in patients with aortic aneurysm.Method: MR imaging was performed in 31 patients before the elective repair of aortic aneurysm (abdominal 22, thoracic 6, thoracoabdominal 3). First-pass perfusion MR images were acquired on short-axis slices encompassing the entire LV myooardium during pharmacological stress by using a 1.5 T MR imager. Inversion recovery prepared delayed-enhancad MR images and true …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:KxtntwgDAa4C",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Accuracy of fully quantitative cardiac magnetic resonance myocardial perfusion in detection of coronary disease as measured by quantitative coronary angiography",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=18081056361716948256&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "ELSEVIER SCIENCE INC"
        },
        {
            "Title": "Association of unrecognized myocardial infarction with long-term outcomes in community-dwelling older adults: the ICELAND MI Study",
            "Publication year": 2018,
            "Publication url": "https://jamanetwork.com/journals/jamacardiology/article-abstract/2705678",
            "Abstract": "Cardiac magnetic resonance (CMR) imaging can identify unrecognized myocardial infarction (UMI) in the general population. Unrecognized myocardial infarction by CMR portends poor prognosis in the short term but, to our knowledge, long-term outcomes are not known.To determine the long-term outcomes of UMI by CMR compared with clinically recognized myocardial infarction (RMI) and no myocardial infarction (MI).Participants of the population-based, prospectively enrolled ICELAND MI cohort study (aged 67-93 years) were characterized with CMR at baseline (from January 2004-January 2007) and followed up for up to 13.3 years. Kaplan-Meier time-to-event analyses and a Cox regression were used to assess the association of UMI at baseline with death and future cardiovascular events.The primary outcome was all-cause …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:gsN89kCJA0AC",
            "Publisher": "American Medical Association"
        },
        {
            "Title": "Heterogeneity of intramural function in hypertrophic cardiomyopathy: mechanistic insights from MRI late gadolinium enhancement and high-resolution displacement encoding with stimulated echoes strain maps",
            "Publication year": 2011,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/CIRCIMAGING.110.958751",
            "Abstract": "In hypertrophic cardiomyopathy (HCM), myocardial abnormalities are commonly heterogeneous. Two patterns of late gadolinium enhancement (LGE) have been reported: a bright “confluent” and an intermediate intensity abnormality termed “diffuse,” each representing different degrees of myocardial scarring. We used MRI to study the relation between intramural cardiac function and the extent of fibrosis in HCM. The aim of this study was to determine whether excess collagen or myocardial scarring, as determined by LGE MRI, are the primary mechanisms leading to heterogeneous regional contractile function in patients with HCM.Intramural left ventricular strain, transmural left ventricular function, and regions of myocardial fibrosis/scarring were imaged in 22 patients with HCM, using displacement encoding with stimulated echoes (DENSE), cine MRI, and LGE. DENSE systolic …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:hC7cP41nSMkC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "2102 The ischemic area at risk can be detected by both T1 and T2 pre-contrast CMR",
            "Publication year": 2008,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-10-S1-A371",
            "Abstract": "ObjectivesWe hypothesized that pre-gadolinium T1 CMR delineates the AAR in a similar manner to T2 imaging in acute myocardial infarction.MethodsImaging was performed 3 days after LAD occlusion-reperfusion in13 dogs. T2 and T1 maps were computed from pre-gadolinium CMR with T2-prepared SSFP (14 TE's of 16–280 ms) and with IR-GRE (10 TIs of 71–900 ms) respectively. The infarcted territory was defined by post-gadolinium delayed enhancement. Two observers evaluated the images for the involvement of a single coronary distribution, for graininess and border definition of different areas.ResultsA delayed contrast enhanced image (depicting the non-transmural infarct) and corresponding pre-gadolinium T2 and T1 maps (depicting the AAR) are shown in Figure 1. In the T2 map, the AAR is red whereas normal myocardium is green. The areas on the T1 map agree with those in the T2 map in terms of circumferential and transmural extent. The average T2 value of the infarct, the peri-infarct zone and remote myocardium were 72±2, 57±2 and 46±3 ms respectively. The corresponding average T1 values were 1020±18, 972±18 and 879±13. In all 13 cases the T1 maps exhibited better image quality than the T2 maps.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:f2IySw72cVMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Myocardial strain decreases with transmurality of infarction: An echo strain and MRI correlation study",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=2602995746921283278&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:4OULZ7Gr8RgC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Extracellular volume imaging by magnetic resonance imaging provides insights into overt and sub-clinical myocardial pathology",
            "Publication year": 2012,
            "Publication url": "https://academic.oup.com/eurheartj/article-abstract/33/10/1268/485945",
            "Abstract": "Conventional late gadolinium enhancement (LGE) cardiac magnetic resonance can detect myocardial infarction and some forms of non-ischaemic myocardial fibrosis. However, quantitative imaging of extracellular volume fraction (ECV) may be able to detect subtle abnormalities such as diffuse fibrosis or post-infarct remodelling of remote myocardium. The aims were (1) to measure ECV in myocardial infarction and non-ischaemic myocardial fibrosis, (2) to determine whether ECV varies with age, and (3) to detect sub-clinical abnormalities in ‘normal appearing’ myocardium remote from regions of infarction.Cardiac magnetic resonance ECV imaging was performed in 126 patients with T1 mapping before and after injection of gadolinium contrast. Conventional LGE images were acquired for the left ventricle. In patients with a prior myocardial infarction …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:roLk4NBRz8UC",
            "Publisher": "The University of Chicago Press"
        },
        {
            "Title": "Dynamic foetal cardiac MRI using Doppler ultrasound gating",
            "Publication year": 2018,
            "Publication url": "https://epos.myesr.org/esr/viewing/index.php?module=viewing_poster&task=&pi=144934",
            "Abstract": "Aims and objectivesFetal magnetic resonance imaging (MRI) is an increasingly used diagnostic tool for evaluation of the fetal central nervous system, thorax, and abdomen. However, the clinical application of fetal cardiovascular magnetic resonance (CMR) imaging lags behind due to technical challenges [1]. The main challenge is the lack of a cardiac gating signal that synchronizes image data acquisition to the cardiac cycle. In contrast to cardiac gating assessed by surface electrocardiogram post-natally the fetal electrocardiogram signal, however, cannot be obtained in-utero during MRI. Doppler ultrasound (DUS) is...",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:PoWvk5oyLR8C",
            "Publisher": "European Congress of Radiology-ECR 2018"
        },
        {
            "Title": "Experimental validation of contrast enhanced SSFP MR imaging to measure myocardium at risk",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=11633306223304470835&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:VLnqNzywnoUC",
            "Publisher": "OXFORD UNIV PRESS"
        },
        {
            "Title": "Validation of a T1 and T2 mapping software for quantitative MRI",
            "Publication year": 2016,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-18-S1-W28",
            "Abstract": "BackgroundT1 quantification enables measurements of myocardial extracellular volume [1] and T2 mapping may be used for detection of edema in acute myocardial infarction [2]. The purpose of this study was to develop and validate a freely available software for relaxation time map generation.MethodsThe T1 & T2 mapping modules were implemented in Segment [3] and support the pulse sequence types shown in Table 1. T1 estimates were initialized by a lookup table search in an interval of 0-4000 ms and a 5 ms gap between entries. T2 estimates were initialized by linear regression to the signal logarithm. Relaxation time estimates were refined using a C-implementation of the Nelder-Mead Simplex method. Twelve Gadolinium-Agarose phantoms were used for validation at a 1.5 T and a 3T MR-scanner (Siemens, Erlangen). Reference T1 values were determined using an Inversion Recovery (IR) Spin Echo sequence with TR= 10 seconds. Reference T2 values were determined using a Spin Echo sequence with TR= 10 seconds. Nelder-Mead Simplex optimization available in Matlab (Math Works, Natick, MA; 2013a) was used for reference relaxation time values.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:yB1At4FlUx8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Characterisation and initial validation of area-at-risk derived by T2-magnetic resonance imaging in acute myocardial infarction",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=3192599456668339055&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:blknAaTinKkC",
            "Publisher": "BMJ PUBLISHING GROUP"
        },
        {
            "Title": "Method for enhancing contrast produced by MRI",
            "Publication year": 2005,
            "Publication url": "https://patents.google.com/patent/US6963769B1/en",
            "Abstract": "The following definitions and methods are provided to better define the present invention and to guide those of ordinary skill in the art in the practice of the present invention. It must be noted that as used herein and in the appended claims, the singular forms “a” or “an or “the” include plural referents unless the context clearly dictates otherwise. Thus, for example, reference to “a contrast agent'includes a plurality of Such agents and includes reference to one or more agents and equivalents thereof known to those skilled in the art, and so forth.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "meta-DENSE complex acquisition for reduced intravoxel dephasing",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780704001387",
            "Abstract": "Displacement encoding with stimulated echoes (DENSE) with a meta-DENSE readout and RF phase cycling to suppress the STEAM anti-echo is described for reducing intravoxel dephasing signal loss. This RF phase cycling scheme, when combined with existing meta-DENSE suppression of the T1 recovering signal, yields higher quality DENSE myocardial strain maps. Phantom and human images are provided to demonstrate the technique, which is capable of acquiring phase contrast displacement encoded images at low encoding gradient strengths providing better spatial resolution and less signal loss due to intravoxel dephasing than prior methods.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Simulator-generated training datasets as an alternative to using patient data for machine learning: An example in myocardial segmentation with MRI",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260720316503",
            "Abstract": "Background and Objective: Supervised Machine Learning techniques have shown significant potential in medical image analysis. However, the training data that need to be collected for these techniques in the field of MRI 1) may not be available, 2) may be available but the size is small, 3) may be available but not representative and 4) may be available but with weak labels. The aim of this study was to overcome these limitations through advanced MR simulations on a realistic computer model of human anatomy without using a real MRI scanner, without scanning patients and without having personnel and the associated expenses.Methods: The 4D-XCAT model was used with the coreMRI simulation platform for generating artificial short-axis MR-images for training a neural-network to automatic delineate the LV endocardium and epicardium. Its performance was assessed on real MR-images acquired from eight …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:q3CdL3IzO_QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Diagnostic and prognostic value of adenosine stress MRI in the assessment of chest pain in troponin-negative patients",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=269095573964904186&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:isC4tDSrTZIC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "MRI of the human eye using magnetization transfer contrast enhancement",
            "Publication year": 2000,
            "Publication url": "https://arvojournals.org/article.aspx?articleid=2162239",
            "Abstract": "purpose. To determine the feasibility of using magnetization transfer contrast–enhanced magnetic resonance imaging (MRI) to track cataractous lens changes.methods. A fast spin–echo sequence was modified to include a magnetization transfer contrast (MTC) preparation pulse train. This consisted of twenty 8.5-msec sinc pulses, 1200 Hz upfield from the water resonance and 1.2-Hz power. The MTC preparation pulse was followed by acquisition through fast spin–echo imaging. The imaging parameters were number of excitations (NEX)= 1, echo time (TE)= 14 msec, recovery time (TR)= 2 sec, echo train length of eight echos, and a matrix size of 256× 160. To reduce motion artifacts, the volunteers were asked to fixate on a blinking LED. Normal and MTC-enhanced images were acquired from normal volunteers and volunteers with nuclear or cortical cataracts.results. The eye was adequately imaged, with few motion artifacts appearing. The lens was well resolved, despite the short T 2. The cornea and ciliary body were also clearly visible. In the lens, resolution of the epithelium and cortex were enhanced with MTC. In addition, contrast-to-noise ratios were measured for each image. Examination of the contrast-to-noise ratio confirmed that MTC increased the contrast between the nucleus and cortex. Unenhanced MRIs showed significant differences between the cortex of normal volunteers and volunteers with cataracts. MTC-enhanced images improved the sensitivity to changes in the nucleus.conclusions. In this preliminary study, we were able to use MTC-enhanced MRI to obtain high-contrast images of the human lens. Regular and enhanced …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:aqlVkmm33-oC",
            "Publisher": "The Association for Research in Vision and Ophthalmology"
        },
        {
            "Title": "Quantification of myocardial salvage by myocardial perfusion SPECT and cardiac magnetic resonance—reference standards for ECG development",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022073614001241",
            "Abstract": "In order to determine the cardioprotective efficacy of acute reperfusion therapy, assessed as myocardial salvage, in patients with acute coronary occlusion, the final myocardial infarct (MI) size needs to be related to the amount of ischemic myocardium during coronary occlusion, referred to as the myocardium at risk (MaR). There are currently several imaging approaches available for quantification of both MI size and MaR in vivo of which some have been validated both in pre-clinical and clinical settings. These methods often involve the use of either myocardial perfusion SPECT or cardiac magnetic resonance (CMR). These imaging methods could potentially be used to further develop and validate ECG methods for determination of MI size and MaR. Therefore, the aim of the present review is to give an overview of myocardial perfusion SPECT and CMR methods available for assessment of myocardial salvage by …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:XiVPGOgt02cC",
            "Publisher": "Churchill Livingstone"
        },
        {
            "Title": "A T2-weighted SSFP-TSE hybrid: Gradient Moment Nulling and 180o Refocusing Pulses for Bright Blood Myocardial Edema Imaging",
            "Publication year": 2007,
            "Publication url": "https://kellmanp.github.io/webpages/abstracts/ISMRM2007_CTIDE.pdf",
            "Abstract": "Imaging myocardial edema can differentiate acute from chronic myocardial infarction (MI) and determine the ischemic area at risk (1, 2). The double inversion recovery (DIR) preparation and TSE readout (3) result in suboptimal blood suppression due to reduced motion of blood. Moreover, imperfect positioning of the readout during diastasis can result in signal losses due to through-plane cardiac motion with respect to the DIR preparation.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The overall pattern of cardiac contraction depends on a spatial gradient of myosin regulatory light chain phosphorylation",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0092867401005864",
            "Abstract": "Evolution of the human heart has incorporated a variety of successful strategies for motion used throughout the animal kingdom. One such strategy is to add the efficiency of torsion to compression so that blood is wrung, as well as pumped, out of the heart. Models of cardiac torsion have assumed uniform contractile properties of muscle fibers throughout the heart. Here, we show how a spatial gradient of myosin light chain phosphorylation across the heart facilitates torsion by inversely altering tension production and the stretch activation response. To demonstrate the importance of cardiac light chain phosphorylation, we cloned a myosin light chain kinase from a human heart and have identified a gain-in-function mutation in two individuals with cardiac hypertrophy.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "A new vessel segmentation algorithm for robust blood flow quantification from two‐dimensional phase‐contrast magnetic resonance images",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cpf.12582",
            "Abstract": "Blood flow measurements in the ascending aorta and pulmonary artery from phase‐contrast magnetic resonance images require accurate time‐resolved vessel segmentation over the cardiac cycle. Current semi‐automatic segmentation methods often involve time‐consuming manual correction, relying on user experience for accurate results. The purpose of this study was to develop a semi‐automatic vessel segmentation algorithm with shape constraints based on manual vessel delineations for robust segmentation of the ascending aorta and pulmonary artery, to evaluate the proposed method in healthy volunteers and patients with heart failure and congenital heart disease, to validate the method in a pulsatile flow phantom experiment, and to make the method freely available for research purposes. Algorithm shape constraints were extracted from manual reference delineations of the ascending aorta (n = 20) and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:WZBGuue-350C",
            "Publisher": "Unknown"
        },
        {
            "Title": "1109-103 Clinical characteristics and prevalence of pericardial effusion using cardiac magnetic resonance imaging",
            "Publication year": 2004,
            "Publication url": "https://www.jacc.org/doi/pdf/10.1016/S0735-1097%2804%2990860-1",
            "Abstract": "Background: Endothelial progenitor cells (EPCs) circulate in the adult peripheral blood (PB) and contribute to neovascularization. EPCs are considered to be included in CD34 positive mononuclear cells (CD34+ MNCs). Kinetics of circulating EPCs in congestive heart failure (CHF) has not been fully investigated. Methods: We determined the numbers of WBC and CD34+ MNCs, plasma BNP, serum erythropoietin, VEGF and thrombomodulin levels in 16 mild CHF patients (NYHA I or II), 10 severe CHF patients with acute exacerbation (NYHA III or IV), and 22 control subjects. In severe CHF patients, blood sampling was performed at admission and on 14 days after admission. The number of CD34+ MNCs in PB was quantified by flowcytometry.Results: The ratio of CD34+ MNCs: WBC (x1000) in mild CHF patients (0.462±0.107) was higher than that in control subjects (0.267±0.018, p< 0.05). Interestingly, the ratio of …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:B3FOqHPlNUQC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "073 T2-weighted MRI has high diagnostic accuracy for myocardial haemorrhage in myocardial infarction: a preclinical validation study in swine",
            "Publication year": 2010,
            "Publication url": "https://heart.bmj.com/content/96/Suppl_1/A42.2.abstract",
            "Abstract": "Myocardial haemorrhage after myocardial infarction (MI) frequently goes undetected. Since the paramagnetic effects of oxidised iron may result in signal loss on T2* and T2-weighted MRI, we investigated the diagnostic accuracy of T2-weighted MRI in experimental MI.Acute MI was created in swine (43±9.5 kg) by occluding the left anterior descending coronary artery (n=10) or circumflex (n=5) for 90 min followed by reperfusion for ≤3 days (n=2), 10 days (n=7) or 60 days (n=6). Cardiac MRI was performed at 1.5 T using T2-prepared steady-state free-precession (T2P-SSFP) and gadolinium enhanced (CE) MRI. Left ventricular (LV) sections were visually inspected, photographed and stained for histology. Gross images and histology were scored for myocardial haemorrhage by an experienced cardiac pathologist blinded to all other data. Regions of low signal intensity on T2-weighted and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:D03iK_w7-QYC",
            "Publisher": "BMJ Publishing Group Ltd and British Cardiovascular Society"
        },
        {
            "Title": "Dynamic fetal cardiovascular magnetic resonance imaging using Doppler ultrasound gating",
            "Publication year": 2018,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-018-0440-4",
            "Abstract": "Fetal cardiovascular magnetic resonance (CMR) imaging may provide a valuable adjunct to fetal echocardiography in the evaluation of congenital cardiovascular pathologies. However, dynamic fetal CMR is difficult due to the lack of direct in-utero cardiac gating. The aim of this study was to investigate the effectiveness of a newly developed Doppler ultrasound (DUS) device in humans for fetal CMR gating. Fifteen fetuses (gestational age 30–39 weeks) were examined using 1.5 T CMR scanners at three different imaging sites. A newly developed CMR-compatible DUS device was used to generate gating signals from fetal cardiac motion. Gated dynamic balanced steady-state free precession images were acquired in 4-chamber and short-axis cardiac views. Gating signals during data acquisition were analyzed with respect to trigger variability and sensitivity. Image quality was assessed by measuring endocardial blurring (EB) and by image evaluation using a 4-point scale. Left ventricular (LV) volumetry was performed using the single-plane ellipsoid model. Gating signals from the fetal heart were detected with a variability of 26 ± 22 ms and a sensitivity of trigger detection of 96 ± 4%. EB was 2.9 ± 0.6 pixels (4-chamber) and 2.5 ± 0.1 pixels (short axis). Image quality scores were 3.6 ± 0.6 (overall), 3.4 ± 0.7 (mitral valve), 3.4 ± 0.7 (foramen ovale), 3.6 ± 0.7 (atrial septum), 3.7 ± 0.5 (papillary muscles), 3.8 ± 0.4 (differentiation myocardium/lumen), 3.7 ± 0.5 (differentiation myocardium/lung), and 3.9 ± 0.4 (systolic myocardial thickening). Inter-observer agreement for the scores was moderate to very good (kappa 0.57–0.84 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:ILKRHgRFtOwC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Quantitative T1-maps delineate myocardium at risk as accurately as T2-maps-experimental validation with microspheres",
            "Publication year": 2011,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-13-S1-O62",
            "Abstract": "PurposeTo validate and determine the accuracy for using in vivo T1 mapping or T2 mapping for determining myocardium at risk, compared to blood flow quantification at coronary occlusion by microspheres.MethodsDogs (n= 12) underwent coronary occlusion (2 hours), during which microspheres were injected into the left atrium, followed by reperfusion (4 hours). The entire left ventricle was imaged at 1.5 T (Siemens) in contiguous short-axis slices with a Modified Look-Locker Inversion-recovery sequence for T1 mapping (Messroghli, JMRI, 2007), and a T2-prepared SSFP sequence for T2 mapping (Giri, JCMR, 2009). Myocardium at risk was defined as regions in the left ventricle which had a T1 or T2 value greater than 2SD from remote. In four dogs, hearts were excised and blood flow (ml/min/g) was determined by microsphere analysis in 16 sectors per short-axis slice for all short-axis slices in the left ventricle. Myocardium at risk was defined as regions in the left ventricle with a blood flow at occlusion less than 2SD from remote.ResultsGlobal myocardium at risk, expressed as percent of left ventricular mass (% LVM), showed similar results for T1 mapping compared to T2 mapping (n= 12, mean+/-SD difference 1.5+/-4.0% LVM, R2= 0.86, p< 0.001). On a slice-by-slice basis (n= 4 dogs, 34 slices), myocardium at risk was also similar for T1 and T2 mapping (difference 0.4+/-7.6% of slice, R2= 0.96, p< 0.001), T1 mapping corresponded to microsphere analysis (mean difference 2.0+/-12.8% of slice, R2= 0.90, p< 0.001), and T2 mapping corresponded to microsphere analysis (mean difference 1.6+/-13.8% of slice, R2= 0.86, p< 0.001). Figure 1.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:R3hNpaxXUhUC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Simulating MR imaging for the human embryonic heart",
            "Publication year": 2015,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-17-S1-P48",
            "Abstract": "BackgroundMRI has evolved to become a safe diagnostic imaging tool for prenatal care. Recent studies have demonstrated its applications in early diagnosis of congenital heart anomalies (Loomba et al. 2011). However, in vivo embryonic MRI presents obstacles associated with small sample size, RF field profile distortion, RF exposure limits, motion etc. Therefore, small structures such as the heart are difficult to image.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:tkaPQYYpVKoC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Myocardial strain decreases with increasing transmurality of infarction: a Doppler echocardiographic and magnetic resonance correlation study",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0894731705006759",
            "Abstract": "Regional abnormalities in myocardial systolic function can be detected with myocardial strain measurements derived from Doppler tissue echocardiography. We studied longitudinal strain measurements in patients with evidence of myocardial infarction by cardiac magnetic resonance imaging to determine whether end-systolic strain could identify the severity of the infarction.A total of 20 patients with chronic myocardial infarctions and 10 healthy volunteers underwent 2-dimensional echocardiography and cardiac magnetic resonance with delayed gadolinium (Gd) gadopentetate dimeglumine (DTPA) contrast hyperenhancement. Delayed Gd hyperenhancement was graded using the following scale: 0 = none, 1 = less than 25%, 2 = 26% to 50%, 3 = 51% to 75%, and 4 = greater than 75%.There was a progressive decrease in peak systolic strain in the infarct segments as the transmural …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:M3ejUd6NZC8C",
            "Publisher": "Mosby"
        },
        {
            "Title": "Late gadolinium-enhancement cardiac magnetic resonance identifies postinfarction myocardial fibrosis and the border zone at the near cellular level in ex vivo rat heart",
            "Publication year": 2010,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/CIRCIMAGING.108.835793",
            "Abstract": "Using a resolution 1000-fold higher than prior studies, we studied (1) the degree to which late gadolinium-enhancement (LGE) cardiac magnetic resonance tracks fibrosis from chronic myocardial infarction and (2) the relationship between intermediate signal intensity and partial volume averaging at distinct “smooth” infarct borders versus disorganized mixtures of fibrosis and viable cardiomyocytes.Sprague-Dawley rats underwent myocardial infarction by coronary ligation. Two months later, rats were euthanized 10 minutes after administration of 0.3 mmol/kg intravenous gadolinium. LGE images ex vivo at 7 T with a 3D gradient echo sequence with 50×50×50 μm voxels were compared with histological sections (Masson trichrome). Planimetered histological and LGE regions of fibrosis correlated well (y=1.01x−0.01; R2=0.96; P<0.001). In addition, LGE images routinely detected …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:0EnyYjriUFMC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Myocardial edema as detected by pre-contrast T1 and T2 CMR delineates area at risk associated with acute myocardial infarction",
            "Publication year": 2012,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jcmg.2012.01.016",
            "Abstract": "The aim of this study was to determine whether cardiac magnetic resonance (CMR) in vivo T1 mapping can measure myocardial area at risk (AAR) compared with microspheres or T2 mapping CMR.If T2-weighted CMR is abnormal in the AAR due to edema related to myocardial ischemia, then T1-weighted CMR should also be able to detect and accurately quantify AAR.Dogs (n = 9) underwent a 2-h coronary occlusion followed by 4 h of reperfusion. CMR of the left ventricle was performed for mapping of T1 and T2 prior to any contrast administration. AAR was defined as regions that had a T1 or T2 value (ms) >2 SD from remote myocardium, and regions with microsphere blood flow (ml/min/g) during occlusion <2 SD from remote myocardium. Infarct size was determined by triphenyltetrazolium chloride staining.The relaxation parameters T1 and T2 were increased in the …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:Zph67rFs4hoC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Multi-vendor, multicentre comparison of contrast-enhanced SSFP and T2-STIR CMR for determining myocardium at risk in ST-elevation myocardial infarction",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/ehjcimaging/article-abstract/17/7/744/2571144",
            "Abstract": "Myocardial salvage, determined by cardiac magnetic resonance imaging (CMR), is used as end point in cardioprotection trials. To calculate myocardial salvage, infarct size is related to myocardium at risk (MaR), which can be assessed by T2-short tau inversion recovery (T2-STIR) and contrast-enhanced steady-state free precession magnetic resonance imaging (CE-SSFP). We aimed to determine how T2-STIR and CE-SSFP perform in determining MaR when applied in multicentre, multi-vendor settings.               A total of 215 patients from 17 centres were included after percutaneous coronary intervention (PCI) for ST-elevation myocardial infarction. CMR was performed within 1–8 days. These patients participated in the MITOCARE or CHILL-MI cardioprotection trials. Additionally, 8 patients from a previous study, imaged 1 day post-CMR, were …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:_Ybze24A_UAC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Multishot EPI‐SSFP in the heart",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.10105",
            "Abstract": "Refocused steady‐state free precession (SSFP), or fast imaging with steady precession (FISP or TrueFISP), has recently proven valuable for cardiac imaging because of its high signal‐to‐noise ratio (SNR) and excellent blood–myocardium contrast. In this study, various implementations of multiecho SSFP or EPI‐SSFP for imaging in the heart are presented. EPI‐SSFP has higher scan‐time efficiency than single‐echo SSFP, as two or more phase‐encode lines are acquired per repetition time (TR) at the cost of a modest increase in TR. To minimize TR, a noninterleaved phase‐encode order in conjunction with a phased‐array ghost elimination (PAGE) technique was employed, removing the need for echo time shifting (ETS). The multishot implementation of EPI‐SSFP was used to decrease the breath‐hold duration for cine acquisitions or to increase the temporal or spatial resolution for a fixed breath‐hold duration …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "ACUT2E TSE‐SSFP: A hybrid method for T2‐weighted imaging of edema in the heart",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.21490",
            "Abstract": "ACUT2E TSE‐SSFP is a hybrid between steady state free precession (SSFP) and turbo spin echo (TSE) for bright‐blood T2‐weighted imaging with signal‐to‐noise ratio (SNR) and contrast‐to‐noise ratio (CNR) similar to dark‐blood TSE. TSE‐SSFP uses a segmented SSFP readout during diastole with 180° pulses following a 90° preparation. The 180° refocusing pulses make TSE‐SSFP similar to TSE but TSE‐SSFP uses gradient moment nulling, whereas TSE uses gradient crushing. TSE‐SSFP produced T2‐weighted images with minimal T1 weighting. TSE‐SSFP and TSE had similar SNR (155.9 ± 6.0 vs 160.9 ± 7.0; P = NS) for acute myocardial infarction (MI) and twice the SNR of T2‐prepared SSFP (73.1 ± 3.4, P < 0.001). TSE‐SSFP and TSE had approximately double the CNR of T2‐prepared SSFP for differentiating acute MI from normal myocardium. Imperfect blood suppression, present in all animals on …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Fully quantitative cardiovascular magnetic resonance myocardial perfusion ready for clinical use: a comparison between cardiovascular magnetic resonance imaging and positron emission tomography",
            "Publication year": 2017,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-017-0388-9",
            "Abstract": "Recent studies have shown that quantification of myocardial perfusion (MP) at stress and myocardial perfusion reserve (MPR) offer additional diagnostic and prognostic information compared to qualitative and semi-quantitative assessment of myocardial perfusion distribution in patients with coronary artery disease (CAD). Technical advancements have enabled fully automatic quantification of MP using cardiovascular magnetic resonance (CMR) to be performed in-line in a clinical workflow. The aim of this study was to validate the use of the automated CMR perfusion mapping technique for quantification of MP using 13N–NH3 cardiac positron emission tomography (PET) as the reference method. Twenty-one patients with stable CAD were included in the study. All patients underwent adenosine stress and rest perfusion imaging with 13N–NH3 PET and a dual sequence, single contrast bolus CMR on the same day. Global and regional MP were quantified both at stress and rest using PET and CMR. There was good agreement between global MP quantified by PET and CMR both at stress (−0.1 ± 0.5 ml/min/g) and at rest (0 ± 0.2 ml/min/g) with a strong correlation (r = 0.92, p < 0.001; y = 0.94× + 0.14). Furthermore, there was strong correlation between CMR and PET with regards to regional MP (r = 0.83, p < 0.001; y = 0.87× + 0.26) with a good agreement (−0.1 ± 0.6 ml/min/g). There was also a significant correlation between CMR and PET with regard to global and regional MPR (r = 0.69, p = 0.001 and r = 0.57, p < 0.001, respectively). There is good agreement between MP quantified by 13N–NH3 PET and dual …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:epqYDVWIO7EC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Parallel simulations for QUAntifying RElaxation magnetic resonance constants (SQUAREMR): an example towards accurate MOLLI T1 measurements",
            "Publication year": 2015,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-015-0206-1",
            "Abstract": "T1 mapping is widely used today in CMR, however, it underestimates true T1 values and its measurement error is influenced by several acquisition parameters. The purpose of this study was the extraction of accurate T1 data through the utilization of comprehensive, parallel Simulations for QUAntifying RElaxation Magnetic Resonance constants (SQUAREMR) of the MOLLI pulse sequence on a large population of spins with physiologically relevant tissue relaxation constants. A CMR protocol consisting of different MOLLI schemes was performed on phantoms and healthy human volunteers. For every MOLLI experiment, the identical pulse sequence was simulated for a large range of physiological combinations of relaxation constants, resulting in a database of all possible outcomes. The unknown relaxation constants were then determined by finding the simulated signals in the database that produced the least squared difference to the measured signal intensities. SQUAREMR demonstrated improvement of accuracy in phantom studies and consistent mean T1 values and consistent variance across the different MOLLI schemes in humans. This was true even for tissues with long T1s and MOLLI schemes with no pause between modified-Look-Locker experiments. SQUAREMR enables quantification of T1 data obtained by existing clinical pulse sequences. SQUAREMR allows for correction of quantitative CMR data that have already been acquired whereas it is expected that SQUAREMR may improve data consistency and advance quantitative MR across imaging centers, vendors and experimental configurations. While this study is focused on a …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:PR6Y55bgFSsC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Recruitable coronary collateral supply and left ventricular stiffness are linked in acute myocardial infarction in swine",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=1677220816870205256&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:rO6llkc54NcC",
            "Publisher": "BMJ PUBLISHING GROUP"
        },
        {
            "Title": "Artifact suppression in imaging of myocardial infarction using B1‐weighted phased‐array combined phase‐sensitive inversion recovery†",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.10689",
            "Abstract": "Regions of the body with long T1, such as cerebrospinal fluid (CSF), may create ghost artifacts on gadolinium‐hyperenhanced images of myocardial infarction when inversion recovery (IR) sequences are used with a segmented acquisition. Oscillations in the transient approach to steady state for regions with long T1 may cause ghosts, with the number of ghosts being equal to the number of segments. B1‐weighted phased‐array combining provides an inherent degree of ghost artifact suppression because the ghost artifact is weighted less than the desired signal intensity by the coil sensitivity profiles. Example images are shown that illustrate the suppression of CSF ghost artifacts by the use of B1‐weighted phased‐array combining of multiple receiver coils. Magn Reson Med 51:408–412, 2004. Published 2004 Wiley‐Liss, Inc.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:4DMP91E08xMC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Delayed enhancement of the Peri-Infarct Border Zone is Signficantly Affected by Partial Volume Averaging: Insights from ex vivo Rat Heart Images at Near-Cellular Resolution",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Stasia-Anderson/publication/268292649_Delayed_Enhancement_of_the_Peri-Infarct_Border_Zone_is_Significantly_Affected_by_Partial_Volume_Averaging_Insights_from_ex_vivo_Rat_Heart_Images_at_a_Near-Cellular_Resolution/links/55ca5d6f08aeb975674a4b8b/Delayed-Enhancement-of-the-Peri-Infarct-Border-Zone-is-Significantly-Affected-by-Partial-Volume-Averaging-Insights-from-ex-vivo-Rat-Heart-Images-at-a-Near-Cellular-Resolution.pdf",
            "Abstract": "Methods: 8 week old Sprague Dawley rats (n= 6) were submitted to 60-minutes of coronary ligation to create myocardial infarct model. Ex vivo MRI was performed on a 7T scanner (Bruker, Billerica, MA) 2 months later. All animals were given Gd-DTPA (0.3 mmol/kg) through a tail vein catheter and euthanized 10 minutes later to lock in the physiological distribution of gadolinium at that time point. A T1-weighted 3D gradient echo sequence was used: TR/TE= 20/3.0 ms, flip angle 30 degree, FOV 1.3 x1. 0x1. 0 cm, matrix 256x192x192, resolution 50x52x52 microns, 3 averages, 36 minutes of acquisition time per dataset. Histological slices were stained by Masson’s trichrome to indicate the regions of myocardial infarction. Corresponding MR images were resliced in 3D to match the histological slices for qualitative comparison. Low resolution images were reconstructed post-hoc by using only 32 k-space lines and averaging 16 image slices to produce a voxel 2048 times larger than the original high resolution images (which is still> 100 times better than current clinical resolution). Quantification of infarct volume was performed by an automated program using a 50% intensity threshold between dark normal and bright enhanced voxels [4]. Additional volume measurements of contrast enhancement were performed by using a two standard deviations (2xSD) threshold above the normal voxel intensity. The peri-infarct border zone was defined as the voxel space between 2xSD and 50% threshold regions. Both high resolution raw image and reconstructed lower resolution image dataset were processed with the same settings.Results: The average volume …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MR photography of 3D-MR images",
            "Publication year": 2016,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-18-S1-P33",
            "Abstract": "BackgroundLate gadolinium enhancement MRI (LGE-MRI) has become the gold standard for assessing myocardial infarction size. In experimental infarct validation studies the left ventricle is often sliced into thin slices and subsequently stained with TTC as a gold standard for infarct quantification. There is no single imaging slice in a 3D-MR data stack that exactly represents the photographed TTC-stained slice or whole slice microscopy as the photograph is of a surface. Therefore, we developed a method for post-processing 3D-MR data to depict the exact same surface as seen on a traditionally photographed myocardial slice.MethodsThe image analysis software Segment [1] v1. 9 (http://segment. heiberg. se) was used as a platform for implementing a script enabling MR-photography. The post-processing method was validated on ex-vivo contrast enhanced images rendered from an experimental chronic occlusion-reperfusion pig model (n= 8). In this model the hearts were explanted after seven days of reperfusion and the left ventricle sliced into 5 mm thin slices. The slices were then stained with TTC and subsequently imaged on 1.5 T Philips Achieva scanner using a high resolution T1 weighed MRI sequence (TE= 3.2 ms, TE= 2 ms, α= 70, isotropic resolution 0.5 mm). Using a manually defined threshold air was nulled for every pixel in the output image and the intensity one pixel below the detected tissue surface was taken. The purpose of taking one pixel below was to remove partial volume effects in the transition between tissue and air. The image yielded from the post-processing was compared quantitatively against photographed TTC …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:NJ774b8OgUMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "In vivo 1H double quantum filtered MRI of the human wrist and ankle ",
            "Publication year": 2000,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/(SICI)1522-2594(200005)43:5%3C640::AID-MRM4%3E3.0.CO;2-W",
            "Abstract": "Proton double quantum filtered (DQF) NMR imaging was applied in vivo to the human wrist and ankle with a clinical 1.5 T MR scanner. Water molecules having anisotropic motion were detected from tendons and ligaments. Images of Achilles tendon were obtained for a voxel size of 1.25 × 1.25 × 20 mm with three values of TR = 1.0, 0.5, and 0.2 sec, resulting in total acquisitions time of 17, 8.5, and 3.4 mins, respectively. Some degradation of the signal‐to‐noise ratio was observed at the shortest TR value and the contrast was significantly reduced due to SQ coherence leakage. The in vivo DQF images showed structure within the tendon that is otherwise not visible by conventional gradient‐recalled echo (GRE) methods. Magn Reson Med 43:640–644, 2000. Published 2000 Wiley‐Liss, Inc.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:ZeXyd9-uunAC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "1054-151 Aortic gadolinium enhancement is associated with myocardial infarction, aging, and decreased aortic distensibility",
            "Publication year": 2004,
            "Publication url": "https://www.jacc.org/doi/pdf/10.1016/S0735-1097%2804%2991359-9",
            "Abstract": "Background: Previous studies have demonstrated that myocardial acceleration during isovolumic (IVCa) and systolic contraction (SCa) is useful in estimating systolic function. In this study, we assessed the usefulness of IVCa, SCa, acceleration during isovolumic diastolic (IVRTa) and early diastolic relaxation (Ea) for detecting systolic and diastolic dysfunction in an experimental ischemic model. Methods and Results: In 12 open-chest anesthetized dogs, a coronary electrolytic injury thrombosis model of left circumflex coronary artery (LCx) was created. Real-time Harmonic Contrast Echocardiography in apical 4-, 2-chamber views were acquired using a commercially available echocardiographic machine (Vivid 7, GE). Using the analytical software (Echo Pac), velocity acceleration was measured from the left ventricular lateral wall using tissue Doppler echocardiography at baseline and after thrombosis. There were …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:UxriW0iASnsC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Diagnostic accuracy of fully quantitative, semi-quantitative, and qualitative assessment of stress perfusion CMR compared to quantitative coronary angiography",
            "Publication year": 2014,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc4186701/",
            "Abstract": "ObjectiveOur primary objective was to determine the sensitivity, specificity, and accuracy of fully quantitative stress perfusion CMR versus a reference standard of quantitative coronary angiography (QCA). We hypothesized that fully quantitative analysis of stress perfusion CMR would have high diagnostic accuracy for identifying significant coronary artery stenosis and exceed the accuracy of semi-quantitative measures of perfusion and qualitative interpretation.BackgroundRelatively few studies apply fully quantitative CMR perfusion measures to patients with coronary disease and comparisons to semi-quantitative and qualitative methods are limited.MethodsDual bolus dipyridamole stress perfusion CMR exams were performed in 67 patients with clinical indications for assessment of myocardial ischemia. Stress perfusion images alone were analyzed with a fully quantitative method (QP) and 3 semi-quantitative …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:AXPGKjj_ei8C",
            "Publisher": "NIH Public Access"
        },
        {
            "Title": "Retrospective determination of the area at risk for reperfused acute myocardial infarction with T2-weighted cardiac magnetic resonance imaging: histopathological and displacement encoding with stimulated echoes (DENSE) functional validations",
            "Publication year": 2006,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circulationaha.105.576025",
            "Abstract": "Background— The aim of this study was to determine whether edema imaging by T2-weighted cardiac magnetic resonance (CMR) imaging could retrospectively delineate the area at risk in reperfused myocardial infarction. We hypothesized that the size of the area at risk during a transient occlusion would be similar to the T2-weighted hyperintense region observed 2 days later, that the T2-weighted hyperintense myocardium would show partial functional recovery after 2 months, and that the T2 abnormality would resolve over 2 months.Methods and Results— Seventeen dogs underwent a 90-minute coronary artery occlusion, followed by reperfusion. The area at risk, as measured with microspheres (9 animals), was comparable to the size of the hyperintense zone on T2-weighted images 2 days later (43.4±3.3% versus 43.0±3.4% of the left ventricle; P=NS), and the 2 measures correlated (R=0.84). The infarcted …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Cardiovascular magnetic resonance in myocarditis: A JACC White Paper",
            "Publication year": 2009,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jacc.2009.02.007",
            "Abstract": "Cardiovascular magnetic resonance (CMR) has become the primary tool for noninvasive assessment of myocardial inflammation in patients with suspected myocarditis. The International Consensus Group on CMR Diagnosis of Myocarditis was founded in 2006 to achieve consensus among CMR experts and develop recommendations on the current state-of-the-art use of CMR for myocarditis. The recommendations include indications for CMR in patients with suspected myocarditis, CMR protocol standards, terminology for reporting CMR findings, and diagnostic CMR criteria for myocarditis (i.e., “Lake Louise Criteria”).",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:u-x6o8ySG0sC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Importance of standardizing timing of hematocrit measurement when using cardiovascular magnetic resonance to calculate myocardial extracellular volume (ECV) based on pre-and post-contrast T1 mapping",
            "Publication year": 2018,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-018-0464-9",
            "Abstract": "Cardiovascular magnetic resonance (CMR) can be used to calculate myocardial extracellular volume fraction (ECV) by relating the longitudinal relaxation rate in blood and myocardium before and after contrast-injection to hematocrit (Hct) in blood. Hematocrit is known to vary with body posture, which could affect the calculations of ECV. The aim of this study was to test the hypothesis that there is a significant increase in calculated ECV values if the Hct is sampled after the CMR examination in supine position compared to when the patient arrives at the MR department. Forty-three consecutive patients including various pathologies as well as normal findings were included in the study. Venous blood samples were drawn upon arrival to the MR department and directly after the examination with the patient remaining in supine position. A Modified Look-Locker Inversion recovery (MOLLI) protocol was used to acquire mid-ventricular short-axis images before and after contrast injection from which motion-corrected T1 maps were derived and ECV was calculated. Hematocrit decreased from 44.0 ± 3.7% before to 40.6 ± 4.0% after the CMR examination (p < 0.001). This resulted in a change in calculated ECV from 24.7 ± 3.8% before to 26.2 ± 4.2% after the CMR examination (p < 0.001). All patients decreased in Hct after the CMR examination compared to before except for two patients whose Hct remained the same. Variability in CMR-derived myocardial ECV can be reduced by standardizing the timing of Hct measurement relative to the CMR examination. Thus, a standardized acquisition of blood sample for Hct after the CMR examination …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:KUbvn5osdkgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Mixed echo train acquisition displacement encoding with stimulated echoes: an optimized DENSE method for in vivo functional imaging of the human heart",
            "Publication year": 2001,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.1223",
            "Abstract": "Mixed echo train acquisition displacement encoding with stimulated echoes (meta‐DENSE) is a phase‐based displacement mapping technique suitable for imaging myocardial function. This method has been optimized for use with patients who have a history of myocardial infarction. The total scan time is 12–14 heartbeats for an in‐plane resolution of 2.8 × 2.8 mm2. Myocardial strain is mapped at this resolution with an accuracy of 2% strain in vivo. Compared to standard stimulated echo (STE) methods, both data acquisition speed and resolution are improved with inversion‐recovery FID suppression and the meta‐DENSE readout scheme. Data processing requires minimal user intervention and provides a rapid quantitative feedback on the MRI scanner for evaluating cardiac function. Magn Reson Med 46:523–534, 2001. Published 2001 Wiley‐Liss, Inc.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:WF5omc3nYNoC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Non-contrast quantitative T1-mapping indicates that salvaged myocardium develops edema during coronary occlusion, whereas infarction exhibits evidence of additional reperfusion injury",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1532-429X-13-S1-O63",
            "Abstract": "PurposeTo quantitatively assess if salvaged myocardium develops edematous changes during coronary occlusion, but not reperfusion injury as can be seen in infarction.MethodsDogs (n= 9) underwent coronary occlusion and reperfusion to delineate the time course of development of changes in non-contrast T1 abnormalities. T1 was quantified by 1.5 T CMR (Siemens) using a Modified Look-Locker Inversion Recovery (MOLLI) sequence. T2-prepared SSFP (T2p) and LGE images were acquired at the end of the experiment to define 1) Infarction [LGE positive], 2) Salvaged myocardium [T2p positive and LGE negative] and 3) Remote [T2p and LGE negative]. Myocardium which ultimately ended being classified into these three tissue types was identified, and T1 was quantified over time starting from baseline prior to occlusion.ResultsSee Figure 1. During occlusion, T1 increased in tissue which ultimately became …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:dshw04ExmUIC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Fetal iGRASP cine CMR assisting in prenatal diagnosis of complicated cardiac malformation with impact on delivery planning",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cpf.12566",
            "Abstract": "Limited visualization of the fetal heart and vessels by fetal ultrasound due to suboptimal fetal position, patient habitus and skeletal calcification may lead to missed diagnosis, overdiagnosis and parental uncertainty. Counselling and delivery planning may in those cases also be tentative. The recent fetal cardiac magnetic resonance (CMR) reconstruction method utilizing tiny golden‐angle iGRASP (iterative Golden‐angle RAdial Sparse Parallel MRI) allows for cine imaging of the fetal heart for use in clinical practice. This case describes an unbalanced common atrioventricular canal where limited ultrasound image quality and visibility of the aortic arch precluded confirming or ruling out presence of a ventricular septal defect. Need of prostaglandins or neonatal intervention was thus uncertain. Cardiovascular magnetic resonance imaging confirmed ultrasound findings and added value by ruling out a significant …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fetal magnetic resonance image denoising based on homogeneity testing and Non Local Means",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7408656/",
            "Abstract": "A novel edge-preserving denoising method for MR images is proposed. Local statistical homogeneity testing is combined with the well-known for structure preserving properties, Non Local Means (NLM) denoising method. The detection of homogeneity reduces remarkably the computational effort required by NLM which is applied only to information-rich image areas. Preliminary qualitative results on fetal and cardiac MR images are shown. These initial results are positive proving the effective noise reduction with less computational load.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Infarct size needed to cause adverse left ventricular remodeling in humans: A magnetic resonance imaging study",
            "Publication year": 2003,
            "Publication url": "https://www.jacc.org/doi/pdf/10.1016/S0735-1097%2803%2982586-X",
            "Abstract": "Background: Myocardial infarct (Ml) size by contrast enhanced MRI (CE-MRI) is directly related to long-term prognosis. However, previous measurements were non-uniform and overestimate TTC infarct size. The purpose of this study was to identify the most accurate method to define Ml size by CE-MRI.Methods: Nine dogs underwent SO minutes of closed chest coronary artery occlusion. followed by reperfusion. CE-MRI was acquired 24 hours afler repeffusion and compared with post-mortem TTC staining. Images were obtained 15 min after Gd-DTPA (0.2 mmoll",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:BqipwSGYUEgC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Magnetic resonance imaging delineates the ischemic area at risk and myocardial salvage in patients with acute myocardial infarction",
            "Publication year": 2010,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circimaging.109.900761",
            "Abstract": "The area at risk (AAR) is a key determinant of myocardial infarction (MI) size. We investigated whether magnetic resonance imaging (MRI) measurement of AAR would be correlated with an angiographic AAR risk score in patients with acute MI.Bright-blood, T2-prepared, steady-state, free-precession MRI was used to depict the AAR in 50 consecutive acute MI patients, whereas infarct size was measured on gadolinium late-contrast-enhancement images. AAR was also estimated by the APPROACH and DUKE angiographic jeopardy scores and ST-segment elevation score. Myocardial salvage was calculated as AAR minus infarct size. Results are mean±SD unless specified otherwise. Patients were 61±12 years of age, 76% had an ST-segment elevation MI, and 20% had a prior MI. All underwent MRI 4±2 days after initial presentation. The relation between MRI and the …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:UebtZRa9Y70C",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "T measurement during first‐pass contrast‐enhanced cardiac perfusion imaging",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.21061",
            "Abstract": "First‐pass contrast‐enhanced (CE) myocardial perfusion imaging will experience T effects at peak concentrations of contrast agent. A reduction in the signal intensity of left ventricular (LV) blood due to T losses may effect estimates of the arterial input function (AIF) used for quantitative perfusion measurement. Imaging artifacts may also result from T losses as well as off‐resonance due to the bolus susceptibility. We hypothesized that T losses would not be significant for measurement of the AIF in full‐dose studies using a short echo time (TE = 0.6 ms). The purpose of this study was to directly measure T in the LV cavity during first‐pass perfusion. For single‐dose Gd‐DTPA (0.1 mmol/kg at 5 ml/s), the LV blood pool T had a mean value of 9 ms (N = 10) at peak enhancement. Distortion of the AIF due to T signal intensity loss will be less than 10% using TE = 0.6 ms. Magn Reson Med, 2006. Published 2006 Wiley‐Liss …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Prevalence and prognosis of unrecognized myocardial infarction determined by cardiac magnetic resonance in older adults",
            "Publication year": 2012,
            "Publication url": "https://jamanetwork.com/journals/jama/article-abstract/1356354",
            "Abstract": "ContextUnrecognized myocardial infarction (MI) is prognostically important. Electrocardiography (ECG) has limited sensitivity for detecting unrecognized MI (UMI).ObjectiveDetermine prevalence and mortality risk for UMI detected by cardiac magnetic resonance (CMR) imaging or ECG among older individuals.Design, Setting, and ParticipantsICELAND MI is a cohort substudy of the Age, Gene/Environment Susceptibility–Reykjavik Study (enrollment January 2004-January 2007) using ECG or CMR to detect UMI. From a community-dwelling cohort of older individuals in Iceland, data for 936 participants aged 67 to 93 years were analyzed, including 670 who were randomly selected and 266 with diabetes.Main Outcome MeasuresPrevalence and mortality of MI through September 1, 2011. Results reported with 95% confidence limits and net reclassification improvement (NRI).ResultsOf 936 participants, 91 had …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:ULOm3_A8WrAC",
            "Publisher": "American Medical Association"
        },
        {
            "Title": "A gradient of myosin regulatory light-chain phosphorylation across the ventricular wall supports cardiac torsion",
            "Publication year": 2002,
            "Publication url": "http://symposium.cshlp.org/content/67/345.short",
            "Abstract": "Therefore, we were struck by the occurrence of the same mid-cavity phenotype in a child whom we found to have an adjacent ELC R154H mutation. The variant functional studies and cardiac morphology suggested a unique role for this portion of the molecule that might be consistent with a lever arm model of myosin motor activity. The subsequent search for mutations in the adjacent myosin regulatory light chain (RLC) was an obvious step and disclosed 2 unrelated individuals with an E22K RLC mutation showing the same rare mid-cavity cardiac morphology. Subsequently, additional individuals with HCM were found with either a P95R or an A13T RLC mutation (Poetter et al. 1996).",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Cold Spring Harbor Laboratory Press"
        },
        {
            "Title": "Free‐breathing fetal cardiac MRI with doppler ultrasound gating, compressed sensing, and motion compensation",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.26842",
            "Abstract": "Fetal cardiovascular MRI complements ultrasound to assess fetal cardiovascular pathophysiology.To develop a free‐breathing method for retrospective fetal cine MRI using Doppler ultrasound (DUS) cardiac gating and tiny golden angle radial sampling (tyGRASP) for accelerated acquisition capable of detecting fetal movements for motion compensation.Feasibility study.Nine volunteers (gestational week 34–40). Short‐axis and four‐chamber views were acquired during maternal free‐breathing and breath‐hold.1.5T cine balanced steady‐state free precession.A self‐gated reconstruction method was improved for clinical application by using 1) retrospective DUS gating, and 2) motion detection and rejection/correction algorithms for compensating for fetal motion. The free‐breathing reconstructions were qualitatively and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:-FonjvnnhkoC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Extent of myocardium at risk for left anterior descending artery, right coronary artery, and left circumflex artery occlusion depicted by contrast-enhanced steady state free precession and T2-weighted short tau inversion recovery magnetic resonance imaging",
            "Publication year": 2016,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circimaging.115.004376",
            "Abstract": "Contrast-enhanced steady state free precession (CE-SSFP) and T2-weighted short tau inversion recovery (T2-STIR) have been clinically validated to estimate myocardium at risk (MaR) by cardiovascular magnetic resonance while using myocardial perfusion single-photon emission computed tomography as reference standard. Myocardial perfusion single-photon emission computed tomography has been used to describe the coronary perfusion territories during myocardial ischemia. Compared with myocardial perfusion single-photon emission computed tomography, cardiovascular magnetic resonance offers superior image quality and practical advantages. Therefore, the aim was to describe the main coronary perfusion territories using CE-SSFP and T2-STIR cardiovascular magnetic resonance data in patients after acute ST-segment–elevation myocardial infarction.CE …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:35r97b3x0nAC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Self‐gated fetal cardiac MRI with tiny golden angle iGRASP: A feasibility study",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.25599",
            "Abstract": "To develop and assess a technique for self‐gated fetal cardiac cine magnetic resonance imaging (MRI) using tiny golden angle radial sampling combined with iGRASP (iterative Golden‐angle RAdial Sparse Parallel) for accelerated acquisition based on parallel imaging and compressed sensing.Fetal cardiac data were acquired from five volunteers in gestational week 29–37 at 1.5T using tiny golden angles for eddy currents reduction. The acquired multicoil radial projections were input to a principal component analysis‐based compression stage. The cardiac self‐gating (CSG) signal for cardiac gating was extracted from the acquired radial projections and the iGRASP reconstruction procedure was applied. In all acquisitions, a total of 4000 radial spokes were acquired within a breath‐hold of less than 15 seconds using a balanced steady‐state free precession pulse sequence …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Regional stress-induced ischemia in non-fibrotic hypertrophied myocardium in young HCM patients",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00246-015-1214-5",
            "Abstract": "The relationship between hypertrophy, perfusion abnormalities and fibrosis is unknown in young patients with hypertrophic cardiomyopathy (HCM). Since mounting evidence suggests causal relationship between myocardial ischemia and major adverse cardiac events, we sought to investigate whether (1) regional myocardial perfusion is decreased in young HCM patients and in individuals at risk of HCM, and (2) hypoperfused areas are larger than areas with fibrosis. HCM patients (n = 12), HCM-risk subjects (n = 15) and controls (n = 9) were imaged on a 1.5 T MRI scanner. Myocardial hypertrophy was assessed on cine images. Perfusion images were acquired during adenosine hyperemia and at rest. Maximum upslope ratios of perfusion (stress/rest) were used for semiquantitative analysis. Fibrosis was assessed by late gadolinium enhancement (LGE). Results are presented as median and range …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:LjlpjdlvIbIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "In vivo T2-weighted magnetic resonance imaging can accurately determine the ischemic area at risk for 2-day-old nonreperfused myocardial infarction",
            "Publication year": 2008,
            "Publication url": "https://journals.lww.com/investigativeradiology/Fulltext/2008/01000/Comparison_of_the_Extent_of_Delayed_Enhancement.2.aspx",
            "Abstract": "Objectives:To determine whether in vivo T2-weighted cardiac magnetic resonance imaging (MRI) delineates the area at risk (AAR) in 2-day-old nonreperfused myocardial infarction (MI). AAR was defined as the size of the perfusion defect on day 0. MI and the residual ischemic viable border zone comprise the AAR.Materials and Methods:Fourteen dogs with permanent coronary artery occlusion were imaged on day 0 and day 2. The size of the AAR as measured by first-pass magnetic resonance perfusion on day 0 was compared with retrospectively determined AAR using day 2 T2-weighted MRI. Triphenyltetrazolium chloride staining was used to measure infarct size. Microspheres were used to detect residual perfusion.Results:Hyperintense zones on day 2 T2-weighted magnetic resonance images accurately depicted the AAR as measured by first-pass perfusion on day 0 (38.9±3.0 vs. 36.3%±3.3% of left …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:LkGwnXOMwfcC",
            "Publisher": "LWW"
        },
        {
            "Title": "Quantitative MRI Techniques in Regional Myocardial Function",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-59745-306-6_5",
            "Abstract": "Magnetic resonance imaging (MRI) not only depicts anatomical details, but can be sensitized to the movement and deformation of soft tissues such as the muscle of the heart and can provide measurements of tissue motion at high resolution. A particularly useful class of methods for assessing the contractile function of the myocardial wall is displacement imaging. Magnetic resonance (MR) displacement imaging measures the change of position of tissue elements over a period of time starting from a reference time-point. In concept, it is similar to tracking the three-dimensional (3D) movement of implanted radio-opaque markers in cine fluoroscopy, but instead of using extraneous markers, controlled modulations of various aspects of tissue proton magnetization are utilized as noninvasive markers. Advances in phase modulation techniques allow all pixels of an image to be tracked simultaneously and therefore …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:SP6oXDckpogC",
            "Publisher": "Humana Press"
        },
        {
            "Title": "Myocardial iron is not significantly abnormal in patients with minimally symptomatic hereditary hemochromatosis",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=5376717652690093963&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:hMod-77fHWUC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Prevalence of Unrecognized and Recognized Myocardial Infarction in Older Individuals with Elevated NT-pro-BNP",
            "Publication year": 2008,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.118.suppl_18.S_1105",
            "Abstract": "Background: Higher BNP is associated with poor prognosis. Underlying mechanisms are not well understood and may carry important treatment implications. We used contrast-enhanced cardiac magnetic resonance (CMR) to examine the pathophysiology leading to increased NT-proBNP in ambulatory older subjects.Methods & Results: In 616 older subjects (median age 75 yrs, range 68 to 93) from the ICELAND MI substudy of the AGES-Reykjavik Study, clinically recognized or unrecognized myocardial infarctions (MI) were defined according to 1) delayed enhancement on CMR involving the subendocardium in a coronary distribution, and 2) hospital records and/or surveillance records collected since 1968. Both recognized (p<0.001) and unrecognized MI (p=0.005) were significantly related to NT-proBNP levels in linear regression models adjusting for age, sex, diabetes, LVEF, glomerular filtration, and LV …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:eflP2zaiRacC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "MRISIMUL: a GPU-based parallel approach to MRI simulations",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6671435/",
            "Abstract": "A new step-by-step comprehensive MR physics simulator (MRISIMUL) of the Bloch equations is presented. The aim was to develop a magnetic resonance imaging (MRI) simulator that makes no assumptions with respect to the underlying pulse sequence and also allows for complex large-scale analysis on a single computer without requiring simplifications of the MRI model. We hypothesized that such a simulation platform could be developed with parallel acceleration of the executable core within the graphic processing unit (GPU) environment. MRISIMUL integrates realistic aspects of the MRI experiment from signal generation to image formation and solves the entire complex problem for densely spaced isochromats and for a densely spaced time axis. The simulation platform was developed in MATLAB whereas the computationally demanding core services were developed in CUDA-C. The MRISIMUL simulator …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New automatic algorithm for segmentation of myocardial scar in both inversion recovery and phase sensitive inversion recovery late gadolinium enhancement: validation against TTC and in multi-center, multi-vendor patient data",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/1532-429X-18-S1-P221",
            "Abstract": "BackgroundLate gadolinium enhancement (LGE) using magnitude inversion recovery (IR) or phase sensitive inversion recovery (PSIR) has become clinical standard for assessment of myocardial scar. However, there is no clinical standard for quantification of myocardial scar even though multiple methods have been proposed [1]. Simple thresholds have yielded varying results and advanced algorithms have only been validated in single center studies. The weighted algorithm implemented by Heiberg et al.[2] has recently been used by a core lab in two multi-center studies and accounts for both partial volume effects and microvascular obstruction. However, the weighted algorithm was validated in a single center study and PSIR images were not accounted for. Therefore, the aim of this study was to develop an automatic algorithm that accounts for both IR and PSIR LGE images and validate the new algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:kzcrU_BdoSEC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "836-3 The limits of quantifiable differences in dipyridamole stress magnetic resonance imaging perfusion defects in human subjects with coronary artery disease",
            "Publication year": 2004,
            "Publication url": "https://www.jacc.org/doi/pdf/10.1016/S0735-1097%2804%2991495-7",
            "Abstract": "0.01). Conclusion: The magnitude of the vasodilatory response to cold-pressor stimulation in patients with DM is approximately 24% and it is inversely related to serum total cholesterol and LDL-cholesterol levels.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Prognosis of negative adenosine stress magnetic resonance in patients presenting to an emergency department with chest pain",
            "Publication year": 2006,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jacc.2005.11.059",
            "Abstract": "Prognosis of Negative Adenosine Stress Magnetic Resonance in Patients Presenting to an Emergency Department With Chest PainW. Patricia Ingkanisorn, Raymond Y. Kwong, Nicole S. Bohme, Nancy L. Geller, Kenneth L. Rhoads, Christopher K. Dyke, D. Ian Paterson, Mushabbar A. Syed, Anthony H. Aletras, Andrew E. AraiIn 135 patients presenting to the emergency department with chest pain and a negative troponin-I 6 h after the last chest pain episode, any cardiac magnetic resonance (CMR) abnormality (regional wall motion abnormality, adenosine perfusion defect, or delayed enhancement) had a sensitivity of 100% and a specificity of 91% in predicting a diagnosis of coronary artery disease (CAD) or an adverse outcome within one year. No patients with normal CMR studies had a subsequent diagnosis of CAD or an adverse outcome in this time frame.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:IjCSPb-OGe4C",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Quantitative MRI analysis of human myocardial infarction suggest benefits of infarct-nulling contrast",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=12766442356493257977&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:4JMBOYKVnBMC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Edema by T2-weighted imaging in salvaged myocardium is extracellular, not intracellular",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1532-429X-13-S1-P70",
            "Abstract": "PurposeWe tested the hypothesis that edematous non-infarcted myocardium would show a balanced increase in both the intra-and extracellular volume.MethodsDogs (n= 10) underwent coronary occlusion (2h) and reperfusion (4h). 1.5 T CMR images (Siemens) were taken before and 45 minutes into contrast administration (0.15 mmol/kg Gd-DTPA bolus followed by 0.003 mmol/kg/min infusion). Myocardial T1 was measured by modified Look-Locker imaging (MOLLI), infarction by late gadolinium enhancement (LGE) imaging, and edema by T2-prepared SSFP. T1 and R1 (1/T1) pixel maps were generated from MOLLI images. Contrast agent concentration is proportional to change in R1 between pre-and post contrast. ECV was defined as [1-hematocrit]*[DeltaR1myocardium (R1post-R1pre contrast)]/[DeltaR1blood], thus yielding a quantitative pixel map of the ECV ranging from 0-100%. Change in left ventricular …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:NaGl4SEjCO4C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Simulation-based quantification of native T1 and T2 of the myocardium using a modified MOLLI scheme and the importance of Magnetization Transfer",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0730725X17302965",
            "Abstract": "Quantitative cardiovascular Magnetic Resonance Imaging techniques are gaining wide acceptance within the MR community due to their potential to diagnose non-localized disease, guide therapy and improve patient outcome. During the last decade, there has been an increasing interest for developing new techniques that allow for simultaneous quantification of both T1 and T2 maps of myocardium. Newer studies demonstrated that the incorporation of MRI simulations could yield similar results to conventional mapping techniques in the myocardium. However, these simulation-based quantitative MR techniques usually compare the in-vivo T1 estimates against less accurate T1 techniques, whereas they present inconsistencies between simulation studies, phantom and in-vivo measurements. Moreover, these studies do not investigate the effect of Magnetization Transfer on the myocardial T1 and T2 estimates but …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:BUYA1_V_uYcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Myocardial fibro-fatty infiltration in Duchenne muscular dystrophy canine model detected using multi-echo Dixon method of water and fat separation imaging",
            "Publication year": 2009,
            "Publication url": "https://kellmanp.github.io/webpages/abstracts/ISMRM2009_03762.pdf",
            "Abstract": "Progressive cardiomyopathy leading to congestive heart failure is a common form of death in Duchenne Muscular Dystrophy (DMD). The use of late enhancement in cardiac magnetic resonance (CMR) imaging for assessing fibrosis in DMD and correlating with LV function has recently been reported [1, 2]. Fatty replacement in fibrotic tissue associated with cardiomyopathy in cases of DMD is readily observed in histology [3]. The purpose of this study was to apply CMR imaging in-vivo to detect and characterize fibro-fatty infiltration in the myocardium. The significance and progression of fatty replacement in DMD is currently unknown, although inducibility of arrhythmias has been reported to correlate with fatty infiltration [4]. Multi-echo Dixon methods for fat and water separation [5-7] provide a sensitive means of detecting small concentrations of fat with improved contrast. In the present study, fat and water separation …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prevalence of recognized and unrecognized myocardial infarction: the ICELAND MI substudy to the AGES-Reykjavik study",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=6589120822444124284&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:r0BpntZqJG4C",
            "Publisher": "ELSEVIER SCIENCE INC"
        },
        {
            "Title": "coreMRI: A high-performance, publicly available MR simulation platform on the cloud",
            "Publication year": 2019,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0216594",
            "Abstract": "Introduction A Cloud-ORiented Engine for advanced MRI simulations (coreMRI) is presented in this study. The aim was to develop the first advanced MR simulation platform delivered as a web service through an on-demand, scalable cloud-based and GPU-based infrastructure. We hypothesized that such an online MR simulation platform could be utilized as a virtual MRI scanner but also as a cloud-based, high-performance engine for advanced MR simulations in simulation-based quantitative MR (qMR) methods.   Methods and results The simulation framework of coreMRI was based on the solution of the Bloch equations and utilized a ground-up-approach design based on the principles already published in the literature. The development of a front-end environment allowed the connection of the end-users to the GPU-equipped instances on the cloud. The coreMRI simulation platform was based on a modular design where individual modules (such as the Gadgetron reconstruction framework and a newly developed Pulse Sequence Designer) could be inserted in the main simulation framework. Different types and sources of pulse sequences and anatomical models were utilized in this study revealing the flexibility that the coreMRI simulation platform offers to the users. The performance and scalability of coreMRI were also examined on multi-GPU configurations on the cloud, showing that a multi-GPU computer on the cloud equipped with a newer generation of GPU cards could significantly mitigate the prolonged execution times that accompany more realistic MRI and qMR simulations.   Conclusions coreMRI is available to the entire MR …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Magnetic resonance imaging methods and apparatus for time-series motion tracking with inversion recovery compensation",
            "Publication year": 2010,
            "Publication url": "https://patents.google.com/patent/US7835783B1/en",
            "Abstract": "Image contributions produced by an untagged specimen magnetization component in magnetic resonance imaging are controlled by applying one or more radiofrequency (RF) pulses that invert at least a portion of the untagged specimen magnetization. In an example, a specimen is tagged with a spatially modulated magnetization that is used to produce an image signal that includes a contribution associated with the tagged magnetization and an untagged magnetization. The untagged magnetization is substantially along an axial direction defined by an applied axial magnetic field. The untagged magnetization increases in magnitude because of so-called T 1 relaxation. A contribution to the image signal increases for a predetermined time or to a predetermined magnitude, and a 180-degree pulse is applied to invert at least a portion of the untagged magnetization. The untagged magnetization is then antiparallel …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental Studies",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.135.6107&rep=rep1&type=pdf",
            "Abstract": "Clifford R. Weiss, MD Anthony H. Aletras, PhD James F. London, MD Joni L. Taylor, BS Frederick H. Epstein, PhD Ralf Wassmuth, MD Robert S. Balaban, PhD Andrew E. Arai, MD",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MRI simulation-based evaluation of ECV calculation using MOLLI T1 maps",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7408657/",
            "Abstract": "Quantification of myocardial extracellular volume (ECV) fraction based on pre- and post-gadolinium MOLLI T1 maps is a research tool that has the potential to become an important prognostic tool for assessing specific cardiomyopathies. In this study, we utilized advanced MR simulations of the MOLLI pulse sequence for a wide range of physiological T2 values for pre-gadolinium blood and myocardium in order to investigate the dependency of MOLLI-based ECV measurements on T2. Simulations show that MOLLI underestimates ECV measurements in shorter pre-gadolinium myocardial T2 and longer pre-gadolinium blood T2 values with the ECV underestimation error being higher with pre-gadolinium myocardial T2 values than with pre-gadolinium blood T2 values.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A quantitative pixel-wise measurement of myocardial blood flow by contrast-enhanced first-pass CMR perfusion imaging: microsphere validation in dogs and feasibility study in humans",
            "Publication year": 2012,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jcmg.2011.07.013",
            "Abstract": "The aim of this study was to evaluate fully quantitative myocardial blood flow (MBF) at a pixel level based on contrast-enhanced first-pass cardiac magnetic resonance (CMR) imaging in dogs and in patients.Microspheres can quantify MBF in subgram regions of interest, but CMR perfusion imaging may be able to quantify MBF and differentiate blood flow at a much higher resolution.First-pass CMR perfusion imaging was performed in a dog model with local hyperemia induced by intracoronary adenosine. Fluorescent microspheres were the reference standard for MBF validation. CMR perfusion imaging was also performed on patients with significant coronary artery disease (CAD) by invasive coronary angiography. Myocardial time-signal intensity curves of the images were quantified on a pixel-by-pixel basis using a model-constrained deconvolution analysis.Qualitatively …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Delayed hyperenhancement detects myocardial abnormalities",
            "Publication year": 2001,
            "Publication url": "https://cds.ismrm.org/ismrm-2001/PDF1/0227.pdf",
            "Abstract": "Myocardial infarction has been characterized by abnormal delayed hyperenhancement using gadolinium-enhanced magnetic resonance imaging (MRI).[1] In hypertrophic cardiomyopathy (HCM) focal areas of infarction as well as increased collagen content of the thickened myocardial wall have been described in pathology studies.[2, 3] Fibrosis forms the substrate of arrhythmias with the risk of sudden death.[4]",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Absolute quantification of high contrast dose perfusion imaging can be repeated at two hours despite shortened baseline T1 relaxivity",
            "Publication year": 2002,
            "Publication url": "https://cds.ismrm.org/ismrm-2002/PDF1/0093.PDF",
            "Abstract": "Accurate measurement of coronary flow reserve requires two measures of myocardial blood flow (MBF); before and during hyperemia which must be acquired with only a short time interval between. This study examined the effect of the first perfusion study on the second using absolute MBF by microspheres and by double-bolus Gd-DTPA quantitative MRI (QMRI) performed 2 hour apart. The correlation of QMRI with MBF (~ 0. 8 9) did not change between the studies but the variability of the correlation increased. Sequential perfusion imaging with Gd-DTPA for MBF assessment is probably valid.BACKGROUND: Accurate measurement of coronary flow reserve requires two measures of myocardial blood flow; before and during hyperemia. Magnetic resonance first-pass imaging sequences using Gd-DTPA can be quantified and therefore applied to serial changes in myocardial blood flow. Similar to nuclear techniques …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AIR-SPAMM: alternative inversion recovery spatial modulation of magnetization for myocardial tagging",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780703003707",
            "Abstract": "Alternate inversion recovery spatial modulation of magnetization (AIR-SPAMM) can be used either for doubling the number of tags for a given tagging encoding gradient strength or for improving tagging contrast ratio. AIR-SPAMM requires only a single acquisition and utilizes inversion pulses spaced throughout the gradient recalled echo (GRE) cine acquisition to “lock” the recovering magnetization at a desired level. The theory of AIR-SPAMM is presented along with simulations and results from phantoms. AIR-SPAMM can be used either for imaging systole as demonstrated by initial in vivo results or potentially for imaging the entire cardiac cycle in a slice-interleaved manner.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Measuring extracellular volume fraction by MRI: First verification of values given by clinical sequences",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.27938",
            "Abstract": "To verify MR measurements of myocardial extracellular volume fraction (ECV) based on clinically applicable T1‐mapping sequences against ECV measurements by radioisotope tracer in pigs and to relate the results to those obtained in volunteers.Between May 2016 and March 2017, 8 volunteers (25 ± 4 years, 3 female) and 8 pigs (4 female) underwent ECV assessment with SASHA, MOLLI5(3b)3, MOLLI5(3s)3, and MOLLI5s(3s)3s. Myocardial ECV was measured independently in pigs using a radioisotope tracer method.In pigs, ECV in normal myocardium was not different between radioisotope (average ± standard deviation; 19 ± 2%) and SASHA (21 ± 2%; P = 0.086). ECV was higher by MOLLI5(3b)3 (26 ± 2%), MOLLI5(3s)3 (25 ± 2%), and MOLLI5s(3s)3s (25 ± 2%) compared with SASHA or radioisotope (P ≤ 0.001 for all). ECV in volunteers was higher by MOLLI5(3b)3 (26 ± 3 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:S16KYo8Pm5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Validation of a new t2* algorithm and its uncertainty value for cardiac and liver iron load determination from MRI magnitude images",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.25767",
            "Abstract": "To validate an automatic algorithm for offline T2* measurements, providing robust, vendor‐independent T2*, and uncertainty estimates for iron load quantification in the heart and liver using clinically available imaging sequences.A T2* region of interest (ROI)‐based algorithm was developed for robustness in an offline setting. Phantom imaging was performed on a 1.5 Tesla system, with clinically available multiecho gradient‐recalled‐echo (GRE) sequences for cardiac and liver imaging. A T2* single‐echo GRE sequence was used as reference. Simulations were performed to assess accuracy and precision from 2000 measurements. Inter‐ and intraobserver variability was obtained in a patient study (n = 23).Simulations: Accuracy, in terms of the mean differences between the proposed method and true T2* ranged from 0–0.73 ms. Precision, in terms of confidence intervals of repeated …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of absolute myocardial blood flow during first‐pass MR perfusion imaging using a dual‐bolus injection technique: Comparison to single‐bolus injection method",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.21383",
            "Abstract": "To compare the dual‐bolus to single‐bolus quantitative first‐pass magnetic resonance myocardial perfusion imaging for estimation of absolute myocardial blood flow (MBF).Dogs had local hyperemia of MBF in the left anterior descending (LAD) coronary artery (intracoronary adenosine). Animals (n = 6) had sequential single‐ and dual‐bolus perfusion studies with microsphere determination of absolute MBF. Perfusion imaging was performed using a saturation‐recovery gradient‐echo sequence. Absolute MBF was by Fermi function deconvolution and compared to transmural, endocardial, and epicardial microsphere values in the same region of interest (ROI).Signal and contrast were significantly higher for the dual‐bolus perfusion images. The correlation with MBF by microspheres was r = 0.94 for the dual‐bolus method and r = 0.91 for the single‐bolus method. There …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Experimental validation of contrast-enhanced SSFP cine CMR for quantification of myocardium at risk in acute myocardial infarction",
            "Publication year": 2017,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-017-0325-y",
            "Abstract": "Accurate assessment of myocardium at risk (MaR) after acute myocardial infarction (AMI) is necessary when assessing myocardial salvage. Contrast-enhanced steady-state free precession (CE-SSFP) is a recently developed cardiovascular magnetic resonance (CMR) method for assessment of MaR up to 1 week after AMI. Our aim was to validate CE-SSFP for determination of MaR in an experimental porcine model using myocardial perfusion single-photon emission computed tomography (MPS) as a reference standard and to test the stability of MaR-quantification over time after injecting gadolinium-based contrast. Eleven pigs were subjected to either 35 or 40 min occlusion of the left anterior descending artery followed by six hours of reperfusion. A technetium-based perfusion tracer was administered intravenously ten minutes before reperfusion. In-vivo and ex-vivo CE-SSFP CMR was performed followed by ex-vivo MPS imaging. MaR was expressed as % of left ventricular mass (LVM). There was good agreement between MaR by ex-vivo CMR and MaR by MPS (bias: 1 ± 3% LVM, r                            2 = 0.92, p < 0.001), between ex-vivo and in-vivo CMR (bias 0 ± 2% LVM, r                            2 = 0.94, p < 0.001) and between in-vivo CMR and MPS (bias -2 ± 3% LVM, r                            2 = 0.87, p < 0.001. No change in MaR was seen over the first 30 min after contrast injection (p = 0.95). Contrast-enhanced SSFP cine CMR can be used to measure MaR, both in vivo and ex vivo, in a porcine model with good accuracy and precision over the first 30 min after contrast injection. This offers the option to use the less complex ex-vivo …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "T2‐prepared SSFP improves diagnostic confidence in edema imaging in acute myocardial infarction compared to turbo spin echo",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.21215",
            "Abstract": "T2‐weighted MRI of edema in acute myocardial infarction (MI) provides a means of differentiating acute and chronic MI, and assessing the area at risk of infarction. Conventional T2‐weighted imaging of edema uses a turbo spin‐echo (TSE) readout with dark‐blood preparation. Clinical applications of dark‐blood TSE methods can be limited by artifacts such as posterior wall signal loss due to through‐plane motion, and bright subendocardial artifacts due to stagnant blood. Single‐shot imaging with a T2‐prepared SSFP readout provides an alternative to dark‐blood TSE and may be conducted during free breathing. We hypothesized that T2‐prepared SSFP would be a more reliable method than dark‐blood TSE for imaging of edema in patients with MI. In patients with MI (22 acute and nine chronic MI cases), T2‐weighted imaging with both methods was performed prior to contrast administration and delayed …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "The prevalence of infarct and non-infarct as the etiology in impaired left ventricular systolic function in the elderly: A gadolinium enhanced cardiac MRI study",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=2018770693922834707&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:u_35RYKgDlwC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Accelerated MR Physics Simulations on multi-GPU systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701639/",
            "Abstract": "A multi-GPU approach of MRISIMUL, a recently developed step-by-step comprehensive MR physics simulator of the Bloch equation, is presented in this study. The specific aim was to apply MRISIMUL on multi-GPU systems so as to achieve even shorter execution times. We hypothesized that such a simulation platform could achieve a scalable performance with the increasing number of available GPU cards on single node, multi-GPU computer systems. A parallelization strategy was employed using the MATLAB single-program-multiple-data (spmd) statement and an almost linear speedup was observed with the increasing number of available GPU cards on two separate systems: a single computer of 2 quad-core processors and two Tesla C2070 GPU cards and a single computer of 2 hexa-core processors and four Tesla C2075 GPU cards.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new validated T2* analysis method with certainty estimates for cardiac and liver iron load determination",
            "Publication year": 2015,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-17-S1-P52",
            "Abstract": "BackgroundAccurate quantification of iron load is of importance in tailoring the therapy for patients with iron load disease. Magnetic resonance (MR) imaging is commonly used to assess iron load in different organs by calculating the T2* value. Estimation of precision and uncertainty of the obtained T2* value may be useful for determining changes in iron load between follow-up scans and for titration of treatment. Therefore, the purpose of this study was to develop and validate a new T2* analysis method, providing certainty estimates for quantification of iron load in heart and liver.MethodsThe proposed method is a region of interest (ROI)-based algorithm which changes curve-fitting procedure based on the results from an initial T2* estimate using a 3-parameter, noise-corrected model. The certainty estimate, presented as the T2* value confidence interval, is derived from multiple sub-regions within the selected ROI. Except for ROI delineation, the proposed method does not require any user interaction.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:PELIpwtuRlgC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Artificially Generated Training Datasets for Supervised Machine Learning Techniques in Magnetic Resonance Imaging: An Example in Myocardial Segmentation",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9005762/",
            "Abstract": "Machine learning techniques have become increasingly successful over the last few years in medical image analysis and radiology. However, the low availability, relativeness and size of the training data sets required by the associated learning algorithms prevents their further development or delays their application in clinical practice.This study presented for the first time the development of artificially generated training datasets for supervised learning techniques through the incorporation of a realistic simulation framework in the field of Magnetic Resonance Imaging (MRI). An example in left-ventricle segmentation was utilized and the performance of a fully convolutional network on true cardiac MR data was evaluated.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:i2xiXl-TujoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Accelerated cloud and GPU-based simulations for quantification of relaxation times: an example with MOLLI",
            "Publication year": 2016,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-18-S1-P42",
            "Abstract": "BackgroundQuantification of native T1 in the myocardium has the potential to become an important biomarker for assessing specific cardiomyopathies. However, the accuracy and precision of the clinically available CMR mapping techniques are affected by several parameters [1].",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:Fu2w8maKXqMC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Cumulative Author Index for Volumes 166–171 q",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=3286584661657716116&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Myocardial extracellular volume imaging by CMR quantitatively characterizes myocardial infarction and subclinical myocardial fibrosis",
            "Publication year": 2011,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-13-S1-P148",
            "Abstract": "PurposeTo quantify ECV in patients. We hypothesized that 1) ECV imaging could quantitatively differentiate LGE lesions from normal myocardium, 2) ECV of non-infarcted myocardium would vary with age, and 3) ECV would vary in myocardium remote from infarction.MethodsPatients (n= 126) were imaged at 1.5 T (Siemens) with a Modified Look-Locker Inversion-recovery (MOLLI) sequence before and approximately 15 minutes after a 0.15 mmol/kg bolus of Gd-DTPA. T1 and R1 pixel maps were generated. DeltaR1 maps (R1after-R1before contrast) were divided by the DeltaR1 value of the LV blood pool and multiplied by [1-hematocrit], yielding a quantitative pixel map of the ECV ranging from 0-100%. LGE images were acquired for the entire left ventricle.ResultsIn patients with no clinically detected focal abnormalities by LGE (n= 60, 31 male, mean±SD age 50±17 years), the ECV of the myocardium was (mean±SD) 26±3%. In patients with infarction by LGE (n= 36, 31 male, age 58±12 years), the ECV of remote myocardium was 27±3%(p= ns vs patients with normal LGE) and the ECV of infarcted myocardium was 51±8%(p< 0.001). In patients with atypical enhancement by LGE (n= 30, 23 male, age 54±11 years), the ECV of remote myocardium was 26±3%(p= ns vs patients with normal LGE) and the ECV of atypically enhanced myocardium was 37±7%(p< 0.001). In patients with infarction, the ECV of remote myocardium increased as left ventricular ejection fraction decreased (r=-0.49, p= 0.002). In infarcted and non-infarcted patients (n= 96), as well as both subsets, the ECV of “normal” myocardium increased with age (r= 0.27, p= 0.004). ECV …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:RHpTSmoSYBkC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Quantitative myocardial infarction on delayed enhancement MRI. Part I: Animal validation of an automated feature analysis and combined thresholding infarct sizing algorithm",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.20496",
            "Abstract": "To develop a computer algorithm to measure myocardial infarct size in gadolinium‐enhanced magnetic resonance (MR) imaging and to validate this method using a canine histopathological reference.Delayed enhancement MR was performed in 11 dogs with myocardial infarction (MI) determined by triphenyltetrazolium chloride (TTC). Infarct size on in vivo and ex vivo images was measured by a computer algorithm based on automated feature analysis and combined thresholding (FACT). For comparison, infarct size by human manual contouring and simple intensity thresholding (based on two standard deviation [2SD] and full width at half maximum [FWHM]) were studied.Both in vivo and ex vivo MR infarct size measured by the FACT algorithm correlated well with TTC (R = 0.95–0.97) and showed no significant bias on Bland Altman analysis (P = not significant …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Differentiating acute from chronic myocardial infarction with MRI: The role of edema and Delayed Hyper-Enhancement in MI size determination",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12550262764354835022&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:K3LRdlH-MEoC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Automatic lung segmentation in functional SPECT images using active shape models trained on reference lung shapes from CT",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s12149-017-1223-y",
            "Abstract": "Image segmentation is an essential step in quantifying the extent of reduced or absent lung function. The aim of this study is to develop and validate a new tool for automatic segmentation of lungs in ventilation and perfusion SPECT images and compare automatic and manual SPECT lung segmentations with reference computed tomography (CT) volumes.A total of 77 subjects (69 patients with obstructive lung disease, and 8 subjects without apparent perfusion of ventilation loss) performed low-dose CT followed by ventilation/perfusion (V/P) SPECT examination in a hybrid gamma camera system. In the training phase, lung shapes from the 57 anatomical low-dose CT images were used to construct two active shape models (right lung and left lung) which were then used for image segmentation. The algorithm was validated in 20 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Springer Japan"
        },
        {
            "Title": "Methods and apparatus for mapping internal and bulk motion of an object with phase labeling in magnetic resonance imaging",
            "Publication year": 2010,
            "Publication url": "https://patents.google.com/patent/US7706857B2/en",
            "Abstract": "Magnetic resonance imaging method and apparatus are provided for mapping the internal or bulk motion of an object by labeling the phase of a specimen magnetization with a selected spatial function and measuring changes in the phase of the magnetization. The spatial function is selectable to provide magnetization phase modulation corresponding to displacements in a selected direction, such as a radial or azimuthal direction. Methods and apparatus for producing images based on magnetization phase modulation acquire image data based on stimulated echos and stimulated anti-echos. In an embodiment, a series of 180 degree pulses produces alternating stimulated and stimulated anti-echos that are measured and assigned to respective images.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dense with sense",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780705001540",
            "Abstract": "Displacement encoding with stimulated echoes (DENSE) with a low encoding strength phase-cycled meta-DENSE readout and a two fold SENSE acceleration (R = 2) is described. This combination reduces total breath-hold times for increased patient comfort during cardiac regional myocardial contractility studies. Images from phantoms, normal volunteers, and a patient are provided to demonstrate the SENSE–DENSE combination of methods. The overall breath-hold time is halved while preserving strain map quality.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:4TOpqqG69KYC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Tissue Characterization: T1, T2 and T2* Techniques",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22141-0_12",
            "Abstract": "Noninvasive characterization of tissue has long been the unique domain of magnetic resonance imaging (MRI) when compared to other imaging modalities. Techniques for such typically emphasize one or more MR-based relaxation parameters and the corresponding image contrast or weighting. With or without administration of an exogenous contrast agent, cardiac MRI affords detailed myocardial tissue characterization via various segmented as well as single heart beat approaches. The workhorse technique for myocardial characterization has been late gadolinium enhancement (LGE); LGE is routinely performed in MRI centers around the world as an integral part of nearly every cardiac MRI exam. While originally developed to characterize infarct scar, LGE has since become an important technique to delineate other features of myocardial disease such as fibrosis in nonischemic cardiomyopathy and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Receiver operator curve analysis defines abnormal thresholds for quantitative systolic wall thickening by MRI",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15343668480338448807&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:8AbLer7MMksC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Understanding why edema in salvaged myocardium is difficult to detect by late gadolinium enhancement",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1186/1532-429X-14-S1-O63",
            "Abstract": "BackgroundT2-weighted cardiac magnetic resonance (CMR) can visualize myocardial edema in salvaged myocardium which appears non-infarcted by late gadolinium enhancement (LGE) CMR. However, the mechanisms governing why LGE does not visualize edema in non-infarcted myocardium remain unclear. The objective of the study was to evaluate the extracellular volume fraction (ECV) of edematous salvaged myocardium using quantitative T1-mapping techniques in order to better understand why this tissue may be difficult to detect by LGE imaging.MethodsDogs (n= 10) underwent coronary occlusion and reperfusion, followed by 1.5 T CMR. Salvaged myocardium was defined as having bright signal intensity on T2-prepared steady-state free precession (T2-prep) images and the absence of infarction by LGE, and signal intensities were quantified SD units brighter than remote myocardium. Myocardial …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:35N4QoGY0k4C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Prognostic Value of Myocardial Infarction and Left Ventricular Ejection Fraction in Elderly Subjects: Insights from the ICELAND-MI Substudy of AGES-Reykjavik",
            "Publication year": 2008,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.118.suppl_18.S_839-c",
            "Abstract": "The aim of this study was to determine the prognostic value of myocardial infarction (MI) and left ventricular ejection fraction (LVEF) in an older-aged, ambulatory cohort with baseline MI defined by magnetic resonance imaging (MRI) with gadolinium. The cohort was randomly selected from the Age, Gene/Environment Susceptibility-Reykjavik Study, an epidemiologic study of Icelandic men and women 68 –93 years. Participants underwent cardiac MRI to measure LVEF and to define MI with gadolinium. New cardiac events were defined as the composite of cardiac death, MI, and hospitalization for heart failure. Of the 667 subjects (average age 76 with 309 men), 142 (21.3%) had LVEF (<55%) and 136 (20.4%) had an MI identified on MRI (MRI-MI). The prevalence of MRI-MI increased with worsening LVEF: 13.7%, 41.6% and 83.3% in the groups with LVEF ≥ 55%, 36 –54% and ≤ 35%, respectively, but 57.6% of …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Automatic segmentation of myocardium at risk from contrast enhanced SSFP CMR: validation against expert readers and SPECT",
            "Publication year": 2016,
            "Publication url": "https://bmcmedimaging.biomedcentral.com/articles/10.1186/s12880-016-0124-1",
            "Abstract": "Efficacy of reperfusion therapy can be assessed as myocardial salvage index (MSI) by determining the size of myocardium at risk (MaR) and myocardial infarction (MI), (MSI = 1-MI/MaR). Cardiovascular magnetic resonance (CMR) can be used to assess MI by late gadolinium enhancement (LGE) and MaR by either T2-weighted imaging or contrast enhanced SSFP (CE-SSFP). Automatic segmentation algorithms have been developed and validated for MI by LGE as well as for MaR by T2-weighted imaging. There are, however, no algorithms available for CE-SSFP. Therefore, the aim of this study was to develop and validate automatic segmentation of MaR in CE-SSFP. The automatic algorithm applies surface coil intensity correction and classifies myocardial intensities by Expectation Maximization to define a MaR region based on a priori regional criteria, and infarct region from LGE. Automatic segmentation was validated against manual delineation by expert readers in 183 patients with reperfused acute MI from two multi-center randomized clinical trials (RCT) (CHILL-MI and MITOCARE) and against myocardial perfusion SPECT in an additional set (n = 16). Endocardial and epicardial borders were manually delineated at end-diastole and end-systole. Manual delineation of MaR was used as reference and inter-observer variability was assessed for both manual delineation and automatic segmentation of MaR in a subset of patients (n = 15). MaR was expressed as percent of left ventricular mass (%LVM) and analyzed by bias (mean ± standard deviation). Regional agreement was analyzed by Dice Similarity Coefficient (DSC) (mean ± …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:dTyEYWd-f8wC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "T2-weighted MRI has high diagnostic accuracy for myocardial hemorrhage in myocardial infarction: a preclinical validation study in swine",
            "Publication year": 2009,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.120.suppl_18.s321",
            "Abstract": "Background: Myocardial hemorrhage after myocardial infarction (MI) frequently goes undetected. Since the paramagnetic effects of oxidized iron may result in signal loss on T2* and T2-weighted MRI, we investigated the diagnostic accuracy of T2-weighted MRI in experimental MI.Methods: Acute MI was created in swine (43±9.5 kg) by occluding the left anterior descending coronary artery (n=10) or circumflex (n=5) for 90 minutes followed by reperfusion for ≤3 days (n=2), 10 days (n=7) or 60 days (n=6). Cardiac MRI was performed at 1.5T using T2-prepared steady-state free-precession (T2P-SSFP) and gadolinium enhanced (CE) MRI. Left ventricular (LV) sections were visually inspected, photographed and stained for histology. Gross images and histology were scored for myocardial hemorrhage by an experienced cardiac pathologist blinded to all other data. Regions of low signal intensity on T2-weighted and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:GnPB-g6toBAC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "User dependent parameters can markedly influence apparent infarct size on MRI",
            "Publication year": 2002,
            "Publication url": "https://kellmanp.github.io/webpages/abstracts/AHA2002_InfarctSize.pdf",
            "Abstract": "MRI can assess viability at a resolution and sensitivity that exceed all available clinical imaging techniques. The transmural extent of infarction is an important determinant of contractile function after revascularization. We studied how apparent infarct size changes as a result of incorrect selection of inversion time. METHODS: Twenty—five patients with myocardial infarction were imaged with an inversion recovery prepared fast gradient echo sequence after 0.2 mmol/kg gadolinium. After locating a slice of myocardium with abnormal delayed hyperenhancement, this slice was repeatedly imaged with identical parameters other than intentionally adjusting the inversion time (TI) in 25 ms increments away from the TI that optimally nulled normal myocardium. Raw MRI data was processed using conventional magnitude reconstruction. The same data was reconstructed using phase sensitive reconstruction. The apparent …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cardiac MRI Endpoints in Myocardial Infarction Experimental and Clinical Trials: JACC Scientific Expert Panel",
            "Publication year": 2019,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jacc.2019.05.024",
            "Abstract": "After a reperfused myocardial infarction (MI), dynamic tissue changes occur (edema, inflammation, microvascular obstruction, hemorrhage, cardiomyocyte necrosis, and ultimately replacement by fibrosis). The extension and magnitude of these changes contribute to long-term prognosis after MI. Cardiac magnetic resonance (CMR) is the gold-standard technique for noninvasive myocardial tissue characterization. CMR is also the preferred methodology for the identification of potential benefits associated with new cardioprotective strategies both in experimental and clinical trials. However, there is a wide heterogeneity in CMR methodologies used in experimental and clinical trials, including time of post-MI scan, acquisition protocols, and, more importantly, selection of endpoints. There is a need for standardization of these methodologies to improve the translation into a real clinical benefit. The main objective of this …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:e_rmSamDkqQC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Computer quantification of myocardial infarction on contrast enhanced magnetic resonance imaging",
            "Publication year": 2004,
            "Publication url": "https://kellmanp.github.io/webpages/abstracts/hsu_ismrm2004_000171.pdf",
            "Abstract": "Gadolinium delayed enhancement MRI accurately depicts the area of myocardial infarction (MI) when performed at high resolution. Although a high correlation between ex vivo imaging and triphenyltetrazolium chloride (TTC) images has been shown [1], quantitative validation at the resolution used in vivo against TTC has not been studied with these techniques. Segmentation of myocardial infarction on MR images has been performed manually by expert readers and with fixed thresholding. Although fixed threshold techniques reduce inter-or intra-observer variability, they lack robustness due to use of empirical thresholds. We aimed to develop a computer algorithm that objectifies in vivo MI measurements and can be generalized to different MR reconstruction schemes, ie magnitude and phase-sensitive. The performance of the algorithm was evaluated using both reconstruction methods and compared to the TTC gold standard.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method for determining in vivo concentration of a metabolite",
            "Publication year": 2008,
            "Publication url": "https://patents.google.com/patent/US7330748B2/en",
            "Abstract": "Method for determining in vivo concentration of a metabo lite that includes administering a contrast agent to a Subject, allowing the contrast agent to disperse to tissue of interest, performing CEDST MRI analysis of the subject, and com paring the results to known in vitro results to determine metabolite concentration.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Age‐related vascular stiffness and left ventricular size after myocardial infarction",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1076-7460.2007.05849.x",
            "Abstract": " Aortic stiffness increases with age and may contribute to adverse remodeling after myocardial infarction (MI). The authors examined whether vascular stiffness affects left ventricular (LV) size after MI using contrast‐enhanced cardiac magnetic resonance imaging. Despite similar infarct sizes, patients aged 60 years or older (n=30) had a lower ejection fraction (42±15 vs 53±11%, P<.01) and greater end‐systolic volume index (75±47 vs 44±18 mL/m2, P<.01) than younger patients (n=19). As infarct size increased, LV end‐systolic volumes (P<.0001) and ejection fraction (P<.0001) in the older participants were progressively greater. Participants with greater aortic stiffness had greater end‐systolic volume indices (P<.0001) and lower ejection fraction (P<.0001) with increasing infarct size. Using multivariate analysis, MI size (P<.001) and aortic distensibility (P=.02) were significant predictors of end‐systolic volume …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:-f6ydRqryjwC",
            "Publisher": "Le Jacq"
        },
        {
            "Title": "Cloud GPU-based simulations for SQUAREMR",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780716302427",
            "Abstract": "Quantitative Magnetic Resonance Imaging (MRI) is a research tool, used more and more in clinical practice, as it provides objective information with respect to the tissues being imaged. Pixel-wise T1 quantification (T1 mapping) of the myocardium is one such application with diagnostic significance. A number of mapping sequences have been developed for myocardial T1 mapping with a wide range in terms of measurement accuracy and precision. Furthermore, measurement results obtained with these pulse sequences are affected by errors introduced by the particular acquisition parameters used. SQUAREMR is a new method which has the potential of improving the accuracy of these mapping sequences through the use of massively parallel simulations on Graphical Processing Units (GPUs) by taking into account different acquisition parameter sets. This method has been shown to be effective in myocardial T1 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A high performance parallelizable MRI physics simulator with graphic processing unit technology",
            "Publication year": 2013,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-15-S1-E45",
            "Abstract": "BackgroundThe acquisition of high quality Magnetic Resonance (MR) images requires exploring a parameter space for image quality improvement. This iterative process can benefit from simulations of MRI pulse sequences and imaging protocols.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:CHSYGLWDkRkC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Comparison of arterial input function measured from dual-bolus and dual-sequence dynamic contrast-enhanced cardiac magnetic resonance imaging",
            "Publication year": 2011,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-13-S1-O8",
            "Abstract": "PurposeThis study is to directly compare the AIF measured from dual-bolus and dual-sequence CMR techniques. Quantitative MBF estimates were compared to microsphere reference using both AIF measurements.MethodsBoth the dual-sequence CMR perfusion technique [1] and the dual-bolus protocol [2] were performed in five canines and 35 clinical subjects using a 1.5 Tesla scanner. Gd-DTPA at 0.005 mmol/kg and 0.05 mmol/kg were administered during separate breath holds. Typical imaging parameters: 1 RR, 90 saturation pulse, 50 read out angle, saturation recovery 90 ms, TR 2.4 ms, TE 1.2 ms, matrix size 128x80. A low TE, low resolution FLASH image (TE 0.6 ms, matrix size 64x48) was acquired during each RR interval. AIF measured from the low-dose high-resolution (ie dual-bolus) image series and high-dose low-resolution (ie dual-sequence) image series were compared. Reference MBF measurements were obtained from the canine experiments with intracoronary adenosine infusion and microspheres injection. CMR derived MBF estimates were calculated separately using both AIF by a model-constrained deconvolution. Clinical CMR perfusion studies (35 rest and 35 stress) were also analyzed to compare the AIF from both techniques.ResultsMBF estimates from dual-bolus and dual-sequence CMR techniques matched well with the microspheres measurements (r= 0.89 and 0.88, figure-1). There was an excellent agreement between dual-bolus and dual-sequence MBF estimates (r= 0.98, figure-1). For clinical perfusion, linear regression analysis shows there was an excellent match between dual-bolus and dual-sequence AIF …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:M3NEmzRMIkIC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Measuring extracellular volume fraction by MRI",
            "Publication year": 2019,
            "Publication url": "http://ikee.lib.auth.gr/record/307169",
            "Abstract": "Purpose: To verify MR measurements of myocardial extracellular volume fraction (ECV) based on clinically applicable T1‐mapping sequences against ECV measure-ments by radioisotope tracer in pigs and to relate the results to those obtained in volunteers. Methods: Between May 2016 and March 2017, 8 volunteers (25±4 years, 3 female) and 8 pigs (4 female) underwent ECV assessment with SASHA, MOLLI5 (3b) 3, MOLLI5 (3s) 3, and MOLLI5s (3s) 3s. Myocardial ECV was measured independently in pigs using a radioisotope tracer method. Results: In pigs, ECV in normal myocardium was not different between radioiso-tope (average±standard deviation; 19±2%) and SASHA (21±2%; P= 0.086). ECV was higher by MOLLI5 (3b) 3 (26±2%), MOLLI5 (3s) 3 (25±2%), and MOLLI5s (3s) 3s (25±2%) compared with SASHA or radioisotope (P≤ 0.001 for all). ECV in volunteers was higher by MOLLI5 (3b) 3 (26±3 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Massively parallel CUDA simulations of cardiac and embryonic MRI on a cloud-based cluster",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7408688/",
            "Abstract": "Embryonic and cardiovascular Magnetic Resonance Imaging (MRI) in both clinic and research environments is confronted by challenges like motion, flow and low resolution. MRI simulations can be used as a valuable tool against these challenges but they are characterized by high computational intensity. In this study we implemented cardiac and embryonic MR simulations on a cloud-based cluster. For this purpose, an anatomical model of a human embryo was split over a variable number of computer nodes on the cloud. Simulation of a Gradient-Echo pulse sequence was performed and the partial results were aggregated in a central node to produce the simulated MR image, following the MapReduce paradigm. The measured execution times and speedups demonstrated the benefits of this cloud-based approach.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Myocardial extracellular volume imaging allows quantitative assessment of atypical late gadolinium enhancement",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1186/1532-429X-12-S1-P100",
            "Abstract": "PurposeThe specific aim of the study was to acquire quantitative pixel-wise parametric maps of the extracellular volume (ECV) fraction in subjects with a range of pathological and normal conditions. We hypothesized that ECV imaging could quantitatively differentiate between regions of atypical LGE and normal myocardium.MethodsConsecutive clinically referred patients (n= 15) were scanned at 1.5 T (Siemens) with a Modified Look-Locker Inversion-recovery (MOLLI) sequence acquired before and at approximately 15 minutes after a 0.15 mmol/kg bolus of Gd-DTPA. T1 and R1 (1/T1) pixel maps were generated. DeltaR1 maps (R1 after-R1 before contrast) were divided by the DeltaR1 value of the LV blood pool and multiplied by [1-hematocrit], thus yielding a quantitative pixel map of the ECV fraction ranging from 0-100%.ResultsThe normal myocardium had a mean ECV of 26%(n= 15, range 23-27%). ECV of focal …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Quantitative myocardial perfusion analysis with a dual‐bolus contrast‐enhanced first‐pass MRI technique in humans",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.20502",
            "Abstract": "To compare fully quantitative and semiquantitative analysis of rest and stress myocardial blood flow (MBF) and myocardial perfusion reserve (MPR) using a dual‐bolus first‐pass perfusion MRI method in humans.Rest and dipyridamole stress perfusion imaging was performed on 10 healthy humans by administering gadolinium contrast using a dual‐bolus protocol. Ventricular and myocardial time‐signal intensity curves were generated from a series of T1‐weighted images and adjusted for surface‐coil intensity variations. Corrected signal intensity curves were then fitted using fully quantitative model constrained deconvolution (MCD) to quantify MBF (mL/min/g) and MPR. The results were compared with semiquantitative contrast enhancement ratio (CER) and upslope index (SLP) measurements.MBF (mL/min/g) estimated with MCD averaged 1.02 ± 0.22 at rest and 3.39 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:ufrVoPGSRksC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "The evolution of myocardium at risk by T2-STIR MR imaging the first week after acute myocardial ischemia",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/1532-429X-18-S1-P94",
            "Abstract": "BackgroundMyocardial salvage is currently being used as endpoint in several clinical trials and is determined by relating final infarct size to myocardium at risk (MaR). T2-weighted imaging (T2-STIR) cardiac magnetic resonance (CMR) has previously been shown to enable assessment of MaR up to one week after acute myocardial infarction. Recent experimental data indicate that the extent of MaR by T2-STIR varies over the first week which would have implications on how to design clinical cardioprotection trials using myocardial salvage as endpoint and in the clinical diagnosis of patients with myocardial infarction and normal coronary arteries.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:W5xh706n7nkC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Pericardial effusion or epicardial fat? Improved discrimination with phase-sensitive inversion recovery magnetic resonance imaging",
            "Publication year": 2003,
            "Publication url": "https://www.jacc.org/doi/pdf/10.1016/S0735-1097%2803%2981315-3",
            "Abstract": "Conclusions: MCE pharmacological stress, using TRI and Sonazoid infusion, can detect coronary stenosis. The diagnostic value appears to be comparable to or bener than SPECT. Large trials are needed.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:Tiz5es2fbqcC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Determining Canine Myocardial Area at Risk with Manganese-enhanced MR Imaging1",
            "Publication year": 2005,
            "Publication url": "https://pubs.rsna.org/doi/abs/10.1148/radiol.2363040413",
            "Abstract": "PURPOSE: To test whether manganese-enhanced magnetic resonance (MR) imaging can safely depict the myocardial area at risk both during coronary artery occlusion and for at least 2 hours after reperfusion in dogs.MATERIALS AND METHODS: All procedures were performed in accordance with the animal care and use committee of the National Institutes of Health. In eight dogs, the left anterior descending (LAD) coronary artery was occluded for 90 minutes, and 15 μmol of MnCl2 per kilogram of body weight was intravenously infused for 12 minutes. Phase-sensitive inversion-recovery MR imaging of the LAD arterial territory was performed before occlusion, during MnCl2 infusion, and for at least 2 hours after reperfusion. Hemodynamic responses were monitored continuously. Fluorescent microsphere enhancement was used as the reference standard for determining the area at risk ex vivo. Results are …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Radiological Society of North America"
        },
        {
            "Title": "A fully quantitative pixel-wise measurement of myocardial blood flow using contrast-enhanced first-pass Cardiac Magnetic Resonance perfusion imaging: microsphere validation in dogs and feasibility study in humans",
            "Publication year": 2012,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3460374/",
            "Abstract": "ObjectivesThe aim of this study was to evaluate fully quantitative myocardial blood flow (MBF) at a pixel level based on contrast-enhanced first-pass cardiac magnetic resonance (CMR) imaging in dogs and patients.BackgroundMicrospheres can quantify MBF in subgram regions of interest but CMR perfusion imaging may be able to quantify MBF and differentiate blood flow at much higher resolution.MethodsFirst-pass CMR perfusion imaging was performed in a dog model with local hyperemia induced by intracoronary adenosine. Fluorescent microspheres were the reference standard for MBF validation. CMR perfusion imaging was also performed on patients with significant coronary artery disease (CAD) by invasive coronary angiography. Myocardial time-signal intensity curves of the images were quantified on a pixel-by-pixel basis using a model-constrained deconvolution analysis.ResultsQualitatively, color …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:tuHXwOkdijsC",
            "Publisher": "NIH Public Access"
        },
        {
            "Title": "Diagnostic accuracy of stress perfusion CMR in comparison with quantitative coronary angiography: fully quantitative, semiquantitative, and qualitative assessment",
            "Publication year": 2014,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jcmg.2013.08.014",
            "Abstract": "This study’s primary objective was to determine the sensitivity, specificity, and accuracy of fully quantitative stress perfusion cardiac magnetic resonance (CMR) versus a reference standard of quantitative coronary angiography. We hypothesized that fully quantitative analysis of stress perfusion CMR would have high diagnostic accuracy for identifying significant coronary artery stenosis and exceed the accuracy of semiquantitative measures of perfusion and qualitative interpretation.Relatively few studies apply fully quantitative CMR perfusion measures to patients with coronary disease and comparisons to semiquantitative and qualitative methods are limited.Dual bolus dipyridamole stress perfusion CMR exams were performed in 67 patients with clinical indications for assessment of myocardial ischemia. Stress perfusion images alone were analyzed with a fully quantitative …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:J-pR_7NvFogC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Detecting acute coronary syndrome in the emergency department with cardiac magnetic resonance imaging",
            "Publication year": 2003,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/01.cir.0000047527.11221.29",
            "Abstract": "Background— Managing chest pain in the emergency department remains a challenge with current diagnostic strategies. We hypothesized that cardiac MRI could accurately identify patients with possible or probable acute coronary syndrome.Methods and Results— The diagnostic performance of MRI was evaluated in a prospective study of 161 consecutive patients. Enrollment required 30 minutes of chest pain compatible with myocardial ischemia but an ECG not diagnostic of acute myocardial infarction. MRI was performed at rest within 12 hours of presentation and included perfusion, left ventricular function, and gadolinium-enhanced myocardial infarction detection. MRI was interpreted qualitatively but also analyzed quantitatively. The sensitivity and specificity, respectively, for detecting acute coronary syndrome were 84% and 85% by MRI, 80% and 61% by an abnormal ECG, 16% and 95% for strict ECG …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Fetale dynamische Kardio MRT mittels Doppler-Ultraschall Gating",
            "Publication year": 2018,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0038-1641365",
            "Abstract": "Thieme E-Journals - RöFo - Fortschritte auf dem Gebiet der Röntgenstrahlen und der \nbildgebenden Verfahren / Abstract DE EN Home Products Journals Books Book Series Help \nContact Portal RöFo Full-text search Full-text search Author Search Title Search DOI Search \nMetadata Search Journal More About This Journal Editorial Information Societies Annual List \nGerman National License Impressum Media Authors RöFo Science Award 2014 Instructions \nfor Authors Submit a Manuscript Copyright Subscription Subscription Information & Contacts \nInstitutional Licensing Categories Guidelines Bildessay Radiologie & Recht Most Read Job \nBoard Job Opportunities Not Logged In Login Username: Password: Forgot Password? Forgot \nUsername? Register Now OpenAthens/Shibboleth Login Shopping Cart Year (Archive) 2018 \n2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 of (/…",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:hMsQuOkrut0C",
            "Publisher": "Georg Thieme Verlag KG"
        },
        {
            "Title": "Hormone replacement therapy improves carotid artery compliance",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=11556096259589042641&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:WbkHhVStYXYC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Strain analysis of human MI using dual-echo DENSE: An automated quantitative MRI method",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=17521276501655456554&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:vV6vV6tmYwMC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "2106 T2-weighted edema imaging and area at risk: a volumetric validation",
            "Publication year": 2008,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-10-S1-A375",
            "Abstract": "BackgroundThe area at risk (AAR) of infarction is the hypoperfused myocardium during coronary occlusion. T2-weighted CMR delineates the area at risk early after acute injury as well as two days post-infarction. However, this method has not been volumetrically validated in vivo due to complexities arising from surface coil induced 3D variations in signal intensity and low image SNR.PurposeTo volumetrically validate, in acute myocardial infarction, T2-weighted CMR as a method for visualizing the area at risk, using first pass contrast perfusion during the occlusion as a reference standard.MethodsAcute myocardial infarction was induced by occluding the left anterior descending coronary artery distal to the first diagonal branch for 120 minutes in 19 dogs. The area at risk was measured during the occlusion (within one hour from the onset of ischemia) by first-pass contrast perfusion (Gd-DTPA, 0.10 mmol/kg) performed on a Siemens Avanto 1.5 T scanner with a phased-array surface coil. Six hours post-reperfusion, 3–5 stacks of short-axis breath-held T2-weighted (DIR-TSE, TE= 56 or 66 ms) images were obtained covering the left ventricle. For each image position, 3–5 T2-weighted images were registered for motion, averaged and were surface coil intensity corrected. Edematous areas were defined as an area of hyperintense signal activity on the T2-weighted images.ResultsFigure 1: Mid-ventricular first pass perfusion image (left) and corresponding T2-weighted averaged image (right). Note the good qualitative agreement between the circumferential extent of the perfusion defect and the T2 abnormality delineated by the red lineThe area at risk as …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Quantification of absolute myocardial blood flow with contrast enhanced MRI approaching a pixel resolution: validation vs. Microspheres",
            "Publication year": 2009,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.120.suppl_18.S299-b",
            "Abstract": "Introduction: Myocardial blood flow (MBF) can be estimated from gadolinium enhanced first pass perfusion MR imaging. We hypothesized that MBF can be quantified at approximately the pixel level from MR perfusion images. Results were validated with microspheres.Methods: Local hyperemia of MBF was induced in 7 dogs through intracoronary adenosine infusion. A dual-bolus contrast technique with steady-state free precession imaging was used to acquire first-pass perfusion MR images (1.5 Tesla). Fluorescent microspheres were the reference standard for absolute MBF (in ml/g/min) on 16 sectors (8 endocardial and 8 epicardial) of a mid ventricular slice. MR time intensity curves were analyzed on a pixel-by-pixel basis and converted to parametric maps using model constrained deconvolution.Results: Figure-1 shows a colorized MR perfusion pixel map with corresponding microsphere MBF on the …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Validation of T1 and T2 algorithms for quantitative MRI: performance by a vendor-independent software",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1186/s12880-016-0148-6",
            "Abstract": "Determination of the relaxation time constants T1 and T2 with quantitative magnetic resonance imaging is increasingly used for both research and clinical practice. Recently, groups have been formed within the Society of Cardiovascular Magnetic Resonance to address issues with relaxometry. However, so far they have avoided specific recommendations on methodology due to lack of consensus and current evolving research. Standardised widely available software may simplify this process. The purpose of the current study was to develop and validate vendor-independent T1 and T2 mapping modules and implement those in the versatile and widespread software Segment, freely available for research and FDA approved for clinical applications. The T1 and T2 mapping modules were developed and validated in phantoms at 1.5 T and 3 T with reference standard values calculated from reference pulse sequences …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:7T2F9Uy0os0C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Independent validation of metric optimized gating for fetal cardiovascular phase‐contrast flow imaging",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mrm.27392",
            "Abstract": "To validate metric optimized gating phase‐contrast MR (MOG PC‐MR) flow measurements for a range of fetal flow velocities in phantom experiments. 2) To investigate intra‐ and interobserver variability for fetal flow measurements at an imaging center other than the original site.MOG PC‐MR was compared to timer/beaker measurements in a pulsatile flow phantom using a heart rate (∼145 bpm), nozzle diameter (∼6 mm), and flow range (∼130–700 mL/min) similar to fetal imaging. Fifteen healthy fetuses were included for intra‐ and interobserver variability in the fetal descending aorta and umbilical vein.Phantom MOG PC‐MR flow bias and variability was 2% ± 23%. Accuracy of MOG PC‐MR was degraded for flow profiles with low velocity‐to‐noise ratio. Intra‐ and interobserver coefficients of variation were 6% and 19%, respectively, for fetal descending aorta; and 10% and 17 …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artifact suppression in delayed hyperenhancement imaging of myocardial infarction using B1-weighted phased array combined phase sensitive inversion recovery",
            "Publication year": 2004,
            "Publication url": "http://dir.nhlbi.nih.gov/labs/lce/staffpages/kellmanp/posters/SCMR2004_csf_artifact_poster.pdf",
            "Abstract": "METHODSPeter Kellman, Christopher K. Dyke, Anthony H. Aletras, Elliot R. McVeigh, Andrew E. Arai Laboratory of Cardiac Energetics, National Heart Lung and Blood Institute, NIH, DHHS, Bethesda, Maryland 20892 USAMyocardial viability assessment using Gd-DTPA hyperenhancement MRI is gaining clinical acceptance [1-2]. Using recent MRI methods [3] myocardial infarction may be imaged with high spatial resolution and good contrast. Following administration of Gd-DTPA, infarcted myocardium exhibits delayed hyperenhancement and can be imaged using an inversion recovery sequence.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Displacement and strain measurements in the human heart with SPAMM and meta-DENSE",
            "Publication year": 2002,
            "Publication url": "https://cds.ismrm.org/ismrm-2002/PDF3/0783.PDF",
            "Abstract": "Displacement and strain measurements in the human heart were made with ZD-SPAMM tags and meta-DENSE. Displacement measurements show excellent agreement between the two methods. Circumferential shortening (CS) measurements were found to be not statistically different (p= 0.423) whereas radial thickening (RT) measurements were significantly different (p< O. OOI). SPAMM overestimates RT possibly due to the undersampling of motion along the radial direction.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correcting surface coil intensity inhomogeneity improves quantitative analysis of cardiac magnetic resonance images",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4541274/",
            "Abstract": "Quantitative analysis of cardiac magnetic resonance (MR) images is important in bringing objectivity in diagnosis of myocardial abnormalities. Prior to quantitative analysis, it is necessary to correct signal intensity inhomogeneity due to the non-uniform surface coil sensitivity profile. We present a method using non-rigid body image warping and polynomial function fitting to correct this intensity bias on imperfectly registered cardiac MR images. The method was validated on normal human MR images and significantly reduced signal variation from 20.0% to 3.9% in regions of normal myocardium. In MR images of acute myocardial infarction in dogs, signal intensity analysis detected edematous myocardium as 35.9% brighter than normal myocardium on T2- weighted images (p=0.002) while control regions of interest on PD-weighted images were uniform within 2.2% (p=NS). The proposed approach effectively corrected …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Quantitative in vivo T2 measurements differentiate both infarcted and peri-infarct from normal myocardium",
            "Publication year": 2007,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.116.suppl_16.II_758-c",
            "Abstract": "Introduction: T2-weighted MRI, which reflects water content and mobility, has been recently shown to delineate the area at risk (AAR). However, in-vivo T2 measurements within the viable and infarcted regions of the AAR have not been presented to date. We hypothesized that state-of-the-art T2 methods could discriminate different T2 relaxation constants not only between the AAR and remote myocardium but also between viable and infarcted tissue within the AAR.Methods: Acute myocardial infarction was created by coronary occlusion (90 min N = 9, 180 min N = 5) followed by reperfusion in canines. In-vivo imaging was performed 3 days post-infarction at 1.5T. T2-prepared steady-state free-precession (T2P-SSFP) was used to measure T2 prior to Gd-DTPA infusion. Infarct size was determined by delayed contrast enhancement.Results: T2 Bright regions within the left anterior descending coronary artery …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:ZHo1McVdvXMC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "An online Cloud-ORiented Engine for advanced MRI simulations (coreMRI)",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=3583571959517402088&hl=en&oi=scholarr",
            "Abstract": "Despite high-performance, multi-GPU MR simulations are not widespread. In this study, we present coreMRI, an advanced simulation platform delivered as a web-service through an on-demand, scalable cloud-based and GPU-based infrastructure. coreMRI achieved with a 8xGPUs configuration a speedup of up to 63 when compared to a single-GPU configuration, bringing hour-long simulations down to a couple of minutes. In conclusion, coreMRI allows its users to exploit the highly-tuned computer performance of GPUs on MR simulations with neither upfront investment for purchasing advanced systems nor technical programming expertise.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:HbR8gkJAVGIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Phase Sensitive Inversion Recovery: An Innovative Technique to Assess Myocardial Infarction by Delayed Enhancement",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=14065526786591164494&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:vRqMK49ujn8C",
            "Publisher": "MARCEL DEKKER"
        },
        {
            "Title": "Current and Emerging Technologies for Cardiovascular Imaging",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-10-5092-3_2",
            "Abstract": "Cardiovascular disease is the leading cause of death in the western world. With the application of theoretical physics to the clinic, a variety of imaging technologies are available to the physician for diagnosing and accurately quantifying disease progression. These tools can influence how therapies are applied and impact patient outcome. Radiographic methods based on x-rays are used for diagnosis (Computed Tomography) and therapy (catheterization suite). Nuclear medicine with Single Photon Emission Tomography (SPECT) and Positron Emission Tomography (PET) are routinely used for detecting irreversible and reversible ischemic injury. Ultrasound echocardiography is also routinely used for visualizing contractile function and quantifying blood velocities. Cardiac Magnetic Resonant Imaging allows for a one-stop-shop evaluation of the cardiovascular system including function, tissue perfusion and …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:k8Z6L05lTy4C",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "LNCS 2879: MICCAI 2003 Proceedings, Part II-Short Communications-Surface Coil Intensity Correction and Non-linear Intensity Normalization Improve Pixel-Resolution Parametric Maps of Myocardial",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=16420957832844732217&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:eJXPG6dFmWUC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "High performance MRI simulations of motion on multi-GPU systems",
            "Publication year": 2014,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-16-48",
            "Abstract": "MRI physics simulators have been developed in the past for optimizing imaging protocols and for training purposes. However, these simulators have only addressed motion within a limited scope. The purpose of this study was the incorporation of realistic motion, such as cardiac motion, respiratory motion and flow, within MRI simulations in a high performance multi-GPU environment. Three different motion models were introduced in the Magnetic Resonance Imaging SIMULator (MRISIMUL) of this study: cardiac motion, respiratory motion and flow. Simulation of a simple Gradient Echo pulse sequence and a CINE pulse sequence on the corresponding anatomical model was performed. Myocardial tagging was also investigated. In pulse sequence design, software crushers were introduced to accommodate the long execution times in order to avoid spurious echoes formation. The displacement of the anatomical model isochromats was calculated within the Graphics Processing Unit (GPU) kernel for every timestep of the pulse sequence. Experiments that would allow simulation of custom anatomical and motion models were also performed. Last, simulations of motion with MRISIMUL on single-node and multi-node multi-GPU systems were examined. Gradient Echo and CINE images of the three motion models were produced and motion-related artifacts were demonstrated. The temporal evolution of the contractility of the heart was presented through the application of myocardial tagging. Better simulation performance and image quality were presented through the introduction of software crushers without the need to further increase the …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:t6usbXjVLHcC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Prevalence and Prognosis of Unrecognized Myocardial Infarction by Cardiac Magnetic Resonance versus ECG in the ICELANDMI Study",
            "Publication year": 2011,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.124.suppl_21.A16205",
            "Abstract": "Background: We compared the ability of late gadolinium enhancement cardiac magnetic resonance (CMR) and electrocardiography (ECG) to diagnose unrecognized myocardial infarction (UMI) and to predict mortality in an older, community based sample in Iceland. We hypothesized that CMR would detect more UMI than ECG and that UMI by CMR would have prognostic significance.Methods and Results: The ICELAND MI substudy of the Age, Gene/Environment Susceptibility (AGES) Study randomly recruited 675 participants; an additional 275 subjects with diabetes were also recruited. Of 936 subjects (age 67-94 yrs) receiving ECG and CMR scans, 49% were male, and 37% were diabetic. Subjects were defined as having unrecognized MI when there was evidence of MI by either ECG criteria (Minnesota codes 1.1.1-1.2.8) or by CMR, respectively, but there was no evidence of prior MI by patient records or …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Black-Blood CMR",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22141-0_11",
            "Abstract": "Cardiac magnetic resonance is often used to provide detailed information on structures such as the myocardium, pericardium, pulmonary veins, and emanating great vessels. While blood travels throughout the heart and blood vessels, its signal may obscure the assessment of these structures depending on the clinical questions being addressed. Black blood imaging techniques seek to suppress the signal from blood and thereby improve delineation of cardiovascular anatomy. Fast spin echo-based sequences are in routine use for the suppression of blood flowing into the imaging plane. Such approaches have known limitations that may result in inadequate image quality or artifacts in the image. More recent advances have overcome some of these limitations, but it is incumbent upon the reader to recognize them as they occur. For instance, cardiac motion may lead to signal loss, and may be overcome by …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A new class of contrast agents for MRI based on proton chemical exchange dependent saturation transfer (CEST)",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780799919560",
            "Abstract": "It has been previously shown that intrinsic metabolites can be imaged based on their water proton exchange rates using saturation transfer techniques. The goal of this study was to identify an appropriate chemical exchange site that could be developed for use as an exogenous chemical exchange dependent saturation transfer (CEST) contrast agent under physiological conditions. These agents would function by reducing the water proton signal through a chemical exchange site on the agent via saturation transfer. The ideal chemical exchange site would have a large chemical shift from water. This permits a high exchange rate without approaching the fast exchange limit at physiological pH (6.5–7.6) and temperature (37°C), as well as minimizing problems associated with magnetic field susceptibility. Numerous candidate chemicals (amino acids, sugars, nucleotides, heterocyclic ring chemicals) were evaluated in …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Bright-Blood T2-Weighted MRI Has High Diagnostic Accuracy for Myocardial Hemorrhage in Myocardial Infarction: A Preclinical Validation Study in Swine",
            "Publication year": 2011,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/CIRCIMAGING.111.965095",
            "Abstract": "Myocardial hemorrhage after myocardial infarction (MI) usually goes undetected. We investigated the diagnostic accuracy of bright-blood T2-weighted cardiac MRI for myocardial hemorrhage in experimental MI.MI was created in swine by occluding the left anterior descending (n=10) or circumflex (n=5) coronary arteries for 90 minutes followed by reperfusion for ≤3 days (n=2), 10 days (n=7), or 60 days (n=6). MRI was performed at 1.5 T, using bright-blood T2-prepared steady-state free-precession, T2* and early (1 minute) and late (10–15 minutes) gadolinium enhancement (EGE, LGE, respectively) MRI. Left ventricular sections and histology were assessed for hemorrhage by an experienced cardiac pathologist blinded to the MRI data. Hypointense regions on T2-weighted and contrast-enhanced MRI were independently determined by 3 cardiologists experienced in MRI who …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:dhFuZR0502QC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Wash‐in kinetics for gadolinium‐enhanced magnetic resonance imaging of carotid atheroma",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmri.20228",
            "Abstract": "To determine the wash‐in kinetics of intravenous gadolinium into the fibrous cap and lipid core of carotid atheroma, and identify the time following gadolinium administration that maximizes contrast between the cap and core.Seven subjects with carotid artery stenosis were studied. Magnetic resonance (MR) images of the atheroma were acquired using a single‐inversion‐recovery fast‐spin‐echo (IR FSE) sequence, which was serially repeated during the first 30 minutes following intravenous gadolinium administration. Postcontrast time was divided into three intervals: <10, 11–20, and >21 minutes. Adjusted signal intensity (SI), signal‐to‐noise ratio (SNR), and contrast‐to‐noise ratio (CNR) values for postcontrast images were compared to adjusted precontrast values.The mean SNRs of the cap and core were significantly elevated in each postcontrast interval compared …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Simultaneous differentiation of stunned, infarcted, and normal myocardium using magnetization transfer contrast enhanced cine MRI",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=5104839253275549988&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:a0OBvERweLwC",
            "Publisher": "LIPPINCOTT WILLIAMS & WILKINS"
        },
        {
            "Title": "Stunned, infarcted, and normal myocardium in dogs: simultaneous differentiation by using gadolinium-enhanced cine MR imaging with magnetization transfer contrast",
            "Publication year": 2003,
            "Publication url": "https://pubs.rsna.org/doi/abs/10.1148/radiol.2263012196",
            "Abstract": "PURPOSE: To simultaneously differentiate stunned, infarcted, and normal myocardial regions by using gadolinium-enhanced cine magnetic resonance (MR) imaging with magnetization transfer contrast.MATERIALS AND METHODS: Twelve dogs were imaged on days 1 and 8 after transient 90-minute coronary artery occlusion. A magnetization transfer contrast with echo-train readout (MTET) MR sequence was performed before and 30 minutes after gadolinium contrast enhancement. Ex vivo analysis consisted of MR imaging, microsphere blood flow analysis, and triphenyltetrazolium chloride (TTC) staining. A paired two-tailed t test was used to compare wall thickening from day 1 to day 8. Linear regression and Bland-Altman analyses were used to compare infarct size depicted with MTET imaging with that seen on TTC-stained tissue.RESULTS: Severe wall motion abnormalities were detected in all dogs …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:8k81kl-MbHgC",
            "Publisher": "Radiological Society of North America"
        },
        {
            "Title": "2026 Tradeoffs between spatial coverage and dynamic temporal resolution in quantitative first-pass perfusion imaging",
            "Publication year": 2008,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-10-S1-A295",
            "Abstract": "PurposeThe purpose of this study was to show that high temporal sampling of the input function is important for perfusion quantification, but the myocardial sampling rate may be reduced and still achieve highly accurate measures of perfusion.MethodsDual-bolus (Gd-DTPA 0.005 and 0.1 mmol/kg) rest and dipyridamole stress myocardial perfusion MR imaging was performed on 10 normal volunteers on a 1.5 T Siemens scanner. Each perfusion study was acquired in a breath-hold and with single RR imaging interval. A segmented GRE-EPI sequence was used by the following parameters: 90 prep, 25 readout, TR 7.5 ms, TE 1.48 ms, 8 mm slice thickness, echo train length 4, acquisition matrix 128× 80–96, FOV 360× 270 mm. Time-signal intensity curves of the perfusion images were analyzed by dividing the myocardium into 6 sectors. Myocardial blood flow (MBF) was estimated from LV input and myocardial output time-signal intensity curves by a Fermi model constrained deconvolution. Using MBF quantified from LV and myocardial curves at 1RR temporal resolution as a reference standard, we compared MBF estimated from 2RR and 3RR under-sampled time-signal intensity curves.ResultsFigure 1 shows an example of the LV input curve at 1RR that was under-sampled to 2RR and 3RR temporal resolutions. The shape of the curve was distorted noticeably at contrast arrival and peak contrast enhancement time points. At 3RR under-sampling, the LV curve only has 2 points above half height and clearly underestimates the peak. Figure 2 shows under-sampling has less severe effects in the myocardial curves. Table 1 summarizes the results of …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:geHnlv5EZngC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Response to Letter Regarding Article,“Nitrite Anion Provides Potent Cytoprotective and Antiapoptotic Effects as Adjunctive Therapy to Reperfusion for Acute Myocardial Infarction”",
            "Publication year": 2009,
            "Publication url": "https://www.ahajournals.org/doi/full/10.1161/CIRCULATIONAHA.108.814699",
            "Abstract": "We thank Dr Tsikas and Dr Rossi for their comments and applaud their efforts to standardize measurements of nitric oxide (NO) metabolites. The focus of our current study was (1) to determine if very low doses of nitrite (NO2-) improve the efficacy of reperfusion therapy in a large-animal model of myocardial infarction and (2) to address whether nitrite is the reactive nitrogen species that transports endocrine NO bioactivity in blood, limiting ischemia-reperfusion injury.The targeted concentration of plasma nitrite in this study was 10 μmol, based on studies showing efficacy against ischemiareperfusion injury in mice and rats. The dose of nitrite was calculated on the basis of data from our experiments in many species. 1 The resultant plasma levels in the current study were close to the target 10 μmol in plasma and thus support the fidelity of our experimental plan and measured levels of nitrite. The potent effect of nitrite …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:fPk4N6BV_jEC",
            "Publisher": "Lippincott Williams & Wilkins"
        },
        {
            "Title": "Using a modified 3D-printer for mapping the magnetic field of RF coils designed for fetal and neonatal imaging",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780716300817",
            "Abstract": "An experimental setup for characterizing the magnetic field of MRI RF coils was proposed and tested. The setup consisted of a specially configured 3D-printer, a network analyzer and a mid-performance desktop PC. The setup was tested on a single loop RF coil, part of a phased array for fetal imaging. Then, the setup was used for determining the magnetic field characteristics of a high-pass birdcage coil used for neonatal MR imaging with a vertical static field. The scattering parameter S21, converted into power ratio, was used for mapping the B1 magnetic field. The experimental measurements from the loop coil were close to the theoretical results (R = 0.924). A high degree of homogeneity was measured for the neonatal birdcage RF coil. The development of MR RF coils is time consuming and resource intensive. The proposed experimental setup provides an alternative method for magnetic field characterization …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:2KloaMYe4IUC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Cardiovascular magnetic resonance in rheumatology: current status and recommendations for use",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167527316308555",
            "Abstract": "Targeted therapies in connective tissue diseases (CTDs) have led to improvements of disease-associated outcomes, but life expectancy remains lower compared to general population due to emerging co-morbidities, particularly due to excess cardiovascular risk.Cardiovascular magnetic resonance (CMR) is a noninvasive imaging technique which can provide detailed information about multiple cardiovascular pathologies without using ionizing radiation. CMR is considered the reference standard for quantitative evaluation of left and right ventricular volumes, mass and function, cardiac tissue characterization and assessment of thoracic vessels; it may also be used for the quantitative assessment of myocardial blood flow with high spatial resolution and for the evaluation of the proximal coronary arteries. These applications are of particular interest in CTDs, because of the potential of serious and variable …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Gadolinium delayed enhancement cardiovascular magnetic resonance correlates with clinical measures of myocardial infarction",
            "Publication year": 2004,
            "Publication url": "https://www.jacc.org/doi/abs/10.1016/j.jacc.2004.02.046",
            "Abstract": "The current study tested the hypothesis that gadolinium delayed enhancement assessment of infarct size correlates with clinical indices of myocardial infarction (MI) in humans. Acute infarct mass by cardiac magnetic resonance (CMR) was compared with peak troponin I, acute and chronic left ventricular (LV) systolic function, and chronic infarct mass in patients imaged after recent acute MI.Cardiac magnetic resonance accurately determines myocardial viability in patients with chronic ischemic heart disease but is not well validated for recent MI.Patients with first acute MI (n = 33) or chronic MI (n = 10) underwent cine CMR followed by gadolinium delayed enhancement imaging. A follow-up CMR scan was performed on 20 of the 33 acute MI patients and all of the chronic MI patients.In patients with acute percutaneous coronary intervention, acute MI mass correlated with …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:UeHWp8X0CEIC",
            "Publisher": "American College of Cardiology Foundation"
        },
        {
            "Title": "Semi-automatic segmentation of myocardium at risk from contrast enhanced SSFP images-validation against manual delineation and SPECT",
            "Publication year": 2015,
            "Publication url": "https://jcmr-online.biomedcentral.com/articles/10.1186/1532-429X-17-S1-Q127",
            "Abstract": "BackgroundThe development of treatments to limit myocardial injury in patients with acute STEMI is dependent on methods that accurately determine the amount of mycoardium at risk (MaR). Both T2-weighted imaging and contrast enhanced SSFP (CE-SSFP) have been validated against SPECT and can determine the MaR by CMR one week after an infarct. CE-SSFP has recently been used in two multi-center studies 1, 2. An automatic algorithm for quantification of MaR from T2-weighted images has previously been described but not been tested in CE-SSFP. The aim of this study was to further develop and validate this automatic method for CE-SSFP.MethodsThe automatic algorithm, called Segment MaR, defines the MaR region as the continuous region most probable of being MaR, by estimating the intensities of normal myocardium and MaR with an expectation maximization algorithm and restricting the MaR region by an a priori model of the maximal extent for the user defined culprit artery. The algorithm was modified to be applied at both end diastole and end systole.",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:nrtMV_XWKgEC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Proton Chemical Exchange Dependent Saturation Transfer (CEST): Evaluation as a Mechanism for Non-Metal Based Exogenous MFU Contrast Agent",
            "Publication year": 2000,
            "Publication url": "https://cds.ismrm.org/ismrm-2000/PDF2/0379.pdf",
            "Abstract": "Purpose To evaluate proton chemical exchange dependent saturation transfer (CEST) as a method of generating exogenous MRI contrast. To define chemical groups suitable as exogenous CEST contrast agents under in viva pH and temperature conditions. Zntroducfion Most MR contrast agents are dependent on the Tl or T2* relaxation properties of metal chelates or metal particles which can be limited in their use at high concentrations by toxicity or T2* effects (most Tl agents). The goal of this study was to evaluate the use of saturation transfer with specific chemical groups as a nonmetal based MR contrast agent. The idea is to find chemical groups with the appropriate proton exchange and chemical shift properties at physiological pH and temperature that will function as effective saturation transfer partners with water. A thousand-fold enhancement of the exchange site proton signal can result via the reduction in the water signal (Ms/Ma) based on the following equations:",
            "Abstract entirety": 1,
            "Author pub id": "1O0vvE0AAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MRI Delayed Enhancement Identifies Cardiac Fibrosis after Myocardial Infarction at the Cellular Level in ex vivo Rat Heart",
            "Publication year": 2007,
            "Publication url": "https://www.ahajournals.org/doi/abs/10.1161/circ.116.suppl_16.II_759-a",
            "Abstract": "Background: Delayed enhancement MRI imaging detects chronic myocardial infarction (MI) but some have questioned the accuracy of “non-specific extracellular contrast agents.” Using a resolution 1000 fold higher than previous validation studies we investigated whether MRI could detect fibrosis from chronic MI at an image resolution approaching the size of a cardiomyocyte.Methods and Results: Eight week old Sprague Dawley rats underwent coronary ligation to create myocardial infarction; 2 months later rats were given gadolinium-DTPA (0.3 mmol/kg) intravenous and were euthanized 10 minutes later. Myocardial delayed enhancement MRI images were acquired ex vivo at 7 Tesla with a 3D gradient echo sequence using voxel dimensions of 50 micron = to identify areas of fibrosis. Histologic sections of rat myocardium 50 microns apart were stained with Masson’s trichrome and digitally photographed …",
            "Abstract entirety": 0,
            "Author pub id": "1O0vvE0AAAAJ:LPZeul_q3PIC",
            "Publisher": "Lippincott Williams & Wilkins"
        }
    ]
}]