[{
    "name": "Ανδρέας Παπασαλούρος",
    "romanize name": "Andreas Papasalouros",
    "School-Department": "Μαθηματικών",
    "University": "aegean",
    "Rank": "Επίκουρος Καθηγητής (Μόνιμος)",
    "Apella_id": 10471,
    "Scholar name": "Andreas Papasalouros",
    "Scholar id": "Lv-cQa8AAAAJ",
    "Affiliation": "University of the Aegean",
    "Citedby": 1058,
    "Interests": [
        "Educational Technology"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Lv-cQa8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A critical review of 13 years of mobile game-based learning",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11423-017-9552-z",
            "Abstract": " With the increasing popularity of smartphones and tablets, game-based learning (GBL) is undergoing a rapid shift to mobile platforms. This transformation is driven by mobility, wireless interfaces, and built-in sensors that these smart devices offer in order to enable blended and context-sensitive mobile learning (m-Learning) activities. Thus, m-Learning is becoming more independent and ubiquitous (u-Learning). In order to identify and analyze the main trends and the future challenging issues involved in designing mGBL learning strategies, as well as to bring to the foreground important issues pertaining to mobile and context-aware ubiquitous GBL, the work at hand conducts a comprehensive survey of this particular area. Specifically, it introduces and applies a six-dimensional framework consisted of Spatio-temporal, Collaboration/Social, Session, Personalization, Data security & privacy, and Pedagogy …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:QsaTk4IG4EwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards a framework for trusting the automated learning of social ontologies",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15280-1_36",
            "Abstract": "Automatically learned social ontologies are products of social fermentation between users that belong in communities of common interests (CoI), in open, collaborative and communicative environments. In such a setting, social fermentation ensures automatic encapsulation of agreement and trust of the shared knowledge of participating stakeholders during an ontology learning process. The paper discusses key issues for trusting the automated learning of social ontologies from social data and furthermore it presents a framework that aims to capture the interlinking of agreement, trust and the learned domain conceptualizations that are extracted from such a type of data. The motivation behind this work is an effort towards supporting the design of new methods for learning trusted ontologies from social content i.e. methods that aim to learn not only the domain conceptualizations but also the degree that agents …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Enhancing the collective knowledge for the engineering of ontologies in open and socially constructed learning spaces.",
            "Publication year": 2011,
            "Publication url": "http://www.jucs.org/jucs_17_12/enhancing_the_collective_knowledge/jucs_17_12_1710_1742_kotis.pdf",
            "Abstract": "The aim of this paper is to present a novel technological approach for enhancing the collective knowledge of communities of learners on the engineering of ontologies within a collaborative, open and socially constructed environment. The proposed technology aims at shaping information spaces into ontologies in a collaborative, communicative and learner-centered way during the ontology development life-cycle. The paper conjectures that such a collaborative environment can yield educational benefits, thus there is need to follow principles that apply in the Computer Supported Collaborative Learning (CSCL) paradigm. This work is mainly based on a collaborative and human-centered ontology engineering methodology and on a meta-ontology framework for developing ontologies, namely HCOME and HCOME-3O respectively. The integration of key technologies such as Semantic Wiki and Argumentation …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Supporting Decision Making in Maritime Environmental Protection with a Knowledge-based Education and Awareness Approach.",
            "Publication year": 2009,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Kotis/publication/220827370_Supporting_Decision_Making_in_Maritime_Environmental_Protection_with_a_Knowledge-based_Education_and_Awareness_Approach/links/02bfe51091dd825799000000/Supporting-Decision-Making-in-Maritime-Environmental-Protection-with-a-Knowledge-based-Education-and-Awareness-Approach.pdf",
            "Abstract": "In this paper we present an approach which aims to support learners in general and environmental decision makers in particular, towards effective decision making in maritime environmental pollution via education and awareness of specific maritime environmental pollution policies. We build on previous work concerning the automatic construction of multiple-choice questions from ontologies (automatic assessment) and extend it by integrating if-then rules towards building an environmental knowledge base for maritime pollution. Preliminary evaluation of this work is conducted with a prototype environmental pollution (focused on maritime pollution with oil) ontology in OWL and example rules in SWRL for capturing knowledge related to diagnosis, response and environmental-change events of oil spill pollution.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards networked learning analytics–A concept and a tool",
            "Publication year": 2006,
            "Publication url": "http://www.lancaster.ac.uk/fss/organisations/netlc/past/nlc2006/abstracts/pdfs/P41%20Retalis.pdf",
            "Abstract": "Networked learning is much more ambitious than previous approaches of ICT-support in education. It is therefore more difficult to evaluate the effectiveness and efficiency of the networked learning activities. Evaluation of learners’ interactions in networked learning environments is a difficult, resource and expertise demanding task. Educators participating in online learning environments, have very little support by integrated tools to evaluate students’ activities and identify learners’ online browsing behavior and interactions. As a consequence, educators are in need for non-intrusive and automatic ways to get feedback from learners’ progress in order to better follow their learning process and appraise the online course effectiveness. They also need specialized tools for authoring, delivering, gathering and analysing data for evaluating the learning effectiveness of networked learning courses.Thus, the aim of this paper is to propose a new set of services for the evaluator and lecturer so that he/she can easily evaluate the learners’ progress and produce evaluation reports based on learners’ behaviour within a Learning Management System. These services allow the evaluator to easily track down the learners’ online behavior at specific milestones set up, gather feedback in an automatic way and present them in a comprehensive way. The innovation of the proposed set of services lies on the effort to adopt/adapt some of the web usage mining techniques combining them with the use of semantic description of networked learning tasks",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formalising the Design Process of Web-based Adaptive Educational Applications using an Object Oriented Design Model",
            "Publication year": 2003,
            "Publication url": "http://www.softlab.ece.ntua.gr/~retal/papers/conferences/HT03/design_modelHT03.pdf",
            "Abstract": "The work presented in this paper is comprised of a visual design model for adaptive hypermedia educational systems that follows the principles of the object-oriented paradigm. The model is primarily originated on the Object Oriented Hypermedia Design Method, it has influenced by the AHAM. The Unified Modeling Language (UML) serves the purpose of notation syntax and semantics for this model. The theoretical analysis of the model is accompanied by a case study application for the design of an adaptive web-based testing system.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automating standards-based courseware development using UML",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Papasalouros/publication/220940782_Automating_Standards-Based_Courseware_Development_Using_UML/links/0c96053ad35f970e06000000/Automating-Standards-Based-Courseware-Development-Using-UML.pdf",
            "Abstract": "This paper describes a design method for Web-based Courseware applications. This method facilitates a design model based on the Unified Modeling Language (UML). The paper also proposes the appropriate design steps for the creation of the various products (artifacts) of this model. Courseware models can be created using either general purpose or specialized UML tools. The construction of actual courseware applications from XML descriptions of UML models is also demonstrated. The created courseware applications conform to a related Learning Technology Standard for learning material interchange, namely the IMS Content Packaging standard.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formal discussion summaries",
            "Publication year": 2005,
            "Publication url": "https://search.proquest.com/openview/25d804c5aa549f1e4cc507bc8b7b68d0/1.pdf?pq-origsite=gscholar&cbl=1586335",
            "Abstract": "ISSN 1436-4522.© International Forum of Educational Technology & Society (IFETS). The authors and the forum jointly retain the copyright of the articles.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On-site maintenance data gathering from Base Transceiver Station sites",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5758231/",
            "Abstract": "The problem of maintenance is crucial in all technical systems. Indeed, though much ingenuity, experience and effort are placed in the design and construction of such systems, their faultless functioning during their operation is not guaranteed without proper maintenance. This problem is more serious in some categories of technical systems. Among them are the mobile communication systems especially their radio access network and in particular the Base Transceiver Station sites (BTS sites). Maintenance has many facets i.e. recognition of a malfunction within a short time, determination of the faulty parts, availability of spare parts needed to repair malfunctions, etc. Another facet of maintenance is the gathering of proper data, right after the repair of a malfunction in the system, which could be used for extracting statistical data regarding the actual functioning of the system. Such statistical data are useful, for example …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:O3NaXMp0MMsC",
            "Publisher": "VDE"
        },
        {
            "Title": "Towards CSCL Scripting by Example",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49663-0_36",
            "Abstract": "Computer Supported Collaborative Learning (CSCL) scripts are important strategies for organizing and conducting collaborative learning. A recent line of research aims at the specification of scripts with tools from formal logic and constraint satisfaction systems. This work proposes a novel inductive method for the automatic generation of formal descriptions of CSCL scripts from examples. The method has been successfully applied in the generation of formal descriptions of well-known scripts from the related literature and educational practice.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:Xz60mAmATU4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards a Pattern Language for Learning Management Systems (SIG 1)",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Ellen-Rusman/publication/242739950_The_production_of_e-learning_design_patterns_and_a_research_road_map_for_e-learning/links/559547fb08ae99aa62c6a896/The-production-of-e-learning-design-patterns-and-a-research-road-map-for-e-learning.pdf#page=30",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to ‘re-invent the wheel’. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Grid4All ontology for the retrieval of traded resources in a market-oriented grid",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWGS.2008.022545",
            "Abstract": "One of the most challenging problems in grid environments concerns the matchmaking between resource requests and offers. As it happens in the physical economy, the grid economy must be supported by services that locate resources based not only on their characteristics, but also on market-related properties, the properties and constraints of offers and requests, as well as on declarative specifications of peers' (providers and consumers) features. Resource retrieval in the context of a grid economy extends the notion of resource matchmaking to the process of discovering those markets that trade resources through market orders. This paper describes an ontology that represents resource orders (offers and requests) in a market-oriented resource retrieval process, and describes the Semantic Information System (SIS) that exploits this ontology for the retrieval of markets. The paper describes the retrieval process …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Learning Technology Systems: issues, trends, challenges",
            "Publication year": 2001,
            "Publication url": "http://www.cs.rug.nl/paris/papers/IOSTE01.pdf",
            "Abstract": "This paper elaborates on a comparative analysis of contemporary LTSs. We have selected a number of the most important, commonly used, modern LTSs and put them through a thorough evaluation process, based on the services, tools, and features they support, and the usability of their hypertext user interface. The result of the evaluation is twofold: to explore the utility of LTSs and consequently discover the real nature of these systems, based on the features they support; and to delve into the usability of LTSs, a critical factor in the acceptance of these systems by the market.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:eQOLeE2rZwMC",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "Security Education and Awareness for K-6 Going Mobile.",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/45428644/Security_Education_and_Awareness_for_K-6_Going_Mobile.pdf.pdf",
            "Abstract": "Nowadays, due to the widespread participation of elementary school children in cyberspace activities, basic cybersecurity education and awareness is deemed necessary. Within this context, knowledge acquisition in this timely and important field has greater chances to be more fruitful when the learner is properly motivated. Also, it is anticipated to be more joyful when knowledge is acquired in the form of a digital game-based activity. The paper at hand discusses the development of a novel mobile app called CyberAware, destined to cybersecurity education and awareness. At present, the game is designed for K-6 children in order to support either or both formal or informal learning. Additionally, due to its mobile characteristics, the game can be experienced as an outdoor or classroom activity. Finally, opposite to similar studies found in the literature so far, our attention is not solely drawn to game’s technological aspects but equally to the educational factor. This is achieved through the consideration and use of the ARCS motivational model already from the game’s design phase.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:UuEBAcK4md4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated learning of social ontologies",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/automated-learning-social-ontologies/53889",
            "Abstract": "Learned social ontologies can be viewed as products of a social fermentation process, ie a process between users who belong in communities of common interests (CoI), in open, collaborative, and communicative environments. In such a setting, social fermentation ensures the automatic encapsulation of agreement and trust of shared knowledge that participating stakeholders provide during an ontology learning task. This chapter discusses the requirements for the automated learning of social ontologies and presents a working method and results of preliminary work. Furthermore, due to its importance for the exploitation of the learned ontologies, it introduces a model for representing the interlinking of agreement, trust and the learned domain conceptualizations that are extracted from social content. The motivation behind this work is an effort towards supporting the design of methods for learning ontologies from …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:_kc_bZDykSQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Patterns for designing adaptive/adaptable educational hypermedia",
            "Publication year": 2004,
            "Publication url": "http://users.softlab.ece.ntua.gr/~retal/papers/JOURNALS/SpecialIssueAdaptive_Alexandra/Garzotto-RetalisWBE%20patterns.pdf",
            "Abstract": "A number of studies in traditional class based education show that students whose learning styles match with the instructional approach “tend to retain information longer, apply it more effectively, and have more effective post course attitudes towards the subject than do their counterparts who experience learning/teaching mismatch. Thus, the goals of a “good instructor” should be both to adapt, at some degree and at least part of the time, his or her instructional approach according to students’ learning preferences, and to help students build their skill in their preferred and less preferred learning modes. Taking for granted that in a “student-centered” hypermedia learning environment, learning preferences and design of hypermedia learning applications should be also related, this paper aims to define the structure of the hypermedia design patterns that provide solutions to the problem of how to best support learning preferences via educational hypermedia applications and more specifically via adaptive/adaptable educational hypermedia applications.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An authoring platform for CSCL script definition",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-50506-6_43",
            "Abstract": "Computer Supported Collaborative Learning scripts define pedagogically effective practices for organizing collaborative activities. This paper presents a novel platform for defining CSCL scripts. This platform is composed of the following components: a) a formal language named COSTLy for the specification of CSCL scripts based on logic and constraints, b) a visual environment that facilitates the authoring of scripts, based on the formal language, and c) a mechanism that translates the abstract definitions of scripts into constraint logic programs, thus implementing group formation and task distribution of actual scenario instances. The expressiveness of the proposed language was evaluated. Also the results of a usability evaluation of the proposed platform are reported in the paper. It was shown that university students were able to use the platform in order to describe CSCL scripts of high complexity.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:g5Ck-dwhA_QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Yet another approach to support the design process of educational adaptive hypermedia applications",
            "Publication year": 2004,
            "Publication url": "http://users.softlab.ntua.gr/~retal/papers/conferences/AH2004/Franca_ChristeaWorkshop/paper_workshop_retal.doc",
            "Abstract": "Educational Adaptive Hypermedia Applications (EAHA) provide personalized views on the learning content to individual learners. They also offer adaptive sequencing (navigation) over the learning content based on rules that stem from the user model requirements and the instructional strategies. EAHA are gaining the focus of the research community as a means of alleviating a number of user problems related to hypermedia. However, despite the growing interest of the community and the increasing number of available systems, the actual impact of these systems in e-learning remains low. The difficulty and complexity of developing such applications and systems have been identified as a possible reason for this low diffusion of Adaptive Hypermedia in web-based education. The development of EAHA (authoring process) is a complex task engaging people with different backgrounds: instructional designers, subject matter experts, content developers, multimedia developers, user interface experts, programmers, etc. Experience from traditional Software Engineering as well as Hypermedia Engineering suggests that a model-driven design approach is appropriate in developing applications where such requirements and constraints occur. This paper presents on a model-driven design process of EAHA. This process accords to the principles of hypermedia engineering and its innovation is the use of a formally specified object oriented design model.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated transformation of SWRL rules into multiple-choice questions",
            "Publication year": 2011,
            "Publication url": "https://www.aaai.org/ocs/index.php/FLAIRS/FLAIRS11/paper/viewPaper/2631",
            "Abstract": "Various strategies and techniques have been proposed for the generation of questions/answers tests in Intelligent Tutoring Systems by using OWL (Web Ontology Language) ontolo-gies. Currently there have been no known methods to utilize SWRL rules for this task. This paper presents a system and a set of strategies that can be used in order to automatically generate multiple choice questions from SWRL rules. The aim of the proposed framework is to support further research in the area and to be a testbed for the development of more advanced assessment techniques.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formalising the Design Process of Web-based Adaptive Educational Applications using an Object Oriented",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.536.8013",
            "Abstract": "The work presented in this paper is comprised of a visual design model for adaptive hypermedia educational systems that follows the principles of the object-oriented paradigm. The model is primarily originated on the Object Oriented Hypermedia Design Method, it has influenced by the AHAM. The Unified Modeling Language (UML) serves the purpose of notation syntax and semantics for this model. The theoretical analysis of the model is accompanied by a case study application for the design of an adaptive web-based testing system.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:PkcyUWeTMh0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Pattern Language for Learning Management Systems",
            "Publication year": 2015,
            "Publication url": "http://evidence.thinkportal.org/handle/123456789/20186",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to re-invent the wheel. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:DyXnQzXoVgIC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Semantic Discovery of Services in Democratized Grids",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-social-dimensions-semantic/35745",
            "Abstract": "This chapter aims at discussing issues concerning the advertisement and semantic discovery of Web services in a democratized Grid environment: an environment in which users are agnostic of the low-level details for managing the services offered and requested. This type of environment poses new requirements, and thus, it affects the functionality of a service advertisement/discovery system. In the context of this aim, the chapter presents the motivation and the technologies developed towards a semantic information system in the Grid4All environment. The chapter emphasizes on bridging the gap between Semantic Web and conventional Web service technologies, supporting developers and ordinary users to perform resources’ and services’ manipulation tasks, towards a democratized Grid.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:IWHjjKOFINEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Learning useful kick-off ontologies from Query Logs: HCOME revised",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5447442/",
            "Abstract": "Ontology engineering has been fully or partially practiced by knowledge engineers or knowledge workers, towards delivering either fully fledged conceptualizations of domains or providing lightweight ontology versions for less demanding but more frequent knowledge tasks. Domain-specific information can be shaped into ontologies either manually or (semi-)automatically using ontology learning techniques. The aim of the paper is to present a novice ontology learning approach that automatically constructs kick-off and useful ontologies from query logs. We place tasks related to the proposed learning approach in all phases of an ontology engineering life-cycle. By providing knowledge workers a useful kick-off ontology that is automatically built from ¿their needs (i. e. users' search interests)¿ in order to address ¿their needs (i. e. use of the kick-off ontology to query data precisely)¿, an approach that contributes as …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic Web and Question Generation: An Overview of the State of the Art.",
            "Publication year": 2018,
            "Publication url": "https://eric.ed.gov/?id=ED590300",
            "Abstract": "Automating the production of questions for assessment and self-assessment has become recently an active field of study. The use of Semantic Web technologies has certain advantages over other methods for question generation and thus is one of the most important lines of research for this problem. The aim of this paper is to provide an overview of the existing research of the subject of applying Semantic Web technologies for automatic question generation. The review provides a classification based on technological as well as on pedagogical aspects of the works presented.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:sA9dB-pw3HoC",
            "Publisher": "International Association for the Development of the Information Society"
        },
        {
            "Title": "Patterns for designing Learning Management systems",
            "Publication year": 2003,
            "Publication url": "https://core.ac.uk/download/pdf/232380874.pdf",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to ‘re-invent the wheel’. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems. The proposed design patterns are semantically organized and categorized, and form the basic core of a pattern language for Learning Management Systems.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a generic conceptual design meta-model for web-based educational applications",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.106.3278&rep=rep1&type=pdf",
            "Abstract": "The WWW has turned into a development and run-time environment for large-scale and complex applications among which are the educational applications. There are now justifiable research and development efforts that attempt to formalize the engineering process of such applications in order to achieve better learning effectiveness as well as development efficiency. A lot of work has been done in the field of the instructional designing rather than on hypermedia designing of such applications. Most of the design methods that have been used are general purpose hypermedia design methods which do not allow much in either the conformance of the design models to the latest learning technology standards, or in their seamless translation to standard data formats. This paper presents an attempt for facilitating the conceptual design of web-based educational application by meta-modelling their underlying content and navigational structure. This work is based upon and also extends the OOHDM principles. The Unified Modeling Language (UML) serves the purpose of notation syntax and semantics for this meta-model. The theoretical analysis of the model is accompanied by relevant examples.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-Class in Ontology Engineering: Integrating Ontologies to Argumentation and Semantic Wiki technology",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30773683/10.1.1.181.59.pdf#page=12",
            "Abstract": "The aim of this paper is to present an approach for constructing e-classes for ontology engineering education. Such classes concern the shaping of specific information spaces into ontologies in a collaborative and human-centered way. The work is based on a collaborative and human-centered ontology engineering methodology and a meta-ontology framework for developing ontologies, namely HCOME and HCONE-3O respectively. The integration of key technologies such as Semantic Wiki and Argumentation models with Ontology Engineering (OE) serve as an enabler of e-class construction for different domainspecific information spaces. Such e-classes provide two kinds of lessons, ie a) lessons concerning how an information space is shaped into an ontology (development knowledge) and b) lessons concerning the analysis of the domain itself (domain knowledge). An e-class captures the created knowledge (both domain and development) in ontological models for future reference and teaching. The paper also reports on the integration of an automatic method for creating assessment material from the generated domain knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-level Authoring of Simple Sequencing Descriptions",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5194246/",
            "Abstract": "Simple Sequencing is a specification for describing educational activities dynamically presented to learners based upon the achievement of specific goals during their navigation in educational content. Authoring such descriptions is a difficult task. This paper describes an approach for authoring Simple Sequencing descriptions by hiding underlying details. This approach is based on a mapping between Simple Sequencing descriptions and statechart diagrams, a well-known formalism for describing hypermedia. Based on this mapping, an authoring tool has been developed, which is also presented.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comprehensive cybersecurity learning platform for elementary education",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/19393555.2019.1657527",
            "Abstract": "For elementary students, security and privacy education is anticipated to be more joyful when the knowledge is delivered in the form of a digital game-based learning activity. This paper details on the development of a novel learning platform that comprises a web-based Learning Content Management Systems (LCMS) and a mobile client application (app) for educating and raising young learners’ awareness on basic cybersecurity and privacy issues. The app, which comprises a suite of quick games, can be played either in standalone or in client/server mode and it is especially destined to elementary students. Further, due to the anytime and anywhere characteristics of the app, it can be experienced as a classroom or an outdoor learning activity. Contrary to analogous studies found in the literature so far, during the design phase of the app, our focus was not solely on its technological aspects, but we uniformly paid …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:SIv7DqKytYAC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "The Grid4All ontology for the retrieval of traded resources in a market-oriented Grid",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4606790/",
            "Abstract": "One of the most challenging problems in grid environments concerns the matchmaking between resource requests and offers. As it happens in the physical economy, grid economy must be supported by services that locate resources based not only on their characteristics, but also on market-related properties, offerspsila and requestspsila properties and constraints, as well as on declarative specifications of peerspsila (providers and consumers) features. Resource retrieval in the context of a grid economy extends the notion of resource matchmaking to the process of discovering those markets that trade resources through market orders. This paper describes an ontology that represents resource orders (offers and requests) in a market-oriented resource retrieval process, showing preliminary results of its utilization for the retrieval of traded resources.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Web-based learning Environments: issues, trends, challenges",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1500102693621606842&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimating the gap between informal descriptions and formal models of artifact flows in CSCL",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11200-8_66",
            "Abstract": "Teacher-designers incorporate constructs in their informal designs descriptions, which vaguely express the artifact flow dependencies as configuration constraints. This study analyzes through a corpus of CSCL designs, whether these constructs are supporting means for modeling, and the value of these elements is lost in the modeling process.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:wvYxNZNCP7wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Automatic Generation Of Multiple Choice Questions From Domain Ontologies.",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.218.5149&rep=rep1&type=pdf",
            "Abstract": "The aim of this paper is to present an innovative approach for generating multiple choice questions in automatic way. Although other approaches have been already reported in the literature, the approach presented in this paper is based on domain specific ontologies and it is independent of lexicons such as WordNet or other linguistic resources. The paper also reports on a first prototype implementation of such an approach which creates multiple choice question items using the Semantic Web standard technology OWL (Ontology Web Language). The proposed approach is independent of the domain since questions are generated according to specific ontology-based strategies. In current implementation, simple natural language generation techniques are used in order to provide the items in the questionnaires.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining query-logs towards learning useful kick-off ontologies: an incentive to semantic web content creation",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJKEDM.2011.040652",
            "Abstract": "The aim of the paper is to present an ontology learning method that automatically (unsupervised) builds useful kick-off ontologies from query logs. We introduce tasks related to the proposed method in all phases of an ontology engineering lifecycle, extending human-centred and collaborative engineering methodologies for devising continuously evolving ontologies such as the human centred ontology engineering methodology (HCOME). Users, both knowledge workers of an organisational knowledge management setting and WWW users, are provided with a useful kick-off ontology that is automatically built from users’   search interests  in order to meet ontology engineering and ontology-based application needs. The paper provides evidences that this new approach plays a significant role as an   incentive  in the semantic content creation   bottleneck  .",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:hC7cP41nSMkC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Semantic description of educational adaptive hypermedia based on a conceptual model",
            "Publication year": 2004,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.7.4.129.pdf",
            "Abstract": "The role of conceptual modeling in Educational Adaptive Hypermedia Applications (EAHA) is especially important. Α conceptual model of an educational application depicts the instruc-tional solution that is implemented, containing information about concepts that must be ac-quired by learners, tasks in which learners must be involved and resources that will be used. The importance of such a model is multifold. It formally depicts the outcomes of instructional analysis, drives the development of actual applications and provides the information basis for automatic application generation in the context of Adaptive and Intelligent Tutoring Systems. In this paper we begin by describing a method for designing EAHA. Our method uses UML as the modeling language and defines the design process in three distinct steps. We propose an RDF encoding of the Conceptual Model, which is the outcome of the first step, following a …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:u-x6o8ySG0sC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "The Learner's Mirror.",
            "Publication year": 2004,
            "Publication url": "https://core.ac.uk/download/pdf/232380359.pdf",
            "Abstract": "Adaptive Hypermedia Educational Systems, AHES, represent an emerging technology that provides a unique advantage over traditional Web-based Educational Systems; that is the ability to adapt to the user's needs, goals, preferences etc. These systems are increasingly becoming part of mainstream education, yet there does not exist a disciplined way of designing them-most of the development is ad-hoc.This paper aims to fill this void, which is the absence of disciplined design, by recording the expertise of existing Adaptive Hypermedia Educational Systems in the form of design patterns. In this paper we present three of these patterns: User Model Definition, User Model Initialisation and User Model Maintenance, as well as a more complete organization map that illustrates the entire pattern language based on the patterns’ relations.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning of Social Ontologies in WWW: Key Issues, Experiences, Lessons Learned, and Future Directions",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=AcU6rPl_cMMC&oi=fnd&pg=PA153&dq=info:nO_LmLznT7kJ:scholar.google.com&ots=Mv-0F8Se86&sig=pD82Q_LzanP2E5mak_RKx5YI3MM",
            "Abstract": "Web, Social Web, and even Semantic Web content can be reused for the creation of semantic content, shaping information (or existing knowledge) into ontologies. Ontologies play a key role in the realization of the Semantic Web. However, a critical mass of useful semantic content is missing. Web users can find only a few well-maintained and up-to-date domain ontologies and the amount of RDF data publicly available is limited compared to the size of the unstructured Web information. Only a small number of Web users, typically members of the Semantic Web community, build and publish ontologies. To assist and motivate humans to participate in the Semantic Web movement and contribute their knowledge and time to create, refine, and enrich useful ontologies, we must boost semantic content creation by providing Web users with “starting points of assistance”—automatically learned ontologies.Traditionally, the learning of ontologies involved the identification of domainspecific conceptualizations extracted from text documents or other semi-structured information sources such as lexicons and thesauri. Such learned ontologies do not utilize available social data that may be related to the domain ontology, eg, information ownership details (contributor, annotator, end user); tags or argument and dialogue items that comment, organize, or disambiguate domain-specific information; querying information related to user clicks on retrieved information. Recently, the learning of ontologies has included social content generated mainly within Web 2.0 applications. Social content encompasses various types of publicly available media matter produced by …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:ZeXyd9-uunAC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "The Learner’s Mirror-Designing a User Modelling Component in Adaptive Hypermedia Educational Systems",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.562.5470",
            "Abstract": "Adaptive Hypermedia Educational Systems, AHES, represent an emerging technology that provides a unique advantage over traditional Web-based Educational Systems; that is the ability to adapt to the user's needs, goals, preferences etc. These systems are increasingly becoming part of mainstream education, yet there does not exist a disciplined way of designing them-most of the development is ad-hoc. This paper aims to fill this void, which is the absence of disciplined design, by recording the expertise of existing Adaptive Hypermedia Educational Systems in the form of design patterns. In this paper we present three of these patterns: User Model Definition, User Model Initialisation and User Model Maintenance, as well as a more complete organization map that illustrates the entire pattern language based on the patterns’ relations.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "What’s on the menu? Today’s specialty: a European networked university",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64498",
            "Abstract": "In the midst of one of the greatest challenges ever faced, the great demand for learning, educational organizations are being reformed. The MENU consortium is working on meeting this challenge by creating a European Networked University (ENU). This paper provides a macroscopic view of the process of creating such aon organization. It describes the concerns that have to be taken into account and it presents the strategy of ENU. It also identifies ENU customers as well as competitors and articulates where ENU is going and why. Most importantly, it presents the business processes that ENU shall carry out.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:dhFuZR0502QC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Designing and generating educational adaptive hypermedia applications",
            "Publication year": 2005,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.8.3.26.pdf",
            "Abstract": "Educational Adaptive Hypermedia Applications (EAHA) provide personalized views on the learning content to individual learners. They also offer adaptive sequencing (navigation) over the learning content based on rules that stem from the user model requirements and the instructional strategies. EAHA are gaining the focus of the research community as a means of alleviating a number of user problems related to hypermedia. However, the difficulty and complexity of developing such applications and systems have been identified as possible reasons for the low diffusion of Adaptive Hypermedia in web-based education. Experience from traditional Software Engineering as well as Hypermedia Engineering suggests that a model-driven design approach is appropriate for developing applications where such requirements and constraints occur. This paper presents on a model-driven design process of EAHA. This …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:9yKSN-GCB0IC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "A model for interoperability in computer supported collaborative learning",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652363/",
            "Abstract": "Computer supported collaborative learning activities involve combination of complex software tools that often need to interoperate in a wider context of learning. This paper proposes a data model that accommodates requirements of typical collaborative learning situations and facilitates interoperability of tools and interchange of products of collaboration and evaluation data. The model has been tested against various typical tools used for both synchronous and asynchronous collaboration of groups of students",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards an intelligent tutoring system for environmental decision makers",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/37043197/EEM2010.pdf",
            "Abstract": "The paper presents a novel approach which aims to support the training of decision makers in maritime environmental pollution policies via an intelligent tutoring system that focuses on the automatic generation of self-assessment material. More specifically, the paper reports on the automatic construction of multiple-choice question tests from knowledge bases ie domain ontologies, instances, if-then rules, and multimedia objects. The reported work has been conducted with a prototype environmental pollution knowledge base (focused on maritime pollution with oil) representing ontology classes and instances in OWL language and rules in SWRL, capturing knowledge related to policies of diagnosis and response, and environmental-change events, for oil spill pollution.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Department of Environmental Engineering and Management, Gh. Asachi Technical University"
        },
        {
            "Title": "Intelligent Collaborative Authoring of Place-Based, Cross-Cultural and Media-Rich Experiences",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/737562",
            "Abstract": "In this paper, we present a framework that aims to support the active participation and collaboration of knowledge workers and engineers in the co-authoring of place-based, cross-cultural and media-rich memories, experiences, stories and narration. To achieve this, the framework proposes a novel approach for facilitating such a participation and collaboration through the semantic integration of data/information and integrated tools that will be both accessible via an open, user-friendly, mobile and knowledge-based platform, emphasizing a low-effort participative and guided co-authoring approach. The presented collaborative and participative approach is expected to foster social cohesion in heterogeneous communities of interest and practice. For the realization of the framework, we propose the implementation of a proof-of-concept system and its evaluation in the socio-cultural group of immigrants and refugees within the context of creating and sharing knowledge related to the physical and digital artifacts of a modern art museum. Our vision for the proposed framework is to introduce new technology for the collaborative authoring of cultural experiences with low effort using an intelligent assistant. Additionally, we envision a Shared Experiences Ecosystem (SEE) that aims to provide media-rich content and tools that will eventually foster the inclusive access of heterogeneous socio-cultural groups to shared experiences, increasing social cohesion in resilient local environments. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:8Xgff_V0N9gC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "An integrated model for the authoring of web-based adaptive educational applications",
            "Publication year": 2003,
            "Publication url": "https://research.rug.nl/files/3019155/2003ProcAHPapasalouros.pdf",
            "Abstract": "In this paper a design model for Web-based Adaptive Educational Applications (WAEA) is presented. A model-based approach is proposed as an answering to the problem of the difficulty of authoring such applications. This approach is based on the use of object oriented modeling techniques and the specification of WAEA by means of an XML binding.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:YsMSGLbcyi4C",
            "Publisher": "University of Groningen, Johann Bernoulli Institute for Mathematics and Computer Science"
        },
        {
            "Title": "Formalizing CSCL scripts with logic and constraints",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-98572-5_68",
            "Abstract": "CSCL (Computer-Supported Collaborative Learning) scripts describe pedagogically effective practices for organizing the experiences of individuals when engaged in collaborative activities. This paper presents a new language named COSTLy for describing certain mechanisms of CSCL scripts, namely, group formation and task distribution. The expressiveness of the proposed language is demonstrated by describing jigsaw, a well-known CSCL script. The proposed descriptions are automatically transformed into constraint logic programs which can be executed so as to support group formation in actual scenario instances.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:Xl6nMSl579sC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A direct TeX-to-Braille transcribing method",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2700648.2811376",
            "Abstract": "The TeX/LaTeX typesetting system is the most widespread system for creating documents in Mathematics and Science. However, no reliable tool exists to this day for automatically transcribing documents from the above formats into Braille code. Thus, blind students who study related fields do not have access to the bulk of studying materials available in LaTeX format. We develop a tool, named latex2nemeth, for transcribing directly LaTeX documents to Nemeth Braille, thus facilitating the access of students with blindness to Science.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:jSAVyFp_754C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining Web queries to boost semantic content creation",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/30816466/WWW-Internet09-Kotis.pdf",
            "Abstract": "The aim of the paper is to present an ontology learning approach that automatically constructs useful ontologies from query logs. By providing users with a useful ontology that is automatically built from “their needs” ie users’ search interests, in order to address “their needs” ie use of the learned ontology to query information precisely, a new approach that can be considered an incentive in the semantic content creation bottleneck is introduced. The approach can be applied in any set of queries (query logs) given that the queries are classified in specific domains.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Pattern Language for Learning Management Systems",
            "Publication year": 2003,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/26777",
            "Abstract": "Towards a Pattern Language for Learning Management Systems Αρχική Σελίδα → Κεντρική \nΒιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση \nΤεκμηρίου HEAL DSpace Towards a Pattern Language for Learning Management Systems \nΑποθετήριο DSpace/Manakin Towards a Pattern Language for Learning Management Systems \nPapasalouros, A; Retalis, S; Skordalakis, M URI: http://hdl.handle.net/123456789/26777 \nΗμερομηνία: 2003 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος \nΜορφότυπο Προβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το \nτεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά \nΠεριήγηση Σε όλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς \nΤίτλοι Θέματα Αυτή η Συλλογή Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο μου / ΙΑ - /- -…",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:qe6vwMD2xtsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ob-AHEM: A UML-enabled model for Adaptative Educational Hypermedia Applications",
            "Publication year": 2002,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=4544727",
            "Abstract": "The work presented in this paper is comprised of a visual design model for adaptive hypermedia educational systems that follows the principles of the object-oriented paradigm. The model is primarily originated on the Adaptive Hypermedia Applications Model (AHAM), and extends it by defining the presentation layer of a particular Hypermedia Application. The Unified Modeling Language (UML) serves the purpose of notation syntax and semantics for this model. The theoretical analysis of the model is accompanied by an case study application for the design of an adaptive web-based testing system.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Digital Education Observatory (OED)"
        },
        {
            "Title": "Automatic generation of tests from domain and multimedia ontologies",
            "Publication year": 2011,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10494820.2011.528704",
            "Abstract": "The aim of this article is to present an approach for generating tests in an automatic way. Although other methods have been already reported in the literature, the proposed approach is based on ontologies, representing both domain and multimedia knowledge. The article also reports on a prototype implementation of this approach, which automatically creates tests using the Semantic Web standard technology OWL (Ontology Web Language) as well as proper annotations of images. The proposed approach is independent of specific domain characteristics, since question items are generated according to generic ontology-based strategies. In the presented prototype implementation, simple natural language generation techniques are used to project the items in the tests.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:0EnyYjriUFMC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Defining a UML Profile for Web–based Educational Applications",
            "Publication year": 2005,
            "Publication url": "ftp://ceur-ws.org/pub/publications/CEUR-WS/Vol-153.zip#page=44",
            "Abstract": "This paper presents a UML profile for web–based educational applications. The definition of the profile is provided by applying a certain formalism which is based on the metamodeling architecture of the UML language. An example is given throughout the paper for the illustration of an instantiated model based on the profile.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symeon Retalis",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7866854219424825549&hl=en&oi=scholarr",
            "Abstract": "There is an exponentially increasing demand for provisioning of high-quality learning resources, which is not satisfied by current web technologies and systems. E-Learning Resource Brokers are a potential solution to this problem, as they represent the state-of-the-art in facilitating the exchange of learning resources between multiple parties. These systems currently operate at a limited scale but their use is vastly increasing, especially in the context of multifaceted educational organizations, such as virtual universities. This paper presents some of these systems that are extensively used in the e-learning market. It then moves on to provide an overview of the ideal functionality that e-Learning Resource Brokers should provide. Finally it discusses future trends in their development, within the context of global e-learning forces.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 1 Requirements for Grid4All Virtual Organisations and Resource Management and State of the art analysis",
            "Publication year": 2007,
            "Publication url": "https://cordis.europa.eu/docs/projects/cnect/7/034567/080/deliverables/D2-1.pdf",
            "Abstract": "This document is part of a research project partially funded by the IST programme of the Commission of the European Communities as project number IST-FP6-034567. This report is a public version of the document\" D2. 1–Requirements for Grid4All Virtual Organisations and Resource Management and State of art analysis\", as specified in the Grid4All Annex 2\" Description of Work\". The objective of Grid4All is to provide middleware support and higher level services for the creation and maintenance of virtual organisations formed of autonomous entities in an open environment. This aim of this project is to address nonconventional Grid users, that is, not just large enterprises and scientific institutions, but small organisations, and individual users on the Internet. This report corresponding to Deliverable report D2. 1 presents the requirements, detailed state of art analysis, and architectures for both the management middleware and higher level services required to support maintenance and evolution of virtual organisations. This report is structured in four major parts. Open and volatile environments require middleware with self-management and self-organisation capabilities. The first chapter presents an architecture based framework that takes its source from autonomic computing and addresses essentially creation, deployment, and maintenance of virtual organisations. The second chapter addresses allocation of computational resources with an approach based on open resource markets. Information and discovery services are essential for the operation of virtual organisations. The third chapter addresses the heterogeneity through an approach …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:qwy9JoKyICEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Developing an Architecture for the Software Subsystem of a Learning Technology System-An Engineering Approach",
            "Publication year": 2001,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/34260",
            "Abstract": "Developing an Architecture for the Software Subsystem of a Learning Technology System - An \nEngineering Approach Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → \nΔημοσιεύσεις μελών ΔΕΠσε συνέδρια → Εμφάνιση Τεκμηρίου HEAL DSpace Developing an \nArchitecture for the Software Subsystem of a Learning Technology System - An Engineering \nApproach Αποθετήριο DSpace/Manakin Developing an Architecture for the Software Subsystem \nof a Learning Technology System - An Engineering Approach Retalis, S; Papasalouros, A; \nSkordalakis, M URI: http://hdl.handle.net/123456789/34260 Ημερομηνία: 2001 Εμφάνιση \nπλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν \nυπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην \nακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε όλο το DSpace & / /…",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:2v_ZtQDX9iAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic exercise generation in euclidean geometry",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41142-7_15",
            "Abstract": "Automatic assessment has recently drawn the efforts of researchers in a number of fields. While most available approaches deal with the construction of question items that assess factual and conceptual knowledge, this paper presents a method and a tool for generating questions assessing procedural knowledge, in the form of simple proof problems in the domain of the Euclidean Geometry. The method is based on rules defined as Horn clauses. The method enumerates candidate problems and certain techniques are proposed for selecting interesting problems. With certain adaptations, the method is possible to be applied in other knowledge domains as well.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "e-Learning resource brokers",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Paris-Avgeriou/publication/30496984_e-Learning_Resource_Brokers/links/0046352f9025762ed6000000/e-Learning-Resource-Brokers.pdf",
            "Abstract": "There is an exponentially increasing demand for provisioning of high-quality learning resources, which is not satisfied by current web technologies and systems. E-Learning Resource Brokers are a potential solution to this problem, as they represent the state-of-the-art in facilitating the exchange of learning resources between multiple parties. These systems currently operate at a limited scale but their use is vastly increasing, especially in the context of multi-faceted educational organizations, such as virtual universities. This paper presents some of these systems that are extensively used in the e-learning market. It then moves on to provide an overview of the ideal functionality that e-Learning Resource Brokers should provide. Finally it discusses future trends in their development, within the context of global e-learning forces.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A semantic information system for services and traded resources in Grid e-markets",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X1000049X",
            "Abstract": "This paper aims at presenting a semantic information system for the advertisement, retrieval and selection of application services, and markets that trade resources, in a democratized Grid e-marketplace environment. The market-based environment in a democratized Grid context poses new requirements concerning the functionality of a semantic information system. In this context, the paper motivates the development of the Grid4All Semantic Information System (G4A-SIS) and presents the design and the technologies used for the realization of this system. G4A-SIS is deployed as a web service using a Java API which defines the functionality of the system and abstracts low-level ontology implementation details, providing to the clients an interface for registering and querying semantically annotated market and application-specific services. In addition to the “ontology-centred” mechanisms provided for matchmaking …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:Se3iqnhoufwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Online Resource Page: Using Technology to Enhance the Teaching and Learning Process",
            "Publication year": 2003,
            "Publication url": "http://elibrary.lt/resursai/Uzsienio%20leidiniai/IEEE/English/2006/Volume%206/Issue%202/Jets_v6i2_00.pdf",
            "Abstract": "Journal of Educational Technology & Society Online Resource Page: Using Technology to \nEnhance the Teaching and Learning Proc Page 1 Journal of Educational Technology & Society \nVolume 6 Number 2 2003 Table of contents Formal discussion summaries Online Resource \nPage: Using Technology to Enhance the Teaching and Learning Process Moderator and \nSummarizer: Brent Muirhead 1-10 Full length articles Towards a Pattern Language for Learning \nManagement Systems Paris Avgeriou, Andreas Papasalouros, Symeon Retalis and Manolis \nSkordalakis 11-24 Uncovering the Provisos behind Flexible Learning Der-Thanq Chen 25-30 \nAn Evaluation Instrument for Hypermedia Courseware Georgiadou Elissavet and Anastasios \nA. Economides 31-44 Students' attitudes toward the use of the Internet for learning: A study \nat a university in Malaysia Kian-Sam Hong, Abang Ahmad Ridzuan and Ming-Koon Kuek …",
            "Abstract entirety": 0,
            "Author pub id": "Lv-cQa8AAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating the usability of web-based learning management systems",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/43010100/Evaluating_the_usability_of_web-based_le20160224-10649-1ot8mdo.pdf",
            "Abstract": "A great number of Learning Management Systems (LMSs), commercial or open source exists nowadays (eg WebCT, Blackboard, IBM LearningSpace, etc.) offering integrated services such as the creation and distribution of on-line learning material, the communication between stakeholders, the management of the instruction process etc., thus providing the basic software platform for supporting web-based learning in an easy-touse, and pedagogically flexible manner. This paper proposes a framework on the analysis of potentiality and on the evaluation of LMSs’ admissibility. The most commonly used LMSs have been selected for the application of this specific framework. The aim of the evaluation is twofold; to search their usefulness and their quality in use.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a pattern language for learning management systems",
            "Publication year": 2003,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.6.2.11.pdf",
            "Abstract": "Learning Management Systems are sophisticated web-based applications that are being engineered today in increasing numbers by numerous institutions and companies that want to get involved in e-learning either for providing services to third parties, or for educating and training their own people. Even though the construction of such systems has been taking place for many years, they are still designed and developed from scratch. The reason is that experience from previous Learning Management Systems, is not codified or documented, resulting in forcing the development teams to ‘re-invent the wheel’. This paper presents an approach of recording design experience in the form of design patterns for Learning Management Systems and aims at developing a pattern language for these systems.",
            "Abstract entirety": 1,
            "Author pub id": "Lv-cQa8AAAAJ:u5HHmVD_uO8C",
            "Publisher": "International Forum of Educational Technology & Society"
        }
    ]
}]