[{
    "name": "Αντώνιος Συμβώνης",
    "romanize name": "Antonios Symvonis",
    "School-Department": "Εφαρμοσμένων Μαθηματικών και Φυσικών Επιστημών",
    "University": "ntua",
    "Rank": "Καθηγητής",
    "Apella_id": 19932,
    "Scholar name": "Antonios Symvonis",
    "Scholar id": "EHH_0W8AAAAJ",
    "Affiliation": "National Technical U. of Athens",
    "Citedby": 1487,
    "Interests": [
        "Graph Drawing",
        "Algorithms",
        "Graph Theory",
        "Privacy"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=EHH_0W8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Graph Drawing: 22nd International Symposium, GD 2014, Würzburg, Germany, September 24-26, 2014, Revised Selected Papers",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=s_WbBQAAQBAJ&oi=fnd&pg=PR7&dq=info:9glqY1x6sT8J:scholar.google.com&ots=7EclxrB0hE&sig=Kd1H4NW90iPiie3aO5Qd_4vucMc",
            "Abstract": "This book constitutes the proceedings of the 22nd International Symposium on Graph Drawing, GD 2014, held in Würzburg, Germany, in September 2014. The 41 full papers presented in this volume were carefully reviewed and selected from 72 submissions. The back matter of the book also contains 2 page poster papers presented at the conference. The contributions are organized in topical sections named: planar subgraphs; simultaneous embeddings; applications; contact representations; k-planar graphs; crossing minimization; level drawings; theory; fixed edge directions; drawing under constraints; clustered planarity; and greedy graphs.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer"
        },
        {
            "Title": "Labeling collinear sites",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4126217/",
            "Abstract": "We consider a map labeling problem, where the sites to be labeled are restricted on a line L. This is quite common e.g. in schematized maps for road or subway networks. Each site s i , is associated with an axis-parallel w i timesh i  label l i , which can be placed anywhere on the \"boundary\" of the input line L. The main task is to place the labels in distinct positions, so that they do not overlap and do not obscure the site set, and to connect each label with its associated site through a leader, such that no two leaders intersect. We propose several variations of this problem and we investigate their computational complexity under certain optimization criteria.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interactive and Personalized Activity eBooks for Learning to Read: The iRead Case.",
            "Publication year": 2019,
            "Publication url": "http://ceur-ws.org/Vol-2384/paper06.pdf",
            "Abstract": "In this paper, we present a full system that provides a personalized educational service by making use of the new ePub3 eBook standard. The system has been developed in the framework of the iRead Project [7] which aims to develop tools for personalized learning of reading skills. Based on a structural representation of the task “learning to read in a specific language” which captures linguistic expert knowledge, a profile (for each user) which reflects the users competence in mastering the reading skill is created and maintained. Based on the user’s profile as well as her reading history, a new personalized interactive activity eBook which contains educational content (ePub3 embeddable mini-games) appropriate for the current mastering level of the specific user is created on demand. We present in detail the main concepts behind this “authorless” activity book creation: domain modeling and user profiling, learner profile adaptation, personalized content selection.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Crossing-optimal acyclic hamiltonian path completion and its application to upward topological book embeddings",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00202-1_22",
            "Abstract": "Given an embedded planar acyclic digraph G, we define the problem of acyclic hamiltonian path completion with crossing minimization (Acyclic-HPCCM) to be the problem of determining a hamiltonian path completion set of edges such that, when these edges are embedded on G, they create the smallest possible number of edge crossings and turn G to an acyclic hamiltonian digraph. Our results include:                        1                                             We provide a characterization under which a triangulated st-digraph G is hamiltonian.                       1                                             For the class of planar st-digraphs, we establish an equivalence between the Acyclic-HPCCM problem and the problem of determining an upward 2-page topological book embedding with minimum number of spine crossings. Based on this equivalence we infer for the class of outerplanar triangulated st …We provide a characterization under which a triangulated st-digraph G is hamiltonian.For the class of planar st-digraphs, we establish an equivalence between the Acyclic-HPCCM problem and the problem of determining an upward 2-page topological book embedding with minimum number of spine crossings. Based on this equivalence we infer for the class of outerplanar triangulated st …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multi-stack boundary labeling problems",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11944836_10",
            "Abstract": "The boundary labeling problem was recently introduced in [5] as a response to the problem of labeling dense point sets with large labels. In boundary labeling, we are given a rectangle R which encloses a set of n sites. Each site is associated with an axis-parallel rectangular label. The main task is to place the labels in distinct positions on the boundary of R, so that they do not overlap, and to connect each site with its corresponding label by non-intersecting polygonal lines, so called leaders. Such a label placement is referred to as legal label placement.In this paper, we study boundary labeling problems along a new line of research. We seek to obtain labelings with labels arranged on more than one stacks placed at the same side of R. We refer to problems of this type as multi-stack boundary labeling problems.We present algorithms for maximizing the uniform label size for boundary …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:ufrVoPGSRksC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Boundary Labeling with Octilinear Leaders and Minimum Number of Leader-Bends",
            "Publication year": 2010,
            "Publication url": "http://www.wseas.us/e-library/conferences/2010/Malta/ACS/ACS-28.pdf",
            "Abstract": "A common task in the process of information visualization is the placement of textual labels on features of interest within an illustration. The interest in algorithms that automate this task has received considerable attention, due to the numerous applications that stem from diverse areas such as Cartography, Graph Drawing and Graphical Information Systems. Among various types of labeling models, boundary labeling addresses this problem by connecting each site-feature of the illustration to a label outside the illustration by using a leader, ie, a polygonal line from the feature to the label. In this paper, we study a variant of boundary labeling with octilinear leaders, ie, polygonal lines involving horizontal, vertical, and diagonal segments. Our main contribution is showing that minimizing the total number of leader-bends is hard.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Planar drawings of fixed-mobile bigraphs",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73915-1_33",
            "Abstract": "A fixed-mobile bigraph G is a bipartite graph such that the vertices of one partition set are given with fixed positions in the plane and the mobile vertices of the other part, together with the edges, must be added to the drawing. We assume that G is planar and study the problem of finding, for a given , a planar poly-line drawing of G with at most k bends per edge. In the most general case, we show NP-hardness. For  and under additional constraints on the positions of the fixed or mobile vertices, we either prove that the problem is polynomial-time solvable or prove that it belongs to NP. Finally, we present a polynomial-time testing algorithm for a certain type of “layered” 1-bend drawings.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Many-to-one boundary labeling with backbones",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-03841-4_22",
            "Abstract": "In this paper we study many-to-one boundary labeling with backbone leaders. In this model, a horizontal backbone reaches out of each label into the feature-enclosing rectangle. Feature points associated with this label are linked via vertical line segments to the backbone. We present algorithms for label number and leader-length minimization. If crossings are allowed, we aim to minimize their number. This can be achieved efficiently in the case of fixed label order. We show that the corresponding problem in the case of flexible label order is NP-hard.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Profile-Based Text Classification for Children with Dyslexia",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/article/profile-based-text-classification-for-children-with-dyslexia/145351",
            "Abstract": "Although extensive research has been conducted in the field of text-readability and user modelling, scholars and researchers have taken into consideration only linguistic complexity in order to classify a text as readable or not. In this paper, the authors move one step forward by considering one more factor, namely intended reader's skills, and by trying to study text readability from a user-specific perspective. Central to our approach is the notion of the user's profile which carries information regarding the linguistic difficulties a user with dyslexia may experience. Based on the user's profile, they develop heuristics for evaluating text's readability for the specific user. The developed heuristics are incorporated in the text classification services of the iLearnRW project, aiming to facilitate the selection of appropriate/suitable reading resources, written in English or Greek, for children with dyslexia1.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:WbkHhVStYXYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Multi-level caching with delayed-multicast for video-on-demand",
            "Publication year": 2003,
            "Publication url": "https://opus.lib.uts.edu.au/handle/10453/1805",
            "Abstract": "Delayed-Multicast is a novel transmission technique to support Video-on-Demand. It introduces buffers within the network to bridge the temporal delays between similar requests thus minimizing the aggregate bandwidth and server load. This paper introduces an improved online algorithm for resource allocation with Delayed-Multicast by utilizing prior knowledge of each clip's popularity. The algorithm is intended to be simple so as to allow for deployment at multiple levels in a distribution network. The result is greater backbone traffic savings and a corresponding reduction in the server load.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resource Allocation for Video-on-Demand with",
            "Publication year": 2002,
            "Publication url": "https://www.researchonline.mq.edu.au/vital/access/manager/Repository/mq:56283",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Piscataway, NJ: IEEE"
        },
        {
            "Title": "Two polynomial time algorithms for the metro-line crossing minimization problem",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00219-9_33",
            "Abstract": "The metro-line crossing minimization (MLCM) problem was recently introduced as a response to the problem of drawing metro maps or public transportation networks, in general. According to this problem, we are given a planar, embedded graph G = (V,E) and a set L of simple paths on G, called lines. The main task is to place the lines on G, so that the number of crossings among pairs of lines is minimized.Our main contribution is two polynomial time algorithms. The first solves the general case of the MLCM problem, where the lines that traverse a particular vertex of G are allowed to use any side of it to either “enter” or “exit”, assuming that the endpoints of the lines are located at vertices of degree one. The second one solves more efficiently the restricted case, where only the left and the right side of each vertex can be used.To the best of our knowledge, this is the first time where the …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Many-to-One Boundary Labeling with Backbones.",
            "Publication year": 2015,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.731.3033&rep=rep1&type=pdf",
            "Abstract": "We study a boundary labeling problem, where multiple points may connect to the same label. In this new many-to-one model, a horizontal backbone reaches out of each label into the feature-enclosing rectangle. Feature points that need to be connected to this label are linked via vertical line segments to the backbone. We present dynamic programming algorithms for minimizing the total number of label occurrences and for minimizing the total leader length of crossing-free backbone labelings. When crossings are allowed, we aim at obtaining solutions with the minimum number of crossings. This can be achieved efficiently in the case of fixed label order; however, in the case of flexible label order we show that minimizing the number of leader crossings is NP-hard.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Combining problems on RAC drawings and simultaneous graph drawings",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-25878-7_41",
            "Abstract": "We present an overview of the first combinatorial results for the so-called geometric RAC simultaneous drawing problem (or GRacSim drawing problem, for short), i.e., a combination of problems on geometric RAC drawings [3] and geometric simultaneous graph drawings [2]. According to this problem, we are given two planar graphs G 1 = (V, E 1) and G 2 = (V, E 2) that share a common vertex set but have disjoint edge sets, i.e., E 1 ⊆ V ×V , E 2 ⊆ V ×V and E 1 ∩ E 2 = ∅ The main task is to place the vertices on the plane so that, when the edges are drawn as straight-lines, (i) each graph is drawn planar, (ii) there are no edge overlaps, and, (iii) crossings between edges in E 1 and E 2 occur at right angles.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:blknAaTinKkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Graph Drawing",
            "Publication year": 2014,
            "Publication url": "http://www.math.ntua.gr/~symvonis/teaching/graph_visualization_material/lectures/gd-fs20-00-organisational.pdf",
            "Abstract": "Greedy-Algorithmus fur Set Cover Page 1 1 Graph Drawing Organisational matters Antonios \nSymvonis · Chrysanthi Raftopoulou Fall semester 2020 Page 2 2-1 Organisational Lectures ■ \nFriday 3-5pm, webex Page 3 2-2 Organisational Lectures ■ Friday 3-5pm, webex Evaluation \n■ written exam: 60% ■ Programming assignments: 30% ■ Written assignments: 10% Notes \n1. Submission of programming assignment is required in order to participate in final exam. 2. \nSubmit homework through “mycourses” Page 4 3 Organisational Lecture material – Slides ■ \nMaterial produced by researcher at: ■ Karlsruhe Institute of Technology (KIT) ■ TU Wien ■ \nU Wuerzburg ■ U Konstanz ■ On-going community effort ■ Hosted at U Wuerzburg Page \n5 4 Books M. Kaufmann, D. Wagner: Drawing Graphs: Methods and Models Springer, 2001 \nG. Di Battista, P. Eades, R. Tamassia, I. Tollis: Graph Drawing: Algorithms for the of Hall, …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:D_sINldO8mEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Boundary labeling: Models and efficient algorithms for rectangular maps",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772106000447",
            "Abstract": "We introduce boundary labeling, a new model for labeling point sites with large labels. According to the boundary-labeling model, labels are placed around an axis-parallel rectangle that contains the point sites, each label is connected to its corresponding site through a polygonal line called leader, and no two leaders intersect. Although boundary labeling is commonly used, e.g., for technical drawings and illustrations in medical atlases, this problem has not yet been studied in the literature. The problem is interesting in that it is a mixture of a label-placement and a graph-drawing problem.In this paper we investigate several variants of the boundary-labeling problem. We consider labels of identical or different size, straight-line or rectilinear leaders, fixed or sliding ports for attaching leaders to sites and attaching labels to one, two or all four sides of the bounding rectangle. For any variant of the boundary labeling …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Geometric Representations of Dichotomous Ordinal Data",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-30786-8_16",
            "Abstract": "Motivated by the study of ordinal embeddings in machine learning and by the recognition of Euclidean preferences in computational social science, we study the following problem. Given a graph G, together with a set of relationships between pairs of edges, each specifying that an edge must be longer than another edge, is it possible to construct a straight-line drawing of G satisfying all these relationships?We mainly consider a dichotomous setting, in which edges are partitioned into short and long, as otherwise there are simple (planar) instances that do not admit a solution. Since the problem is NP-hard even in this setting, we study under which conditions a solution always exists. We prove that degeneracy-2 graphs, subcubic graphs, double-wheels, and 4-colorable graphs in which the short edges induce a caterpillar always admit a realization. These positive results are complemented by …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:tkaPQYYpVKoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "iRead: Infrastructure and Integrated Tools for Personalized Learning of Reading Skill",
            "Publication year": 2020,
            "Publication url": "https://mgdlt.library.upatras.gr/iisa/article/view/3316",
            "Abstract": "iRead is the acronym for the “Infrastructure and integrated tools for personalized learning of reading skills\" European Union Horizon-2020 funded project This report briefly presents the iRead project (consortium composition, aims and objectives, current status and achievements, future work).",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dimension-exchange algorithms for token distribution on tree-connected architectures",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743731504000462",
            "Abstract": "Load balancing on a multi-processor system involves redistributing tasks among processors so that each processor has roughly the same amount of work to perform. The token-distribution problem is a static variant of the load balancing problem for the case in which the workloads in the system cannot be divided arbitrarily; that is, where each token represents an atomic element of work. A scalable method for distributing tokens over a parallel architecture is the so-called dimension-exchange approach. Our results include improved analysis of two existing dimension-exchange algorithms for token distribution on arbitrary graphs and on arbitrary trees, respectively. In particular, we establish a logarithmic upper bound on the discrepancy of the resulting distribution when the second algorithm is applied to an arbitrary initial distribution on a tree. We then present a new dimension-exchange algorithm for token distribution …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "One-bend drawings of outerplanar graphs inside simple polygons",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2108.12321",
            "Abstract": "We consider the problem of drawing an outerplanar graph with  vertices with at most one bend per edge if the outer face is already drawn as a simple polygon. We prove that it can be decided in  time if such a drawing exists, where  is the number of interior edges. In the positive case, we can also compute such a drawing.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:eq2jaN3J8jMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detecting periodicity in serial data through visualization",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33191-6_29",
            "Abstract": "Detecting suspicious or malicious user behavior in large networks is an essential task for administrators which requires significant effort due to the huge amount of log data to be processed. However, several of these activities can be rapidly identified since they usually demonstrate periodic behavior. For instance, periodic activities by specific users accessing the billing system of a financial institution may conceal fraud. Detecting periodicity in user behavior not only offers security to the network, but may prevent future malicious activities. In this paper, we present visualization techniques that aim to detect authorized (or unauthorized) user activities that seem to appear at regular time intervals.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optimal acyclic hamiltonian path completion for outerplanar triangulated st-digraphs (with application to upward topological book embeddings)",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0807.2330",
            "Abstract": "Given an embedded planar acyclic digraph G, we define the problem of \"acyclic hamiltonian path completion with crossing minimization (Acyclic-HPCCM)\" to be the problem of determining an hamiltonian path completion set of edges such that, when these edges are embedded on G, they create the smallest possible number of edge crossings and turn G to a hamiltonian digraph. Our results include: --We provide a characterization under which a triangulated st-digraph G is hamiltonian. --For an outerplanar triangulated st-digraph G, we define the st-polygon decomposition of G and, based on its properties, we develop a linear-time algorithm that solves the Acyclic-HPCCM problem with at most one crossing per edge of G. --For the class of st-planar digraphs, we establish an equivalence between the Acyclic-HPCCM problem and the problem of determining an upward 2-page topological book embedding with minimum number of spine crossings. We infer (based on this equivalence) for the class of outerplanar triangulated st-digraphs an upward topological 2-page book embedding with minimum number of spine crossings and at most one spine crossing per edge. To the best of our knowledge, it is the first time that edge-crossing minimization is studied in conjunction with the acyclic hamiltonian completion problem and the first time that an optimal algorithm with respect to spine crossing minimization is presented for upward topological book embeddings.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Vertex-Coloring with Defects.",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Michael-Bekos/publication/313086783_Vertex-Coloring_with_Defects/links/58cfb42ca6fdccff68e2de94/Vertex-Coloring-with-Defects.pdf",
            "Abstract": "Defective coloring is a variant of the traditional vertex-coloring in which adjacent vertices are allowed to have the same color, as long as the induced monochromatic components have a certain structure. Due to its important applications, as for example in the bipartisation of graphs, this type of coloring has been extensively studied, mainly with respect to the size, degree, diameter, and acyclicity of the monochromatic components. We focus on defective colorings with κ colors in which the monochromatic components are acyclic and have small diameter, namely we consider (edge, κ)-colorings, in which the monochromatic components have diameter 1, and (star, κ)-colorings, in which they have diameter 2. We prove that the (edge, 3)-coloring problem remains NP-complete even for graphs with maximum vertex-degree 6, hence answering an open question posed by Cowen et al.[9], and for planar graphs with maximum vertex-degree 7, and we prove that the (star, 3)-coloring problem is NP-complete even for planar graphs with bounded maximum vertex-degree. On the other hand, we give linear-time algorithms for testing the existence of (edge, 2)-colorings and of (star, 2)-colorings of partial 2-trees. Finally, we prove that outerpaths, a notable subclass of outerplanar graphs, always admit (star, 2)-colorings.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "\" Scheduled-multicast\" with application in multimedia networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/875788/",
            "Abstract": "We introduce a novel transmission technique, termed \"scheduled-multicast\". Scheduled-multicast uses existing or additional memory at internal nodes in the transmission paths from the server to the clients to buffer the data stream, and effectively reduce the bandwidth requirements. We designed a new protocol, scheduled-multicast protocol (SMP), and implemented a prototype system employing SMP to test out the feasibility of scheduled-multicast. The results from our experiments shows that SMP can greatly increase the scalability of the system (i.e., the number of concurrent clients who can be serviced) at a very small cost to the processor utilization. Given the positive results from our prototype, we believe SMP can be used to greatly enhance the scalability of large VoD systems at minimal infrastructure cost.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Area-feature boundary labeling",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8130771/",
            "Abstract": "Boundary labeling is a relatively new labeling method. It can be useful in automating the production of technical drawings and medical drawings, where it is common to explain certain parts of the drawing with text labels, arranged on its boundary so that other parts of the drawing are not obscured. In boundary labeling, we are given a rectangle R which encloses a set of n sites. Each site s is associated with an axis-parallel rectangular label l s . The labels must be placed in distinct positions on the boundary of R and they must be connected to their corresponding sites with polygonal lines, called leaders, so that the labels are pairwise disjoint and the leaders do not intersect each other. In this paper, we study a version of the boundary labeling problem where the sites can ‘float’ within a polygonal region. We present a polynomial time algorithm, which runs in O(n 3 ) time and produces a labeling of minimum total …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:kNdYIx-mwKoC",
            "Publisher": "OUP"
        },
        {
            "Title": "Colored simultaneous geometric embeddings and universal pointsets",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-010-9433-x",
            "Abstract": "Universal pointsets can be used for visualizing multiple relationships on the same set of objects or for visualizing dynamic graph processes. In simultaneous geometric embeddings, the same point in the plane is used to represent the same object as a way to preserve the viewer’s mental map. In colored simultaneous embeddings this restriction is relaxed, by allowing a given object to map to a subset of points in the plane. Specifically, consider a set of graphs on the same set of n vertices partitioned into k colors. Finding a corresponding set of k-colored points in the plane such that each vertex is mapped to a point of the same color so as to allow a straight-line plane drawing of each graph is the problem of colored simultaneous geometric embedding.For n-vertex paths, we show that there exist universal pointsets of size n, colored with two or three colors. We use this result to construct colored …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Upward Geometric Graph Embeddings into Point Sets",
            "Publication year": 2010,
            "Publication url": "https://infoscience.epfl.ch/record/158713",
            "Abstract": "Upward Geometric Graph Embeddings into Point Sets - Infoscience English Français login \nHome > Upward Geometric Graph Embeddings into Point Sets Infoscience Information Usage \nstatistics Files Upward Geometric Graph Embeddings into Point Sets Brandes, Ulrik ; Angelini, \nPatrizio ; Frati, Fabrizio ; Geyer, Markus ; Kaufmann, Michael ; Mchedlidze, Tamara ; Symvonis, \nAntonios Published in: 18th International Symposium on Graph Drawing (GD '10) Year: 2010 \nNote: To appear Laboratories: DCG Record appears in: Scientific production and competences \n> SB - School of Basic Sciences > MATH - Institute of Mathematics > DCG - Chair of \nCombinatorial Geometry Scientific production and competences > SB - School of Basic Sciences \n> Mathematics Peer-reviewed publications Work outside EPFL Conference Papers Published \nExport as: BibTeX | MARC | MARCXML | DC | EndNote | NLM | RefWorks | RIS View as…",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent-dysl: A novel intelligent reading system for dyslexic learners",
            "Publication year": 2007,
            "Publication url": "http://www.proyectoscprgijon.es/erasmus/agent-dysl/Agent-dysl.pdf",
            "Abstract": "In this paper we present a novel approach for facilitating dyslexic children in learning to read fluently. We explain the motivation, general idea and initial results in terms of user requirements and system architecture. Unlike previously presented approaches, the aim of this system is to monitor the progress and perspectives of a dyslexic user and supply personalised help, taking advantage of modern ICT features. The goal of this personalised help is to gradually increase the reading capabilities of the user, gradually diminish the assistance provided, till he is able to read as a non-dyslexic learner.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Drawing Planar Graphs with Few Segments on a Polynomial Grid",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=BMDADwAAQBAJ&oi=fnd&pg=PA416&dq=info:QLTWyxrzEhkJ:scholar.google.com&ots=AFPY-E9vqX&sig=g22X4cm5VUa7-KRjOjvYF9Xkn9w",
            "Abstract": "The visual complexity of a graph drawing can be measured by the number of geometric objects used for the representation of its elements. In this paper, we study planar graph drawings where edges are represented by few segments. In such a drawing, one segment may represent multiple edges forming a path. Drawings of planar graphs with few segments were intensively studied in the past years. However, the area requirements were only considered for limited subclasses of planar graphs. In this paper, we show that trees have drawings with 3n/4− 1 segments and n2 area, improving the previous result of O (n3. 58). We also show that 3-connected planar graphs and biconnected outerplanar graphs have a drawing with 8n/3− O (1) and 3n/2− O (1) segments, respectively, and O (n3) area.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Polygon labelling of minimum leader length",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/38452343/APVIS06.pdf",
            "Abstract": "We study a variation of the boundary labelling model, with floating sites, labels of uniform size placed in fixed positions on the boundary (that encloses all sites) and special type leaders connecting labels to sites. We seek to obtain a labelling of all sites with leaders that are non-overlapping and have minimum total length. We present an O (n2 log3 n) time algorithm for the labelling of polygons.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Labeling of Collinear Sites.",
            "Publication year": 2008,
            "Publication url": "http://www.jgaa.info/accepted/2008/BekosKaufmannSymvonis2008.12.3.pdf",
            "Abstract": "In this paper we study the map labeling problem where the sites to be labeled are restricted to a line L. Previous models studied in the map labeling literature fail to produce label placements (ie place each label next to the site it describes) without label overlaps for certain instances of the problem with dense point sets. To address this problem, we propose a new approach according to which, given n sites each associated with an axis-parallel rectangular label, we aim to place the labels in distinct positions on the “boundary” of L so that they do not overlap and do not obscure the site set, and to connect each label with its associated site through a leader such that no two leaders intersect. We evaluate our labeling model under two minimization criteria:(i) total leader length and (ii) total number of leader bends. We show that both problems are NP-complete if the labels can be placed on both sides of L, while we present polynomial time algorithms for the case where the labels can be placed on only one side of L.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dimension-exchange algorithms for load balancing on trees",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.89.2650",
            "Abstract": "This paper considers dimension-exchange algorithms for load balancing on trees with finitely-divisible loads (token distribution). We present improved analysis of an existing protocol, and in particular, establish a logarithmic upper bound on the discrepancy of the final distribution. Our second contribution is a new algorithm, which assuming each node has knowledge of the total number of nodes, determines a perfectly balanced distribution.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low ply drawings of trees",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50106-2_19.pdf",
            "Abstract": "We consider the recently introduced model of low ply graph drawing, in which the ply-disks of the vertices do not have many common overlaps, which results in a good distribution of the vertices in the plane. The ply-disk of a vertex in a straight-line drawing is the disk centered at it whose radius is half the length of its longest incident edge. The largest number of ply-disks having a common overlap is called the ply-number of the drawing.We focus on trees. We first consider drawings of trees with constant ply-number, proving that they may require exponential area, even for stars, and that they may not even exist for bounded-degree trees. Then, we turn our attention to drawings with logarithmic ply-number and show that trees with maximum degree 6 always admit such drawings in polynomial area.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On upward point set embeddability",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772112001630",
            "Abstract": "We study the problem of upward point set embeddability, that is the problem to decide whether an n-vertex directed graph has an upward planar drawing when its vertices have to be placed on the points of a given point set of size n. We first present some positive and negative results concerning directed trees and convex point sets. Next, we prove that upward point set embeddability can be solved in polynomial time for the case of a directed tree and a convex point set. Further, we extend our approach to the class of outerplanar directed graphs. This implies that upward point set embeddability can be efficiently solved for the case of convex point sets. Finally, we show that the general problem of upward point set embeddability is NP-complete even for 2-convex point sets.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:BqipwSGYUEgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Line crossing minimization on metro maps",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77537-9_24",
            "Abstract": "We consider the problem of drawing a set of simple paths along the edges of an embedded underlying graph G = (V,E), so that the total number of crossings among pairs of paths is minimized. This problem arises when drawing metro maps, where the embedding of G depicts the structure of the underlying network, the nodes of G correspond to train stations, an edge connecting two nodes implies that there exists a railway line which connects them, whereas the paths illustrate the lines connecting terminal stations. We call this the metro-line crossing minimization problem (MLCM).In contrast to the problem of drawing the underlying graph nicely, MLCM has received fewer attention. It was recently introduced by Benkert et. al in [4] . In this paper, as a first step towards solving MLCM in arbitrary graphs, we study path and tree networks. We examine several variations of the problem for which we …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Crossing-free acyclic hamiltonian path completion for planar st-digraphs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10631-6_89",
            "Abstract": "In this paper we study the problem of existence of a crossing-free acyclic hamiltonian path completion (for short, HP-completion) set for embedded upward planar digraphs. In the context of book embeddings, this question becomes: given an embedded upward planar digraph G, determine whether there exists an upward 2-page book embedding of G preserving the given planar embedding.Given an embedded st-digraph G which has a crossing-free HP-completion set, we show that there always exists a crossing-free HP-completion set with at most two edges per face of G. For an embedded N-free upward planar digraph G, we show that there always exists a crossing-free acyclic HP-completion set for G which, moreover, can be computed in linear time. For a width-k embedded planar st-digraph G, we show that it can be efficiently tested whether G admits a crossing-free acyclic HP-completion set.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Incorporating Speech Recognition Engine into an Intelligent Assistive Reading System for Dyslexic Students",
            "Publication year": 2011,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2011/i11_2993.pdf",
            "Abstract": "In this paper we present an approach for incorporating a state of the art speech recognition engine into a novel assistive reading system for Greek dyslexic students. This system is being developed in the framework of the AGENT-DYSL IST project, and facilitates dyslexic children in learning to read fluently. Unlike previously presented approaches, the aim of this system is to monitor the progress and perspectives of a dyslexic user and supply personalised help. The goal of this help is to gradually increase the reading capabilities of the user, gradually diminish the assistance provided, till he is able to read as a non-dyslexic reader.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards evidence-informed design principles for adaptive reading games",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3290607.3313256",
            "Abstract": "This demonstration presents the design principles of the Navigo games for reading. By reflecting on our design tools and processes we explore the way theory, empirical evidence and best practice and expertise have informed our design. We look into the reciprocal role of theory and design and provide transferable lessons for design of educational technologies in the context of HCI.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Occupational fraud detection through visualization",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6578773/",
            "Abstract": "Occupational fraud affects many companies causing them economic loss and liability issues towards their clients and other entities. Detecting internal fraud requires significant effort since a huge amount of data produced by diverse systems (which are mostly in textual form) has to be processed with little automated support. In this paper, we exploit the advantages of information visualization and present a system that aims to detect occupational fraud in systems which involve a pair of entities (e.g., an employee and a client). The main visualization is a spiral on which the events are drawn according to their time-stamp. Suspicious events are considered those which appear along the same radius or on close radii. The system ranks both entities according to the specifications of the auditor and a video file of their activity is generated such that events with strong evidence of fraud appear first. The system is equipped with …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A data-logging mechanism to support e-learning systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388122/",
            "Abstract": "User profiling and e-learning have received great attention in the last years. In a learning environment, user profiling provides historical data of the students' performance on different learning subjects. e-Learning tools such as serious games can collect user's data and build a user profile by appropriate storing these information. Thus, by combining above techniques and analysing each user's data a teacher can provide personalized treatment to her/his students. In this paper we present our solution on storing and analysing user data on a centralized server. Our system stores data collected from users with dyslexia. We maintain one user profile per student from data taken from a) user responses on a screening test and b) from user's performance on a set of serious games. The learning process then depends on the above data, so it is important to store and analyse our resources efficiently while respecting the user's …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monotone Drawings of k-Inner Planar Graphs",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-04414-5_24",
            "Abstract": "A k-inner planar graph is a planar graph that has a plane drawing with at most k internal vertices, i.e., vertices that do not lie on the boundary of the outer face of its drawing. An outerplanar graph is a 0-inner planar graph. In this paper, we show how to construct a monotone drawing of a k-inner planar graph on a  grid. In the special case of an outerplanar graph, we can produce a planar monotone drawing on a  grid, improving the results in [2, 11].",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Low ply graph drawing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388020/",
            "Abstract": "We consider the problem of characterizing graphs with low ply number and algorithms for creating layouts of graphs with low ply number. Informally, the ply number of a straight-line drawing of a graph is defined as the maximum number of overlapping disks, where each disk is associated with a vertex and has a radius that is half the length of the longest edge incident to that vertex. We show that internally triangulated biconnected planar graphs that admit a drawing with ply number 1 can be recognized in O(n log n) time, while the problem is in general NP-hard. We also show several classes of graphs that have 1-ply drawings. We then show that binary trees, stars, and caterpillars have 2-ply drawings, while general trees have (h+1)-ply drawings, where h is the height of the tree. Finally we discuss some generalizations of the notion of a ply number.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Grid drawings of graphs with constant edge-vertex resolution",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925772121000456",
            "Abstract": "We study the algorithmic problem of computing drawings of graphs in which (i) each vertex is a disk with fixed radius ρ,(i i) each edge is a straight-line segment connecting the centers of the two disks representing its end-vertices,(i i i) no two disks intersect, and (i v) the distance between an edge segment and the center of a non-incident disk, called edge-vertex resolution, is at least ρ. We call such drawings disk-link drawings. In this paper we focus on the case of constant edge-vertex resolution, namely ρ= 1 2 (ie, disks of unit diameter). We prove that star graphs, which trivially admit straight-line drawings in linear area, require quadratic area in any such disk-link drawing. On the positive side, we present constructive techniques that yield improved upper bounds for the area requirements of disk-link drawings for several (planar and nonplanar) graph classes, including bounded bandwidth, complete, and planar …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:5awf1xo2G04C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Lower bounds for one-to-one packet routing on trees using hot-potato algorithms",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8129540/",
            "Abstract": "In this paper, we consider hot-potato packet routing of one-to-one routing patterns on -node trees. By applying a ‘charging argument’, we show that any greedy hot-potato algorithm routes a one-to-one routing pattern within  steps. On the other hand, a trivial lower bound suggests that at least  steps are required by any oblivious greedy algorithm. As the main contribution of the paper, we tighten the  upper bound by constructing (for all sufficiently large ) an elaborate one-to-one packet routing problem on an -node tree for which an oblivious greedy hot-potato algorithm requires at least  steps. This improved lower bound is also shown to be valid for the minimum-distance heuristic. For trees of maximum degree , we establish a lower bound of  routing steps.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:k_IJM867U9cC",
            "Publisher": "OUP"
        },
        {
            "Title": "Lower bounds for hot-potato permutation routing on trees.",
            "Publication year": 2000,
            "Publication url": "http://math.ntua.gr/~symvonis/publications/c_2000_RSW_Lower%20Bounds%20for%20Hot-Potato%20Permutation%20Routing%20on%20Trees.pdf",
            "Abstract": "In this paper we consider hot-potato packet routing on trees. As a lower bound, for all sufficiently large n we construct a permutation routing problem on an n-node tree for which an oblivious greedy hot-potato algorithm requires at least 2n, on time steps. This lower bound is also valid for the minimumdistance heuristic. Applying the charging argument of Borodin et al.[8] we establish that any greedy hot-potato algorithm routes a permutation on a tree within 2 n, 1 steps.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spine crossing minimization in upward topological book embeddings",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00219-9_48",
            "Abstract": "An upward topological book embedding of a planar st-digraph G is an upward planar drawing of G such that its vertices are aligned along the vertical line, called the spine, and each edge is represented as a simple Jordan curve which is divided by the intersections with the spine (spine crossings) into segments such that any two consecutive segments are located at opposite sides of the spine. When we treat the problem of obtaining an upward topological book embedding as an optimization problem, we are naturally interested in embeddings with the minimum possible number of spine crossing.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Video-on-demand based on delayed-multicast: Algorithmic support",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8129888/",
            "Abstract": "In this paper, we examine algorithmic issues related to the delayed multicast technique for video-on-demand delivery. We introduce the minimum total memory (MTM), minimum total traffic (MTT) and the minimum maximum memory per node (MMMN) delayed-multicast allocation problems. We examine these problems on two networks of practical interest, namely, the chandelier and the broom networks. We provide polynomial time algorithms for solving the MTM and the MTT problems on the chandelier network and the MTM problem on the broom network. We also show that a version of the decision-MMMN problem on a general graph is NP-complete. Finally, we present a heuristic method for obtaining a solution for the MTM problem on tree networks.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:TFP_iSt0sucC",
            "Publisher": "OUP"
        },
        {
            "Title": "Evaluating new approaches of intervention in reading difficulties in students with dyslexia: the iLearnRW software application",
            "Publication year": 2017,
            "Publication url": "https://core.ac.uk/download/pdf/234640997.pdf",
            "Abstract": "The aim of this paper is to increase knowledge and understanding on how the implementation of language content through specialized software, such as the “Integrated Intelligent Learning Environment for Reading and Writing-iLearnRW”, can enhance learning during intervention procedures to enhance reading skills for children with dyslexia. The iLearnRW software is a newly designed tool that makes use of innovative technology and provides individualized intervention through games that incorporate learning activities, addressing those language areas that are most challenging for children with dyslexia in a highly entertaining and motivating way. Individualized intervention is provided through an underlying user profile, which incorporates these language features and is constantly updated as the child uses the software playing games, presenting language material selected based on his difficulties and recording his progress. A group of 78 students (52 male, 26 female) diagnosed with dyslexia, aged between 9 and 11 years old, was assessed for phonological, morphological and vocabulary skills. The students logged in the iLearnRW software on a mean of 14.18 days over a six-month intervention. After the 6-month intervention, the students were assessed once again on the same skills so as to establish the tool’s effectiveness. The results’ analysis revealed the following:(i) there was a strong constructional linkage between the profile entries of the sample, the language content of the tasks of the screening test as well of the games and its effectiveness in the students’ performance;(ii) the students who received specific guidance by their …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Upward point-set embeddability",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18381-2_23",
            "Abstract": "We study the problem of Upward Point-Set Embeddability, that is the problem of deciding whether a given upward planar digraph D has an upward planar embedding into a point set S. We show that any switch tree admits an upward planar straight-line embedding into any convex point set. For the class of k-switch trees, that is a generalization of switch trees (according to this definition a switch tree is a 1-switch tree), we show that not every k-switch tree admits an upward planar straight-line embedding into any convex point set, for any k ≥ 2. Finally we show that the problem of Upward Point-Set Embeddability is NP-complete.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The straight-line RAC drawing problem is NP-hard",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18381-2_6",
            "Abstract": "Recent cognitive experiments have shown that the negative impact of an edge crossing on the human understanding of a graph drawing, tends to be eliminated in the case where the crossing angles are greater than 70 degrees. This motivated the study of RAC drawings, in which every pair of crossing edges intersects at right angle. In this work, we demonstrate a class of graphs with unique RAC combinatorial embedding and we employ members of this class in order to show that it is -hard to decide whether a graph admits a straight-line RAC drawing.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Metro-Line Crossing Minimization.",
            "Publication year": 2010,
            "Publication url": "http://emis.dsd.sztaki.hu/journals/JGAA/accepted/2010/ArgyriouBekosKaufmannSymvonis2010.14.1.pdf",
            "Abstract": "We consider the problem of drawing a set of simple paths along the edges of an embedded underlying graph G=(V, E) so that the total number of crossings among pairs of paths is minimized. This problem arises when drawing metro maps, where the embedding of G depicts the structure of the underlying network, the nodes of G correspond to train stations, an edge connecting two nodes implies that there exists a railway track connecting them, whereas the paths illustrate the metro lines connecting terminal stations. We call this the metro-line crossing minimization problem (MLCM). We examine several variations of the problem for which we develop algorithms that yield optimal solutions.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boundary labelling of optimal total leader length",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_8",
            "Abstract": "In this paper, we consider the leader length minimization problem for boundary labelling, i.e. the problem of finding a legal leader-label placement, such that the total leader length is minimized. We present an O(n 2 log 3 n) algorithm assuming type-opo leaders (rectilinear lines with either zero or two bends) and labels of uniform size which can be attached to all four sides of rectangle R. Our algorithm supports fixed and sliding ports, i.e., the point where each leader is connected to the label (referred to as port) may be fixed or may slide along a label edge.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Analysis of the Greek Web-space",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.109.7167&rep=rep1&type=pdf",
            "Abstract": "In this paper, we report on our efforts to identify important Greek web sites on the web by analyzing the link structure of Greek web sites. Towards this end, five independent graph-theoretic methods have been deployed: hub and authority, page rank, Bow-Tie structure, core analysis and degree distribution. Our findings indicate that government, non-profit and educational sites are amongst the most important in the Greek web space.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coloring outerplanar graphs and planar 3-trees with small monochromatic components",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1911.10863",
            "Abstract": "In this work, we continue the study of vertex colorings of graphs, in which adjacent vertices are allowed to be of the same color as long as each monochromatic connected component is of relatively small cardinality. We focus on colorings with two and three available colors and present improved bounds on the size of the monochromatic connected components for two meaningful subclasses of planar graphs, namely maximal outerplanar graphs and complete planar 3-trees.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Drawing trees in a streaming model",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11805-0_28",
            "Abstract": "We introduce a data stream model of computation for Graph Drawing, where a source produces a graph one edge at a time. When an edge is produced, it is immediately drawn and its drawing can not be altered. The drawing has an image persistence, that controls the lifetime of edges. If the persistence is k, an edge remains in the drawing for the time spent by the source to generate k edges, then it fades away. In this model we study the area requirement of planar straight-line grid drawings of trees, with different streaming orders, layout models, and quality criteria. We assess the output quality of the presented algorithms by computing the competitive ratio with respect to the best known offline algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computing upward topological book embeddings of upward planar digraphs",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77120-3_17",
            "Abstract": "This paper studies the problem of computing an upward topological book embedding of an upward planar digraph G, i.e. a topological book embedding of G where all edges are monotonically increasing in the upward direction. Besides having its own inherent interest in the theory of upward book embeddability, the question has applications to well studied research topics of computational geometry and of graph drawing. The main results of the paper are as follows.   Every upward planar digraph G with n vertices admits an upward topological book embedding such that every edge of G crosses the spine of the book at most once.   Every upward planar digraph G with n vertices admits a point-set embedding on any set of n distinct points in the plane such that the drawing is upward and every edge of G has at most two bends …Every upward planar digraph G with n vertices admits an upward topological book embedding such that every edge of G crosses the spine of the book at most once.Every upward planar digraph G with n vertices admits a point-set embedding on any set of n distinct points in the plane such that the drawing is upward and every edge of G has at most two bends …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fan-planarity: Properties and complexity",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397515003515",
            "Abstract": "In a fan-planar drawing of a graph an edge can cross only edges with a common end-vertex. Fan-planar drawings have been recently introduced by Kaufmann and Ueckerdt [35], who proved that every n-vertex fan-planar drawing has at most 5 n− 10 edges, and that this bound is tight for n≥ 20. We extend their result from both the combinatorial and the algorithmic point of view. We prove tight bounds on the density of constrained versions of fan-planar drawings and study the relationship between fan-planarity and k-planarity. Also, we prove that testing fan-planarity in the variable embedding setting is NP-complete.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Greedy rectilinear drawings",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0304397519304542",
            "Abstract": "A drawing of a graph is greedy if for each ordered pair of vertices u and v, there is a path from u to v such that the Euclidean distance to v decreases monotonically at every vertex of the path. From an application perspective, greedy drawings are especially relevant to support routing schemes in ad hoc wireless networks. The existence of greedy drawings has been widely studied under different topological and geometric constraints, such as planarity, face convexity, and drawing succinctness. We introduce greedy rectilinear drawings, where edges are horizontal or vertical segments. These drawings have several properties that improve human readability and support network routing.We address the problem of testing whether a planar rectilinear representation, i.e., a plane graph with prescribed vertex angles, admits a greedy rectilinear drawing. We give a characterization, a linear-time testing algorithm, and a full …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:1qzjygNMrQYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Resource allocation for video-on-demand with\" delayed-multicast\" protocol",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1188506/",
            "Abstract": "\"Delayed-multicast\" is a novel transmission technique which uses internal nodes in the transmission paths from the server to the clients to buffer data streams. The buffers are used to service later requests without having to start new streams from the server, thus bringing the benefits of traditional multicast without the constraint that all requests must be serviced at the same time. We describe our new scalable \"delayed-multicast\" framework and present an optimal resource allocation algorithm that minimizes the total bandwidth required to service a set of requests.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smooth orthogonal layouts",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-36763-2_14",
            "Abstract": "We study the problem of creating smooth orthogonal layouts for planar graphs. While in traditional orthogonal layouts every edge is made of a sequence of axis-aligned line segments, in smooth orthogonal layouts every edge is made of axis-aligned segments and circular arcs with common tangents. Our goal is to create such layouts with low edge complexity, measured by the number of line and circular arc segments. We show that every biconnected 4-planar graph has a smooth orthogonal layout with edge complexity 3. If the input graph has a complexity-2 traditional orthogonal layout, we can transform it into a smooth complexity-2 layout. Using the Kandinsky model for removing the degree restriction, we show that any planar graph has a smooth complexity-2 layout.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Boundary labeling with octilinear leaders",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-69903-3_22",
            "Abstract": "A major factor affecting the readability of an illustration that contains textual labels is the degree to which the labels obscure graphical features of the illustration as a result of spatial overlaps. Boundary labeling addresses this problem by attaching the labels to the boundary of a rectangle that contains all features. Then, each feature should be connected to its associated label through a polygonal line, called leader, such that no two leaders intersect.In this paper we study the boundary labeling problem along a new line of research, according to which different pairs of type leaders (i.e. do and pd, od and pd) are combined to produce boundary labelings. Thus, we are able to overcome the problem that there might be no feasible solution when labels are placed on different sides and only one type of leaders is allowed. Our main contribution is a new algorithm for solving the total leader length …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On the Routing Number of Complete d-ARY Trees",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0129054101000564",
            "Abstract": "We consider the routing number of trees, denoted by rt(), with respect to the matching routing model. For an arbitrary n-node tree T, it is known that rt(T) < 3n/2 + O(log n). In this paper, by providing a recursive off-line permutation routing algorithm, we show that the routing number of an n-node complete d-ary tree of height h(T) > 1 is bounded from above by n + o(n). This is near optimal since, for an n-node complete d-ary tree T of height h(T) > 1 it holds that rt(T) ≥ n.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:YFjsv_pBGBYC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Boundary labeling with octilinear leaders",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-009-9283-6",
            "Abstract": "An illustration with textual labels may be hard to read if the labels overlap parts of the illustration. Boundary labeling addresses this problem by attaching the labels to the boundary of a rectangle that contains all features. Then, each feature should be connected to its associated label through a polygonal line, called leader, such that no two leaders intersect.In this paper we study the boundary labeling problem with octilinear leaders, i.e., leaders involving horizontal, vertical, and diagonal segments. In order to produce crossing-free boundary labelings, we combine different pairs of octilinear leaders. Thus, we are able to overcome infeasibility problems that might arise if only a single type of leader is allowed. Our main contribution is a new algorithm for solving the total leader length minimization problem (i.e., the problem of finding a crossing-free boundary labeling, such that the total leader length is …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "On ρ-constrained upward topological book embeddings",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11805-0_40",
            "Abstract": "Giordano, Liotta and Whitesides [1] developed an algorithm that, given an embedded planar st-digraph and a topological numbering ρ of its vertices, computes in O(n2) time a ρ-constrained upward topological book embedding with at most 2n–4 spine crossings per edge. The number of spine crossings per edge is asymptotically worst case optimal.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Interactive Personalized eBooks for Education",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8633663/",
            "Abstract": "In the past years, more and more research is carried out in order to incorporate new technologies to modern educational systems. This process does not only provide new means as alternatives to older ones (like printed books) but also fundamentally changes the educational process. Perhaps the biggest advantage new technologies have to offer is the ability to provide a personalized learning experience to each student according to their demands and abilities. In this paper we describe a new design that makes use of the latest eBook standard's (ePub3) features, in order to create a personalized system for learning.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the construction of increasing-chord graphs on convex point sets",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7388028/",
            "Abstract": "A geometric path from s to t is increasing-chord, if while traversing it from s to t the distance to the following (resp. from the preceding) points of the path decreases (resp. increases). A geometric graph is increasing-chord if each two distinct vertices are connected with an increasing-chord path. We show that given a convex point set P in the plane we can construct an increasing-chord graph consisting of P, at most one Steiner point and at most 4|P| - 8 edges.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Refinement of three-dimensional orthogonal graph drawings",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44541-2_29",
            "Abstract": "In this paper we introduce a number of techniques for the refinement of three-dimensional orthogonal drawings of maximum degree six graphs. We have implemented several existing algorithms for three- dimensional orthogonal graph drawing including a number of heuristics to improve their performance. The performance of the refinements on the produced drawings is then evaluated in an extensive experimental study. We measure the aesthetic criteria of the bounding box volume, the average and maximum number of bends per edge, and the average and maximum edge length. On the same set of graphs used in Di Battista et al. [3], our main refinement algorithm improves the above aesthetic criteria by 80%, 38%, 10%, 54% and 49%, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A fraud detection visualization system utilizing radial drawings and heat-maps",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7294412/",
            "Abstract": "We present a prototype system developed in cooperation with a business organization that combines information visualization and pattern-matching techniques to detect fraudulent activity by employees. The system is built upon common fraud patterns searched while trying to detect occupational fraud suggested by internal auditors of a business company. The main visualization of the system consists of a multi-layer radial drawing that represents the activity of the employees and clients. Each layer represents a different examined pattern whereas heat-maps indicating suspicious activity are incorporated in the visualization. The data are first preprocessed based on a decision tree generated by the examined patterns and each employee is assigned a value indicating whether or not there exist indications of fraud. The visualization is presented as an animation and the employees are visualized one by one according …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Perspectives Opened by Right Angle Crossing Drawings.",
            "Publication year": 2011,
            "Publication url": "https://www.emis.de/journals/JGAA/getPaper-280.html?id=11",
            "Abstract": "Right Angle Crossing (RAC) drawings are polyline drawings where each crossing forms four right angles. RAC drawings have been introduced because cognitive experiments provided evidence that increasing the number of crossings does not decrease the readability of a drawing if edges cross at right angles. We investigate to what extent RAC drawings can help in overcoming the limitations of widely adopted planar graph drawing conventions, providing both positive and negative results.First, we prove that there exist acyclic planar digraphs not admitting any straight-line upward RAC drawing and that the corresponding decision problem is NP-hard. Also, we show digraphs whose straight-line upward RAC drawings require exponential area. Exploiting the techniques introduced for studying straight-line upward RAC drawings, we also show that there exist planar undirected graphs requiring quadratic …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Locally Delaunay Realizability of Regular Series-Parallel Graphs",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561251/",
            "Abstract": "This paper studies the combinatorial properties of geometric structures, known as k-locally Delaunay graphs, introduced in the application of wireless ad hoc networks. Given a network that models the connections among its sensors as a k-locally Delaunay graph, we investigate which topologies are allowed for such a network. We show that the family of regular series-parallel graphs, a subfamily of two-terminal series parallel graphs, can be realized as k-locally Delaunay graphs for any value of k. More precisely, for any regular series-parallel graph, we present a linear time algorithm for constructing the corresponding k-locally Delaunay graph for any value of k.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Simple compact monotone tree drawings",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73915-1_26",
            "Abstract": "A monotone drawing of a graph G is a straight-line drawing of G such that every pair of vertices is connected by a path that is monotone with respect to some direction.Trees, as a special class of graphs, have been the focus of several papers and, recently, He and He [6] showed how to produce a monotone drawing of an arbitrary n-vertex tree that is contained in a  grid.In this paper, we present a simple algorithm that constructs for each arbitrary tree a monotone drawing on a grid of size at most .",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Designing for “challenge” in a large‐scale adaptive literacy game for primary school children",
            "Publication year": 2021,
            "Publication url": "https://bera-journals.onlinelibrary.wiley.com/doi/abs/10.1111/bjet.13146",
            "Abstract": "The use of learning games within the classroom is becoming increasingly common because of their potential to positively impact learning. Recent developments in adaptivity offer further possibilities to personalise learning by tailoring the game to an individual child's level or particular learning needs. However, designing an adaptive learning game is a complex process as many different game components have an impact on the provision of optimal challenge, crucial for maintaining player engagement, with limited prior work considering the multifaceted nature of this concept. This paper explores how to design for “challenge” within large‐scale adaptive learning games through a case study focused on the design of a literacy game for three linguistically and cognitively diverse learner groups—novice readers, children with dyslexia and children learning English as a foreign language. In reflecting on our design …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Upward geometric graph embeddings into point sets",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18469-7_3",
            "Abstract": "We study the problem of characterizing the directed graphs with an upward straight-line embedding into every point set in general or in convex position. We solve two questions posed by Binucci et al. [Computational Geometry: Theory and Applications, 2010]. Namely, we prove that the classes of directed graphs with an upward straight-line embedding into every point set in convex position and with an upward straight-line embedding into every point set in general position do not coincide, and we prove that every directed caterpillar admits an upward straight-line embedding into every point set in convex position. Further, we provide new partial positive results on the problem of constructing upward straight-line embeddings of directed paths into point sets in general position.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Cost-based Optimization for Video-on-Demand using Delayed-Multicast",
            "Publication year": 2004,
            "Publication url": "https://www.researchonline.mq.edu.au/vital/access/manager/Repository/mq:54787",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:KxtntwgDAa4C",
            "Publisher": "Calgary, Canada: ACTA Press"
        },
        {
            "Title": "Algorithmic Support for Video-on-Demand based on the Delayed-multicast Protocol.",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Symvonis/publication/221233317_Algorithmic_Support_for_Video-on-Demand_based_on_the_Delayed-multicast_Protocol/links/0deec528e7a5e0df82000000/Algorithmic-Support-for-Video-on-Demand-based-on-the-Delayed-multicast-Protocol.pdf",
            "Abstract": "In this paper, we examine algorithmic issues related to the delayed multicast technique [8] for Video-on-Demand delivery. We introduce the minimum total memory (MTM), minimum total traffic (MTT), and the minimum maximum memory per node (MMMN) delayed-multicast allocation problems.We provide polynomial time algorithms for solving the MTM and the MTT problems on the chandelier network and the MTM problem on the broom network. We also show that a version of the decision-MMMN problem on a general graph is NP-Complete. Finally, we present a heuristic method for obtaining a solution for the MTM problem on tree networks.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Geometric simultaneous rac drawings of graphs",
            "Publication year": 2011,
            "Publication url": "https://arxiv.org/abs/1106.2694",
            "Abstract": "In this paper, we introduce and study \"geometric simultaneous RAC drawing problems\", i.e., a combination of problems on geometric RAC drawings and geometric simultaneous graph drawings. To the best of our knowledge, this is the first time where such a combination is attempted.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Geometric Representations of Dichotomous Ordinal Data",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-30786-8.pdf#page=225",
            "Abstract": "Motivated by the study of ordinal embeddings in machine learning and by the recognition of Euclidean preferences in computational social science, we study the following problem. Given a graph G, together with a set of relationships between pairs of edges, each specifying that an edge must be longer than another edge, is it possible to construct a straight-line drawing of G satisfying all these relationships? We mainly consider a dichotomous setting, in which edges are partitioned into short and long, as otherwise there are simple (planar) instances that do not admit a solution. Since the problem is NP-hard even in this setting, we study under which conditions a solution always exists. We prove that degeneracy-2 graphs, subcubic graphs, double-wheels, and 4-colorable graphs in which the short edges induce a caterpillar always admit a realization. These positive results are complemented by negative instances …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Bler: A boundary labeller for technical drawings",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Antonios-Symvonis/publication/30508907_BLer_A_Boundary_Labeller_for_Technical_Drawings/links/0deec528e7a61ccbcf000000/BLer-A-Boundary-Labeller-for-Technical-Drawings.pdf",
            "Abstract": "In technical drawings and medical drawings/maps it is often common to explain certain features of the drawing by blocks of text that are arranged on its boundary. Bekos et. al. introduced the term boundary labelling to describe this special type of labelling and presented algorithms for automatic boundary labelling. BLer is a prototype tool aiming to automate the boundary labelling process. It targets the area of technical and medical drawings and incorporates implementations of boundary labelling algorithms presented in [1].",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the perspectives opened by right angle crossing drawings",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11805-0_5",
            "Abstract": "Right Angle Crossing (RAC) drawings are polyline drawings where each crossing forms four right angles. RAC drawings have been introduced because cognitive experiments provided evidence that increasing the number of crossings does not decrease the readability of the drawing if the edges cross at right angles. We investigate to what extent RAC drawings can help in overcoming the limitations of widely adopted planar graph drawing conventions, providing both positive and negative results. First, we prove that there exist acyclic planar digraphs not admitting any straight-line upward RAC drawing and that the corresponding decision problem is NP-hard. Also, we show digraphs whose straight-line upward RAC drawings require exponential area. Second, we study if RAC drawings allow us to draw bounded-degree graphs with lower curve complexity than the one required by more constrained drawing …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Geometric RAC simultaneous drawings of graphs",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-32241-9_25",
            "Abstract": "In this paper, we study the geometric RAC simultaneous drawing problem: Given two planar graphs that share a common vertex set but have disjoint edge sets, a geometric RAC simultaneous drawing is a straight-line drawing in which (i) each graph is drawn planar, (ii) there are no edge overlaps, and, (iii) crossings between edges of the two graphs occur at right-angles. We first prove that two planar graphs admitting a geometric simultaneous drawing may not admit a geometric RAC simultaneous drawing. We further show that a cycle and a matching always admit a geometric RAC simultaneous drawing, which can be constructed in linear time.We also study a closely related problem according to which we are given a planar embedded graph G and the main goal is to determine a geometric drawing of G and its dual G * (without the face-vertex corresponding to the external face) such that: (i …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Drawing planar graphs with few segments on a polynomial grid",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-35802-0_32",
            "Abstract": "The visual complexity of a graph drawing can be measured by the number of geometric objects used for the representation of its elements. In this paper, we study planar graph drawings where edges are represented by few segments. In such a drawing, one segment may represent multiple edges forming a path. Drawings of planar graphs with few segments were intensively studied in the past years. However, the area requirements were only considered for limited subclasses of planar graphs. In this paper, we show that trees have drawings with  segments and  area, improving the previous result of . We also show that 3-connected planar graphs and biconnected outerplanar graphs have a drawing with  and  segments, respectively, and  area.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Minimum-change drawings for labeled graphs",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.416.5021&rep=rep1&type=pdf",
            "Abstract": "The interest in algorithms that automate the process of information visualization by the usage of textual labels for features of interest within a visualization has increased with the advance in type-setting technology and the amount of information to be visualized. In this paper, we study minimum-change drawings for labeled graphs, adopting the boundary labeling model [6]. Changes within the graph may occur because of the actions of a user, which is able to insert new features within the visualization, delete previously placed features and change the sizes of the labels. Each time the user acts, a small change should be performed within the visualization in order to rearrange its components with respect to some optimization criterion. We model this problem and we also provide several heuristics to obtain “near-optimal” solutions.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Planar Drawings of Fixed-Mobile Bigraphs",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=v-xIDwAAQBAJ&oi=fnd&pg=PA426&dq=info:-tplQDryEVcJ:scholar.google.com&ots=-A9QiTCdzQ&sig=UUXhX5LHoVxTi4MuA15024qFGqI",
            "Abstract": "A fixed-mobile bigraph G is a bipartite graph such that the vertices of one partition set are given with fixed positions in the plane and the mobile vertices of the other part, together with the edges, must be added to the drawing. We assume that G is planar and study the problem of finding, for a given k≥ 0, a planar poly-line drawing of G with at most k bends per edge. In the most general case, we show NP-hardness. For k= 0 and under additional constraints on the positions of the fixed or mobile vertices, we either prove that the problem is polynomial-time solvable or prove that it belongs to NP. Finally, we present a polynomialtime testing algorithm for a certain type of “layered” 1-bend drawings.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:eflP2zaiRacC",
            "Publisher": "Springer"
        },
        {
            "Title": "Monotone drawings of graphs with fixed embedding",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00453-013-9790-3",
            "Abstract": "A drawing of a graph is a monotone drawing if for every pair of vertices u and v there is a path drawn from u to v that is monotone in some direction. In this paper we investigate planar monotone drawings in the fixed embedding setting, i.e., a planar embedding of the graph is given as part of the input that must be preserved by the drawing algorithm. In this setting we prove that every planar graph on n vertices admits a planar monotone drawing with at most two bends per edge and with at most 4n−10 bends in total; such a drawing can be computed in linear time and requires polynomial area. We also show that two bends per edge are sometimes necessary on a linear number of edges of the graph. Furthermore, we investigate subclasses of planar graphs that can be realized as embedding-preserving monotone drawings with straight-line edges. In fact, we prove that biconnected embedded planar graphs …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:dshw04ExmUIC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Three-dimensional orthogonal graph drawing algorithms",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166218X00001724",
            "Abstract": "We use basic results from graph theory to design algorithms for constructing three-dimensional, intersection-free orthogonal grid drawings of n vertex graphs of maximum degree 6. The best previous result generated a drawing bounded by an O (n)× O (n)× O (n) box, with each edge route containing up to 16 bends. Our algorithms initiate the study of bend/bounding box trade-off issues for three-dimensional grid drawings and produce drawings with the following characteristics: 1. at most 7 bends per edge route, bounded by an O (n)× O (n)× O (n) box; 2. at most 6 bends per edge route, bounded by an O (n)× O (n)× O (n) box; 3. at most 5 bends per edge route, bounded by an O (n)× O (n)× O (n) box; 4. at most 3 bends per edge route, bounded by an O (n)× O (n)× O (n) box; and 5. for maximum degree 4 graphs, at most 3 bends per edge route, bounded by and O (n)× O (n)× O (1) box.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:u-x6o8ySG0sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Colored simultaneous geometric embeddings",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73545-8_26",
            "Abstract": "We introduce the concept of colored simultaneous geometric embeddings as a generalization of simultaneous graph embeddings with and without mapping. We show that there exists a universal pointset of size n for paths colored with two or three colors. We use these results to show that colored simultaneous geometric embeddings exist for: (1) a 2-colored tree together with any number of 2-colored paths and (2) a 2-colored outerplanar graph together with any number of 2-colored paths. We also show that there does not exist a universal pointset of size n for paths colored with five colors. We finally show that the following simultaneous embeddings are not possible: (1) three 6-colored cycles, (2) four 6-colored paths, and (3) three 9-colored paths.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Maximizing the total resolution of graphs",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18469-7_6",
            "Abstract": "A major factor affecting the readability of a graph drawing is its resolution. In the graph drawing literature, the resolution of a drawing is either measured based on the angles formed by consecutive edges incident to a common node (angular resolution) or by the angles formed at edge crossings (crossing resolution). In this paper, we evaluate both by introducing the notion of “total resolution”, that is, the minimum of the angular and crossing resolution. To the best of our knowledge, this is the first time where the problem of maximizing the total resolution of a drawing is studied.The main contribution of the paper consists of drawings of asymptotically optimal total resolution for complete graphs (circular drawings) and for complete bipartite graphs (2-layered drawings). In addition, we present and experimentally evaluate a force-directed based algorithm that constructs drawings of large total resolution.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Computing upward topological book embeddings of upward planar digraphs",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570866714000914",
            "Abstract": "We describe a unified approach for studying book, point-set, and simultaneous embeddability problems of upward planar digraphs. The approach is based on a linear time strategy to compute an upward planar drawing of an upward planar digraph such that all vertices are collinear. Besides having impact in relevant application domains of graph drawing and computational geometry, the presented results open new research directions in the area of upward planarity with constraints of the positions of the vertices.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:SP6oXDckpogC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Crossing-optimal acyclic hp-completion for outerplanar st-digraphs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02882-3_9",
            "Abstract": "Given an embedded planar acyclic digraph G, the acyclic hamiltonian path completion with crossing minimization (Acyclic- HPCCM) problem is to determine a hamiltonian path completion set of edges such that, when these edges are embedded on G, they create the smallest possible number of edge crossings and turn G to a hamiltonian acyclic digraph. In this paper, we present a linear time algorithm which solves the Acyclic-HPCCM problem on any outerplanar st-digraph G. The algorithm is based on properties of the optimal solution and an st-polygon decomposition of  G. As a consequence of our result, we can obtain for the class of outerplanar st-digraphs upward topological 2-page book embeddings with minimum number of spine crossings.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Potential-function-based Analysis of an off-line Heap Construction Algorithm",
            "Publication year": 2000,
            "Publication url": "http://jucs.org/jucs_6_2/potential_functions_based_analysis/Roberts_A.pdf",
            "Abstract": "In this paper we examine the problem of heap construction on a rooted tree T from a packet routing perspective. Each node of T initially contains a packet which has a key-value associated with it. The aim of the heap construction algorithm is to route the packets along the edges of the tree so that, at the end of the routing, the tree is heap ordered with respect to the key values associated with the packets. We consider the case where the routing is performed according to the matching model and we present and analyse an off-line algorithm that heap orders the tree within 2h (T) routing steps, where h (T) is the height of tree T. The main contribution of the paper is the novel analysis of the algorithm based on potential functions. It is our belief that potential functions will be the main vehicle in analysing fast non-recursive routing algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rooted uniform monotone minimum spanning trees",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-57586-5_34",
            "Abstract": "We study the construction of the minimum cost spanning geometric graph of a given rooted point set P where each point of P is connected to the root by a path that satisfies a given property. We focus on two properties, namely the monotonicity w.r.t. a single direction (y-monotonicity) and the monotonicity w.r.t. a single pair of orthogonal directions (xy-monotonicity). We propose algorithms that compute the rooted y-monotone (xy-monotone) minimum spanning tree of P in  (resp. ) time when the direction (resp. pair of orthogonal directions) of monotonicity is given, and in  time when the optimum direction (resp. pair of orthogonal directions) has to be determined. We also give simple algorithms which, given a rooted connected geometric graph, decide if the root is connected to every other vertex by paths that are all monotone w.r.t. the same direction (pair of orthogonal …",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:K3LRdlH-MEoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Text classification for children with dyslexia employing user modelling techniques",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878765/",
            "Abstract": "The problem of text-readability has received great attention in the literature. However, the classification of a text as readable is based solely in its linguistic complexity and does not take into account the skills of the intended reader. In this paper, we make a first attempt to study user-specific text readability. We focus on readers with dyslexia and documents written in English and Greek. Central to our approach is the notion of the user's profile which carries information regarding the linguistic difficulties a user with dyslexia may experience. Based on the user's profile, we develop heuristics for evaluating text's readability for the specific user. The developed heuristics are incorporated in the text classification services of the iLearnRW1 project, aiming to facilitate the selection of appropriate/suitable reading resources for children with dyslexia.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Combining traditional map labeling with boundary labeling",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-18381-2_9",
            "Abstract": "The traditional map labeling problems are mostly -hard. Hence, effective heuristics and approximations have been developed in the past. Recently, efficient algorithms for the so-called boundary labeling model have been introduced which assumes that the labels are placed on the boundary of the map and connected by polygonal leaders to their corresponding sites. Internal labels have been forbidden. In this paper, we allow both. Since clearly internal labels should be preferred, we consider several maximization problems for the number of internal labels and we show that they can be obtained efficiently or in quasi-polynomial time.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Boundary Labeling: Models and Efficient Algorithms for Rectangular Maps",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=4864010659764381280&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present boundary labeling, a new approach for labeling point sets with large labels. We first place disjoint labels around an axis-parallel rectangle that contains the points. Then we connect each label to its point such that no two connections intersect. Such an approach is common eg in technical drawings and medical atlases, but so far the problem has not been studied in the literature. The new problem is interesting in that it is a mixture of a label-placement and a graph-drawing problem.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer,."
        },
        {
            "Title": "Locally delaunay readability of regular series-parallel graphs",
            "Publication year": 2008,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/35616",
            "Abstract": "Locally delaunay readability of regular series-parallel graphs Αρχική Σελίδα → Κεντρική \nΒιβλιοθήκη ΕΜΠ→ Ιδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε συνέδρια → Εμφάνιση \nΤεκμηρίου HEAL DSpace Locally delaunay readability of regular series-parallel graphs \nΑποθετήριο DSpace/Manakin Locally delaunay readability of regular series-parallel graphs Grilli, \nL; Symvonis, A; Hong, SH; Wormser, C URI: http://hdl.handle.net/123456789/35616 Ημερομηνία: \n2008 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο \nΠροβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο \nεμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε συνέδρια Περιήγηση Σε \nόλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα \nΑυτή η Συλλογή Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο Λογαριασμός μου / ΙΑ - /…",
            "Abstract entirety": 0,
            "Author pub id": "EHH_0W8AAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Upward Point Set Embeddability for Convex Point Sets Is in P",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-25878-7_38",
            "Abstract": "In this paper, we present a polynomial dynamic programming algorithm that tests whether a n-vertex directed tree T has an upward planar embedding into a convex point-set S of size n. We also note that our approach can be extended to the class of outerplanar digraphs. This nontrivial and surprising result implies that any given digraph can be efficiently tested for an upward planar embedding into a given convex point set.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:r0BpntZqJG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Unilateral orientation of mixed graphs",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11266-9_49",
            "Abstract": "A digraph D is unilateral if for every pair x, y of its vertices there exists a directed path from x to y, or a directed path from y to x, or both. A mixed graph M = (V,A,E) with arc-set A and edge-set E accepts a unilateral orientation, if its edges can be oriented so that the resulting digraph is unilateral. In this paper, we present the first linear-time recognition algorithm for unilaterally orientable mixed graphs. Based on this algorithm we derive a polynomial algorithm for testing whether a unilaterally orientable mixed graph has a unique unilateral orientation.",
            "Abstract entirety": 1,
            "Author pub id": "EHH_0W8AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]