[{
    "name": "Αργύριος Δέντσορας",
    "romanize name": "Argyrios Dentsoras",
    "School-Department": "Μηχανολόγων & Αεροναυπηγών Μηχανικών",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 10991,
    "Scholar name": "Argyris Dentsoras",
    "Scholar id": "V6BwW20AAAAJ",
    "Affiliation": "Professor, University of Patras",
    "Citedby": 1081,
    "Interests": [
        "Engineering Design",
        "Artificial Intelligence",
        "Computational Intelligence"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=V6BwW20AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Representation of Design Concepts and Concept Evaluation Criteria through Design Parameters and Performance Variables",
            "Publication year": 2008,
            "Publication url": "https://www.designsociety.org/download-publication/27801/REPRESENTATION+OF+DESIGN+CONCEPTS+AND+CONCEPT+EVALUATION+CRITERIA+THROUGH+DESIGN+PARAMETERS+AND+PERFORMANCE+VARIABLES",
            "Abstract": "It is widely accepted that conceptual design is the most important phase of design process because the decisions made during this phase affect decisively all subsequent phases and determine the quality of the final outcome (product, artifact, system, machine, etc)[Ullman 1992]. Usually, during conceptual design, different functions of the designed artifact are located and, for the implementation of each such function, different concepts are proposed. In detailed design, a phase that follows conceptual design, only one concept–of the multitude of concepts-is further elaborated so that, by the end of this phase, a final detailed and documented artifact description is produced. The choice of the concept that will be further elaborated from the set of all available concepts is a task known as concept evaluation.The majority of the methods and techniques use one or more concept attributes (characteristics) and apply different quantitative and/or qualitative approaches in order to conclude about their values with respect to design specifications. The latter are actually customer requirements that have been transformed to an engineering “syntax” and have been quantified in order to be used–among others-for concept evaluation. For this task, the term “criterion” is often used alternatively. Then it may be concluded that concept evaluation is a process where multiple concepts are subjected to a systematic evaluation process with respect to one or more criteria and, as a result, a single concept is finally chosen in order to be further elaborated in the following design phases. This concept may be either one of the initial concepts or a new synthesis that combines …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Index-based metrics for the evaluation of effects of custom parts on the standardization of mechanical systems",
            "Publication year": 2015,
            "Publication url": "https://www.designsociety.org/publication/37875/INDEX-BASED+METRICS+FOR+THE+EVALUATION+OF+EFFECTS+OF+CUSTOM+PARTS+ON+THE+STANDARDIZATION+OF+MECHANICAL+SYSTEMS",
            "Abstract": "The number and the attributes of custom parts affect significantly the standardization level of mechanical systems and determine their functional characteristics and their value. In the present study, a part classification scheme and a calculation procedure are introduced that enable systematic adaptation and standardization of custom parts during in-enterprise design and manufacturing processes. The level of standardization of the mechanical system under consideration is evaluated via metrics represented by a composite standardization index derived from the combination of two (2) partial indices, namely an index that represents the absolute attribute-based standardization of each part of the system and a second index that represents the degree of commonality for different parts and/or assemblies for the same system. The proposed approach leads to a more reliable evaluation of standardization levels by taking into account all in- and out-of-enterprise available standard resources and provides a framework that promotes design-for standardization processes. Additionally, it contributes towards more efficient and functional products and decreases design and manufacturing costs.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of soft computing techniques in the design of robot grippers",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=1697778296219029350&hl=en&oi=scholarr",
            "Abstract": "ICED07: 16th International Conference of Engineering Design Continuing the tradition established by previous conferences, ICED'07 was the premier forum for exchanges between researchers and industrial partners on key questions concerning engineering design. The conference addressed new trends, developments and research findings in the areas of new product development, design support techniques, design processes, design science and design education. ISBN Nos: 1-904670-01-6: Abstracts of papers 1-904670-02-4: Proceedings CD...",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of standardization level of mechanical systems in engineering design",
            "Publication year": 2013,
            "Publication url": "https://www.designsociety.org/publication/34997/evaluation_of_standardization_level_of_mechanical_systems_in_engineering_design",
            "Abstract": "The level of standardization of products and systems affects production process and the cost for their operation and maintenance. In reverse engineering and design, the systematic consideration of standards leads to better evaluation and efficient synthesis of parts and assemblies. Taking into account standardization during design leads to systems with better operational characteristics, high quality and low cost. The establishment of metrics for estimating the standardization level of systems can provide valuable tools for analytic and synthetic engineering processes. The present study introduces such a metrics that is based on system analysis and decomposition into hierarchical structures of parts and assemblies. Procedures search exhaustively that structures and perform calculations of standardization indices. A PC-based platform implements the proposed method and provides estimations of standardization levels and multiple graphical outputs that visualize the obtained results. Then the designer may inspect the standardization level of parts, components and assemblies and proceed with necessary modifications. The method is exemplified with a study of a robot base subassembly.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy representation via design function structure for multi-attribute optimization of traction elevator systems",
            "Publication year": 2014,
            "Publication url": "https://www.designsociety.org/publication/35175/ENERGY+REPRESENTATION+VIA+DESIGN+FUNCTION+STRUCTURE+FOR+MULTI-ATTRIBUTE+OPTIMIZATION+OF+TRACTION+ELEVATOR+SYSTEMS",
            "Abstract": "The concept of a new design method for energy-efficient electromechanical systems is proposed. According to that, the function structure of a system represents the energy flows and conversions performed between its subfunctions. A systematic procedure leads to the design parameters that affect the energy consumption for its basic function. These are correlated with the parameters that affect service performance. The values of all that parameters are defined by computational intelligence methods so that optimum overall efficiency is obtained. Traction elevators are used as a case study.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fuzzy rule-based approach for the collaborative formation of design structure matrices",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-84628-224-1_7",
            "Abstract": "Engineering design requires extensive decomposition and integration activities relying on a multidisciplinary basis. A design structure matrix (DSM) can be used as a representation and analysis tool in order to manage the design process under diverse perspectives. The design outcome is always subject to the abstract nature, the subjectivity and the low availability of the required design knowledge. This paper addresses the DSM as a communicating design tool among multiple designers. A fuzzy-logical inference mechanism permits the collaboration among designers on the qualitative definition of the interrelations among the design problem’s entities or tasks and the resulting DSM may be then utilized for various tasks (partitioning, clustering, tearing etc.) depending on the problem under consideration. A DSM is deployed for the case of the parametric design of an oscillating conveyor where two (2 …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Evolutionary neuro-fuzzy modeling of parametric design",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vNNYJJa--OoC&oi=fnd&pg=PA315&dq=info:ugHazF-jzwsJ:scholar.google.com&ots=iglElnrpCA&sig=7M68D4D1eG5yt7IKAvEzE6SZH9g",
            "Abstract": "A design approach is presented that confronts several issues of parametric design, by implementing soft computing techniques. The problem is stated in terms of design parameters and their associative relationships of different formalisms. Genetic algorithms are deployed in order to find the optimum solution according to custom optimization criteria. The best solutions of the genetic optimization are recorded, then a neuro-fuzzy procedure is used that limits the number of inputs and outputs and resolves problem’s complexity by substituting existing associative relations with a fuzzy rule system. Redesign may be performed by searching the optimum solution under the same criteria but using the simplified fuzzy structure. A design of an oscillating conveyor is presented as an example case.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal initial positioning of excavators in digging processes",
            "Publication year": 2010,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1243/09596518JSCE982",
            "Abstract": "Excavators comprise a category of construction equipment and are used in a wide range of applications of varying scale. Regarding their usage in digging processes, the relevant literature records few analytical methods which, when combined with the available empirical knowledge, provide certain analytical tools, rules, and guidelines. In the present work, an approach for obtaining optimal initial positioning of excavators in digging processes is proposed. First, constraints and assumptions regarding excavator and dig geometries are stated. The excavator work space is correlated to its kinematics and the geometric locus of optimal positioning points that correspond to maximal length of the boom—arm pair is located. Then the problem of determining the volume of removed soil is analysed and subsequently reduced to the solution of the corresponding two-dimensional problem. Simple mathematical formulae are …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:qjMakFHDy7sC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Using case-based reasoning and soft computing techniques for the initialization of engineering design optimization",
            "Publication year": 2006,
            "Publication url": "https://asmedigitalcollection.asme.org/ESDA/proceedings-abstract/ESDA2006/839/316111",
            "Abstract": "From a certain point of view, parametric engineering design may be considered as an optimization problem. The design problem may be represented through a set of design parameters. The optimal solution is located by using a set of competing design parameters and its evaluation is based upon specific criteria. A significant number of techniques and methodologies have been proposed in order to perform this difficult task. The selection of the appropriate one(s) depends strongly upon the nature and the specific characteristics of the design problem under consideration. The majority of these techniques and methodologies rely on the definition of some initial conditions. Wrong, misleading or incomplete initial conditions may result to solutions characterized by local optimality or may need excessive computational time in order to converge to either an optimal or a sub-optimal solution. In the context of the current …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal positioning of elevator hoistways in buildings based on a simplified circulation model",
            "Publication year": 2012,
            "Publication url": "http://scindeks.ceon.rs/article.aspx?artid=1451-20921204187M",
            "Abstract": "In modern multi-storey buildings, the location of elevator systems is a very crucial factor regarding the efficiency of transportation service and the comfortable and easy on-floor circulation. The present paper proposes a method which, after the partition of a typical floor of a commercial building into cells by a grid, correlates architectural and circulation data for the formulation of functions and matrices that demonstrate numerically the architecture of the floor, the design of circulation spaces and the presented need for elevator service in each cell. Then, weighted Euclidean norms and modified heuristic search algorithms are used to find the position of the elevator hoistway that fits the existing architectural plan and is closest to the point of floor’s circulation paths that presents the minimum mean walking distance from the entrances of the areas that host floor’s population. A case study demonstrates effectively the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy Representation and Synthesis of Concepts in Engineering Design",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_15",
            "Abstract": "In the present paper a new mathematical fuzzy-logic-based formulation of the design objects and the rules that govern a design problem during the conceptual design phase is presented.. A procedure for the automatic generation of degrees of satisfaction of the design specifications for each feasible solution - subjected to design constraints - is introduced. A table containing the satisfaction degrees is used for the derivation of the set of all possible synthesized solutions. The determination of this set, which is a subset of the set of the synthesised solutions, is based on a suitable partition of the Euclidean space. An illustrative example of a knowledge based system for the conceptual design of grippers for handling fabrics is presented. The advantages of this model are revealed via a comparison with previous implementations of the conceptual design phase based on crisp production rules or certainty factors.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Integration of genetic optimisation and neuro-fuzzy approximation in parametric engineering design",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207720802630628",
            "Abstract": "The present article introduces a systematic approach that applies soft computing techniques, such as genetic algorithms and neuro-fuzzy approximation, in parametric engineering design, such as genetic algorithms and neuro-fuzzy approximation. A generic design problem representation is utilised and genetic optimisation is used in order to extract the optimal design solution based on customised optimisation criteria. Apart from the extraction of the optimal solution, the genetic optimisation creates records of elite solutions that can be reused as meta-knowledge to enhance the design results in the context of different frameworks. The efficiency of the proposed neuro-fuzzy approximated models and the meta-knowledge supported architectures is evaluated against the conventional and analytical models, on the basis of an example case of parametric design of oscillating conveyors.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Fusing neural networks, genetic algorithms and fuzzy logic for diagnosis of cracks in shafts",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780080451572500614",
            "Abstract": "During the last decades, the engineering community has extensively studied crack identification in rotating machine elements. Although the proposed analytical models may be capable of identifying cracks based on modal analysis, response measurements, or other techniques, the required time for performing the underlying computations is restrictive in real-time diagnosis applications. This chapter introduces a framework for implementing soft-computing techniques, namely artificial neural networks (ANN), fuzzy logic (FL), and genetic algorithms (GA), for identifying cracks in rotating shafts while diminishing the required computational time. Cracks are considered to lie on arbitrary angular positions around the longitudinal axis of the shaft at any distance from the clamped end and characterized by three measures: position, depth, and relative angle. The reduction in computational time is achieved …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Elsevier Science Ltd"
        },
        {
            "Title": "Integration of Computational Intelligence Applications in Engineering Design",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_25",
            "Abstract": "Several techniques have been proposed recently as a result of the intensive research done in the field of computational intelligence. These techniques seem to act beneficially in a variety of scientific domains by performing better than the conventional methodologies. The current paper focuses on the domain of engineering design, whose demanding nature motivates the research for domain-independent and efficient tools and methodologies. In this context, the application of computational intelligence techniques in engineering design is reviewed and the enhancement of basic design processes such as knowledge representation, optimal solution search and design knowledge re-utilization by soft-computing techniques is described. The purpose of the paper is to present ways that Fuzzy Logic (FL), Genetic Algorithms (GA) and Artificial Neural Networks (ANN) can be beneficially used in engineering …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An Environment for the Efficient Analysis of Defining Relationships among Design Entities",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-0643-2_11",
            "Abstract": "An integrated environment is presented that helps a designer to perform efficient dynamic analysis of the defining relationships among the different entities that form the knowledge for a design problem. This environment extends the capabilities and adds new features to a program already used for performing analysis of design relationships.The formation of the design knowledge is a highly dynamic iterative process that takes place through multiple design cycles. During each cycle, defining relationships among the design entities are established, deleted or modified. The presented environment provides tools for representing these relationships, for analysing them in terms of design information importance and required design effort and, finally, for locating possible inconsistencies among them.In cases of design problems that involve large numbers of design entities and defining relationships …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Application of soft computing techniques in the design of robot grippers",
            "Publication year": 2007,
            "Publication url": "https://www.designsociety.org/download-publication/25683/Application+of+Soft+Computing+Techniques+in+the+Design+of+Robot+Grippers",
            "Abstract": "The present paper presents a system used for performing design by making extended use of soft computing techniques. Throughout the paper the design of robotic grippers for flexible materials is used as a reference design case in both its conceptual and detailed design phases. The system contains three modules. The first module focuses on the conceptual design phase and is used for: a. the generation of a set of feasible solutions (concepts) of grippers for a set of pre-specified requirements which express the handling tasks that the gripper must accomplish and b. for the evaluation of the feasible solutions in order to find the best one according to the designers’ experience and some prespecified criteria. The evaluation process is based on a design index that includes several interacting criteria represented as relationships among fuzzy entities. The concept is then submitted to the second module called Case-DeSC (Case-based Design with Soft Computing). Case-DeSC is dedicated to the development of a detailed parametric design of the gripper concept by utilizing formal design case representation, fuzzy preferences on the design parameters and by searching for optimal solutions by deploying an evolutionary algorithm. The optimal solution passes over to a third module, capable of presenting a 3D visual representation of the parametric gripper concept via Virtual Reality Modelling Language (VRML). The proposed system has been developed in MATLAB.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A heuristic approach for the positioning of elevator hoistways based on the utilization intensity index",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17452007.2012.738039",
            "Abstract": "In modern buildings, the position(s) of elevator system(s) tends to be a crucial factor for the unimpeded vertical and on-floor circulation of their residents. The present paper introduces a method that correlates circulation data for the population of a typical office building (size, density and possibility for elevator use) with structural and architectural data of each one of its floors (net usable space, circulation space, structural intrusions, etc.). The method provides an optimum position for the elevator system hoistway(s) so that all walking distances on all floors between the elevator system and usable spaces are as small as possible. Every single floor of the building is partitioned into cells that form a grid covering its surface. An index of the intensity of elevator utilization (EUII) is introduced, defined as a function of the data mentioned above. Then, Euclidean norms, based on (EUII) values, provide weighted mean distances …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Case-DeSC: A system for case-based design with soft computing techniques",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417406000613",
            "Abstract": "The present paper introduces a case-based design with soft computing (Case-DeSC) system that uses soft computing techniques for addressing parametric design problems. Design case representation relies on digraphs of design parameters, supported by fuzzy preferences on specific parameters’ values and weighting factors, which capture the parameters’ relative importance. The final design solution is either extracted via a genetic algorithm that searches for the solution with the maximum aggregated preference, or it is retrieved by a competitive neural network. This neural network utilizes the medium of the maximum or the centroid of the assigned fuzzy preferences as similarity measures and it is trained by utilizing the available cases in the case base. Several functionalities are incorporated to the proposed system (case selection through aggregation of fuzzy preferences, case adaptation through genetic …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:WF5omc3nYNoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Resolving the complexity of functional representation in design: a transition from computational relationships to performance hierarchical trees",
            "Publication year": 2004,
            "Publication url": "https://asmedigitalcollection.asme.org/ESDA/proceedings-abstract/ESDA2004/37/302269",
            "Abstract": "In the present paper, a method is presented based on the exploitation of the computational relationships among design entities in order to obtain valuable design knowledge concerning the performance and the function of the designed object (artifact, product, machine, etc.). The approach is applicable for most of the design problems and may be used in the design cases where the design problem under consideration can be formally decomposed and expressed in terms of design entities and associative relationships among them. The design knowledge is represented through different hierarchical tree types corresponding to the physical, computational and performance domains. The representation of the design knowledge in terms of computational relationships instead of terms of functional relationships is more convenient and flexible. Design modeling becomes simpler and more direct by assigning values to …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Problem-dependent search for optimal parameter instantiation order in design spaces",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474034609000196",
            "Abstract": "The paper refers to the domain of engineering design and introduces a method for obtaining an optimal instantiation process for the design parameters in a design problem by using extended, problem- and path-dependent search within the digraphs that these parameters form.Design parameters are considered as entities being interrelated via deterministic associative relationships and forming digraphs that accommodate declarative and procedural design knowledge. They participate in establishing formal metrics for the estimation of importance and design effort. Factors with values assigned by the designer(s) define the required effort for the instantiation of primary parameters.A method is presented and an algorithm is proposed for obtaining optimal instantiation lists. The algorithm uses extended problem- and path-dependent search within the parameter digraphs. Iteratively, in each step, the algorithm performs …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An index that correlates service performance and energy consumption of belt conveyors",
            "Publication year": 2018,
            "Publication url": "https://scindeks.ceon.rs/Article.aspx?artid=1451-20921803313M",
            "Abstract": "In the present paper, an index is proposed for belt conveyors that represents the evaluation of the overall functional/design efficiency by considering both energy and service performance. To obtain index value, energy consumption data - that are extracted from a detailed energy analysis of the examined conveyor - are correlated to service performance data derived from the analysis of material handling capability of the conveyor within the context of the set operational requirements and functional conditions. The proposed index is exemplified through a case study of a simple inclined belt conveyor for which a detailed energy consumption model is developed. Different technical specifications and operational conditions are tested. The proposed approach proves that the index depicts adequately the effect of any design solution or operational decision to the overall efficiency of the conveyor.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy consumption and service performance of escalators",
            "Publication year": 2016,
            "Publication url": "http://www.mas.bg.ac.rs/_media/istrazivanje/fme/vol44/3/4_adentsoras_et_al.pdf",
            "Abstract": "In the present paper, an index is proposed about the overall efficiency of single escalators in terms of energy consumption and service performance. The index correlates the energy consumed with the number of passengers being served, the elevation height and the average time needed for the service provided. The index may serve as an assisting tool towards designing more efficient escalators in terms of operation and energy consumption. The data needed for the evaluation of the proposed index are derived by applying specialized circulation studies for the estimation of traffic load and energy consumption analysis considering the mechanical and electrical design of the escalator. A case study exemplifies the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "REDUNDANCY ELIMINATIONS AND PLAUSIBLE ASSUMPTIONS OF DESIGN PARAMETERS FOR EVALUATING DESIGN ALTERNATIVES",
            "Publication year": 2011,
            "Publication url": "https://www.designsociety.org/download-publication/30762/redundancy_eliminations_and_plausible_assumptions_of_design_parameters_for_evaluating_design_alternatives",
            "Abstract": "Evaluation of design alternatives is an important task for engineering design and its results affect strongly the outcome of decision-making processes and the quality of the artifact being designed. In the present paper, a method is proposed based on representation of alternatives through associative weighted digraphs of design parameters and use of performance variables defined according to evaluation criteria. The method relies on designer-guided eliminations of redundancies of common design parameters among different alternatives and plausible assumptions about value domains of design parameters that take part in the evaluation process. Eliminations of redundancies of common design parameters lead to unified digraphs for all alternatives and the introduction of Plausible Assumptions’ Matrix systematizes the process of assigning feasible value domains for all types of all design parameters. Linear approximate calculation formulas pertaining to the unified digraphs are also introduced for evaluating alternatives based on comparable values of performance variables. A case study for two alternatives for a stiffness element exemplifies the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Floor circulation index and optimal positioning of elevator hoistways",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15390-7_34",
            "Abstract": "In modern buildings, the position(s) of elevator system(s) affects strongly the efficiency of people circulation especially during periods of peak demand. The present study introduces a simple model that correlates circulation data (building type, population size and density, space use, etc.) with structural/architectural data (net usable space, circulation space, structural intrusions, facilities etc) of a typical floor of a building. A circulation index is defined as function of these data and its value is calculated for every cell of the grid that partitions all usable spaces. Euclidean norms are used for calculating weighted mean distance values and for locating the point on floor’s surface that corresponds to minimal mean walking distance to/from the floor’s usable spaces. A heuristic search algorithm combines calculations of distance values, constraints and empirical knowledge for fine tuning hoistway position around this …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Determination of position of elevator systems in buildings based on expertise and heuristic problem space search",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:maZDTaKrznsC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Integration of fuzzy logic, genetic algorithms and neural networks in collaborative parametric design",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S147403460600036X",
            "Abstract": "The solution to a design problem is extracted through the exploitation of the design knowledge in the context of a space of solution alternatives. The design process incorporates a series of decision making and knowledge management issues, which should be often addressed through collaboration among diverse stakeholders. The alternative solutions must usually be shaped under different formalisms and evaluated against commonly accepted objective criteria.The current paper presents an approach that integrates soft-computing techniques in order to facilitate the computer-aided collaboration among designers. CopDeSC (Collaborative parametric Design with Soft-Computing) is the name of the system developed in order to implement this approach whose key features are: (a) the collaborative structuring of design parameter hierarchies, (b) the modeling of the design objectives through fuzzy preferences …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Computer-aided design of oscillating conveyors",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=7079248833809529942&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RESOLVING THE COMPLEXITY OF FUNCTIONAL REPRESENTATION IN DESIGN: A TRANSITION FROM COMPUTATIONAL RELATIONSHIPS TO PERFORMANCE HIERARCHICAL TREES",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=13455875228118194124&hl=en&oi=scholarr",
            "Abstract": "26500, Patras, GREECE tel.:+ 30 2610 997217 fax:+ 30 2610 997207 dentsora@ mech. upatras. gr",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Amer Society of Mechanical"
        },
        {
            "Title": "APPLICATION OF SUBTRACT AND OPERATE METHOD FOR DEVELOPING FUNCTION ENERGY STRUCTURES OF PRODUCTS AND SYSTEMS-A RULE-GUIDED APPROACH",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information importance and descriptor instantiation effort in engineering design",
            "Publication year": 2007,
            "Publication url": "https://www.designsociety.org/download-publication/25553/Information+Importance+and+Descriptor+Instantiation+Effort+in+Engineering+Design",
            "Abstract": "The paper studies the process of information generation during design and introduces new metrics regarding: a. the quantitative determination of its importance and b. the effort required for the instantiation of the design entities representing the design problem. Binary relationships among the design entities (descriptors) form tree structures that represent the objective associative design knowledge. The distinct roles that the two categories of these descriptors, namely dependent and primary, play in the design process are discussed and additional factors that define realistically the required effort for the instantiation of every primary descriptor are introduced. The binary relationships among the descriptors form a dependency matrix, which is further transformed through a number of operations based on the connectivity among the descriptors and the aforementioned additional factors. From the resulting final matrix, a unique sorted list of primary design descriptors is produced. This list may be used for the sequential instantiation of these descriptors so that production of design information of maximum importance and least effort takes place during the early design stages and under completely realistic design conditions. A short design example contributes towards a better understanding of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Redundancy eliminations and plausible assumptions of design parameters for evaluating design alternatives",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=17453345374767347759&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality assessment of porous CFRP specimens using X-ray Computed Tomography data and Artificial Neural Networks",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0263822318305828",
            "Abstract": "Despite their extensive use and the quality amelioration, CFRPs remain susceptible to a variety of manufacturing defects such as the pores. Predictive tools capable of correlating the mechanical properties of CFRP parts with the characteristics of defects as derived from NDT techniques or with the manufacturing parameters could serve as an effective tool for the quality control of CFRP structural parts. The present work contributes towards the development of effective quality control tools for composite materials. Within this context, the characteristics of pores, as evaluated by X-ray Computed Tomography (CT), are correlated with the matrix-dominated mechanical properties of unidirectional porous CFRP specimens using an Artificial Neural Network (ANN). The ANN model has been trained by using a multi-scale numerical model. For the training of the ANN, 30 porosity scenarios have been created and given as input …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:J_g5lzvAfSwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Applying neural networks, genetic algorithms and fuzzy logic for the identification of cracks in shafts by using coupled response measurements",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045794907002702",
            "Abstract": "This paper considers the dynamic behavior of a shaft with two transverse cracks characterized by three measures: position, depth and relative angle. Both cracks are considered to lie along arbitrary angular positions with respect to the longitudinal axis of the shaft and at some distance from the clamped end. A local compliance matrix of two degrees of freedom (bending in both the horizontal and the vertical planes) is used to model each crack. The calculation of the compliance matrix is based on established stress intensity factor expressions and is performed for all rotation angles through a function that incorporates the crack depth and position as parameters.In the present paper, a model for the coupling effect of bending vibrations on the cracked shaft is first introduced and then used to identify the rotational angle of the crack. This angle is a significant factor and a prerequisite for the existence of coupling. The …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Neuro-fuzzy case-based design: an application in structural design",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780080451572500730",
            "Abstract": "This chapter presents a design approach and a design tool based on human analogical reasoning. This design tool provides solutions and it is used to design the formworks for constructing slabs. Through a case-based design process, past solutions are compared with the current design case, and a subset of them is retrieved according to a defined similarity measure. In this tool, the retrieval process is performed on the basis of a competitive neural network, which is submitted to unsupervised training by using the existing design solutions. The design case is represented in terms of sets of design parameters and associated fuzzy preferences. In engineering design problems whose solutions cannot be adapted in order to meet new requirements, the adaptation process is substituted by another approach that evaluates the retrieved design solutions according to the aggregation of the fuzzy …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier Science Ltd"
        },
        {
            "Title": "Information generation during design: information importance and design effort",
            "Publication year": 2005,
            "Publication url": "https://www.cambridge.org/core/journals/ai-edam/article/information-generation-during-design-information-importance-and-design-effort/5765990B3BB35F78147C3A537D0B4DFA",
            "Abstract": "The present paper studies the process of information generation during design and focuses on the relationship between the information importance and the required effort for its generation. Multiple associative relationships among design entities (handled as design descriptors) are used to represent the design knowledge. The characteristics of the dependent and the primary descriptors are examined and their distinct roles in the design process are discussed. Term definitions concerning the information importance and the design effort are also introduced. The descriptors are used to form a matrix. A number of operations on this matrix results in its transformation, with the final matrix reflecting the quantitative relationship between the information importance and the design effort. From the aforementioned matrix, a unique sorted list for the primary design descriptors is produced. Following this list during descriptor …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Paper 118 Fault Diagnosis of Journal Bearings Based on Artificial Neural Networks and Measurements of Bearing Performance Characteristics",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/39544835/Fault_Diagnosis_of_Journal_Bearings_Base20151030-4028-10a4y16.pdf",
            "Abstract": "Two of the most common defects in rotating systems are abnormal wear of the bearing bushing and bearing misalignment. The present paper introduces a new fault diagnosis model that uses artificial neural networks (ANN) in order to identify the increase of wear depth and/or the increment of the misalignment angle. Reynolds equation is solved by FEM and provides data about bearing wear and misalignment. The proposed model uses eccentricity, altitude angle and minimum film thickness and feeds with their values an ANN that is trained in order to provide reliable identification of the variation of each defect. The accuracy of the proposed model is demonstrated-for several misalignment angles, worn depths and L/D ratios-for a worn/misaligned rotor bearing and its applicability as a real-time condition monitoring system is discussed.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A method for the automatic deduction of priority lists of entities and tasks from the design knowledge",
            "Publication year": 2001,
            "Publication url": "https://www.cambridge.org/core/journals/ai-edam/article/method-for-the-automatic-deduction-of-priority-lists-of-entities-and-tasks-from-the-design-knowledge/60FC7A5E6DE437FCEE50DB899ADC1F26",
            "Abstract": "This paper presents a method for the automatic deduction of priority lists of input information as well as for the extraction of task relations from the available design knowledge. The method is based on multiple extensive searches of the design space and produces a final priority list for the instantiation of the primary design entities. If followed, this list ensures the generation of the most decisive design information at the very beginning of the design process. Additionally, the method can produce a priority list of design tasks, which represents the order of completion of these tasks. Finally, it offers a representation platform for tracking the evolution of the design process. First, a brief overview of the current literature is presented, after which the method is presented in detail. Entities, descriptors, and tasks are used for the representation of the design knowledge. They are linked in order to form multiple design relations …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Collaborative Determination of Task Implementation Priorities in Engineering Design",
            "Publication year": 2010,
            "Publication url": "https://asmedigitalcollection.asme.org/ESDA/proceedings-abstract/ESDA2010/343/359713",
            "Abstract": "The present paper introduces a framework for the collaborative determination of design task implementation priorities according to design effort-based calculations. Hierarchical structures are used for representing associative dependencies among primary and dependent tasks. Design effort for task implementation is defined as function of various task-oriented issues such as designers’ experience, designers’ ability to fulfill task-related requirements, etc. Simple metrics are used to form a unified effort index for each individual task. Weighted collaborative determination of implementation effort for individual tasks is also studied. Weights are assigned to individual designers and a simple aggregation technique is used that provides overall values of effort indices for tasks when multiple designers are involved in the design process. A weighted dependency matrix so formed is further transformed through a number of …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A model for concept evaluation in design––an application to mechatronics design of robot grippers",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957415803001077",
            "Abstract": "In this paper, an approach for the modelling of the evaluation process in the conceptual design phase is presented. During the design process, the generated candidate solutions are evaluated. The evaluation is achieved by calculating a score that is based on specific criteria that are presented as elements of a vector. Weight factors are applied to highlight the importance of each criterion. The formulation of the evaluation score is based on t-norm and averaging operators with the assumption that the universe of discourse of criteria is [0,1]. A discussion of the meaning of these operators and a comparative study of them is presented. As an application, the mechatronics design of robot grippers for handling fabrics is analysed. The elements of the mechatronics index are presented in terms of flexibility, intelligence and complexity. This index is formulated using the variety of the t-norms and averaging operators to show …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:ufrVoPGSRksC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Formulation and use of criteria for the evaluation of aesthetic attributes of products in engineering design",
            "Publication year": 2013,
            "Publication url": "https://www.designsociety.org/download-publication/34619/formulation_and_use_of_criteria_for_the_evaluation_of_aesthetic_attributes_of_products_in_engineering_design",
            "Abstract": "Constant and rapid technological progress, along with the evolution of design and production methods, permits the adoption of technological achievements and the embodiment of new features in products. Some of these features pertain to aesthetic attributes that make the key difference when competitive products are considered by customers and users. Evaluation of products with respect to these attributes may be done by forming proper criteria that could be used in engineering design process.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identification of wear and misalignment on journal bearings using artificial neural networks",
            "Publication year": 2012,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1350650111424237",
            "Abstract": "Journal bearing bushing wear and shaft misalignment are the common defects observed in rotating systems. Both defects influence their dynamic behaviour, stability and life time and their detection is a very important task. This article introduces a defect diagnosis approach that uses artificial neural networks. Reynolds equation is solved by finite element method and wear/misalignment data are provided. Then, the proposed model uses values of journal bearing performance characteristics, such as eccentricity, attitude angle and film thickness, and it trains an artificial neural network so that reliable defect identification is performed. The accuracy of the proposed model is demonstrated – for different misalignment angles, wear depths and L/D ratios – for a worn/misaligned journal bearing. The potential use of the artificial neural networks-based model for a real-time condition monitoring system is also discussed. The …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Soft computing in engineering design–A review",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1474034607000717",
            "Abstract": "The present paper surveys the application of soft computing (SC) techniques in engineering design. Within this context, fuzzy logic (FL), genetic algorithms (GA) and artificial neural networks (ANN), as well as their fusion are reviewed in order to examine the capability of soft computing methods and techniques to effectively address various hard-to-solve design tasks and issues. Both these tasks and issues are studied in the first part of the paper accompanied by references to some results extracted from a survey performed for in some industrial enterprises. The second part of the paper makes an extensive review of the literature regarding the application of soft computing (SC) techniques in engineering design. Although this review cannot be collectively exhaustive, it may be considered as a valuable guide for researchers who are interested in the domain of engineering design and wish to explore the opportunities …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:Y0pCki6q_DkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fault diagnosis of journal bearings based on artificial neural networks and measurements of bearing performance characteristics",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=8051466811485859646&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A COMPOSITE INDEX FOR THE EVALUATION OF STANDARDIZATION LEVEL OF MECHANIC SYSTEMS",
            "Publication year": 2014,
            "Publication url": "https://www.designsociety.org/download-publication/35339/a_composite_index_for_the_evaluation_of_standardization_level_of_mechanic_systems",
            "Abstract": "Standardization of components of assemblies is important in both reverse engineering and design. In design, it leads to cost reduction by minimizing the number of items designed from scratch and the number of new manufacturing processes. The work presented introduces a composite standardization index by combining a commonality index and an absolute standardization index. The index counts the populations of common parts in assemblies and the degree of absolute conformance of those parts with engineering standards. It is a tool that represents reliably the level of standardization of a system.",
            "Abstract entirety": 1,
            "Author pub id": "V6BwW20AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Fuzzy System for Train Driver Support Towards an Efficient Handling of Engine Malfunctions",
            "Publication year": 2000,
            "Publication url": "https://asmedigitalcollection.asme.org/IDETC-CIE/proceedings-abstract/IDETC-CIE2000/155/1093606",
            "Abstract": "In the present paper, an approach based on fuzzy logic is presented concerning a fuzzy decision support system for faults’ handling in train driving. A short introduction is given first that contains the problem’s description and its major aspects. A literature review follows that refers to the last advances in the field of man–machine interface, fuzzy logic applications and fault handling procedures in train driving. The paper emphasizes also on the important role of fuzzy logic in capturing, expressing and exploiting the existing experience on faults’ manipulation during train operation.Furthermore, a theoretical approach is proposed for the development of a fuzzy decision support system that advises the train operator on faults’ handling during its operation. Except of the advice that could offer, it is expected that — after its development — the system will be able to continuously check on-line the operator’s actions …",
            "Abstract entirety": 0,
            "Author pub id": "V6BwW20AAAAJ:M05iB0D1s5AC",
            "Publisher": "American Society of Mechanical Engineers"
        }
    ]
}]