[{
    "name": "Αριστείδης Κοντογεώργης",
    "romanize name": "Aristeidis Kontogeorgis",
    "School-Department": "Μαθηματικών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 18766,
    "Scholar name": "Aristides Kontogeorgis",
    "Scholar id": "ydP9h5cAAAAJ",
    "Affiliation": "National and Kapodistrian University of Athens, Department of Mathematics",
    "Citedby": 454,
    "Interests": [
        "Number theory",
        "Arithmetic Geometry"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=ydP9h5cAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On the efficient generation of prime-order elliptic curves",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00145-009-9037-2.pdf",
            "Abstract": "We consider the generation of prime-order elliptic curves (ECs) over a prime field    using the Complex Multiplication (CM) method. A crucial step of this method is to compute the roots of a special type of class field polynomials with the most commonly used being the Hilbert and Weber ones. These polynomials are uniquely determined by the CM discriminant D. In this paper, we consider a variant of the CM method for constructing elliptic curves (ECs) of prime order using Weber polynomials. In attempting to construct prime-order ECs using Weber polynomials, two difficulties arise (in addition to the necessary transformations of the roots of such polynomials to those of their Hilbert counterparts). The first one is that the requirement of prime order necessitates that D≡3mod8), which gives Weber polynomials with degree three times larger than the degree of their corresponding Hilbert polynomials (a fact that could affect …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "The relation between rigid-analytic and algebraic deformation parameters for Artin-Schreier-Mumford curves",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11856-010-0107-9",
            "Abstract": "We consider three examples of families of curves over a non-archimedean valued field which admit a non-trivial group action. These equivariant deformation spaces can be described by algebraic parameters (in the equation of the curve), or by rigid-analytic parameters (in the Schottky group of the curve). We study the relation between these parameters as rigid-analytic self-maps of the disk.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:ufrVoPGSRksC",
            "Publisher": "The Hebrew University Magnes Press"
        },
        {
            "Title": "Group Actions on cyclic covers of the projective line",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10711-019-00501-w",
            "Abstract": "We use tools from combinatorial group theory in order to study actions of three types on groups acting on a curve, namely the automorphism group of a compact Riemann surface, the mapping class group acting on a surface (which now is allowed to have some points removed) and the absolute Galois group  in the case of cyclic covers of the projective line.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "BIELLIPTIC AND HYPERELLIPTIC MODULAR CURVES X (N)",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Xavier-Xarles/publication/229012080_Bielliptic_and_Hyperelliptic_modular_curves_XN_and_the_group_AutXN/links/0f31753230030dca46000000/Bielliptic-and-Hyperelliptic-modular-curves-XN-and-the-group-AutXN.pdf",
            "Abstract": "This note has two main facets, first we determine all modular curves X (N)(with N≥ 7) which are hyperelliptic or bielliptic. As a consequence, the set Γ2 (X (N), M):={P∈ X (N)(L)|[L: M]≤ 2} is not finite for some number field M if and only if N= 7 or N= 8. Moreover, we obtain that Γ2 (X (N), Q (ζN)) is always finite where ζN is an N-th primitive root of unity, hence, in particular, the number of quadratic points is finite for any model XN over Q of X (N). Secondly we make available a proof that the automorphism group of X (N) coincides with the normalizer of Γ (N) in PSL2 (R) modulo±Γ (N), in particular no exceptional automorphisms appear for X (N).",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AUTOMORPHISMS OF CURVES AND WEIERSTRASS SEMIGROUPS FOR KATZ-GABBER COVERS",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Aristides-Kontogeorgis/publication/235432510_Automorphisms_of_Curves_and_Weierstrass_semigroups_forHarbeter-Katz-Gabber_covers/links/0fcfd5119486e41aa0000000/Automorphisms-of-Curves-and-Weierstrass-semigroups-for-Harbeter-Katz-Gabber-covers.pdf",
            "Abstract": "We study p-group Galois covers X→ P1 with only one fully ramified point. These covers are important because of the Katz-Gabber compactification of Galois actions on complete local rings. The sequence of ramification jumps is related to the Weierstrass semigroup of the global cover at the stabilized point. We determine explicitly the jumps of the ramification filtrations in terms of pole numbers. We give applications for curves with zero p–rank: we focus on maximal curves and curves that admit a big action. Moreover the Galois module structure of polydifferentials is studied and an application to the tangent space of the deformation functor of curves with automorphisms is given.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On abelian automorphism groups of Mumford curves",
            "Publication year": 2008,
            "Publication url": "https://londmathsoc.onlinelibrary.wiley.com/doi/abs/10.1112/blms/bdn011",
            "Abstract": "We use rigid analytic uniformization by Schottky groups to give a bound for the order of the abelian subgroups of the automorphism group of a Mumford curve in terms of its genus.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Automorphisms on Shimura curves, On the non-existence of exceptional automorphisms on Shimura curves",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=9572789487116492877&hl=en&oi=scholarr",
            "Abstract": "We study the group of automorphisms of Shimura curves  attached to an Eichler order of square-free level  in an indefinite rational quaternion algebra of discriminant . We prove that, when the genus  of the curve is greater than or equal to 2, $\\Aut (X_0 (D, N)) $ is a 2-elementary abelian group which contains the group of Atkin-Lehner involutions  as a subgroup of index 1 or 2. It is conjectured that $\\Aut (X_0 (D, N))= W_0 (D, N) $ except for finitely many values of  and we provide criteria that allow us to show that this is indeed often the case. Our methods are based on the theory of complex multiplication of Shimura curves and the Cerednik-Drinfeld theory on their rigid analytic uniformization at primes .",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The equivariant Hilbert series of the canonical ring of Fermat curves",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.06945",
            "Abstract": "We consider a Fermat curve  over an algebraically closed field  of characteristic  and study the action of the automorphism group $G=\\left(\\mathbb{Z}/n\\mathbb{Z}\\times\\mathbb{Z}/n\\mathbb{Z}\\right)\\rtimes S_3$ on the canonical ring  when ,  and  is not a power of . In particular, we explicitly determine the classes  in the Grothendieck group  of finitely generated -modules, describe the respective equivariant Hilbert series  as a rational function, and use our results to write a program in Sage that computes  for an arbitrary Fermat curve.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correction to: Discontinuous groups in positive characteristic and automorphisms of Mumford curves",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00208-019-01901-9",
            "Abstract": "The main theorem of [2], claiming to give an upper bound for the number of automorphisms of a Mumford curve in characteristic",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Polydifferentials and the deformation functor of curves with automorphisms",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022404906002258",
            "Abstract": "We give a relation between the dimension of the tangent space of the deformation functor of curves with automorphisms and the Galois module structure of the space of 2-holomorphic differentials. We prove a homological version of the local–global principle similar to the one of J. Bertin and A. Mézard. Let G be a cyclic subgroup of the group of automorphisms of a curve X, so that the order of G is equal to the characteristic. By using the results of S. Nakajima on the Galois module structure of the space of 2-holomorphic differentials, we compute the dimension of the tangent space of the deformation functor.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:Y0pCki6q_DkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Automorphisms of curves and Weierstrass semigroups",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1005.2871",
            "Abstract": "The relation of the Weierstrass semigroup with several invariants of a curve is studied. For Galois covers of curves with group  we introduce a new filtration of the group decomposition subgroup of . The relation to the ramification filtration is investigated in the case of cyclic covers. We relate our results to invariants defined by Boseck and we study the one point ramification case. We also give applications to Hasse-Witt invariant and symmetric semigroups.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automorphisms of Curves and Weierstrass semigroups for Harbater-Katz-Gabber covers",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1302.2528",
            "Abstract": "We study -group Galois covers  with only one fully ramified point. These covers are important because of the Katz-Gabber compactification of Galois actions on complete local rings. The sequence of ramification jumps is related to the Weierstrass semigroup of the global cover at the stabilized point. We determine explicitly the jumps of the ramification filtrations in terms of pole numbers. We give applications for curves with zero --rank: we focus on maximal curves and curves that admit a big action. Moreover the Galois module structure of polydifferentials is studied and an application to the tangent space of the deformation functor of curves with automorphisms is given.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automorphisms of the generalized fermat curves",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.740.6446&rep=rep1&type=pdf",
            "Abstract": "The automorphism group of the generalized Fermat Fk, n curves is studied. We use tools from the theory of complete projective intersections in order to prove that every automorphism of the curve can be extended to an automorphism of the ambient projective space. In particular if k-1 is not a power of the characteristic, then a conjecture of of Y. Fuertes, G. González-Diez, R. Hidalgo, M. Leyton is proved.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Arithmetic actions on cyclotomic function fields",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022404920301791",
            "Abstract": "We derive the group structure for cyclotomic function fields obtained by applying the Carlitz action for extensions of an initial constant field. The tame and wild structures are isolated to describe the Galois action on differentials. We show that the associated invariant rings are not polynomial.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:blknAaTinKkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Convergence of families of Dirichlet series",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1509.03863",
            "Abstract": "We give some conditions under which (uniform) convergence of a family of Dirichlet series to another Dirichlet series implies the convergence of their individual coefficients and/or exponents. We give some applications to some spectral zeta functions that arise in Riemannian geometry and physics.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Revisiting the Complex Multiplication Method for the Construction of Elliptic Curves",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-18275-9_12",
            "Abstract": "In this article we give a detailed overview of the Complex Multiplication (CM) method for constructing elliptic curves with a given number of points. In the core of this method, there is a special polynomial called Hilbert class polynomial which is constructed with input a fundamental discriminantd < 0. The construction of this polynomial is the most demanding and time-consuming part of the method and thus the use of several alternative polynomials has been proposed in previous work. All these polynomials are calledclass polynomials and they are generated by proper values of modular functions calledclass invariants. Besides an analysis on these polynomials, in this paper we will describe our results about finding new class invariants using the Shimura reciprocity law. Finally, we will see how the choice of the discriminant can affect the degree of the class polynomial and consequently the efficiency of the …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Supercongruences satisfied by coefficients of 2F1 hypergeometric series",
            "Publication year": 2009,
            "Publication url": "https://arxiv.org/abs/0912.0620",
            "Abstract": "Recently, Chan, Cooper and Sica conjectured two congruences for coefficients of classical 2F1 hypergeometric series which also arise from power series expansions of modular forms in terms of modular functions. We prove these two congruences using combinatorial properties of the coefficients.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bielliptic and hyperelliptic modular curves X (N) and the group Aut (X (N))",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1207.2273",
            "Abstract": "We determine all modular curves X(N) (with ) which are hyperelliptic or bielliptic. We make available a proof that the automorphism group of X(N) coincides with the normalizer of  in .",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Arithmetic equivalence for function fields, the Goss zeta function and a generalisation",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022314X09002297",
            "Abstract": "A theorem of Tate and Turner says that global function fields have the same zeta function if and only if the Jacobians of the corresponding curves are isogenous. In this note, we investigate what happens if we replace the usual (characteristic zero) zeta function by the positive characteristic zeta function introduced by Goss. We prove that for function fields whose characteristic exceeds their degree, equality of the Goss zeta function is the same as Gaßmann equivalence (a purely group theoretical property), but this statement can fail if the degree exceeds the characteristic. We introduce a ‘Teichmüller lift’ of the Goss zeta function and show that equality of such is always the same as Gaßmann equivalence.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Some remarks on the construction of class polynomials",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/amc.2011.5.109",
            "Abstract": "Class invariants are singular values of modular functions which generate the class fields of imaginary quadratic number fields. Their minimal polynomials, called class polynomials, are uniquely determined by a discriminant− D< 0 and are used in many applications, including the generation of elliptic curves. In all these applications, it is desirable that the size of the polynomials is as small as possible. Among all known class polynomials, Weber polynomials constructed with discriminants− D≡ 1 (mod 8) have the smallest height and require the least precision for their construction. In this paper, we will show that this fact does not necessarily lead to the most efficient computations, since the congruences modulo 8 of the discriminants affect the degrees of the polynomials.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:8k81kl-MbHgC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Ramanujan’s class invariants and their use in elliptic curve cryptography",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0898122110001173",
            "Abstract": "The Complex Multiplication (CM) method is a method frequently used for the generation of elliptic curves (ECs) over a prime field F p. The most demanding and complex step of this method is the computation of the roots of a special type of class polynomials, called Hilbert polynomials. However, there are several polynomials, called class polynomials, which can be used in the CM method, having much smaller coefficients, and fulfilling the prerequisite that their roots can be easily transformed to the roots of the corresponding Hilbert polynomials. In this paper, we propose the use of a new class of polynomials which are derived from Ramanujan’s class invariants t n. We explicitly describe the algorithm for the construction of the new polynomials and give the necessary transformation of their roots to the roots of the corresponding Hilbert polynomials. We provide a theoretical asymptotic bound for the bit …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:roLk4NBRz8UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Generating prime order elliptic curves: difficulties and efficiency considerations",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/11496618_20",
            "Abstract": "We consider the generation of prime order elliptic curves (ECs) over a prime field  using the Complex Multiplication (CM) method. A crucial step of this method is to compute the roots of a special type of class field polynomials with the most commonly used being the Hilbert and Weber ones, uniquely determined by the CM discriminant D. In attempting to construct prime order ECs using Weber polynomials two difficulties arise (in addition to the necessary transformations of the roots of such polynomials to those of their Hilbert counterparts). The first one is that the requirement of prime order necessitates that D ≡ 3 (mod 8), which gives Weber polynomials with degree three times larger than the degree of their corresponding Hilbert polynomials (a fact that could affect efficiency). The second difficulty is that these Weber polynomials do not have roots in . In this paper we show how to overcome the above difficulties and …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Algebra & Number Theory",
            "Publication year": 2007,
            "Publication url": "https://projecteuclid.org/journalArticle/Download?urlid=10.2140%2Fant.2007.1.119",
            "Abstract": "We provide a method to compute the dimension of the tangent space to the global infinitesimal deformation functor of a curve together with a subgroup of the group of automorphisms. The computational techniques we developed are applied to several examples including Fermat curves, p-cyclic covers of the affine line and to Lehr–Matignon curves.The aim of this paper is the study of equivariant equicharacteristic infinitesimal deformations of a curve X of genus g, admitting a group of automorphisms. This paper is the result of my attempt to understand the work of J. Bertin and A. Mézard [2000] and of G. Cornelissen and F. Kato [2003]. Let X be a smooth projective algebraic curve, defined over an algebraically closed field of characteristic p≥ 0. The infinitesimal deformations of the curve X, without considering compatibility with the group action, correspond to directions on the vector space H1 (X, X) which constitutes …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Three examples of the relation between rigid-analytic and algebraic deformation parameters",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0809.4579",
            "Abstract": "We consider three examples of families of curves over a non-archimedean valued field which admit a non-trivial group action. These equivariant deformation spaces can be described by algebraic parameters (in the equation of the curve), or by rigid-analytic parameters (in the Schottky group of the curve). We study the relation between these parameters as rigid-analytic self-maps of the disk.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generalized skein relation for Khovanov homology and a categorification of the θ-invariant",
            "Publication year": 2019,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-royal-society-of-edinburgh-section-a-mathematics/article/generalized-skein-relation-for-khovanov-homology-and-a-categorification-of-the-invariant/D137A34C007681E813546C060D812D77",
            "Abstract": "The Jones polynomial is a famous link invariant that can be defined diagrammatically via a skein relation. Khovanov homology is a richer link invariant that categorifies the Jones polynomial. Using spectral sequences, we obtain a skein-type relation satisfied by the Khovanov homology. Thanks to this relation, we are able to generalize the Khovanov homology in order to obtain a categorification of the θ-invariant, which is itself a generalization of the Jones polynomial.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Royal Society of Edinburgh Scotland Foundation"
        },
        {
            "Title": "ACTIONS ON SYMMETRIC CURVES FROM THE ARITHMETIC TOPOLOGY VIEWPOINT",
            "Publication year": 2018,
            "Publication url": "http://users.uoa.gr/~kontogar/files/180407021.pdf",
            "Abstract": "We give an explanation of the MKR dictionary in Arithmetic topology using Ihara’s theory of profinite braid groups. Motivated by the analogy we perform explicit computations for representations of both braid groups and the absolute Galois group Gal (Q/Q) for cyclic covers of the projective line and generalized Fermat curves.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automorphisms and the canonical ideal",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00009-021-01878-3",
            "Abstract": "The automorphism group of a curve is studied from the viewpoint of the canonical embedding and Petri’s theorem. A criterion for identifying the automorphism group as an algebraic subgroup the general linear group is given. Furthermore, the action of the automorphism group is extended to a linear action on the generators of the minimal free resolution of the canonical ring of the curve X.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Biduality and Reflexivity in Positive Characteristic",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1711.03769",
            "Abstract": "The biduality and reflexivity theorems are known to hold for projective varieties defined over fields of characteristic zero, and to fail in positive characteristic. In this article, we construct a notion of reflexivity and biduality in positive characteristic by generalizing the ordinary tangent space to the notion of -tangent spaces. The ordinary reflexivity theory can be recovered as the special case , of our theory. Several varieties that are not ordinary reflexive or bidual become reflexive in our extended theory.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Galois action on homology of generalized Fermat Curves",
            "Publication year": 2020,
            "Publication url": "https://academic.oup.com/qjmath/article-abstract/71/4/1377/6008847",
            "Abstract": "The fundamental group of Fermat and generalized Fermat curves is computed. These curves are Galois ramified covers of the projective line with abelian Galois groups H. We provide a unified study of the action of both cover Galois group H and the absolute Galois group  on the pro- homology of the curves in study. Also the relation to the pro- Burau representation is investigated.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:u_35RYKgDlwC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A generating set for the canonical ideal of HKG-curves",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s40993-020-00230-0",
            "Abstract": "The canonical ideal for Harbater Katz Gabber covers satisfying the conditions of Petri’s theorem is studied and an explicit non-singular model of the above curves is given.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Quadratic differentials and equivariant deformation theory of curves",
            "Publication year": 2012,
            "Publication url": "http://www.numdam.org/articles/10.5802/aif.2715/",
            "Abstract": "Let X be a non-singular complete curve of genus gX⩾ 2 defined over an algebraically closed field k of characteristic p and let G be a subgroup of the automorphism group of X. The equivariant deformation problem associated with this situation is to determine in how many ways X can be deformed to another curve that also allows G as a group of automorphisms. More precisely, we are led to study the deformation functor D which maps any local Artinian k-algebra A to the set of isomorphism classes of lifts",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Representations of automorphisms and deformation of curves",
            "Publication year": 2015,
            "Publication url": "https://open.library.ubc.ca/collections/birs/items/1.0228488",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Banff International Research Station for Mathematical Innovation and Discovery"
        },
        {
            "Title": "Field of moduli versus field of definition for cyclic covers of the projective line",
            "Publication year": 2009,
            "Publication url": "http://www.numdam.org/articles/10.5802/jtnb.694/?source=ASENS_1997_4_30_3_303_0",
            "Abstract": "We give a criterion, based on the automorphism group, for certain cyclic covers of the projective line to be defined over their field of moduli. An example of a cyclic cover of the complex projective line with field of moduli R that can not be defined over R is also given.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deformation of Curves with Automorphisms and representations on Riemann-Roch spaces",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0804.1647",
            "Abstract": "We study the deformation theory of nonsigular projective curves defined over algebraic closed fields of positive characteristic. We show that under some assumptions the local deformation problem for automorphisms of powerseries can be reduced to a deformation problem for matrix representations. We study both equicharacteristic and mixed deformations in the case of two dimensional representations.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ramification sequence for a fixed point of an automorphism of a curve and the Weierstrass gap sequence",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00209-007-0231-3.pdf",
            "Abstract": "For nonsingular projective curves defined over algebraically closed fields of positive characteristic the dependence of the ramification filtration of decomposition groups of the automorphism group with Weierstrass semigroups attached at wild ramification points is studied. A faithful representation of the p-part of the decomposition group at each wild ramified point to a Riemann–Roch space is defined.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Galois structure of the holomorphic differentials of curves",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022314X20301426",
            "Abstract": "Let X be a smooth projective geometrically irreducible curve over a perfect field k of positive characteristic p. Suppose G is a finite group acting faithfully on X such that G has non-trivial cyclic Sylow p-subgroups. We show that the decomposition of the space of holomorphic differentials of X into a direct sum of indecomposable k [G]-modules is uniquely determined by the lower ramification groups and the fundamental characters of closed points of X that are ramified in the cover X⟶ X/G. We apply our method to determine the PSL (2, F ℓ)-module structure of the space of holomorphic differentials of the reduction of the modular curve X (ℓ) modulo p when p and ℓ are distinct odd primes and the action of PSL (2, F ℓ) on this reduction is not tamely ramified. This provides some non-trivial congruences modulo appropriate maximal ideals containing p between modular forms arising from isotypic components with respect to …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:TFP_iSt0sucC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Automorphisms of curves and Weierstrass semigroups for Harbater–Katz–Gabber covers",
            "Publication year": 2019,
            "Publication url": "https://www.ams.org/tran/0000-000-00/S0002-9947-2019-07562-1/",
            "Abstract": "We study -group Galois covers  with only one fully ramified point in characteristic . These covers are important because of the Harbater-Katz-Gabber compactification theorem of Galois actions on complete local rings. The sequence of ramification jumps is related to the Weierstrass semigroup of the global cover at the stabilized point. We determine explicitly the jumps of the ramification filtrations in terms of pole numbers. We give applications for curves with zero -rank: we focus on curves that admit a big action. Moreover, we initiate the study of the Galois module structure of polydifferentials.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the tangent space of the deformation functor of curves with automorphisms",
            "Publication year": 2007,
            "Publication url": "https://msp.org/ant/2007/1-2/p01.xhtml",
            "Abstract": "We provide a method to compute the dimension of the tangent space to the global infinitesimal deformation functor of a curve together with a subgroup of the group of automorphisms. The computational techniques we developed are applied to several examples including Fermat curves, p-cyclic covers of the affine line and to Lehr–Matignon curves.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:qjMakFHDy7sC",
            "Publisher": "Mathematical Sciences Publishers"
        },
        {
            "Title": "Ramanujan invariants for discriminants congruent to 5 (mod 24)",
            "Publication year": 2012,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S1793042112500157",
            "Abstract": "In this paper we compute the minimal polynomials of Ramanujan values  for discriminants D ≡ 5 (mod 24). Our method is based on Shimura Reciprocity Law as which was made computationally explicit by Gee and Stevenhagen in [Generating class fields using Shimura reciprocity, in Algorithmic Number Theory, Lecture Notes in Computer Science, Vol. 1423 (Springer, Berlin, 1998), pp. 441–453; MR MR1726092 (2000m:11112)]. However, since these Ramanujan values are not class invariants, we present a modification of the method used in [Generating class fields using Shimura reciprocity, in Algorithmic Number Theory, Lecture Notes in Computer Science, Vol. 1423 (Springer, Berlin, 1998), pp. 441–453; MR MR1726092 (2000m:11112)] which can be applied on modular functions that do not necessarily yield class invariants.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:M3ejUd6NZC8C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Supercongruences satisfied by coefficients of 2F1 hypergeometric series",
            "Publication year": 2009,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2009arXiv0912.0620H/abstract",
            "Abstract": "Recently, Chan, Cooper and Sica conjectured two congruences for coefficients of classical 2F1 hypergeometric series which also arise from power series expansions of modular forms in terms of modular functions. We prove these two congruences using combinatorial properties of the coefficients.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Galois-module structure of polydifferentials of Subrao curves, modular and integral representation theory",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1305.1541",
            "Abstract": "We study the Galois-module structure of polydifferentials on Mumford curves, defined over a field of positive charactersitic. We give the complete structure for the Subrao curves using the theory of harmonic cocycles.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Framization of the Temperley-Lieb algebra",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1304.7440",
            "Abstract": "We propose a framization of the Temperley-Lieb algebra. The framization is a procedure that can briefly be described as the adding of framing to a known knot algebra in a way that is both algebraically consistent and topologically meaningful. Our framization of the Temperley-Lieb algebra is defined as a quotient of the Yokonuma-Hecke algebra. The main theorem provides necessary and sufficient conditions for the Markov trace defined on the Yokonuma-Hecke algebra to pass through to the quotient algebra. Using this we construct 1-variable invariants for classical knots and links, which, as we show, are not topologically equivalent to the Jones polynomial.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On cyclic covers of the projective line",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s00229-006-0028-4",
            "Abstract": "We construct configuration spaces for cyclic covers of the projective line that admit extra automorphisms and we describe the locus of curves with given automorphism group. As an application we provide examples of arbitrary high genus that are defined over their field of moduli and are not hyperelliptic.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A homological approach for computing the tangent space of the deformation functor of curves with automorphisms",
            "Publication year": 2003,
            "Publication url": "https://arxiv.org/abs/math/0312447",
            "Abstract": "We give an alternative approach to the computation of the dimension of the tangent space of the deformation space of curves with automorphisms. A homological version of the local-global principle similar to the one of J.Bertin, A. M\\'ezard is proved, and a computation in the case of ordinary curves is obtained, by application of the results of S. Nakajima for the Galois module structure of the space of 2-holomorphic differentials on them.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The canonical ideal and the deformation theory of curves with automorphisms",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/pdf/2101.11084",
            "Abstract": "The deformation theory of curves is studied by using the canonical ideal. The problem of lifting curves with automorphisms is reduced to a lifting problem of linear representations.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Actions of Galois groups on invariants of number fields",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022314X07001242",
            "Abstract": "In this paper we investigate the connection between relations among various invariants of number fields L H corresponding to subgroups H acting on L and of linear relations among norm idempotents.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Syzygies of ideals of polynomial rings over principal ideal domains",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3373207.3404046",
            "Abstract": "We study computational aspects of syzygies of graded modules over polynomial rings R [w 1,..., w g] when the base R is a discrete valuation ring. In particular, we use the torsion of their syzygies over R to provide a formula which describes the behavior of the Betti numbers when changing the base to the residue field or the fraction field of R. Our work is motivated by the deformation theory of curves.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automorphisms of generalized Fermat curves",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022404916302110",
            "Abstract": "Let K be an algebraically closed field of characteristic p≥ 0. A generalized Fermat curve of type (k, n), where k, n≥ 2 are integers (for p≠ 0 we also assume that k is relatively prime to p), is a non-singular irreducible projective algebraic curve F k, n defined over K admitting a group of automorphisms H≅ Z k n so that F k, n/H is the projective line with exactly (n+ 1) cone points, each one of order k. Such a group H is called a generalized Fermat group of type (k, n). If (n− 1)(k− 1)> 2, then F k, n has genus g n, k> 1 and it is known to be non-hyperelliptic. In this paper, we prove that every generalized Fermat curve of type (k, n) has a unique generalized Fermat group of type (k, n) if (k− 1)(n− 1)> 2 (for p> 0 we also assume that k− 1 is not a power of p). Generalized Fermat curves of type (k, n) can be described as a suitable fiber product of (n− 1) classical Fermat curves of degree k. We prove that, for (k− 1)(n− 1)> 2 (for p> 0 …",
            "Abstract entirety": 0,
            "Author pub id": "ydP9h5cAAAAJ:mB3voiENLucC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Integral representations of cyclic groups acting on relative holomorphic differentials of deformations of curves with automorphisms",
            "Publication year": 2014,
            "Publication url": "https://www.jstor.org/stable/23809576",
            "Abstract": "We study integral representations of holomorphic differentials on the Oort-Sekiguchi-Suwa component of deformations of curves with cyclic group actions.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:YOwf2qJgpHMC",
            "Publisher": "American Mathematical Society"
        },
        {
            "Title": "The group of automorphisms of the Heisenberg curve",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1912.00390",
            "Abstract": "The Heisenberg curve is defined to be the curve corresponding to an extension of the projective line by the Heisenberg group modulo , ramified above three points. This curve is related to the Fermat curve and its group of automorphisms is studied. Also we give an explicit equation for the curve .",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Yokonuma-Temperley-Lieb Algebra",
            "Publication year": 2010,
            "Publication url": "https://arxiv.org/abs/1012.1557",
            "Abstract": "In this paper we introduce the Yokonuma-Temperley-Lieb algebra as a quotient of the Yokonuma-Hecke algebra over a two-sided ideal generated by an expression analogous to the one of the classical Temperley-Lieb algebra. The main theorem provides necessary and sufficient conditions for the Markov trace defined on the Yokonuma-Hecke algebra to pass through to the quotient algebra, leading to a sequence of knot invariants which coincide with the Jones polynomial.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ON THE GALOIS-MODULE STRUCTURE OF POLYDIFFERENTIALS OF ARTIN-SCHREIER-MUMFORD CURVES, MODULAR AND INTEGRAL REPRESENTATION THEORY",
            "Publication year": 2016,
            "Publication url": "http://users.uoa.gr/~kontogar/OldWEB/bibtex/Fumiharu10FEb2016.pdf",
            "Abstract": "We study the Galois-module structure of polydifferentials for Mumford curves, defined over a field of positive charactersitic, using the theory of harmonic cocycles. For the case of Artin-Schreier-Mumford curves the structure of holomorphic polydifferentials is explicitly computed.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A non-commutative differential module approach to Alexander modules",
            "Publication year": 2021,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/forum-2020-0224/html",
            "Abstract": "The theory of R. Crowell on derived modules is approached within the theory of non-commutative differential modules. We also seek analogies to the theory of cotangent complex from differentials in the commutative ring setting. Finally, we give examples motivated from the theory of Galois coverings of curves.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:BqipwSGYUEgC",
            "Publisher": "De Gruyter"
        },
        {
            "Title": "Automorphisms of hyperelliptic modular curves X0 (N) in positive characteristic",
            "Publication year": 2010,
            "Publication url": "https://www.cambridge.org/core/journals/lms-journal-of-computation-and-mathematics/article/automorphisms-of-hyperelliptic-modular-curves-x0n-in-positive-characteristic/1A030641BD09D34B8FEB8A7A5782E5AC",
            "Abstract": "We study the automorphism groups of the reduction of a modular curve X0(N) over primes p∤N.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:kNdYIx-mwKoC",
            "Publisher": "London Mathematical Society"
        },
        {
            "Title": "Computing polynomials of the Ramanujan tn class invariants",
            "Publication year": 2009,
            "Publication url": "https://www.cambridge.org/core/journals/canadian-mathematical-bulletin/article/computing-polynomials-of-the-ramanujan-tn-class-invariants/94C2980C158CA87B70DB8C32F59D07AD",
            "Abstract": "We compute the minimal polynomials of the Ramanujan values , where , using the Shimura reciprocity law. These polynomials can be used for defining the Hilbert class field of the imaginary quadratic field and have much smaller coefficients than the Hilbert polynomials.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Representation of cyclic groups in positive characteristic and Weierstrass semigroups",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022314X12002132",
            "Abstract": "We study the k [G]-module structure of the space of holomorphic differentials of a curve defined over an algebraically closed field of positive characteristic, for a cyclic group G of order p ℓ n. We also study the relation to the Weierstrass semigroup for the case of Galois Weierstrass points.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A cohomological treatise of HKG-covers with applications to the Nottingham group",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0021869320301459",
            "Abstract": "We characterize Harbater-Katz-Gabber curves in terms of a family of cohomology classes satisfying a compatibility condition. Our construction is applied to the description of finite subgroups of the Nottingham Group.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Introducing Ramanujan's Class Polynomials in the Generation of Prime Order Elliptic Curves",
            "Publication year": 2008,
            "Publication url": "https://arxiv.org/abs/0804.1652",
            "Abstract": "In this paper, we propose the use of Ramanujan class of polynomials for the construction of prime order elliptic curves using the CM-method. We compare (theoretically and experimentally) the efficiency of using this new class against the use of the Weber,  and  polynomials and show that they clearly outweigh all of them in the generation of prime order elliptic curves.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Size of families of curves with large automorphism group in positive characteristic",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.236.1727&rep=rep1&type=pdf",
            "Abstract": "The size of the base of deformations of curves acted fiberwise by groups that exceed the classical Hurwitz bound is studied. Under the assumption that curves can be not trivially deformed together with the automorphism group the bounds for the automorphism group in positive characteristic are improved.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the non‐existence of exceptional automorphisms on Shimura curves",
            "Publication year": 2008,
            "Publication url": "https://londmathsoc.onlinelibrary.wiley.com/doi/abs/10.1112/blms/bdn012",
            "Abstract": "We study the group of automorphisms of Shimura curves X0(D, N) attached to an Eichler order of square‐free level N in an indefinite rational quaternion algebra of discriminant D>1. We prove that, when the genus g of the curve is greater than or equal to 2, Aut (X0(D, N)) is a 2‐elementary abelian group which contains the group of Atkin–Lehner involutions W0(D, N) as a subgroup of index 1 or 2. It is conjectured that Aut (X0(D, N))=W0(D, N) except for finitely many values of (D, N) and we provide criteria that allow us to show that this is indeed often the case. Our methods are based on the theory of complex multiplication of Shimura curves and the Cerednik–Drinfeld theory on their rigid analytic uniformization at primes p| D.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "What is your “birthday elliptic curve”?",
            "Publication year": 2012,
            "Publication url": "http://users.uoa.gr/~kontogar/OldWEB/bibtex/Aristides-Elisavet-ChikHow.pdf",
            "Abstract": "In 2009 at Max Planck Institut für Mathematik (Bonn), P. Stevenhagen asked the following question:",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Relative Canonical Ideal of the Artin-Schreier-Kummer-Witt family of curves",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1905.05545",
            "Abstract": "We study the canonical model of the Artin-Schreier-Kummer-Witt flat family of curves over a ring of mixed characteristic. We first prove the relative version of a classical theorem by Petri, then use the model proposed by Bertin-M\\'ezard to construct an explicit generating set for the relative canonical ideal. As a byproduct, we obtain a combinatorial criterion for a set to generate the canonical ideal, applicable to any curve satisfying the assumptions of Petri's theorem.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the principal ideal theorem in arithmetic topology",
            "Publication year": 2007,
            "Publication url": "https://arxiv.org/abs/0705.3937",
            "Abstract": "In this paper we state and prove the analogous of the principal ideal theorem of algebraic number theory for the case of 3-manifolds from the point of view of arithmetic topology.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A geometric interpretation of the Hasse-Arf theorem",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/pdf/1302.3352",
            "Abstract": "We give an a geometric interpretation of the Hasse-Arf theorem for function fields using the recently proved Oort conjecture.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Krull dimension of the deformation ring of curves with automorphisms",
            "Publication year": 2005,
            "Publication url": "https://arxiv.org/abs/math/0504093",
            "Abstract": "We reduce the study of the Krull dimension d of the deformation ring of the functor of deformations of curves with automorphisms to the study of the tangent space of the deformation functor of a class of matrix representations of the p-part of the decomposition groups at wild ramified points, and we give a method in order to compute d.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automorphisms of Fermat-like varieties",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1007/s002290100233",
            "Abstract": " We study the automorphisms of some nice hypersurfaces and complete intersections in projective space by reducing the problem to the determination of the linear automorphisms of the ambient space that leave the algebraic set invariant.   ",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Automorphisms of Curves",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-68103-0_16",
            "Abstract": "This is a survey article concerning the groups of automorphisms of curves defined over algebraically closed fields of positive characteristic, their representations and applications to their deformation theory.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Distances in spaces of physical models: partition functions versus spectra",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s11005-016-0891-1",
            "Abstract": "We study the relation between convergence of partition functions (seen as general Dirichlet series) and convergence of spectra and their multiplicities. We describe applications to convergence in physical models, e.g., related to topology change and averaging in cosmology.",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Constructing class invariants",
            "Publication year": 2014,
            "Publication url": "https://www.ams.org/journals/mcom/0000-000-00/S0025-5718-2013-02769-X/S0025-5718-2013-02769-X.pdf",
            "Abstract": "Shimura reciprocity law allows us to verify that a modular function gives rise to a class invariant. Here we present a new method based on Shimura reciprocity that allows us not only to verify but to find new class invariants from a modular function of level .",
            "Abstract entirety": 1,
            "Author pub id": "ydP9h5cAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        }
    ]
}]