[{
    "name": "Αριστείδης Λύκας",
    "romanize name": "Aristeidis Lykas",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών  & Πληροφορικής",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 11212,
    "Scholar name": "Aristidis Likas",
    "Scholar id": "kb39Kx0AAAAJ",
    "Affiliation": "Professor, Computer Science & Engineering, University of Ioannina, Greece",
    "Citedby": 11402,
    "Interests": [
        "Artificial Intelligence"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=kb39Kx0AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Engineering Applications of Neural Networks: 18th International Conference, EANN 2017, Athens, Greece, August 25–27, 2017, Proceedings",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=gR8vDwAAQBAJ&oi=fnd&pg=PR5&dq=info:TAgNT4_WMzoJ:scholar.google.com&ots=JpM4OcKhDj&sig=BpEtQQSKsSRWMB6cfMg3TGyY0ss",
            "Abstract": "This book constitutes the refereed proceedings of the 18th International Conference on Engineering Applications of Neural Networks, EANN 2017, held in Athens, Greece, in August 2017. The 40 revised full papers and 5 revised short papers presented were carefully reviewed and selected from 83 submissions. The papers cover the topics of deep learning, convolutional neural networks, image processing, pattern recognition, recommendation systems, machine learning, and applications of Artificial Neural Networks (ANN) applications in engineering, 5G telecommunication networks, and audio signal processing. The volume also includes papers presented at the 6th Mining Humanistic Data Workshop (MHDW 2017) and the 2nd Workshop on 5G-Putting Intelligence to the Network Edge (5G-PINE).",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:8xutWZnSdmoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Transductive reliability estimation for kernel based classifiers",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74825-0_4",
            "Abstract": "Estimating the reliability of individual classifications is very important in several applications such as medical diagnosis. Recently, the transductive approach to reliability estimation has been proved to be very efficient when used with several machine learning classifiers, such as Naive Bayes and decision trees. However, the efficiency of the transductive approach for state-of-the art kernel-based classifiers was not considered. In this work we deal with this problem and apply the transductive reliability methodology with sparse kernel classifiers, specifically the Support Vector Machine and Relevance Vector Machine. Experiments with medical and bioinformatics datasets demonstrate better performance of the transductive approach for reliability estimation compared to reliability measures obtained directly from the output of the classifiers. Furthermore, we apply the methodology in the problem of reliable …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Combining magnetic resonance spectroscopy and molecular genomics offers better accuracy in brain tumor typing and prediction of survival than either methodology alone",
            "Publication year": 2011,
            "Publication url": "https://www.spandidos-publications.com/10.3892/ijo.2011.928",
            "Abstract": "Recent advents in magnetic resonance spectroscopy (MRS) techniques permit subsequent microarray analysis over the entire human transcriptome in the same tissue biopsies. However, extracting information from such immense quantities of data is limited by difficulties in recognizing and evaluating the relevant patterns of apparent gene expression in the context of the existing knowledge of phenotypes by histopathology. Using a quantitative approach derived from a knowledge base of pathology findings, we present a novel methodology used to process genome-wide transcription and MRS data. This methodology was tested to examine metabolite and genome-wide profiles in MRS and RNA in 55 biopsies from human subjects with brain tumors with~ 100% certainty. With the guidance of histopathology and clinical outcome, 15 genes with the assistance of 15 MRS metabolites were able to be distinguished by …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:olpn-zPbct0C",
            "Publisher": "Spandidos Publications"
        },
        {
            "Title": "Deep belief networks for spam filtering",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410396/",
            "Abstract": "This paper proposes a novel approach for spam filtering based on the use of Deep Belief Networks (DBNs). In contrast to conventional feedfoward neural networks having one or two hidden layers, DBNs are feedforward neural networks with many hidden layers. Until recently it was not clear how to initialize the weights of deep neural networks, which resulted in poor solutions with low generalization capabilities. A greedy layer-wise unsupervised algorithm was recently proposed to tackle this problem with successful results. In this work we present a methodology for spam detection based on DBNs and evaluate its performance on three widely used datasets. We also compare our method to Support Vector Machines (SVMs) which is the state-of-the-art method for spam filtering in terms of classification performance. Our experiments indicate that using DBNs to filter spam e-mails is a viable methodology, since they …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-threshold lip contour detection",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8451680/",
            "Abstract": "In this work, we propose a novel, multi-threshold method for lip contour extraction from high-resolution static lip images acquired in an uncontrolled environment and emphasizing on the contour details. The introduced method is a “Divide and conquer” approach. We broke the problem of lip contour extraction into two base sub-problems of locating the upper and lower lip contours using a novel threshold selection algorithm and combining them into the solution for the original lip contour. The method was evaluated on a set of lip images taken from healthy subjects as well as on a set acquired from elder people with degraded lip shapes, and diagnosed with solar cheilosis. Our approach is a low complexity algorithm for robust and accurate lip contour extraction revealing shape details, which might be of value in diverse applied fields such as automated lip biometric and monitoring patients with affected lip contour.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:yFnVuubrUp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The UU-test for statistical modeling of unimodal data",
            "Publication year": 2022,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320321004520",
            "Abstract": "Deciding on the unimodality of a dataset is an important problem in data analysis and statistical modeling. It allows to obtain knowledge about the structure of the dataset, i.e. whether data points have been generated by a probability distribution with a single or more than one peaks. Such knowledge is very useful for several data analysis problems, such as for deciding on the number of clusters and determining unimodal projections. We propose a technique called UU-test (Unimodal Uniform test) to decide on the unimodality of a one-dimensional dataset. The method operates on the empirical cumulative density function (ecdf) of the dataset. It attempts to build a piecewise linear approximation of the ecdf that is unimodal and models the data sufficiently in the sense that the data corresponding to each linear segment follows the uniform distribution. A unique feature of this approach is that in the case of unimodality, it …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:nZcligLrVowC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Large scale multikernel RVM for object detection",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_39",
            "Abstract": "The Relevance Vector Machine(RVM) is a widely accepted Bayesian model commonly used for regression and classification tasks. In this paper we propose a multikernel version of the RVM and present an alternative inference algorithm based on Fourier domain computation to solve this model for large scale problems, e.g. images. We then apply the proposed method to the object detection problem with promising results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Image segmentation with a class-adaptive spatially constrained mixture model",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071125/",
            "Abstract": "We propose a hierarchical and spatially variant mixture model for image segmentation where the pixel labels are random variables. Distinct smoothness priors are imposed on the label probabilities and the model parameters are computed in closed form through maximum a posteriori (MAP) estimation. More specifically, we propose a new prior for the label probabilities that enforces spatial smoothness of different degree for each cluster. By taking into account spatial information, adjacent pixels are more probable to belong to the same cluster (which is intuitively desirable). Also, all of the model parameters are estimated in closed form from the data. The proposed conducted experiments indicate that our approach compares favorably to both standard and previous spatially constrained mixture model-based segmentation techniques.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:2KloaMYe4IUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AN AUTOMATED METHOD FOR THE MONITORING AND EVALUATION OF LONG BONES FRACTURE HEALING",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812777140_0034",
            "Abstract": "An automated diagnosis method is proposed for the monitoring of the fracture healing of long bones. The method consists of an ultrasound sensing module and an intelligent module. The sensing system is based on a semi-invasive application of ultrasound. Two ultrasound transducers are mounted onto the bone surface, on opposite sides of the fracture site, one acting as transmitter and the other as receiver (through-transmission mode). The transmitter sends out a short pulse (of 500KHz central frequency), which propagates along the long axis of the bone, crosses the fracture site and is then captured by the receiver. In this paper, in vitro fracture models have been studied, using dead lamb tibiae. Osteotomy is carried out to the tibiae and the bony fragments are then held together by an external fixator. The healing process has been simulated by various biological materials, which fill the fracture gap and mimic …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PLACEBO: a computational platform for health professionals and bioengineers",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1279541/",
            "Abstract": "In this article, we present PLACEBO, an innovative software and hardware platform, which intends to solve biomedical problems formulated in terms of partial differential equations. It can be networked with various imaging devices, such as MRI and CT and can be used for pre-operative surgical planning. It employs an effective computational environment for solving partial differential equations, which is based on neural networks. This approach, in order to exploit the parallel character of the neural networks, is implemented partly in specialized hardware hosted on a commercial PC. There are two operation levels. A user-level, targeting health professionals that need to solve a set of predefined biomedical problems, and a bioengineering level, which allows the construction of problem sets. Since ease of use is of paramount importance for these kind of platforms, a friendly graphical user-interface is being developed.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Wearable Ultrasound Device for the Monitoring and Acceleration of Bone Fracture Healing",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=1327124584606903180&hl=en&oi=scholarr",
            "Abstract": "Several methods for the acceleration of the healing process have been used, including electrical stimulation. Electromagnetic fields (EMFs) have direct biological effects on endochondrial cells and enhance the formation of callus (Gupta et al., 1991). Ultrasound is currently used for the diagnosis of osteoporosis (R. Strelitzki et. al., 1996). In this case, two ultrasound transducers are placed on the skin, on opposite sites of the bone sample and the transition time of ultrasound waves is measured. In a recent study (C. Malizos et. Al., 1999) the use of ultrasound waves was proposed to enhance callus formation. In this work, the architectural design of a personalized wearable device for the monitoring and acceleration of bone fracture healing using ultrasound signals is presented. The proposed wearable device is plugged onto an external fixator and the traducers are placed directly on the surface of the bone. The proposed system can be used for the acceleration, as well as the monitoring of the healing progress. In comparison with currently used techniques, such as X-rays and manual sensing, the proposed device provides accurate information on the progress of healing and can recognize possible problems or non-union quite early in the process. In addition, it provides with several support services, such as communication of information to the doctor, intelligent data processing and generation of alerts when it is needed.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:PVjk1bu6vJQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian feature and model selection for Gaussian mixture models",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1624365/",
            "Abstract": "We present a Bayesian method for mixture model training that simultaneously treats the feature selection and the model selection problem. The method is based on the integration of a mixture model formulation that takes into account the saliency of the features and a Bayesian approach to mixture learning that can be used to estimate the number of mixture components. The proposed learning algorithm follows the variational framework and can simultaneously optimize over the number of components, the saliency of the features, and the parameters of the mixture model. Experimental results using high-dimensional artificial and real data illustrate the effectiveness of the method.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Registering sets of points using Bayesian regression",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231212001634",
            "Abstract": "This work addresses the problem of non-rigid registration between two 2D or 3D points sets as a novel application of Relevance Vector Machines (RVM). An iterative framework is proposed which consists of two steps: at first, correspondences between distinct points are estimated by the Hungarian algorithm and then a regression procedure based on a Bayesian linear model (RVM) maps the two sets of points. By these means, a large variety of transformation is captured without imposing any prior knowledge on the form of the point sets. The proposed algorithm provides a smooth transformation even if the correspondence between the points in the two sets contains erroneous matches. The algorithm was successfully evaluated on sets of points with varying difficulty and favorably compared with state-of-the-art methods in cases of noise.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:yB1At4FlUx8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Transactions/Journals Department",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7086407/",
            "Abstract": "IEEE Transactions on Neural Networks and Learning Systems publication information Page \n1 IEEE TRANSACTIONS ON NEURAL NETWORKS AND LEARNING SYSTEMS IEEE \nTRANSACTIONS ON NEURAL NETWORKS AND LEARNING SYSTEMS is published by \nthe IEEE Computational Intelligence Society. Members may subscribe to this \nTRANSACTIONS for $29.00 per year. IEEE student members may subscribe for $15.00 per \nyear. Nonmembers may subscribe for $2,990.00. For information on receiving this \nTRANSACTIONS, write to the IEEE Service Center at the address below. Member copies of \nTransactions/Journals are for personal use only. For more information about this \nTRANSACTIONS see http://www.ieee-cis/ org/pubs/tnnls. Editor-in-Chief DERONG LIU \nInstitute of Automation Dept. of Electrical and Computer Engineering Chinese Academy of \nSciences University of Illinois Beijing 100190, China , IL .…",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:5ugPr518TE4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient training algorithms for the probabilistic RBF network",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_20",
            "Abstract": "The Probabilistic RBF (PRBF) network constitutes an adaptation of the RBF network for classification. Moreover it extends the typical mixture model by allowing the sharing of mixture components among all classes, in contrast to the conventional approach that suggests mixture components describing only one class. The typical learning method of PRBF for a classification task employs the Expectation – Maximization (EM) algorithm. This widely used method depends strongly on the initial parameter values. The Greedy EM algorithm is a recently proposed method that tries to overcome this drawback, in the case of the density estimation problem using mixture models. In this work we propose a similar approach for incremental training of the PRBF network for classification. The proposed algorithm starts with a single component and incrementally adds more components. After convergence the algorithm splits …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:SP6oXDckpogC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Solving differential equations with neural networks: implementation on a DSP platform",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1028323/",
            "Abstract": "Artificial neural networks have been successfully employed for the solution of ordinary and partial differential equations. According to this methodology, the solution to a differential equation is written as a sum of two parts. The first part satisfies the initial/boundary conditions and contains no adjustable parameters. The second part involves a feedforward neural network (MLP) whose weights must be adjusted in order to solve the equation. A significant advantage of the above methodology is the ability of of direct hardware implementation of both the solution and the training procedure. In this work we describe the implementation of the method on a hardware platform with two digital signal processors. We address several implementation and performance issues and provide comparative results against a PC-based implementation of the method.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of relevance feedback in content based image retrieval using gaussian mixture models",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4669682/",
            "Abstract": "In this paper a relevance feedback (RF) approach for content based image retrieval (CBIR) is described and evaluated. The approach uses Gaussian mixture (GM) models of the image features and a query that is updated in a probabilistic manner. This update reflects the preferences of the user and is based on the models of both positive and negative feedback images. Retrieval is based on a recently proposed distance measure between probability density functions (pdfs), which can be computed in closed form for GM models. The proposed approach takes advantage of the form of this distance measure and updates it very efficiently based on the models of the user specified relevant and irrelevant images. For evaluation purposes, comparative experimental results are presented that demonstrate the merits of the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying touching and overlapping chromosomes using the watershed transform and gradient paths",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865510002606",
            "Abstract": "Automation of chromosome analysis has long been considered as a difficult task. However the advent of Multiplex Fluorescence In Situ Hybridization (M-FISH) made the analysis of chromosomes much easier. Nevertheless, the chromosomes in an M-FISH image do very often partially occlude each other; hence, their segmentation is not trivial and requires the application of a dedicated procedure. In this paper a method is presented for the segmentation of touching and overlapping groups of chromosomes in M-FISH images. Initially, the watershed transform is applied and the image is decomposed into watershed regions. Next, gradient paths starting from points of high concavity are computed for each produced region. Finally, adjacent regions are merged producing the final chromosome areas. To validate our method a benchmark database of 183 M-FISH images has been used. The proposed algorithm resulted …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:P5F9QuxV20EC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A clustering method based on boosting",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016786550300285X",
            "Abstract": "It is widely recognized that the boosting methodology provides superior results for classification problems. In this paper, we propose the boost-clustering algorithm which constitutes a novel clustering methodology that exploits the general principles of boosting in order to provide a consistent partitioning of a dataset. The boost-clustering algorithm is a multi-clustering method. At each boosting iteration, a new training set is created using weighted random sampling from the original dataset and a simple clustering algorithm (e.g. k-means) is applied to provide a new data partitioning. The final clustering solution is produced by aggregating the multiple clustering results through weighted voting. Experiments on both artificial and real-world data sets indicate that boost-clustering provides solutions of improved quality.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:J-pR_7NvFogC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Combining Gaussian Mixture Models and Support Vector Machines for Relevance Feedback in Content Based Image Retrieval",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_30",
            "Abstract": "A relevance feedback (RF) approach for content based image retrieval (CBIR) is proposed, which combines Support Vector Machines (SVMs) with Gaussian Mixture (GM) models. Specifically, it constructs GM models of the image features distribution to describe the image content and trains an SVM classifier to distinguish between the relevant and irrelevant images according to the preferences of the user. The method is based on distance measures between probability density functions (pdfs), which can be computed in closed form for GM models. In particular, these distance measures are used to define a new SVM kernel function expressing the similarity between the corresponding images modeled as GMs. Using this kernel function and the user provided feedback examples, an SVM classifier is trained in each RF round, resulting in an updated ranking of the database images. Numerical experiments are …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "Weighted multi-view key-frame extraction",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865516000398",
            "Abstract": "The extraction of representative key-frames from video shots is very important in video processing and analysis, since it constitutes the basis for several important tasks such as video shot summarization, browsing and retrieval as well as high-level video segmentation. The extracted key-frames should capture a great percentage of the information of a shot content, while at the same time they should not present similar visual information. Clustering or segmentation methods are usually employed to extract key-frames. A major difficulty is caused by the large variety in the visual content of videos. Thus, using a single image descriptor (color, texture etc) to extract key-frames is not always effective, since there is no single descriptor surpassing the others in all video cases. To tackle this problem, we propose an approach for the weighted fusion of several descriptors that automatically estimates the weight of each …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:8d8msizDQcsC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A variational method for bayesian blind image deconvolution",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1246846/",
            "Abstract": "In this paper the blind image deconvolution (BID) problem is solved using the Bayesian framework. In order to find the parameters of the proposed Bayesian model we present a new generalization of the expectation maximization (EM) algorithm based on the variational approximation methodology. The proposed variational-based algorithm for BID can be derived in closed form and can be implemented in the discrete Fourier domain. Thus, it is very efficient even for very large images. We demonstrate with numerical experiments that the algorithm which was derived by the variational methodology yields promising improvements as compared to previous Bayesian algorithms for BID. Furthermore, the methodology presented here is very general with potential applications to other Bayesian models for this and other imaging problems.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Global sampling of image edges",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7025955/",
            "Abstract": "An algorithm for sampling image edge points is presented. At first, the image edges are summarized by line segments, which represent the long axis of highly eccentric ellipses. Then, each line segment is partitioned into a number of bins and the point which is closer to the center of the bin is selected. Experiments on widely used databases demonstrate that the proposed method is accurate and provides samples that preserve the coherence of the initial information of the edge map, which is of importance in image retrieval applications.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variational Bayesian sparse kernel-based blind image deconvolution with student's-t priors",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4799377/",
            "Abstract": "In this paper, we present a new Bayesian model for the blind image deconvolution (BID) problem. The main novelty of this model is the use of a sparse kernel-based model for the point spread function (PSF) that allows estimation of both PSF shape and support. In the herein proposed approach, a robust model of the BID errors and an image prior that preserves edges of the reconstructed image are also used. Sparseness, robustness, and preservation of edges are achieved by using priors that are based on the Student's-t probability density function (PDF). This pdf, in addition to having heavy tails, is closely related to the Gaussian and, thus, yields tractable inference algorithms. The approximate variational inference methodology is used to solve the corresponding Bayesian model. Numerical experiments are presented that compare this BID methodology to previous ones using both simulated and real data.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated methods for ischemia detection in long-duration ECGs",
            "Publication year": 2003,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=14856634",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Motif-based protein sequence classification using neural networks",
            "Publication year": 2005,
            "Publication url": "https://www.liebertpub.com/doi/abs/10.1089/cmb.2005.12.64",
            "Abstract": "      We present a system for multi-class protein classification based on neural networks. The basic issue concerning the construction of neural network systems for protein classification is the sequence encoding scheme that must be used in order to feed the neural network. To deal with this problem we propose a method that maps a protein sequence into a numerical feature space using the matching scores of the sequence to groups of conserved patterns (called motifs) into protein families. We consider two alternative ways for identifying the motifs to be used for feature generation and provide a comparative evaluation of the two schemes. We also evaluate the impact of the incorporation of background features (2-grams) on the performance of the neural system. Experimental results on real datasets indicate that the proposed method is highly efficient and is superior to other well-known methods for protein …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:MXK_kJrjxJIC",
            "Publisher": "Mary Ann Liebert, Inc."
        },
        {
            "Title": "Efficiently explaining decisions of probabilistic RBF classification networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20282-7_18",
            "Abstract": "For many important practical applications model transparency is an important requirement. A probabilistic radial basis function (PRBF) network is an effective non-linear classifier, but similarly to most other neural network models it is not straightforward to obtain explanations for its decisions. Recently two general methods for explaining of a model’s decisions for individual instances have been introduced which are based on the decomposition of a model’s prediction into contributions of each attribute. By exploiting the marginalization property of the Gaussian distribution, we show that PRBF is especially suitable for these explanation techniques. By explaining the PRBF’s decisions for new unlabeled cases we demonstrate resulting methods and accompany presentation with visualization technique that works both for single instances as well as for the attributes and their values, thus providing a valuable tool …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bayesian image restoration based on variatonal inference and a product of student-t priors",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4414288/",
            "Abstract": "Image priors based on products have been recognized to offer many advantages since they provide the ability to enforce simultaneously multiple constraints. However, they are inconvenient for Bayesian inference since their normalization constant cannot be found in closed form. In this paper a new Bayesian framework is proposed for the image restoration problem, where the observed image is degraded by a convolutional operator, which bypasses this difficulty. An image prior is defined by imposing Student-t densities on the outputs of local convolutional filters, which are termed \"experts\". Thus, this prior can simultaneously smooth flat areas of the image and preserve edges in different directions. The variational methodology is used to fuse the information from all experts and the data in order to infer the restored image. Numerical experiments are shown that demonstrate the advantages of this methodology.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Incremental relevance vector machine with kernel learning",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_27",
            "Abstract": "Recently, sparse kernel methods such as the Relevance Vector Machine (RVM) have become very popular for solving regression problems. The sparsity and performance of these methods depend on selecting an appropriate kernel function, which is typically achieved using a cross-validation procedure. In this paper we propose a modification to the incremental RVM learning method, that also learns the location and scale parameters of Gaussian kernels during model training. More specifically, in order to effectively model signals with different characteristics at various locations, we learn different parameter values for each kernel, resulting in a very flexible model. In order to avoid overfitting we use a sparsity enforcing prior that controls the effective number of parameters of the model. Finally, we apply the proposed method to one-dimensional and two-dimensional artificial signals, and evaluate its …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Neural crack identification",
            "Publication year": 2002,
            "Publication url": "https://www.osti.gov/etdeweb/biblio/20383554",
            "Abstract": "The inverse, crack identification problem in elasticity can be formulated as an output error minimization problem which, nevertheless, can not be solved without difficulties by classical numerical optimization. A review of all these previous results, where we used neural networks, filter-driven optimization and genetic algorithms is presented and in a companion lecture during this conference. The use of neural networks for the solution of the inverse problem makes possible the on-line solution of the problem. In fact, one usually approximates the inverse mapping (measurements versus crack quantities). Most of the effort is spent for the learning of this relation, while a sufficiently trained neural network provides predictions with, practically, zero computational cost. Potential applications include on-line, in-flight health monitoring systems with applications in civil and mechanical engineering and production control. In this paper we present new developments in the design of specialized neural networks for the solution of the crack identification problem. Emphasis is posed on the effective use of the learning data, which are produced by the boundary element method. Several technical data will be discussed. They include thoughts about the effective choice of the neural network architecture, the number of training examples and of the learning algorithms will be provided, together with the results of our recent numerical investigation. A detailed application for one or more elliptical cracks using static analysis results with the use of back-propagation trained neural networks will be provided. The general methodology follows our previously published results. By …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:S16KYo8Pm5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian kernel methods for analysis of functional neuroimages",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4383556/",
            "Abstract": "We propose an approach to analyzing functional neuroimages in which (1) regions of neuronal activation are described by a superposition of spatial kernel functions, the parameters of which are estimated from the data and (2) the presence of activation is detected by means of a generalized likelihood ratio test (GLRT). Kernel methods have become a staple of modern machine learning. Herein, we show that these techniques show promise for neuroimage analysis. In an on-off design, we model the spatial activation pattern as a sum of an unknown number of kernel functions of unknown location, amplitude, and/or size. We employ two Bayesian methods of estimating the kernel functions. The first is a maximum a posteriori (MAP) estimation method based on a reversible-jump Markov-chain Monte-Carlo (RJMCMC) algorithm that searches for both the appropriate model complexity and parameter values. The second …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bayesian restoration using a new nonstationary edge-preserving image prior",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1703588/",
            "Abstract": "In this paper, we propose a class of image restoration algorithms based on the Bayesian approach and a new hierarchical spatially adaptive image prior. The proposed prior has the following two desirable features. First, it models the local image discontinuities in different directions with a model which is continuous valued. Thus, it preserves edges and generalizes the on/off (binary) line process idea used in previous image priors within the context of Markov random fields (MRFs). Second, it is Gaussian in nature and provides estimates that are easy to compute. Using this new hierarchical prior, two restoration algorithms are derived. The first is based on the maximum a posteriori principle and the second on the Bayesian methodology. Numerical experiments are presented that compare the proposed algorithms among themselves and with previous stationary and non stationary MRF-based with line process …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Large Scale Multikernel RVM for Object",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13049170860247000858&hl=en&oi=scholarr",
            "Abstract": "The Relevance Vector Machine (RVM) is a widely accepted Bayesian model commonly used for regression and classification tasks. In this paper we propose a multikernel version of the RVM and present an alternative inference algorithm based on Fourier domain computation to solve this model for large scale problems, eg images. We then apply the proposed method to the object detection problem with promising results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:lvd772isFD0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Cluster-based Replication: A forwarding strategy for mobile opportunistic networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8449818/",
            "Abstract": "Mutli-copy routing is an efficient and wide-spread approach for coping with the intermittent connectivity of mobile opportunistic networks. One popular multi-copy approach is known as “dynamic” replication; each node creates replicas on a contact basis using a utility that determines a node's fitness for delivering a message to its destination. This scheme is highly flexible, configurable with different utility functions and able to operate efficiently in networks with diverse characteristics. Nonetheless, its drawback is the tendency to produce a high number of replicas that consume limited resources such as energy and storage. Our approach to tackle this problem relies on the observation that, based on their utility values, the network nodes can be grouped into clusters that portray different delivery capabilities. Then, to avoid unnecessary replication, we exploit this finding to replicate a packet to nodes that belong to …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:HtS1dXgVpQUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Activity Recognition for Traditional Dances Using Dimensionality Reduction",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_10",
            "Abstract": "Activity recognition is a complex problem mainly because of the nature of the data. Data usually are high dimensional, so applying a classifier directly to the data is not always a good practice. A common method is to find a meaningful representation of complex data through dimensionality reduction. In this paper we propose novel kernel matrices based on graph theory to be used for dimensionality reduction. The proposed kernel can be embedded in a general dimensionality reduction framework. Experiments on a traditional dance recognition dataset are conducted and the advantage of using dimensionality reduction before classification is highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:e_rmSamDkqQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A real-time monitoring platform for assessing rehabilitation of the lower extremities in athletes",
            "Publication year": 2003,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/28015",
            "Abstract": "The first prototype of a real-time monitoring platform for assessing rehabilitation of injuries in the lower extremities in athletes is presented. The system provides patients, their doctors and trainers with real-time monitoring, alerting and medical decision support feedback during exercise. It aims to help optimize treatment and training procedures during rehabilitation, to reduce the instances of injury relapse and to enable a prompt return to peak athletic condition. This first prototype is a hybrid portable/wearable version, the final aim being to make it completely wearable. The platform is composed of a sensing unit, a wearable processing unit and a remote monitoring unit. The sensing unit includes six goniometers for monitoring motion parameters, two temperature thermistors for assessing the condition of the injury, and an event \"pain\" marker button for monitoring pain. The wearable processing unit performs preliminary processing of the received signals, generates alerts and provides feedback and wireless data transfer to the rehabilitation unit. The rehabilitation unit is the main control, access and communication point of the system carrying out most of the data processing. The measurements are fed into an intelligent module, providing monitoring, alerting and decision support feedback to the athletes, trainers and doctors through a virtual reality interface and instant display of the monitored parameters.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:q3CdL3IzO_QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian restoration using a new hierarchical directional continuous edge image prior",
            "Publication year": 2006,
            "Publication url": "http://www.ssp.ece.upatras.gr/galatsanos/PAPERS/IPL_papers/TIP_01803-20051.pdf",
            "Abstract": "In this paper we propose a class of image restoration algorithms based on the Bayesian approach and a new hierarchical spatially adaptive image prior. The proposed prior has two desirable features. First, it models the image discontinuities in different directions with a continuous value model. Thus, it generalizes the on/off (binary) line process idea used in previous image priors within the context of Markov Random Fields (MRF). Second, it is based on an acyclic graphical model, unlike MRFs, which greatly facilitates learning and inference. Using this new hierarchical prior two restoration algorithms are derived. The first is based on the maximum a posteriori (MAP) principle, and the second on the Bayesian methodology. Numerical experiments are presented that compare the proposed algorithms among themselves and with previous stationary and non stationary MRF based with line process algorithms. These experiments demonstrate the advantages of the proposed prior.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The\" Citation\" Platform: Semantics-Based Modeling & Retrieval of Administrative Information.",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=532317524920315073&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ESTIMATION OF THE CONCRETE CHARACTERISTICS USING PATTERN RECOGNITION METHODS",
            "Publication year": 2001,
            "Publication url": "https://apps.dtic.mil/sti/pdfs/ADA398649.pdf#page=346",
            "Abstract": "We address the problem of nondestructive analysis and testing of concrete. The proposed system employs acoustic emission and pattern recognition methods of the corresponding waveforms to identify the water to cement and sand to cement ratios of a given concrete cube. For waveforms obtained experimentally using standard size concrete cubes, we study several classification methods and provide comparative results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An incremental Bayesian approach for training multilayer perceptrons",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15819-3_12",
            "Abstract": "The multilayer perceptron (MLP) is a well established neural network model for supervised learning problems. Furthermore, it is well known that its performance for a given problem depends crucially on appropriately selecting the MLP architecture, which is typically achieved using cross-validation. In this work, we propose an incremental Bayesian methodology to address the important problem of automatic determination of the number of hidden units in MLPs with one hidden layer. The proposed methodology treats the one-hidden layer MLP as a linear model consisting of a weighted combination of basis functions (hidden units). Then an incremental method for sparse Bayesian learning of linear models is employed that effectively adjusts not only the combination weights, but also the parameters of the hidden units. Experimental results for several well-known classification data sets demonstrate that the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Semantics-based information modeling for the health-care administration sector: The citation platform",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1435421/",
            "Abstract": "An information brokerage environment for effective information structuring, indexing, and retrieval in the health-care administration sector is presented. The system is based on ontology modeling, natural language processing, extensible markup language, semantics analysis, and behavioral description. Semantics-based information acquisition is achieved through the uniform modeling, representation, and handling of domain-specific knowledge, both content-based and procedural. The system has been validated using information located on several repositories in the web and its performance is reported in terms of precision and recall.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mixture model based image segmentation with spatial constraints",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079913/",
            "Abstract": "One of the many successful applications of Gaussian Mixture Models (GMMs) is in image segmentation, where spatially constrained mixture models have been used in conjuction with the Expectation-Maximization (EM) framework. In this paper, we propose a new methodology for the M-step of the EM algorithm that is based on a novel constrained optimization formulation. Numerical experiments using simulated and real images illustrate the superior performance of our methodology in terms of the attained maximum value of the objective function and segmentation accuracy compared to previous implementations of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The mixtures of Student's t-distributions as a robust framework for rigid registration",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885608002473",
            "Abstract": "The problem of registering images or point sets is addressed. At first, a pixel similarity-based algorithm for the rigid registration between single and multimodal images is presented. The images may present dissimilarities due to noise, missing data or outlying measures. The method relies on the partitioning of a reference image by a Student’s t-mixture model (SMM). This partition is then projected onto the image to be registered. The main idea is that a t-component in the reference image corresponds to a t-component in the image to be registered. If the images are correctly registered the distances between the corresponding components is minimized. Moreover, the extension of the method to the registration of point clouds is also proposed. The use of SMM components is justified by the property that they have heavier tails than standard Gaussians, thus providing robustness to outliers. Experimental results indicate …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Relevance vector machine analysis of functional neuroimages",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1398710/",
            "Abstract": "We propose the use of the relevance vector machine (RVM) regression framework for statistical analysis of PET or fMRI data sets in a two state (\"on-off\") activation study. According to this approach the shape of the activations is a superposition of kernel functions, one at each pixel of the image, of unknown amplitude and a hierarchical Bayesian model is employed which imposes a sparse representation. This allows accurate estimation of the activation locations when correlated noise is present even at low signal-to-noise ratios. We tested this method using an artificial phantom derived from a previous neuroimaging study. This proposed approach compared favorably with previous approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PRESS: protein S-sulfenylation server",
            "Publication year": 2016,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/32/17/2710/2450745",
            "Abstract": " Motivation:              Transient S-sulfenylation of cysteine thiols mediated by reactive oxygen species plays a critical role in pathology, physiology and cell signaling. Therefore, discovery of new S-sulfenylated sites in proteins is of great importance towards understanding how protein function is regulated upon redox conditions.            Results:              We developed PRESS (PRotEin S-Sulfenylation) web server, a server which can effectively predict the cysteine thiols of a protein that could undergo S-sulfenylation under redox conditions. We envisage that this server will boost and facilitate the discovery of new and currently unknown functions of proteins triggered upon redox conditions, signal regulation and transduction, thus uncovering the role of S-sulfenylation in human health and disease.            Availability and implementation:              The PRESS web server is freely available at …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:HtEfBTGE9r8C",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "A divide-and-conquer method for multi-net classifiers",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1007/s10044-002-0174-6",
            "Abstract": " Several researchers have shown that substantial improvements can be achieved in difficult pattern recognition problems by combining the outputs of multiple neural networks. In this work, we present and test a pattern classification multi-net system based on both supervised and unsupervised learning. Following the ‘divide-and-conquer’ framework, the input space is partitioned into overlapping subspaces and neural networks are subsequently used to solve the respective classification subtasks. Finally, the outputs of individual classifiers are appropriately combined to obtain the final classification decision. Two clustering methods have been applied for input space partitioning and two schemes have been considered for combining the outputs of the multiple classifiers. Experiments on well-known data sets indicate that the multi-net classification system exhibits promising performance compared with the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer London"
        },
        {
            "Title": "Protein sequence classification using probabilistic motifs and neural networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44989-2_84",
            "Abstract": "The basic issue concerning the construction of neural network systems for protein classification is the sequence encoding scheme that must be used in order to feed the network. To deal with this problem we propose a method that maps a protein sequence into a numerical feature space using the matching local scores of the sequence to groups of conserved patterns (called motifs). We consider two alternative schemes for discovering a group of D motifs within a set of K-class sequences. We also evaluate the impact of the background features (2-grams) to the performance of the neural system. Experimental results on real datasets indicate that the proposed method is superior to other known protein classification approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Fast and efficient vanishing point detection in indoor images",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6460856/",
            "Abstract": "A method for detecting a vanishing point in structured images is presented. The method relies on the detection of line segments from an edge map by representing clusters of edge points by the long axes of highly eccentric ellipses. The extracted lines provide a set of candidate vanishing points computed by their intersections, which are assigned weights proportional to the lengths of the line segments they belong to. Then, a voting scheme is applied through an accumulator array generated by griding the image frame. The votes of each grid cell are weighted by the Π-sigmoid kernel allowing cells to contribute to their neighbors.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ipzZ9siozwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Local Feature Selection for the Relevance Vector Machine Using Adaptive Kernel Learning",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04274-4_6",
            "Abstract": "A Bayesian learning algorithm is presented that is based on a sparse Bayesian linear model (the Relevance Vector Machine (RVM)) and learns the parameters of the kernels during model training. The novel characteristic of the method is that it enables the introduction of parameters called ‘scaling factors’ that measure the significance of each feature. Using the Bayesian framework, a sparsity promoting prior is then imposed on the scaling factors in order to eliminate irrelevant features. Feature selection is local, because different values are estimated for the scaling factors of each kernel, therefore different features are considered significant at different regions of the input space. We present experimental results on artificial data to demonstrate the advantages of the proposed model and then we evaluate our method on several commonly used regression and classification datasets.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A split-and-merge framework for 2D shape summarization",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6046607/",
            "Abstract": "An algorithm for the representation and summarization of a 2D shape is presented. The shape points are modeled by ellipses with very high eccentricity in order to summarize the contour of the shape by the major axes of these elongated ellipses. To this end, at first, a single ellipse is fitted to the shape which is then iteratively split to a large number of highly eccentric ellipses to cover the shape points. Then, a merge process follows in order to combine neighboring ellipses with collinear major axes to reduce the complexity of the model. Experimental results showed that the proposed algorithm provides a shape summary which not only overcomes the representation of a shape by a Gaussian mixture model but also is largely more accurate with respect to the progressive probabilistic Hough transform for shape representation. It must be noted that, for our method, a shape is a unordered set of points describing the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The MinMax k-Means clustering algorithm",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320314000338",
            "Abstract": "Applying k-Means to minimize the sum of the intra-cluster variances is the most popular clustering approach. However, after a bad initialization, poor local optima can be easily obtained. To tackle the initialization problem of k-Means, we propose the MinMax k-Means algorithm, a method that assigns weights to the clusters relative to their variance and optimizes a weighted version of the k-Means objective. Weights are learned together with the cluster assignments, through an iterative procedure. The proposed weighting scheme limits the emergence of large variance clusters and allows high quality solutions to be systematically uncovered, irrespective of the initialization. Experiments verify the effectiveness of our approach and its robustness over bad initializations, as it compares favorably to both k-Means and other methods from the literature that consider the k-Means initialization problem.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:-FonjvnnhkoC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A replication strategy for mobile opportunistic networks based on utility clustering",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570870521002237",
            "Abstract": "Dynamic replication is a wide-spread multi-copy routing approach for efficiently coping with the intermittent connectivity in mobile opportunistic networks. According to it, a node forwards a message replica to an encountered node based on a utility value that captures the latter’s fitness for delivering the message to the destination. The popularity of the approach stems from its flexibility to effectively operate in networks with diverse characteristics without requiring special customization. Nonetheless, its drawback is the tendency to produce a high number of replicas that consume limited resources such as energy and storage. To tackle the problem we make the observation that network nodes can be grouped, based on their utility values, into clusters that portray different delivery capabilities. We exploit this finding to transform the basic forwarding strategy, which is to move a packet using nodes of increasing utility, and …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:r_AWSJRzSzQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Bayesian Methods based on Variational approximation for Blind Image Deconvolution",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:u_35RYKgDlwC",
            "Publisher": "CRC"
        },
        {
            "Title": "Probabilistic Models Based on the Π-Sigmoid Distribution",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-69939-2_4",
            "Abstract": "Mixture models constitute a popular type of probabilistic neural networks which model the density of a dataset using a convex combination of statistical distributions, with the Gaussian distribution being the one most commonly used. In this work we propose a new probability density function, called the Π-sigmoid, from its ability to form the shape of the letter “Π” by appropriately combining two sigmoid functions. We demonstrate its modeling properties and the different shapes that can take for particular values of its parameters. We then present the Π-sigmoid mixture model and propose a maximum likelihood estimation method to estimate the parameters of such a mixture model using the Generalized Expectation Maximization algorithm. We assess the performance of the proposed method using synthetic datasets and also on image segmentation and illustrate its superiority over Gaussian mixture models.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "h-Life: an intelligent personal health assistant",
            "Publication year": 2002,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/146045820200800104",
            "Abstract": "In this paper the architecture and subsystems of the h-Life platform are described. The system is currently under implementation and therefore all system components and modules are described according to their design specifications. h-Life aims at developing a user-friendly, personalized and ubiquitously accessible knowledge-based system that will provide citizens with an intelligent tool for monitoring the state of health and lifestyle. The h-Life system is based on the integration of several components: • a knowledge repository related to health, nutrition, fitness and lifestyle• a user repository where personal health records and user profiles are stored• a plan repository for the storage of medical plans• an intelligent adviser and plan selection mechanism, which provides advice and plans based on the user profile• an alerting and reminding module that issues alerts (to ensure the timely execution of a selected plan …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Neural-network methods for boundary value problems with irregular boundaries",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/870037/",
            "Abstract": "Partial differential equations (PDEs) with boundary conditions (Dirichlet or Neumann) defined on boundaries with simple geometry have been successfully treated using sigmoidal multilayer perceptrons in previous works. The article deals with the case of complex boundary geometry, where the boundary is determined by a number of points that belong to it and are closely located, so as to offer a reasonable representation. Two networks are employed: a multilayer perceptron and a radial basis function network. The later is used to account for the exact satisfaction of the boundary conditions. The method has been successfully tested on two-dimensional and three-dimensional PDEs and has yielded accurate results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A greedy EM algorithm for Gaussian mixture learning",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1013844811137",
            "Abstract": "Learning a Gaussian mixture with a local algorithm like EM can be difficult because (i) the true number of mixing components is usually unknown, (ii) there is no generally accepted method for parameter initialization, and (iii) the algorithm can get trapped in one of the many local maxima of the likelihood function. In this paper we propose a greedy algorithm for learning a Gaussian mixture which tries to overcome these limitations. In particular, starting with a single component and adding components sequentially until a maximum number k, the algorithm is capable of achieving solutions superior to EM with k components in terms of the likelihood of a test set. The algorithm is based on recent theoretical results on incremental mixture density estimation, and uses a combination of global and local search each time a new component is added to the mixture.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Semi unsupervised M-FISH chromosome image classification",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5687672/",
            "Abstract": "M-FISH (Multiplex Fluorescent In Situ Hybridization) is a multichannel chromosome imaging technique that allows the color discrimination of human chromosomes. Although M-FISH facilitates the visual detection of chromosome rearrangements, the success of this technique largely depends on the accuracy of the pixel-by-pixel classification. In this study, we present a semi unsupervised method for M-FISH chromosome image classification. First, we segment the chromosome pixels using an automated thresholding procedure. Five features for each pixel are extracted, describing the intensity of the five channels. These features are then normalized. Second, we employed the K-means algorithm in order to cluster the chromosome pixels into the 24 chromosome classes. We have used the emission information for each chromosome class in order to initialize the cluster centers. Our method has been tested on the ADIR …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active learning with the probabilistic RBF classifier",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11840817_38",
            "Abstract": "In this work we present an active learning methodology for training the probabilistic RBF (PRBF) network. It is a special case of the RBF network, and constitutes a generalization of the Gaussian mixture model. We propose an incremental method for semi-supervised learning based on the Expectation-Maximization (EM) algorithm. Then we present an active learning method that iteratively applies the semi-supervised method for learning the labeled and unlabeled observations concurrently, and then employs a suitable criterion to select an unlabeled observation and query its label. The proposed criterion selects points near the decision boundary, and facilitates the incremental semi-supervised learning that also exploits the decision boundary. The performance of the algorithm in experiments using well-known data sets is promising.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "E-mail:{ccostas, arly}@ cs. uoi. gr",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Z7ZpDQAAQBAJ&oi=fnd&pg=PA244&dq=info:e3c-6GVeOAcJ:scholar.google.com&ots=jCPLwPiWx0&sig=ibZ7SOWlAtppFw0jMBxnvAdVKto",
            "Abstract": "The typical approach of mixture-based learning for classification employs the Expectation–Maximization (EM) algorithm. This widely used method suffers from two important drawbacks, namely it cannot estimate the true number of mixing components, and depends strongly on the initial parameter values. The Greedy EM algorithm is a recently proposed algorithm that tries to overcome these draw-backs for the density estimation task. The direct application of this method for the classification task is obvious, as long as we are interested in typical mixture models. In this work we propose a greedy learning method adapted for a generalized mixture model (called the Probabilistic RBF network) with the particular char-acteristic that it allows the sharing of the mixture components among all classes, in contrast to the convetional model that suggests mixture components describing only one class. The proposed algorithm starts with a single component and adds components sequentially, using a combination of global and local search. The addition of the new component is based on criteria for detecting a region in the data space that is crucial for the classification task. Experimental results using several well-known classification datasets indicate that the greedy method provides solutions of superior classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:9pM33mqn1YgC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "A knowledge-based technique for automated detection of ischaemic episodes in long duration electrocardiograms",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1007/BF02345273",
            "Abstract": "A novel method for the detection of ischaemic episodes in long duration ECGs is proposed. It includes noise handling, feature extraction, rule-based beat classification, sliding window classification and ischaemic episode identification, all integrated in a four-stage procedure. It can be executed in real time and is able to provide explanations for the diagnostic decisions obtained. The method was tested on the ESC ST-T database and high scores were obtained for both sensitivity and positive predictive accuracy (93.8% and 78.5% respectively using aggregate gross statistics, and 90.7% and 80.7% using aggregate average statistics).",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Sparse Bayesian modeling with adaptive kernel learning",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4908953/",
            "Abstract": "Sparse kernel methods are very efficient in solving regression and classification problems. The sparsity and performance of these methods depend on selecting an appropriate kernel function, which is typically achieved using a cross-validation procedure. In this paper, we propose an incremental method for supervised learning, which is similar to the relevance vector machine (RVM) but also learns the parameters of the kernels during model training. Specifically, we learn different parameter values for each kernel, resulting in a very flexible model. In order to avoid overfitting, we use a sparsity enforcing prior that controls the effective number of parameters of the model. We present experimental results on artificial data to demonstrate the advantages of the proposed method and we provide a comparison with the typical RVM on several commonly used regression and classification data sets.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel method for automated EMG decomposition and MUAP classification",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0933365705001065",
            "Abstract": "This paper proposes a novel method for the extraction and classification of individual motor unit action potentials (MUAPs) from intramuscular electromyographic signals.The proposed method automatically detects the number of template MUAP clusters and classifies them into normal, neuropathic or myopathic. It consists of three steps: (i) preprocessing of electromyogram (EMG) recordings, (ii) MUAP detection and clustering and (iii) MUAP classification.The approach has been validated using a dataset of EMG recordings and an annotated collection of MUAPs. The correct identification rate for MUAP clustering is 93, 95 and 92% for normal, myopathic and neuropathic, respectively. Ninety-one percent of the superimposed MUAPs were correctly identified. The obtained accuracy for MUAP classification is about 86%.The proposed method, apart from efficient EMG …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:1yQoGdGgb4wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Scene detection in videos using shot clustering and symbolic sequence segmentation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4412849/",
            "Abstract": "Video indexing requires the efficient segmentation of the video into scenes. In the method we propose, the video is first segmented into shots and key-frames are extracted using the global k-means clustering algorithm that represent each shot. Then an improved spectral clustering method is applied to cluster the shots into groups based on visual similarity and a label is assigned to each shot according to the group that it belongs to. Next, a method for segmenting the sequence of shot labels is applied, providing the final scene segmentation result. Numerical experiments indicate that the method we propose correctly detects most of the scene boundaries while preserving a good trade off between recall and precision.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The inclusion measure for community evaluation and detection in unweighted networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8508688/",
            "Abstract": "One of the most interesting problems in network analysis is community detection, i.e. the partitioning of nodes into communities, with many edges connecting nodes of the same community and comparatively few edges connecting nodes of different communities. We introduce a new quality measure to evaluate a partitioning of an undirected and unweighted graph into communities that is called inclusion. This quality measure evaluates how well each node is included in its community by considering both its existent and its non-existent edges. We have implemented a strategy that maximizes the inclusion criterion by moving each time a single node to another community. We also considered inclusion as a criterion for evaluating partitions provided by spectral clustering. In our experimental study, the inclusion criterion is compared to the widely used modularity criterion providing improved community detection results …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:bKqednn6t2AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Greedy unsupervised multiple kernel learning",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30448-4_10",
            "Abstract": "Multiple kernel learning (MKL) has emerged as a powerful tool for considering multiple kernels when the appropriate representation of the data is unknown. Some of these kernels may be complementary, while others irrelevant to the learning task. In this work we present an MKL method for clustering. The intra-cluster variance objective is extended by learning a linear combination of kernels, together with the cluster labels, through an iterative procedure. Closed-form updates for the combination weights are derived, that greatly simplify the optimization. Moreover, to allow for robust kernel mixtures, a parameter that regulates the sparsity of the weights is incorporated into our framework. Experiments conducted on a collection of images reveal the effectiveness of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:uc_IGeMz5qoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bridging the Semantic Gap in Multimedia Machine Learning Approaches (Special Session)-A Relevance Feedback Approach for Content Based Image Retrieval Using Gaussian Mixture Models",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=5399846722755681253&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:a0OBvERweLwC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Fully unsupervised m-FISH chromosome image characterization",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6507547/",
            "Abstract": "Chromosome analysis is an important and difficult task for clinical diagnosis and biological research. A color imaging technique, multiplex fluorescent in situ hybridization (M-FISH), has been developed to ease the analysis of the process. Using an M-FISH technique each chromosome class (1,2,...,22,X,Y) is stained with a unique color. However, significant variations between images are observed due to a number of factors such as uneven hybridization and spectral overlap among channels. These types of variations influence the pixel classification accuracy of image classification methods which are supervised and require a set of annotated images for training. In this paper, we present a fully unsupervised M-FISH chromosome image classification methodology. Our main contributions are 1) the assumption that the intensity of a chromosome pixel is sampled from multiple Gaussian components [Gaussian mixture …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:gsN89kCJA0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Maximum a posteriori image restoration based on a new directional continuous edge image prior",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1529907/",
            "Abstract": "In this paper we propose a new hierarchical non stationary image prior for image restoration. This prior captures the directional edges using a continuous model and regularizes accordingly the restored images. In addition, the corresponding generative graphical model does not contain cycles, thus learning this model is easy and fast. Based on this prior image model, a maximum a posteriori (MAP) estimation algorithm is derived. Numerical experiments are provided that demonstrate the advantages of the proposed non stationary model as compared with algorithms that use stationary models.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Bayesian framework for image segmentation with spatially varying mixtures",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5445031/",
            "Abstract": "A new Bayesian model is proposed for image segmentation based upon Gaussian mixture models (GMM) with spatial smoothness constraints. This model exploits the Dirichlet compound multinomial (DCM) probability density to model the mixing proportions (i.e., the probabilities of class labels) and a Gauss-Markov random field (MRF) on the Dirichlet parameters to impose smoothness. The main advantages of this model are two. First, it explicitly models the mixing proportions as probability vectors and simultaneously imposes spatial smoothness. Second, it results in closed form parameter updates using a maximum  a posteriori  (MAP) expectation-maximization (EM) algorithm. Previous efforts on this problem used models that did not model the mixing proportions explicitly as probability vectors or could not be solved exactly requiring either time consuming Markov Chain Monte Carlo (MCMC) or inexact variational …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improving text stream clustering using term burstiness and co-burstiness",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2903220.2903229",
            "Abstract": "In text streams, documents appear over time and their times-tamps can be used to improve typical approaches for text representation and clustering. A way to exploit temporal information is through the detection of bursty terms in such streams, ie terms that appear in many documents during short time period. Research efforts so far have shown that utilizing the burst information in the text representation can improve the performance of text clustering algorithms. However, most attempts take into account the bursty terms individually, without investigating the relation between them. In this work, we take advantage of the fact that most of the important documents of a topic are published during the period in which the'main'topic terms are bursty. Therefore, we focus on both term burstiness and co-burstiness by determining groups of terms that are simultaneously bursty at a time period and also co-occurring in the same …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Neural network assisted crack and flaw identification in transient dynamics",
            "Publication year": 2004,
            "Publication url": "http://yadda.icm.edu.pl/baztech/element/bwmeta1.element.baztech-article-BWM2-0023-0043",
            "Abstract": "EN Crack and flaw identification problems in two-dimensional elastomechanics are numerically studied in this paper. The mechanical modelling is based on boundary element techiques, with special care of hypersingular issues for the cracks. The possibility of partially or totally closed cracks (unilateral contact effects) is taken into account by linear complementarity techniques. Backpropagation neural networks are used for the solution of the inverse problems. For dynamical problems, a suitable preprocessing of the input data enhances the effectiveness of the procedure. For the two-dimensional examples presented here, the proposed method has similar performance for classical crack and flaw identification problems. The identification of unilateral cracks is a considerably more difficult task, which nevertheless, can also be solved by the same method, provided that a suitable dynamical test loading is applied.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:hFOr9nPyWt4C",
            "Publisher": "POLISH SOCIETY OF THEORETICAL & APPLIED MECHANICS"
        },
        {
            "Title": "HySMID: an ischemia diagnosis system using genetic algorithms and multicriteria decision analysis",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1291161/",
            "Abstract": "Multicriteria decision analysis is employed in a four-stage (preprocessing, beat classification, window characterization and episode definition) ischemia diagnosis system, named HySMID. Beat classification is realized using a multicriteria approach where each beat is compared to already classified category prototypes and the similarity is computed in a fuzzy way. The comparison is based upon five criteria that include ST segment changes, T wave alterations and patient's age. The difficulty in applying these criteria is the determination of the required parameter values (thresholds and weights). To overcome it, a genetic algorithm is used, which after proper training, automatically calculates the optimum values of the above parameters. HySMID was validated using the European Society of Cardiology ST-T database and performed better than previously reported methods.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust variational Bayesian kernel based blind image deconvolution",
            "Publication year": 2007,
            "Publication url": "http://www.cs.uoi.gr/~arly/full/conferences/C44.pdf",
            "Abstract": "In this paper we present a new Bayesian model for the blind image deconvolution (BID) problem. The main novelties of this model are two. First, a sparse kernel based representation of the point spread function (PSF) that allows for the first time estimation of both PSF shape and support. Second, a non Gaussian heavy tail prior for the model noise to make it robust to large errors encountered in BID when little prior knowledge is available about both image and PSF. Sparseness and robustness are achieved by introducing Student-t priors both for the PSF and the noise. A Variational methodology is proposed to solve this Bayesian model. Numerical experiments are presented both with real and simulated data that demonstrate the advantages of this model as compared to previous Gaussian based ones.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A wearable intelligent system for monitoring health condition and rehabilitation of running athletes",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222531/",
            "Abstract": "A wearable intelligent platform for the monitoring of the health condition and rehabilitation of athletes is presented. The system provides doctors and trainers with real-time monitoring, alerting and medical decision support. It aims to help them optimize treatment and training procedures during rehabilitation, to prevent injury relapses and to ensure a prompt return to peak athletic condition. The system's design requirements are laid out along with its functional description. It is composed of three main subsystems: the athlete subsystem, the rehabilitation station and the portal. The athlete subsystem includes all the monitoring sensors worn by the athlete during training, along with a signal collector and a processing-transceiver unit for preliminary evaluation and for exchanging information with the rehabilitation station. The rehabilitation station is the main control, access and communication point of the system carrying …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The variational approximation for Bayesian inference",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4644060/",
            "Abstract": "The influence of this Thomas Bayes' work was immense. It was from here that \"Bayesian\" ideas first spread through the mathematical world, as Bayes's own article was ignored until 1780 and played no important role in scientific debate until the 20th century. It was also this article of Laplace's that introduced the mathematical techniques for the asymptotic analysis of posterior distributions that are still employed today. And it was here that the earliest example of optimum estimation can be found, the derivation and characterization of an estimator that minimized a particular measure of posterior expected loss. After more than two centuries, we mathematicians, statisticians cannot only recognize our roots in this masterpiece of our science, we can still learn from it.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Face clustering using a weighted combination of deep representations",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-021-06581-8",
            "Abstract": "Clustering of face images is a well-known clustering problem with several applications as for example the automated face tagging in photo albums. The performance of face clustering algorithms largely depends on the face representations that are used. Therefore, the exploitation of the internal face representation (embedding) obtained by feeding the face image to a deep face network has led to increased clustering performance. In this work, we perform face clustering by combining multiple representations of each image obtained from several deep face networks. The multiple deep representations are not exploited in a straightforward manner (simple vector concatenation). Instead a weight is assigned to each representation to reflect its importance on the clustering result and a weighted clustering algorithm is employed to automatically adjust the weights and, consequently, the contribution of each …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:F1b5ZUV5XREC",
            "Publisher": "Springer London"
        },
        {
            "Title": "CITATION Citizen Information Tool in Smart Administration",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46138-8_50",
            "Abstract": "CITATION is an innovative software platform designed to facilitate access to administrative information sources by providing effective information structure, indexing and retrieval. CITATION improves electronic government services, ensuring that citizens have easy and direct access to essential public data and promoting online interaction between citizens and government. It targets the improvement of administration services offered by governments and therefore the creation of “smart” and flexible government structures that will be able to provide their citizens with precise and personalised information.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A support vector machine approach for video shot detection",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-68127-4_5",
            "Abstract": "The first step towards indexing and content based video retrieval is video shot detection. Existing methodologies for video shot detection are mostly threshold dependent. No prior knowledge about the video content makes such methods sensitive to video content. To ameliorate this shortcoming we propose a learning based methodology using a set of features that are specifically designed to capture the differences among hard cuts, gradual transitions and normal sequences of frames simultaneously. A Support Vector Machine (SVM) classifier is trained both to locate shot boundaries and characterize transition types. Numerical experiments using a variety of videos demonstrate that our method is capable of accurately detecting and discriminating shot transitions in videos with different characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Sparse regression mixture modeling with the multi-kernel relevance vector machine",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-013-0704-0",
            "Abstract": "A regression mixture model is proposed where each mixture component is a multi-kernel version of the Relevance Vector Machine (RVM). This mixture model exploits the enhanced modeling capability of RVMs, due to their embedded sparsity enforcing properties. In order to deal with the selection problem of kernel parameters, a weighted multi-kernel scheme is employed, where the weights are estimated during training. The mixture model is trained using the maximum a posteriori approach, where the Expectation Maximization (EM) algorithm is applied offering closed form update equations for the model parameters. Moreover, an incremental learning methodology is also presented that tackles the parameter initialization problem of the EM algorithm along with a BIC-based model selection methodology to estimate the proper number of mixture components. We provide comparative experimental results …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:LI9QrySNdTsC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Artificial Intelligence: Theories, Models, and Applications: 6th Hellenic Conference on AI, SETN 2010, Athens, Greece, May 4-7, 2010, Proceedings",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "A GREEDY METHOD FOR MIXTURE-BASED",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=GoLSQN2jlFwC&oi=fnd&pg=PA244&dq=info:JOAI5lTAdvQJ:scholar.google.com&ots=CkBnXVkS52&sig=Bq06EQ5s0eRmjmqgD6lTubOJ9Oo",
            "Abstract": "The typical approach of mixture-based learning for classification employs the Expectation-Maximization (EM) algorithm. This widely used method suffers from two important drawbacks, namely it cannot estimate the true number of mixing components, and depends strongly on the initial parameter values. The Greedy EM algorithm is a recently proposed algorithm that tries to overcome these drawbacks for the density estimation task. The direct application of this method for the classification task is obvious, as long as we are interested in typical mixture mod-els. In this work we propose a greedy learning method adapted for a generalized mixture model (called the Probabilistic RBF network) with the particular characteristic that it allows the sharing of the mixture components among all classes, in contrast to the convetional model that suggests mixture components describing only one class. The proposed algorithm starts with a single component and adds components sequentially, using a combination of global and local search. The addition of the new component is based on criteria for detecting a region in the data space that is crucial for the classification task. Experimental results using several well-known classification datasets indicate that the greedy method provides solutions of superior classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:BJbdYPG6LGMC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Simultaneous detection of abrupt cuts and dissolves in videos using support vector machines",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865508002717",
            "Abstract": "Video shot detection is an important contemporary problem since it is the first step towards indexing and content based video retrieval. Traditionally, video shot segmentation approaches rely on thresholding methodologies which are sensitive to the content of the video being processed and do not generalize well the when there is little prior knowledge about the video content. To ameliorate this shortcoming we propose a learning based methodology using a set of features that are specifically designed to capture the differences among hard cuts, gradual transitions and normal sequences of frames at the same time. A support vector machine (SVM) classifier is trained both to locate shot boundaries and characterize transition types. Numerical experiments using a variety of videos demonstrate that our method is capable of accurately discriminating shot transitions in videos with different characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:aqlVkmm33-oC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Training the random neural network using quasi-Newton methods",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221799004828",
            "Abstract": "Training in the random neural network (RNN) is generally specified as the minimization of an appropriate error function with respect to the parameters of the network (weights corresponding to positive and negative connections). We propose here a technique for error minimization that is based on the use of quasi-Newton optimization techniques. Such techniques offer more sophisticated exploitation of the gradient information compared to simple gradient descent methods, but are computationally more expensive and difficult to implement. In this work we specify the necessary details for the application of quasi-Newton methods to the training of the RNN, and provide comparative experimental results from the use of these methods to some well-known test problems, which confirm the superiority of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:KlAtU1dfN6UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "An automatic microcalcification detection system based on a hybrid neural network classifier",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0933365702000131",
            "Abstract": "A hybrid intelligent system is presented for the identification of microcalcification clusters in digital mammograms. The proposed method is based on a three-step procedure: (a) preprocessing and segmentation, (b) regions of interest (ROI) specification, and (c) feature extraction and classification. The reduction of false positive cases is performed using an intelligent system containing two sub-systems: a rule-based and a neural network sub-system. In the first step of the classification schema 22 features are automatically computed which refer either to individual microcalcifications or to groups of them. Further reduction in the number of features is achieved through principal component analysis (PCA). The proposed methodology is tested using the Nijmegen and the Mammographic Image Analysis Society (MIAS) mammographic databases. Results are presented as the receiver operating characteristic (ROC …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Clinical Decision Support Systems",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9780471740360.ebs0269",
            "Abstract": "Clinical decision support systems (CDSSs) are entities that intend to support clinical personnel in medical decision‐making tasks. In more technical terms, CDSSs are active knowledge systems that use two or more items of patient data to generate case‐specific advice. CDSSs first appeared in the late 1950s but have experienced significant growth over the last three decades providing advice in the clinical decision‐making process. Specific fields of decision support offered by CDSSs include diagnosis, therapy planning, alerting and informing, and information retrieval. CDSSs interact with patient records and measurement devices for data acquisition and knowledge bases for retrieval of knowledge related to the specific case. Combining the data from the above sources, intelligent methods are applied for clinical inference. Rule‐based, probabilistic, and machine learning techniques are employed to provide …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:hMod-77fHWUC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Mining Clinical Data",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-8785-2_1",
            "Abstract": "The prerequisite of any machine learning or data mining application is to have a clear target variable that the system will try to learn. In a supervised setting, we also need to know the value of this target variable for a set of training examples (i.e., patient records). In the case study presented in this chapter, the value of the considered target variable that can be used for training is the ground truth characterizations of the coronary artery disease severity or, as a different scenario, the progression of the patients. We either set as target variable the disease severity, or disease progression, and then we consider a two-class problem in which we aim to discriminate a group of patients that are characterized as “severely diseased” or “severely progressed,” from a second group containing “mildly diseased” or “mildly progressed” patients, respectively. This latter mild/severe characterization is the actual value of the target …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:lmc2jWPfTJgC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Journal of intElligEnt SyStEmS",
            "Publication year": 2016,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/jisys-2019-frontmatter5/html",
            "Abstract": "ObjectiveThe Journal of Intelligent Systems provides readers with a compilation of stimulating and up-to-date articles within the field of intelligent systems. The focus of the journal is on high quality research that addresses paradigms, development, applications and implications in the field of intelligent systems. The Journal of Intelligent Systems is a peer reviewed journal. Special issues can be arranged by contacting the Editor.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:b1wdh0AR-JQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incremental mixture learning for clustering discrete data",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_23",
            "Abstract": "This paper elaborates on an efficient approach for clustering discrete data by incrementally building multinomial mixture models through likelihood maximization using the Expectation-Maximization (EM) algorithm. The method adds sequentially at each step a new multinomial component to a mixture model based on a combined scheme of global and local search in order to deal with the initialization problem of the EM algorithm. In the global search phase several initial values are examined for the parameters of the multinomial component. These values are selected from an appropriately defined set of initialization candidates. Two methods are proposed here to specify the elements of this set based on the agglomerative and the kd-tree clustering algorithms. We investigate the performance of the incremental learning technique on a synthetic and a real dataset and also provide comparative results with the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Shared kernel models for class conditional density estimation",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/950129/",
            "Abstract": "We present probabilistic models which are suitable for class conditional density estimation and can be regarded as shared kernel models where sharing means that each kernel may contribute to the estimation of the conditional densities of an classes. We first propose a model that constitutes an adaptation of the classical radial basis function (RBF) network (with full sharing of kernels among classes) where the outputs represent class conditional densities. In the opposite direction is the approach of separate mixtures model where the density of each class is estimated using a separate mixture density (no sharing of kernels among classes). We present a general model that allows for the expression of intermediate cases where the degree of kernel sharing can be specified through an extra model parameter. This general model encompasses both the above mentioned models as special cases. In all proposed models …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An incremental training method for the probabilistic RBF network",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/iel5/72/34606/01650251.pdf",
            "Abstract": "The probabilistic radial basis function (PRBF) net-work constitutes a probabilistic version of the RBF network for classification that extends the typical mixture model approach to classification by allowing the sharing of mixture components among all classes. The typical learning method of PRBF for a classification task employs the expectation–maximization (EM) algorithm and depends strongly on the initial parameter values. In this paper, we propose a technique for incremental training of the PRBF network for classification. The proposed algorithm starts with a single component and incrementally adds more components at appropriate positions in the data space. The addition of a new component is based on criteria for detecting a region in the data space that is crucial for the classification task. After the addition of all components, the algorithm splits every component of the network into subcomponents, each one …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:abG-DnoFyZgC",
            "Publisher": "Institute of Electrical and Electronics Engineers"
        },
        {
            "Title": "A spatially constrained mixture model for image segmentation",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1402510/",
            "Abstract": "Gaussian mixture models (GMMs) constitute a well-known type of probabilistic neural networks. One of their many successful applications is in image segmentation, where spatially constrained mixture models have been trained using the expectation-maximization (EM) framework. In this letter, we elaborate on this method and propose a new methodology for the M-step of the EM algorithm that is based on a novel constrained optimization formulation. Numerical experiments using simulated images illustrate the superior performance of our method in terms of the attained maximum value of the objective function and segmentation accuracy compared to previous implementations of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluating generalization through interval-based neural network inversion",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s00521-019-04129-5",
            "Abstract": "Typically, measuring the generalization ability of a neural network relies on the well-known method of cross-validation which statistically estimates the classification error of a network architecture thus assessing its generalization ability. However, for a number of reasons, cross-validation does not constitute an efficient and unbiased estimator of generalization and cannot be used to assess generalization of neural network after training. In this paper, we introduce a new method for evaluating generalization based on a deterministic approach revealing and exploiting the network’s domain of validity. This is the area of the input space containing all the points for which a class-specific network output provides values higher than a certainty threshold. The proposed approach is a set membership technique which defines the network’s domain of validity by inverting its output activity on the input space. For a trained …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:KbBQZpvPDL4C",
            "Publisher": "Springer London"
        },
        {
            "Title": "The mixture of multi-kernel relevance vector machines model",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6413910/",
            "Abstract": "We present a new regression mixture model where each mixture component is a multi-kernel version of the Relevance Vector Machine (RVM). In the proposed model, we exploit the enhanced modeling capability of RVMs due to their embedded sparsity enforcing properties. %The main contribution of this %work is the employment of RVM models as components of a mixture %model and their application to the time series clustering problem. Moreover, robustness is achieved with respect to the kernel parameters, by employing a weighted multi-kernel scheme. The mixture model is trained using the maximum a posteriori (MAP) approach, where the Expectation Maximization (EM) algorithm is applied offering closed form update equations for the model parameters. An incremental learning methodology is also presented to tackle the parameter initialization problem of the EM algorithm. The efficiency of the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Camera Motion Detection Through Frame Splitting and Combination of Region-Based Motion Signals",
            "Publication year": 2018,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218001418550157",
            "Abstract": "Most of the existing approaches for camera motion detection are based on optical flow analysis and the use of the affine motion model. However, these methods are computationally expensive due to the cost of optical flow estimation and may be inefficient in the presence of moving objects whose motion is independent of the camera motion. We present an effective approach to detect camera motions by considering four trapezoidal regions in each frame and computing the horizontal and vertical translations of those regions. Then, simple decision rules based on the translations of the regions are employed in order to decide for the existence and the type of camera motion in each frame. In this way, three signals are constructed (pan, tilt, zoom) which are subsequently filtered to improve the robustness of the method. Comparative experiments on a variety of videos indicate that our method efficiently detects any type of …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:4vMrXwiscB8C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Variational bayesian blind image deconvolution with student-t priors",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4378903/",
            "Abstract": "In this paper we present a new Bayesian model for the blind image deconvolution (BID) problem. The main novelties of this model are three. The first one is the use of a sparse kernel-based model for the point spread function (PSF) that allows estimation of both PSF shape and support. The second one is a robust distribution of the BID model errors and the third novelty is an image prior that preserves edges of the reconstructed image. Sparseness, robustness and preservation of edges is achieved by using priors that are based on the Student-t probability density function (pdf). The Variational methodology is used to solve the corresponding Bayesian model. Numerical experiments are presented that demonstrate the advantages of this model as compared to previous Gaussian based ones.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient method for explaining the decisions of the probabilistic RBF classification network",
            "Publication year": 2007,
            "Publication url": "http://lkm.fri.uni-lj.si/rmarko/papers/RobnikSikonja-TR-UL-UI-2007-explainPRBF.pdf",
            "Abstract": "Transparency of the classification is an important requirement for many application fields. Robnik-Šikonja and Kononenko have recently presented a general method for explaining predictions for individual instances based on decomposition of a model’s predictions on individual contributions of each attribute. In this work we apply the general methodology in the context of the probabilistic radial basis function (PRBF) network which constitutes an effective black box classifier. Nevertheless, like most other neural network models it is not straightforward to obtain explanations for the PRBF decisions. By exploiting the marginalization property of the Gaussian distribution, we demonstrate how this explanation technique can be implanted into PRBF to explain the model’s decisions for new unlabeled cases. We also present a visualization technique that works both for single instances as well as for the attributes and their values, thus providing a valuable tool for inspection of the otherwise opaque model.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Neural Splines: Exploiting Parallelism for Fuction Approximation Using Modular Neural Networks.",
            "Publication year": 2005,
            "Publication url": "http://www.cs.uoi.gr/~lagaris/papers/PREPRINTS/Neural_splines.pdf",
            "Abstract": "We introduce the Neural Spline, that is a mathematical model built by combining a neural network and an associated Obreshkov polynomial. The neural spline has finite support and can be used as the basic element in constructing continuous modular neural-based models. These models are suitable for function approximation in partitioned domains and are also amenable to efficient parallel or distributed implementation. Experimental results are presented for test problems in one and two dimensions which illustrate the effectiveness of the proposed function approximation scheme.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple view clustering using a weighted combination of exemplar-based mixture models",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5597951/",
            "Abstract": "Multiview clustering partitions a dataset into groups by simultaneously considering multiple representations (views) for the same instances. Hence, the information available in all views is exploited and this may substantially improve the clustering result obtained by using a single representation. Usually, in multiview algorithms all views are considered equally important, something that may lead to bad cluster assignments if a view is of poor quality. To deal with this problem, we propose a method that is built upon exemplar-based mixture models, called convex mixture models (CMMs). More specifically, we present a multiview clustering algorithm, based on training a weighted multiview CMM, that associates a weight with each view and learns these weights automatically. Our approach is computationally efficient and easy to implement, involving simple iterative computations. Experiments with several datasets …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variational Bayesian Image Restoration Based on a Product of -Distributions Image Prior",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4623237/",
            "Abstract": "Image priors based on products have been recognized to offer many advantages because they allow simultaneous enforcement of multiple constraints. However, they are inconvenient for Bayesian inference because it is hard to find their normalization constant in closed form. In this paper, a new Bayesian algorithm is proposed for the image restoration problem that bypasses this difficulty. An image prior is defined by imposing Student-t densities on the outputs of local convolutional filters. A variational methodology, with a constrained expectation step, is used to infer the restored image. Numerical experiments are shown that compare this methodology to previous ones and demonstrate its advantages.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A portable decision making tool for health professionals based on neural networks",
            "Publication year": 2003,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1460458203094005",
            "Abstract": "The article presents a fast portable system to provide health professionals with                solutions for pre-operative surgical planning and decision making in real time. The                system employs an effective computational environment for solving partial and                ordinary differential equations based on neural networks. This approach is                implemented partially on a specialized hardware board to exploit the fact that                neural networks constitute massively parallel systems. The system also contains a                powerful and convenient graphical user interface. There are tools to visualize                and/or animate 2-D and 3-D data, and a customized interactive environment where                particular biomedical problems can be easily processed and formulat",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:LPZeul_q3PIC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "A sparse regression mixture model for clustering time-series",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_7",
            "Abstract": "In this study we present a new sparse polynomial regression mixture model for fitting time series. The contribution of this work is the introduction of a smoothing prior over component regression coefficients through a Bayesian framework. This is done by using an appropriate Student-t distribution. The advantages of the sparsity-favouring prior is to make model more robust, less independent on order p of polynomials and improve the clustering procedure. The whole framework is converted into a maximum a posteriori (MAP) approach, where the known EM algorithm can be applied offering update equations for the model parameters in closed forms. The efficiency of the proposed sparse mixture model is experimentally shown by applying it on various real benchmarks and by comparing it with the typical regression mixture and the K-means algorithm. The results are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:1qzjygNMrQYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Bayesian regularization method for the Probabilistic RBF network",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_30",
            "Abstract": "The Probabilistic RBF (PRBF) network constitutes a recently proposed classification network that employs Gaussian mixture models for class conditional density estimation. The particular characteristic of this model is that it allows the sharing of the Gaussian components of the mixture models among all classes, in the same spirit that the hidden units of a classification RBF network feed all output units. Training of the PRBF network is a likelihood maximization procedure based on the Expectation — Maximization (EM) algorithm. In this work, we propose a Bayesian regularization approach for training the PRBF network that takes into account the existence of ovelapping among classes in the region where a Gaussian component has been placed. We also propose a fast and iterative training procedure (based on the EM algorithm) to adjust the component parameters. Experimentalresul ts on well-known classi …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Event Detection and Classiﬁcation in Video Surveillance Sequences",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "Movie segmentation into scenes and chapters using locally weighted bag of visual words",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1646396.1646439",
            "Abstract": "Movies segmentation into semantically correlated units is a quite tedious task due to\" semantic gap\". Low-level features do not provide useful information about the semantical correlation between shots and usually fail to detect scenes with constantly dynamic content. In the method we propose herein, local invariant descriptors are used to represent the key-frames of video shots and a visual vocabulary is created from these descriptors resulting to a visual words histogram representation (bag of visual words) for each shot. A key aspect of our method is that, based on an idea from text segmentation, the histograms of visual words corresponding to each shot are further smoothed temporally by taking into account the histograms of neighboring shots. In this way, valuable contextual information is preserved. The final scene and chapter boundaries are determined at the local maxima of the difference of successive …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:R3hNpaxXUhUC",
            "Publisher": "ACM"
        },
        {
            "Title": "Class conditional density estimation using mixtures with constrained component sharing",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1206521/",
            "Abstract": "We propose a generative mixture model classifier that allows for the class conditional densities to be represented by mixtures having certain subsets of their components shared or common among classes. We argue that, when the total number of mixture components is kept fixed, the most efficient classification model is obtained by appropriately determining the sharing of components among class conditional densities. In order to discover such an efficient model, a training method is derived based on the EM algorithm that automatically adjusts component sharing. We provide experimental results with good classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Active Bayesian Mixture Learning for Image Modeling and Segmentation using Lowlevel Features",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4053667/",
            "Abstract": "Gaussian mixture models (GMM) have been shown an effective tool for image representation and segmentation. However, several issues related to GMM training for image modeling have not been adequately resolved such as the specification of the number of mixture components and the increased complexity for images of typical size (e.g. 256 times 256). We present an approach for GMM-based image modeling employing an incremental variational algorithm for Bayesian mixture learning that automatically specifies the number of mixture components. Moreover, we integrate the method in an active learning framework which allows to gradually build the GMM using only a small fraction of the image pixels.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Key-frame extraction using weighted multi-view convex mixture models and spectral clustering",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6977308/",
            "Abstract": "Reliable video summarization is one of the most important problems in digital video processing and analysis. The most common approach used for shot representation is the extraction of a set of key-frames sufficiently representing the total content of the shot. In such way, the whole video content can be represented using only a few, cautiously picked, non redundant key-frames maintaining at the same time a great percentage of information. A typical approach is to extract key frames using clustering. However, using a single image descriptor to extract key-frames is not sufficient due to large variations in the visual content of videos. In our approach, a weighted multi-view clustering algorithm is employed to combine two different image descriptors into a single similarity matrix, that serves as an input to a spectral clustering algorithm. Each image descriptor (view) does not contribute equally to the similarity matrix, but …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Machine Learning and Neural Networks",
            "Publication year": 2013,
            "Publication url": "https://www.eetn.gr/index.php/about-eetn/eetn-publications/ai-research-in-greece/machine-learning-and-neural-networks?showall=1",
            "Abstract": "Machine Learning is a subfield of Artificial Intelligence that is concerned with algorithms and techniques that allow computer systems to “learn from experience” to successfully solve artificial intelligence problems. Experience is usually provided in the form of problem-specific “examples”(organized in “datasets”) that allow the learning system to discover new knowledge and improve its performance on a particular task. If the training examples are not available at the beginning of the learning process, but they are collected during training we have the case of “on-line” or incremental learning. If the system is already provided some knowledge about the domain and/or the task, we have the case of knowledge refinement or analytical learning.Machine Learning problems are generally distinguished into three main categories depending on the nature of the datasets: In supervised learning, we are given a set of labeled examples and the aim is to discover the knowledge required for labeling new examples. Typical tasks that fall within the paradigm of supervised learning are classification where a class label is predicted for each input example and regression, where a numerical value is predicted for each input example. In unsupervised learning we are given a set of unlabeled examples and the aim is to identify the underlying structure of the data and extract it in the form of actionable knowledge. Typical unsupervised learning tasks are clustering, where the goal is to identify commonalities among the examples and form interesting clusters, and model estimation, where the knowledge model that generated the data is being sought, eg in the form of …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Late fusion of deep and shallow features to improve discrimination of actinic keratosis from normal skin using clinical photography",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/srt.12684",
            "Abstract": "Actinic keratosis (AK) is a common premalignant skin lesion that can potentially progress to squamous cell carcinoma. Appropriate long‐term management of AK requires close patient monitoring in addition to therapeutic interventions. Computer‐aided diagnostic systems based on clinical photography might evolve in the future into valuable adjuncts to AK patient management. The present study proposes a late fusion approach of color‐texture features (shallow features) and deep features extracted from pre‐trained convolutional neural networks (CNN) to boost AK detection accuracy on clinical photographs.System uses a sliding rectangular window of 50 × 50 pixels and a classifier that assigns the window region to either the AK or the healthy skin class. 6010 and 13 915 cropped regions of interest (ROI) of 50 × 50 pixels of AK and healthy skin, respectively, from 22 patients …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:OR75R8vi5nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual tracking using spatially weighted likelihood of Gaussian mixtures",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314215001563",
            "Abstract": "A probabilistic real time tracking algorithm is proposed where the target’s feature distribution is represented by a Gaussian mixture model (GMM). The target localization is achieved by maximizing its weighted likelihood in the image sequence. The role of the weight in the likelihood definition is important as it allows gradient based optimization to be performed, which would not be feasible in a context of standard likelihood representations. Moreover, the algorithm handles scale and rotation changes of the target, as well as appearance changes, which modifies the components of the GMM. The real time performance is experimentally confirmed, while the algorithms has comparative performance with other state-of-the-art tracking algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:hCrLmN-GePgC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A probabilistic RBF network for classification",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/860779/",
            "Abstract": "We present a probabilistic neural network model which is suitable for classification problems. This model constitutes an adaptation of the classical RBF network where the outputs represent the class conditional distributions. Since the network outputs correspond to probability density functions, training process is treated as maximum likelihood problem and an expectation-maximization (EM) algorithm is proposed for adjusting the network parameters. Experimental results show that proposed architecture exhibits superior classification performance compared to the classical RBF network.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:_B80troHkn4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Robust Image Registration using Mixtures of t-distributions",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4409127/",
            "Abstract": "We propose a pixel similarity-based algorithm enabling accurate rigid registration between single and multimodal images presenting gross dissimilarities due to noise, missing data or outlying measures. The method relies on the partitioning of a reference image by a Student's t-mixture model (SMM). This partition is then projected onto the image to be registered. The main idea is that a t-component in the reference image corresponds to a t-component in the image to be registered. If the images are correctly registered the weighted sum of distances between the corresponding components is minimized. The use of SMM components is justified by the property that they have heavier tails than standard Gaussians, thus providing robustness to outliers. Experimental results indicate that, even in the case of images presenting low SNR or important amount of dissimilarities due to temporal changes, the proposed algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characterization of clustered microcalcifications in digitized mammograms using neural networks and support vector machines",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S093336570400154X",
            "Abstract": ": Detection and characterization of microcalcification clusters in mammograms is vital in daily clinical practice. The scope of this work is to present a novel computer-based automated method for the characterization of microcalcification clusters in digitized mammograms.: The proposed method has been implemented in three stages: (a) the cluster detection stage to identify clusters of microcalcifications, (b) the feature extraction stage to compute the important features of each cluster and (c) the classification stage, which provides with the final characterization. In the classification stage, a rule-based system, an artificial neural network (ANN) and a support vector machine (SVM) have been implemented and evaluated using receiver operating characteristic (ROC) analysis. The proposed method was evaluated using the Nijmegen and Mammographic Image Analysis Society (MIAS …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:35r97b3x0nAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An ischemia detection method based on artificial neural networks",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0933365701001002",
            "Abstract": "An automated technique was developed for the detection of ischemic episodes in long duration electrocardiographic (ECG) recordings that employs an artificial neural network. In order to train the network for beat classification, a cardiac beat dataset was constructed based on recordings from the European Society of Cardiology (ESC) ST-T database. The network was trained using a Bayesian regularisation method. The raw ECG signal containing the ST segment and the T wave of each beat were the inputs to the beat classification system and the output was the classification of the beat. The input to the network was produced through a principal component analysis (PCA) to achieve dimensionality reduction. The network performance in beat classification was tested on the cardiac beat database providing 90% sensitivity (Se) and 90% specificity (Sp). The neural beat classifier is integrated in a four-stage procedure …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:qjMakFHDy7sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wearable medical devices",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9780471740360.ebs1326",
            "Abstract": "The term wearable medical devices describes autonomous devices that are worn by a person and provide medical monitoring or support over a prolonged period of time. Their distinguishing characteristic is that they are worn either as an accessory or are embedded into clothing. Such devices normally incorporate noninvasive physiological sensors, data processing modules, medical feedback, and wireless data transmission capabilities. They are small, light, unobtrusive, and designed for operation by unskilled users. Current developments include real‐time feedback, alerting mechanisms, medical decision support, and wireless access to information. Wearable medical devices offer the supporting hardware for dealing with the emerging medical trend of delivering point‐of‐care service, unconfined medical monitoring and support, and assisting in the remote management of medical conditions for rehabilitating …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:dshw04ExmUIC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Variational methods for Bayesian blind deconvolution",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10026861998/",
            "Abstract": "CiNii 論文 - Variational methods for Bayesian blind deconvolution CiNii 国立情報学研究所 学術\n情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規\n登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 \n刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 [機関認証] 利用\n継続手続きのご案内 Variational methods for Bayesian blind deconvolution LIKAS A. 被引用文献\n: 1件 著者 LIKAS A. 収録刊行物 Proc. IEEE Conf. on Image Processing, Sept. 2005 Proc. IEEE \nConf. on Image Processing, Sept. 2005 2, \"II-770\"-\"II-773\", 2005 被引用文献: 1件中 1-1件を 表示 \n1 Image Restoration Based on Adaptive Directional Regularization AHMED OMER Osama \n, TANAKA Toshihisa IEICE transactions on fundamentals of electronics, communications \nand computer sciences 92(12), 3344-3354, 2009-12-01 参考文献11件 Tweet 各種(…",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:ODE9OILHJdcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Training Algorithms",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=14399580872711959242&hl=en&oi=scholarr",
            "Abstract": "The Probabilistic RBF (PRBF) network constitutes an a-daptation of the RBF network for classification. Moreover it extends the typical mixture model by allowing the sharing of mixture components among all classes, in contrast to the conventional approach that suggests mixture components describing only one class. The typical learning method of PRBF for a classification task employs the Expectation-Max-imization (EM) algorithm. This widely used method depends strongly on the initial parameter values. The Greedy EM algorithm is a recently proposed method that tries to overcome this drawback, in the case of the density estimation problem using mixture models. In this work we pro-pose a similar approach for incremental training of the PRBF network for classification. The proposed algorithm starts with a single component and incrementally adds more components. After convergence the algorithm splits all the components of the network. The addition of a new component is based on criteria for detecting a region in the data space that is crucial for the classification task. Experimental results using several well-known classification datasets indicate that the incremental method provides solutions of superior classification performance.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Automatic discrimination of actinic keratoses from clinical photographs",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010482517302251",
            "Abstract": "Actinic keratoses (AK) are common premalignant skin lesions that can progress to invasive skin squamous cell carcinoma (sSCC). The subtle accumulation of multiple AK in aging individuals increases the risk of sSCC development, and this underscores the need for efficient treatment and patient follow-up. Our objectives were to develop a method based on color texture analysis of standard clinical photographs for the discrimination of AK from healthy skin and subsequently to test the developed approach in the quantification of field-directed treatment interventions.AK and healthy skin in clinical photographs of 22 patients were demarcated by experts and regions of interest (ROIs) of 50 × 50 pixels were cropped. The data set comprised 6010 and 13915 ROIs from AK and healthy skin, respectively. Color texture features were extracted using local binary patterns (LBP) or texton …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:9c2xU6iGI7YC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Visual tracking by weighted likelihood maximization",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6495053/",
            "Abstract": "A probabilistic real time tracking algorithm is proposed. The distribution of the target is represented by a Gaussian mixture model (GMM) and the weighted likelihood of the target is maximized in order to localize it in an image sequence. The role of the weight is important as it allows gradient based optimization to be performed, which would not be feasible in a context of standard likelihood representations. The algorithm models both the object to be tracked and local background elements and handles scale changes in target's appearance. It is experimentally demonstrated that the algorithm runs in real time, and it is at least at the same performance level with the mean shift algorithm while it provides more accurate target localization in non trivial scenarios (e.g. shadows).",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Probability density estimation using artificial neural networks",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0010465500002356",
            "Abstract": "We present an approach for the estimation of probability density functions (pdf) given a set of observations. It is based on the use of feedforward multilayer neural networks with sigmoid hidden units. The particular characteristic of the method is that the output of the network is not a pdf, therefore, the computation of the network's integral is required. When this integral cannot be performed analytically, one is forced to resort to numerical integration techniques. It turns out that this is quite tricky when coupled with subsequent training procedures. Several modifications of the original approach (Modha and Fainman, 1994) are proposed, most of them related to the numerical treatment of the integral and the employment of a preprocessing phase where the network parameters are initialized using supervised training. Experimental results using several test problems indicate that the proposed method is very effective and in …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:dhFuZR0502QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Visual tracking using the Earth Mover's Distance between Gaussian mixtures and Kalman filtering",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885610001587",
            "Abstract": "In this paper, we demonstrate how the differential Earth Mover's Distance (EMD) may be used for visual tracking in synergy with Gaussian mixtures models (GMM). According to our model, motion between adjacent frames results in variations of the mixing proportions of the Gaussian components representing the object to be tracked. These variations are computed in closed form by minimizing the differential EMD between Gaussian mixtures, yielding a very fast algorithm with high accuracy, without recurring to the EM algorithm in each frame. Moreover, we also propose a framework to handle occlusions, where the prediction for the object's location is forwarded to an adaptive Kalman filter whose parameters are estimated on line by the motion model already observed. Experimental results show significant improvement in tracking performance in the presence of occlusion.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Event Detection and Classification in Video Surveillance Sequences",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_35",
            "Abstract": "In this paper, we present a system for event recognition and classification in video surveillance sequences. First, local invariant descriptors of video frames are employed to remove background information and segment the video into events. Next, visual word histograms are computed for each video event and used to define a distance measure between events. Finally, machine learning techniques are employed to classify events into predefined categories. Numerical experiments indicate that the proposed approach provides high event detection and classification rates.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Non stationary bayesian image restoration",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1333866/",
            "Abstract": "We propose a new iterative Bayesian non stationary image restoration algorithm. The main novelty of this approach is the introduction of a hierarchical non stationary image prior. Based on this prior and the generative graphical model for the observations, Bayesian inference is performed integrating out the hidden variables. An interesting byproduct of this approach is the justification, using a Bayesian framework, of previous non stationary image restoration formulations that were based on heuristic arguments. Numerical experiments are provided that demonstrate the advantages of the proposed non stationary approach as compared with the stationary approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Childcares: an intelligent collaborative environment for out-of-hospital child healthcare",
            "Publication year": 2002,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/146045820200800404",
            "Abstract": "This paper provides an overview of the concept, the functionalities and the architecture of the CHILDCARE platform. Our system aims at supporting the out-of-hospital continuous healthcare management of children and promoting its quality. All the involved actors in this domain are integrated across the system. Our focus is the utilization of the latest technology accomplishments towards the incorporation of teleconference sessions, collaborative spaces and intelligent features over a common secure platform. This combination allows: •remote communication between health experts and the child’s family• setup, execution and monitoring of health management plans• efficient collaboration between the responsible doctor and healthcare professionals• access from multiple devices from any place, at any time• role-based management of the involved actors with respect to their actual involvement in the healthcare …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Variational Bayesian Blind Image Deconvolution with Student-T",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.540.303",
            "Abstract": "In this paper we propose a variational Bayesian algo-rithm for the blind image deconvolution problem. The unknown point spread function (PSF) is modeled as a sparse linear combination of kernel basis functions. This model offers an effective mechanism to estimate for the first time both the support and the shape of the PSF. Numerical experiments demonstrate the effectiveness of the proposed methodology. 1.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:fFSKOagxvKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A class-adaptive spatially variant mixture model for image segmentation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4130435/",
            "Abstract": "We propose a new approach for image segmentation based on a hierarchical and spatially variant mixture model. According to this model, the pixel labels are random variables and a smoothness prior is imposed on them. The main novelty of this work is a new family of smoothness priors for the label probabilities in spatially variant mixture models. These Gauss-Markov random field-based priors allow all their parameters to be estimated in closed form via the maximum a posteriori (MAP) estimation using the expectation-maximization methodology. Thus, it is possible to introduce priors with multiple parameters that adapt to different aspects of the data. Numerical experiments are presented where the proposed MAP algorithms were tested in various image segmentation scenarios. These experiments demonstrate that the proposed segmentation scheme compares favorably to both standard and previous spatially …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wearable virtual reality feedback for the real time health monitoring of running athletes",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/45493829/Wearable_Virtual_Reality_Feedback_for_th20160509-28501-t2hh8g.pdf",
            "Abstract": "The value of multimedia and virtual reality applications for monitoring and studying pathological human movement and for assisting rehabilitation has been previously documented [1, 2]. The present study extends the use of virtual reality applications in medicine for a wearable system designed to provide real time monitoring of athletes during rehabilitation from a major injury. The interface is an integral part of an intelligent multi-signal monitoring platform described in [3]. It displays measurements taken from physiological and motion sensors and projects them along with a virtual reality model of the running athlete. It also provides visual alerts and decision support feedback related to health condition and rehabilitation.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The global kernel k-means clustering algorithm",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4634069/",
            "Abstract": "Kernel k-means is an extension of the standard k-means clustering algorithm that identifies nonlinearly separable clusters. In order to overcome the cluster initialization problem associated with this method, in this work we propose the global kernel k-means algorithm, a deterministic and incremental approach to kernel-based clustering. Our method adds one cluster at each stage through a global search procedure consisting of several executions of kernel k-means from suitable initializations. This algorithm does not depend on cluster initialization, identifies nonlinearly separable clusters and, due to its incremental nature and search procedure, locates near optimal solutions avoiding poor local minima. Furthermore a modification is proposed to reduce the computational cost that does not significantly affect the solution quality. We test the proposed methods on artificial data and also for the first time we employ kernel …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multicriteria decision based approach for ischaemia detection in long duration ECGs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222502/",
            "Abstract": "A new method based on a multicriteria classification algorithm, which is applied on data extracted from the electrocardiographic signal and the patient's history, is described for the detection of ischaemic episodes in long duration electrocardiographic recordings. The classification procedure is embedded into a four-stage system of automated ischaemia diagnosis. Using a task-specific cardiac beat database the multicriteria method was properly adjusted to classify each presented cardiac beat as ischaemic or normal. The method was tested using the cardiac beat database and we achieved good results, equal or even better than other reported methods, demonstrating the efficiency of the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Convex mixture models for multi-view clustering",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04277-5_21",
            "Abstract": "Data with multiple representations (views) arise naturally in many applications and multi-view algorithms can substantially improve the classification and clustering results. In this work, we study the problem of multi-view clustering and propose a multi-view convex mixture model that locates exemplars (cluster representatives) in the dataset by simultaneously considering all views. Convex mixture models are simplified mixture models that exhibit several attractive characteristics. The proposed algorithm extends the single view convex mixture models so as to handle data with any number of representations, taking into account the diversity of the views while preserving their good properties. Empirical evaluations on synthetic and real data demonstrate the effectiveness and potential of our method.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Efficient key-frame extraction based on unimodality of frame sequences",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7015179/",
            "Abstract": "Keyframe extraction for shot representation is the most common video summarization approach. Any reliable keyframe extraction algorithm should automatically detect the number of keyframes, while extracting non-repetitive keyframes that can efficiently summarize the video content. Moreover, it is important that key-frame extraction is performed in reasonable time. The proposed method is based on a moving window of successive frames that slides over the whole frame sequence (shot). The set of frames included in each window is tested for content homogeneity using an appropriate unimodality test. Thus, each window is characterized as unimodal or not and the frame sequence of each non-unimodal window is splitted into two (possibly unimodal) segments. In this way, each video shot is segmented into unimodal segments and the key-frames are computed as the representative frames (medoids) of each …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:HbR8gkJAVGIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mixture of experts classification using a hierarchical mixture model",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6789646/",
            "Abstract": "A three-level hierarchical mixture model for classification is presented that models the following data generation process: (1) the data are generated by a finite number of sources (clusters), and (2) the generation mechanism of each source assumes the existence of individual internal class-labeled sources (subclusters of the external cluster). The model estimates the posterior probability of class membership similar to a mixture of experts classifier. In order to learn the parameters of the model, we have developed a general training approach based on maximum likelihood that results in two efficient training algorithms. Compared to other classification mixture models, the proposed hierarchical model exhibits several advantages and provides improved classification performance as indicated by the experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:0EnyYjriUFMC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "Elimination of outliers from 2-D point sets using the helmholtz principle",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7081346/",
            "Abstract": "A method for modeling and removing outliers from 2-D sets of scattered points is presented. The method relies on a principle due to Helmholtz stating that every large deviation from uniform noise should be perceptible, provided that the deviation is generated by an a contrario model of geometric structures. By assuming local linearity, we first employ a robust algorithm to model the local manifold of the corrupted data by local line segments. Our rationale is that long line segments should not be expected in a noisy set of points. This assumption leads to the modeling of the lengths of the line segments by a Pareto distribution, which is the adopted a contrario model for the observations. The model is successfully evaluated on two problems in computer vision: shape recovery and linear regression.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:0N-VGjzr574C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Kernel-based weighted multi-view clustering",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6413741/",
            "Abstract": "Exploiting multiple representations, or views, for the same set of instances within a clustering framework is a popular practice for boosting clustering accuracy. However, some of the available sources may be misleading (due to noise, errors in measurement etc.) in revealing the true structure of the data, thus, their inclusion in the clustering process may have negative influence. This aspect seems to be overlooked in the multi-view literature where all representations are equally considered. In this work, views are expressed in terms of given kernel matrices and a weighted combination of the kernels is learned in parallel to the partitioning. Weights assigned to kernels are indicative of the quality of the corresponding views' information. Additionally, the combination scheme incorporates a parameter that controls the admissible sparsity of the weights to avoid extremes and tailor them to the data. Two efficient iterative …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:Z5m8FVwuT1cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variational Bayesian blind image deconvolution based on a sparse kernel model for the point spread function",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7071377/",
            "Abstract": "In this paper we propose a variational Bayesian algorithm for the blind image deconvolution problem. The unknown point spread function (PSF) is modeled as a sparse linear combination of kernel basis functions. This model offers an effective mechanism to estimate for the first time both the support and the shape of the PSF. Numerical experiments demonstrate the effectiveness of the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ZHo1McVdvXMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust knowledge-based technique for ischemia detection in noisy ECGs",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/884159/",
            "Abstract": "In cases where the signal-to-noise ratio (SNR) in ECGs is very poor, the correct definition of characteristics such as the isoelectric line and the J-point (beginning of the ST segment) is difficult. Inaccurate definition of those ECG characteristics can lead an automated ischemia detector to an incorrect diagnosis. We propose a method capable of extracting from noisy long duration ECG recordings those ECG characteristics that can be used for myocardial ischemia detection and analysis. We tested the performance of the method using noisy ECGs from the European Society of Cardiology ST-T database (ESC ST-T database). The results were more than satisfactory and the performance of our ischemia detector was improved in all cases. The proposed technique has low computational effort and can be executed in real time.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reinforcement learning using the stochastic fuzzy min–max neural network",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011344810020",
            "Abstract": "The fuzzy min–max neural network constitutes a neural architecture that is based on hyperbox fuzzy sets and can be incrementally trained by appropriately adjusting the number of hyperboxes and their corresponding volumes. An extension to this network has been proposed recently, that is based on the notion of random hyperboxes and is suitable for reinforcement learning problems with discrete action space. In this work, we elaborate further on the random hyperbox idea and propose the stochastic fuzzy min–max neural network, where each hyperbox is associated with a stochastic learning automaton. Experimental results using the pole balancing problem indicate that the employment of this model as an action selection network in reinforcement learning schemes leads to superior learning performance compared with the traditional approach where the multilayer perceptron is employed.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "A tutorial on relevance vector machines for regression and classification with applications",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.99.3559&rep=rep1&type=pdf",
            "Abstract": "Relevance vector machines (RVM) have recently attracted much interest in the research community because they provide a number of advantages. They are based on a Bayesian formulation of a linear model with an appropriate prior that results in a sparse representation. As a consequence, they can generalize well and provide inferences at low computational cost. In this tutorial we first present the basic theory of RVM for regression and classification, followed by two examples illustrating the application of RVM for object detection and classification. The first example is target detection in images and RVM is used in a regression context. The second example is detection and classification of microcalcifications from mammograms and RVM is used in a classification framework. Both examples illustrate the application of the RVM methodology and demonstrate its advantages.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special Issue on EANN 2017",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=6227343044585381724&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:yMeIxYmEMEAC",
            "Publisher": "SPRINGER LONDON LTD"
        },
        {
            "Title": "Mixture model analysis of DNA microarray images",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1461526/",
            "Abstract": "In this paper, we propose a new methodology for analysis of microarray images. First, a new gridding algorithm is proposed for determining the individual spots and their borders. Then, a Gaussian mixture model (GMM) approach is presented for the analysis of the individual spot images. The main advantages of the proposed methodology are modeling flexibility and adaptability to the data, which are well-known strengths of GMM. The maximum likelihood and maximum a posteriori approaches are used to estimate the GMM parameters via the expectation maximization algorithm. The proposed approach has the ability to detect and compensate for artifacts that might occur in microarray images. This is accomplished by a model-based criterion that selects the number of the mixture components. We present numerical experiments with artificial and real data where we compare the proposed approach with previous …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neural Splines Exploiting Parallelism for Function Approximation Using Modular Neural Networks",
            "Publication year": 2005,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/10855",
            "Abstract": "Repository of UOI \"Olympias\": Neural Splines Exploiting Parallelism for Function Approximation \nUsing Modular Neural Networks Skip navigation Home Browse Communities & Collections \nBrowse Items by: Issue Date Author Title Subject Item Type Advanced Search Help About \nDSpace Sign on to: My DSpace Receive email updates Edit Profile Saved Searches Favorites \nRepository of UOI \"Olympias\" 1.Repository of OAI 2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Θετικών \nΕπιστημών 4.Τμήμα Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής 5.Άρθρα σε \nεπιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English Please use this identifier to cite or link to this \nitem: https://olympias.lib.uoi.gr/jspui/handle/123456789/10855 Institution and School/Department \nof submitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Θετικών Επιστημών. Τμήμα Μηχανικών \nΗλεκτρονικών Υπολογιστών και Πληροφορικής URI: https://olympias.lib.uoi.gr/jspui///: : …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:NXb4pA-qfm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large scale multikernel relevance vector machine for object detection",
            "Publication year": 2007,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218213007003655",
            "Abstract": "The Relevance Vector Machine(RVM) is a widely accepted Bayesian model commonly used for regression and classification tasks. In this paper we propose a multikernel version of the RVM and present an alternative inference algorithm based on Fourier domain computation to solve this model for large scale problems, e.g. images. We then apply the proposed method to the object detection problem with promising results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:HDshCWvjkbEC",
            "Publisher": "WORLD SCIENTIFIC PUBLISHING"
        },
        {
            "Title": "Real time visual tracking using a spatially weighted von Mises mixture model",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865517300867",
            "Abstract": "A real time, kernel based, model-free tracking algorithm is proposed, which employs a weighted von Mises mixture as the target’s appearance model. The mixture weights, which are provided by a spatial kernel, along with the hue values are used in order to estimate the parameters of the weighted von Mises mixture model. The von Mises distribution is suitable for circular data and it is employed in order to eliminate drawbacks in kernel-based tracking caused by eventual shifts of the target’s histogram bins. The weights allow a mean shift-like gradient based optimization by maximizing the weighted likelihood, which would not be feasible in the context of a standard von Mises mixture. Moreover, as only the hue component of the target is involved, many quantities of the algorithm may be pre-calculated for given parameters and therefore the algorithm can perform in real time, which is experimentally confirmed. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:WJVC3Jt7v1AC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A GREEDY METHOD FOR MIXTURE-BASED CLASSIFICATION",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0026",
            "Abstract": "The typical approach of mixture-based learning for classification employs the Expectation – Maximization (EM) algorithm. This widely used method suffers from two important drawbacks, namely it cannot estimate the true number of mixing components, and depends strongly on the initial parameter values. The Greedy EM algorithm is a recently proposed algorithm that tries to overcome these drawbacks for the density estimation task. The direct application of this method for the classification task is obvious, as long as we are interested in typical mixture models. In this work we propose a greedy learning method adapted for a generalized mixture model (called the Probabilistic RBF network) with the particular characteristic that it allows the sharing of the mixture components among all classes, in contrast to the convetional model that suggests mixture components describing only one class. The proposed algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:UxriW0iASnsC",
            "Publisher": "World Scientific Pub Co Inc"
        },
        {
            "Title": "Bayesian regression of functional neuroimages",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7079759/",
            "Abstract": "A Bayesian approach is proposed for statistical analysis of fMRI data sets in a two state (“on-off”) activation study. The approach is based on the Relevance Vector Machine (RVM) regression framework. According to this approach the shape of the activations is a superposition of kernel functions, one at each pixel of the image, and a hierarchical Bayesian model is employed which imposes a sparse representation by selecting a number relevant kernel functions. We have implemented an incremental method for constructing the RVM model and, in addition, we have employed a cross-validation criterion to deal with the problem of kernel width selection. The proposed method allows the accurate estimation of the activation locations when correlated noise is present even at low signal-to-noise ratios. We tested this method using an artificial phantom derived from a previous neuroimaging study with promising results …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visual tracking by adaptive kalman filtering and mean shift",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_19",
            "Abstract": "A method for object tracking combining the accuracy of mean shift with the robustness to occlusion of Kalman filtering is proposed. At first, an estimation of the object’s position is obtained by the mean shift tracking algorithm and it is treated as the observation for a Kalman filter. Moreover, we propose a dynamic scheme for the Kalman filter as the elements of its state matrix are updated on-line depending on a measure evaluating the quality of the observation. According to this measure, if the target is not occluded the observation contributes to the update equations of the Kalman filter state matrix. Otherwise, the observation is not taken into consideration. Experimental results show significant improvement with respect to the standard mean shift method both in terms of accuracy and execution time.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Gaussian mixture-based mean shift for tracking under abrupt illumination changes",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6274293/",
            "Abstract": "Mean shift is a fundamental algorithm for visual object tracking which is based on the minimization of the distance between the discrete histogram of the target and the discrete histogram of the neighborhood of a candidate image location. While the algorithm performs well when the target's appearance and the lighting conditions are constant, it may fail when these conditions are not met because the ideal histogram is generally shifted with respect to the reference histogram. In this work, we propose to compute the initial histogram of the target using a Gaussian mixture model (GMM) rather than impulses generated by simple counting. This mixture plays the role of a weighting function, in the histograms computed in subsequent frames, in order to make them smoother and increase the overlapping area with the initial histogram. By these means, sudden illumination changes between consecutive frames may exhibit …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:zLWjf1WUPmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Piecewise neural networks for function approximation, cast in a form suitable for parallel computation",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_28",
            "Abstract": "We present a technique for function approximation in a partitioned domain. In each of the partitions a form containing a Neural Network is utilized with parameterized boundary conditions. This parameterization renders feasible the parallelization of the computation. Conditions of continuity across the partitions are studied for the function itself and for a number of its derivatives. A comparison is made with traditional methods and the results are reported.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "The Global Kernel-Means Algorithm for Clustering in Feature Space",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5033312/",
            "Abstract": "Kernel k-means is an extension of the standard k-means clustering algorithm that identifies nonlinearly separable clusters. In order to overcome the cluster initialization problem associated with this method, we propose the global kernel k-means algorithm, a deterministic and incremental approach to kernel-based clustering. Our method adds one cluster at each stage, through a global search procedure consisting of several executions of kernel k-means from suitable initializations. This algorithm does not depend on cluster initialization, identifies nonlinearly separable clusters, and, due to its incremental nature and search procedure, locates near-optimal solutions avoiding poor local minima. Furthermore, two modifications are developed to reduce the computational cost that do not significantly affect the solution quality. The proposed methods are extended to handle weighted data points, which enables their …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Differential Association and Operational Equivalence of Discrete Hop eld Networks",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.54.117&rep=rep1&type=pdf",
            "Abstract": "An original transform is presented which, given a binary Hop eld neural network and a state vector of this network, creates a new binary Hop eld network of the same size and establishes a correspondence between the states of the two networks during operation. The derived network operates in a di erential manner with respect to the initial one, in that its state vector represents the deviation of the corresponding state of the original network from the base state used for the transform. As a consequence, the energy of the second network accepts an analogous interpretation. The transform exhibits several interesting properties which are proved and discussed. Moreover, the notion of operational equivalence is introduced and it is shown that equivalence classes of binary Hop eld networks can be de ned on the basis of the transform.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Video rushes summarization using spectral clustering and sequence alignment",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1463563.1463576",
            "Abstract": "In this paper we describe a system for video rushes summarization. The basic problems of rushes videos are three. First, the presence of useless frames such as colorbars, monochrome frames and frames containing clapboards. Second, the repetition of similar segments produced from multiple takes of the same scene and finally, the efficient representation of the original video in the video summary. In the method we proposed herein, the input video is segmented into shots. Then, colorbars and monochrome frames are removed by checking their edge direction histogram, whereas frames containing clapboards are removed by checking their SIFT descriptors. Next, an enhanced spectral clustering algorithm that both estimates the number of clusters and employs the fast global k-means algorithm in the clustering stage after the eigenvector computation of the similarity matrix is used to extract the key-frames of each …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Unsupervised learning of Gaussian mixtures based on variational component splitting",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4182372/",
            "Abstract": "In this paper, we present an incremental method for model selection and learning of Gaussian mixtures based on the recently proposed variational Bayes approach. The method adds components to the mixture using a Bayesian splitting test procedure: a component is split into two components and then variational update equations are applied only to the parameters of the two components. As a result, either both components are retained in the model or one of them is found to be redundant and is eliminated from the model. In our approach, the model selection problem is treated locally, in a region of the data space, so we can set more informative priors based on the local data distribution. A modified Bayesian mixture model is presented to implement this approach, along with a learning algorithm that iteratively applies a splitting test on each mixture component. Experimental results and comparisons with two other …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CITATION: Smart administrations in the healthcare sector",
            "Publication year": 2003,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1460458203009002001",
            "Abstract": "CITATION (Citizen Information Tool in smart administrATIONs) provides an innovative                information platform for improving and promoting the provision of electronic                information in the health sector, ensuring that citizens have easy and direct access                to essential public data (administrative procedures, legislation and available                services). The system delivers mechanisms for the effective management,                customization and flexible delivery of administrative information. CITATION embraces                the initiative and effort to provide and promote health-related administrative                information, in the framework of local or national government services. It                facilitates the creation of `smart' governmental structures, capable of providing                citizens with customized, added-value services. CITATION emphasizes its efforts in                the advancement and integration of current …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:D_sINldO8mEC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Automatic discovery of the number of MUAP clusters and superimposed MUAP decomposition in electromyograms",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222504/",
            "Abstract": "A novel data driven method for needle EMG decomposition is presented. The method is capable of automatically detecting the number of MUAPs. Superimposed MUAPs are detected and decomposed automatically into their constituents. No a priori knowledge of the number of MUAPs is required. The method is evaluated using a dataset consisting of 8 normal, 8 suffering from myopathy and 7 suffering from neuropathy subjects. The success rate on finding the correct number of clusters was 95%, 89% and 80%, respectively.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A multivariate kurtosis-based approach to Gaussian mixture modeling",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.21.3700",
            "Abstract": "this paper we treat the multivariate case. We dene the multivariate weighted kurtosis of a component and use it as a test of multivariate normality after a theorem of Mardia (1970). For dynamic component allocation we use the VDM theorem of Lindsay (1983) along with partial EM steps, ensuring the monotone increase of the log-likelihood in each step. We demonstrate our method in synthetic and real datasets and compare with the EM solutions with xed number of components. Keywords: Gaussian mixture density estimation, number of components, EM algorithm, test of normality, multivariate kurtosis, VDM algorithm. Original version April 2000. This is a slightly modied version. A multivariate kurtosis-based approach to Gaussian mixture modeling CONTENTS Contents 1 Introduction 1 2 The EM algorithm for k-component Gaussian mixtures 2 2.1 EM, maximum likelihood, and model complexity...............",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Relevance Feedback for Content-Based Image Retrieval Using Support Vector Machines and Feature Selection",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04274-4_97",
            "Abstract": "A relevance feedback (RF) approach for content-based image retrieval (CBIR) is proposed, which is based on Support Vector Machines (SVMs) and uses a feature selection technique to reduce the dimensionality of the image feature space. Specifically, each image is described by a multidimensional vector combining color, texture and shape information. In each RF round, the positive and negative examples provided by the user are used to determine a relatively small number of the most important features for the corresponding classification task, via a feature selection methodology. After the feature selection has been performed, an SVM classifier is trained to distinguish between relevant and irrelevant images according to the preferences of the user, using the restriction of the user examples on the set of selected features. The trained classifier is subsequently used to provide an updated ranking of the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:rO6llkc54NcC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Ratio-based multiple kernel clustering",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44845-8_16",
            "Abstract": "Maximum margin clustering (MMC) approaches extend the large margin principle of SVM to unsupervised learning with considerable success. In this work, we utilize the ratio between the margin and the intra-cluster variance, to explicitly consider both the separation and the compactness of the clusters in the objective. Moreover, we employ multiple kernel learning (MKL) to jointly learn the kernel and a partitioning of the instances, thus overcoming the kernel selection problem of MMC. Importantly, the margin alone cannot reliably reflect the quality of the learned kernel, as it can be enlarged by a simple scaling of the kernel. In contrast, our ratio-based objective is scale invariant and also invariant to the type of norm constraints on the kernel parameters. Optimization of the objective is performed using an iterative gradient-based algorithm. Comparative clustering experiments on various datasets demonstrate …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:PoWvk5oyLR8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Use of a novel rule-based expert system in the detection of changes in the ST segment and the T wave in long duration ECGs",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/43397863/Use_of_a_novel_rule-based_expert_system_20160305-32341-h0v629.pdf",
            "Abstract": "The development of a new fast and robust computerised system is examined in detecting electrocardiogram (ECG) changes in long duration ECG recordings. The system distinguishes these changes between ST-segment deviation and T-wave alterations and can support the produced diagnosis by providing explanations for the decisions made. The European Society of Cardiology ST-T Database was used for evaluating the performance of the system. Sensitivity and positive predictive accuracy were the performance measures used and the proposed system scored 92.02% and 93.77%, respectively, in detecting ST-segment episodes and 91.09% and 80.09% in detecting T-wave episodes. By using the chi-square test we also compared the performance of the system between ECG recordings with minimal and substantial amount of noise. The sensitivity of the proposed system is higher than of other algorithms reported in the literature and the positive predictive accuracy is comparable to, or better than, most of them.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:hqOjcs7Dif8C",
            "Publisher": "South Burlington, Vt.: Research in Electrocardiology, Inc., 1968-"
        },
        {
            "Title": "An agglomerative approach for shot summarization based on content homogeneity",
            "Publication year": 2015,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9445/94451F/An-agglomerative-approach-for-shot-summarization-based-on-content-homogeneity/10.1117/12.2180531.short",
            "Abstract": "An efficient shot summarization method is presented based on agglomerative clustering of the shot frames. Unlike other agglomerative methods, our approach relies on a cluster merging criterion that computes the content homogeneity of a merged cluster. An important feature of the proposed approach is the automatic estimation of the number of a shot's most representative frames, called keyframes. The method starts by splitting each video sequence into small, equal sized clusters (segments). Then, agglomerative clustering is performed, where from the current set of clusters, a pair of clusters is selected and merged to form a larger unimodal (homogeneous) cluster. The algorithm proceeds until no further cluster merging is possible. At the end, the medoid of each of the final clusters is selected as keyframe and the set of keyframes constitutes the summary of the shot. Numerical experiments demonstrate that our …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:edDO8Oi4QzsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A variational approach for Bayesian blind image deconvolution",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1315942/",
            "Abstract": "In this paper, the blind image deconvolution (BID) problem is addressed using the Bayesian framework. In order to solve for the proposed Bayesian model, we present a new methodology based on a variational approximation, which has been recently introduced for several machine learning problems, and can be viewed as a generalization of the expectation maximization (EM) algorithm. This methodology reaps all the benefits of a \"full Bayesian model\" while bypassing some of its difficulties. We present three algorithms that solve the proposed Bayesian problem in closed form and can be implemented in the discrete Fourier domain. This makes them very cost effective even for very large images. We demonstrate with numerical experiments that these algorithms yield promising improvements as compared to previous BID algorithms. Furthermore, the proposed methodology is quite general with potential application …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Inverting video slide shows",
            "Publication year": 2019,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11041/110410N/Inverting-video-slide-shows/10.1117/12.2522704.short",
            "Abstract": "Video slide shows constitute a very frequent video type. Typically, in order to produce such a video, a series of still images are used and processed. We present a method to solve the video slide show inversion problem where we are given a video slide show and we wish to extract the sequence of still images that have been used to produce this video. Our approach relies on a fast and efficient key-frame extraction method that partitions the video into content homogeneous segments and extracts a representative key-frame for each video segment. An important characteristic of this method is that the number of key-frames is determined automatically. Next, the set of key-frames is further processed to solve various problems such as mixing of images, fade-in/fade-out and zooming effects that produce keyframes not belonging to the original image sequence, thus they must be detected and discarded. We provide …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:3htObqc8RwsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Interval analysis based neural network inversion: a means for evaluating generalization",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-65172-9_27",
            "Abstract": "Inversion of a neural network trained on some classification problem has been an important issue related to the explanation of the neural classification function. Inversion based on Interval Analysis (IA) [1] showed that a reliable estimation of the neural network domain of validity is feasible and a number of quantitative issues arise from this inversion. This paper deals with the investigation of these quantitative issues and more precisely with those concerning the evaluation of the neural network classification function in terms of generalization, comparison of different network models and classification accuracy. Preliminary experimental results indicate that the IA-based inversion can offer a solid basis towards reliable evaluation of the neural classification function.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:QYdC8u9Cj1oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Dip-means: an incremental clustering method for estimating the number of clusters",
            "Publication year": 2012,
            "Publication url": "http://www.cs.uoi.gr/~arly/full/conferences/C76.pdf",
            "Abstract": "Learning the number of clusters is a key problem in data clustering. We present dip-means, a novel robust incremental method to learn the number of data clusters that can be used as a wrapper around any iterative clustering algorithm of k-means family. In contrast to many popular methods which make assumptions about the underlying cluster distributions, dip-means only assumes a fundamental cluster property: each cluster to admit a unimodal distribution. The proposed algorithm considers each cluster member as an individual ‘viewer’and applies a univariate statistic hypothesis test for unimodality (dip-test) on the distribution of distances between the viewer and the cluster members. Important advantages are: i) the unimodality test is applied on univariate distance vectors, ii) it can be directly applied with kernel-based methods, since only the pairwise distances are involved in the computations. Experimental results on artificial and real datasets indicate the effectiveness of our method and its superiority over analogous approaches.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rigid Image Registration based on Pixel Grouping",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4362842/",
            "Abstract": "We propose a pixel similarity-based algorithm enabling accurate rigid registration between single and multimodal images. The method relies on the partitioning of a reference image by a Gaussian mixture model (GMM). This partition is then projected onto the image to be registered. The main idea is that a Gaussian component in the reference image corresponds to a Gaussian component in the image to be registered. If the images are correctly registered the total distance between the corresponding components is minimum. An advantage of the proposed method is that it may handle multidimensional (vector valued) images where histogram-based methods such as the widely used mutual information is not tractable due to the high dimension of the data. Also, experimental results indicate that, even in the case of images presenting low SNR, the proposed algorithm compares favorably to the histogram-based …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A significance-based graph model for clustering web documents",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_58",
            "Abstract": "Traditional document clustering techniques rely on single-term analysis, such as the widely used Vector Space Model. However, recent approaches have emerged that are based on Graph Models and provide a more detailed description of document properties. In this work we present a novel Significance-based Graph Model for Web documents that introduces a sophisticated graph weighting method, based on significance evaluation of graph elements. We also define an associated similarity measure based on the maximum common subgraph between the graphs of the corresponding web documents. Experimental results on artificial and real document collections using well-known clustering algorithms indicate the effectiveness of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "The global k-means clustering algorithm",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0031320302000602",
            "Abstract": "We present the global k-means algorithm which is an incremental approach to clustering that dynamically adds one cluster center at a time through a deterministic global search procedure consisting of N (with N being the size of the data set) executions of the k-means algorithm from suitable initial positions. We also propose modifications of the method to reduce the computational load without significantly affecting solution quality. The proposed clustering methods are tested on well-known data sets and they compare favorably to the k-means algorithm with random restarts.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A neural network methodology for ischemia detection in long duration electrocardiograms",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15434416584706010574&hl=en&oi=scholarr",
            "Abstract": "The development oían artificial neural network model is studied for the classification of the cardiac beats as ischaemic or not. The network is designed to be part of a more general algorithmic schema, which detects ischaemic episodes in long duration electrocardiographic recordings. An interval from the recorded signal containing both the ST segment and the T wave is the input to'-e network. Due to the large dimension ûf the input vector, principal component analysis was adopted and any redundant features were eliminated. Different teed-forward neural network architectures were examined after modifying the number of nodes in the hidden and input layers. Also, various algorithms were applied for network training. A task specific cardiac beat database was developed in collaboration with three medicai experts in order to perform network training and testing. This database contains excerpts from the European …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An ultrasound wearable system for the monitoring and acceleration of fracture healing in long bones",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1495704/",
            "Abstract": "An ultrasound wearable system for remote monitoring and acceleration of the healing process in fractured long bones is presented. The so-called USBone system consists of a pair of ultrasound transducers, implanted into the fracture region, a wearable device and a centralized unit. The wearable device is responsible to carry out ultrasound measurements using the axial-transmission technique and initiate therapy sessions of low-intensity pulsed ultrasound. The acquired measurements and other data are wirelessly transferred from the patient-site to the centralized unit, which is located in a clinical setting. The evaluation of the system on an animal tibial osteotomy model is also presented. A dataset was constructed for monitoring purposes consisting of serial ultrasound measurements, follow-up radiographs, quantitative computed tomography-based densitometry and biomechanical data. The animal study …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Electrocardiogram (ECG): automated diagnosis",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9780471740360.ebs0382",
            "Abstract": "Electrocardiogram (ECG) is one of the most common signals used in medical practice because of its noninvasive nature and the information it contains. Its analysis can be used to assess the pathophysiological condition of the heart. Several systems for ECG recording and analysis have been developed for more than a century. Early ECG systems included recording and printing of the signal. Modern systems use computer technology to provide automated diagnosis. The latter is a significant research field and many methods and approaches have been proposed for the detection of ischemia, arrhythmia detection and classification, and diagnosis of chronic myocardial diseases. Those methods are based on the processing of the signal to remove noise and artifacts, extraction of certain features related to diseases, and analysis of the features to obtain the final decision. The analysis is usually based on signal …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:M3NEmzRMIkIC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Scene detection in videos using shot clustering and sequence alignment",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4721597/",
            "Abstract": "Video indexing requires the efficient segmentation of video into scenes. The video is first segmented into shots and a set of key-frames is extracted for each shot. Typical scene detection algorithms incorporate time distance in a shot similarity metric. In the method we propose, to overcome the difficulty of having prior knowledge of the scene duration, the shots are clustered into groups based only on their visual similarity and a label is assigned to each shot according to the group that it belongs to. Then, a sequence alignment algorithm is applied to detect when the pattern of shot labels changes, providing the final scene segmentation result. In this way shot similarity is computed based only on visual features, while ordering of shots is taken into account during sequence alignment. To cluster the shots into groups we propose an improved spectral clustering method that both estimates the number of clusters and …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Text document clustering using global term context vectors",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-011-0412-6",
            "Abstract": "Despite the advantages of the traditional vector space model (VSM) representation, there are known deficiencies concerning the term independence assumption. The high dimensionality and sparsity of the text feature space and phenomena such as polysemy and synonymy can only be handled if a way is provided to measure term similarity. Many approaches have been proposed that map document vectors onto a new feature space where learning algorithms can achieve better solutions. This paper presents the global term context vector-VSM (GTCV-VSM) method for text document representation. It is an extension to VSM that: (i) it captures local contextual information for each term occurrence in the term sequences of documents; (ii) the local contexts for the occurrences of a term are combined to define the global context of that term; (iii) using the global context of all terms a proper semantic matrix is …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Probabilistic shape-based image indexing and retrieval",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1334420/",
            "Abstract": "In this paper we present a probabilistic framework for shape-based indexing and retrieval of images, in our framework shape-based features are extracted from each image and then a statistical model of the image is constructed using an effective deterministic method for Gaussian mixture modeling. In this way, each image is finally represented as a mixture of Gaussians and shape-based similarity between images is computed by measuring the distance between the corresponding mixture distributions. Several distance measures are presented and experimentally compared. Experimental results on the retrieval of logo images indicate that the method is very effective and exhibits robustness to the presence of various types of edge-related noise in the query image.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Reinforcement Learning Approach",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Aristidis-Likas/publication/2650827_A_Reinforcement_Learning_Approach_to_On-line_Clustering/links/543bae600cf24a6ddb978466/A-Reinforcement-Learning-Approach-to-On-line-Clustering.pdf",
            "Abstract": "A general technique is proposed for embedding on-line clustering algorithms based on competitive learning in a reinforcement learning framework. The basic idea is that the clustering system can be viewed as a reinforcement learning system that learns through reinforcements to follow the clustering strategy we wish to implement. In this sense, the RGCL (Reinforcement Guided Competitive Learning) algorithm is proposed that constitutes a reinforcement-based adaptation of LVQ with enhanced clustering capabilities. In addition, we suggest extensions of RGCL and LVQ that are characterized by the property of sustained exploration and signi cantly improve the performance of those algorithms as indicated by experimental tests on well-known datasets.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semi-supervised and active learning with the probabilistic RBF classifier",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231208002117",
            "Abstract": "The probabilistic RBF network (PRBF) is a special case of the RBF network and constitutes a generalization of the Gaussian mixture model. In this paper we propose a semi-supervised learning method for PRBF, using labeled and unlabeled observations concurrently, that is based on the expectation–maximization (EM) algorithm. Next we utilize this method in order to implement an incremental active learning method. At each iteration of active learning, we apply the semi-supervised method, and then we employ a criterion to select an unlabeled observation and query its label. This criterion identifies points near the decision boundary. In order to assess the effectiveness of our method, we propose an adaptation of the well-known Query by Committee (QBC) algorithm for the active learning of the PBFR, and present experimental comparisons on several data sets that indicate the effectiveness of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "CITATION: semantics-based information modeling for the healthcare administration sector",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222482/",
            "Abstract": "The CITATION system implements an information brokerage environment for effective information structuring, indexing and retrieval in the healthcare administration sector. CITATION incorporates the latest evolvements in the fields of ontology modeling, natural language processing, XML documents self-describing features, semantics analysis and behavioral description to allow for seamless and personalized information delivery and for adequate representation of the semantics of the existing healthcare administrative information content.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An intelligent system for the provision of personalized dietary plans and health monitoring",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222440/",
            "Abstract": "We present an intelligent web-based system, called h-Life, which addresses the monitoring and improvement of health and lifestyle through the provision of customized dietary plans. Additional plan-related services including monitoring, alerting, reminding and evaluation, complement the functionality of the h-Life system. Several innovative components are integrated in order to efficiently manage the storage, access and retrieval of medical and personal data. Based on the latest technologies in intelligent and communication systems, the system provides the user with personalized dietary plans and lifestyle information, tailored to the individual needs. The h-Life system is based on a scalable and interoperable architecture that can be easily extended to accommodate future needs. Apart from a personal health assistant for the end-users, h-Life is a valuable tool for the health professionals that can remotely monitor …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling sets of unordered points using highly eccentric ellipses",
            "Publication year": 2014,
            "Publication url": "https://asp-eurasipjournals.springeropen.com/articles/10.1186/1687-6180-2014-11",
            "Abstract": "An algorithm for modeling a set of unordered two-dimensional points by line segments is presented. The points are modeled by highly eccentric ellipses, and line segments are extracted by the major axes of these elongated ellipses. At first, a single ellipse is fitted to points which is then iteratively split to a large number of highly eccentric ellipses to cover the set of points. Then, a merge process follows in order to combine neighboring ellipses with almost collinear major axes to reduce the complexity of the model. Experimental results on various databases show that the proposed scheme is an efficient technique for modeling unordered sets of points and shapes by line segments. A computer vision application of the method is also presented regarding the detection of retinal fundus image features, such as end-points, junctions, and crossovers.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:VaXvl8Fpj5cC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Citizen information tool in smart administration",
            "Publication year": 2002,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=mgFtCQAAQBAJ&oi=fnd&pg=PA307&dq=info:O9KJhx6MDSkJ:scholar.google.com&ots=x8n4tCI-T0&sig=elE-rAGVaHodFqzjaSuEiie9ewg",
            "Abstract": "CITATION is an innovative software platform designed to facilitate access to administrative information sources by providing effective information structure, indexing and retrieval. CITATION improves electronic government services, ensuring that citizens have easy and direct access to essential public data and promoting online interaction between citizens and government. It targets the improvement of administration services offered by governments and therefore the creation of “smart” and flexible government structures that will be able to provide their citizens with precise and personalised information.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:artPoR2Yc-kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Document clustering using synthetic cluster prototypes",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169023X10001515",
            "Abstract": "The use of centroids as prototypes for clustering text documents with the k-means family of methods is not always the best choice for representing text clusters due to the high dimensionality, sparsity, and low quality of text data. Especially for the cases where we seek clusters with small number of objects, the use of centroids may lead to poor solutions near the bad initial conditions. To overcome this problem, we propose the idea of synthetic cluster prototype that is computed by first selecting a subset of cluster objects (instances), then computing the representative of these objects and finally selecting important features. In this spirit, we introduce the MedoidKNN synthetic prototype that favors the representation of the dominant class in a cluster. These synthetic cluster prototypes are incorporated into the generic spherical k-means procedure leading to a robust clustering method called k-synthetic prototypes (k-sp …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:JV2RwH3_ST0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Combination of high-resolution magic angle spinning proton magnetic resonance spectroscopy and microscale genomics to type brain tumor biopsies",
            "Publication year": 2007,
            "Publication url": "https://www.spandidos-publications.com/ijmm/20/2/199",
            "Abstract": "Advancements in the diagnosis and prognosis of brain tumor patients, and thus in their survival and quality of life, can be achieved using biomarkers that facilitate improved tumor typing. We introduce and implement a combinatorial metabolic and molecular approach that applies state-of-the-art, high-resolution magic angle spinning (HRMAS) proton (1H) MRS and gene transcriptome profiling to intact brain tumor biopsies, to identify unique biomarker profiles of brain tumors. Our results show that samples as small as 2 mg can be successfully processed, the HRMAS 1H MRS procedure does not result in mRNA degradation, and minute mRNA amounts yield high-quality genomic data. The MRS and genomic analyses demonstrate that CNS tumors have altered levels of specific 1H MRS metabolites that directly correspond to altered expression of Kennedy pathway genes; and exhibit rapid phospholipid turnover …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:UebtZRa9Y70C",
            "Publisher": "Heraklion, Greece: DA Spandidos, c [1998-"
        },
        {
            "Title": "Image modeling and segmentation using incremental Bayesian mixture models",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74272-2_74",
            "Abstract": "Many image modeling and segmentation problems have been tackled using Gaussian Mixture Models (GMM). The two most important issues in image modeling using GMMs is the selection of the appropriate low level features and the specification of the appropriate number of GMM components. In this work we deal with the second issue and present an approach for GMM-based image modeling employing an incremental variational algorithm for Bayesian GMM training that automatically specifies the number of mixture components. Experimental results on natural and texture images indicate that the method yields reasonable models without requiring the a priori specification of the number of components.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Region merging for image segmentation based on unimodality tests",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942722/",
            "Abstract": "A novel approach is proposed for image segmentation based on region merging. We define a new criterion to decide on whether to merge two regions that does not require the specification of user defined thresholds. The method begins with an image oversegmentation (based on SLIC superpixels) into small homogeneous regions. At each step regions are iteratively merged to form larger regions based on the result of a merge test that measures unimodality as an indication of visual content homogeneity. More specifically, the merge test employs the dip-dist criterion that decides on the unimodality of a set of data objects through the application of the Hardigans' dip-test for unimodality. We propose a fast version of the dip-dist criterion, where the two feature centroids of the regions to be merged are used to decide on the unimodality of the region that results from merging. To demonstrate the performance of the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:mlAyqtXpCwEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An active learning approach for training the probabilistic RBF classification network",
            "Publication year": 2006,
            "Publication url": "https://www.scitepress.org/Papers/2006/12228/12228.pdf",
            "Abstract": "Active learning for classification constitutes a type of learning problem where a classifier is gradually built by iteratively asking for the labels of data points. The method involves a data selection mechanism that queries for the labels of those data points that considers to be mostly beneficial for improving the performance of the current classifier. We present an active learning methodology for training the probabilistic RBF (PRBF) network which is a special case of the RBF network, and constitutes a generalization of the Gaussian mixture model. The method employs a suitable criterion to select an unlabeled observation and query its label. The proposed criterion selects points that lie near the decision boundary. The learning performance of the algorithm is tested with experiments on several data sets.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:HeT0ZceujKMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The projected dip-means clustering algorithm",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201008",
            "Abstract": "One of the major research issues in data clustering concerns the estimation of number of clusters. In previous work, the dip-means clustering algorithm has been proposed as a successful attempt to tackle this problem. Dip-means is an incremental clustering algorithm that uses a statistical criterion called dip-dist to decide whether a set of data objects constitutes a homogeneous cluster or it contains subclusters. The novel aspect of dip-dist is the introduction of the notion of data unimodality when deciding for cluster compactness and homogeneity. More specifically, the use of dip-dist criterion for a set of data objects requires the application of a univariate statistic hypothesis test for unimodality (the so called dip-test) on each row of the distance (or similarity) matrix containing the pairwise distances between the data objects. In this work, we propose an alternative criterion for deciding on the homogeneity of a set of …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:DJbcl8HfkQkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multivariate gaussian mixture modeling with unknown number of components",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.34.3810",
            "Abstract": "CiteSeerX — Multivariate Gaussian mixture modeling with unknown number of components \nDocuments Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo \nDocuments: Advanced Search Include Citations Authors: Advanced Search Include \nCitations Tables: DMCA Multivariate Gaussian mixture modeling with unknown number of \ncomponents Cached Download as a PDF Download Links [carol.wins.uva.nl] Save to List \nAdd to Collection Correct Errors Monitor Changes by Nikos Vlassis , Aristidis Likas , Ben \nKröse Summary Citations Active Bibliography Co-citation Clustered Documents Version \nHistory Share Facebook Twitter Reddit Bibsonomy OpenURL Abstract We are dealing with \nthe problem of Gaussian mixture density estimation with... Keyphrases multivariate \ngaussian mixture unknown number gaussian mixture density estimation Powered by: \nApache Solr About CiteSeerX Submit and Index …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating particle swarm optimization with reinforcement learning in noisy problems",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2330163.2330173",
            "Abstract": "Noisy optimization problems arise very often in real-life applications. A common practice to tackle problems characterized by uncertainties, is the re-evaluation of the objective function at every point of interest for a fixed number of replications. The obtained objective values are then averaged and their mean is considered as the approximation of the actual objective value. However, this approach can prove inefficient, allocating replications to unpromising candidate solutions. We propose a hybrid approach that integrates the established Particle Swarm Optimization algorithm with the Reinforcement Learning approach to efficiently tackle noisy problems by intelligently allocating the available computational budget. Two variants of the proposed approach, based on different selection schemes, are assessed and compared against the typical alternative of equal sampling. The results are reported and analyzed, offering …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated ischemic beat classification using genetic algorithms and multicriteria decision analysis",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1337140/",
            "Abstract": "Cardiac beat classification is a key process in the detection of myocardial ischemic episodes in the electrocardiographic signal. In the present study, we propose a multicriteria sorting method for classifying the cardiac beats as ischemic or not. Through a supervised learning procedure, each beat is compared to preclassified category prototypes under five criteria. These criteria refer to ST segment changes, T wave alterations, and the patient's age. The difficulty in applying the above criteria is the determination of the required method parameters, namely the thresholds and weight values. To overcome this problem, we employed a genetic algorithm, which, after proper training, automatically calculates the optimum values for the above parameters. A task-specific cardiac beat database was developed for training and testing the proposed method using data from the European Society of Cardiology ST-T database …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A note on a new greedy-solution representation and a new greedy parallelizable heuristic for the traveling salesman problem",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077900002277",
            "Abstract": "A new approach is presented to the traveling salesman problem (TSP) relying on a novel greedy representation of the solution space and leading to a different definition of neighborhood structures required in many local and random search approaches. Accordingly, a parallelizable search strategy is proposed based upon local search with random restarts that exploits the characteristics of the representation. Preliminary experimental results on several sets of test problems, among which very well-known benchmarks, show that the representation developed, matched with the search strategy proposed, attains high quality near-optimal solutions in moderate execution times.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:RGFaLdJalmkC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "An intelligent system for the early diagnosis of coronary artery disease",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15879334887503994238&hl=en&oi=scholarr",
            "Abstract": ". BS ‘I ‘R.~'tCT: In Lhis paper we present and compare several approaches for the design of an intelligent system for the early diagnosis of coronary artery disease. The aim of our iivorir is the development of an innovative nor:-invasivt: methodology for the early diagnosis and monitoring of coronary artery disease based on the evaluation of rislt factors and vascular status indices. A database was set up consisting of 139 patients without medical history of coronary artery disease. each patient record containing, 24 attributes. The data are preprocessed using Principal Component.-analysis and several methods are used for classification. such as artiﬁcial neural networks {lvILP ‘. REF}. support vector machines {SVM}. fuzzy neural networks {fuzzy-. aiRTl-“l. ﬁiP}. probabilistic belief nctvrorl-rs and decision tree learning algorithms. The problem of missing values in the input data is addressed and the diagnostic value of the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:Mojj43d5GZwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Probabilistic relevance feedback approach for content-based image retrieval based on gaussian mixture models",
            "Publication year": 2009,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-ipr_20080012",
            "Abstract": "A new relevance feedback (RF) approach for content-based image retrieval is presented. This approach uses Gaussian mixture (GM) models of the image features and a query that is updated in a probabilistic manner. This update reflects the preferences of the user and is based on the models of both the positive and negative feedback images. The retrieval is based on a recently proposed distance measure between probability density functions, which can be computed in closed form for GM models. The proposed approach takes advantage of the form of this distance measure and updates it very efficiently based on the models of the user-specified relevant and irrelevant images. It is also shown that this RF framework is fairly general and can be applied in case other image models or distance measures are used instead of those proposed in this work. Finally, comparative numerical experiments are provided, which …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:wbdj-CoPYUoC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "An analytic distance metric for Gaussian mixture models with application in image retrieval",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11550907_132",
            "Abstract": "In this paper we propose a new distance metric for probability density functions (PDF). The main advantage of this metric is that unlike the popular Kullback-Liebler (KL) divergence it can be computed in closed form when the PDFs are modeled as Gaussian Mixtures (GM). The application in mind for this metric is histogram based image retrieval. We experimentally show that in an image retrieval scenario the proposed metric provides as good results as the KL divergence at a fraction of the computational cost. This metric is also compared to a Bhattacharyya-based distance metric that can be computed in closed form for GMs and is found to produce better results.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Greedy mixture learning for multiple motif discovery in biological sequences",
            "Publication year": 2003,
            "Publication url": "https://academic.oup.com/bioinformatics/article-abstract/19/5/607/239393",
            "Abstract": "Motivation: This paper studies the problem of discovering subsequences,  known as  motifs, that are common to a given collection of related biosequences, by proposing a greedy algorithm for learning a mixture of motifs model through  likelihood maximization. The approach adds sequentially a new motif to a  mixture model by performing a combined scheme of global and local search for  appropriately initializing its parameters. In addition, a hierarchical  partitioning scheme based on kd-trees is presented for partitioning the input dataset in order to speed-up the global searching procedure. The proposed method compares favorably over the well-known MEME  approach and treats successfully several drawbacks of MEME.Results: Experimental results indicate that the algorithm is  advantageous in identifying larger groups of motifs  characteristic of biological families with significant conservation. In …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:W7OEmFMy1HYC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "CHILDCARE: a collaborative environment for the monitoring of children healthcare at home",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1222501/",
            "Abstract": "This paper provides an overview of the concept, the functionalities and the architecture of the CHILDCARE platform. The CHILDCARE system aims at supporting the out-of-hospital continuous healthcare management of chronically ill children. Special focus is placed on the utilization of the latest technology accomplishments towards the incorporation of teleconference sessions, collaborative spaces and intelligent add-ons over a common secure platform. This combination allows for: (a) remote communication between health experts and the child's family, (b) efficient collaboration between the responsible doctor and healthcare professionals, (c) interfacing legacy hospital information systems to obtain health records, (d) set-up, execution and monitoring of health management plans, (e) ubiquitous access from multiple devices, (f) role-based management of the actors with respect to their actual involvement in the …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A relevance feedback approach for content based image retrieval using Gaussian mixture models",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11840930_9",
            "Abstract": "In this paper a new relevance feedback (RF) methodology for content based image retrieval (CBIR) is presented. This methodology is based on Gaussian Mixture (GM) models for images. According to this methodology, the GM model of the query is updated in a probabilistic manner based on the GM models of the relevant images, whose relevance degree (positive or negative) is provided by the user. This methodology uses a recently proposed distance metric between probability density functions (pdfs) that can be computed in closed form for GM models. The proposed RF methodology takes advantage of the structure of this metric and proposes a method to update it very efficiently based on the GM models of the relevant and irrelevant images characterized by the user. We show with experiments the merits of the proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Efficient video shot summarization using an enhanced spectral clustering approach",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87536-9_87",
            "Abstract": "Video summarization is a powerful tool to handle the huge amount of data generated every day. At shot level, the key-frame extraction problem provides sufficient indexing and browsing of large video databases. In this paper we propose an approach that estimates the number of key-frames using elements of the spectral graph theory. Next, the frames of the video sequence are clustered into groups using an improved version of the spectral clustering algorithm. Experimental results show that our algorithm efficiently summarizes the content of a video shot producing unique and representative key-frames outperforming other methods.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Relevance feedback approach for image retrieval combining support vector machines and adapted Gaussian mixture models",
            "Publication year": 2011,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/iet-ipr.2009.0402",
            "Abstract": "A new relevance feedback (RF) approach for content-based image retrieval (CBIR) is presented, which uses Gaussian mixture (GM) models as image representations. The GM of each image is obtained as an adaptation of a universal GM which models the probability distribution of the features of the image database. In each RF round, the positive and negative examples provided by the user until the current round are used to train a support vector machine (SVM) to distinguish between the relevant and irrelevant images according to the preferences of the user. In order to quantify the similarity between two images represented as GMs, Kullback–Leibler (KL) approximations are employed, the computation of which can be further accelerated taking advantage from the fact that the GMs of the images are all refined from a common model. An appropriate kernel function, based on this distance between GMs, is used to …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:N5tVd3kTz84C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A boosting approach to clustering",
            "Publication year": 2003,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/26611",
            "Abstract": "A boosting approach to clustering Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ Ιδρυματικό \nΑποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση Τεκμηρίου HEAL DSpace A \nboosting approach to clustering Αποθετήριο DSpace/Manakin A boosting approach to clustering \nFrossyniotis, D; Likas, A; Stafylopatis, A URI: http://hdl.handle.net/123456789/26611 Ημερομηνία: \n2003 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο \nΠροβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο \nεμφανίζεται στην ακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Περιήγηση Σε \nόλο το DSpace Κοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα \nΑυτή η Συλλογή Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο Λογαριασμός μου \nΣύνδεση Εγγραφή Οδηγίες / Βοήθεια Οδηγίες Υποβολής Οδηγίες Χρήσης ΙΑ Συχνές Οδηγίες …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A sequential method for discovering probabilistic motifs in proteins",
            "Publication year": 2004,
            "Publication url": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0038-1633414",
            "Abstract": "  Objectives:  This paper proposes a greedy algorithm for learning a mixture of motifs model through likelihood maximization, in order to discover common substrings, known as motifs, from a given collection of related biosequences.  Methods:  The approach sequentially adds a new motif component to a mixture model by performing a combined scheme of global and local search for appropriately initializing the component parameters. A hierarchical clustering scheme is also applied initially which leads to the identification of candidate motif models and speeds up the global searching procedure.  Results:  The performance of the proposed algorithm has been studied in both artificial and real biological datasets. In comparison with the well-known MEME approach, the algorithm is advantageous since it identifies motifs with significant conservation and produces larger protein fingerprints …",
            "Abstract entirety": 0,
            "Author pub id": "kb39Kx0AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Schattauer GmbH"
        },
        {
            "Title": "Artificial Intelligence: Methods and Applications: 8th Hellenic Conference on AI, SETN 2014, Ioannina, Greece, May, 15-17, 2014, Proceedings",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=NFm7BQAAQBAJ&oi=fnd&pg=PR5&dq=info:8q4DPVlNiv4J:scholar.google.com&ots=YCjb1L0OwA&sig=VK1TLLLSoeDjmksd6GR45fxqrVc",
            "Abstract": "This book constitutes the proceedings of the 8th Hellenic Conference on Artificial Intelligence, SETN 2014, held in Ioannina, Greece, in May 2014. There are 34 regular papers out of 60 submissions, in addition 5 submissions were accepted as short papers and 15 papers were accepted for four special sessions. They deal with emergent topics of artificial intelligence and come from the SETN main conference as well as from the following special sessions on action languages: theory and practice; computational intelligence techniques for bio signal Analysis and evaluation; game artificial intelligence; multimodal recommendation systems and their applications to tourism.",
            "Abstract entirety": 1,
            "Author pub id": "kb39Kx0AAAAJ:Dip1O2bNi0gC",
            "Publisher": "Springer"
        }
    ]
}]