[{
    "name": "Βασίλειος Ζησιμόπουλος",
    "romanize name": "Vasileios Zisimopoulos",
    "School-Department": "Πληροφορικής & Τηλεπικοινωνιών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 9507,
    "Scholar name": "Ioannis Zisimopoulos",
    "Scholar id": "2Pjs6TkAAAAJ",
    "Affiliation": "University of Patras",
    "Citedby": 21,
    "Interests": [
        "Industrial Relations"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=2Pjs6TkAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The economic crisis and industrial relations: Greece and Romania in comparison",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Zisimopoulos/publication/326126048_The_economic_crisis_and_industrial_relations_Greece_and_Romania_in_comparison/links/5b3a1cf7a6fdcc8506e7c4db/The-economic-crisis-and-industrial-relations-Greece-and-Romania-in-comparison.pdf",
            "Abstract": "The purpose of this study is to investigate, in a comparative framework, the impact of the adjustment programs (Memoranda) in Greece and Romania, in the context of the global economic crisis. In Greece the crisis emerged as a twin (trade and fiscal) deficits crisis and in Romania it has taken the form of a public debt crisis. As a result, in Greece the austerity policy has directly affected employees both in private and public sectors, while in Romania it has focused in public servants. The decentralization of the collective bargaining system is a common feature in both countries. In Greece, decentralization occurs through the complete undermining of sectoral collective bargaining (decentralized decentralization), while in Romania through the weakening of the sectoral collective bargaining in favour of collective bargaining at enterprise level. The structure of employment in both countries determines the outcome of the process of decentralization.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decentralization of collective bargaining system in Greece: between dismantling, survival and restoration",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Zisimopoulos/publication/333984810_DECENTRALIZATION_OF_COLLECTIVE_BARGAINING_SYSTEM_IN_GREECE_BETWEEN_DISMANTLING_SURVIVAL_AND_RESTORATION/links/5d1132aa92851cf44049313a/DECENTRALIZATION-OF-COLLECTIVE-BARGAINING-SYSTEM-IN-GREECE-BETWEEN-DISMANTLING-SURVIVAL-AND-RESTORATION.pdf",
            "Abstract": "Until the current economic crisis, the vast majority of the wage labour in Greece was covered by collective bargaining and collective agreements at sectoral/occupational level. During the crisis period the collective bargaining system has been radically transformed through a process of disorganized decentralization, as a result of the policy of “internal devaluation” imposed by the European Commission, the European Central Bank and the International Monetary Fund. The collective agreements at sectoral/occupational level have been undermined in favour of individual contracts. The latter have contained worse terms and have been concluded by over one million salaried employees. Nevertheless, a restricted number of sectoral/occupational collective agreements has survived during this period. In this context, the present paper aspires to contribute to the analysis of the collective bargaining system transformation. Moreover, the determinants of the survival of these few collective agreements and the prospects of restoration for sectoral/occupational collective agreements at national level are examined by focusing on the sector distribution of collective contracts that have survived.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The class dimension of the Greek public debt crisis",
            "Publication year": 2018,
            "Publication url": "https://brill.com/view/book/edcoll/9789004280892/BP000004.xml",
            "Abstract": "The global economic crisis turned part of the private debt into public debt, which has led to a crisis of insolvency, due to soaring interest rates. Thus, the global crisis appears to be a public debt crisis, which, for the first time after World War II, has affected the advanced capitalist social formations to a great extent. 1 The gross public debt in the advanced economies continued to grow as a percentage of the Gross Domestic Product (GDP), exceeding 100% for the first time in 2011. In the European Union (EU) and the Eurozone, the gross public debt has increased considerably in recent years. However, the Greek public debtasapercentageof GDPismuchhigherthantheEUandtheEurozonepublic debt, and has seriously deteriorated in the last few years. 2 At the same time, the Greek economy faces a high and growing gross external debt (of both the private and the public sectors). 3Before the recent debt crisis and deep …",
            "Abstract entirety": 0,
            "Author pub id": "2Pjs6TkAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Brill"
        },
        {
            "Title": "Greek Industrial Relations: the impact of public sector's restructuring",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=12173614658982032810&hl=en&oi=scholarr",
            "Abstract": "The Greek economic crisis and the accession of Greece to the support mechanism, which has been set up by the European Commission, the European Central Bank and the International Monetary Fund, have accelerated the reformation of Greek Industrial Relations. The reformation of institutional and legal framework of labour relations concerns both private and public sector employees. The purpose of this paper is to examine the quality and the extent of the main changes taking place during the current economic crisis that are related specifically to the reformation of industrial relations in the public sector. In this context the main changes in the legal framework, which contributes to the reformation of the industrial relations of public sector, are analyzed. The analysis focuses on the redundancy scheme in the narrow public sector and the privatization of parts of the wider public sector (public utilities-DEKO). The …",
            "Abstract entirety": 0,
            "Author pub id": "2Pjs6TkAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The class composition of trade union movement in Greece: an empirical investigation",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Zisimopoulos/publication/334725989_The_class_composition_of_trade_union_movement_in_Greece_an_empirical_investigation_GREEK_ASSOCIATION_OF_POLITICAL_ECONOMY_Discussion_Paper_Series_DP_2019-2_ISSN_2654-0738/links/5d3c936e299bf1995b508717/The-class-composition-of-trade-union-movement-in-Greece-an-empirical-investigation-GREEK-ASSOCIATION-OF-POLITICAL-ECONOMY-Discussion-Paper-Series-DP-2019-2-ISSN-2654-0738.pdf",
            "Abstract": "The purpose of this paper is to investigate the class composition of the trade union movement in Greece. More precisely, we investigate in which social classes the members of trade unions belong and which social classes present higher level of union density within the wage labour. For the determination of social classes, the Marxist theory of the modes of production is adopted. The analysis is based on primary data that collected in the second quarter of 2018 by the method of semi-structured interview. The population is all employees who potentially are members of trade unions, ie the wage labour in Greece, and the sample is composed of 651 questionnaires. From the data analysis the hegemony of the new petty bourgeoisie within the trade union movement is derived. The new petty bourgeoisie–and especially that part formed within the state mechanism–is showing higher levels of union density.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Industrial Relations in Greece: Before, during and beyond the economic crisis",
            "Publication year": 2019,
            "Publication url": "https://www.academia.edu/download/64732484/EWJEB_XXII_2019_No2_81_108_ZISIMOPOULOS_.pdf",
            "Abstract": "In this paper we examine the transformation of industrial relations in Greece during the memoranda and after their official expiry. We argue that during the memoranda period, a process of “disorganized decentralization” of the collective bargaining system took place. This process was consolidated after the official expiry of the memoranda, through the legislation of the use of “opening clauses”. The consequences of the decentralization are the drastic reduction of collective agreements at the sectoral/occupational level, the reduction of the collective bargaining coverage rate, the increase of the individual contracts and the deterioration of the terms and working conditions of employees. These changes occurred in a conjuncture of the trade union movement’s weakening, and of the barriers for the development of collective action that have been legislated by the state. We argue that at this set of circumstances, the political and organizational reconstruction of the trade union movement is urgent.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Impact of Macroeconomic Factors on FDI Attractiveness: Romania, Slovakia and Greece in Comparison",
            "Publication year": 2019,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/22892/1007269.pdf?sequence=1#page=135",
            "Abstract": "The aim of this contribution is to investigate the key macroeconomic factors that may affect inward FDI in rather small European economies, such as Romania, Slovakia and Greece, which are all at a different level in their process of European integration. Romania and Slovakia are both economies in transition. Romania is a member of the EU but still not a member of the EMU while Slovakia and Greece are both members of the EU and the EMU.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Sectoral distribution of collective agreements in a decentralized collective bargaining system",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=uKLEDwAAQBAJ&oi=fnd&pg=PA47&dq=info:TbOCsK5Ur08J:scholar.google.com&ots=O9kgm6C8I4&sig=xCSl4OUEpbVnTUl81ccGsnBvQBg",
            "Abstract": "Until the current economic crisis, the vast majority of the wage labour in Greece was covered by collective bargaining and collective agreements at sectoral/occupational level. During the crisis period the collective bargaining system has been radically transformed through a process of disorganized decentralization, as a result of the policy of “internal devaluation” imposed by the European Commission, the European Central Bank and the International Monetary Fund. The collective agreements at sectoral/occupational level have been undermined. Nevertheless, a restricted number of sectoral/occupational collective agreements has survived during this period. In this context, the present paper aspires to contribute to the analysis of the collective bargaining system transformation by focusing on the sectoral distribution of collective contracts that have survived.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:IjCSPb-OGe4C",
            "Publisher": "London: IJOPEC Publication"
        },
        {
            "Title": "The Class Configuration of Wage Labour in Greece: Changes During the Recent Economic Crisis",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=l_iCDwAAQBAJ&oi=fnd&pg=PA41&dq=info:iXDWaSxPQqIJ:scholar.google.com&ots=9zPM8XlRdK&sig=A79qXrMUjxCAx9JYMGbNb-gHAaU",
            "Abstract": "In a recent study of the Labour Institute of General Confederation of Greek Workers (INE-GSEE), the class configuration of the Greek social formation during the period 2006-2014 has been identified on the basis of the Marxist theory of modes of production. Taking advantage of the results of that study, the purpose of the present paper is to investigate in particular the class configuration of salaried classes in Greece, as well as the changes that occurred in the period of the recent economic crisis. Data analysis shows that salaried social classes as a whole have been shrunk in absolute terms, while the supervision of the working class in the capitalist production process has been increased.",
            "Abstract entirety": 1,
            "Author pub id": "2Pjs6TkAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        }
    ]
}]