[{
    "name": "Βασίλης Χριστοφίδης",
    "romanize name": "Vasilis Christofidis",
    "School-Department": "Επιστήμης Υπολογιστών",
    "University": "uoc",
    "Rank": "Καθηγητής",
    "Apella_id": 6780,
    "Scholar name": "Vassilis Christophides",
    "Scholar id": "MdUjsa8AAAAJ",
    "Affiliation": "École Nationale Supérieure de l'Électronique et de ses Applications (ENSEA)",
    "Citedby": 6942,
    "Interests": [
        "Data Management",
        "Data Science",
        "Web Information Systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=MdUjsa8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On the synthetic generation of semantic web schemas",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-70960-2_6",
            "Abstract": "In order to cope with the expected size of the Semantic Web (SW) in the coming years, we need to benchmark existing SW tools (e.g., query language interpreters) in a credible manner. In this paper we present the first RDFS schema generator, termed PoweRGen, which takes into account the morphological features that schemas frequently exhibit in reality. In particular, we are interested in generating synthetically the two core components of an RDFS schema, namely the property (relationships between classes or attributes) and the subsumption (subsumption relationships among classes) graph. The total-degree distribution of the former, as well as the out-degree distribution of the Transitive Closure (TC) of the latter, usually follow a power-law. PoweRGen produces synthetic property and subsumption graphs whose distributions respect the power-law exponents given as input with a confidence ranging …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Personalisation in Self e-Learning Networks.",
            "Publication year": 2003,
            "Publication url": "http://139.91.152.92/isl/ist_workshop/mmgps03/presentations/Keenoy.pdf",
            "Abstract": "Personalisation in Self e-Learning Networks Page 1 Personalisation in Self e-Learning \nNetworks Kevin Keenoy Birkbeck College, University of London Vassilis Christophides ICS-FORTH, \nCrete IST Workshop on Metadata Management in Grid and P2P systems (MMGPS) Models, \nServices and Architectures 16th December 2003 Page 2 16th December 2003 Personalisation \nin Self e-Learning Networks 2 The SeLeNe Project (IST-2001-39045) is a one-year \nAccompanying Measure funded by EU FP5 1st November 2002 to 31st January 2003 Page 3 \n16th December 2003 Personalisation in Self e-Learning Networks 3 Overview • Why SeLeNe? \n- Motivation • What is a SeLeNe? • The SeLeNe information space – Learning Object metadata \n• Personalisation in SeLeNe – Personal Views – Personalised query results – Notification \nservices Page 4 16th December 2003 Personalisation in Self e-Learning Networks 4 Why ? • …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimizing large collections of continuous content-based RSS aggregation queries",
            "Publication year": 2011,
            "Publication url": "https://core.ac.uk/download/pdf/191334092.pdf",
            "Abstract": "In this article we present RoSeS (Really Open Simple and Efficient Syndication), a generic framework for content-based RSS feed querying and aggregation. RoSeS is based on a data-centric approach, using a combination of standard database concepts like declarative query languages, views and multi-query optimization. Users create personalized feeds by defining and composing content-based filtering and aggregation queries on collections of RSS feeds. Publishing these queries corresponds to defining views which can then be used for building new queries/feeds. This naturally reflects the publish-subscribe nature of RSS applications. The contributions presented in this article are a declarative RSS feed aggregation language, an extensible stream algebra for building efficient continuous multiquery execution plans for RSS aggregation views, a multi-query optimization strategy for these plans and a running prototype based on a multi-threaded asynchronous execution engine.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ics-forth rdfsuite: High-level scalable tools for the semantic web",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=18048435694673858566&hl=en&oi=scholarr",
            "Abstract": "We present an overview of RDFSuite, a suite of high-level, scalable tools for validating, storing and querying RDF schemas and resource descriptions. RDFSuite addresses the need for effective and efficient management of large volumes of RDF metadata as required by real-scale Semantic Web applications. The development of RDFSuite has been supported in part by the EU projects C-Web (IST-1999-13479) and MesMuses (IST-2001-26074) and it is available for download under an Open Source Software License from the Web site http://139.91. 183.30: 9090/RDF/.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diachronic Linked Data: Towards Long-Term Preservation of Structured Interrelated Information",
            "Publication year": 2012,
            "Publication url": "https://arxiv.org/abs/1205.2292",
            "Abstract": "The Linked Data Paradigm is one of the most promising technologies for publishing, sharing, and connecting data on the Web, and offers a new way for data integration and interoperability. However, the proliferation of distributed, inter-connected sources of information and services on the Web poses significant new challenges for managing consistently a huge number of large datasets and their interdependencies. In this paper we focus on the key problem of preserving evolving structured interlinked data. We argue that a number of issues that hinder applications and users are related to the temporal aspect that is intrinsic in linked data. We present a number of real use cases to motivate our approach, we discuss the problems that occur, and propose a direction for a solution.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Entity resolution in the web of data",
            "Publication year": 2014,
            "Publication url": "http://www2014.thewebconf.org/asset/slide/Entity%20Resolution%20in%20the%20Web%20of%20Data.pdf",
            "Abstract": "Big Data Page 1 Entity Resolution in the Web of Data Kostas Stefanidis1, Vasilis Efthymiou1,2, \nMelanie Herschel3,4, Vassilis Christophides5 kstef@ics.forth.gr, vefthym@ics.forth.gr, \nmelanie.herschel@lri.fr vassilis.christophides@technicolor.com 1FORTH, 2University of Crete, \n3Université Paris Sud,4Inria Saclay, 5Paris R&I Center, Technicolor Page 2 LOD Cloud and the \nWeb of Data 2 Media Government Geographic Publications User-generated Life sciences \nCross-domain Page 3 LOD Cloud and the Web of Data 3 adapted from Suchanek & Weikum \ntutorial@SIGMOD 2013 Page 4 LOD Cloud and the Web of Data 4 24.9M entities 2.16 Billion \ntriples 50,000 properties 40M entities 1.9 Billion triples 10M entities 120M triples adapted from \nSuchanek & Weikum tutorial@SIGMOD 2013 Page 5 Entities: An Invaluable Asset 5 Monuments \n“Entities” is what a large part of our knowledge is about Page 6 Entities: An Asset 6 “” :…",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SIXTH FRAMEWORK PROGRAMME PRIORITY IST-2002-2.3. 1.12 Technology-enhanced Learning and Access to Cultural Heritage",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30823688/Delos05_FoundationInformIntegrStateArt.pdf",
            "Abstract": "Digital libraries can be viewed as an infrastructure for supporting both the creation of information sources and the movement of information across global networks, and moreover the effective and efficient interaction among knowledge producers, librarians, and information and knowledge seekers. Typically, a digital library is a vast collection of objects, which are stored and maintained by multiple information sources, including databases, image banks, file systems, e-mail systems, the WWW, and others. These information sources are typically heterogeneous, in terms of how the objects are stored, organized and managed, and may exist on different platforms. Furthermore, the information sources in digital libraries are evolutionary in the sense that they may be included to or removed from the system. Thus, there is a need to provide the users with the ability to seamlessly and transparently access digital library objects in spite of the heterogeneity and dynamism among the information sources.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:kRWSkSYxWN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative knowledge creation: Practices, tools, concepts",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=yMEd4VPr9mQC&oi=fnd&pg=PR9&dq=info:po5nGizkT8cJ:scholar.google.com&ots=XpC8cn1QJu&sig=roM5NlGCZiqHbOJ06hVtQAYgBjk",
            "Abstract": "This book presents perspectives on the knowledge creation metaphor of learning, and elaborates the trialogical approach to learning. The knowledge creation metaphor differs from both the acquisition and the participation metaphors. In a nutshell trialogical approaches seek to engage learners in joint work with shared objects and artefacts mediated by collaboration technology. The theoretical underpinnings stem from different origins, including Bereiter and Scardamalia’s theory on knowledge building and Engeström’s activity theory. The authors in this collection introduce key concepts and techniques, explain tools designed and developed to support knowledge creation, and report results from case studies in specific contexts. The book chapters integrate theoretical, methodological, empirical and technological research, to elaborate the empirical findings and to explain the design of the knowledge creation tools. The target audiences for this book are researchers, teachers and Human Resource developers interested in new perspectives on collaborative learning, technology-mediated knowledge creation, and applications of this in their own settings, for higher education, teacher training and workplace learning. The book is the result of joint efforts from many contributors who took part in the Knowledge-practices Laboratory (KP-Lab) project (2006-2011) supported by EU FP6.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Viewing the semantic web through RVL lenses",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570826804000101",
            "Abstract": "Personalized access and content syndication involving diverse conceptual representations of information resources are two of the key challenges of Semantic Web (SW) applications. In this paper, we investigate how these goals can be achieved using view definition primitives over RDF/S bases. We introduce a full-fledged view definition language, RVL, for creating virtual RDF/S resource descriptions and schemas from (meta)classes, properties, and resource descriptions, and we illustrate how RVL views can be composed with structured RDF/S queries expressed in a query language like RQL, by means of an internal logical framework capturing the semantics of the RDF/S model, RQL queries and RVL views.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:Fu2w8maKXqMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Μη Επαναληπτική και Παράλληλη Επίλυση Οντοτήτων εδο ένων στον Παγκόσ ιο Ιστό",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=8007484616039802077&hl=en&oi=scholarr",
            "Abstract": "Η επίλυση οντοτήτων είναι ένα πρόβληµα που αποσ οπεί στον εντοπισµό διαφορετι ών περιγραφών οντοτήτων, σε διαφορετι ές βάσεις γνώσεων, που αναφέρονται στην ίδια οντότητα. Για να διαχειριστούµε προ λήσεις, όπως ο όγ ος, η ορϑότητα αι η ποι ιλοµορφία των οντοτήτων που δηµοσιεύονται στον παγ όσµιο ιστό, προτείνουµε µία µέϑοδο που εστιάζει ταυτόχρονα στην (α) πλήρη αυτοµατοποίηση,(β) υποστήριξη οντοτήτων υψηλής ετερογένειας αι (γ) παράλληλη επεξεργασία χρησιµοποιώντας το Spark. Συγ ε ριµένα, προτείνουµε νέες µετρι ές οµοιότητας για τη σύγ ριση οντοτήτων που βασίζονται στο περιεχόµενό τους αλλά αι στις γειτονι ές οντότητες, χωρίς να απαιτείται άποια εξωτερι ή γνώση σχετι ή µε τον τύπο των οντοτήτων.∆ είχνουµε ότι οι µετρι ές αυτές µπορούν να αναπαρασταϑούν χρησιµοποιώντας διαφορετι ές µεϑόδους συσταδοποίησης των οντοτήτων, αι ϑέτουν τις βάσεις για ένα µη επαναληπτι ό αι …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mediating rdf/s queries to relational and xml sources",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/article/mediating-rdf-queries-relational-xml/2827",
            "Abstract": "Semantic Web (SW) technology aims to facilitate the integration of legacy data sources spread worldwide. Despite the plethora of SW languages (eg, RDF/S, OWL) recently proposed for supporting large-scale information interoperation, the vast majority of legacy sources still rely on relational databases (RDB) published on the Web or corporate intranets as virtual XML. In this article, we advocate a first-order logic framework for mediating high-level queries to relational and/or XML sources using community ontologies expressed in a SW language such as RDF/S. We describe the architecture and reasoning services of our SW integration middleware, termed SWIM, and we present the main design choices and techniques for supporting powerful mappings between different data models, as well as reformulation and optimization of queries expressed against mediator ontologies and views.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:qUcmZB5y_30C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Querying Semistructured (Meta) data and Schemas on the Web: The case of RDF & RDFS",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.4010",
            "Abstract": "The need for descriptive information, ie, metadata, about Web resources has been recognized in several application contexts (eg, digital libraries, infomediaries, portals, etc.). The Resource Description Framework (RDF) aims at facilitating the creation and exchange of metadata, as any other Web data. In particular, the definition of schema vocabularies enables the interpretation of RDF descriptions across several communities.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ICS-FORTH RDFSuite: Managing Voluminous RDF Description Bases.",
            "Publication year": 2001,
            "Publication url": "http://ceur-ws.org/Vol-40/alexakietal.pdf",
            "Abstract": "Metadata are widely used in order to fully exploit information resources available on corporate intranets or the Internet. The Resource Description Framework (RDF) aims at facilitating the creation and exchange of metadata as any other Web data. The growing number of available information resources and the proliferation of description services in various user communities, lead nowadays to large volumes of RDF metadata. Managing such RDF resource descriptions and schemas with existing low-level APIs and file-based implementations does not ensure fast deployment and easy maintenance of real-scale RDF applications. In this paper, we advocate the use of database technology to support declarative access, as well as, logical and physical independence for voluminous RDF description bases. We present RDFSuite, a suite of tools for RDF validation, storage and querying. Specifically, we introduce a formal data model for RDF description bases created using multiple schemas. Next, we present the design of a persistent RDF Store (RSSDB) for loading resource descriptions in an ORDBMS by exploring the available RDF schema knowledge. Our approach preserves the flexibility of RDF in refining schemas and/or enriching descriptions at any time, whilst it outperforms, both in storage volumes and query execution time, other approaches using a monolithic table to represent resource descriptions and schemas under the form of triples. Last, we briefly present RQL, a declarative language for querying both RDF descriptions and schemas, and sketch query evaluation on top of RSSDB.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indexing views to route queries in a PDMS",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10619-007-7021-0",
            "Abstract": " P2P computing gains increasing attention lately, since it provides the means for realizing computing systems that scale to very large numbers of participating peers, while ensuring high autonomy and fault-tolerance. Peer Data Management Systems (PDMS) have been proposed to support sophisticated facilities in exchanging, querying and integrating (semi-)structured data hosted by peers. In this paper, we are interested in routing graph queries in a very large PDMS, where peers advertise their local bases using fragments of community RDF/S schemes (i.e., views). We introduce an original encoding for these fragments, in order to efficiently check whether a peer view is subsumed by a query. We rely on this encoding to design an RDF/S view lookup service featuring a statefull and a stateless execution over a DHT-based P2P infrastructure. We finally evaluate experimentally our system to demonstrate its …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:JQOojiI6XY0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Peer-to-Peer Computing and Databases (P2PDB)-",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=17272787639305467889&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:UHK10RUVsp4C",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Benchmarking blocking algorithms for web entities",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7485873/",
            "Abstract": "An increasing number of entities are described by interlinked data rather than documents on the Web. Entity Resolution (ER) aims to identify descriptions of the same real-world entity within one or across knowledge bases in the Web of data. To reduce the required number of pairwise comparisons among descriptions, ER methods typically perform a pre-processing step, called blocking, which places similar entity descriptions into blocks and thus only compare descriptions within the same block. We experimentally evaluate several blocking methods proposed for the Web of data using real datasets, whose characteristics significantly impact their effectiveness and efficiency. The proposed experimental evaluation framework allows us to better understand the characteristics of the missed matching entity descriptions and contrast them with ground truth obtained from different kinds of relatedness links.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Big Data Analytics",
            "Publication year": 2019,
            "Publication url": "https://who.rocq.inria.fr/Vassilis.Christophides/Big/lectures/bigdata-intro19.pdf",
            "Abstract": "• Largest telco companies owns no telco infrastructure (Skype)• World’s largest movie houses owns no cinemas (Netflix)• World’s most valuable retailer has no inventory (Alibaba)• Most popular media owner creates no content (Facebook)• World’s largest taxi company owns no vehicles (Uber)• Largest accommodation provider owns no real estate (Airbnb)• Faster growing banks have actually no money (BitCoin)",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:hC7cP41nSMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling Continuous Operators for IoT Edge Analytics",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3434770.3459738",
            "Abstract": "In this paper we are interested in exploring the Edge-Fog-Cloud architecture as an alternative approach to the Cloud-based IoT data analytics. Given the limitations of Fog in terms of limited computational resources that can also be shared among multiple analytics with continuous operators over data streams, we introduce a holistic cost model that accounts both the network and computational resources available in the Edge-Fog-Cloud architecture. Then, we propose scheduling algorithms RCS and SOO-CPLEX for placing continuous operators for data stream analytics at the network edge. The former dynamically places continuous operators between the Cloud and the Fog according to the evolution of data streams rates and uses as less as possible Fog computational resources to satisfy the constraints regarding the usage of both computational and network resources. The latter statically places continuous …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formal foundations for RDF/S KB evolution",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-012-0500-2",
            "Abstract": "There are ongoing efforts to provide declarative formalisms of integrity constraints over RDF/S data. In this context, addressing the evolution of RDF/S knowledge bases while respecting associated constraints is a challenging issue, yet to receive a formal treatment. We provide a theoretical framework for dealing with both schema and data change requests. We define the notion of a rational change operator as one that satisfies the belief revision principles of Success, Validity and Minimal Change. The semantics of such an operator are subject to customization, by tuning the properties that a rational change should adhere to. We prove some interesting theoretical results and propose a general-purpose algorithm for implementing rational change operators in knowledge bases with integrity constraints, which allows us to handle uniformly any possible change request in a provably rational and consistent …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "RQL: A declarative query language for RDF",
            "Publication year": 2001,
            "Publication url": "https://www.ics.forth.gr/isl/publications/paperlink/dql-rdf.pdf",
            "Abstract": "Real-scale Semantic Web applications, such as Web Portals and E-Marketplaces, require the management of voluminous metadata repositories containing descriptive information (ie, metadata) about the available Web resources and services. Better knowledge about the meaning, usage, accessibility or quality of these resources and services will considerably facilitate the automated processing of both Web content and services. In this context, the Resource Description Framework (RDF) enables the creation and exchange of metadata as any other Web data. Although large volumes of RDF descriptions are already appearing (eg, as exported Portal catalogs or service descriptions), sufficiently expressive declarative languages for querying both RDF descriptions and schemas are still missing. In this paper, we propose RQL, a new RDF query language, relying on a formal graph model that permits the interpretation of superimposed resource descriptions. RQL is an OQL-inspired adaptation of XML query languages to the peculiarities of RDF but, foremost, is an extension of this functionality for uniformly querying both descriptions and schemas. We illustrate the syntax, semantics and core functionality of RQL by means of a set of benchmark queries and report on the performance of RSSDB, our persistent RDF Store, for storing and querying voluminous RDF descriptions.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Putting the Human Back in the AutoML Loop.",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Tsamardinos/publication/340336536_Putting_the_Human_Back_in_the_AutoML_Loop/links/5e843eea4585150839b2d6af/Putting-the-Human-Back-in-the-AutoML-Loop.pdf",
            "Abstract": "Automated Machine Learning (AutoML) is a rapidly rising subfield of Machine Learning. AutoML aims to fully automate the machine learning process end-to-end, democratizing Machine Learning to non-experts and drastically increasing the productivity of expert analysts. So far, most comparisons of AutoML systems focus on quantitative criteria such as predictive performance and execution time. In this paper, we examine AutoML services for predictive modeling tasks from a user’s perspective, going beyond predictive performance. We present a wide palette of criteria and dimensions on which to evaluate and compare these services as a user. This qualitative comparative methodology is applied on seven AutoML systems, namely Auger. AI, BigML, H2O’s Driverless AI, Darwin, Just Add Data Bio, Rapid-Miner, and Watson. The comparison indicates the strengths and weaknesses of each service, the needs that it covers, the segment of users that is most appropriate for, and the possibilities for improvements.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benchmarking database representations of RDF/S stores",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11574620_49",
            "Abstract": "In this paper we benchmark three popular database representations of RDF/S schemata and data: (a) a schema-aware (i.e., one table per RDF/S class or property) with explicit (ISA) or implicit (NOISA) storage of subsumption relationships, (b) a schema-oblivious (i.e., a single table with triples of the form ), using (ID) or not (URI) identifiers to represent resources and (c) a hybrid of the schema-aware and schema-oblivious representations (i.e., one table per RDF/S meta-class by distinguishing also the range type of properties). Furthermore, we benchmark two common approaches for evaluating taxonomic queries either on-the-fly (ISA, NOISA, Hybrid), or by precomputing the transitive closure of subsumption relationships (MatView, URI, ID). The main conclusion drawn from our experiments is that the evaluation of taxonomic queries is most efficient over RDF/S stores utilizing the Hybrid and MatView …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Capturing Provenance of RDF Triples through Colors",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.578.2947&rep=rep1&type=pdf",
            "Abstract": "Recently, the W3C Linking Open Data effort has boosted the publication and inter-linkage of large amounts of RDF datasets on the Semantic Web. Various ontologies and knowledge bases with millions of RDF triples from Wikipedia and other sources, mostly in e-science, have been created and are publicly available. Recording provenance information of RDF triples aggregated from different heterogeneous sources is crucial in order to effectively support trust mechanisms, digital rights and privacy policies. Managing provenance becomes even more important when we consider not only explicitly stated but also implicit triples (through RDFS inference rules) in conjunction with declarative languages for querying and updating RDF graphs. In this paper we rely on colored RDF triples represented as quadruples to capture and manipulate explicit provenance information.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The RDF query language (RQL)",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=17803603999468427728&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web-scale blocking, iterative and progressive entity resolution",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7930109/",
            "Abstract": "Entity resolution aims to identify descriptions of the same entity within or across knowledge bases. In this work, we provide a comprehensive and cohesive overview of the key research results in the area of entity resolution. We are interested in frameworks addressing the new challenges in entity resolution posed by the Web of data in which real world entities are described by interlinked data rather than documents. Since such descriptions are usually partial, overlapping and sometimes evolving, entity resolution emerges as a central problem both to increase dataset linking, but also to search the Web of data for entities and their relations. We focus on Web-scale blocking, iterative and progressive solutions for entity resolution. Specifically, to reduce the required number of comparisons, blocking is performed to place similar descriptions into blocks and executes comparisons to identify matches only between …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing personalized curricula based on student preferences",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1297144.1297158",
            "Abstract": "We address the problem of generating entire course sequences, given a set of target skills along with possibly prioritized student preferences over course descriptions. Compared to logic frameworks formulating course sequencing as a planning problem, our work relies on a set-theoretic framework for generating course sequences using preference-based queries. We introduce the concept of ordered partition for sequencing, and the ordered product of partitions, when it is necessary to combine more than one preference orderings. In our context, ordered partitions originate from preferences expressed over general relations, rather than on functional attributes of traditional database tuples (or objects) addressed by other approaches. We believe that the proposed framework is expressive enough to produce course sequences from descriptions expressed in diverse data models (eg, XML, RDF/S) with respect to a …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:Tiz5es2fbqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Generating on the fly queries for the semantic web: The ics-forth graphical rql interface (grql)",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30475-3_34",
            "Abstract": "Building user-friendly GUIs for browsing and filtering RDF/S description bases while exploiting in a transparent way the expressiveness of declarative query/view languages is vital for various Semantic Web applications (e.g., e-learning, e-science). In this paper we present a novel interface, called GRQL, which relies on the full power of the RDF/S data model for constructing on the fly queries expressed in RQL. More precisely, a user can navigate graphically through the individual RDF/S class and property definitions and generate transparently the RQL path expressions required to access the resources of interest. These expressions capture accurately the meaning of its navigation steps through the class (or property) subsumption and/or associations. Additionally, users can enrich the generated queries with filtering conditions on the attributes of the currently visited class while they can easily specify the …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:4DMP91E08xMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On provenance of queries on semantic web data",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601676/",
            "Abstract": "Capturing trustworthiness, reputation, and reliability of Semantic Web data manipulated by SPARQL requires researchers to represent adequate provenance information, usually modeled as source data annotations and propagated to query results along with a query evaluation. Alternatively, abstract provenance models can capture the relationship between query results and source data by taking into account the employed query operators. The authors argue the benefits of the latter for settings in which query results are materialized in several repositories and analyzed by multiple users. They also investigate how relational provenance models can be leveraged for SPARQL queries, and advocate for new provenance models.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the ACM SIGMOD International Workshop on Web and Databases (WebDB)",
            "Publication year": 2003,
            "Publication url": "https://nyuscholars.nyu.edu/en/publications/proceedings-of-the-acm-sigmod-international-workshop-on-web-and-d",
            "Abstract": "Proceedings of the ACM SIGMOD International Workshop on Web and Databases (WebDB) \n— NYU Scholars Skip to main navigation Skip to search Skip to main content NYU Scholars \nLogo Help & FAQ Home Profiles Research Units Research Output Proceedings of the ACM \nSIGMOD International Workshop on Web and Databases (WebDB) V. Christophides (Editor), \nJuliana Freire (Editor) Urban Initiative Research output: Book/Report › Book Overview \nOriginal language English (US) Publisher Unknown publisher State Published - 2003 Cite \nthis APA Standard Harvard Vancouver Author BIBTEX RIS Christophides, V., & Freire, J. (Eds.) \n(2003). Proceedings of the ACM SIGMOD International Workshop on Web and Databases (WebDB). \nUnknown publisher. Proceedings of the ACM SIGMOD International Workshop on Web and \nDatabases (WebDB). / Christophides, V. (Editor); Freire, Juliana (Editor). Unknown , 2003. : /…",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown publisher"
        },
        {
            "Title": "A methodological framework for statistical analysis of social text streams",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40140-4_11",
            "Abstract": "Social media are one of the main contributors of user generated content; providing vast amounts of data in daily basis, covering a wide range of topics, interests and events. In order to identify and link meaningful and relevant information, clustering algorithms have been used to partition the user generated content. We have identified though that these algorithms exhibit various shortcomings when they have to deal with social media textual information, which is dynamic and streaming in nature. Thus we explore the idea to estimate the algorithms’ parameters based on observations on the clusters’ properties’ (like the centroid, shape and density) evolution. By experimenting with the clusters’ properties, we propose a methodological framework that detects the evolution of the clusters’ centroid, shape and density and explores their role in parameters’ estimation.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A service infrastructure for e-Science: the case of the ARION system",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36189-8_14",
            "Abstract": "The ARION system provides basic e-services of search and retrieval of objects in scientific collections, such as, data sets, simulation models and tools necessary for statistical and/or visualization processing. These collections may represent application software of scientific areas, they reside in geographically disperse organizations and constitute the system content. The user, as part of the retrieval mechanism, may dynamically invoke on-line computations of scientific data sets when the latter are not found into the system. Thus, ARION provides the basic infrastructure for accessing and producing scientific information in an open, distributed and federated system. More advanced e-services, which depend on the scientific content of the system, can be built upon this infrastructure, such as decision making and/or policy support using various information brokering techniques.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Querying with preferences in a digital library",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11605126_8",
            "Abstract": "We consider a collection of federated sources on the Web, and a community of users who are interested in documents residing in one or more of those federated sources. The search for documents of interest is supported by a mediator that we call a digital library. The library simply indexes all documents that are made available to users by the federated sources. When a user addresses a query to the library, the library returns the URLs of documents satisfying the query. In such a context, one of the factors influencing user satisfaction is the size of the answer set, in particular when it is too small (few or no documents) or too large (several hundreds or thousands of documents). In this paper, we address the problem of answer sets that are too large, and we call personalized query a usual query together with (a) an upper bound on the number of documents returned, and (b) a set of preferences as to the order in …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:tKAzc9rXhukC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "RSS feeds behavior analysis, structure and vocabulary",
            "Publication year": 2014,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/IJWIS-06-2014-0023/full/html",
            "Abstract": " – The purpose of this paper is to present a thorough analysis of three complementary features of real-scale really simple syndication (RSS)/Atom feeds, namely, publication activity, items characteristics and their textual vocabulary, that the authors believe are crucial for emerging Web 2.0 applications. Previous works on RSS/Atom statistical characteristics do not provide a precise and updated characterization of feeds’ behavior and content, characterization that can be used to successfully benchmark the effectiveness and efficiency of various Web syndication processing/analysis techniques.  – The authors empirical study relies on a large-scale testbed acquired over an eight-month campaign from 2010. They collected a total number of 10,794,285 items originating from 8,155 productive feeds. The authors deeply analyze feeds …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:J-pR_7NvFogC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "On Storing Voluminous RDF Descriptions: The Case of Web Portal Catalogs.",
            "Publication year": 2001,
            "Publication url": "https://projects.ics.forth.gr/isl/RDF/publications/webdb01.PDF",
            "Abstract": "On Storing Voluminous RDF Descriptions: The case of Web Portal Catalogs Portalmania! Page \n1 1 1 1 ICS-FORTH & Univ. of Crete Gregory Karvounarakis May 2001 On Storing Voluminous \nRDF Descriptions: The case of Web Portal Catalogs (http://www. (http://www.icsics.forth. \n.forth.grgr//proj proj//isst isst/RDF) /RDF) Sofia Alexaki, Vassilis Christophides Gregory \nKarvounarakis, Dimitris Plexousakis Computer Science Department, University of Crete and \nInstitute for Computer Science - FORTH Heraklion, Crete, Greece 2 ICS-FORTH & Univ. of Crete \nGregory Karvounarakis May 2001 Portalmania! Page 2 2 2 3 ICS-FORTH & Univ. of Crete \nGregory Karvounarakis May 2001 Internet Portals Example: The Open Directory 4 ICS-FORTH & \nUniv. of Crete Gregory Karvounarakis May 2001 Browsing the ODP Topics Page 3 3 3 5 \nICS-FORTH & Univ. of Crete Gregory Karvounarakis May 2001 Browsing the ODP Topics 6 ICS-. …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Subscription indexes for web syndication systems",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2247596.2247634",
            "Abstract": "The explosion of published information on the Web leads to the emergence of a Web syndication paradigm, which transforms the passive reader into an active information collector. Information consumers subscribe to RSS/Atom feeds and are notified whenever a piece of news (item) is published. The success of this Web syndication now offered on Web sites, blogs, and social media, however raises scalability issues. There is a vital need for efficient real-time filtering methods across feeds, to allow users to follow effectively personally interesting information. We investigate in this paper three indexing techniques for users' subscriptions based on inverted lists or on an ordered trie. We present analytical models for memory requirements and matching time and we conduct a thorough experimental evaluation to exhibit the impact of critical workload parameters on these structures.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic Web, Ontologies and Databases: VLDB Workshop, SWDB-ODBIS 2007, Vienna, Austria, September 24, 2007, Revised Selected Papers",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=pQtrCQAAQBAJ&oi=fnd&pg=PP2&dq=info:O1zhWJJASEUJ:scholar.google.com&ots=vU0z44tpjz&sig=pX9Jf5rn-3kOhxPI6xpKR7C740c",
            "Abstract": "This book constitutes the thoroughly refereed post-conference proceedings of the joint International Workshops on Semantic Web, Ontologies and Databases, SWDB-ODBIS 2007, co-located with the 33rd International Conference on Very Large Data Bases, VLDB 2007, held in Vienna, Austria, in September 2007. The 7 revised full papers presented together with 1 invited paper were carefully selected from 11 submissions. Among the topics addressed are semantics-aware data models and query languages; ontology-based views, mapping, transformations, and query reformulation; and storing and indexing semantic Web data and schemas.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:dhFuZR0502QC",
            "Publisher": "Springer"
        },
        {
            "Title": "Entity resolution in the web of data",
            "Publication year": 2015,
            "Publication url": "https://www.morganclaypool.com/doi/abs/10.2200/S00655ED1V01Y201507WBE013",
            "Abstract": " In recent years, several knowledge bases have been built to enable large-scale knowledge sharing, but also an entity-centric Web search, mixing both structured data and text querying. These knowledge bases offer machine-readable descriptions of real-world entities, e.g., persons, places, published on the Web as Linked Data. However, due to the different information extraction tools and curation policies employed by knowledge bases, multiple, complementary and sometimes conflicting descriptions of the same real-world entities may be provided. Entity resolution aims to identify different descriptions that refer to the same entity appearing either within or across knowledge bases. The objective of this book is to present the new entity resolution challenges stemming from the openness of the Web of data in describing entities by an unbounded number of knowledge bases, the semantic and structural diversity of …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:HoB7MX3m0LUC",
            "Publisher": "Morgan & Claypool Publishers"
        },
        {
            "Title": "The editors-in-chief and the editorial board would like to acknowledge the following people for their expert and continuing assistance in evaluating manuscript submissions to Information Systems in the recent past. Their efforts have been central to the steady improvement of the selection and content of Information Systems articles during the last several years.",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16374650147544734243&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Database Technology-EDBT 2004: 9th International Conference on Extending Database Technology, Heraklion, Crete, Greece, March 14-18, 2004, Proceedings",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=CYH0BwAAQBAJ&oi=fnd&pg=PA1&dq=info:vfnH022Yo4UJ:scholar.google.com&ots=jjgRWR3mrE&sig=iepCuTKLjwhXnt3JvT3foNnn7NI",
            "Abstract": "The 9th International Conference on Extending Database Technology, EDBT 2004, was held in Heraklion, Crete, Greece, during March 14–18, 2004. The EDBT series of conferences is an established and prestigious forum for the exchange of the latest research results in data management. Held every two years in an attractive European location, the conference provides unique opp-tunities for database researchers, practitioners, developers, and users to explore new ideas, techniques, and tools, and to exchange experiences. The previous events were held in Venice, Vienna, Cambridge, Avignon, Valencia, Konstanz, and Prague. EDBT 2004 had the theme “new challenges for database technology,” with the goal of encouraging researchers to take a greater interest in the current exciting technological and application advancements and to devise and address new research and development directions for database technology. From its early days, database technology has been challenged and advanced by new uses and applications, and it continues to evolve along with application requirements and hardware advances. Today’s DBMS technology faces yet several new challenges. Technological trends and new computation paradigms, and applications such as pervasive and ubiquitous computing, grid computing, bioinformatics, trust management, virtual communities, and digital asset management, to name just a few, require database technology to be deployed in a variety of environments and for a number of di? erent purposes. Such an extensive deployment will also require trustworthy, resilient database systems, as well as easy-to …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer"
        },
        {
            "Title": "Community webs (c-webs): Technological assessment and system architecture",
            "Publication year": 2000,
            "Publication url": "https://ci.nii.ac.jp/naid/10022162047/",
            "Abstract": "CiNii 論文 - Community Webs (C-Webs) : Technological Assessment and System Architecture \nCiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす \n日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる \nタイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで \n検索 検索 検索 CiNii Researchプレ版の公開について Community Webs (C-Webs) : \nTechnological Assessment and System Architecture CHRISTOPHIDES V. 被引用文献: 1件 著者 \nCHRISTOPHIDES V. 収録刊行物 http://citeseer.nj.nec.com/christophides00community.html \nhttp://citeseer.nj.nec.com/christophides00community.html, 2000 被引用文献: 1件中 1-1件を 表示 \n1 コミュニティウェブソフトウェアにおけるアクティブマイニング 石川 孝 電子情報通信学会技術研究\n報告. AI, 人工知能と知識処理 102(709), 49-52, 2003-03-06 参考文献7件 Tweet 各種コード NIIID/…",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining usage patterns in residential intranet of things",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877050916302307",
            "Abstract": "Ubiquitous smart technologies gradually transform modern homes into Intranet of Things, where a multitude of connected devices allow for novel home automation services (e.g., energy or bandwidth savings, comfort enhancement, etc.). Optimizing and enriching the Quality of Experience (QoE) of residential users emerges as a critical differentiator for Internet and Communication Service providers (ISPs and CSPs, respectively) and heavily relies on the analysis of various kinds of data (connectivity, performance, usage) gathered from home networks. In this paper, we are interested in new Machine-to-Machine data analysis techniques that go beyond binary association rule mining for traditional market basket analysis considered by previous works, to analyze individual device logs of home gateways. Based on multidimensional patterns mining framework, we extract complex device co-usage patterns of 201 …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:abG-DnoFyZgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Provenance for linked data",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41660-6_19",
            "Abstract": "Assessing the quality of linked data currently published on the Web is a crucial need of various data-intensive applications. Extensive work on similar applications for relational data and queries has shown that data provenance can be used in order to compute trustworthiness, reputation and reliability of query results, based on the source data and query operators involved in their derivation. In particular, abstract provenance models can be employed to record information about source data and query operators during query evaluation, and later be used e.g., to assess trust for individual query results. In this paper, we investigate the extent to which relational provenance models can be leveraged for capturing the provenance of SPARQL queries over linked data, and identify their limitations. To overcome these limitations, we advocate the need for new provenance models that capture the full expressive power …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "PROTEUS: Predictive Explanation of Anomalies",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9458931/",
            "Abstract": "Numerous algorithms have been proposed for detecting anomalies (outliers, novelties) in an unsupervised manner. Unfortunately, it is not trivial, in general, to understand why a given sample (record) is labelled as an anomaly and thus diagnose its root causes. We propose the following reduced-dimensionality, surrogate model approach to explain detector decisions: approximate the detection model with another one that employs only a small subset of features. Subsequently, samples can be visualized in this low-dimensionality space for human understanding. To this end, we develop PROTEUS, an AutoML pipeline to produce the surrogate model, specifically designed for feature selection on imbalanced datasets. The PROTEUS surrogate model can not only explain the training data, but also the out-of-sample (unseen) data. In other words, PROTEUS produces predictive explanations by approximating the …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Narrowing the gap between QoS metrics and Web QoE using Above-the-fold metrics",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-76481-8_3",
            "Abstract": "Page load time (PLT) is still the most common application Quality of Service (QoS) metric to estimate the Quality of Experience (QoE) of Web users . Yet, recent literature abounds with proposals for alternative metrics (e.g., Above The Fold, SpeedIndex and their variants) that aim at better estimating user QoE. The main purpose of this work is thus to thoroughly investigate a mapping between established and recently proposed objective metrics and user QoE. We obtain ground truth QoE via user experiments where we collect and analyze 3,400 Web accesses annotated with QoS metrics and explicit user ratings in a scale of 1 to 5, which we make available to the community. In particular, we contrast domain expert models (such as ITU-T and IQX) fed with a single QoS metric, to models trained using our ground-truth dataset over multiple QoS metrics as features. Results of our experiments show that, albeit …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:dTyEYWd-f8wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Containment and minimization of RDF/S query patterns",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11574620_44",
            "Abstract": "Semantic query optimization (SQO) has been proved to be quite useful in various applications (e.g., data integration, graphical query generators, caching, etc.) and has been extensively studied for relational, deductive, object, and XML databases. However, less attention to SQO has been devoted in the context of the Semantic Web. In this paper, we present sound and complete algorithms for the containment and minimization of RDF/S query patterns. More precisely, we consider two widely used RDF/S query fragments supporting pattern matching at the data, but also, at the schema level. To this end, we advocate a logic framework for capturing the RDF/S data model and semantics and we employ well-established techniques proposed in the relational context, in particular, the Chase and Backchase algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Implications of the Multi-Modality of User Perceived Page Load Time",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9191615/",
            "Abstract": "Web browsing is one of the most popular applications for both desktop and mobile users. A lot of effort has been devoted to speedup the Web, as well as in designing metrics that can accurately tell whether a webpage loaded fast or not. An often implicit assumption made by industrial and academic research communities is that a single metric is sufficient to assess whether a webpage loaded fast. In this paper we collect and make publicly available a unique dataset which contains webpage features (e.g., number and type of embedded objects) along with both objective and subjective Web quality metrics. This dataset was collected by crawling over 100 websites—representative of the top 1 M websites in the Web—while crowdsourcing 6,000 user opinions on user perceived page load time (uPLT). We show that the uPLT distribution is often multi-modal and that, in practice, no more than three modes are present. The …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:ye4kPcJQO24C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semantic Web workshop: Models, architectures and management",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=12252512865938864355&hl=en&oi=scholarr",
            "Abstract": "Call for Nominations-2016 SIGMOD Systems Award The SIGMOD Systems Award is awarded to an individual or set of individuals to recognize the development of a piece of software that made a significant technical contribution to the database management field and which was made available for others to use. The nomination deadline is April 1, 2016.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ICS-FORTH Semantic Web Integration Middleware (SWIM).",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.64.1897&rep=rep1&type=pdf",
            "Abstract": "A cornerstone issue in the realization of the Semantic Web (SW) vision is the achievement of semantic interoperability among legacy data sources spread worldwide. In order to capture information semantics in a machine processable way, various ontology-based formalisms have been recently proposed (eg, RDF/S [20, 5], DAML+ OIL [27], OWL [10]). However, the vast majority of existing legacy data is not yet in RDF/S or any other SW language [23, 25]. As a matter of fact, most of the data is physically stored in relational database (RDB) systems and actually published on the Web or corporate intranets as virtual XML. SW applications, however, require to view data as virtual RDF, valid instance of a domain or application specific RDF/S schema, and to be able to manipulate them with high-level query languages, such as RQL [18] or RVL [24]. Therefore, we need middleware systems that can either republish XML as RDF, or publish RDB data directly as RDF, or-even better-be capable of doing both. Sometimes the practical solution will be to rely just on the virtual XML schema and XML query interface of an existing XML publishing system. At other times, the SW publishing middleware will be built as an alternative to the XML publishing system, taking advantage of direct access to the underlying RDB management system (RDBMS). It is also possible that the SW middleware will have to integrate data in some RDBMS with data in native XML storage. We need to deal flexibly with all these situations in a uniform framework. A decade of experience with information integration architectures based on mediators [8, 29, 26, 21] suggests that it is highly …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Big Data Processing & Analytics",
            "Publication year": 2017,
            "Publication url": "https://www.csd.uoc.gr/~hy562/lectures20/lec01_Intro_20.pdf",
            "Abstract": "• Protons collide some 1 billion times per second where each collision produces about a megabyte of data• Even after filtering out about 99% of it, scientists are left with around 30 petabytes each year to analyze for a wide range of physics experiments, including studies on the Higgs boson♦ reconstructing particle trajectories, the particle types and their speeds",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Specifications and Prototype of the Knowledge Repository (V. 3.0) and the Knowledge Mediator (V. 3.0).",
            "Publication year": 2009,
            "Publication url": "https://eric.ed.gov/?id=ED517721",
            "Abstract": "This deliverable reports the technical and research development performed until M36 (January 2009) within tasks T5. 2 and T5. 4 of WP5 in the KP-Lab project, per the latest Description of Work (DoW) 3.2 [DoW3. 2]. The described components are included in the KP-Lab Semantic Web Knowledge Middleware (SWKM) Prototype Release 3.0 software that takes place in M36. This release builds on the Prototype Release 2.0 that was presented in [D5. 4].The present deliverable includes both the specification, as well as the implementation details for the described components. The description of the features of the new functionalities is provided based on the motivating scenarios and the subsequent functional requirements. The focus and the high-level objective of the new services is the provision of improved scalability and modularity properties on the existing services, as well as improved management abilities upon conceptualizations. The implementation of the services is described by providing the related services’ signatures, their proper way of use, the accepted input parameters, as well as their preconditions and effects.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Report on the first international workshop on Database Preservation (PresDB'07)",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1324185.1324197",
            "Abstract": "The need to preserve scientific, scholarly and cultural data has long been recognized. These data sets are valuable and many of them are either impossible to reproduce (e.g. climate and demographic data) or can only be recovered at enormous costs (e.g. data from high energy physics experiments). While substantial investment has been made in archiving and preserving conventional forms of these objects, such as documents, images and numerical data in some file format, the need to preserve entire databases has only recently emerged. Databases differ from fixed digital objects studied in the past, in that they change over time, they have internal structure, and they include schemas and integrity constraints, which are basic for the current and future interpretation of the data. Increasingly, database technology is being used in the storage of large numerical scientific data sets.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:TQgYirikUcIC",
            "Publisher": "ACM"
        },
        {
            "Title": "Optimizing taxonomic semantic web queries using labeling schemes",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570826803000246",
            "Abstract": "This paper focuses on the optimization of the navigation through voluminous subsumption hierarchies of topics employed by portal catalogs like Netscape Open Directory (ODP). We advocate for the use of labeling schemes for modeling these hierarchies in order to efficiently answer queries such as subsumption check, descendants, ancestors or nearest common ancestor, which usually require costly transitive closure computations. We first give a qualitative comparison of three main families of schemes, namely bit vector, prefix and interval based schemes. We then show that two labeling schemes are good candidates for an efficient implementation of label querying using standard relational DBMS, namely the Dewey prefix scheme and an interval scheme by Agrawal et al. We compare their storage and query evaluation performance for the 16 ODP hierarchies using the PostgreSQL engine.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:KxtntwgDAa4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "VU Research Portal",
            "Publication year": 2012,
            "Publication url": "https://research.vu.nl/files/684119/19960B.pdf",
            "Abstract": "Query optimization in RDF Stores is a challenging problem as SPARQL queries typically contain many more joins than equivalent relational plans, and hence lead to a large join order search space. In such cases, cost-based query optimization often is not possible. One practical reason for this is that statistics typically are missing in web scale setting such as the Linked Open Datasets (LOD). The more profound reason is that due to the absence of schematic structure in RDF, join-hit ratio estimation requires complicated forms of correlated join statistics; and currently there are no methods to identify the relevant correlations beforehand. For this reason, the use of good heuristics is essential in SPARQL query optimization, even in the case that are partially used with cost-based statistics (ie, hybrid query optimization). In this paper we describe a set of useful heuristics for SPARQL query optimizers. We present these in the context of a new Heuristic SPARQL Planner (HSP) that is capable of exploiting the syntactic and the structural variations of the triple patterns in a SPARQL query in order to choose an execution plan without the need of any cost model. For this, we define the variable graph and we show a reduction of the SPARQL query optimization problem to the maximum weight independent set problem. We implemented our planner on top of the MonetDB open source column-store and evaluated its effectiveness against the state-ofthe-art RDF-3X engine as well as comparing the plan quality with a relational (SQL) equivalent of the benchmarks.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Knowledge management for digital preservation",
            "Publication year": 2010,
            "Publication url": "http://users.ics.forth.gr/~tzitzik/publications/Tzitzikas_2010_ERCIMnews_B.pdf",
            "Abstract": "We can preserve the bits, but what about the knowledge encoded in them? Modern societies and economies are increasingly dependent on a deluge of information that is only available in digital form. The preservation of this information in an unstable and rapidly evolving technological (and social) environment is a challenging problem of great importance. The CASPAR (Cultural, Artistic and Scientific knowledge for Preservation, Access and Retrieval) project built a pioneering framework to support the end toend preservation ‘life cycle’for scientific, artistic and cultural information based on existing and emerging standards. CASPAR aimed to preserve not simply the bits of digital objects but also the information and knowledge that is encoded in these objects.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RQL: a declarative query language for RDF",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/511446.511524",
            "Abstract": "Real-scale Semantic Web applications, such as Knowledge Portals and E-Marketplaces, require the management of large volumes of metadata, ie, information describing the available Web content and services. Better knowledge about their meaning, usage, accessibility or quality will considerably facilitate an automated processing of Web resources. The Resource Description Framework (RDF) enables the creation and exchange of metadata as normal Web data. Although voluminous RDF descriptions are already appearing, sufficiently expressive declarative languages for querying both RDF descriptions and schemas are still missing. In this paper, we propose a new RDF query language called RQL. It is a typed functional language (a la OQL) and relies on a formal model for directed labeled graphs permitting the interpretation of superimposed resource descriptions by means of one or more RDF schemas. RQL …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The RQL v1. 5 User Manual",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/30698390/RQLManual.pdf",
            "Abstract": "This document is a tutorial for the RDF Query Language (RQL). RQL is a typed language, following a functional approach, that is defined by a set of basic queries and iterators. This tutorial presents examples of basic meta-schema, schema and data queries, as well as select-from-where filters (iterators) containing generalized path expressions and shows how such queries can be nested to form more complex queries.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:olpn-zPbct0C",
            "Publisher": "Technical Report, Accessed: July 23, 2008. http://139.91. 183.30: 9090/RDF/RQL/Manual. html"
        },
        {
            "Title": "Meowsreader: Real-time ranking and filtering of news with generalized continuous top-k queries",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2661829.2661851",
            "Abstract": "This demonstration presents MeowsReader, a real-time news ranking and filtering prototype. MeowsReader illustrates how a general class of continuous top-k queries offers a suitable abstraction for modeling and implementing real-time search services over highly dynamic information streams combining keyword search and realtime web signals about information items. Users express their interest by simple text queries and continuously receive the best matching results in an alert-like environment. The main innovative feature are dynamic item scores which take account of information decay, real-time web attention and other online user feedback. Additionally, a trends detection mechanism automatically generates trending entities from the input streams, which can smoothly be added to user profiles in form of keyword queries.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:tS2w5q8j5-wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-services: a look behind the curtain",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/773153.773154",
            "Abstract": "The emerging paradigm of electronic services promises to bring to distributed computation and services the flexibility that the web has brought to the sharing of documents. An understanding of fundamental properties of e-service composition is required in order to take full advantage of the paradigm. This paper examines proposals and standards for e-services from the perspectives of XML, data management, workflow, and process models. Key areas for study are identified, including behavioral service signatures, verification and synthesis techniques for composite services, analysis of service data manipulation commands, and XML analysis applied to service specifications. We give a sample of the relevant results and techniques in each of these areas.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Querying RDF Descriptions for Community Web Portals.",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=3155526702181453736&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diachronic linked data: towards long-term preservation of structured interrelated information",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2422604.2422610",
            "Abstract": "The Linked Data Paradigm is a promising technology for publishing, sharing, and connecting data on the Web, which provides new perspectives for data integration and interoperability. However, the proliferation of distributed, interconnected linked data sources on the Web poses significant new challenges for consistently managing the vast number of potentially large datasets and their interdependencies. In this article we focus on the key problem of preserving evolving structured interlinked data. We argue that a number of issues, which hinder applications and users, are related to the temporal aspect that is intrinsic in Linked Data. We present three use cases to motivate our approach, we discuss problems that occur, and propose a direction for a solution.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalizing Digital Library Access with Preference-Based Queries",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=727862725897200551&hl=en&oi=scholarr",
            "Abstract": "Searching a Digital Library (DL) using traditional database (DB) or knowledge base (KB) query-answering techniques is constrained by the precision and completeness of answers: precision may lead to an empty answer, while completeness may result to a huge answer. Yet reformulating the query-filtering conditions to avoid one handicap may lead to the other: that is, relaxing the filtering conditions may lead to a huge answer, while strengthening the conditions may lead to an empty answer. Using preference-based queries to personalize user access to a Digital Library allows result sets to be tuned between these two extremes.In general, a DL can be seen as a collection of documents residing in various information sources (on the Web). Each document can be naturally represented by a single row in the DL catalogue. A document's row contains its ID and description. The description involves a number of multi …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalisation Services for Self e-Learning Networks.",
            "Publication year": 2008,
            "Publication url": "https://www.dcs.bbk.ac.uk/~ap/pubs/SeLeNeChapterLearningGrid.pdf",
            "Abstract": "This chapter describes personalisation services for self e-learning networks. A self e-learning network consists of web-based learning objects that have been made available to the network by its users, along with metadata descriptions of these learning objects and of the network’s users. The proposed personalisation facilities include: querying learning object descriptions to return results tailored towards users’ individual goals and preferences; the ability to define views over the learning object metadata; facilities for defining new composite learning objects and automatically deriving their descriptions; and facilities for subscribing to personalised event and change notification services. The personalisation facilities are realised using a combination of Semantic Web technologies including RDF/S, RQL, RVL, and RDF ECA rules.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Big data entity resolution: From highly to somehow similar entity descriptions in the web",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7363781/",
            "Abstract": "In the Web of data, entities are described by interlinked data rather than documents on the Web. In this work, we focus on entity resolution in the Web of data, i.e., identifying descriptions that refer to the same real-world entity. To reduce the required number of pairwise comparisons, methods for entity resolution perform blocking as a pre-processing step. A blocking technique places similar entity descriptions into blocks and executes comparisons only between descriptions within the same block. We experimentally evaluate blocking techniques proposed for the Web of data and present dataset characteristics that determine the effectiveness and efficiency of such methods. Furthermore, we analyze the characteristics of the missed matching entity descriptions and examine different types of links that blocking techniques can potentially identify.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "EU-NSF digital library working group on interoperability between digital libraries",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7004437538646237474&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Declarative Languages for Querying Portal Catalogs.",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/41618843/DelosWorkshop.PDF",
            "Abstract": "Declarative Languages for Querying Portal Catalogs What is a Community Web ? Page 1 1 1 1 \nICS-FORTH & Univ. of Crete Christophides Vassilis December 2000 Declarative Languages for \nQuerying Portal Catalogs V. Christophides D. Plexousakis G. Karvounarakis S. Alexaki \nComputer Science Department, University of Crete Institute for Computer Science - FORTH \nHeraklion, Crete 2 ICS-FORTH & Univ. of Crete Christophides Vassilis December 2000 What is \na Community Web ? n A group of people sharing a domain of discourse and a set of information \nresources (eg, data, documents, services) and having some common interests gCommerce, \nEducation, Health n The main requirement is to provide a single point of useful, ubiquitous \ncomprehensive, and integrated access to various information resources gWeb Portals C-Web \nEducation Health Commerce Workplace Page 2 2 2 3 ICS-FORTH & Univ. of Crete On-…",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RUL: A declarative update language for RDF",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11574620_37",
            "Abstract": "We propose a declarative update language for RDF graphs which is based on the paradigms of query and view languages RQL and RVL. Our language, called RUL, ensures that the execution of the update primitives on nodes and arcs neither violates the semantics of the RDF model nor the semantics of the given RDFS schema. In addition, RUL supports fine-grained updates at the class and property instance level, set-oriented updates with a deterministic semantics and takes benefit of the full expressive power of RQL for restricting the range of variables to nodes and arcs of RDF graphs.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Minoan ER: progressive entity resolution in the web of data",
            "Publication year": 2016,
            "Publication url": "https://hal.inria.fr/hal-01411910/",
            "Abstract": "Entity resolution aims to identify descriptions of the same entity within or across knowledge bases. In this work, we present the Minoan ER platform for resolving entities described by linked data in the Web (e.g., in RDF). To reduce the required number of comparisons, Minoan ER performs blocking to place similar descriptions into blocks and executes comparisons to identify matches only between descriptions within the same block. Moreover, it explores in a pay-as-you-go fashion any intermediate results of matching to obtain similarity evidence of entity neighbors and discover new candidate description pairs for resolution.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Scheduling of Streaming Operators for IoT Edge Analytics",
            "Publication year": 2021,
            "Publication url": "https://hal.inria.fr/hal-03413549/",
            "Abstract": "Data stream processing and analytics (DSPA) applications are widely used to process the ever increasing amounts of data streams produced by highly geographical distributed data sources such as fixed and mobile IoT devices in order to extract valuable information in a timely manner for real-time actuation. To efficiently handle this ever increasing amount of data streams, the emerging Edge/Fog computing paradigms is used as the middle-tier between the Cloud and the IoT devices to process data streams closer to their sources and to reduce the network resource usage and network delay to reach the Cloud. In this paper, we account for the fact that both network resources and computational resources can be limited and shareable among multiple DSPA applications in the Edge-Fog-Cloud architecture, hence it is necessary to ensure their efficient usage. In this respect, we propose a resource-aware and time-efficient heuristic called SOO that identifies a good DSPA operator placement on the Edge-Fog-Cloud architecture towards optimizing the trade-off between the computational and network resource usage. Via thorough simulation experiments, we show that the solution provided by SOO is very close to the optimal one while the execution time is considerably reduced.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SIOTOME: An edge-ISP collaborative architecture for IoT security",
            "Publication year": 2018,
            "Publication url": "https://netsec.ethz.ch/publications/papers/SIOTOME_2018iot.pdf",
            "Abstract": "Modern households are deploying Internet of Things (IoT) devices at a fast pace. The heterogeneity of these devices, which range from low-end sensors to smart TVs, make securing home IoT particularly challenging. To make matters worse, many consumer-IoT devices are hard or impossible to secure because device manufacturers fail to adopt security best practices (eg, regular software patches). In this paper we propose a novel, cooperative system between the home gateway and the Internet Service Provider (ISP) to provide data driven security solutions for detecting and isolating IoT security attacks. Our approach is based on a combination of a large-scale view from the ISP (using powerful machine learning techniques on traffic traces), and the fine-grained view of the per-device activity from the home (using edge processing techniques) to provide efficient, yet privacy-aware IoT security services.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Conference review: Semantic Web Workshop: models, architectures and management",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/fullHtml/10.1145/378116.378124",
            "Abstract": "In 1998 the World-Wide Web Consortium (W3C) inaugurated a research initiative centered on the idea of providing semantics for and facilitating the extraction of knowledge from the World-Wide Web. The Semantic Web is a vision of the creator of the WWW, Tim Berners-Lee, who describes it as “a Web of data, documents, or portions of documents, that can be processed directly or indirectly by machines” not just for display purposes, but for automation, integration and reuse across various applications. The primary goal of the Semantic Web is to define infrastructure, standards, and policies facilitating an explicit description of the meaning of Web resources that can be processed both by automated tools and people. This effort towards the next evolution step of the Web has given rise to a large number of research problems that relate to models, architectures, applications, and services for the Semantic Web. The …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:2P1L_qKh6hAC",
            "Publisher": "ACM"
        },
        {
            "Title": "A greedy feature selection algorithm for Big Data of high dimensionality",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10994-018-5748-7",
            "Abstract": "We present the Parallel, Forward–Backward with Pruning (PFBP) algorithm for feature selection (FS) for Big Data of high dimensionality. PFBP partitions the data matrix both in terms of rows as well as columns. By employing the concepts of p-values of conditional independence tests and meta-analysis techniques, PFBP relies only on computations local to a partition while minimizing communication costs, thus massively parallelizing computations. Similar techniques for combining local computations are also employed to create the final predictive model. PFBP employs asymptotically sound heuristics to make early, approximate decisions, such as Early Dropping of features from consideration in subsequent iterations, Early Stopping of consideration of features within the same iteration, or Early Return of the winner in each iteration. PFBP provides asymptotic guarantees of optimality for data distributions …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Techniques d'indexation de souscriptions pour la syndication web",
            "Publication year": 2013,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=27948585",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D02 Computer science; control theory; systems/001D02B Software/001D02B07 Memory organisation. Data processing/001D02B07C Memory and file management (including protection and security)",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finding Similar Sets",
            "Publication year": 2017,
            "Publication url": "https://who.rocq.inria.fr/Vassilis.Christophides/Big/lectures/bigdata-similarity19.pdf",
            "Abstract": "Dynamic and Distributed Scheduling in Communication Networks and Manufacturing \nSystems Page 1 1 1 1 Summer 2019 Finding Similar Sets Vassilis Christophides https://who.rocq.inria.fr/Vassilis.Christophides/Big/index.htm \nUniversity of Piraeus & INRIA Paris Summer 2019 2 Summer 2019 Motivation • Many Web-mining \nproblems can be expressed as finding “similar” sets: ♦Pages with similar words, eg, for \nclassification by topic ♦NetFlix users with similar tastes in movies for recommendation \nsystems Dual: movies with similar sets of fans ♦Images of related things • The best \ntechniques depend on whether you are looking for items that are very similar or only \nsomewhat similar ♦Special cases are easy, eg, identical documents, or one document \ncontained character-by-character in another ♦General case, where many small pieces of \none document appear out of order in another, is very hard Page 2 2 2 3 Summer for …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "E-Learning standards",
            "Publication year": 2003,
            "Publication url": "https://www.dcs.bbk.ac.uk/~ap/projects/selene/reports/seleneELearningStandards.pdf",
            "Abstract": "The scope of this document is to present an overview of existing standardization efforts for metadata associated with learning objects with a focus on their semantics and their capability to describe objects at different levels of granularity. Relying on a widely accepted definition of learning content available on corporate networks or the Internet, we detail the main features and structure of Learning Objects and present the most widely accepted metadata models proposed during the last years, as well as their interrelationships.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "KP-LAB Knowledge Practices Laboratory--Specifications and Prototype of the Knowledge Repository (V. 3.0) and the Knowledge Mediator (V. 3.0)",
            "Publication year": 2009,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00593216/",
            "Abstract": "This deliverable reports the technical and research development performed until M36 (January 2009) within tasks T5.2 and T5.4 of WP5 in the KP-Lab project, per the latest Description of Work (DoW) 3.2 [DoW3.2]. The described components are included in the KP-Lab Semantic Web Knowledge Middleware (SWKM) Prototype Release 3.0 software that takes place in M36. This release builds on the Prototype Release 2.0 that was presented in [D5.4]. The present deliverable includes both the specification, as well as the implementation details for the described components. The description of the features of the new functionalities is provided based on the motivating scenarios and the subsequent functional requirements. The focus and the high-level objective of the new services is the provision of improved scalability and modularity properties on the existing services, as well as improved management abilities upon conceptualizations. The implementation of the services is described by providing the related services   signatures, their proper way of use, the accepted input parameters, as well as their preconditions and effects. Initially, we describe the Delete Service, which is a Knowledge Repository service allowing the removal of existing namespaces from the repository; such removal includes the deletion of the contents of said namespaces, as well as the deletion of any reference to the namespaces themselves that exists in the repository. This new service enhances SWKM management capabilities upon conceptualizations. Then, the Named Graphs functionality is described, which is a new feature that allows a very flexible modularization of the …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The KP-lab framework for knowledge creation practices",
            "Publication year": 2007,
            "Publication url": "https://researchportal.helsinki.fi/en/publications/the-kp-lab-framework-for-knowledge-creation-practices",
            "Abstract": "The KP-lab framework for knowledge creation practices — University of Helsinki Skip to \nmain navigation Skip to search Skip to main content University of Helsinki Logo \nAccessibility statement English Svenska Suomi Home Persons Publications Projects \nResearch Infrastructures Research Units Datasets Activities Prizes Press / Media Search by \nexpertise, name or affiliation The KP-lab framework for knowledge creation practices \nDimitris Kotzinos, Vassilis Christophides, Liisa Ilomäki Research output: Contribution to \njournal › Article › Scientific › peer-review Overview Projects (1) Original language English \nJournal ERCIM news Volume 2007 Issue number 71 Pages (from-to) 26-27 Number of \npages 2 ISSN 0926-4981 Publication status Published - 2007 MoE publication type A1 \nJournal article-refereed Fields of Science 515 Psychology Projects Projects per year 2006 \n2011 1 Finished Knowledge Practices Laboratory , L..…",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:e5wmG9Sq2KIC",
            "Publisher": "European Research Consortium for Informatics and Mathematics"
        },
        {
            "Title": "Coloring RDF triples to capture provenance",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04930-9_13",
            "Abstract": "Recently, the W3C Linking Open Data effort has boosted the publication and inter-linkage of large amounts of RDF datasets on the Semantic Web. Various ontologies and knowledge bases with millions of RDF triples from Wikipedia and other sources, mostly in e-science, have been created and are publicly available. Recording provenance information of RDF triples aggregated from different heterogeneous sources is crucial in order to effectively support trust mechanisms, digital rights and privacy policies. Managing provenance becomes even more important when we consider not only explicitly stated but also implicit triples (through RDFS inference rules) in conjunction with declarative languages for querying and updating RDF graphs. In this paper we rely on colored RDF triples represented as quadruples to capture and manipulate explicit provenance information.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Semantic query routing and processing in P2P database systems: The ICS-FORTH SQPeer middleware",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30192-9_48",
            "Abstract": "Peer-to-peer (P2P) computing is currently attracting enormous attention. In P2P systems a very large number of autonomous computing nodes (the peers) pool together their resources and rely on each other for data and services. More and more P2P data management systems rely nowadays on intensional (i.e. schema) information for integrating and querying peer bases. Such information can be easily captured by emerging Semantic Web languages such as RDF/S. However, a fully-fledged framework for evaluating semantic queries over peer RDF/S bases (materialized or virtual) is missing. In this paper we present the ICS-FORTH SQPeer middleware for routing and processing RQL queries and RVL views. The novelty of SQPeer lies on the use of intensional active schemas for determining relevant peer bases, as well as, constructing distributed query plans. In this context, we consider optimization …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:LPZeul_q3PIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Ontology storage and querying",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=10059499250184749279&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "RoSeS, un moteur de requêtes continues pour la syndication RSS à large échelle",
            "Publication year": 2012,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=26615565",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "STORAGE AND QUERYING",
            "Publication year": 2002,
            "Publication url": "https://projects.ics.forth.gr/isl/publications/paperlink/tr308.pdf",
            "Abstract": "The necessity for ontology building, annotating, integrating and learning tools is uncontested. However, the sole representation of knowledge and information is not enough. Human information consumers and web agents have to use and query ontologies and the resources committed to them, thus the need for ontology storage and querying tools arises. However, the context of storing and querying knowledge has changed due to the wide acceptance and use of the Web as a platform for communicating knowledge. New languages for querying (meta) data based on web standards (eg, XML [23], RDF [17], Topic Maps [16]) have emerged to enable the acquisition of knowledge from dispersed information sources, while the traditional database storage techniques have been adapted to deal with the peculiarities of the (semi) structured data on the web.The purpose of this chapter is to briefly present and evaluate a set of query languages and associated tools for ontology/resource storage and querying aiming to support large-scale Semantic Web [3] applications, the next evolution step of the Web. This list of languages and tools is by no means complete and the tools presented are indicative of the tendency to provide full storage and query support to web-based ontology/metadata standards, such as RDF [17], RDFS [4], Topic Maps [16], DAML+ OIL [9] or the forthcoming Web Ontology Language [15]. Our work in this chapter focuses on the evaluation of querying languages designed for Semantic Web related knowledge representation formalisms rather than general-purpose querying languages (eg, SQL, Datalog, F-logic). Although it has to be …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:HE397vMXCloC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On labeling schemes for the semantic web",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/775152.775230",
            "Abstract": "This paper focuses on the optimization of the navigation through voluminous subsumption hierarchies of topics employed by Portal Catalogs like Netscape Open Directory (ODP). We advocate for the use of labeling schemes for modeling these hierarchies in order to efficiently answer queries such as subsumption check, descendants, ancestors or nearest common ancestor, which usually require costly transitive closure computations. We first give a qualitative comparison of three main families of schemes, namely bit vector, prefix and interval based schemes. We then show that two labeling schemes are good candidates for an efficient implementation of label querying using standard relational DBMS, namely, the Dewey Prefix scheme [6] and an Interval scheme by Agrawal, Borgida and Jagadish [1]. We compare their storage and query evaluation performance for the 16 ODP hierarchies using the PostgreSQL engine.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online Detection of Topic Change in Social Posts",
            "Publication year": 2014,
            "Publication url": "https://hal.univ-grenoble-alpes.fr/hal-00946969/",
            "Abstract": "Gaining deep insights of the social Web content is a challenging Big Data analytics problem, especially when dealing with social posts of high volume and arrival rate consisting of high variable topics. Detecting and tracking the topics that the users discuss in popular microblogging applications like Twitter and studying the evolution of each topic reveals crowd interests and intelligence. The evolution summarizes the changes that are occurring on the topics over a given time horizon inside the evolving data stream. For instance, some topics may disappear at some point in time due to lack of users' interest, while others are retained over time adopting either a stable or an evolving behaviour. The analysis and storage of such dynamic and massive content with spatio-thematic properties poses new challenges for research.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The syntactic web",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.16.4339&rep=rep1&type=pdf",
            "Abstract": "XQuery is a query language designed to allow queries across the many kinds of information that are represented in XML. Although topic maps and RDF can also be represented in XML, many have held that their many possible syntactic forms make them extremely difficult to query using an XML query language, and that they can only be queried using special-purpose query languages with built-in knowledge of their semantics, including the ability to exploit RDF schema information. This talk shows that XQuery can, in fact, be used to solve the kinds of queries for which RDF and topic map query languages were designed, though with a loss of type safety.The approach taken is to transform instances of RDF and topic maps to a syntactic representation that closely models their underlying logical models, and to use function libraries written in XQuery to directly support operations specific to RDF or topic maps. Schema level information is also incorporated in this representation, and is supported in the library, so queries can exploit type hierarchies and perform joins across predicates.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:nrtMV_XWKgEC",
            "Publisher": "MIT PRESS"
        },
        {
            "Title": "The Semantic Web: Key Ideas",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/30823624/Encyclopedia.pdf",
            "Abstract": "The World Wide Web (Berners-Lee, Cailliau & Groff, 1992; Berners-Lee, 1999) has changed the way people communicate with each other and the way business is conducted. It lies at the heart of a revolution which is currently transforming the developed world towards a knowledge economy (Neef, 1997), and more broadly speaking, to a knowledge society.Most of today's Web content is suitable for human consumption. Even Web content that is generated automatically from data bases is usually presented without the original structural information found in data bases. Typical uses of the Web today involve humans seeking and consuming information, searching and getting in touch with other humans, reviewing the catalogs of online stores and ordering products by filling out forms.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Processing continuous text queries featuring non-homogeneous scoring functions",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2396761.2398404",
            "Abstract": "In this work we are interested in the scalable processing of content filtering queries over text item streams. In particular, we are aiming to generalize state of the art solutions with non-homogeneous scoring functions combining query-independent item importance with query-dependent content relevance. While such complex ranking functions are widely used in web search engines this is to our knowledge the first scientific work studying their usage in a continuous query scenario. Our main contribution consists in the definition and the evaluation of new efficient in-memory data structures for indexing continuous top-k queries based on an original two-dimensional representation of text queries. We are exploring locally-optimal score bounds and heuristics that efficiently prune the search space of candidate top-k query results which have to be updated at the arrival of new stream items. Finally, we experimentally …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantics and Pragmatics of Preference Queries in Digital Libraries",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.189.3017&rep=rep1&type=pdf",
            "Abstract": "As information becomes available in increasing amounts, and to growing numbers of users, the shift towards a more user-centered, or personalized access to information becomes crucial. In this paper we consider the semantics and pragmatics of preference queries over tables containing information objects described through a set of attributes. In particular, we address two basic issues:–how to define a preference query and its answer (semantics)–how to evaluate a preference query (pragmatics) With respect to existing work, our main contributions are (a) the proposal of an expressive language for declaring qualitative preferences,(b) a unified framework for expressing and evaluating both quantitative and qualitative preference queries and (c) rewriting algorithms for processing such queries. Although our main motivation originates in digital libraries, our proposal is quite general and can be used in several application contexts.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Querying temporal drifts at multiple granularities",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2806416.2806436",
            "Abstract": "There exists a large body of work on online drift detection with the goal of dynamically finding and maintaining changes in data streams. In this paper, we adopt a query-based approach to drift detection. Our approach relies on a drift index, a structure that captures drift at different time granularities and enables flexible drift queries. We formalize different drift queries that represent real-world scenarios and develop query evaluation algorithms that use different materializations of the drift index as well as strategies for online index maintenance. We describe a thorough study of the performance of our algorithms on real-world and synthetic datasets with varying change rates.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the foundations of computing deltas between rdf models",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-76298-0_46",
            "Abstract": "The ability to compute the differences that exist between two RDF models is an important step to cope with the evolving nature of the Semantic Web (SW). In particular, RDF Deltas can be employed to reduce the amount of data that need to be exchanged and managed over the network and hence build advanced SW synchronization and versioning services. By considering Deltas as sets of change operations, in this paper we study various RDF comparison functions in conjunction with the semantics of the underlying change operations and formally analyze their possible combinations in terms of correctness, minimality, semantic identity and redundancy properties.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Z39. 50 wrapping and description logics",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s007990000036.pdf",
            "Abstract": "Z39.50 is a client/server protocol widely used in digital libraries and museums for searching and retrieving information spread over a number of heterogeneous sources. To overcome semantic and schematic discrepancies among the various data sources the protocol relies on a world view of information as a flat list of fields, called Access Points (AP). One of the major issues for building Z39.50 wrappers is to map this unstructured list of APs to the underlying source data structure and semantics. For highly structured sources (e.g., database management systems, knowledge base systems) this mapping is quite complex and considerably affects the quality of the retrieved data. Unfortunately, existing Z39.50 wrappers have been developed from scratch and they do not provide high-level mapping languages with verifiable properties. In this paper, we propose a description logic (DL) based toolkit for the …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "FairER: Entity Resolution With Fairness Constraints",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3459637.3482105",
            "Abstract": "There is an urgent call to detect and prevent\" biased data\" at the earliest possible stage of the data pipelines used to build automated decision-making systems. In this paper, we are focusing on controlling the data bias in entity resolution (ER) tasks aiming to discover and unify records/descriptions from different data sources that refer to the same real-world entity. We formally define the ER problem with fairness constraints ensuring that all groups of entities have similar chances to be resolved. Then, we introduce FairER, a greedy algorithm for solving this problem for fairness criteria based on equal matching decisions. Our experiments show that FairER achieves similar or higher accuracy against two baseline methods over 7 datasets, while guaranteeing minimal bias.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A practical method for measuring web above-the-fold time",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3234200.3234221",
            "Abstract": "Page load time (PLT) is still the most common application Quality of Service (QoS) metric to estimate the Quality of Experience (QoE) of Web users. Yet, recent literature abounds with interesting proposals for alternative metrics (eg, Above The Fold, SpeedIndex and variants) that aim at closely capturing how users perceive the Webpage rendering process. However, these novel metrics are typically computationally expensive, as they require to monitor and post-process videos of the rendering process, and have failed to be widely deployed.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Content-based publish/subscribe system for web syndication",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11390-016-1632-8.pdf",
            "Abstract": "Content syndication has become a popular way for timely delivery of frequently updated information on the Web. Today, web syndication technologies such as RSS or Atom are used in a wide variety of applications spreading from large-scale news broadcasting to medium-scale information sharing in scientific and professional communities. However, they exhibit serious limitations for dealing with information overload in Web 2.0. There is a vital need for efficient real-time filtering methods across feeds, to allow users to effectively follow personally interesting information. We investigate in this paper three indexing techniques for users’ subscriptions based on inverted lists or on an ordered trie for exact and partial matching. We present analytical models for memory requirements and matching time and we conduct a thorough experimental evaluation to exhibit the impact of critical parameters of realistic web …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:eflP2zaiRacC",
            "Publisher": "Springer US"
        },
        {
            "Title": "On wrapping query languages and efficient XML integration",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/342009.335395",
            "Abstract": "Modern applications (Web portals, digital libraries, etc.) require integrated access to various information sources (from traditional DBMS to semistructured Web repositories), fast deployment and low maintenance cost in a rapidly evolving environment. Because of its flexibility, there is an increasing interest in using XML as a middleware model for such applications. XML enables fast wrapping and declarative integration. However, query processing in XML-based integration systems is still penalized by the lack of an algebra with adequate optimization properties and the difficulty to understand source query capabilities. In this paper, we propose an algebraic approach to support efficient XML query evaluation. We define a general purpose algebra suitable for semistructured on XML query languages. We show how this algebra can be used, with appropriate type information, to also wrap more structured query …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Online curriculum on the semantic Web: the CSD-UoC portal for peer-to-peer e-learning",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1060745.1060792",
            "Abstract": "Online Curriculum Portals aim to support networks of instructors and learners by providing a space of convergence for enhancing peer-to-peer learning interactions among individuals of an educational institution. To this end, effective, open and scalable e-learning systems are required to acquire, store, and share knowledge under the form of learning objects (LO). In this paper, we are interested in exploiting the semantic relationships that characterize these LOs (eg, prerequisite, part-of or see-also) in order to capture and access individual and group knowledge in conjunction with the learning processes supported by educational institutions. To achieve this functionality, Semantic Web (eg, RDF/s) and declarative query languages (eg, RQL) are employed to represent LOs and their relationships (eg, LOM), as well as, to support navigation at the conceptual e-learning Portal space. In this way, different LOs could be …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MinoanER: Schema-Agnostic, Non-Iterative, Massively Parallel Resolution of Web Entities",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Algebraic structures for capturing the provenance of SPARQL queries",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2810037",
            "Abstract": "The evaluation of SPARQL algebra queries on various kinds of annotated RDF graphs can be seen as a particular case of the evaluation of these queries on RDF graphs annotated with elements of so-called spm-semirings. Spm-semirings extend semirings, used for representing the provenance of positive relational algebra queries on annotated relational data, with a new operator to capture the semantics of the non-monotone SPARQL operators. Furthermore, spm-semiring-based annotations ensure that desired SPARQL query equivalences hold when querying annotated RDF. In this work, in addition to introducing spm-semirings, we study their properties and provide an alternative characterization of these structures in terms of semirings with an embedded boolean algebra (or seba-structure for short). This characterization allows us to construct spm-semirings and identify a universal object in the class of spm …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:Zph67rFs4hoC",
            "Publisher": "ACM"
        },
        {
            "Title": "A Data, Computation and Knowledge Grid: the case of the ARION system",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.144.9852",
            "Abstract": "The ARION system provides basic e-services of search and retrieval of objects in scientific collections, such as, datasets, simulation models and tools necessary for statistical and/or visualization processing. These collections may represent application software of scientific areas, they reside in geographically disperse organizations and constitute the system content. The user may invoke on-line computations of scientific datasets when the latter are not found into the system. Thus, ARION provides the basic infrastructure for accessing and deriving scientific information in an open, distributed and federated system. 1",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "18. RQL: A Functional Query Language for",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=FtmoCAAAQBAJ&oi=fnd&pg=PA435&dq=info:OgD2X6OwXgMJ:scholar.google.com&ots=kgtUDbFJl1&sig=26QO03eNuLF5dHbwf2mHhkR8_WI",
            "Abstract": "Although real-scale Semantic Web applications, such as Knowledge Portals and E-Marketplaces, require the management of voluminous resource metadata, sufficiently expressive declarative languages for metadata created according to the W3C RDF/S standard\" are still missing. In an-swer to this need, we have designed a typed, functional query language, called RQL, whose novelty lies in its ability to smoothly combine schema and data querying. The purpose of this chapter is to present RQL's formal data model and type system and illustrate its expressiveness by means of exemplary queries. RQL's formal foundations capture the RDF/S model-ing primitives and provide a well-founded semantics for a declarative query language involving recursion and functional composition over complex description graphs.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "KP-LAB Knowledge Practices Laboratory--Specifications for the Knowledge Matchmaker (V. 2.0), the Knowledge Synthesizer (V. 1.0) and the Analytical and Knowledge Mining Services (V. 1.0)",
            "Publication year": 2009,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00593219/",
            "Abstract": "This deliverable presents specifications of three components responsible for advanced manipulation with the knowledge stored in the KP-Lab Semantic Web Knowledge Middleware (SWKM). It starts with motivating scenarios defined within various Working Knots (WKs), extracting relevant functional requirements and mapping them on the high-level requirements, of particular driving objectives and user tasks (described in deliverable [D2.4]). The first component is Knowledge Matchmaker (V2.0), which utilizes various text mining, information extraction, and heuristic methods for advanced access to and manipulation with shared knowledge artefacts according to the explicit meaning of artefacts expressed by their textual content, as well as metadata, including semantic tagging. This second version presents a set of completely new services supporting miscellaneous functionalities such as support for semantic tagging process, search for similar artefacts, information extraction capabilities, as well as recommendation services. Next two components are completely new. The Knowledge Synthesizer (V1.0) can be used to combine information found in multiple sources; this feature is necessary to allow automated merging of the conceptualizations modeled in independently edited conceptualizations. The Analytical and Knowledge Mining Services (V1.0) provide means for analyzing participation and activities within past or running knowledge creation processes, as well as for support of knowledge evolution analysis (e.g. via identification of critical patterns in selected knowledge creation processes).",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On detecting high-level changes in RDF/S KBs",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04930-9_30",
            "Abstract": "An increasing number of scientific communities rely on Semantic Web ontologies to share and interpret data within and across research domains. These common knowledge representation resources are usually developed and maintained manually and essentially co-evolve along with experimental evidence produced by scientists worldwide. Detecting automatically the differences between (two) versions of the same ontology in order to store or visualize their deltas is a challenging task for e-science. In this paper, we focus on languages allowing the formulation of concise and intuitive deltas, which are expressive enough to describe unambiguously any possible change and that can be effectively and efficiently detected. We propose a specific language that provably exhibits those characteristics and provide a change detection algorithm which is sound and complete with respect to the proposed language …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "RQL: A functional query language for RDF",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-05372-0_18",
            "Abstract": "Although real-scale Semantic Web applications, such as Knowledge Portals and E-Marketplaces, require the management of voluminous resource metadata, sufficiently expressive declarative languages for metadata created according to the W3C RDF/S standard1 are still missing. In answer to this need, we have designed a typed, functional query language, called RQL, whose novelty lies in its ability to smoothly combine schema and data querying. The purpose of this chapter is to present RQL’s formal data model and type system and illustrate its expressiveness by means of exemplary queries. RQL’s formal foundations capture the RDF/S modeling primitives and provide a well-founded semantics for a declarative query language involving recursion and functional composition over complex description graphs.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Application of the peer-to-peer paradigm in digital libraries",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77088-6_31",
            "Abstract": "We present the architecture of a largely distributed Digital Library that is based on the Peer-to-Peer computing paradigm. The three goals of the architecture are: (i) increased node autonomy, (ii) flexible location of data, and (iii) efficient query evaluation. To satisfy these goals we propose a solution based on schema mappings and query reformulation. We identify the problems involved in developing a system based on the proposed architecture and present ways of tackling them. A prototype implementation provides encouraging results.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A survey on ontology tools",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=15729860733681745778&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The IST Programme Key Action 3 Action Line IST-2000-3.1. 4 Contract number IST-2000-26074 Deliverable D3. 2.2",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=10028991694955913160&hl=en&oi=scholarr",
            "Abstract": "RQL is a functional language for processing RDF resource descriptions and schemas: it is defined by a set of basic queries (first order functions) and iterators (second order functions) which can be used to build new ones through functional composition. It relies on the design of the ODMG OQL Query Interpreter 3]. RQL queries are represented internally using a semantic representation with the following characteristics:",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On computing deltas of RDF/S knowledge bases",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1993053.1993056",
            "Abstract": "The ability to compute the differences that exist between two RDF/S Knowledge Bases (KB) is an important step to cope with the evolving nature of the Semantic Web (SW). In particular, RDF/S deltas can be employed to reduce the amount of data that need to be exchanged and managed over the network in order to build SW synchronization and versioning services. By considering deltas as sets of change operations, in this article we introduce various RDF/S differential functions which take into account inferred knowledge from an RDF/S knowledge base. We first study their correctness in transforming a source to a target RDF/S knowledge base in conjunction with the semantics of the employed change operations (i.e., with or without side-effects on inferred knowledge). Then we formally analyze desired properties of RDF/S deltas such as size minimality, semantic identity, redundancy elimination, reversibility, and …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:SdhP9T11ey4C",
            "Publisher": "ACM"
        },
        {
            "Title": "Viewing the semantic web through RVL lenses",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39718-2_7",
            "Abstract": "Personalized access and content syndication involving diverse conceptual representations of information resources are two of the key challenges of real-scale Semantic Web (SW) applications, such as e-Commerce, e-Learning or e-Science portals. RDF/S represents nowadays the core SW language for creating and exchanging resource descriptions worldwide. Unfortunately, full-fledged view definition languages for the RDF/S data model are still missing. We propose RVL, a view definition language capable of creating not only virtual resource descriptions, but also virtual RDF/S schemas from (meta)classes, properties, as well as, resource descriptions available on the Semantic Web. RVL exploits the functional nature and type system of the RQL query language in order to navigate, filter and restructure complex RDF/S schema and resource description graphs.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Uncertainty-aware sensor data management and early warning for monitoring industrial infrastructures",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/article/uncertainty-aware-sensor-data-management-and-early-warning-for-monitoring-industrial-infrastructures/133280",
            "Abstract": "In several industrial applications, monitoring large-scale infrastructures in order to provide notifications for abnormal behavior is of high significance. For this purpose, the deployment of large-scale sensor networks is the current trend. However, this results in handling vast amounts of low-level, and often unreliable, data, while an efficient and real-time data manipulation is a strong demand. In this paper, the authors propose an uncertainty-aware data management system capable of monitoring interrelations between large and heterogeneous sensor data streams in real-time. To this end, an efficient similarity function is employed instead of the typical correlation coefficient to monitor dynamic phenomena for timely alerting notifications, and to guarantee the validity of detected extreme events. Experimental evaluation with a set of real data recorded by distinct sensors in an industrial water desalination plant reveals a …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:GnPB-g6toBAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Beyond discrete e-services: Composing session-oriented services in telecommunications",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44809-8_5",
            "Abstract": "We distinguish between two broad categories of e-services: discrete services (e.g., add item to shopping cart, charge a credit card), and session-oriented ones (teleconference, collaborative text chat, streaming video, c-commerce interactions). Discrete services typically have short duration, and cannot respond to external asynchronous events. Session-oriented services have longer duration (perhaps hours), and typically can respond to asynchronous events (e.g., the ability to add a new participant to a teleconference). When composing discrete e-services it usually suffices to use a process model and engine that composes the e-services as relatively independent tasks. But when composing session-oriented e-services, the engine must be able to receive asynchronous events and determine how and whether to impact the active sessions. For example, if a teleconference participant loses his wireless …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Report on the workshop on metadata management in grid and peer-to-peer systems, London, December 16 2003",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1031570.1031592",
            "Abstract": "A workshop on Metadata Management in Grid and Peer-to-Peer Systems was held in the Senate House of the University of London on December 16 2003.1 The workshop was organised by the SeLeNe (Self e-Learning Networks) IST project as part of its dissemination activities.2 The goal of the workshop was to identify recent technological achievements and open challenges regarding metadata management in novel applications requiring peer-to-peer information management in a distributed or Grid setting. The target audience for this event were researchers from the Grid, peer-to-peer and e-learning communities, as well as other application areas requiring Grid and/or peer-to-peer support. The event attracted 43 participants from 8 different European countries, and we believe that it was an important step in coordinating research activities in these inter-related areas. The presentations at the workshop fell into …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:kzcrU_BdoSEC",
            "Publisher": "ACM"
        },
        {
            "Title": "Report on the first international workshop on personal data analytics in the internet of things (PDA@ IOT 2014)",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/2783888.2783905",
            "Abstract": "In the last few years, we are witnessing a wave of connected things (ie, devices) that are flooding our everyday living spaces. These networks of physical objects with embedded sensors and actuators that communicate with other objects, databases, and in some cases with people, are often described under the umbrella term Internet of Things (IoT). Recent studies1 estimate that by 2020 the IoT will scale up to 50 billion daily-use objects, while its economic value will reach $14.4 trillion dollars, spread across all sectors (both consumer2 and industrial3 markets). According to the IoT vision,“smart things” will “disappear” in our living environments (aka Pervasive Computing), or be embodied in humans (aka Wearable Computing, with the goal of building disruptive services for humanbeings, offering a seamless and implicit interaction between the real and the virtual worlds.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:b0M2c_1WBrUC",
            "Publisher": "ACM"
        },
        {
            "Title": "PoweRGen: A power-law based generator of RDFS schemas",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437911001141",
            "Abstract": "As the amount of RDF datasets available on the Web has grown significantly over the last years, scalability and performance of Semantic Web (SW) systems are gaining importance. Current RDF benchmarking efforts either consider schema-less RDF datasets or rely on fixed RDFS schemas. In this paper, we present the first RDFS schema generator, termed PoweRGen, which takes into account the features exhibited by real SW schemas. It considers the power-law functions involved in (a) the combined in-and out-degree distribution of the property graph (which captures the domains and ranges of the properties defined in a schema) and (b) the out-degree distribution of the transitive closure (TC) of the subsumption graph (which essentially captures the class hierarchy). The synthetic schemas generated by PoweRGen respect the power-law functions given as input with an accuracy ranging between 89 and 96%, as …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:_kc_bZDykSQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Trialogical E-learning and emergent knowledge artifacts",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11876663_76",
            "Abstract": "According to the recently emerged, trialogical learning (TL) paradigm, learners are collaboratively developing shared objects of activity in a systematic fashion. In this paper we propose a basic learning scenario according to the TL paradigm. With this scenario as gnomon, we elaborate the technical issues that are raised for supporting it and we propose a flexible novel method for defining various aspects of the group knowledge.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "THE ODMG OQL OPTIMISATION",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=14589692186337551178&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontology evolution: A framework and its application to rdf",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.352.5886&rep=rep1&type=pdf",
            "Abstract": "The algorithms dealing with the incorporation of new knowledge in an ontology often share a rather standard process of dealing with changes. This process consists of the determination of the allowed change operations, the identification of the inconsistencies that could be caused by each such operation as well as the various alternatives to deal with each such inconsistency, and, finally, some (manual or automatic) selection mechanism that allows the determination of the “best” of these alternatives. Unfortunately, most ontology evolution algorithms implement these steps using a case-based, ad-hoc methodology, which is cumbersome and error-prone. In this paper we propose a general framework for ontology change management that generalizes the methodology employed by existing tools. The introduction of this framework allows us to devise a whole class of ontology evolution algorithms, which, due to their formal underpinnings, avoid many of the problems exhibited by ad-hoc frameworks. We exploit this framework by implementing a specific ontology evolution algorithm for RDF ontologies.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simplifying entity resolution on web data with schema-agnostic, non-iterative matching",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8509355/",
            "Abstract": "Entity Resolution (ER) aims to identify different descriptions in various Knowledge Bases (KBs) that refer to the same entity. ER is challenged by the Variety, Volume and Veracity of descriptions published in the Web of Data. To address them, we propose the MinoanER framework that fulfills full automation and support of highly heterogeneous entities. MinoanER leverages a token-based similarity of entities to define a new metric that derives the similarity of neighboring entities from the most important relations, indicated only by statistics. For high efficiency, similarities are computed from a set of schema-agnostic blocks and processed in a non-iterative way that involves four threshold-free heuristics. We demonstrate that the effectiveness of MinoanER is comparable to existing ER tools over real KBs exhibiting low heterogeneity in terms of entity types and content. Yet, MinoanER outperforms state-of-the-art ER tools …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On Predictive Explanation of Data Anomalies",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.09467",
            "Abstract": "Numerous algorithms have been proposed for detecting anomalies (outliers, novelties) in an unsupervised manner. Unfortunately, it is not trivial, in general, to understand why a given sample (record) is labelled as an anomaly and thus diagnose its root causes. We propose the following reduced-dimensionality, surrogate model approach to explain detector decisions: approximate the detection model with another one that employs only a small subset of features. Subsequently, samples can be visualized in this low-dimensionality space for human understanding. To this end, we develop PROTEUS, an AutoML pipeline to produce the surrogate model, specifically designed for feature selection on imbalanced datasets. The PROTEUS surrogate model can not only explain the training data, but also the out-of-sample (unseen) data. In other words, PROTEUS produces predictive explanations by approximating the decision surface of an unsupervised detector. PROTEUS is designed to return an accurate estimate of out-of-sample predictive performance to serve as a metric of the quality of the approximation. Computational experiments confirm the efficacy of PROTEUS to produce predictive explanations for different families of detectors and to reliably estimate their predictive performance in unseen data. Unlike several ad-hoc feature importance methods, PROTEUS is robust to high-dimensional data.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:EYYDruWGBe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Querying community web portals",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.16.3666",
            "Abstract": "Anewgeneration of information systems suchasorganizational memories, vertical aggregators, infomediaries, etc. is emerging nowadays. Such systems, termed CommunityWeb Portals, intend to support specific communities of interest (eg, enterprise, professional, trading) on corporate intranets or the Web. More precisely, Portal Catalogs, organize and describe various information resources (eg, sites, documents, data) for diverse target audiences (corporate, inter-enterprise, e-marketplace, etc.), in a multitude of ways, which are far more flexible and complex than those provided by standard (relational or object) databases. Yet, in commercial software for deploying CommunityPortals, querying is still limited to full-text (or attribute-value) retrieval and more advanced information-seeking needs implies navigational access. Furthermore, recentWeb standards for describing resources are completely ignored.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Continuous top-k queries over real-time web streams",
            "Publication year": 2016,
            "Publication url": "https://arxiv.org/abs/1610.06500",
            "Abstract": "The Web has become a large-scale real-time information system forcing us to revise both how to effectively assess relevance of information for a user and how to efficiently implement information retrieval and dissemination functionality. To increase information relevance, Real-time Web applications such as Twitter and Facebook, extend content and social-graph relevance scores with \"real-time\" user generated events (e.g. re-tweets, replies, likes). To accommodate high arrival rates of information items and user events we explore a publish/subscribe paradigm in which we index queries and update on the fly their results each time a new item and relevant events arrive. In this setting, we need to process continuous top-k text queries combining both static and dynamic scores. To the best of our knowledge, this is the first work addressing how non-predictable, dynamic scores can be handled in a continuous top-k query setting.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a causal analysis of video qoe from network and application qos",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2940136.2940142",
            "Abstract": "The relationship between the user perceived Quality of Experience (QoE) with Internet applications and the Quality of Service (QoS) of the underlying network and applications is complex. Unveiling statistical relations between QoE and QoS can boost the prediction and diagnosis of QoE. In this paper, we shed light on the relationship between QoE and QoS for a popular application: YouTube video streaming. We conducted a controlled study where we asked users to rate their perceived quality of YouTube videos under different network conditions. During this experiments, we also captured network QoS and application QoS. We then analyze the resulting dataset with SES, a feature selection algorithm that identifies multiple, minimal-size, statistically-equivalent signatures with maximal predictive power for a target variable (eg, QoE). We found that we can build optimal QoE predictors using a minimal signature of …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detecting Mobile Crowdsensing Context in the Wild",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8788829/",
            "Abstract": "Understanding the sensing context of raw data is crucial for assessing the quality of large crowdsourced spatio-temporal datasets. Detecting sensing contexts in the wild is a challenging task and requires features from smartphone sensors that are not always available. In this paper, we propose three heuristic algorithms for detecting sensing contexts such as in/out-pocket, under/over-ground, and in/out-door for crowdsourced datasets that are destined for human mobility mining. These are unsupervised binary classifiers with a small memory footprint and execution time. Using a segment of the Ambiciti real dataset - a feature-limited crowdsourced dataset - we report that our algorithms perform equally well in terms of balanced accuracy (within 4.3%) when compared to machine learning (ML) models reported by an AutoML tool.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WP2 deliverable 2.1: E-learning standards",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/30823619/Del21.pdf",
            "Abstract": "Learning objects are increasingly seen as key to a technology-based revolution in education and training, even to an emerging global knowledge economy. An international effort is underway to formulate standards that will enable Learning Object (LO) reuse and exchange among multiple educational settings, instructors, courses and institutions. The scope of this deliverable is to appropriately define the notion of learning content available on corporate networks or the Internet, as well as, to provide the core information modeling constructs of e-Learning applications. Hence, we survey several e-Learning standards and consider the feasibility of expressing them using Semantic Web languages, like RDF/S. We conclude our deliverable with the most important pedagogical limitations of existing standards, which are crucial for deploying a full-fledged Self e-Learning Network.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:CHSYGLWDkRkC",
            "Publisher": "Technical Report IST-2001-39045, SeLeNe: Self E-Learning Networks"
        },
        {
            "Title": "Semantic web fundamentals",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/semantic-web-fundamentals/14635",
            "Abstract": "The World Wide Web (Berners-Lee, Cailliau, & Groff, 1992; Berners-Lee, 1999) has changed the way people communicate with each other and the way business is conducted. It lies at the heart of a revolution that is currently transforming the developed world toward a knowledge economy (Neef, 1997), and more broadly speaking, to a knowledge society.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:NJ774b8OgUMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "On graph features of semantic web schemas",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4407710/",
            "Abstract": "In this paper, we measure and analyze the graph features of semantic Web (SW) schemas with focus on power-law degree distributions. Our main finding is that the majority of SW schemas with a significant number of properties (respectively, classes) approximate a power law for total-degree (respectively, the number of subsumed classes) distribution. Moreover, our analysis revealed some emerging conceptual modeling practices of SW schema developers: (1) each schema has a few focal classes that have been analyzed in detail (that is, they have numerous properties and subclasses), which are further connected with focal classes defined in other schemas, (2) class subsumption hierarchies are mostly unbalanced (that is, some branches are deep and heavy, while others are shallow and light), (3) most properties have as domain/range classes that are located high at the class subsumption hierarchies, and (4 …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Personalisation services for self e-learning networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-27834-4_27",
            "Abstract": "This paper describes the personalisation services designed for self e-learning networks in the SeLeNe project. These include personalised search results, view definition over learning object metadata, metadata generation for composite learning objects and personalised event and change notification services.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On Explicit Provenance Management in RDF/S Graphs.",
            "Publication year": 2009,
            "Publication url": "https://www.usenix.org/legacy/events/tapp09/tech/full_papers/pediaditis/pediaditis.pdf",
            "Abstract": "The notion of RDF Named Graphs has been proposed in order to assign provenance information to data described using RDF triples. In this paper, we argue that named graphs alone cannot capture provenance information in the presence of RDFS reasoning and updates. In order to address this problem, we introduce the notion of RDF/S Graphsets: a graphset is associated with a set of RDF named graphs and contain the triples that are jointly owned by the named graphs that constitute the graphset. We formalize the notions of RDF named graphs and RDF/S graphsets and propose query and update languages that can be used to handle provenance information for RDF/S graphs taking into account RDFS semantics.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the 2nd International Workshop on Open Data, WOD 2013, Paris, France, June 3, 2013",
            "Publication year": 2013,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01417746/",
            "Abstract": "Proceedings of the 2nd International Workshop on Open Data, WOD 2013, Paris, France, \nJune 3, 2013 - Archive ouverte HAL Accéder directement au contenu Accéder directement à \nla navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails \nAURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers \ndépôts Par type de publication Par discipline Par année de publication Par structure de \nrecherche Les portails de l'archive Recherche Documentation hal-01417746, version 1 \nDirection d'ouvrage, Proceedings, Dossier Proceedings of the 2nd International Workshop \non Open Data, WOD 2013, Paris, France, June 3, 2013 Vassilis Christophides 1 Dan \nVodislav 2 Détails 1 ICS-FORTH - Institute of Computer Science 2 ETIS - UMR 8051 - \nEquipes Traitement de l'Information et Systèmes '[…",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indexes Analysis for Matching Subscriptions in RSS feeds",
            "Publication year": 2012,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00737232/",
            "Abstract": "The explosion of published information on the Web leads to the emergence of a Web syndication paradigm, which transforms the passive reader into an active information collector. Information consumers subscribe to RSS/Atom feeds and are notified whenever a piece of news (item) is published. The success of this Web syndication now offered on Web sites, blogs, and social media, however raises scalability issues. There is a vital need for efficient real-time filtering methods across feeds, to allow users to follow effectively personally interesting information. We investigate in this paper three indexing techniques for users' subscriptions based on inverted lists or on an ordered trie. We present analytical models for memory requirements and matching time and we conduct a thorough experimental evaluation to exhibit the impact of critical workload parameters on these structures.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Database Technology—EDBT 2014",
            "Publication year": 2014,
            "Publication url": "http://www.openproceedings.org/EDBT/2014/EDBT-Frontmatter-all.pdf",
            "Abstract": "The proceedings of EDBT 2014 include an overview of a keynote address by Serge Abiteboul (INRIA), an overview of a keynote address by Peter Boncz (CWI), a laudation concerning the EDBT 2014 Test of Time Award, and 49 research papers and 3 vision papers that were selected by the Program Committee from 266 submissions.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Benchmarking rdf schemas for the semantic web",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-48005-6_12",
            "Abstract": "Describing web resources using formal knowledge (i.e., creating metadata according to a formal representation of a domain of discourse) is the essence of the next evolution step of the Web, termed the Semantic Web. The W3C’s RDF/S (Resource Description Framework/Schema Language) enables the creation and exchange of resource metadata as normal web data. In this paper, we investigate the use of RDFS schemas as a means of knowledge representation and exchange in diverse application domains. In order to reason about the quality of existing RDF schemas, a benchmark serves as the basis of a statistical analysis performed with the aid of VRP, the Validating RDF Parser. The statistical data extracted lead to corollaries about the size and the morphology of RDF/S schemas. Furthermore, the study of the collected schemas draws useful conclusions about the actual use of RDF modeling …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:35r97b3x0nAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Emergent knowledge artifacts for supporting trialogical e-learning",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/article/international-journal-web-based-learning/2986",
            "Abstract": "This article elaborates on scenarios for collaborative knowledge creation in the spirit of the trialogical learning paradigm. According to these scenarios, the group knowledge base is formed by combining the knowledge bases of the participants, according to various methods. The provision of flexible methods for defining various aspects of the group knowledge is expected to enhance synergy in the knowledge creation process and could lead to the development of tools that overcome the inelasticities of the current knowledge creation practices. Subsequently, these scenarios are projected to various knowledge representation frameworks and for each one of them, we analyze and discuss related techniques and identify issues that are worth further research.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:RHpTSmoSYBkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Temporal analytics in social media",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02349260/",
            "Abstract": "Temporal Analytics in Social Media - Archive ouverte HAL Accéder directement au contenu \nAccéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL \nListe des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues \nDocumentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts \nPar type de publication Par discipline Par année de publication Par structure de recherche Les \nportails de l'archive Recherche Documentation hal-02349260, version 1 Chapitre d'ouvrage \nTemporal Analytics in Social Media Sihem Amer-Yahia 1 Themis Palpanas 2 Mikalai \nTsytsarau 2 Sofia Kleisarchaki 3 Ahlame Douzal Vassilis Christophides 4 Détails 1 CNRS - \nCentre National de la Recherche Scientifique 2 DISI - Department of Information Engineering \nand Computer Science 3 CEA - Commissariat à l'énergie atomique et aux énergies 4 -- …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:t6usbXjVLHcC",
            "Publisher": "Springer New York"
        },
        {
            "Title": "Inferring Context of Mobile Data Crowdsensed in the Wild",
            "Publication year": 2019,
            "Publication url": "https://hal.inria.fr/hal-02132194/",
            "Abstract": "Understanding the sensing context of raw data is crucial for assessing the quality of large crowdsourced spatio-temporal datasets. Accelerometer's precision can vary considerably depending on whether the phone is in-pocket or out-pocket, i.e., held in hand. GPS accuracy can be very low in places like underground metro stations. Further, jump-lengths are shorter and have higher frequency when a person is indoor. Hence, we focus on contexts such as in/out-pocket, under/over-ground, and in/out-door that can be essential for reliably inferring human mobility attributes and properties (e.g., location, jump-length, and mobility activity like walking or driving) from crowdsensed data. Our work is motivated by the fact that most of the publicly available crowdsensing datasets (e.g. PRIVA'MOV and Beijing taxi dataset) do not include data from specialized sensors such as light, barometer, etc. considered by state-of-the-art algorithms for detecting the above mentioned contexts. Therefore, we focus on mining context from the limited features available in the publicly available mobility related crowdsensing datasets. Moreover, as ground truth is typically not available in these datasets, we pay special attention to minimizing the training or tuning efforts of the introduced algorithms. Our algorithms are unsupervised binary classifiers with a small memory footprint and execution time. As the lack of certain features prohibits us to consider state-of-the-art algorithms as baselines, we compare the performance of our heuristic algorithms against Machine Learning (ML) models built by an AutoML tool using the same set of features. Our experimental evaluation with a …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:eJXPG6dFmWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterizing web syndication behavior and content",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24434-6_3",
            "Abstract": "We are witnessing a widespread of web syndication technologies such as RSS or Atom for a timely delivery of frequently updated Web content. Almost every personal weblog, news portal, or discussion forum employs nowadays RSS/Atom feeds for enhancing pull-oriented searching and browsing of web pages with push-oriented protocols of web content. Social media applications such as Twitter or Facebook also employ RSS for notifying users about the newly available posts of their preferred friends. Unfortunately, previous works on RSS/Atom statistical characteristics do not provide a precise and updated characterization of feeds’ behavior and content, characterization which can be used to successfully benchmark effectiveness and efficiency of various RSS processing/analysis techniques. In this paper, we present the first thorough analysis of three complementary features of real-scale RSS feeds …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Semantic Query Routing and Processing in P2P Digital Libraries",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30823642/delos-dagstuhl-handout-all.pdf#page=40",
            "Abstract": "This paper investigates the peer-to-peer (P2P) resource-sharing paradigm for highly distributed Digital Libraries (DL). The objective is to support decentralized sharing of data and services in a network of autonomous and heterogeneous DL nodes. P2P DLs can operate without a central coordination and offer important advantages such as a very dynamic environment where peers can join and leave the network at any time, while the network can scale up to a large number of peers. The advanced structuring and retrieval functionality of peers poses new challenges in query routing and processing over autonomous, distributed and dynamic networks of DL. The paper considers two fundamental aspects of P2P Digital Libraries (P2P DLs): query routing and processing. Specifically, we design and implement effective and efficient query routing in P2P DLs, exploiting intensional indexing of DL node views. Also, we study interleaved query routing and processing algorithms in P2P DLs to produce as quickly as possible the first query results.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FROM RELATIONAL TO OBJECT DATABASE MANAGEMENT SYSTEMS",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=13664621142168002950&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An overview of end-to-end entity resolution for big data",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3418896",
            "Abstract": "One of the most critical tasks for improving data quality and increasing the reliability of data analytics is Entity Resolution (ER), which aims to identify different descriptions that refer to the same real-world entity. Despite several decades of research, ER remains a challenging problem. In this survey, we highlight the novel aspects of resolving Big Data entities when we should satisfy more than one of the Big Data characteristics simultaneously (i.e., Volume and Velocity with Variety). We present the basic concepts, processing steps, and execution strategies that have been proposed by database, semantic Web, and machine learning communities in order to cope with the loose structuredness, extreme diversity, high speed, and large scale of entity descriptions used by real-world applications. We provide an end-to-end view of ER workflows for Big Data, critically review the pros and cons of existing methods, and …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:ns9cj8rnVeAC",
            "Publisher": "ACM"
        },
        {
            "Title": "Big Data Entity Resolution",
            "Publication year": 2015,
            "Publication url": "https://hal.inria.fr/hal-01199399/",
            "Abstract": "—In the Web of data, entities are described by inter-linked data rather than documents on the Web. In this work, we focus on entity resolution in the Web of data, i.e., identifying descriptions that refer to the same real-world entity. To reduce the required number of pairwise comparisons, methods for entity resolution perform blocking as a pre-processing step. A blocking technique places similar entity descriptions into blocks and executes comparisons only between descriptions within the same block. We experimentally evaluate blocking techniques proposed for the Web of data and present dataset characteristics that determine the effectiveness and efficiency of such methods. Furthermore, we analyze the characteristics of the missed matching entity descriptions and examine different types of links that blocking techniques can potentially identify. I. INTRODUCTION Nowadays, knowledge bases (KBs) offer comprehensive, machine-readable descriptions of a large variety of real-world entities (e.g., persons, places) published on the Web as Linked Data (LD). Although KBs (e.g., DBpedia, Freebase) may be derived from the same data source (e.g., Wikipedia), they may provide multiple descriptions of the same entities. This is mainly due to the different information extraction tools and curation policies [3] employed by KBs, resulting to complementary and sometimes conflicting descriptions. Entity resolution (ER) aims to identify descriptions that refer to the same entity within or across KBs [2], [4]. Compared to data warehouses, the new ER challenges stem from the openness of the Web of data in describing entities by an unbounded number of KBs, the …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Characterizing home device usage from wireless traffic time series",
            "Publication year": 2016,
            "Publication url": "https://hal.inria.fr/hal-01249778/",
            "Abstract": "The analysis of temporal behavioral patterns of home network users can reveal important information to Internet Service Providers (ISPs) and help them to optimize their networks and offer new services (e.g., remote software upgrades, troubleshooting, energy savings). This study uses time series analysis of continuous traffic data from wireless home networks , to extract traffic patterns recurring within, or across homes, and assess the impact of different device types (fixed or portable) on home traffic. Traditional techniques for time series analysis are not suited in this respect, due to the limited stationary and evolving distribution properties of wireless home traffic data. We propose a novel framework that relies on a correlation-based similarity measure of time series , as well as a notion of strong stationarity to define motifs and dominant devices. Using this framework, we analyze the wireless traffic collected from 196 home gateways over two months. The proposed approach goes beyond existing application-specific analysis techniques, such as analysis of wireless traffic, which mainly rely on data aggregated across hundreds, or thousands of users. Our framework, enables the extraction of recurring patterns from traffic time series of individual homes, leading to a much more fine-grained analysis of the behavior patterns of the users. We also determine the best time aggregation policy w.r.t. to the number and statistical importance of the extracted motifs, as well as the device types dominating these motifs and the overall gateway traffic. Our results show that ISPs can exceed the simple observation of the aggregated gateway traffic and better understand …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WP2 Deliverable 4.3 Views and Structured Querying in Self e-Learning Networks",
            "Publication year": 2004,
            "Publication url": "https://www.dcs.bbk.ac.uk/selene/reports/Del4.3-2.0.pdf",
            "Abstract": "Self e-Learning Networks (SeLeNes) aim at facilitating access to digital material—not necessarily primarily produced for educative purposes—to a wide audience of learners and instructors with diverse educational background and requirements. One step towards this goal is the ability to specify educational needs or to describe educational material according to personalized e-learning terminologies and conceptualisations. In this deliverable we investigate how this goal can be achieved in a declarative way using language primitives for defining views over distributed, autonomous RDF bases holding learning object descriptions and schemas. Based on these primitives, we introduce a fully-fledged view definition language, called RVL, for creating not only virtual resource descriptions, but also virtual RDF/S schemas from (meta) classes, properties, and resource descriptions available on a SeLeNe. Furthermore, we illustrate how RVL views can be composed with structured RDF/S queries expressed in a query language like RQL, by means of an internal logical framework (linear Datalog rules) capturing the semantics of the RDF/S model, as well as of RQL queries and RVL views. To the best of our knowledge, RVL is the first declarative view definition language offering such functionality. Finally, we present how the RQL/RVL query processing can be implemented in three different architectural alternatives: the centralized, the mediated and the autonomic scenarios as presented in Deliverable 5.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "KP-LAB Knowledge Practices Laboratory--Specification of the SWKM Architecture (V1. 0) and Core Services",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00593208/document",
            "Abstract": "The objective of WP5 is to develop a generic middleware supporting knowledge management services for   trialogical   learning applications. More precisely, the KPLab Semantic Web Knowledge Middleware (SWKM) aims to facilitate knowledge creation processes by supporting advanced interactions of collaborating learners (or workers) with knowledge artefacts (i.e. discovery, access, evolution, recommendation and mining). In this deliverable we present the high-level functionality of SWKM along with the Service-Oriented Software Architecture of the prototype system that will be developed by M12 (V 1.0) and the subsequent phases of the project. The proposed architecture broadly distinguishes three generic modules of the SWKM, i.e. the Knowledge Repository    responsible for the provision of scalable persistence services for large volumes of knowledge artefacts   descriptions and ontologies; the Knowledge Mediator    responsible for the provision of services handling the main registry, discovery and evolution for KP-Lab knowledge artefacts; and the Knowledge Matchmaker    responsible for the provision of services that support interactions of KP-Lab users with knowledge artefacts employing their semantic descriptions. The services corresponding to each one of these modules are described along with the proposed functionality for each one, based upon the motivating scenarios and the subsequent definition of the key concepts of Trialogical Learning.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Workflow mediation using VorteXML.",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Yigal-Hoffner/publication/281291117_8_DE_Bulletin_2001/links/55e0420308aecb1a7cc2a218/8-DE-Bulletin-2001.pdf#page=42",
            "Abstract": "The Internet and Web are revolutionizing the way companies interact with their suppliers, partners, and clients, by enabling substantial automation of the full spectrum of their business activities. In the 21st century economy, the primary form of automation will be B2B e-commerce, in which enterprises interact with each other through entirely automated means. As an example, consider an electronic market place in a vertical industry segment, in which suppliers and buyers tie into a common IT infrastructure to exchange goods and services. This forms a supply chain in which buyers investigate possible suppliers,(b) check the terms and conditions under which suppliers can do business,(c) interoperate with the suppliers’ enterprise support systems, ie, workflows, and (d) monitor ordering/purchasing for possible delays, unexpected events, react to such events, etc. This paper presents a new framework for specifying, enacting and supervising e-services on the Web, based on XML and rules-based support for products/services description and workflow mediation across organizations. Traditionally, WorkFlow Management Systems (WFMS) have focused on homogeneous and centrally controlled environments for binding people and processes within the boundary of a single organization. In the context of B2B e-commerce, WFMSs need to support collaboration between various autonomous parties, some of which may even have conflicting business goals. More precisely, they must cope with heterogeneous enterprise support environments (eg, through different WF systems), to model the interaction of independent partners by abstracting the internal …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Semantic Web: Myths and Reality",
            "Publication year": 2003,
            "Publication url": "https://www.forth.gr/onassis/lectures/2003-07-07/presentations/SemanticWeb_Plexousakis_Christophides.pdf",
            "Abstract": "A well-formed document is valid only if it contains a proper DTD (or Schema) and if the document obeys the constraints of that DTD (or Schema) and therefore the XML Validity Constraints (VCs) only declared tags (element or attribute names) are used all tag occurrences conform to specified content modelsExamples: The following XML Document is well-formed but not valid< ARTIST> Claude Monet The following XML Document is not even well-formed< FIRST> Claude< LAST> Monet",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Heuristics-based query optimisation for SPARQL",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2247596.2247635",
            "Abstract": "Query optimization in RDF Stores is a challenging problem as SPARQL queries typically contain many more joins than equivalent relational plans, and hence lead to a large join order search space. In such cases, cost-based query optimization often is not possible. One practical reason for this is that statistics typically are missing in web scale setting such as the Linked Open Datasets (LOD). The more profound reason is that due to the absence of schematic structure in RDF, join-hit ratio estimation requires complicated forms of correlated join statistics; and currently there are no methods to identify the relevant correlations beforehand. For this reason, the use of good heuristics is essential in SPARQL query optimization, even in the case that are partially used with cost-based statistics (ie, hybrid query optimization). In this paper we describe a set of useful heuristics for SPARQL query optimizers. We present these in …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On Personalizing the Catalogs of Web Portals.",
            "Publication year": 2002,
            "Publication url": "https://www.aaai.org/Papers/FLAIRS/2002/FLAIRS02-084.pdf",
            "Abstract": "In this paper we propose a method for personalizing the catalogs of Web Portals. We propose, a declarative language for defining personal semantic channels over Web Portal catalogs. A semantic channel is actually a view of one or more Portal catalogs. offers powerful primitives for filtering and restructuring available thematic topics and classified resources. A user can connect to a Portal infomediary in order to register, browse, or query his/her semantic channel. We describe the architecture and the functional modules of our infomediary acting as personalization server and we focus on a set of queries which can be considered as an API for browsing semantic channels.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "High-level change detection in RDF (S) KBs",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2445583.2445584",
            "Abstract": "With the increasing use of Web 2.0 to create, disseminate, and consume large volumes of data, more and more information is published and becomes available for potential data consumers, that is, applications/services, individual users and communities, outside their production site. The most representative example of this trend is Linked Open Data (LOD), a set of interlinked data and knowledge bases. The main challenge in this context is data governance within loosely coordinated organizations that are publishing added-value interlinked data on the Web, bringing together issues related to data management and data quality, in order to support the full lifecycle of data production, consumption, and management. In this article, we are interested in curation issues for RDF(S) data, which is the default data model for LOD. In particular, we are addressing change management for RDF(S) data maintained by large …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:W7OEmFMy1HYC",
            "Publisher": "ACM"
        },
        {
            "Title": "Managing RDF metadata for community webs",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45394-6_13",
            "Abstract": "The need for descriptive information, i.e., metadata, about Web resources has been recognized in several application contexts (e.g., digital libraries, portals). The Resource Description Framework (RDF) aims at facilitating the creation and exchange of metadata, as directed labeled graphs serialized in XML. In particular, the definition of schema vocabularies enables the interpretation of semistructured RDF descriptions using taxonomies of node and edge labels. In this paper, we propose (i) a formal model capturing RDF schema constructs; (ii) a declarative query language featuring generalized path expressions for taxonomies of labels (iii) a metadata management architecture for efficient storage and querying of RDF descriptions and schemas.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:N5tVd3kTz84C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Efficient rewriting algorithms for preference queries",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4497519/",
            "Abstract": "Preference queries are crucial for various applications (e.g. digital libraries) as they allow users to discover and order data of interest in a personalized way. In this paper, we define preferences as preorders over relational attributes and their respective domains. Then, we rely on appropriate linearizations to provide a natural semantics for the block sequence answering a preference query. Moreover, we introduce two novel rewriting algorithms (called LBA and TBA) which exploit the semantics of preference expressions for constructing progressively each block of the answer. We demonstrate experimentally the scalability and performance gains of our algorithms (up to 3 orders of magnitude) for variable database and result sizes, as well as for preference expressions of variable size and structure. To the best of our knowledge, LBA and TBA are the first algorithms for evaluating efficiently arbitrary preference queries …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:ldfaerwXgEUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "KP-LAB Knowledge Practices Laboratory--Specification of the SWKM Knowledge Evolution, Recommendation, and Mining services",
            "Publication year": 2007,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00593214/",
            "Abstract": "This deliverable presents the deep-level specification for the second release (M24) of the components responsible for advanced manipulation with the knowledge stored in the KP-Lab Semantic Web Knowledge Middleware (SWKM). The two components were defined in [D5.1] as Knowledge Mediator and Knowledge Matchmaker. The Knowledge Mediator services (change, comparison, versioning and registry) aim at providing functionalities to support evolving ontologies and RDF Knowledge Bases (KBs). Upon a change request, the change service will automatically determine the effects and side-effects of the request and present it to the caller for validation. A comparison service is necessary to allow one to compare two versions of an ontology or RDF KB and identify their differences. The above functionalities are coupled with a versioning system, which is used to make different versions of the same ontology (or RDF KB) persistent, and with the registry service, which allows the user to classify the stored ontologies, using some related metadata for easy access and manipulation. The Knowledge Matchmaker supports advanced mining and notification services for knowledge artefacts. It essentially enables to cluster/classify available information resources with respect to the employed ontologies, as well as, to notify about changes to content items produced/consumed within a group of learners according to explicitly subscribed preferences [DoWB]. The Notification service supports access to the knowledge repository for KP-Lab users (i.e. individual human users as well as various tools or software components) by keeping them aware of changes …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Declarative repairing policies for curated KBs",
            "Publication year": 2011,
            "Publication url": "http://users.ics.forth.gr/~fgeo/files/HDMS11.pdf",
            "Abstract": "Curated ontologies and semantic annotations are increasingly being used in e-science to reflect the current terminology and conceptualization of scientific domains. Such curated Knowledge Bases (KBs) are usually backended by relational databases using adequate schemas (generic or application/domain specific) and may satisfy a wide range of integrity constraints. As curated KBs continuously evolve, such constraints are often violated and thus KBs need to be frequently repaired. Motivated by the fact that consistency is mostly enforced manually by the scientists acting as curators, we propose a generic and personalized repairing framework for assisting them in this arduous task. Our framework supports a variety of useful integrity constraints using Disjunctive Embedded Dependencies (DEDs) as well as complex curator preferences over interesting features of the resulting repairs (eg, their size and type) that can capture diverse notions of minimality in repairs. Moreover, we propose a novel exhaustive repair finding algorithm which, unlike existing greedy frameworks, is not sensitive to the resolution order and syntax of violated constraints and can correctly compute globally optimal repairs for different kinds of constraints and preferences. Despite its exponential nature, the performance and memory requirements of the exhaustive algorithm are experimentally demonstrated to be satisfactory for real world curation cases, thanks to a series of optimizations.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The eXtensible Markup Language: An Introduction to XML Documents & Databases",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.490.1232&rep=rep1&type=pdf",
            "Abstract": "What is XML? q Markup Meta-Language for domain or application specific structured documentation x Mathematical, chemical, musical, publishing, etc. q Developed by the SGML Editorial Board formed under the auspices of the World Wide Web Consortium (W3C) x Founded in 1996 by Jon Bosac (Sun) and various Web/SGML vendors: Textuality, Netscape, Microsoft, INSO, HP, Highland, NCSA, ArbortText, GRIF, SoftQuand q Subset of SGML optimized for use in the Inter/Intranet x SGML is proving difficult to implement for Web/Intranet applications x SGML has been hard to cost-justify to management q Opens the way for a new generation of Web applications x Improve precision during searching and retrieval x Enable multiple usage of the same data x Facilitate distributed processing with more versatile ways to manipulate data",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Matching web tables with knowledge base entities: from entity lookups to entity embeddings",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-68288-4_16",
            "Abstract": "Web tables constitute valuable sources of information for various applications, ranging from Web search to Knowledge Base (KB) augmentation. An underlying common requirement is to annotate the rows of Web tables with semantically rich descriptions of entities published in Web KBs. In this paper, we evaluate three unsupervised annotation methods: (a) a lookup-based method which relies on the minimal entity context provided in Web tables to discover correspondences to the KB, (b) a semantic embeddings method that exploits a vectorial representation of the rich entity context in a KB to identify the most relevant subset of entities in the Web table, and (c) an ontology matching method, which exploits schematic and instance information of entities available both in a KB and a Web table. Our experimental evaluation is conducted using two existing benchmark data sets in addition to a new large-scale …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Querying the semantic web with RQL",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128603002275",
            "Abstract": "Real-scale Semantic Web applications, such as Knowledge Portals and E-Marketplaces, require the management of voluminous repositories of resource metadata. The Resource Description Framework (RDF) enables the creation and exchange of metadata as any other Web data. Although large volumes of RDF descriptions are already appearing, sufficiently expressive declarative query languages for RDF are still missing. We propose RQL, a new query language adapting the functionality of semistructured or XML query languages to the peculiarities of RDF but also extending this functionality in order to uniformly query both RDF descriptions and schemas. RQL is a typed language, following a functional approach a la OQL and relies on a formal graph model that permits the interpretation of superimposed resource descriptions created using one or more RDF schemas. We illustrate the syntax, semantics and type …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:TFP_iSt0sucC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Modeling of User Preferences in Digital Libraries",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/53160188/Research_Activities_2005.pdf#page=26",
            "Abstract": "As information becomes available in increasing volumes, and to growing numbers of users, the shift towards a more user-centered access to information is becoming an important issue. As a consequence, support of personalized user interaction is an important concern in the design of advanced information systems, in general, and of digital libraries, in particular.Personalization in a digital library is about building a meaningful one-to-one relationship between digital library services and users, by understanding the needs of each individual user; it can involve either adapting the user interface or adapting the content to the needs or preferences of a specific user. The aim of this task is to study an important aspect of content adaptation, namely, the provision of services for the management of user",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The RQL v1. 5 Technical Specification",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/30698397/RQLI-Specs.pdf",
            "Abstract": "RQL is a functional language for processing RDF resource descriptions and schemas: it is defined by a set of basic queries (first order functions) and iterators (second order functions) which can be used to build new ones through functional composition. It relies on the design of the ODMG OQL Query Interpreter 3]. RQL queries are represented internally using a semantic representation with the following characteristics:",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Querying and splicing of XML workflows",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44751-2_29",
            "Abstract": "In both industry and the research community it is now common to represent workflow schemas and enactments using XML. As a matter of fact, more and more enterprise application integration platforms (e.g., Excelon, Bea, iPlanet, etc.) are using XML to represent workflows within or across enterprise boundaries. In this paper we explore the ability of modern XML query languages (specifically, the W3C XML Algebra underlying the forthcoming XQuery) to query and manipulate workflow schemas and enactments represented as XML data.The paper focuses on a simple, yet expressive, model called Workflow Query Model (WQM) offering four primary constructs: sequence, choice, parallel, and loop. Then three classes of queries are considered against WQM workflows: simple (e.g., to check the status of enactments), traversal (e.g., to check the relationship between tasks, or check the expected running …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Mining Usage Patterns in Residential Intranet of Things",
            "Publication year": 2016,
            "Publication url": "https://hal.inria.fr/hal-01317634/",
            "Abstract": "Ubiquitous smart technologies gradually transform modern homes into Intranet of Things, where a multitude of connected devices allow for novel home automation services (e.g., energy or bandwidth savings, comfort enhancement, etc.). Optimizing and enriching the Quality of Experience (QoE) of residential users emerges as a critical differentiator for Internet and Communication Service providers (ISPs and CSPs, respectively) and heavily relies on the analysis of various kinds of data (connectivity, performance, usage) gathered from home networks. In this paper, we are interested in new Machine-to-Machine data analysis techniques that go beyond binary association rule mining for traditional market basket analysis considered by previous works, to analyze individual device logs of home gateways. Based on multidimensional patterns mining framework, we extract complex device co-usage patterns of 201 …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Formal Approach for RDF/S Ontology Evolution.",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3Wsn3SwEBScC&oi=fnd&pg=PA70&dq=info:Qon21rQiyIoJ:scholar.google.com&ots=a2qvjJaCnU&sig=rU4IDMjGEOCEdk6o-owhcNMMTac",
            "Abstract": "In this paper, we consider the problem of ontology evolution in the face of a change operation. We devise a general-purpose algorithm for determining the effects and side-effects of a requested elementary or complex change operation. Our work is inspired by belief revision principles (ie, validity, success and minimal change) and allows us to handle any change operation in a provably rational and consistent manner. To the best of our knowledge, this is the first approach overcoming the limitations of existing solutions, which deal with each change operation on a per-case basis. Additionally, we rely on our general change handling algorithm to implement specialized versions of it, one per desired change operation, in order to compute the equivalent set of effects and side-effects. 2",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ICS-FORTH SWIM: A powerful semantic web integration middleware",
            "Publication year": 2003,
            "Publication url": "https://repository.upenn.edu/cis_papers/114/",
            "Abstract": "Semantic Web (SW) technology aims to facilitate the integration of legacy data sources spread worldwide. Despite the plethora of SW languages (eg, RDF/S, DAML+ OIL, OWL) recently proposed for supporting large scale information interoperation, the vast majority of legacy sources still rely on relational databases (RDB) published on the Web or corporate intranets as virtual XML. In this paper, we advocate a Datalog framework for mediating high-level queries to relational and/or XML sources using community ontologies expressed in a SW language such as RDF/S. We describe the architecture and the reasoning services of our SW integration middleware, called SWIM, and we present the main design choices and techniques for supporting powerful mappings between different data models, as well as, reformulation and optimization of queries expressed against mediation schemas and views.",
            "Abstract entirety": 1,
            "Author pub id": "MdUjsa8AAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Query processing in RDF/S-based P2P database systems",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-28347-1_4",
            "Abstract": "In Peer-to-peer (P2P) systems a very large number of autonomous computing nodes (the peers) pool together their resources and rely on each other for data and services. More and more P2P data management systems rely nowadays on intensional (i.e., schema) information for integrating and querying peer bases. Such information can be easily captured by emerging Semantic Web languages such as RDF/S. In this chapter, we present the SQPeer middleware for processing RQL queries over peer RDF/S bases (materialized or virtual), which are advertised using adequate RVL views. The novelty of SQPeer lies on the interleaved execution of the query routing and planning phases using intensional advertisements of peer bases under the form of RDF/S schema fragments (i.e., views). More precisely, routing is responsible for discovering peer views relevant to a specific query based on appropriate …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "用于网页聚合的基于内容的发布/订阅系统",
            "Publication year": 2016,
            "Publication url": "http://jcst.ict.ac.cn/CN/Y2016/V31/I2/359",
            "Abstract": "Content syndication has become a popular way for timely delivery of frequently updated information on the Web. Today, web syndication technologies such as RSS or Atom are used in a wide variety of applications spreading from large-scale news broadcasting to medium-scale information sharing in scientific and professional communities. However, they exhibit serious limitations for dealing with information overload in Web 2.0. There is a vital need for efficient realtime filtering methods across feeds, to allow users to effectively follow personally interesting information. We investigate in this paper three indexing techniques for users' subscriptions based on inverted lists or on an ordered trie for exact and partial matching. We present analytical models for memory requirements and matching time and we conduct a thorough experimental evaluation to exhibit the impact of critical parameters of realistic web syndication …",
            "Abstract entirety": 0,
            "Author pub id": "MdUjsa8AAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        }
    ]
}]