[{
    "name": "Βασίλειος Σεβρόγλου",
    "romanize name": "Vasileios Sevroglou",
    "School-Department": "Στατιστικής και Ασφαλιστικής Επιστήμης",
    "University": "unipi",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 17261,
    "Scholar name": "Vassilios Sevroglou",
    "Scholar id": "K7yLAhEAAAAJ",
    "Affiliation": "Professor of Applied Mathematics, University of Piraeus",
    "Citedby": 220,
    "Interests": [
        "Partial Differential Equations (Wave Scattering Theory)"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=K7yLAhEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Interior Elastic Scattering by a Non-Penetrable Partially Coated Obstacle and Its Shape Recovering",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2227-7390/9/19/2485",
            "Abstract": "In this paper, the interior elastic direct and inverse scattering problem of time-harmonic waves for a non-penetrable partially coated obstacle placed in a homogeneous and isotropic medium is studied. The scattering problem is formulated via the Navier equation, considering incident circular waves due to point-source fields, where the corresponding scattered data are measured on a closed curve inside the obstacle. Our model, from the mathematical point of view, is described by a mixed boundary value problem in which the scattered field satisfies mixed Dirichlet-Robin boundary conditions on the Lipschitz boundary of the obstacle. Using a variational equation method in an appropriate Sobolev space setting, uniqueness and existence results as well as stability ones are established. The corresponding inverse problem is also studied, and using some specific auxiliary integral operators an appropriate modified factorisation method is given. In addition, an inversion algorithm for shape recovering of the partially coated obstacle is presented and proved. Last but not least, useful remarks and conclusions concerning the direct scattering problem and its linchpin with the corresponding inverse one are given.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:_kc_bZDykSQC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Two-dimensional elastic Herglotz functions and their applications in inverse scattering",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1026059224433",
            "Abstract": "In this work solutions of the spectral Navier equation that satisfy the Herglotz boundedness condition in two-dimensional linear elasticity are presented. Navier eigenvectors in polar coordinates are introduced and it is established that they form a linearly independent and complete set in the L 2-sense on every smooth curve. It is also proved that the classical solutions of the spectral Navier equation are expressed via Navier eigenvectors, and this expansion converges uniformly over compact subsets of R 2. Two far-field patterns, the longitudinal and the transverse one corresponding to the displacement field are introduced, and the Herglotz norm is expressed as the sum of the L 2-norms of these patterns over the unit circle. It is also established that the space of elastic Herglotz functions is dense in the space of the classical solutions of the spectral Navier equation. Finally, connection to inverse elasticity …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "3D elastic scattering theorems for point‐generated dyadic fields",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.964",
            "Abstract": "The problem of scattering of elastic spherical waves by a rigid body, cavity or a penetrable obstacle in 3D linear elasticity is considered. For two point sources, dyadic far‐field pattern generators are defined, which are used for the formulation of a general scattering theorem. The main reciprocity principle and mixed scattering relations are also established. We provide the necessary energy considerations, presenting relative energy functionals and expressions for the differential and the scattering cross section due to point‐source dyadic incidence. Finally, an application of the general scattering theorem for appropriate locations of the point source leads to an optical theorem. Copyright © 2007 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:2osOgNQ5qMEC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The inverse electromagnetic scattering problem by a mixed impedance screen in chiral media",
            "Publication year": 2015,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/ipi.2015.9.951",
            "Abstract": "In this paper the problem of scattering of time-harmonic electromagnetic waves by a mixed impedance scatterer in chiral media is considered. Our scatterer is a partially coated chiral screen, for which an impedance boundary condition on one side of its boundary, and a perfectly conducting boundary condition on the other side, is satisfied. The direct scattering problem for the modified Maxwell equations is formulated and the appropriate Sobolev space setting is considered. Issues of solvability due to uniqueness and existence are discussed. The corresponding inverse scattering problem is studied and uniqueness results concerning the mixed impedance screen are proved. Further, the shape reconstruction of the boundary of the partially coated screen is established. In particular, a chiral far-field operator is introduced and new results concerning its properties are proved. A modified linear sampling method based on a factorization of the chiral far-field operator, in order to reconstruct the screen is also presented. We end up with useful conclusions and remarks for screens in chiral media.1. Introduction. In recent years various papers have been written on electromagnetic scattering problems for an isotropic or an anisotropic medium [14]-[16],[19],[22] and [25]. The field of direct and inverse scattering theory in electromagnetics has been applied widely, and many applied mathematicians and in general scientists have been occupied with this active field for the past twenty years. Especially for inverse scattering problems, the aim of research is to determine shapes of unknown obstacles which satisfy different type of boundary conditions. Such …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:Se3iqnhoufwC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Integral equation methods in obstacle elastic scattering",
            "Publication year": 2001,
            "Publication url": "https://eudml.org/doc/237116",
            "Abstract": "EUDML | Integral Equation Methods in Obstacle Elastic Scattering Skip to main content (access \nkey 's'), Skip to navigation (access key 'n'), Accessibility information (access key '0') EuDML - \nThe European Digital Mathematics Library Login | Register | (Why Register?) Search Home \nAdvanced Search Browse by Subject Browse by Journals Refs Lookup Integral Equation \nMethods in Obstacle Elastic Scattering Kiriakie Kiriaki; Vassilios Sevroglou Δελτίο της Ελληνικής \nΜαθηματικής Εταιρίας (2001) Volume: 45, Issue: 45, page 57-69 ISSN: 0072-7466 Access \nFull Article top icon representing file type: icon-pdf.png Full (PDF) icon representing file type: \nicon-html.png Access to full text How to cite top MLA BibTeX RIS Kiriakie Kiriaki, and Vassilios \nSevroglou. \"Integral Equation Methods in Obstacle Elastic Scattering.\" Δελτίο της Ελληνικής \nΜαθηματικής Εταιρίας 45.45 (2001): 57-69. <http://eudml.org/doc/237116>. @article{, = {}…",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An application of the reciprocity gap functional to inverse mixed impedance problems in elasticity",
            "Publication year": 2010,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0266-5611/26/8/085011/meta",
            "Abstract": "In this paper, a mixed impedance scattering problem for partially coated obstacles is studied. We formulate the direct scattering problem for the Navier equation and the mathematical setting for the description of the inverse problem. The scattered field satisfies mixed Dirichlet-impedance boundary conditions on the smooth boundary of the scatterer. A uniqueness theorem for the determination of the partially coated obstacle is proved. A method for the reconstruction of the shape of the obstacle is presented, for which no a priori information of the physical parameters of the scattering obstacle is needed. The inverse problem is treated using ideas from the linear sampling method and by the use of the reciprocity gap functional. Further, a characterization of the surface impedance is established.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "An inversion algorithm in two-dimensional elasticity",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022247X01976383",
            "Abstract": "In this paper scattering problems for the rigid body and the cavity in two-dimensional linear elasticity are considered. In each case the corresponding far-field scattering amplitudes are presented and the Herglotz condition and Herglotz wavefunctions are introduced. A pair of integral equations are constructed in the far-field region. The properties of the Herglotz functions are used to derive solvability conditions and to built approximate far-field equations. A method for solving inverse scattering problems is proposed, and the support of the scattering obstacle is found by noting the unboundedness of the L2-norm of the Herglotz densities as an interior point approaches the boundary of the scattering object from inside the scatterer. Illustration of the unboundedness property on the boundary is carried out for rigid circular cylinders and cavities. Numerical results for rigid bodies are also given, showing the applicability of …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Scattering Relations of Elastic Waves by a Multi-Layered Thermoelastic Body",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-44625-3_1",
            "Abstract": "The scattering problem of a time-harmonic dependent plane elastic wave by a multi-layered thermoelastic body in an isotropic and homogeneous elastic medium is considered. The direct scattering problem is formulated. Integral representations for the total exterior elastic field and the total interior thermoelastic fields as well as expressions for the far-field patterns are obtained containing the physical parameters of the interior thermoelastic layers. A reciprocity type theorem, a general type scattering theorem and an optical type theorem for plane wave incidence are presented and proved.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On an Application of the Improved Maximum Product Criterion to Inverse Acoustic Scattering in a Layered Medium",
            "Publication year": 2021,
            "Publication url": "https://www.scirp.org/journal/paperinformation.aspx?paperid=108559",
            "Abstract": "In this paper, we consider the numerical treatment of an inverse acoustic scattering problem that involves an impenetrable obstacle embedded in a layered medium. We begin by employing a modified version of the well known factorization method, in which a computationally effective numerical scheme for the reconstruction of the shape of the scatterer is presented. This is possible, due to a mixed reciprocity principle, which renders the computation of the Green function at the background medium unnecessary. Moreover, to further refine our inversion algorithm, an efficient Tikhonov parameter choice technique, called Improved Maximum Product Criterion (IMPC) is exploited. Our regularization parameter is computed via a fast iterative algorithm which requires no a priori knowledge of the noise level in the far-field data. Finally, the effectiveness of IMPC is illustrated with various numerical examples.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "On the scattering of two-dimensional elastic point sources and related near-field inverse problems for small discs",
            "Publication year": 2009,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-royal-society-of-edinburgh-section-a-mathematics/article/on-the-scattering-of-twodimensional-elastic-point-sources-and-related-nearfield-inverse-problems-for-small-discs/EC28081CD3D62F5406A89A001AE56D6C",
            "Abstract": "The problem of scattering of a point-generated elastic dyadic field by a bounded obstacle or a penetrable body in two dimensions is considered. The direct scattering problem for each case is formulated in a dyadic form. For two point sources, dyadic far-field pattern generators are defined and general scattering theorems and mixed scattering relations are presented. The direct scattering problem for a rigid circular disc is considered, and the exact Green function and the elastic far-field patterns of the radiating solution in the form of infinite series are obtained. Under the low-frequency assumption, approximations for the longitudinal and transverse far-field patterns of the scattered field are obtained, in addition to an asymptotic expansion for the corresponding scattering cross-section. A simple inversion scheme that locates the radius and the position of a rigid circular disc, which is based on a closed-form …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Royal Society of Edinburgh Scotland Foundation"
        },
        {
            "Title": "2D elastic scattering of a plane dyadic wave by a small rigid body and cavity",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/zamm.200600035",
            "Abstract": "In this paper the scattering problem of the disturbance of a plane dyadic wave by a rigid body or a cavity, in two‐dimensional elastodynamics is considered. The direct scattering problems are formulated in a dyadic form, and in each case, the corresponding longitudinal and transverse far‐field scattering amplitudes are presented. We provide the necessary energy considerations and expressions for the differential and the scattering cross‐section due to plane wave dyadic incidence. Next, the rigid body and cavity are considered to be small and are illuminated by a plane dyadic field. Finally, relative results for low‐frequency scattering are obtained, and similar corresponding expressions for energy functionals in the far‐field along with expressions for the differential and the total scattering cross‐section are recovered as special cases.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:UebtZRa9Y70C",
            "Publisher": "WILEY‐VCH Verlag"
        },
        {
            "Title": "THE (F*F)1/4-METHOD FOR 2D PENETRABLE ELASTIC BODIES",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702593_0038",
            "Abstract": "In this paper we discuss an inversion algorithm for the determination of the shape of a penetrable object from knowledge of the scattered elastic field generated by a given P or SV incident wave. In particular Kirsch's improved variant of the linear sampling method (LSM), the so called (F* F)1/4-method is extended to the two dimensional elastic case.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The direct electromagnetic scattering problem by a mixed impedance screen in chiral media",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00036811.2011.584183",
            "Abstract": "In this article solvability results for the direct electromagnetic scattering problem for a mixed perfectly conducting-impedance screen in a chiral environment is studied. In particular, incident time-harmonic electromagnetic waves in a chiral medium upon a partially coated open surface Γ (the ‘screen’), that satisfies an impedance boundary condition on one side and a perfectly conducting boundary condition on the other side, are considered. We introduce the Beltrami fields, appropriate boundary integral relations for these fields are proved and via them a uniqueness result is established. A variational method in a suitable functional space setting is considered and using a Calderon type operator for the chiral case, existence for the scattering problem is established.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "ON THE RECONSTRUCTION OF A SMALL ELASTIC SPHERE IN THE NEAR FIELD BY POINT-SOURCES",
            "Publication year": 2008,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812814852_0001",
            "Abstract": "A near-field reconstruction method which locates the radius and the position of a small elastic rigid sphere in the low-frequency sense is considered. In particular, the direct scattering problem for a rigid sphere by a point generated dyadic field is presented in a dyadic form, and the exact Green's function as well as the elastic far-field patterns of the radiating solution in form of infinite series are obtained. Finally, the inversion scheme is based on a closed form approximation of the scattered field at the source for various point-source locations.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering relations for point-generated dyadic fields in two-dimensional linear elasticity",
            "Publication year": 2006,
            "Publication url": "https://www.ams.org/distribution/qam/2006-64-04/S0033-569X-06-01041-0/home.html",
            "Abstract": "The problem of scattering of elastic waves by a bounded obstacle in two-dimensional linear elasticity is considered. The scattering problems are presented in a dyadic form. An incident dyadic field generated by a point source is disturbed by a rigid body, a cavity, or a penetrable obstacle. General scattering theorems are proved, relating the far-field patterns due to scattering of waves from a point source set up in either of two different locations. The most general reciprocity theorem is established, and mixed scattering relations are also proved. Finally, a relation between the incident and the scattered wave which refers to the mechanism of energy transfer of the scatterer, the so-called optical theorem, is established.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scattering theorems of elastic waves for a thermoelastic body",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.4051",
            "Abstract": "In the present work, the scattering problem of an elastic wave by a penetrable thermoelastic body in an isotropic and homogeneous elastic medium is considered. The corresponding scattering problem is formulated in a suitable compact form, and taking into account the physical parameters of the thermoelastic body and integral representations for the total exterior elastic and the total interior thermoelastic field are presented. Using asymptotic analysis of the fundamental solution of the Navier equation, expressions of the far‐field patterns are obtained, and reciprocity theorems for plane and spherical wave incidence are established. Finally, a general scattering theorem for plane wave incidence is also presented. Copyright © 2016 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Avdonin S and Mikhaylov V: The boundary control approach to inverse spectral theory 099801",
            "Publication year": 2010,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0266-5611/26/12/129901/meta",
            "Abstract": "Ballerini A: Stable determination of an immersed body in a stationary Stokes fluid 125015 Bao G, Chow SN, Li P and Zhou H: Numerical solution of an inverse medium scattering problem with a stochastic source 074014 Bardsley JM, Calvetti D and Somersalo E: Hierarchical regularization for edge-preserving reconstruction of PET images 035010Bayford R: see Nordebo S 125008 Beilina L and Klibanov MV: A posteriori error estimates for the adaptivity technique for the Tikhonov functional and global convergence for a coefficient inverse problem 045012 Beilina L and Klibanov MV: Reconstruction of dielectrics from experimental data via a hybrid globally convergent/adaptive inverse algorithm 125009",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Electromagnetic Scattering by a Chiral Impedance Screen",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-51500-7_2",
            "Abstract": "In this paper the solvability of the direct electromagnetic scattering problem by an impedance screen in a chiral environment is presented. Time-harmonic electromagnetic plane waves in a chiral medium are considered as incident fields. These propagating fields are scattered by an obstacle which is a partially coated open surface  , well known as the “screen”. Uniqueness results are proved using appropriate relations for Beltrami fields, and in addition, existence results are established by using a variational method in suitable functional space setting.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On Herglotz functions in two dimensional linear elasticity",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812792327_0016",
            "Abstract": "In this work solutions of the spectral Navier equation that satisfy the Herglotz condition in two-dimensional linear elasticity are investigated. Through the polar solutions integral representation the Navier eigenvectors are expressed in an integral form. Moreover their linear indepedence and completeness over smooth curves in the L2-sense are presented. Two far-field patterns, the longitudinal and the transverse one corresponding to a displacement field, are introduced. It is proved that the elastic Herglotz solution admits a representation as a superposition of plane waves over the unit circle with amplitude distributions the longitudinal and the transverse Herglotz kernels, which coincide with the corresponding far-field patterns.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A mixed impedance scattering problem for partially coated obstacles in two-dimensional linear elasticity",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-16727-5_3",
            "Abstract": "In this paper the problem of scattering of time-harmonic elastic waves by a non-penetrable partially coated obstacle buried in a piecewise homogeneous medium is considered. We study the direct scattering problem as well as the inverse one. The direct problem for the Navier equation is formulated in a dyadic form and the issues of solvability due to uniqueness, existence and regularity are discussed. Uniqueness results for the corresponding inverse scattering problem are proved. In particular, the unique determination of the non-penetrable partially coated obstacle with its boundary condition as well as of the penetrable interface(s) between the layered media are established via the knowledge of the far-field pattern for elastic waves. The proof of the uniqueness is based on a mixed reciprocity relation and its connection between plane-waves and point-sources. The paper at hand deals with two-dimensional …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Birkhäuser, Cham"
        },
        {
            "Title": "Point-source elastic scattering by a nested piecewise homogeneous obstacle in an elastic environment",
            "Publication year": 2010,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/1081286508102048",
            "Abstract": "A nested piecewise homogeneous elastic scatterer is embedded in a homogeneous elastic environment. The scatterer’s core may be rigid, cavity, Robin, or lossy penetrable. A 2D or 3D incident elastic field, generated by a point-source located in the homogeneous environment, impinges on the scatterer. The scattering problem is formulated in a dyadic form. The main purpose of this paper is to establish scattering relations for the elastic point-source excitation of a nested piecewise homogeneous scatterer. To this direction, we establish reciprocity principles and general scattering theorems relating the scattered fields with the corresponding far-field patterns. Furthermore, for a scatterer excited by a point-source and a plane wave, mixed scattering relations are derived. The optical theorem, relating the scattering cross-section with the field at the point-source’s location a is recovered as a corollary of the general …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:WF5omc3nYNoC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "A Preconditioned Linear Sampling Method in Inverse Acoustic Obstacle Scattering.",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Kamil-Demirci/publication/261951924_1-_Dirik-Aral-Demirci-_JoCAAA/links/00b7d5360982c1fc26000000/1-Dirik-Aral-Demirci-JoCAAA.pdf#page=453",
            "Abstract": "The problem of determining the shape of an obstacle from far-field measurements is considered. It is well known that Kirsch’s (F* F) 1/4-method has been widely used for shape reconstructions obtained via the singular system of the ill conditioned discretized far-field operator F. In this work we present a preconditioned version of this method. In particular, the singular system of an appropriate preconditioner constructed via the Algebraic Multigrid Method (AMG) is used for the reconstructions since it exploits stable eigenvalues, in contrast to the ones of the disretized far field operator.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A boundary integral equations approach for mixed impedance problems in elasticity",
            "Publication year": 2011,
            "Publication url": "https://www.jstor.org/stable/26163695",
            "Abstract": "Direct scattering problems for partially coated obstacles in linear elasticity lead to interior and exterior mixed impedance boundary value problems for the equations of steady-state elastic oscillations. We employ the potential method and reduce the mixed impedance problems to equivalent boundary pseudodifferential equations for arbitrary values of the oscillation parameter. We give a detailed analysis of the corresponding pseudodifferential equations which live on a proper submanifold of the boundary of the elastic body and establish uniqueness and existence results for the original mixed impedance problems for arbitrary values of the oscillation parameter; this is crucial in the study of inverse elastic scattering problems for partially coated obstacles. We also investigate regularity properties of solutions near the curves where the boundary conditions change and establish almost best Hölder smoothness results.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "The Rocky Mountain Mathematics Consortium"
        },
        {
            "Title": "A singular perturbation technique for the reconstruction of elastic objects",
            "Publication year": 2015,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4913100",
            "Abstract": "In this paper, we propose a new and efficient regularization technique (Singular Perturbation Technique-SPT) for the reconstruction of the shape of an elastic penetrable scatterer from far field measurements. The approach used is based on the linear sampling method and uses singular perturbations of the identity along with Neumann series approximations to recover the shape of the unknown object. In comparison with the well established Tikhonov-Morozov regularization techniques our new algorithm appears to be more computationally efficient as it doesn’t require computation of the regularization parameter for each point in the grid.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:5nxA0vEk-isC",
            "Publisher": "AIP Publishing LLC"
        },
        {
            "Title": "Shape reconstruction of a 2D-elastic penetrable object via the L-curve method",
            "Publication year": 2006,
            "Publication url": "https://www.degruyter.com/document/doi/10.1515/156939406777571021/html",
            "Abstract": "In this paper we discuss an inversion algorithm which combined with the L-curve criterion for the selection of the regularization parameter, effectively yields shape reconstructions of penetrable obstacles. The required scattered elastic field is generated by either a P or S-incident wave. In particular the improved variant of the linear sampling method (LSM), the so called (F*F)1/4-method is studied for the two dimensional elastic transmission case. For our reconstructions we assume that the far field data are noisy and we employ the L-curve for the selection of the regularization parameter. The location of the vertex of the L-curve yields an appropriate value of the regularization parameter. Furthermore, the L-curve approach does not require a priori knowledge of the noise level, and hence combined with the LSM can be used for real world reconstructions, in which noise in the data is unknown.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Walter de Gruyter"
        },
        {
            "Title": "A numerical reconstruction method in inverse elastic scattering",
            "Publication year": 2017,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17415977.2016.1273919",
            "Abstract": "In this paper a new numerical method for the shape reconstruction of obstacles in elastic scattering is proposed. Initially, the direct scattering problem for a rigid body and the mathematical setting for the corresponding inverse one are presented. Inverse uniqueness issues for the general case of mixed boundary conditions on the boundary of our obstacle, which are valid for a rigid body as well are established. The inversion algorithm based on the factorization method is presented into a suitable form and a new numerical scheme for the reconstruction of the shape of the scatterer, using far-field measurements, is given. In particular, an efficient Tikhonov parameter choice technique, called Improved Maximum Product Criterion (IMPC) and its linchpin within the framework of the factorization method is exploited. Our regularization parameter is computed via a fast iterative algorithm which requires no a priori knowledge …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "The (F* F) 1/4-method for the transmission problem in two-dimensional linear elasticity",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/0003681042000267939",
            "Abstract": "In this article we present an inversion algorithm for the determination of the shape of a two-dimensional penetrable obstacle from knowledge of the elastic field generated by an incident plane compressional and shear wave. In particular, Kirsch's improved variant of the linear sampling method, the so called (F * F )1/4-method is extended to the elastic case. A mathematical analysis that reveals the compactness and normality of the far-field operator is presented. Finally, numerical results are presented showing the robustness of the (F * F )1/4-method with respect to noise.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Mixed impedance transmission problems for vibrating layered elastic bodies",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.3295",
            "Abstract": "Direct scattering problems for partially coated piecewise homogenous and inhomogeneous layered obstacles in linear elasticity lead to mixed impedance transmission problems for the steady‐state elastic oscillation equations. For a piecewise homogenous isotropic composite body, we employ the potential method and reduce the mixed impedance transmission problem to an equivalent system of boundary pseudodifferential equations. We give a detailed analysis of the corresponding pseudodifferential operators, which live on the interface between the layers and on a proper submanifold of the boundary of the composite elastic body, and establish uniqueness and existence results for the original mixed impedance transmission problem for arbitrary values of the oscillation frequency parameter; this is crucial in the study of inverse elastic scattering problems for partially coated layered obstacles. We also investigate …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dyadic Elastic Scattering by Point Sources: Direct and Inverse Problems",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-8176-4899-2_3",
            "Abstract": "This chapter is concerned with the scattering of elastic point sources by a bounded obstacle, as well as with a related near-field inverse problem for small scatterers. We consider the Dirichlet problem, where the displacement field is vanishing on the surface of the scatterer. A dyadic formulation for the aforementioned scattering problem is considered in order to gain the symmetry–compactness of the dyadic analysis [TAI94].For acoustic and electromagnetic scattering, results on incident waves generated by a point source appear in [DK00], [AMS02]; see also references therein. In all these studies, scattering relations by point sources are established; related simple inversion algorithms for small scatterers can be found in [AMS01]. For elasticity, related problems such as the location and identification of a small three-dimensional elastic inclusion, using arrays of elastic source transmitters and receivers, are …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Birkhäuser Boston"
        },
        {
            "Title": "The far-field operator for penetrable and absorbing obstacles in 2D inverse elastic scattering",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0266-5611/21/2/017/meta",
            "Abstract": "In this paper, the far-field operator for scattering from a penetrable elastic body or an absorbing obstacle in two-dimensional linear elasticity is considered. The longitudinal and transverse far-field patterns are presented and a mathematical analysis for the transmission problem and its weak solution is established. We prove normality of the far-field operator F for the transmission case, and an analysis for its spectrum is presented. We also study the case of an absorbing obstacle, where the far-field operator no longer remains normal and basic results for the eigenvalues of F are also established. We discuss an inversion algorithm for the shape reconstruction of a penetrable obstacle from knowledge of the scattered elastic field generated by a given P and S incident wave. In particular, the improved variant of the linear sampling method (LSM), the so-called (F* F) 1/4-method is extended to the two-dimensional elastic …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "THE (F F) 1/4-METHOD FOR 2D PENETRABLE ELASTIC",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=GoLSQN2jlFwC&oi=fnd&pg=PA363&dq=info:xppSn_Mo-ZAJ:scholar.google.com&ots=CkBnXYiO2X&sig=jmvE7VnrfxkFbAUK29mSfKx4qns",
            "Abstract": "The linear sampling method (LSM) was developed by Colton and Kirsch 3 and mathematically clarified in 4, provides an effective way to tackl inverse scattering problems. Two of its attractive features are that no lowor high frequency approximation is needed and that a priori knowledge of the boundary condition (s) is not required. Its main drawback however is that it requires complete far-field data.Recently Kirsch 6 improved the original version of the linear sampling method, leading to the so-called (F* F) 1/4-method. This method along with its previous version is known to give only an explicit characterization of the scattering obstacle (ie it only determines the support of the refractive index) and it is also very easy to implement, since it just involves the solution of a linear integral equation whose kernel consists of the measured data.",
            "Abstract entirety": 1,
            "Author pub id": "K7yLAhEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Inverse scattering by penetrable objects in two-dimensional elastodynamics",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042702007422",
            "Abstract": "In this paper, a method for the shape reconstruction of a penetrable scatterer in two-dimensional linear elasticity is presented. The direct scattering problem is formulated in a dyadic form, a fact that is enforced by the dyadic nature of the free-space Green's function. Approximate far-field equations with known terms the P and S parts of the fundamental dyadic solution at the radiation zone are used. The mathematical analysis presented is based on an interior transmission problem where a weak-type solution is introduced. The proposed inversion algorithm is an extension of the sampling method for the two-dimensional elastic case. The boundary of the scatterer can be found by noting that the L2-norms of the Herglotz kernels of the approximate far-field equations are not bounded as the source point of the fundamental solution approaches the boundary from inside. Numerical results for penetrable objects are …",
            "Abstract entirety": 0,
            "Author pub id": "K7yLAhEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "North-Holland"
        }
    ]
}]