[{
    "name": "Βασίλειος Σύρης",
    "romanize name": "Vasileios Syris",
    "School-Department": "Πληροφορικής",
    "University": "aueb",
    "Rank": "Καθηγητής",
    "Apella_id": 19845,
    "Scholar name": "Vasilios A. Siris",
    "Scholar id": "Vj3O0cEAAAAJ",
    "Affiliation": "Department of Informatics, Athens University of Economics and Business, Greece",
    "Citedby": 5712,
    "Interests": [
        "Wireless and Mobile Networks",
        "Internet of Things",
        "Computer Communications"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Vj3O0cEAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Multihop wireless networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-85573-8_5",
            "Abstract": "In cellular and wireless local area networks, wireless communication only occurs on the last link between a base station and the wireless end system. In multihop wireless networks, there are one or more intermediate nodes along the path that receive and forward packets via wireless links. Multihop wireless networks have several benefits: Compared with networks with single wireless links, multihop wireless networks can extend the coverage of a network and improve connectivity. Moreover, transmission over multiple ‘‘short’’links might require less transmission power and energy than that required over ‘‘long’’links. Moreover, they enable higher data rates resulting in higher throughput and more efficient use of the wireless medium. Multihop wireless networks avoid wide deployment of cables and can be deployed in a costefficient way. In case of dense multihop networks, several paths might become available that …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Resource Control for the Enhanced Distributed Channel Access (EDCA) Mechanism in IEEE 802.11 e",
            "Publication year": 2005,
            "Publication url": "ftp://139.91.151.43/tech-reports/2005/2005.TR352_Resource_Control_Distributed_Channel_Access.pdf",
            "Abstract": "We investigate the problem of efficient resource control for elastic traffic in IEEE 802.11 e’s Enhanced Distributed Channel Access (EDCA) mechanism. Our approach considers an economic modelling framework based on congestion pricing that captures how various factors, such as the probability of attempting to transmit a frame, the use of the basic CSMA/CA or the RTS/CTS procedure, and the physical layer transmission rate, contribute to the congestion in an IEEE 802.11 e network using the EDCA mechanism. We discuss the application of the framework for achieving class-based proportional throughput differentiation, for performing explicit congestion notification (ECN) marking based on the level of congestion in the wireless channel, and for modelling the performance of TCP congestion control over EDCA. In the aforementioned application scenarios we discuss how to estimate the optimal minimum contention window and the congestion prices based on the 802.11 e parameters and actual measurements, in order to efficiently utilize the wireless channel. Experiments demonstrate the application of the proposed framework, compare simulation and analytical results, and identify the gains in using the optimal minimum contention window.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resource control for loss-sensitive traffic in CDMA networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1354696/",
            "Abstract": "We investigate the problem of efficient resource control for loss-sensitive traffic in CDMA networks, using an economic modelling framework that takes into account the joint control of the transmission rate and the signal quality. Although the corresponding global optimization problem has a non-trivial structure, and we cannot in general guarantee that a solution can be found using the Lagrangian method, we have strong experimental evidence that this is possible for a wide range of user utilities. In this case the global optimum can be achieved in a decentralized manner, using shadow prices to influence the individual user resource requests. Based on this evidence, the main contribution of the paper is to discuss how existing rate control and outer-loop power control procedures can obtain a simple and attractive form that takes into account, through shadow prices, the level of demand and supply in order to achieve …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service differentiation in third generation mobile networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45859-X_17",
            "Abstract": "We present and analyse an approach to service differentiation in third generation mobile networks based on Wideband CDMA, that exposes a new weight parameter designed to reflect allocation of the congestible resource. The approach naturally takes into account the difference in resource scarcity for the uplink and downlink, because it is grounded on fundamental economic models for efficient utilization of resources in WCDMA. Discrete values of the weight parameter can be presented as different service classes. Finally, we present numerical experiments demonstrating the effectiveness of our approach, and investigate its performance and transient behaviour under power control and signal quality estimation errors.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Channel Assignment in a metropolitan wireless multi-radio mesh network",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4769150/",
            "Abstract": "We investigate the problem of channel assignment in a metropolitan wireless multi-radio mesh network with directional antennas. We first present a new conflict graph model for capturing the interference between links in a mesh network with a known wireless interface communication graph. Then we present a channel assignment procedure which accounts for interference both between links internal to the mesh network, and from external sources. Key components of the channel assignment procedure are the interference model, the link ordering, and the channel selection metric. We have implemented and evaluated the proposed channel assignment procedure in an actual metropolitan mesh network with link distances from 1.6 to 5 Km. The experimental results demonstrate how link ordering and the channel selection metric affect performance, in terms of the average packet delay and http latency. Moreover, the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient adaptation to dynamic pricing communicated by ECN marks: Scenarios for experimental assessment",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4211/0000/Efficient-adaptation-to-dynamic-pricing-communicated-by-ECN-marks/10.1117/12.417482.short",
            "Abstract": "We present our research activities and initial results, regarding both simulation and actual test-bed implementation, that aim to demonstrate the feasibility and to evaluate the advantages and performance of a market-based management scheme based on a simple feedback mechanism that informs users of the congestion their traffic is experiencing. The feedback is based on Explicit Congestion Notification marking. The aforementioned objectives are investigated using two service provisioning scenarios. The first scenario involves an application provider that offers discrete Quality of Service (QoS) classes at different prices, whereas the second scenarios offers a wider range of QoS, price pairs. The experiments we report refer to the implementation of a modified version of the TCP algorithm, which provides service differentiation based on a sender's willing-to-pay, and of a packet marking scheme that provides early …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Techno-economic gains analysis of services over an information-centric integrated satellite-terrestrial network",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6633552/",
            "Abstract": "We present a techno-economic analysis of services deployed over integrated satellite-terrestrial networks which employ an Information-Centric Networking (ICN) architecture. Our methodology provides a systematic procedure to assess the gains of various service integration scenarios, initially identifying the technical capabilities for which ICN can provide advantages and considering the requirements of each scenario, and then combining the pure technical gains with economic and market impact factors. This allows us to prioritize scenarios based on their techno-economic impact for adopting an ICN architecture to integrate satellite and terrestrial networks.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Provider-based deterministic packet marking against distributed DoS attacks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804505000482",
            "Abstract": "One of the most serious security threats on the Internet are Distributed Denial of Service (DDoS) attacks, due to the significant service disruption they can create and the difficulty in preventing them. In this paper, we propose new deterministic packet marking models in order to characterize DDoS attack streams. Such a common characterization can be used to make filtering near the victim more effective. In this direction we propose a rate control scheme that protects destination domains by limiting the amount of traffic during an attack, while leaving a large percentage of legitimate traffic unaffected. The above features enable providers to offer enhanced security protection against such attacks as a value-added service to their customers, and hence offer positive incentives for them to deploy the proposed models. We evaluate the proposed marking models using a snapshot of the actual Internet topology, in terms of …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:0EnyYjriUFMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Bridging the cyber and physical worlds using blockchains and smart contracts",
            "Publication year": 2019,
            "Publication url": "https://research.aalto.fi/files/32969556/ELEC_fotiou_bridging_the_cyber_NDSS2019.pdf",
            "Abstract": "We address the limitations of existing information security solutions when applied to the cyber-physical world. In particular, we consider the case of Internet of Things (IoT) actuation and we argue that it is hard to secure such a process. To this end, we propose a “damage control” approach, where service time is divided into slots and users perform microservice transactions, paying essentially in advance for each one, corresponding to one service slot. Under these circumstances, in the case of service disruption, a user, in the worst case, may lose the amount of money that corresponds to a single micro-service transaction in a single time slot. We implement our solution by leveraging blockchain-based smart contracts, off-chain payments, and one-time Hash-based Message Authentication Code (HMAC) passwords. Our solution supports IoT devices with limited processing capabilities and which are not necessarily connected to the Internet. Moreover, with our solution, IoT devices do not interact directly with the blockchain. In fact, they are oblivious to the use of blockchain technology. They do not store any usersensitive information, neither are payments made to or is value stored on the devices.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:dBIO0h50nwkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling decentralised identifiers and verifiable credentials for constrained IoT devices using OAuth-based delegation",
            "Publication year": 2019,
            "Publication url": "https://www.ndss-symposium.org/wp-content/uploads/diss2019_05_Lagutin_paper.pdf",
            "Abstract": "Decentralised identifiers (DIDs) and verifiable credentials (VCs) are upcoming standards for self-sovereign privacypreserving identifiers and authorisation, respectively. This focus on privacy can help improve many services and open up new business models, but using DIDs and VCs directly on constrained IoT devices can be problematic due to the management and resource overhead. This paper presents an OAuth-based method to delegate the processing and access policy management to the Authorisation Server thus allowing also systems with constrained IoT devices to benefit from DIDs and VCs.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for adaptive opportunistic forwarding in wireless networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5282400/",
            "Abstract": "We present our initial work on the design and of an opportunistic forwarding scheme for a wireless network. The main focus in our work is to take advantage of the interplay of the lower layer parameters and thus decide the design aspects of the forwarding decisions for an adaptive probabilistic opportunistic forwarding scheme. We have already shown that our opportunistic scheme can outperform single path routing for moderate channel error values, we have also identified a tradeoff between differentiating the forwarder's back-off value to avoid collisions and reducing delay.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handover Incentives for Self-Interested WLANs with Overlapping Coverage",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6060828/",
            "Abstract": "We consider an environment where self-interested IEEE 802.11 Wireless Local Area Networks (WLANs) have overlapping coverage, and investigate the incentives that can trigger handovers between the WLANs. Our focus is on the incentives for supporting handovers due solely to the improved performance for all wireless networks. Such incentives arise due to a well-known property of 802.11 networks, where low rate users that send traffic significantly degrade the performance of high rate users that are associated with the same access point. A key difference of this paper compared to other works is that WLANs are self-interested, seeking to improve the performance of their own clients. We develop a comprehensive analytical model for accurately identifying and quantifying the handover gains. The model captures cases such as uplink and downlink traffic, wired link capacity constraints, and nonsaturated traffic …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Selective Neighbor Caching Approach for Supporting Mobility in Publish/Subscribe Networks",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.410.6500&rep=rep1&type=pdf#page=69",
            "Abstract": "We present a selective neighbor caching approach for supporting mobility in publish/subscribe networks. According to the approach, a mobile’s subscriptions are transmitted to a subset of brokers that are neighbors of the current broker that the mobile is connected to. Our key contribution is the definition of a target cost function and an intelligent procedure for selecting the subset of neighbors. The advantage of our proposal is that it reduces the buffering costs, since not all neighbor brokers cache items, while still obtaining the gains of proactive caching, by caching items in a subset of neighbor brokers that a mobile has a high probability to connect to.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network and protocol architectures for future satellite systems",
            "Publication year": 2017,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/p28_future_satellite_systems_2017.pdf",
            "Abstract": "Since their conception, satellite communications have been regarded as a promising tool for all environments where the terrestrial infrastructure is limited in capacity or to take advantage of the multicasting/broadcasting capabilities inherent in satellite technology. Recent advances have seen satellite technology mature to a more prominent role in the telecommunications domain. In particular, the design of novel satellite payload concepts for Geostationary (GEO) satellite platforms, as well as renewed interest in Low Earth Orbit (LEO) satellite constellations have made the integration of satellite and terrestrial networks almost compulsory to ensure new services meet the requirements for high user-rate and quality of experience that could not be achieved using either of the two technologies independently. From this viewpoint, convergence of satellite and terrestrial technologies also requires considering the most recent trends in networking, with special attention being paid to the potential new architectures that have been recently proposed in the framework of Future Internet.This monograph explores the main components of the scenarios above, putting particular emphasis on the networking aspects. To this end, novel protocols such as Multi Path TCP (MPTCP) and networking trends such as Information Centric Networking (ICN) are explored by demonstrating their applicability in some scenarios that deploy both satellite and terrestrial segments. Particular attention is given to smart gateway diversity schemes which advocate the use of sophisticated multi-path transmission schemes to exploit the multi-homing features offered by present day devices …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:GtLg2Ama23sC",
            "Publisher": "Now Publishers"
        },
        {
            "Title": "Enabling self-verifiable mutable content items in IPFS using Decentralized Identifiers",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.08395",
            "Abstract": "In IPFS content identifiers are constructed based on the item's data therefore the binding between an item's identifier and its data can be deterministically verified. Nevertheless, once an item is modified, its identifier also changes. Therefore when it comes to mutable content there is a need for keeping track of the \"latest\" IPFS identifier. This is achieved using naming protocols on top of IPFS, such as IPNS and DNSlink, that map a constant name to an IPFS identifier, allowing at the same time content owners to update these mappings. Nevertheless, IPNS relies on a cryptographic key pair that cannot be rotated, and DNSlink does not provide content authenticity protection. In this paper, we propose a naming protocol that combines DNSlink and decentralized identifiers to enable self-verifiable content items. Our protocol provides content authenticity without imposing any security requirement to DNSlink. Furthermore, our protocol prevent fake content even if attackers have access to the DNS server of the content owner or have access to the content owner secret keys. Our proof of concept implementation shows that our protocol is feasible and can be used with existing IPFS tools.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:6yz0xqPARnAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Siris and Apostolos Traganitis. Adjacent channel interference in 802.11 a is harmful: Testbed validation of a simple quantification model",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:vDZJ-YLwNdEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simple tariffs based on price multipliers for ATM VBR services",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.901",
            "Abstract": "We present an approach for constructing simple time‐based tariffs for variable bit‐rate (VBR) connections from constant bit‐rate (CBR) prices, using price multipliers that depend on the traffic parameters of the VBR connection and reflect the resource usage of VBR connections relative to CBR connections. Our approach employs an effective bandwidth bound as a proxy for the maximum amount of traffic that conforms to the connection's traffic contract, and thus for the maximum resource usage. We compare the price multipliers computed by our approach with the multipliers published by an actual ATM service provider, and with those computed using a proxy for resource usage that is based on ATM Forum's generic CAC algorithm. Although our approach is presented in the context of ATM VBR services, it can be applied for creating tariffs for service level agreements (SLAs) where the maximum amount of conforming …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:4vMrXwiscB8C",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Network Dimensioning Based on Percentage of Access Link Capacity used for Premium IP Traffic",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.144.8783",
            "Abstract": "Network dimensioning is typically based on a traffic matrix that contains the bandwidth demand for each sourcedestination pair. We consider a different approach, which assumes that only the maximum amount of premium traffic that can be carried across each access link is known. Based on this information, we present three algorithms for determining the bandwidth required for premium traffic in the core network. The first algorithm intermediately estimates the traffic matrix based on the “gravity model”. The other two algorithms compute the worst-case requirements for premium traffic when there are no link failures and fixed routing is used (second algorithm), and when there are link failures and alternative routing paths are available (third algorithm). An important feature of the two worst-case algorithms is that they allow admission control decisions to be based solely on the availability of bandwidth for premium traffic at the access links. We apply and compare the three algorithms for the Greek Research and Technology Network (GRNET), which currently uses the third algorithm for its premium IP service. I.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Delay and throughput of network coding with path redundancy for wireless mesh networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5678750/",
            "Abstract": "In this paper we investigate the performance that can be achieved by exploiting path diversity through multipath network coding with redundancy. We extend our work on the analysis of the delay and throughput for multipath forwarding for the case of hop by hop retransmission instead of end to end in the previous work. A key contribution of the paper is the demonstration of the tradeoff between packet delay and throughput achieved by combining multipath forwarding and network coding, and comparison of this tradeoff with other routing schemes. The analytical framework considers the case of hop by hop retransmission for achieving reliability, and is generalized for an arbitrary number of paths and hops. The proposed framework consists of two parts, the first one considers end to end coding process and the second one hop by hop.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic and QoS Management in Wireless Multimedia Networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-0-387-85573-8.pdf",
            "Abstract": "The current book provides a final report of activity performed by the COST 290 Action,‘‘Traffic and QoS Management in Wireless Multimedia Networks,’’which ran from March 10, 2004, until June 3, 2008. After an introduction to the COST framework and the Action’s survey time-frame and activities, the main part of the book addresses a number of technical issues, which are structured into several chapters. All those issues have been carefully investigated by the COST 290 community during the course of the project–the information presented in this book can be regarded as ultimate for each particular topic; every open research issue addressed in the book is described carefully, corresponding existing studies are analyzed and results achieved by the COST 290 community are presented and compared, and further research directions are defined and analyzed. Because the book covers a wide area of research …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:vDijr-p_gm4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Context monitoring for improved system performance and QoE",
            "Publication year": 2018,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/27854/1002150.pdf?sequence=1#page=38",
            "Abstract": "Whereas some application domains show a certain consensus on the role of system factors, human factors, and context factors, QoE management of multimedia systems and services is still faced with the challenge of identifying the key QoE influence factors. In this chapter, we focus on the potential of enhancing QoE management mechanisms by exploiting valuable context information. To get a good grip on the basics we first discuss a general framework for context monitoring and define context information, including technical, usage, social, economic, temporal, and physical factors. We then iterate the opportunities and challenges in involving context in QoE monitoring solutions, as context may be, eg, hard to ascertain or very situational. c The Author (s) 2018",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Smooth DASH adaptation exploiting throughput prediction",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2980137.2980140",
            "Abstract": "We present and evaluate a procedure that exploits throughput prediction to select the DASH video quality sequence (sequence of representations) with the highest average bit rate and the fewest quality switches, while explicitly taking into account throughput and time uncertainty. Experiments with an Android implementation of the proposed procedure show that it can exploit throughput prediction to achieve a high QoE (Quality of Experience) with a small number of video pauses and video quality switches, even when the throughput and time uncertainty is large.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:0N-VGjzr574C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimization of Dense WLANs: Models and Algorithms",
            "Publication year": 2007,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/ta3_opt_dense_WLANs_v2_tr.pdf",
            "Abstract": "The goal of this report is to investigate the optimization of dense WLANs under various control mechanisms that include MAC layer parameter control, Access Point (AP) coverage control through beacon power control (also referred to as cell breathing), AP assignment, and channel assignment. This is important for projects, such as BT’s Wireless Cities, whose goal is to achieve a blanket WiFi coverage across a whole city. To achieve such coverage, APs need to be deployed in a dense manner, hence there will be areas of overlapping coverage from more than one APs. If the APs are operated in an ad hoc manner, with no planning of the channel assigned to each AP or of the area covered by each AP, then there can be significant interference in the overlapping areas. This will result in reduced performance not only for wireless clients located in the overlapping areas, but for all wireless clients. The mechanisms mentioned above exist, in some basic form, in current generation wireless AP devices. However, the vendors and subsequently managers of dense AP networks either disregard them or use them in a suboptimal manner. Until today, there is no systematic investigation of the joint optimization of all the aforementioned mechanisms. There are only a few works that look at the combined optimization of at most two mechanisms, and most focus on physical layer performance metrics, such as the signal-to-noise-and-interference ratio (SINR) or the aggregate throughput, which does not account for how resources are shared among different clients. This work tried to understand key aspects of the problem, and developed a modelling framework that …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pushing for higher rates and efficiency in Satcom: the different perspectives within SatNExIV",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7454329/",
            "Abstract": "SatNEx IV project aims at studying medium and long term directions of satellite telecommunication systems for any of the commercial or institutional applications that can be considered appealing by key players although still not mature enough for attracting industry or initiating dedicated ESA R&D activities. This paper summarizes the first year activities identified as very promising techniques for next generation satellite communication systems. Concretely, very high throughput satellite trunking, physical layer advances for full-duplex and multipolarization systems, network coding applications and multiple access schemes for information centric networking are briefly presented. For all the activities, we identify the scenarios under study so as the preliminary technical solutions to be further investigated.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:e_rmSamDkqQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Seamless congestion control over wired and wireless IEEE 802.11 networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_137",
            "Abstract": "We present a new approach for seamless congestion control over heterogeneous networks containing wired and wireless IEEE 802.11 links. The approach uses ECN (Explicit Congestion Notification) as a common signalling mechanism for conveying congestion information from both wired and wireless links. Two additional novel aspects of the approach are that ECN marking for a wireless link, due to the way resources are shared, is performed for both the uplink and the downlink based on measurements of the aggregate traffic in both directions, and the marking mechanism dynamically adapts to varying traffic and load conditions. Simulation results demonstrate that our approach achieves higher fairness compared to drop-tail queueing, and can effectively control the average packet delay over the wireless link.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Caching and mobility support in a publish-subscribe internet architecture",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6231279/",
            "Abstract": "The Internet is straining to meet demands that its design never anticipated, such as supporting billions of mobile devices and transporting huge amounts of multimedia content. The publish-subscribe Internet (PSI) architecture, a clean slate information-centric networking approach to the future Internet, was designed to satisfy the current and emerging user demands for pervasive content delivery, which the Internet can no longer handle. This article provides an overview of the PSI architecture, explaining its operation from bootstrapping to information delivery, focusing on its support for network layer caching and seamless mobility, which make PSI an excellent platform for ubiquitous information delivery.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "I-CAN: Information-centric future mobile and wireless access networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6928676/",
            "Abstract": "This short paper describes the objectives and initial results of project I-CAN: Information-Centric Future Mobile and Wireless Access Networks. I-CAN seeks to radically advance the integration of cellular and wireless access technologies by developing and evaluating architectures and procedures for future access networks based on Information-Centric Networking (ICN).",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:tYavs44e6CUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Methods for monitoring, controlling and charging QoS in IP networks",
            "Publication year": 2001,
            "Publication url": "http://www.jslonline.com.ng/wp-content/uploads/2019/07/INTERNET-TRAFFIC-ENGINEERING.pdf#page=271",
            "Abstract": "Internet Protocol (IP)-based networks and TCP/IP-applications are steadily getting more popular. Many applications require more than best-effort service, ie they need Quality of Service (QoS) guarantees. Studies of customer expectations [Alt00] indicate that users would like service differentiation. Today’s networks cannot support different requirements coming from different applications, since the methodology, mechanisms and their implementations are not yet mature. Some mechanisms assuring service differentiation and QoS support in IP-based networks are available, like the Integrated Services (IntServ) and the Differentiated Services (DiffServ) standardised by IETF, but it is not clear how to use these in order to deliver the service end-to-end with the quality agreed with a user. Nor is it clear which parameters to use to express quality at the application service level, ie the quality the user can directly perceive. Moreover, mapping these parameters to network performance parameter is not a trivial task. In addition, no services are charged for the quality they are provided with.The EURESCOM project P906-GI QUASIMODO (Quality of Service Methodologies and solutions within the service framework: Measuring, Managing and Charging QoS) tried to answer some of these issues. The main idea of offering a reasonable set of quality classes to users according to their needs and possibilities (eg to pay) was investigated by developing and implementing the QUASI-model.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:u9iWguZQMMsC",
            "Publisher": "TELEDIREKTORATET"
        },
        {
            "Title": "OAuth 2.0 authorization using blockchain-based tokens",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2001.10461",
            "Abstract": "OAuth 2.0 is the industry-standard protocol for authorization. It facilitates secure service provisioning, as well as secure interoperability among diverse stakeholders. All OAuth 2.0 protocol flows result in the creation of an access token, which is then used by a user to request access to a protected resource. Nevertheless, the definition of access tokens is transparent to the OAuth 2.0 protocol, which does not specify any particular token format, how tokens are generated, or how they are used. Instead, the OAuth 2.0 specification leaves all these as design choices for integrators. In this paper, we propose a new type of OAuth 2.0 token backed by a distributed ledger. Our construction is secure, and it supports proof-of-possession, auditing, and accountability. Furthermore, we provide added-value token management services, including revocation, delegation, and fair exchange by leveraging smart contracts. We realized a proof-of-concept implementation of our solution using Ethereum smart contracts and the ERC-721 token specification.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:Ehil0879vHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive packet marking for achieving fairness in DiffServ networks",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405001362",
            "Abstract": "Current Differentiated Services (DiffServ) networks supporting Assured Forwarding (AF) service succeed in providing minimum rate guarantees, but fail to distribute network capacity in a fair way. To address the unfairness problem we propose simple adaptive markers operating at the network edge, whose marking function adapts to changes of the traffic mix. Extensive simulation experiments indicate that adaptive marking can effectively address the unfairness problem, without decreasing network utilization. The proposed approach can be implemented using a Bandwidth Broker architecture, whereby a centralized Bandwidth Broker sets the control parameter of the adaptive markers, based on the current traffic contracts.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:-f6ydRqryjwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Enabling opportunistic users in multi-tenant IoT systems using decentralized identifiers and permissioned blockchains",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3338507.3358622",
            "Abstract": "In this work, we leverage advances in decentralized identifiers and permissioned blockchains to build a flexible user authentication and authorization mechanism that offers enhanced privacy, achieves fast revocation, and supports distributed\" policy decision points''executed in mutually untrusted entities. The proposed solution can be applied in multi-tenant\" IoT hubs''that interconnect diverse IoT silos and enable authorization of\" guest''users, ie, opportunistic users that have no trust relationship with the system, which has not encountered or known them before.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:yqoGN6RLRZoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access point selection for improving throughput fairness in wireless LANs",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4258564/",
            "Abstract": "We investigate the problem of access point selection in wireless LANs based on the IEEE 802.11 standard, when a station is within the vicinity of more than one access points. According to the proposed approach, the selection is based on the packet transmission delay for each access point that a station can associate to, which is related to the throughput that the station can achieve. Important features of the approach is that it considers the contention-based nature of IEEE 802.11's MAC layer, it can be applied to the 802.11e standard which can support different classes in terms of the minimum contention window, and it can be implemented solely at the wireless stations, which passively monitor the activity of each access point's channel, without requiring modifications to the access points. Experiments show that the proposed approach can achieve significantly higher throughput fairness compared to other …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Denial of Service and Anomaly Detection",
            "Publication year": 2002,
            "Publication url": "https://cuc.carnet.hr/cuc2003/program/slides/scampi/siris.pdf",
            "Abstract": "No Slide Title Page 1 Denial of Service and Anomaly Detection Vasilios A. Siris Institute of \nComputer Science (ICS) FORTH, Crete, Greece vsiris@ics.forth.gr SCAMPI BoF, Zagreb, May \n21 2002 Page 2 Overview ● What the problem is and why it is difficult ● Where and why \nnaïve schemes fail ● Consider two algorithms ∎ Adaptive Threshold ∎ CUSUM (CUmulative \nSUM) ● Application to SYN attack detection ● Experimental results ● Conclusions and \nfuture work Page 3 Denial of Service (DoS) attacks ● Aim is to prevent users from receiving \nservice, with some minimum performance ● Achieved by consuming resources ∎ Bandwidth \n∎ Memory ∎ Router forwarding capacity ∎ Other services: DNS ● Technique: flooding Page 4 \nImportance of DoS attacks ● Recent surveys: ∎ 40% of all attacks are DoS (2002 CSI/FBI) ∎ \n90% of all DoS attacks are TCP attacks (2001 Moore et al) ● Cost of attack = many € or $ ∎ to …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A simple end-to-end throughput model for 802.11 multi-radio multi-rate wireless mesh networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5752798/",
            "Abstract": "We address the problem of estimating the end-to-end throughput of UDP flows in a multi-radio, multi-channel, and multi-rate 802.11 wireless mesh network (WMN). Estimates of the end-to-end throughput of flows in a WMN can facilitate the design of traffic-aware routing and channel assignment algorithms. We introduce a simple and intuitive model that captures key features of 802.11 WMNs such as contention, interference, and performance degradation due to links with low transmission rates. We use simulation to validate the accuracy of the proposed model in various scenarios for a network topology containing multiple transmitters and wired gateways.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effective and robust detection of jamming attacks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5722371/",
            "Abstract": "In this paper we present and evaluate anomaly-based intrusion detection algorithms for detecting attacks at the physical layer of wireless networks, by seeking for changes in the Signal-to-Noise ratio statistical characteristics. Two types of algorithms are proposed: simple threshold algorithms and cumulative sum (cusum) algorithms. Performance evaluation is performed in terms of the detection probability, false alarm rate, detection delay and the robustness of the algorithms to different detection threshold values. The algorithms are applied locally to measurements collected from three locations of an experimental network and under two attack intensities. The results show that the cumulative sum algorithms are more robust and achieve higher performance under both attack intensities. Next, we use the Dempster-Shafer algorithm to fuse the outputs provided by the above locally executed algorithms at different nodes …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capability-based access control for multi-tenant systems using OAuth 2.0 and Verifiable Credentials",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.11515",
            "Abstract": "We propose a capability-based access control technique for sharing Web resources, based on Verifiable Credentials (VCs) and OAuth 2.0. VCs are a secure means for expressing claims about a subject. Although VCs are ideal for encoding capabilities, the lack of standards for exchanging and using VCs impedes their adoption and limits their interoperability. We mitigate this problem by integrating VCs into the OAuth 2.0 authorization flow. To this end, we propose a new form of OAuth 2.0 access token based on VCs. Our approach leverages JSON Web Tokens (JWT) to encode VCs and takes advantage of JWT-based mechanisms for proving VC possession. Our solution not only requires minimum changes to existing OAuth 2.0 code bases, but it also removes some of the complexity of verifying VC claims by relying on JSON Web Signatures: a simple, standardized, and well supported signature format. Additionally, we fill the gap of VC generation processes by defining a new protocol that leverages the OAuth 2.0 \"client credentials\" grant.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic and QoS Management in Wireless Multimedia Networks: COST 290 Final Report",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/book/10.1007/978-0-387-85573-8",
            "Abstract": "This book contains the description of the research work done in ESF COST 290 Action\" Traffic and QoS Management in Wireless Multimedia Networks\" which ran from March 2004 to June 2008. Twenty four European countries contributed to the research within the ESF COST 290 Action with more than 70 institutions involved. The authors address new techniques and approaches to deal with the growth of data traffic in wireless mobile networks and the important need to guarantee differentiated quality of service levels to different traffic classes. The material presents the latest research achievements and results in research areas such as traffic engineering, mobility and interoperability, network architectures and planning as well as services, regulations, and economic aspects. This book covers broad areas of research on wireless communications and networking from the physical layer through the application layer. It …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:NyGDZy8z5eUC",
            "Publisher": "Springer-Verlag US"
        },
        {
            "Title": "Resource control for elastic traffic in CDMA networks",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/570645.570670",
            "Abstract": "We present a framework for resource control in CDMA networks carrying elastic traffic, considering both the uplink and the downlink direction. The framework is based on microeconomics and congestion pricing, and seeks to exploit the joint control of the transmission rate and the signal quality in order to achieve efficient utilization of network resources, in a distributed and decentralized manner. An important feature of the framework is that it incorporates both the congestion for shared resources in wireless and wired networks, and the cost of battery power at mobile hosts. We prove that for elastic traffic, where users value only their average throughput, the user's net utility maximization problem can be decomposed into two simpler problems: one involving the selection of the optimal signal quality, and one involving the selection of the optimal transmission rate. Based on this result, the selection of signal quality can …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobility-based proactive multicast for seamless mobility support in cellular network environments",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3098208.3098213",
            "Abstract": "Information-Centric Networking (ICN) is receiver driven, asynchronous and location-independent, hence it natively supports client-mobility. However, post-handover delay is a problem for delay-sensitive mobile applications, as they need to (re-) submit their subscriptions and wait for them to get resolved and (probably re-) transmitted before receiving the demanded data. To avoid this problem and optimize performance, this paper proposes a Mobility-based Proactive Multicast (MPM) scheme. Unlike reactive or blind multicast solutions proposed in the past, MPM takes autonomous decisions locally at various network access points (cells) prior to the movement of mobile clients, using a semi-Markov mobility prediction model that predicts next-cell transitions, along with anticipating the duration between the transitions for an arbitrary user in a cellular network. Since cellular backhaul links are typically a bottleneck, MPM …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:bz8QjSJIRt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiences and investigations with Heraklion MESH an experimental metropolitan multi-radio mesh network",
            "Publication year": 2008,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/s42_HMESH_Tridentcom2008.pdf",
            "Abstract": "We present our experiences and investigations with an experimental metropolitan multi-radio mesh network that covers an area of approximately 60 Km2 in the city of Heraklion, Crete. The network consists of 14 nodes, among which six are core nodes with up to four 802.11 a wireless interfaces each, and an additional wireless interface for management and monitoring. The distance between core mesh nodes varies from 1.6 to 5 Km, and the wireless mesh network contains two gateways that connect it to a fixed network. Our investigations have considered the online monitoring of the links between core nodes, the interference between the wireless interfaces located in the same mesh node, channel assignment procedures, and the use of the metropolitan mesh network for real-time collection of electromagnetic field (EMF) measurements.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:_OXeSy2IsFwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluating forwarding schemes exploiting path diversity and degrees of redundancy in a realistic wireless environment",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6335387/",
            "Abstract": "In this paper we validate and extend through simulations the trends revealed by the analytical results of our prior work concerning the throughput-delay trade-off that can be achieved by forwarding schemes exploiting path diversity and different degrees of redundancy focusing on the case of hop-by-hop retransmissions at the link-layer. The simulation environment is based on 802.11 Physical and Mac layer. It employs single source unicast traffic and consists of two scenarios with high and low interference respectively. A key contribution of this study is the demonstration of the throughput-delay trade-off for various forwarding schemes, including network-coding based ones, under a more realistic wireless model where link loss rates are determined dynamically by the SINR criterion.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Blockchain technology for intelligent environments",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/551088",
            "Abstract": "In the last few years, we have been witnessing the convergence of the physical with the digital world. The Internet of Things (IoT) is progressing at a fast pace, and IoT devices are becoming pervasive in our physical environments, bringing the vision of Intelligent Environments closer to reality. At the same time, the newly-introduced blockchain technology is offering for the first time ever cryptographically proven trust based on a set of mutually untrusted nodes. Blockchain technology thus has the potential to become a key component of many IoT systems, offering them an unprecedented level of accountability, transparency, and reliability. This paper first lays out the principles on which blockchain systems are operating, along with descriptions of the most noteworthy blockchain implementations. It then presents a number of systems through which blockchains may interact with external systems and third-party data sources. Finally, it provides a survey of the state-of-the-art blockchain-based systems targeting IoT applications. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:LhH-TYMQEocC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Efficient proactive caching for supporting seamless mobility",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6918952/",
            "Abstract": "We present a distributed proactive caching approach that exploits user mobility information to decide where to proactively cache data to support seamless mobility, while efficiently utilizing cache storage using a congestion pricing scheme. The proposed approach is applicable to the case where objects have different sizes and to a two-level cache hierarchy, for both of which the proactive caching problem is hard. Our evaluation results show how various system parameters influence the delay gains of the proposed approach, which achieves robust and good performance relative to an oracle and an optimal scheme for a flat cache structure.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A test-bed investigation of QoS mechanisms for supporting SLAs in IPv6",
            "Publication year": 2004,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/h6.pdf",
            "Abstract": "We investigate the combined operation and interaction of QoS mechanisms, namely traffic policing, traffic shaping, and class-based queueing, in an IPv6 testbed, for TCP traffic. These mechanisms will be applied on edge routers at the interface between a user organization and his network provider, hence their tuning is important for effectively supporting Service Level Agreements (SLAs). Our results show how various parameters of the mechanisms affect the overall performance, hence can provide guidelines for appropriately selecting their values.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:86PQX7AUzd4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Anomaly‐based intrusion detection of jamming attacks, local versus collaborative detection",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.2341",
            "Abstract": "We present intrusion detection algorithms to detect physical layer jamming attacks in wireless networks. We compare the performance of local algorithms on the basis of the signal‐to‐interference‐plus‐noise ratio (SINR) executing independently at several monitors, with a collaborative detection algorithm that fuses the outputs provided by these algorithms. The local algorithms fall into two categories: simple threshold that raise an alarm if the output of the SINR‐based metrics we consider deviates from a predefined detection threshold and cumulative sum (cusum) algorithms that raise an alarm if the aggregated output exceeds the predefined threshold. For collaborative detection, we use the Dempster–Shafer theory of evidence algorithm. We collect SINR traces from a real IEEE 802.11 network, and with the use of a new evaluation method, we evaluate both the local and the Dempster–Shafer algorithms in terms of …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:yFnVuubrUp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The second Workshop on advanced EXperimental activities on WIRELESS networks (EXPONWIRELESS 2007)",
            "Publication year": 2007,
            "Publication url": "https://arpi.unipi.it/handle/11568/117565",
            "Abstract": "The second Workshop on advanced EXperimental activities on WIRELESS networks (EXPONWIRELESS \n2007) IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto \nSfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS Università di Pisa \nCatalogo Ricerca UNIPI 2 Contributo in Volume 2.2 Prefazione/Postfazione The second \nWorkshop on advanced EXperimental activities on WIRELESS networks (EXPONWIRELESS \n2007) Italiano Italiano Italiano Italiano English English The second Workshop on advanced \nEXperimental activities on WIRELESS networks (EXPONWIRELESS 2007) / Garroppo R; \nLiu Y; Siris VA. - (2007). Scheda breve Scheda completa Titolo: The second Workshop on \nadvanced EXperimental activities on WIRELESS networks (EXPONWIRELESS 2007) Autori \ninterni: GARROPPO, ROSARIO GIUSEPPE …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:0izLItjtcgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Application of network layer mechanisms for service differentiation in 802.11 WLANs: implementation and experience",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1683467/",
            "Abstract": "In this paper we present the design, implementation, and experience in using network layer mechanisms for service differentiation in 802.11 wireless LANs (WLANs). In particular, we use the class-based weighted fair queuing (CBWFQ) mechanism with weights that are dynamically adjusted based on the achieved throughput of the wireless stations and their physical layer transmission rate. The scheme was implemented in a Linux-based testbed, and experiments show that it can effectively support throughput differentiation, and deal with important WLANs problems, such as unfairness due to location-dependent channel errors, uplink-downlink unfairness, and performance degradation for the whole WLAN when a station transmits at a small rate. The experiments involved best-effort traffic, as well as streaming video and voice-over-IP",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Demonstration of channel assignment in a wireless metropolitan MESH network",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5282439/",
            "Abstract": "We demonstrate the channel assignment in a metropolitan wireless multi-radio mesh network with directional antennas. A channel assignment approach is presented using suitable algorithms with key components the interference model, the link ordering and the channel selection metric. We have implemented and evaluated the proposed channel assignment in an actual metropolitan mesh network which covers an area of 60 km 2  in the city of Heraklion and consists of 14 nodes, among which seven are core nodes with up to four 802.11a wireless interfaces each, and one for management and monitoring. Finally, we developed a Java application to demonstrate the channel assignment process in a metropolitan mesh network in a graphical environment.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance incentives for cooperation between wireless mesh network operators",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5466679/",
            "Abstract": "Low transmission rate links are bottlenecks that degrade the performance of Wireless Mesh Networks (WMN), especially when they co-exist with high-rate links. In this paper we investigate the incentives for mesh node sharing between different operators. Such cooperation aims to replace low-rate links with multiple higher rate links, and is induced solely from the improved performance that can be achieved through cooperation, even when the WMN operators act in their own self-interest. We present an analytical framework that can identify when the cooperation is expected to be beneficial for both operators, and estimates the expected performance gains in different scenarios, which include single/multi-channel and single/multi-radio cases. Analytical results indicate that there are cases where cooperation can yield significant performance improvements for both WMNs. The analytical results are validated with …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adapting data popularity in mobility-based proactive caching decisions for heterogeneous wireless networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6928687/",
            "Abstract": "The current paper presents extensions to a distributed user mobility-based proactive caching scheme that supports individual users' requests, and a brief discussion of the benefits from exploiting user-centric features. The approach applies to Heterogeneous Wireless Networks (HWNs) for offloading traffic volumes to small cells and for reducing delay for specific categories of mobile users and mobile application scenarios through Efficient Proactive Caching (EPC) decisions at small cells. The approach is designed to support mobile users' requests for content not treated by popularity-based caching. Here, we discuss how proactive caching decisions can jointly utilize individual user mobility and data popularity to enhance the benefits of cache decisions for individuals to a broader set of mobiles requesting the same data.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A dynamic CBWFQ scheme for service differentiation in WLANs",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1651927/",
            "Abstract": "In this paper we address the issue of service differentiation in wireless networks based on the IEEE 802.11 standard. Wireless local area networks (WLANs) of this type are becoming increasingly prevalent, counting millions of deployed networks in homes, offices and hot spots. However, the medium access control (MAC) protocol and the unpredictability of the wireless channel prohibit the direct employment of classical wireline service differentiation algorithms. The main contribution of this paper is a network layer mechanism, capable of differentiating service, while improving fairness and aggregate throughput in the presence of both uplink (TCP) and downlink traffic. We exploit a class based weight fair queuing (CBWFQ) scheme, properly supplemented by two algorithms that perform periodical weight adjustments. The two algorithms deal effectively with important WLANs problems, such as, unfairness due to …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proactive selective neighbor caching for enhancing mobility support in information-centric networks",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2342488.2342502",
            "Abstract": "We present a Selective Neighbor Caching (SNC) approach for enhancing seamless mobility in ICN architectures. The approach is based on proactively caching information requests and the corresponding items to a subset of proxies that are one hop away from the proxy a mobile is currently connected to. A key contribution of this paper is the definition of a target cost function that captures the tradeoff between delay and cache cost, and a simple procedure for selecting the appropriate subset of neighbors which considers the mobility behavior of users.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:CHSYGLWDkRkC",
            "Publisher": "ACM"
        },
        {
            "Title": "IoT Resource Access utilizing Blockchains and Trusted Execution Environments",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8766403/",
            "Abstract": "We consider IoT resources with a Trusted Execution Environment (TEE) and propose a model to provide trusted resource access that is linked to blockchain payments, ensuring the integrity and confidentiality of the IoT data. The model is built on the widely used OAuth 2.0 open authorization framework, which provides delegated authorization for IoT resources. We utilize hash-lock and time-lock mechanisms to cryptographically link trusted resource access, provided by the IoT resource's TEE, to authorization grants and blockchain payments. The model is implemented in the OP-TEE open source port for the Raspberry Pi that uses ARM's TrustZone and is evaluated on the Rinkeby public Ethereum testnet.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:3htObqc8RwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure open federation for internet everywhere",
            "Publication year": 2018,
            "Publication url": "https://acris.aalto.fi/ws/portalfiles/portal/27005791/ELEC_diss2018_1_Karila_paper_Copy.pdf",
            "Abstract": "According to some studies, there are well over 300 different Internet of Things (IoT) platforms and several dozens of (so-called) standards. In practice, this has led to a situation where most of the deployed IoT systems are closed and largely incapable of communicating with other IoT systems. Furthermore, it is likely that at least a few different basic IoT communication protocols will co-exist, including the Constrained Application Protocol (CoAP), Message Queue Telemetry Transport (MQTT), and HTTP.In this paper, we introduce SOFIE, Secure Open Federation for Internet Everywhere. SOFIE is a proposal for applying distributed ledger technology (DLT) to securely and openly federate IoT platforms. SOFIE’s approach is based on the idea of using interconnected distributed ledgers as a cornerstone to build decentralised business platforms that support the interconnection of diverse IoT systems. Among other things, the ledgers are used to provide openly accessible metadata about the individual IoT platforms, to define business and other rules on how to connect to the platforms, and to securely record audit trails that can be used to resolve disputes.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:Aul-kAQHnToC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The OSI Model and Switching",
            "Publication year": 2002,
            "Publication url": "https://www.igi-global.com/chapter/osi-model-switching/18412",
            "Abstract": "In this chapter we give the motivation and basic concepts of the OSI reference model, discuss its seven-layer architecture, the communication between systems using the OSI model, and finally the relationship between the OSI model and multilayer switching.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:08ZZubdj9fEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Congestion Pricing for Resource Control in WCDMA",
            "Publication year": 2001,
            "Publication url": "https://www.ics.forth.gr/sites/default/files/tnlfiles/presentations/cong_pricing_wcdma.pdf",
            "Abstract": "Previous model does not take into account power constraints at mobiles; can extend to take this into account; Resource constraint will not have “1” on right hand side, but something less determined by mobile with smallest gain/power. Assumed single cell and base station. However, if there are K base stations and there is (perfect) soft handover, constraint becomes\\sum r_i\\gamma_i< K",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The SOFIE Approach to Address the Security and Privacy of the IoT using Interledger Technologies",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=PEvYDwAAQBAJ&oi=fnd&pg=PA76&dq=info:Z2yUKF7zwbYJ:scholar.google.com&ots=AqBeC5uLtz&sig=idYqFAc-tYnJjkUEB5AIbH6w4z8",
            "Abstract": "The Internet of Things (IoT) suffer from lack of interoperability as data, devices, and whole sub-systems are locked in ‘silos’ because of technical, but mostly business reasons. Many new applications would be enabled and existing ones could be implemented in a more cost-efficient way, if the ‘silos’ could be bridged in a secure and privacy preserving manner. The SOFIE approach provides an effective way of accomplishing this by using interledger technologies that leverage the distributed trust enabled by distributed ledgers. The federated approach of SOFIE facilitates the creation of cross-organisational applications. This chapter presents the SOFIE approach and details the benefits it provides in four real-world pilots.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:artPoR2Yc-kC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Information-centric networking in mobile and opportunistic networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10834-6_2",
            "Abstract": "Information Centric Networking (ICN) as an emerging paradigm for the Future Internet has initially been rather focusing on bandwidth savings in wired networks, but there might also be some significant potential to support communication in mobile wireless networks as well as opportunistic network scenarios, where end systems have spontaneous but time-limited contact to exchange data. This chapter addresses the reasoning why ICN has an important role in mobile and opportunistic networks by identifying several challenges in mobile and opportunistic Information-Centric Networks and discussing appropriate solutions for them. In particular, it discusses the issues of receiver and source mobility. Source mobility needs special attention. Solutions based on routing protocol extensions, indirection, and separation of name resolution and data transfer are discussed. Moreover, the chapter presents solutions …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Economic models for resource control in wireless networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045200/",
            "Abstract": "We present a model based on congestion pricing for resource control in wireless CDMA networks carrying traffic streams that have fixed-rate requirements, but can adapt their signal quality. Our model considers the resource usage constraint in the uplink of CDMA networks, and does not differentiate users based on their distance from the base station. We compare our model with other economic models that have appeared in the literature, identifying their similarities and differences. Our investigations include the effects of a mobile's distance and the wireless network's load on the target signal quality, the transmission power, and the user benefit.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Anomaly-based intrusion detection algorithms for wireless networks",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13315-2_16",
            "Abstract": "In this paper we present and evaluate anomaly-based intrusion detection algorithms for detecting physical layer jamming attacks in wireless networks, by seeking changes in the statistical characteristics of the signal-to-noise ratio (SNR). Two types of algorithms are investigated: simple threshold algorithms and algorithms based on the cumulative sum change point detection procedure. The algorithms consider SNR-based metrics, which include the average SNR, minimum SNR, and max-minus-min SNR values in a short window. The algorithms are applied to measurements taken in two locations, one close and one far from the jammer, and evaluated in terms of the detection probability, false alarm rate, detection delay and their robustness to different detection threshold values. Our results show that the cumulative sum detection procedure can improve the detection probability and false alarm rate when …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Secure IoT access at scale using blockchains and smart contracts",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8793047/",
            "Abstract": "Blockchains and smart contracts are an emerging, promising technology, that has received considerable attention. We use the blockchain technology, and in particular Ethereum, to implement a large-scale event-based Internet of Things (IoT) control system. We argue that the distributed nature of the “ledger,” as well as, Ethereum's capability of parallel execution of replicated “smart contracts”, provide the sought after automation, generality, flexibility, resilience, and high availability. We design a realistic blockchain-based loT architecture, using existing technologies while by taking into consideration the characteristics and limitations of IoT devices and applications. Furthermore, we leverage blockchain's immutability and Ethereum's support for custom tokens to build a robust and efficient token-based access control mechanism. Our evaluation shows that our solution is viable and offers significant security and …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:KbBQZpvPDL4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adjacent channel interference in a multi-radio wireless mesh node with 802.11 a/g interfaces",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Apostolos-Traganitis/publication/242742976_Adjacent_channel_interference_in_a_multi-radio_wireless_mesh_node_with_80211ag_interfaces/links/53df75750cf2a768e49b9e3e/Adjacent-channel-interference-in-a-multi-radio-wireless-mesh-node-with-80211a-g-interfaces.pdf",
            "Abstract": "In this work we utilize Signal to Interference-plus-Noise (SINR) criterion for reception, and combine it with the model for partial channel overlap presented in [1] and extended for 802.11 a/g, to quantify the impact of Adjacent Channel Interference (ACI) in multi-radio 802.11 a/g based wireless nodes designed for mesh networking. The nodes we consider are equipped with two to four 802.11 a or 802.11 g wireless interfaces and a variety of directional antennas. Our study focuses mainly on 802.11 a, since we expected that the ACI would be almost inexistent in this protocol, due to better frequency allocation. Indeed, adjacent channels in 802.11 a are widely considered to be non-overlapping. However, as we have seen in this work, adjacent 802.11 a channels have in fact an overlap that produces significant interference whose impact will be noticeable when the antennas are closely co-located on a node, even in the case where directional antennas are used. We examine how this close placement affects the cell radius of such a node with respect to the offered data rates for the uplink, and the 802.11 a/g clear channel assessment (CCA) mechanism. Our results are verified by initial short range experiments performed on off-the-shelf 802.11 a cards.Our future work includes both uplink and downlink testing through in-lab experimentation with channel emulation over programmable RF attenuators and through experiments on a metropolitan scale mesh network. We also intend to revisit the model proposed in [1] and refine it, taking into account the partial overlap of the OFMD subcarriers of 802.11 a/g.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Management of Future Mesh-Based Radio Access Networks",
            "Publication year": 2009,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/l5_Mgmt_future_mesh_EN77.pdf",
            "Abstract": "Wireless mesh networks enable denser coverage and higher data rates than traditional wireless local area networks (LANs), while significantly lowering the deployment and operation costs compared to 3G mobile networks. These cost reductions combined with symmetric bandwidth for uplink/downlink communication will make wireless mesh networks a key architecture for future IP-based radio access networks, enabling innovative pervasive services based on ubiquitous broadband access.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Beacons and blockchains in the mobile gaming ecosystem: A feasibility analysis",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/976832",
            "Abstract": "We explore the adoption of the Internet of Things (IoT) and Distributed Ledger Technologies (DLTs), such as blockchains, in mobile gaming, focusing on ecosystem expansion and diversification, customer attraction and retention, exploitation of context sensitive and personalized advertisements, and improved monetization of in-game assets. We evaluate the cost and transaction delay of DLTs in a location-based mobile game ecosystem using two types of blockchains (permissioned and permissionless or public), based on defined Key Performance Indicators (KPIs). Our evaluation shows the advantages of using both types of blockchains as well as interledger technologies that combine them. Permissioned blockchains enable high performance, eg, in terms of throughput and delay, and low cost, while permissionless (public) blockchains, through their transparency, immutability, and openness, support trust and facilitate interactions among unrelated parties. Finally, we show that the combination of IoT devices and DLTs in mobile gaming offers new business opportunities and enables innovative business models for both traditional mobile gaming companies and other participants in the ecosystem, eg, game players, cafes, malls, and similar establishments, advertising companies, and independent programmers. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:2tRrZ1ZAMYUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Edge-ICN and its application to the Internet of Things",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8264880/",
            "Abstract": "While research on Information-Centric Networking (ICN) flourishes, its adoption seems to be an elusive goal. In this paper we propose Edge-ICN: a novel approach for deploying ICN in a single large network, such as the network of an Internet Service Provider. Although Edge-ICN requires nothing beyond an SDN-based network supporting the OpenFlow protocol, with ICN-aware nodes only at the edges of the network, it still offers the same benefits as a clean-slate ICN architecture but without the deployment hassles. Moreover, by proxying legacy traffic and transparently forwarding it through the Edge-ICN nodes, all existing applications can operate smoothly, while offering significant advantages to applications such as native support for scalable anycast, multicast, and multi-source forwarding. In this context, we show how the proposed functionality at the edge of the network can specifically benefit CoAP-based IoT …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:Ri6SYOTghG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interference-aware channel assignment in a metropolitan multi-radio wireless mesh network with directional antennas",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036641100079X",
            "Abstract": "We investigate the problem of channel assignment in a metropolitan multi-radio wireless mesh network with directional antennas. Our contributions include a new conflict graph model for capturing the interference between links in a mesh network with a known wireless interface communication graph, and a new channel assignment procedure which accounts for interference both between links inside the mesh network, and from external sources. Additionally, we have implemented and evaluated the proposed channel assignment procedure in an actual metropolitan mesh network with 1.6–5 km links. Key components of the channel assignment procedure are the interference model, the link ordering, and the channel selection metric. The experimental results demonstrate how link ordering and the channel selection metric affect performance, in terms of the average packet delay and http latency. The results show that …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:vRqMK49ujn8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Resource Control for Hybrid Code and Time Division Scheduling Wireless Systems",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11277-006-9107-9",
            "Abstract": "We present a model, based on economic theory, for efficient and robust resource control in hybrid code and time division scheduling wireless systems. An important and novel feature of the model is that it captures the combined effects of the transmission rate, the signal quality, and the percentage of time slots a user can transmit in, on the overall efficiency of the wireless system. Based on this model, we propose procedures for combined rate and time slot allocation to achieve efficient utilization of wireless resources, while taking into account user requirements. These procedures can be applied using a class-based framework that allows simple implementation and requires simple communication between the network and its users, which select a service class reflecting their valuation for the average throughput and for the percentage of time slots in which they can transmit data.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Enhancing mobile data offloading with mobility prediction and prefetching",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2502935.2502940",
            "Abstract": "We present procedures that exploit mobility prediction and prefetching to enhance offoading of trafic from mobile networks to WiFi hotspots, for both delay tolerant and delay sensitive trafic. We evaluate the procedures in terms of the percentage of offoaded trafic, the data transfer delay, and the cache size used for prefetching. The evaluation considers empirical measurements and shows how various parameters infuence the performance of the procedures, and their robustness to time and throughput estimation errors.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:olpn-zPbct0C",
            "Publisher": "ACM"
        },
        {
            "Title": "Access point assignment algorithms in WLANs based on throughput objectives",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4586095/",
            "Abstract": "In this article we present branch-and-bound algorithms for the access point assignment problem in WLANs, when the objective function is based on the throughput of stations in the network. We consider: a) maximizing the aggregate throughput, b) achieving lexicographically max-min fair throughputs, c) achieving proportionally fair throughputs. The performance of all branch-and-bound algorithms is examined for various degrees of approximation. Thus we show trade-offs between the increased cost of exploration and improvement in the objective value. We further compare their performance to that of greedy algorithms, embedded as a depth-first-search in the branch-and-bound methods. An omnipresent result is the near-optimal performance of the greedy algorithms, which is particularly important when considering their practical application. In all cases, the performance of the algorithms improves as the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Can context monitoring improve QoE? A case study of video flash crowds in the internet of services",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7140480/",
            "Abstract": "Over the last decade or so, significant research has focused on defining Quality of Experience (QoE) of Multimedia Systems and identifying the key factors that collectively determine it. Some consensus thus exists as to the role of System Factors, Human Factors and Context Factors. In this paper, the notion of context is broadened to include information gleaned from simultaneous out-of-band channels, such as social network trend analytics, that can be used if interpreted in a timely manner, to help further optimise QoE. A case study involving simulation of HTTP adaptive streaming (HAS) and load balancing in a content distribution network (CDN) in a flash crowd scenario is presented with encouraging results.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Erratum to\" Adaptive packet marking for achieving fairness in DiffServ networks\"[Comput. Commun. 29 (2006) 52-58]",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.comcom.2006.05.001",
            "Abstract": "Erratum to \"Adaptive packet marking for achieving fairness in DiffServ networks\" [Comput. \nCommun. 29 (2006) 52-58] | Computer Communications ACM Digital Library home ACM home \nGoogle, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search \nJournals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital \nLibrary SearchSearch Advanced Search Computer Communications Periodical Home Latest \nIssue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsComputer \nCommunicationsVol. , No. Erratum to \"Adaptive packet marking for achieving fairness in \nDiffServ networks\" [Comput. Commun. (2006) 52-58] article Erratum to \"Adaptive packet \nmarking for achieving fairness in DiffServ networks\" [Comput. Commun. 29 (2006) 52-58] Share \non Authors: Vasilios A. Siris profile image Vasilios A. Siris Institute of Computer Science, of , :…",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Optipath: Optimal route selection based on location data collected from smartphones",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.470.5846&rep=rep1&type=pdf#page=9",
            "Abstract": "We present a system that selects the optimal route between two points for vehicles moving in an urban environment. Our approach uses location data gathered from smartphones, which includes route segments and their corresponding travel time. The system can be used as a standalone application with a user interface for path visualization. Additionally, route selection and location prediction can be used for improving streaming video applications and for scheduling delay tolerant data transfers to achieve mobile data offloading.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quality of future Internet Services (QofIS)-Service Differentiation and QoS Control-Service Differentiation in Third Generation Mobile Networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=6648041298792193803&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:OTTXONDVkokC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Adaptive setting of TCP's maximum window in ad hoc multihop networks with a single flow",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4917564/",
            "Abstract": "An emerging approach for improving the performance of TCP in ad hoc multihop networks is to limit the maximum congestion window (CWNDmax) that a TCP connection is allowed to reach, in order to eliminate the number of outstanding segments and increase the TCP stability. In the present work, we propose an adaptive scheme to bound the CWNDmax value in an IEEE 802.11 ad hoc network. Our contributions are the following. First, we conduct simulation experiments to establish the argument that the optimum CWNDmax value depends on the buffer availability, when the network is not saturated, and is irrelevant to it, otherwise. Then, we introduce a time based expression for the network's bandwidth-delay product (BDP), in order to set CWNDmax dynamically. This expression accounts both for spatial reuse and for the packets' queue waiting time. The latter is necessary, since the TCP timer is set according to …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Internet Quality and Performance and Control of Network Systems",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resource control for hybrid code and time division scheduling",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1368304/",
            "Abstract": "We present a model, based on economic theory, for efficient and robust resource control in hybrid code and time division scheduling wireless systems. Based on this model, we propose procedures for combined rate allocation and time slot allocation to achieve efficient utilization of wireless resources, while taking into account user requirements. These procedures can be applied using a class-based framework, which allows simple implementation, and where users select a service class reflecting their valuation for the average throughput and for the percentage of time slots in which they can transmit data.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A survey of information-centric networking research",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6563278/",
            "Abstract": "The current Internet architecture was founded upon a host-centric communication model, which was appropriate for coping with the needs of the early Internet users. Internet usage has evolved however, with most users mainly interested in accessing (vast amounts of) information, irrespective of its physical location. This paradigm shift in the usage model of the Internet, along with the pressing needs for, among others, better security and mobility support, has led researchers into considering a radical change to the Internet architecture. In this direction, we have witnessed many research efforts investigating Information-Centric Networking (ICN) as a foundation upon which the Future Internet can be built. Our main aims in this survey are: (a) to identify the core functionalities of ICN architectures, (b) to describe the key ICN proposals in a tutorial manner, highlighting the similarities and differences among them with …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting Satellite Broadcast Despite HTTPS",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9014011/",
            "Abstract": "HTTPS enhances end-user privacy and is often preferred or enforced by over-the-top content providers, but renders inoperable all intermediate network functions operating above the transport layer, including caching, content/protocol optimization, and security filtering tools. These functions are crucial for the optimization of integrated satellite-terrestrial networks. Additionally, due to the use of end-to-end and per- session encryption keys, the advantages of a satellite's wide- area broadcasting capabilities are limited or even negated completely. This paper investigates two solutions for authorized TLS interception that involve TLS splitting. We present how these solutions can be incorporated into integrated satellite- terrestrial networks and we discuss their trade-offs in terms of deployment, performance, and privacy. Furthermore, we design a solution that leverages satellite broadcast transmission even in the presence …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:r_AWSJRzSzQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical Blockchain Topologies for Quality Control in Food Supply Chains",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9200913/",
            "Abstract": "The use of blockchains to improve product quality and safety control in food supply chains through transparent, trusted, and secure end-to-end traceability frameworks, has received increased attention in the last few years. The use of blockchains, though, does not come at no cost. Poor design of blockchain-based applications can lead to prohibitive costs, intolerable delays, and nonscalable systems. In this work we explore different architectures for blockchain-based traceability and quality control of produce, proposing, evaluating, and comparing four different scenarios. Our evaluation uses public and private Ethereum instances, and assesses the considered architectures in terms of cost and overall throughput.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:gKiMpY-AVTkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handover Incentives: Revised Model with extensions for Uplink Traffic",
            "Publication year": 2010,
            "Publication url": "http://139.91.152.77/files/publications/mifi10_incentivesrevised.pdf",
            "Abstract": "Focusing in competitive environments where each party acts in its own self-interest and not towards a common goal, the objective of this paper is to investigate the incentives that can trigger handovers of wireless nodes that operate at low rates to neighboring access points that operate in the same channel but belong to other networks. The handovers address the well-known problem in IEEE 802.11 networks, that the assignment of low-rate and high-rate users to the same access point significantly degrades the performance of the high-rate users. This fact gives rise to incentives for performing handovers, due solely to the improved performance handovers yield for both wireless networks. In order to investigate when such incentives arise for wireless networks operating in the same contention area, and to quantify the corresponding gains, a modeling framework is proposed. The modeling framework estimates the throughput of wireless nodes in IEEE 802.11 WLANs and aims to identify the specific cases that handovers yield performance improvements and advise the wireless network operators whether or not to share their resources. This paper extends our previous work (Fafoutis & Siris 2009) by integrating a revised analytical model which includes the case of uplink traffic and provides more accurate approximations. The analysis indicates that there can be significant performance improvements for both parties in both the case of downlink and uplink traffic. The accuracy of the modeling framework is verified through simulations.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ECN marking for congestion control in multihop wireless networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11424505_30",
            "Abstract": "In this paper we propose an approach to increase TCP’s fairness in multihop wireless networks, using ECN as a congestion signalling mechanism. The novel idea we introduce is that the marking probability at a wireless node is a function of the aggregate utilization in the node’s neighborhood, which is determined by the sum of the receiving rates of all nodes within its collision domain. A node’s received rate can be communicated to neighboring nodes by piggy-backing it on control packets, such as CTS and RTS messages, or data packets. Simulation results demonstrate that our approach can improve TCP’s fairness in a multihop wireless network compared to drop tail queueing, while achieving the same aggregate throughput. Moreover, the proposed approach yields smaller average packet delay and delay jitter compared to drop tail queueing.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "SOFIE: Secure Open Federation for Internet Everywhere",
            "Publication year": 2018,
            "Publication url": "https://research.aalto.fi/en/publications/sofie-secure-open-federation-for-internet-everywhere",
            "Abstract": "SOFIE: Secure Open Federation for Internet Everywhere — Aalto University's research portal \nSkip to main navigation Skip to search Skip to main content Aalto University's research portal \nLogo Accessibility statement English Suomi Home Profiles Research output Datasets Projects \nPrizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name \nor affiliation SOFIE: Secure Open Federation for Internet Everywhere Arto Karila, Yki \nKortesniemi, Dmitrij Lagutin, Pekka Nikander, Santeri Paavolainen, Nikos Fotiou, George C. \nPolyzos, Vasilios A. Siris, Theodore Zahariadis Professorship Ylä-Jääski Antti Department of \nComputer Science Adj. Prof.Turpeinen Marko group Helsinki Institute for Information Technology \n(HIIT) Department of Communications and Networking Network Security and Trust Research \noutput: Chapter in Book/Report/Conference proceeding › Conference contribution › › -() ((…",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:4X0JR2_MtJMC",
            "Publisher": "Internet Society"
        },
        {
            "Title": "Procedures and tools for analysis of network traffic measurements",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0166531602000287",
            "Abstract": "We present procedures and tools for the analysis of network traffic measurements. The tools consist of stand-alone1 modules that implement advanced statistical analysis procedures and a flexible web-based interface through which a user can create, modify, save, and execute experiments using the statistical analysis modules. The tools do not assume a specific source traffic model, but rather process actual measurements of network traffic. Indeed, the theory that the tools are based on can identify the time-scales that affect a link’s performance, hence suggest the appropriate time granularity of traffic measurements. We present and discuss case studies that demonstrate the application of the tools for answering questions related to network management and dimensioning, such as the maximum link utilization when some quality of service is guaranteed, how this utilization is affected by the link buffer and traffic …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:UebtZRa9Y70C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Smart application-aware IoT data collection",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s40860-019-00077-y",
            "Abstract": "We present and experimentally evaluate procedures for efficient IoT data collection while achieving target requirements in terms of data accuracy, response time, energy, and privacy protection. Different strategies are considered because different IoT applications can have different requirements. Specifically, the accuracy-driven strategy adjusts the time period between consecutive measurements following an additive increase and multiplicative decrease (AIMD) scheme based on a target data accuracy, while the time-driven strategy adjusts the time period between measurement requests to achieve delay less than a given maximum delay between consecutive measurements. The energy-driven strategy considers both the data accuracy and the energy costs for the corresponding measurements. Finally, the privacy-driven strategy adds noise to measurements using differential privacy techniques. The …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:HIFyuExEbWQC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Heraklion MESH an experimental metropolitan multi-radio mesh network",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1287767.1287786",
            "Abstract": "We present the design and initial experience from an experimental metropolitan multi-radio mesh network that covers an area of approximately 60 Km 2 in the city of Heraklion, Crete. The network consists of 14 nodes, among which six are core nodes with up to four 802.11 a wireless interfaces each, and one wireless interface for management and monitoring. The distance between core nodes varies from 1 to 5 Km. Finally, the wireless mesh network contains two gateways that connect it to a fixed network.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:GFxP56DSvIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile quality of experience: Recent advances and challenges",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6815244/",
            "Abstract": "Quality of Experience (QoE) is important from both a user perspective, since it assesses the quality a user actually experiences, and a network perspective, since it is important for a provider to dimension its network to support the necessary QoE. This paper presents some recent advances on the modeling and measurement of QoE with an emphasis on mobile networks. It also identifies key challenges for mobile QoE.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Securing Named Data Networking routing using Decentralized Identifiers",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9481850/",
            "Abstract": "Named Data Networking (NDN) is a realization of the Information-Centric Networking (ICN) paradigm, where routing is based on content identifiers rather than on network location identifiers. The routing state in NDN can grow exponentially, not only due to the huge number of content identifiers (as opposed to network addresses) but also because it is difficult to detect \"fake\" routing advertisements. For example, in contrast to IP-based routing, a potentially valid routing entry in NDN can be advertised from multiple network locations, making NDN susceptible to Denial-of-Service attacks at the routing layer. In this paper, we leverage Decentralized Identifiers (DIDs) to build self-verifiable \"content advertisements.\" With our solution, any router can verify that a content advertisement originates from an \"authorized\" entity, without requiring any trusted third party. We implement our solution and we evaluate it in a scenario …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:0CzhzZyukY4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for opportunistic routing in multi-hop wireless networks",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1868589.1868600",
            "Abstract": "Opportunistic routing has recently been proposed to take advantage of the broadcast nature and spatial diversity of the wireless medium and cope with unreliable transmissions. Within this\" opportunistic routing hype\", complex routing schemes with opportunistic features have been proposed, but their performance gains can not be clearly attributed to their opportunistic character, since they also include other strong optimization features applicable to classical routing. A goal of this work is to study how purely wireless primitives and design characteristics affect a routing scheme with opportunistic features and thus design a new such scheme. To this end we introduced a simple framework under which, through simulation, we defined the key elements of an adaptive probabilistic forwarding scheme. We show that it outperforms the opportunistic elements of two well-known opportunistic routing protocols: SOAR and …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Research Agenda of the COST 290",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-85573-8_1",
            "Abstract": "The COoperation Scientifique et Technique (European Cooperation in Science and Technology)(COST) 290 Action was initiated in 2002 by a small team of researchers at a time when multimedia services were not yet very strongly manifested in the wireless environment; moreover, wireless networks of different scales offering broadband throughput were not so widely deployed and easily accessed. However, the strategic agenda of the COST 290 proposed back in 2002 today appears viable and feasible, still promising significant achievements in the future. Nevertheless, the original agenda can be easily extended further to cover new research topics of great significance. In 4 years, the Action became much greater in the scope of involvement–more than 60 institutions from 25 countries involved–with quite strong involvement of the European research community. We return to the very beginning of the project to see …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Multi-source mobile video streaming with proactive caching and D2D communication",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7158219/",
            "Abstract": "We present testbed experiments of multi-source mobile video streaming that jointly exploits mobility and throughput prediction to prefetch video data in caches located at hotspots that the mobile will encounter and device-to-device (D2D) communication to opportunistically obtain parts of a video from neighboring mobile devices. A contribution of this paper includes a procedure to efficiently utilize multirate Wi-Fi links, which can be legacy Wi-Fi hotspot links and device-to-device links using Wi-Fi direct.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A market managed multi-service Internet (M3I)",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366402001585",
            "Abstract": "In this paper, we describe our approach to managing quality of service (QoS) using pricing. We show how it is possible to synthesise network QoS in the end-systems along the lines of the end to end design principle, as one of many possible business models. We have: (i) developed an architecture for market management; (ii) invented new business models to test and demonstrate its flexibility; (iii) implemented generic mechanisms that not only enable these models but also many others; (iv) modelled selected features of the resulting systems and markets and (v) conducted experiments on users to assess acceptability and the feasibility of the overall approach. Each of these aspects is outlined in brief overview, with numerous references to more detailed work.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "for Various Packet Marking Algorithms",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=17706343280946219933&hl=en&oi=scholarr",
            "Abstract": "We investigate the service differentiation, in terms of average throughput, and the performance achieved using weighted window-based congestion control in networks supporting Explicit Congestion Notification (ECN). Our results show how service differentiation, queueing delay, and average throughput are affected by the increase and decrease rules of the end-system congestion control algorithms, and how they depend on the marking algorithms operating in the routers. The end-system algorithms we investigate include algorithms that achieve an average throughput proportional to some willingness-to-pay, and the marking algorithms include RED, virtual queue marking, and load-based marking.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:AHdEip9mkN0C",
            "Publisher": "Springer"
        },
        {
            "Title": "A family of key agreement mechanisms for mission critical communications for secure mobile ad hoc and wireless mesh internetworking",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2011/807684.pdf",
            "Abstract": "Future wireless networks like mobile ad hoc networks and wireless mesh networks are expected to play important role in demanding communications such as mission critical communications. MANETs are ideal for emergency cases where the communication infrastructure has been completely destroyed and there is a need for quick set up of communications among the rescue/emergency workers. In such emergency scenarios wireless mesh networks may be employed in a later phase for providing advanced communications and services acting as a backbone network in the affected area. Internetworking of both types of future networks will provide a broad range of mission critical applications. While offering many advantages, such as flexibility, easy of deployment and low cost, MANETs and mesh networks face important security and resilience threats, especially for such demanding applications. We …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Weighted window-based congestion control: test-bed implementation and experiments",
            "Publication year": 2002,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=16580687",
            "Abstract": "Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network Dimensioning Based on Percentage of Access Link Capacity Carrying Premium Traffic",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4024181/",
            "Abstract": "Network dimensioning is typically based on a traffic matrix that contains the bandwidth demand for each source-destination pair. We consider a different approach, which assumes that only the maximum amount of premium traffic that can be carried across each access link is known. Based on this information, we present three algorithms for determining the bandwidth required for premium traffic in the core network. The first algorithm intermediately estimates the traffic matrix based on the \"gravity model\". The other two algorithms compute the worst-case requirements for premium traffic when there are no link failures and fixed routing is used (second algorithm), and when there are link failures and alternative routing paths are available (third algorithm). An important feature of the two worst-case algorithms is that they allow admission control decisions to be based solely on the availability of bandwidth for premium …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of anomaly detection algorithms for detecting SYN flooding attacks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366405003531",
            "Abstract": "We investigate statistical anomaly detection algorithms for detecting SYN flooding, which is the most common type of Denial of Service (DoS) attack. The two algorithms considered are an adaptive threshold algorithm and a particular application of the cumulative sum (CUSUM) algorithm for change point detection. The performance is investigated in terms of the detection probability, the false alarm ratio, and the detection delay, using workloads of real traffic traces. Particular emphasis is on investigating the tradeoffs among these metrics and how they are affected by the parameters of the algorithm and the characteristics of the attacks. Such an investigation can provide guidelines to effectively tune the parameters of the detection algorithm to achieve specific performance requirements in terms of the above metrics.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:8xutWZnSdmoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Handover incentives for WLANs with overlapping coverage",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02118-3_13",
            "Abstract": "It is well known that in IEEE 802.11 networks, the assignment of low-rate and high-rate users to the same access point significantly degrades the performance of the high-rate users. Our objective is to investigate the implications of the above performance degradation on the incentives for handover between 802.11 wireless local area networks with overlapping coverage. Our focus is on the incentives for supporting handovers, due solely to the improved performance handovers yield for both wireless networks. To study the phenomenon and estimate the potential gain of such handovers, we propose a simple model that predicts the throughput of each access point in different cases. The throughput approximation model can indicate when the handover is expected to be beneficial, and can be used in a handover acceptance policy. Simulation of the proposed procedure suggests that the model is accurate and …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Experiences with a metropolitan multiradio wireless mesh network: design, performance, and application",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6231289/",
            "Abstract": "Wireless mesh networks comprise nodes with multiple radio interfaces, and can provide low-cost high-speed Internet access or connectivity for data transfer. In this article we report our experiences and investigations with an experimental metropolitan multiradio mesh network that covers an area of approximately 60 km 2  in the city of Heraklion, Crete. We present the design and deployment of the network, experiments to quantify the network's performance, and an application that runs on top of it and exploits it's low-cost wide-area connectivity. The metropolitan network consists of 16 nodes, among which six are core nodes, each with up to four 802.11a wireless interfaces and an additional wireless interface for management and monitoring. The distance between core mesh nodes varies from 1.6 to 5 km, and the mesh network contains two gateways that connect it to a wired network. Our performance experiments …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced, ubiquitous and dependable broadband access using MESH networks",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=5164769099747075511&hl=en&oi=scholarr",
            "Abstract": "The reduction of network deployment and operation costs and the integration of wireless access networks with fixed broadband access technology are crucial to allowing small and medium-scale enterprises to enter the high-growth potential mobile broadband access market, and for the introduction of innovative services that require pervasive broadband access.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Popularity-aware intra-domain mobility management",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3097620.3097623",
            "Abstract": "We present and evaluate a popularity-aware intra-domain mobile content management model based on which the Name Resolution System (NRS) is updated with the current location of mobile content only when the content has sufficiently high popularity and sufficiently low mobility. Specifically, the current location of mobile content is updated only when the overall cost of location updates is smaller than the cost of broadcasting location queries. On the other hand, the location of content with low popularity and high mobility that is not tracked by the NRS is discovered by broadcasting location queries. Our evaluation investigates how the performance gains of the proposed model, in terms of reduced total signaling cost and reduced memory requirements of the NRS, depend on the aggregate content request rate, content mobility (rate of content location changes), number of content objects, content popularity, and …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling Decentralised Identiﬁers and Veriﬁable Credentials for Constrained IoT Devices using OAuth-based Delegation",
            "Publication year": 2019,
            "Publication url": "https://research.aalto.fi/en/publications/enabling-decentralised-identi%EF%AC%81ers-and-veri%EF%AC%81able-credentials-for-c",
            "Abstract": "Decentralised identiﬁers (DIDs) and veriﬁable credentials (VCs) are upcoming standards for self-sovereign privacy-preserving identiﬁers and authorisation, respectively. This focus on privacy can help improve many services and open up new business models, but using DIDs and VCs directly on constrained IoT devices can be problematic due to the management and resource overhead. This paper presents an OAuth-based method to delegate the processing and access policy management to the Authorisation Server thus allowing also systems with constrained IoT devices to beneﬁt from DIDs and VCs.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:PVgj2kMGcgYC",
            "Publisher": "Internet Society"
        },
        {
            "Title": "Decentralized Interledger Gateway Architectures in Authorization Scenarios with Multiple Ledgers",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9119678/",
            "Abstract": "Combining multiple Distributed Ledger Technologies (DLTs) that include public and private/permissioned ledgers can allow different tradeoffs in terms of performance, cost, privacy, and transparency. However, multiple DLTs must be interconnected in a way that securely binds transactions on different ledgers and allows reliable and trusted transfer of information across the ledgers. We present decentralized interledger gateway architectures for IoT authorization scenarios that include the interconnection of two ledgers: an authorization ledger and a payment ledger. The proposed architectures differ in their complexity, transaction cost, and ability to handle transactions involving multiple ledgers.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:5MTHONV0fEkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless maritime networking experiments with Dedalus",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3267204.3268068",
            "Abstract": "We present Dedalus, a software platform for setting up, executing, and monitoring complex wireless networking experiments running jointly multiple experimental protocols. Although Dedalus can be used for experimentation in a variety of settings, the motivating application, which has influenced its design, is maritime networking. In the case of experiments taking place in FIRE+ RAWFIE testbeds, Dedalus seamlessly makes use of the infrastructure offered by the testbed in order to maximize the scope of the experiments.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:DUooU5lO8OsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards Exploiting User-Centric Information for Proactive Caching in Mobile Networks",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/62034027/2012-WWRF-caching.pdf",
            "Abstract": "An important direction in mobile and wireless networks is how to track, understand and leverage a users’ context, preferences, and behavior in order to improve the quality of service offered by the network and experienced by users. The current extended abstract investigates how a users’ information requests and mobility behavior can be leveraged to proactively cache requested information at users’ future network attachment points, thus reducing the delay for delivering the information upon handing off and reattaching.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross-layer security and resilience in wireless mesh networks",
            "Publication year": 2010,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/k7_Cross-layer%20Security-Chapter%2013.pdf",
            "Abstract": "Security and Resilience has become an important concern in the security design and architecture of future wireless networking technologies like Wireless Mesh Networks (WMN)[1, 2]. Network operators and service providers consider mesh networking to be a serious candidate to solve the so called “last mile problem” based on their wider coverage than traditional wireless LANs and their lower deployment cost than 3G cellular networks. While there are several usage scenarios [3] and business opportunities [4] and there exist the so called community based mesh networks that are operated by individuals, the real business potential lies in operator based mesh networks. Such examples include Ozone's mesh network in Paris (www. ozone. net/en/) and The Cloud in the City of London (www. thecloud. net). If such pilot projects turn out to be successful, then mesh networking may become extremely popular and wide-spread.In order to turn the tremendous business potential represented by mesh networking into real profit, one needs to solve a number of technical problems related to the design and operation of mesh networks. In this chapter, we address one of those problems: securing mesh networks in a cross layer manner and ensuring resilient operation. It is evident that security and resilience issues need to be considered seriously and solved appropriately. Unlike the wireline networks, the unique characteristics of wireless networks pose a number of nontrivial challenges to resilience and security design, such as open peer-to-peer network architecture, shared wireless medium, stringent resource constraints, and highly dynamic network topology.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large Deviation tecniques for traffic engineering",
            "Publication year": 2002,
            "Publication url": "https://ci.nii.ac.jp/naid/10020376356/",
            "Abstract": "CiNii 論文 - Large Deviation tecniques for traffic engineering CiNii 国立情報学研究所 学術情報\nナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 \nログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行\n物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 Large Deviation \ntecniques for traffic engineering SIRIS VA 被引用文献: 1件 著者 SIRIS VA 収録刊行物 \nhttp://www.ics.forth.gr/netgroup/msa/ http://www.ics.forth.gr/netgroup/msa/ 被引用文献: 1件中 \n1-1件を 表示 1 ATMセルトラヒックの実効帯域に関する上界について 石井 周一郎 , 中川 健治 情報\n理論とその応用シンポジウム予稿集 = The proceedings of the Symposium on Information Theory \nand Its Applications 24(2), 751-754, 2001-12-04 参考文献7件 Tweet 各種コード NII論文ID(NAID) \n10020376356 資料種別 その他 データ提供元 CJP引用 書き出し RefWorksに書き出し にに/で| …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Heraklion MESH an experimental metropolitan multi-radio mesh network",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1287767.1287786",
            "Abstract": "We present the design and initial experience from an experimental metropolitan multi-radio mesh network that covers an area of approximately 60 Km 2 in the city of Heraklion, Crete. The network consists of 14 nodes, among which six are core nodes with up to four 802.11 a wireless interfaces each, and one wireless interface for management and monitoring. The distance between core nodes varies from 1 to 5 Km. Finally, the wireless mesh network contains two gateways that connect it to a fixed network.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum assignment in cognitive radio networks: A comprehensive survey",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6407454/",
            "Abstract": "Cognitive radio (CR) has emerged as a promising technology to exploit the unused portions of spectrum in an opportunistic manner. The fixed spectrum allocation of governmental agencies results in unused portions of spectrum, which are called \"spectrum holes\" or \"white spaces\". CR technology overcomes this issue, allowing devices to sense the spectrum for unused portions and use the most suitable ones, according to some pre-defined criteria. Spectrum assignment is a key mechanism that limits the interference between CR devices and licensed users, enabling a more efficient usage of the wireless spectrum. Interference is a key factor that limits the performance in wireless networks. The scope of this work is to give an overview of the problem of spectrum assignment in cognitive radio networks, presenting the state-of-the-art proposals that have appeared in the literature, analyzing the criteria for selecting the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "throughput in 802.11 WLANs with high delay variability”. 2nd IEEE Int’l Symposium on Wireless Communication Systems (ISWCS’05)",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=334303024491737041&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "OAuth 2.0 meets blockchain for authorization in constrained IoT environments",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8767223/",
            "Abstract": "We present models for utilizing blockchain and smart contract technology with the widely used OAuth 2.0 open authorization framework to provide delegated authorization for constrained IoT devices. The models involve different trade-offs in terms of privacy, delay, and cost, while exploiting key advantages of blockchains and smart contracts. These include linking payments to authorization grants, immutably recording authorization information and policies in smart contracts, and offering resilience through the execution of smart contract code on all blockchain nodes.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:OcBU2YAGkTUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Achieving service differentiation and high utilization in IEEE 802.11",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-39867-7_11",
            "Abstract": "Service differentiation in wireless LANs is a growing demand, due to their increasing use for applications with different requirements and the scarcity of wireless channel resources. The contribution of this paper is twofold: First, we investigate how various parameters of the IEEE 802.11 MAC protocol affect service differentiation, in terms of both throughput and delay. Second, we propose a new approach for providing service differentiation, while achieving high wireless network utilization. Simulation investigations demonstrate that our approach can effectively adapt to varying network conditions. The approach can be implemented at the access point of a wireless LAN, while the wireless stations need only to support the emerging IEEE 802.11e standard.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Securing multi‐operator‐based QoS‐aware mesh networks: requirements and design options",
            "Publication year": 2010,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.728",
            "Abstract": "Wireless mesh networking allows network operators and service providers to offer nearly ubiquitous broadband access at a low cost to customers. In this paper, we focus on QoS‐aware mesh networks operated by multiple operators in a cooperative manner. In particular, we identify the general security requirements of such networks and we give an overview on the available design options for a security architecture aiming at satisfying those requirements. More specifically, we consider the problems of mesh client authentication and access control, protection of wireless communications, securing the routing, key management, and intrusion and misbehavior detection and recovery. Our aim is to structure this rich problem domain and to prepare the grounds for the design of a practically usable security architecture. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:KlAtU1dfN6UC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "A contention-aware routing metric for multi-rate multi-radio mesh networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4557761/",
            "Abstract": "We present a new routing metric for multi-rate multi-radio mesh networks, which takes into account both contention for the shared wireless channel and rate diversity in multi-radio multi-channel mesh networks. A key property of the proposed contention-aware transmission time (CATT) metric is that it is isotonic, hence can be applied to link-state routing protocols. We have implemented the CATT metric in the OLSR routing protocol, and evaluate it in a test-bed with mesh nodes each equipped with four radio interfaces. Our experiments show that the proposed routing metric significantly outperforms other metrics that have appeared in the literature, in a number of scenarios that correspond to different mesh network topologies.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A privacy-preserving statistics marketplace using local differential privacy and blockchain: An application to smart-grid measurements sharing",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2096720921000178",
            "Abstract": "Service providers usually require detailed statistics in order to improve their services. On the other hand, privacy concerns are intensifying and sensitive data is protected by legislation, such as GDPR (General Data Protection Regulation). In this paper, we present the design, implementation, and evaluation of a marketplace that allows “data consumers” to buy information from “data providers”, which can then be used for generating meaningful statistics. Additionally, our system enables “system operators” that can select which data providers are allowed to provide data, based on filtering criteria specified by the data consumer. We leverage local differential privacy to protect the data provider's privacy against data consumers, as well as against system operators, and we build a blockchain-based solution for ensuring fair exchange, and immutable data logs. Our design targets use cases that involve hundreds or even …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:4xDN1ZYqzskC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the performance of network coding and forwarding schemes with different degrees of redundancy for wireless mesh networks",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366415001565",
            "Abstract": "This work explores the throughput and delay that can be achieved by various forwarding schemes, employing multiple paths and different degrees of redundancy, focusing on linear network coding. The key contribution of the study is an analytical framework for modeling the throughput and delay for various schemes, considering wireless mesh networks where unicast traffic is forwarded and hop-by-hop retransmissions are employed for achieving reliability. The analytical framework is generalized for an arbitrary number of paths and hops per path. Another key contribution of the study is the evaluation and extension of the numerical results, drawn from the analysis, through system-level simulations. Our results show that, in scenarios with significant interference, the best throughput-delay tradeoff is achieved by single path forwarding. Moreover, when significant interference is present and network coding employs the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:tzM49s52ZIMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Service differentiation in ECN networks using weighted window-based congestion control for various packet marking algorithms",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45412-8_14",
            "Abstract": "We investigate the service differentiation, in terms of average throughput, and the performance achieved using weighted window-based congestion control in networks supporting Explicit Congestion Notification (ECN). Our results show how service differentiation, queueing delay, and average throughput are affected by the increase and decrease rules of the end-system congestion control algorithms, and how they depend on the marking algorithms operating in the routers. The end-system algorithms we investigate include algorithms that achieve an average hroughput proportional to some willingness-to-pay, and the marking algorithms include RED, virtual queue marking, and load-based marking.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A study of simple usage‐based charging schemes for broadband networks",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1019103214455",
            "Abstract": "Operators of multi‐service networks require simple charging schemes with which they can fairly recover costs from their users and effectively allocate network resources. This paper studies an approach for computing such charges from simple measurements (time and volume), and relating these to bounds of the effective bandwidth. To achieve economic efficiency, it is necessary that usage‐based charging schemes capture the relative amount of resources used by connections. Based on this criteria, we evaluate our approach for real traffic consisting of Internet Wide Area Network traces and MPEG‐1 compressed video. Its incentive compatibility is shown with an example involving deterministic multiplexing, and the effect of pricing on a network's equilibrium is investigated for deterministic and statistical multiplexing. Finally, we investigate the incentives for traffic shaping provided by the approach.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Multi-source mobile video streaming: load balancing, fault tolerance, and offloading with prefetching",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13326-3_26",
            "Abstract": "We present the design and experiments from a testbed implementation of multi-source mobile video streaming that combines three mechanisms: 1) load balancing among different paths from multiple sources, 2) resilience to link and server failures, and 3) enhanced offloading by exploiting mobility and throughput prediction to prefetch video data in caches located at hotspots that the mobile will encounter. Our testbed consists of an Android mobile video streaming client that can utilize both cellular and Wi-Fi interfaces and request different parts of a video from different servers, a server that accepts client requests for parts of a video, and a cache server that accepts client requests to proactively fetch parts of a video so that they are immediately available when the mobile client enters the cache server’s hotspot.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:fEOibwPWpKIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "First International Workshop onAdvanced EXPerimental Activities ON WIRELESS Networks and Systems (EXPONWIRELESS 2006)",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1109/WOWMOM.2006.67",
            "Abstract": "The 15 members of the Technical Program Committee, together with several additional external reviewers, worked hardly for providing the basis for the final paper selection. The final program was excellent and diverse, and covered fundamental issues in wireless measurements in operating and test-bed network scenarios, experimental analysis of wireless sensor networks, of protocols for fast handoff and for multicast services.The final result would not have been possible without the dedication and hard work of many colleagues. Special thanks are due to the members of the Technical Program Committee and to all external referees for their invaluable help with the paper reviews and their overall sense of responsibility and responsiveness under very tight deadlines in a particularly busy period. Finally, we are very grateful to all authors who honoured EXPONWIRELESS 2006 by trusting their work to the workshop.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interacting with the Internet of Things using smart contracts and blockchain technologies",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-05345-1_38",
            "Abstract": "Despite technological advances, most smart objects in the Internet of Things (IoT) cannot be accessed using technologies designed and developed for interacting with powerful Internet servers. IoT use cases involve devices that not only have limited resources, but also they are not always connected to the Internet and are physically exposed to tampering. In this paper, we describe the design, development, and evaluation of a smart contract-based solution that allows end-users to securely interact with smart devices. Our approach enables access control, Thing authentication, and payments in a fully decentralized setting, taking at the same time into consideration the limitations and constraints imposed by both blockchain technologies and the IoT paradigm. Our prototype implementation is based on existing technologies, i.e., Ethereum smart contracts, which makes it realistic and fundamentally secure.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Wired/Wireless Internet Communications",
            "Publication year": 2008,
            "Publication url": "https://opus4.kobv.de/opus4-UBICO/frontdoor/index/index/docId/5760",
            "Abstract": "OPUS 4 | Wired / Wireless Internet Communications Deutsch Open Access Home Search \nBrowse Publish FAQ Wired / Wireless Internet Communications Harju, J., Heijenk, G., \nLangendörfer, Peter, Siris, VA Export metadata BibTeX RIS XML Additional Services Share in \nTwitter Search Google Scholar Metadaten Author: Harju, J., Heijenk, G., Langendörfer, \nPeterGND, Siris, VA ISBN: 978-3-540-68805-1 Publisher: Springer Place of publication: Berlin \nDocument Type: Buch (Herausgeber) Language: English Erscheinungsjahr: 2008 Pagenumber: \nXII, 223 Schriftenreihe ; Bandnummer: Lecture notes in computer science ; 5031 Institution / \nSubject: Fakultät 1 MINT - Mathematik, Informatik, Physik, Elektro- und Informationstechnik / FG \nSysteme Institution name at the time of publication: Fakultät für Mathematik, Naturwissenschaften \nund Informatik (eBTU) / LS Systeme OPUS4 Logo Contact Policy Imprint Sitelinks Login …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:lvd772isFD0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context Monitoring for Improved System Performance and QoE",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=xdhdDwAAQBAJ&oi=fnd&pg=PA23&dq=info:A3oJicFgWt4J:scholar.google.com&ots=4CHqMxDoN-&sig=i-XYHb_25SRTZjMh4lKvtNIGdj4",
            "Abstract": "Whereas some application domains show a certain consensus on the role of system factors, human factors, and context factors, QoE management of multimedia systems and services is still faced with the challenge of identifying the key QoE influence factors. In this chapter, we focus on the potential of enhancing QoE management mechanisms by exploiting valuable context information. To get a good grip on the basics we first discuss a general framework for context monitoring and define context information, including technical, usage, social, economic, temporal, and physical factors. We then iterate the opportunities and challenges in involving context in QoE monitoring solutions, as context may be, eg, hard to ascertain or very situational. c The Author (s) 2018 I. https://doi. org/10.1007/978-3-319-90415-3 Ganchev et al.(Eds.): Autonomous Control _2 for a Reliable Internet of Services, LNCS 10768, pp. 23–48, 2018.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Information-Centric Networking (ICN) architectures for integration of satellites into the Future Internet",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6400134/",
            "Abstract": "This paper discusses the integration of satellite and terrestrial networks over an Information Centric Networking (ICN) architecture. Focus is given on the identification of the key features that characterize ICN architectures and how these may impact, but also be affected by, the integration of satellite and terrestrial networks. The work presented contains intermediate results obtained as part of the ongoing ESA ARTES study `φSAT' on the role of satellites in the Future Internet.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cell coverage based on social welfare maximization",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.4.3760&rep=rep1&type=pdf",
            "Abstract": "We introduce a new approach, based on social welfare maximization, for determining the coverage of a single cell in a WCDMA system. The approach takes into account resource usage in the uplink direction, and captures the tradeoff between having a large cell with many users versus having a smaller cell with fewer users, which however are able to transmit at a higher rate. Our numerical investigations demonstrate how cell coverage determined using the above approach is affected by various system parameters, such as the path propagation characteristics, the mobile power limit, and the distribution of mobile hosts within a cell.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Addressing niche demand based on joint mobility prediction and content popularity caching",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128616303334",
            "Abstract": "We present an efficient mobility-based proactive caching model for addressing niche mobile demand, along with popularity-based and legacy caching model extensions. Opposite to other proactive solutions which focus on popular content, we propose a distributed solution that targets less popular, personalised or dynamic content requests by prefetching data in small cells based on aggregated user mobility prediction information. According to notable studies, niche demand, particularly for video content, represents a significant 20–40% of Internet demand and follows a growing trend. Due to its novel design, our model can directly address such demand, while also make a joint use of content popularity information with the novelty of dynamically tuning the contribution of mobility prediction and content popularity on local cache actions.Based on thorough performance evaluation simulations after exploring different …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:FPJr55Dyh1AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Content-Centric Architectures for Moving Objects",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=4211758902245976921&hl=en&oi=scholarr",
            "Abstract": "The goal of this white paper is to describe representative usage scenarios and their corresponding requirements, as well as state-of-the-art technological solutions and open research directions for key functionalities related to content-centric architectures for networks of moving objects. The usage scenarios presented include smart transport, data dissemination in partially connected environments, collaborative sensing, and situation and presence-aware services. The functionalities discussed include name resolution, routing, forwarding, discovery, content sharing, in-network caching, and the generalization of content-centric networking to service-centric networking.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:FAceZFleit8C",
            "Publisher": "Cost Action WiNeMo"
        },
        {
            "Title": "Optimal CWmin selection for achieving proportional fairness in multi-rate 802.11 e WLANs: test-bed implementation and evaluation",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1160987.1160996",
            "Abstract": "We investigate the optimal selection of minimum contention window values to achieve proportional fairness in a multirate IEEE 802.11 e test-bed. Unlike other approaches, the proposed model accounts for the contention-based nature of 802.11's MAC layer operation and considers the case where stations can have different weights corresponding to different throughput classes. Our test-bed evaluation considers both the long-term throughput achieved by wireless stations and the short-term fairness. When all stations have the same transmission rate, optimality is achieved when a station's throughput is proportional to its weight factor, and the optimal minimum contention windows also maximize the aggregate throughput. When stations have different transmission rates, the optimal minimum contention window for high rate stations is smaller than for low rate stations. Furthermore, we compare proportional fairness …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selected papers from the 19th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=8331286329576215543&hl=en&oi=scholarr",
            "Abstract": "Wireless, mobile, and multimedia networks have experienced significant progress in the past years. This includes advances that range from lower layer mechanisms for handling interference and coordination among multiple devices, cross-layer communication with the co-existence of licensed and unlicensed technologies, to procedures for efficient communication and content dissemination in dense deployments of the Internet of Things. This special issue introduces three papers that are extended versions of papers presented in the 19th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks (WOWMOM 2018) that took place June 12–15 in Chania, Greece.Raphaël Naves et al. in their paper entitled “When Analog Meets Digital: Source-Encoded Physical-Layer Network Coding” identify the strong coupling between Physical-Layer Network Coding (PLNC) and Two-Way Relay …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:fbc8zXXH2BUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On satellite-assisted publish-subscribe future network architectures for smart M2M applications",
            "Publication year": 2011,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/h12_Liolis-Siris-Polyzos_FICW_Poznan_October2011.pdf",
            "Abstract": "Due to their inherent wide coverage, dependability, resilience and global significance, Satellite Communications (SatCom) can play an integral role within several Future Internet (FI) application domains that address Grand Societal Challenges towards a sustainable and efficient economy [1-3]. Eg, SatCom can effectively support smart FI-enabled transportation systems, smart FI-enabled security and public safety systems, as well as smart FI-enabled healthcare systems.Such FI application domains refer to information collection and dissemination services/applications within the “Internet of Things” communication paradigm, where the real physical world is connected to the digital world through a multitude of sensors and actuators. In particular, satellite M2M (Machine-to-Machine) communications, currently a relatively small market compared to that of terrestrial wireless networks, is expanding, led by the growing need to track and monitor difficult-to-reach valuable assets. Satellite M2M networking is gaining popularity in a wide range of governmental and commercial markets owing to the considerable benefits offered by the technology [4]. For certain industries, such as oil and gas, utilities, and transportation and distribution, wherein large numbers of assets are deployed in remote locations with inadequate cellular coverage, M2M becomes an expensive proposition unless satellite networks are used (and deployed, if needed). Satellite M2M is preferred for high-end applications requiring wide coverage, particularly in oceans, deserted, or rural areas, and for performing mission-critical monitoring.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Services, optimization, and economic aspects",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-85573-8_6",
            "Abstract": "Future broadband wireless services will involve a range of different technologies, all with varying characteristics. These differences can influence significantly how a service is defined and deployed as well as how it is commercially offered to customers. Key technologies and services that will influence and shape the future broadband telecommunication market include WiFi services based on IEEE 802.11 standards, enhanced Universal Mobile Telecommunication System (UMTS) services, mobile grid services, incoming call handling services, and finally alternative approaches to broadband access such as high aerial platforms. Each of these technologies and services has unique requirements in terms of deployment and management. Commercial offerings of value-added telecommunication services require appropriate support mechanisms, as the wired and wireless Internet design principles and architecture were …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Creating motives for cooperation to achieve high throughput in wireless ad hoc networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1549380/",
            "Abstract": "In wireless ad hoc networks, nodes that are not within the same transmission range communicate using intermediate nodes as relays. Due to their limited battery life, wireless nodes can decide to deny incoming relay requests, in which case the network's connectivity and aggregate throughput decreases. In this paper, we describe two algorithms that create motives for cooperation among node in an ad hoc network. The first algorithm, called neighbor GTFT (N-GTFT) is an extension of the GTFT (generous tit-for-tat) algorithm presented in V. Srinivasan et al. (2003), according to which a node relays packets for a particular neighbor based on the amount of given help it has received from that neighbor. The second algorithm maintains the difference between the amount of received and the amount of given help within bounds defined by a token bucket, and yields higher throughput in the case of bursty traffic. Both …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proceedings of the 3rd European Conference on Computer Network Defense",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=gJbl3-G4KQ0C&oi=fnd&pg=PR6&dq=info:fOM4bKNAYR4J:scholar.google.com&ots=x5oOuchycR&sig=I9qV4rvHq3tN69to6fmY6f9sJoE",
            "Abstract": "The 3rd European Conference on Computer Network Defense took place in September 2007 at Aldemar Hotel, in Heraklion, Crete, Greece in cooperation with the European Network and Information Security Agency (ENISA). The theme of the conference was the protection of computer networks. The conference drew participants from academia and industry in Europe and beyond to discuss hot topics in applied network and systems security. The conference was a great success, with 6 refereed papers and 6 invited presentations on topics ranging from high assurance networks of virtual machines to signaling vulnerabilities in wiretapping systems. This book contains the refereed as well as refereed papers. We are greatful to the authors and presenters for their contributions, as well as the participants of EC2N’07 for making the conference a success. We are looking forward to a successful EC2ND event in 2008. KG Anagnostakis, S. Ioannidis, V. Siris Contents 1 Tales from the Crypt: Fingerprinting Attacks on Encrypted Channels by Way of Retainting........................................ 1 Michael Valkering, Asia Slowinska, and Herbert Bos 1 Introduction......................................................................................... 1 2 Architecture......................................................................................... 3 2.1 Tracking Issues.............................................................................. 4 2.2 Retainting...................................................................................... 6 2.2. 1 Determining the Tag............................................................. 6 2.2. 2 Identifying the SSL Conversation........................................ 8 2.3 Interposition Details...................................................................... 9 3 Signature Generation........................................................................... 9 3.1 …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Utility-based channel assignment and topology control in wireless mesh networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5534902/",
            "Abstract": "We define a utility-based framework for joint channel assignment and topology control in multi-rate multi-radio wireless mesh networks, and present a greedy algorithm for solving the corresponding optimization problem. Key features of the proposed approach are the support for different target objectives, which are expressed as utility functions of the MAC layer throughput, and the efficient utilization of wired network gateways, while guaranteeing that for every mesh node there exists a path to a gateway. Investigations show the influence of different target objectives on the channel assignment and network topology, demonstrate the proposed approach's load balancing properties in mesh networks containing multiple gateways, show the effect of 802.11a adjacent channel interference on the channel assignment, and compare the performance of the proposed procedure with a rate-based channel assignment scheme.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interledger smart contracts for decentralized authorization to constrained things",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8845275/",
            "Abstract": "We present models that utilize smart contracts and interledger mechanisms to provide decentralized authorization for constrained IoT devices. The models involve different tradeoffs in terms of cost, delay, complexity, and privacy, while exploiting key advantages of smart contracts and multiple blockchains that communicate with interledger mechanisms. These include immutably recording hashes of authorization information and policies in smart contracts, resilience through the execution of smart contract code on all blockchain nodes, and cryptographically linking transactions and IoT events recorded on different blockchains using hash and time-lock mechanisms. The proposed models are evaluated on the public Ethereum testnets Rinkeby and Ropsten, in terms of execution cost (gas), delay, and reduction of data that needs to be sent to the constrained IoT devices.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ODE9OILHJdcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advanced topics in service delivery over integrated satellite terrestrial networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6934529/",
            "Abstract": "This paper focuses on the evolution of communication networks and service delivery. It identifies major trends that will drive the evolution of networks and service delivery in the next years. Among them Software Defined Networking (SDN) is probably the single most important technology evolution trend that will change networking. Based on the identified trends it presents a reference service delivery architecture, which it then translates into selected satellite terrestrial integration scenarios. The paper argues that SDN, originating from data communications is a technology that should be considered in any satellite terrestrial integration scenario, and highlights its potential role in the selected integration scenarios. It concludes that for the successful integration of satellite in such future integrated scenarios that all encompass SDN a further extension of the OpenFlow standard is needed that considers and handles the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:gsN89kCJA0AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Smart IoT data collection",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8449766/",
            "Abstract": "We present and experimentally evaluate procedures for efficient IoT data collection while achieving target requirements in terms of data accuracy and privacy protection. The procedures adjust the time period between consecutive measurements following an additive increase and multiplicative decrease (AIMD) scheme based on a target data accuracy and add noise to measurements using differential privacy techniques. The experimental evaluation involves real temperature and humidity measurements obtained from two testbeds through the FIESTA-IoT platform. Our results show that the AIMD adaptation of the measurement period is robust to different types of measurements from different testbeds, without having any tuning parameters, and the addition of noise to the sensor measurements using differential privacy has a negligible effect on the aggregate statistics.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:umqufdRvDiIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance and energy efficiency of mobile data offloading with mobility prediction and prefetching",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6583450/",
            "Abstract": "We present a detailed evaluation of procedures that exploit mobility prediction and prefetching to enhance offloading of traffic from mobile networks to WiFi hotspots, for both delay tolerant and delay sensitive traffic. We consider empirical measurements and evaluate the percentage of offloaded traffic, data transfer delay, and energy consumption of the proposed procedures. Our results illustrate how various factors such as mobile, WiFi and hotspot backhaul throughput, data size, number of hotspots, along with time and throughput estimation errors, influence the performance and energy efficiency of mobile data offloading enhanced with mobility prediction and prefetching.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "802.11 e EDCA protocol parameterization: A modeling and optimization study",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4351767/",
            "Abstract": "The IEEE 802.11e MAC protocol specifies an enhanced distributed channel access (EDCA) mechanism with adjustable protocol parameters, providing differentiated access to wireless stations. The EDCA parameters are: CW min  and CW max  (minimum and maximum contention window), AIFS (arbitration interframe space), and TXOP (transmit opportunity). In this paper we study the joint setting of these parameters to maximize capacity and optimize performance under QoS constraints. We first revisit the analytical modeling in saturation and non-saturation conditions and provide more detailed approximations of the mean channel access delay and throughput. Considering two classes of wireless stations with higher and lower QoS demands, and optimizing with respect to average measures and constraints, we provide Pareto optimal pairs for the number of supported stations from the two classes for different …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adjacent channel interference in 802.11 a: Modeling and testbed validation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4463561/",
            "Abstract": "In this work we utilize the model for calculation of the interference power by partially overlapping channels and combine it with the signal to interference plus noise (SINK) criterion for signal capture to quantify the effect of adjacent channel interference (ACI) in 802.11a. We validate the results from our theoretical model by applying it on an in-lab testbed, in which we use signal splitters/combiners and fixed attenuators to emulate the wireless channel. Our experiment setup is able to isolate the mechanisms that the neighboring channel interference affects the 802.11a: the packet capture at the receiver and the clear channel assessment (CCA) mechanism. We quantify the effect of ACI for both of these mechanisms in terms of throughput. Our results indicate that equipping a single node with multiple interfaces requires careful channel allocation and physical antenna separation, since throughput can be severely …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Techniques for DiffServ-based QoS in hierarchically federated MAN networks-the GRNET case",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541519/",
            "Abstract": "DiffServ is the basis of contemporary QoS-enabled networks. Setting up DiffServ QoS requires extensive engineering effort in dimensioning and provisioning, especially for adjacent networks under different administrations linked in a \"federated\" hierarchy. In this paper we present a case study for QoS techniques employed in the GRNET MAN networks of Athens and Crete. After introducing the supported QoS mechanisms and service types, we discuss our dimensioning methodology and present two algorithms for worst-case dimensioning. We explain the provisioning mechanisms of GRNET and we present in brief our new automated provisioning ANS tool. Finally, we deal with the extension of our mechanisms and tools in hierarchically federated networks and give some future directions of our work",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Satellite-terrestrial integration scenarios for future information-centric networks",
            "Publication year": 2012,
            "Publication url": "https://arc.aiaa.org/doi/pdf/10.2514/6.2012-15043",
            "Abstract": "N the last few years there is pressure on the current Internet architecture to meet new and emerging needs of its users. Inefficiencies of the current Internet architecture with regard to, eg, mobility support, traffic management or content delivery, have been highlighted along with the complexities of proposed work-arounds or patches, which have progressively led to the Internet’s ossification. The root of these inefficiencies lies in the mismatch between the current Internet’s host-centric communication and the Internet’s dominant usage, which now involves end-users interested in information and services with no regard to a particular device or location providing the information or the service.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:anf4URPfarAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adjacent channel interference in 802.11 a is harmful: Testbed validation of a simple quantification model",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5723815/",
            "Abstract": "Wireless LAN radio interfaces based on the IEEE 802.11a standard have lately found widespread use in many wireless applications. A key reason for this was that although the predecessor, IEEE 802.11b/g, had a poor channelization scheme, which resulted in strangling adjacent channel interference (ACI), 802.11a was widely believed to be ACI-free due to a better channelization combined with OFDM transmission. We show that this is not the case. ACI does exist in 802.11a, and we can quantify its magnitude and predict its results. For this, we present minor modifications of a simple model originally introduced by that allow us to calculate bounding values of the 802.11a ACI, which can be used in link budget calculations. Using a laboratory testbed, we verify the estimations of the model, performing experiments designed to isolate the affected 802.11 mechanisms. This isolation was enabled by not using the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "I-CAN: Information-centric access networking",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7194110/",
            "Abstract": "We present the Information-Centric Access Network (I-CAN) architecture, which is based on the publish-subscribe Information-Centric Networking (ICN) paradigm, identifying how it accounts for specific characteristics of mobile and wireless access networks. We also present initial results from the testbed implementation of two application scenarios that exploit key features of the I-CAN architecture: secure publication proxy and multi-source mobile video streaming.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decentralized authorization in constrained IoT environments exploiting interledger mechanisms",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366419312174",
            "Abstract": "We present models that utilize smart contracts and interledger mechanisms to provide decentralized authorization for constrained IoT devices. The models involve different tradeoffs in terms of cost, delay, complexity, and privacy, while exploiting key advantages of smart contracts and multiple blockchains that communicate with interledger mechanisms. These include immutably recording hashes of authorization information and policies in smart contracts, resilience through the execution of smart contract code on all blockchain nodes, and cryptographically linking transactions and IoT events recorded on different blockchains using hash-lock and time-lock mechanisms. In the case of two ledgers, an authorization and a payment ledger, the authorization ledger can be a private Ethereum network or a permissioned ledger such as Hyperledger Fabric. For decentralized authorization where a subset of m-out-of-n …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:nZcligLrVowC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wired/Wireless Internet Communications",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-68807-5.pdf",
            "Abstract": "WWIC 2008 was organized by the Technical University of Tampere, Finland, and it was the sixth event in a series of International Conferences on Wired/Wireless Internet Communications. Previous events were held in Coimbra (Portugal) in 2007, Berne (Switzerland) in 2006, Xanthi (Greece) in 2005, Frankfurt (Germany) in 2004, and Las Vegas (USA) in 2002. The WWIC 2008 call for papers attracted 67 submissions from 33 countries, which were subject to thorough review work by the Technical Program Committee members and additional reviewers. The selection process resulted in acceptance of 18 papers, organized into 6 single-track technical sessions. The WWIC 2008 main technical program covered studies on performance analysis of wireless systems, topics on resource and QoS management, and issues on implementation techniques, mobility, cross-layer design and wireless sensor networks. The …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:cWzG1nlazyYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Web-based Tool for Advanced Statistical Analysis of Network Traffic Measurements",
            "Publication year": 2000,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/s14.pdf",
            "Abstract": "We present a web-based tool for advanced statistical analysis of network traffic measurements. The tool consists of an interface and software modules implementing advanced statistical analysis procedures. The interface provides a flexible environment through which a user, using a Java enabled web browser, can create, modify, save, and execute experiments. The experiments are executed by software modules implementing analysis procedures based on a theory of statistical multiplexing a large number of bursty traffic streams while guaranteeing some Quality of Service (QoS) the input to the software modules are traces that contain measurements of actual network traffic. Questions that can be investigated using the tool include the maximum link utilization when some QoS is guaranteed, how this utilization is affected by the link buffer and traffic shaping, the acceptance region when some QoS is guaranteed, and the token bucket parameters for a traffic stream.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Service differentiation and performance of weighted window-based congestion control and packet marking algorithms in ECN networks",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366402001512",
            "Abstract": "We investigate the service differentiation, in terms of average throughput, and the performance achieved using weighted window-based congestion control in networks supporting Explicit Congestion Notification (ECN). Our results show how service differentiation, queueing delay, and average throughput are affected by the increase and decrease rules of the end-system congestion control algorithms, and how they depend on the marking algorithms operating in the routers. The end-system algorithms we investigate include Willingness-To-Pay (willingness-to-pay) and MulTCP congestion control, and the packet marking algorithms include RED, virtual queue marking, and load-based marking. Our investigations consider both single and multiple link topologies, and connections with different round trip times.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Congestion sensitive downlink power control for wideband cdma systems",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045703/",
            "Abstract": "We present a model for efficient and robust power control in the downlink of wideband CDMA wireless systems. The model is based on microeconomics, and takes into account both the congestion, in terms of increased interference, that a mobile user imposes to other users, and the downlink resource constraint, which involves the total transmission power at the base station. We discuss the application of the model for supporting service differentiation, and investigate various alternatives and their corresponding tradeoffs. Our approach involves adjusting the target signal quality based on weights declared by mobile users.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Pushing for higher rates and efficiency in Satcom: the different perspectives within SatNExIV",
            "Publication year": 2018,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2018arXiv180307326A/abstract",
            "Abstract": "SatNEx IV project aims at studying medium and long term directions of satellite telecommunication systems for any of the commercial or institutional applications that can be considered appealing by key players although still not mature enough for attracting industry or initiating dedicated ESA R&D activities. This paper summarizes the first year activities identified as very promising techniques for next generation satellite communication systems. Concretely, very high throughput satellite trunking, physical layer advances for full-duplex and multipolarization systems, network coding applications and multiple access schemes for information centric networking are briefly presented. For all the activities, we identify the scenarios under study so as the preliminary technical solutions to be further investigated.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:P7Ujq4OLJYoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Popularity-aware mobile content management: When is knowing less better?",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128619309120",
            "Abstract": "Changes in mobility patterns and the topology of mobile networks, the capability of mobile devices to directly serve content, and the deployment of the Internet of Things (IoT) where mobile sensors and actuators directly provide content and services, has changed the requirements and goals of traditional IP mobility management. As a result, IP mobility management and mobile content management are becoming increasingly interdependent. This paper presents and evaluates a popularity-aware lossy resolution procedure for mobility management that decides, based on its popularity and mobility, which mobile content (or mobile devices) should be tracked by the resolution system and which should be located using broadcast queries. The procedure supports the aggregation of multiple location updates in a single update message. Our analytical model jointly captures the tradeoffs that influence the performance: the …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:OP4eGU-M3BUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Enterprise Networking: Multilayer Switching and Applications: Multilayer Switching and Applications",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=OY7a2A-E6jkC&oi=fnd&pg=PR6&dq=info:j5jTm-VPGFwJ:scholar.google.com&ots=LOwO09kWTh&sig=Eoo254Snzpyj2af2gpoD7d4cALg",
            "Abstract": "Primarily targeted toward the network or MIS manager who wants to stay abreast of the latest networking technology, Enterprise Networking: Multilayer Switching and Applications offers up to date information relevant for the design of modern corporate networks and for the evaluation of new networking equipment. The book describes the architectures and standards of switching across the various protocol layers and will also address issues such as multicast quality of service, high-availability and network policies that are requirements of modern switched networks.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:mNrWkgRL2YcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Resource control for the EDCA mechanism in multi-rate IEEE 802.11 e networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1648485/",
            "Abstract": "We investigate the problem of efficient resource control for elastic traffic in IEEE 802.11e's enhanced distributed channel access (EDCA) mechanism. Our approach considers an economic modelling framework based on congestion pricing that captures how various factors, such as the probability of attempting to transmit a frame, the use of the basic CSMA/CA or the RTS/CTS procedure, and the physical layer transmission rate, contribute to congestion. We discuss the application of the framework for achieving class-based throughput differentiation, for performing explicit congestion notification (ECN) marking based on the level of congestion in the wireless channel, and for modelling the performance of TCP congestion control over EDCA. In these application scenarios we discuss how to estimate the optimum minimum contention window and the congestion prices based on the 802.11e parameters and actual …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:bKqednn6t2AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigation of Timescales for Channel, Rate, and Power Control in a Metropolitan Wireless Mesh Testbed",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/62034030/ICTpaper-Timescales.pdf",
            "Abstract": "We investigate the timescales for channel assignment, power control, and rate control in a metropolitan mesh network with links whose distances range from 1.6 to 5 Km. In particular, for channel assignment we consider a procedure that accounts for both intra-network and external interference, and investigate the timescale at which channels need to be re-assigned in order to achieve high performance. For rate control, we compare an auto-rate algorithm that adapts the transmission rate on a per-packet basis, with a fixed transmission rate scheme. For power control, we investigate the minimum transmission power required to achieve a high throughput, and how this power changes during the course of a day.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Channel assignment based on the end-to-end throughput in multi-hop wireless networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21560-5_35",
            "Abstract": "We define a utility-based framework for joint channel assignment and topology control in multi-rate multi-radio wireless mesh networks, and present a greedy algorithm for solving the corresponding optimization problem. The proposed approach can support different target objectives, which are expressed as utility functions of the end-to-end throughput from the gateways to the mesh nodes. The latter accounts for the 802.11 MAC sharing model and rate diversity. The model can be extended to the case of multipath routing, where there are multiple paths from the same or different gateways to the mesh nodes, and for performing joint channel assignment, topology control, and routing.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Automatically configured, optimised and QoS aware wireless mesh networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5671649/",
            "Abstract": "Wireless mesh networks (WMNs) are comprised of nodes with multiple radio interfaces and provide broadband residential internet access or connectivity to temporal events. Our goal is to simplify the network deployment of such a mesh network, and towards that we are presenting procedures for automatic configuration and optimisation of the network. We first present an architecture framework that supports the integration of key mechanisms to ensure the optimisation of the performance of a wireless mesh network. Secondly, we present three key mechanisms, namely auto-configuration, channel assignment and quality of service (QoS) enforcement based on QoS routing. We provide a method for automatic mesh start-up, joining a node into an existing mesh network and automatic repair of temporary connectivity outage, targeting at simplifying the node configuration as much as possible. The second mechanism …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Application of anomaly detection algorithms for detecting SYN flooding attacks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1378372/",
            "Abstract": "We investigate statistical anomaly detection algorithms for detecting SYN flooding, which is the most common type of denial of service (DoS) attack. The two algorithms considered are an adaptive threshold algorithm and a particular application of the cumulative sum (CUSUM) algorithm for change point detection. The performance is investigated in terms of the detection probability, the false alarm ratio, and the detection delay. Particular emphasis is on investigating the tradeoffs among these metrics and how they are affected by the parameters of the algorithm and the characteristics of the attacks. Such an investigation can provide guidelines to effectively tune the parameters of the detection algorithm to achieve specific performance requirements in terms of the above metrics.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trusted D2D-based IoT resource access using smart contracts",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8793041/",
            "Abstract": "We present and evaluate models that allow clients to access IoT resources using secure and trusted device-to-device (D2D) communication, while utilizing smart contracts to obtain the benefits of blockchain technology. These benefits include decentralized trust, immutability, transparency, and high availability. The models consider different network connection capabilities of the clients and the IoT resources, namely continuous network connectivity and D2D-only connectivity. We describe two approaches for utilizing blockchains and smart contracts in the authorization process: in the first approach, only hashes of the authorization information are recorded on the blockchain. In the second approach, a smart contract handles authorization requests. We implement the approaches using the OAuth 2.0 delegated authorization framework and evaluate the implementations on the public Ethereum testnet Rinkeby, in terms …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:fFSKOagxvKUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supporting the IoT over integrated satellite-terrestrial networks using information-centric networking",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7792479/",
            "Abstract": "We investigate the control and data message overhead when the IoT is supported over an integrated satellite-terrestrial network based on Information-Centric Networking (ICN). We consider a scenario where IoT sensor networks are connected via LEO satellites and present three optimization models: polling and data aggregation at a proxy, confidential data transfer using a single proxy, and individual proxy for each IoT node. The three models are implemented in an integrated ICN testbed that consists of a Publish-Subscribe Internet (PSI) prototype and the OpenSAND satellite emulation. The experimental results show that the optimization models, utilizing PSI's mechanisms, can significantly reduce the satellite traffic load while supporting different levels of security.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:5qfkUJPXOUwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security requirements and solutions for integrated satellite-terrestrial information-centric networks",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6934531/",
            "Abstract": "Information-Centric Networking (ICN) has been in the spotlight of recent research efforts. ICN architectures depart from the traditional host-centric (inter-)networking paradigm and leverage the role of information by placing it in the core of all networking functions. A target of ICN is to address the security shortcomings of the legacy host-centric paradigm. In this paper we discuss security requirements of an integrated satellite-terrestrial ICN architecture, we present some security solutions and we assess these solutions in our integrated testbed.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "EU-MESH: Enhanced, Ubiquitous, and Dependable Broadband Access using MESH Networks⋆",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.472.1165&rep=rep1&type=pdf#page=131",
            "Abstract": "EU-MESH (ICT-215320) is a 30 month project, which started January 2008, and is funded by the European Commission within the 7th Framework Programme, under the Information and Communication Technologies (ICT) objective” Network of the Future”. EU-MESH’s goal is to develop, evaluate, and trial a system of software modules for building dependable multiradio multi-channel mesh networks with QoS support that provide ubiquitous and high speed broadband access. The system will be based on a converged infrastructure that uses a wireless mesh network to aggregate capacity from both subscriber broadband access lines and provider fixed broadband links to form a virtual capacity pool, and provide access to this capacity pool for both stationary and mobile users. It will support low operational and management costs, through novel configuration and management procedures. This will increase the competitiveness of existing providers, lower the barrier for small and medium enterprises to enter the mobile broadband access market, and enable innovative services. Existing mesh systems are based on non-standard solutions, do not achieve efficient resource utilization, have sub-optimal channel and power control that prohibits",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cell dimensioning in the CDMA uplink based on economic modelling",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.1153",
            "Abstract": "We introduce a new approach, based on economic modelling, for determining the optimal cell coverage in the CDMA uplink. The approach takes into account resource usage in the uplink direction and user preferences, which are expressed through utility functions, and captures the tradeoff between having a large cell with many users versus having a smaller cell with fewer users, which however are able to transmit at a higher rate. Numerical investigations demonstrate how the optimal cell coverage is affected by the path propagation characteristics, the transmission power limit, the distribution of mobile users in a cell and the users' preferences. Copyright © 2006 AEIT.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:BqipwSGYUEgC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "A platform for wireless maritime networking experimentation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8635782/",
            "Abstract": "We present a software platform for performing wireless maritime networking experiments, with the aim of paving the way for the deployment of IoT applications that support the coast guard in its two main roles, i.e., border surveillance and search and rescue. The platform brings together, on one hand, a novel middleware application, called Dedalus, used for monitoring and controlling experiments, and, on the other hand, a number of implementations of popular protocols that perform ad hoc routing, delay-tolerant routing, information-centric networking, and encryption. The platform has been designed in a modular manner that enhances its scalability and adaptability by the wider research community. We also present preliminary experimental results that shed light on the properties of the wireless channel and the behavior of ad hoc routing protocols in uncluttered settings.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service-centric networking extensions",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2480362.2480475",
            "Abstract": "This paper discusses several issues of Service-Centric Networking (SCN) as an extension of the Information-Centric Networking (ICN) paradigm. SCN allows extended caching, where not exactly the same content as requested can be read from caches, but similar content can be used to produce the content requested, eg, by filtering or transcoding. We discuss the issue of naming and routing for general dynamic services for both tightly coupled and decoupled ICN approaches. Challenges and solutions for service management are identified, in particular for composed services, which allow distributed in-network processing of service requests. We introduce the term Software-Defined Service-Centric Networking as an extension of Software-Defined Networking. A prototype implementation for SCN proofs its validity and feasibility and underlines its potential benefits.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ye4kPcJQO24C",
            "Publisher": "ACM"
        },
        {
            "Title": "Improving TCP throughput in 802.11 WLANs with high delay variability",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1547764/",
            "Abstract": "Reduced throughput of TCP over wireless networks is mainly due to misinterpretation of wireless losses as congestion signals and high delay variability because of fluctuating radio channel quality. High delay variability often leads to spurious TCP timeouts which result in severe throughput degradation. In this paper, we show the negative impact of large delay variations in a mixed wired and 802.11 network scenario with bursty errors, and propose an adaptive algorithm that adds delay to packets in order to prevent spurious timeouts. Our algorithm can adjust to specific network characteristics such as propagation delays, loss rate, and number of mobile nodes, and is applied at the access point of a wireless LAN",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ILKRHgRFtOwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An interledger blockchain platform for cross-border management of cybersecurity information",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9119756/",
            "Abstract": "Cybersecurity certification is a core notion to support the mitigation of cybersecurity risks of Information and Communication Technologies (ICT). At the European Union (EU) level, the Cybersecurity Act establishes a common cybersecurity certification framework supporting the coexistence of different certification schemes across Member States. However, its realization needs to be sustained by technical approaches to enable ICT stakeholders from different sectors or countries to exchange cybersecurity information and evaluate the up-to-date security level of an ICT system throughout their lifecycle. Toward this end, we propose a blockchain-based platform using a novel interledger design, where ledgers associated with ICT artifacts, cybersecurity certificates, and vulnerabilities are interconnected. The main purpose is to leverage the advantages of blockchain in terms of distributed trust, transparency, and …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:gVv57TyPmFsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Specification of Market Management Models for Peer-to-Peer Services (Final Version)",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9711385084538277276&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time Collection of Electromagnetic Field Measurements Using a Metropolitan Wireless Mesh Network",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621549/",
            "Abstract": "We present a system for real-time collection of electromagnetic field (EMF) measurements. The two innovative features of the system that differentiate it from other similar monitoring systems are the use of a low-cost EMF measurement device and the collection and access of measurements through a metropolitan wireless mesh network. The low-cost EMF measurement device is connected to a mini-ITX based PC, and both are located in a water-proof enclosure. The EMF monitoring node is connected to a metropolitan wireless mesh network, which we have deployed in the city of Heraklion, Crete. A set of software module are responsible for collecting, processing, and presenting the EMF measurements in the form of graphs that are accessible from a web browser. The software modules support per-band, per-operator, and time-series monitoring, in addition to on-demand monitoring of a specific frequency range and …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The effect of using directional antennas on adjacent channel interference in 802.11 a: Modeling and experience with an outdoors testbed",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4586029/",
            "Abstract": "We present an outdoors 802.11a testbed based on off-the-shelf components that we used for multi-radio node experimentation. This is the first such testbed, to our knowledge, equipped with directional antennas. With it we conducted a thorough and systematic set of measurements, in medium range outdoors links, to examine how the physical separation of the antennas, the output power of the interfaces, and the channel separation of the links affect throughput. For the setup of the testbed and to estimate the induced ACI we utilized a theoretical model, already verified on an in-lab wireless testbed emulator [Angelakis, 2008]. We discuss how the model needs to adapt and propose to create a tool for the design of large scale multi-radio wireless networks.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SOFIE",
            "Publication year": 2018,
            "Publication url": "https://aaltodoc.aalto.fi/handle/123456789/33883",
            "Abstract": "SOFIE SOFIE | Kirjaudu Aaltodoc → 6b Artikkelit / Articles from Research information portal → \n[article-cris] Perustieteiden korkeakoulu / SCI → Näytä viite SOFIE Nimeke: SOFIE Tekijä(t): \nKarila, Arto ; Kortesniemi, Yki ; Lagutin, Dmitrij ; Nikander, Pekka ; Paavolainen, Santeri ; Fotiou, \nNikos ; Polyzos, George C. ; Siris, Vasilios A. ; Zahariadis, Theodore Päiväys: 2018 Kieli: en \nSivut: 6 Laitos: Professorship Ylä-Jääski A. Professorship Turpeinen M. Department of \nCommunications and Networking Athens University of Economics and Business Synelixis \nDepartment of Computer Science ISBN: 1-891562-51-7 Sarjan nimi: Network and Distributed \nSystem Security Symposium 2018 Altmetriikka ﻿ DOI-numero: 10.14722/diss.Aihe: 113 Computer \nand information sciences, 213 Electronic, automation and communications engineering, \nelectronics Avainsanat: 113 Computer and information sciences, 213 Electronic, automation , » -…",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method of resource control in a wireless network",
            "Publication year": 2011,
            "Publication url": "https://patents.google.com/patent/US7944839B2/en",
            "Abstract": "Wireless resource control is used in a wireless user terminal. A user utility function is stored which gives a user utility value for the user terminal as a function of one or more wireless resources. Price per unit of each wireless resource usage is also stored. An indication of the price per unit of wireless resource usage is received over a wireless link from another wireless terminal. A rate of wireless resource usage is calculated using the indicated price per unit of wireless resource usage as an input to the user utility function such that the user utility value is maximized.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile Multipath Data Transfer over Multirate Wi-Fi Links",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2795381.2795391",
            "Abstract": "We present and evaluate a model for efficient multipath data transfer over multirate Wi-Fi links in mobile devices, which can include Wi-Fi hotspot and Wi-Fi direct links. Numerical investigations illustrate the impact of the Wi-Fi hotspot and Wi-Fi direct transmission rates, and the hotspot backhaul throughput. We also present testbed experiments that show the gains achieved by the proposed multirate Wi-Fi utilization model, in terms of higher aggregate throughput and improved QoE (Quality of Experience) of multipath mobile video streaming, for different transmission rates and backhaul throughputs.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Leveraging Interledger Technologies in IoT Security Risk Management",
            "Publication year": 2020,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/47872/9781680836837.pdf?sequence=1#page=261",
            "Abstract": "There are security vulnerabilities in all technological systems but particularly in many Internet of Things (IoT) solutions. Responsible disclosure has been the established approach for the security community to deal with the discovered vulnerabilities, but this approach does not fare well in the modern fast-paced world and, in particular, in the low-cost, often highly constrained, long-expected usable lifetime, yet highly volatile IoT space. This chapter proposes a Distributed Ledger Technology (DLT) and interledger-based Automated Responsible Disclosure (ARD) solution that provides stronger incentives to the involved parties to address the vulnerabilities in a timely manner, better accountability of all parties, and, as a result, better security for the public at large.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:5icHVeHT4IsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The 3rd IEEE international Workshop on Hot Topics in Mesh Networking HotMESH 2011",
            "Publication year": 2011,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/wowmom/2011/05986173/12OmNBNM8Tq",
            "Abstract": "It gives us great pleasure to introduce the technical program of the third IEEE Workshop on Hot Topics in Mesh Networking (HotMESH 2011). Following the success of the previous editions, the HotMESH workshop is now a well-established, high profile forum for researchers, engineers, and practitioners to present state-of-the-art research in the field of wireless mesh networking. Although significant advances have taken place in this field in the last few years, fundamental open questions and technical challenges still remain to build highly scalable, reliable and cost-effective wireless backbones for mobile users. One of the issues of particular interest to this workshop edition is how wireless mesh networks could be integrates with and/or influence existing mobile and fixed broadband networks in order to create an integrated infrastructure that supports emerging services. Then, the main purpose of this workshop is to …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Cooperation Incentives between Wireless Mesh Network Operators",
            "Publication year": 2009,
            "Publication url": "http://www2.aueb.gr/users/vsiris/publications/h9_emobility09_mesh.pdf",
            "Abstract": "In wireless mesh networks, low transmission rate links create bottlenecks that degrade the end-to-end throughput. To make matters worse, low rate links degrade the performance of neighboring links that operate on the same channel, due to the long duration of low rate transmissions and the per-packet fairness of the 802.11 MAC protocol [1].One approach for mitigating the performance degradation due to low rate links is to consider routing protocols with metrics such as ETT [2], WCETT [2] and CATT [3], which take the transmission rate into account. In wireless LANs, another approach is to use relay nodes in order improve performance by having multiple high rate transmissions instead of a single low rate transmission [4][5]. The above works either focus on a single network or assume full cooperation between the nodes. Our work, on the other hand, considers the case of wireless mesh networks which belong to different operators, which act in their own selfinterest. For such a scenario, we investigate the incentives for cooperation due solely to performance improvements that cooperation can yield for all mesh networks.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A web-based tool for advanced statistical analysis of network tra c measurements",
            "Publication year": 2000,
            "Publication url": "http://nes.cs.aueb.gr/publications/2000.ATM_IP2000.web_tool.ps.gz",
            "Abstract": "We present a web-based tool for advanced statistical analysis of network tra c measurements. The tool consists of an interface and software modules implementing advanced statistical analysis procedures. The interface provides a exible environment through which a user, using a Java enabled web browser, can create, modify, save, and execute experiments. The experiments are executed by software modules implementing analysis procedures based on a theory of statistical multiplexing a large number of bursty tra c streams while guaranteeing some Quality of Service (QoS); the input to the software modules are traces that contain measurements of actual network tra c. Questions that can be investigated using the tool include the maximum link utilization when some QoS is guaranteed, how this utilization is a ected by the link bu er and tra c shaping, the acceptance region when some QoS is guaranteed, and the token bucket parameters for a tra c stream.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Path diversity gain with network coding and multipath transmission in wireless mesh networks",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5534996/",
            "Abstract": "In this paper we investigate the performance that can be achieved by exploiting path diversity through multipath forwarding together with redundancy through linear network coding, in wireless mesh networks with directional links. A key contribution of the paper is to capture the tradeoff between packet delay and throughput achieved by combining multipath forwarding and network coding, and compare this tradeoff with that of simple multipath routing where different flows follow different paths, the transmission of multiple copies of packets over multiple paths, and single path routing. The analytical framework considers the case of end-to-end retransmission for achieving reliability, and is generalized for an arbitrary number of paths and hops. We also derive the minimum and maximum number of coded packets that are needed at the receiver to retrieve all packets sent by the sender; this can be used to obtain a lower …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Resource control for the EDCA and HCCA mechanisms in IEEE 802.11 e networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1666469/",
            "Abstract": "We investigate the problem of efficient resource control for elastic traffic over the EDCA (Enhanced Distributed Channel Access) and HCCA (Hybrid Coordination Function - HCF - Controlled Channel Access) mechanisms of IEEE 802.11e. Our approach considers an economic modelling framework based on congestion pricing that captures how various factors, such as the probability of attempting to transmit a frame, the transmission opportunity (TXOP), and the physical layer transmission rate, contribute to congestion. Additionally, we consider the joint control of the EDCA and HCCA mechanisms, which allows us to determine the optimal sharing of the wireless channel between the two access mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Congestion pricing for resource control in Wideband CDMA",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=8269671943490438240&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting mobility prediction for mobility & popularity caching and DASH adaptation",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7523523/",
            "Abstract": "We present our recent work investigating how mobility prediction can be exploited for improving the performance of mobile users in two directions: proactive caching requested content close to the network attachment points where a mobile has a high probability to connect to and DASH (Dynamic Adaptive Streaming over HTTP) video quality adaptation. For proactive caching we discuss a new model to proactively cache content based on both mobility prediction and content popularity. An important feature of the model is that it dynamically adapts caching decisions to the relative importance of the two factors. For DASH adaptation we discuss a procedure that exploits mobility and throughput prediction to select the quality levels of video segments requested by a DASH player in order to achieve improved QoE, in terms of both high video quality and few video quality switches.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:foquWX3nUaYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling approximations for an IEEE 802.11 WLAN under Poisson MAC-level arrivals",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72606-7_38",
            "Abstract": "We examine two approximative models for the behavior of an IEEE 802.11 WLAN under Poisson MAC-level arrivals. Both models extend, in a simple manner, the analysis for saturated stations with the decoupling approximation. The first follows a well-known approach considering a constant busy station probability at each idle-sensed slot, equal to the load of the envisaged single-server queue. We extend the analysis of this model to calculate more accurately the throughput seen by a station in non-saturation conditions, by considering alternating ON/OFF periods. The second model uses this ON/OFF process structure for calculating attempt and collision probabilities, and subsequently performance measures, based on regenerative process theory. By comparison with simulation results, this model is shown to be more precise for low load conditions. The accuracy of the modeling approximations is also …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Vasilios A. Siris andn Nikos Fotiou, Christos Tsilopoulos, Xenofon Vasilakos, Konstantinos V. Katsaros, and George C. Polyzos. 2014. A Survey of Information-Centric Networking Research",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=12822190414735406248&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:_5tno0g5mFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving mobile video streaming with mobility prediction and prefetching in integrated cellular-WiFi networks",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11569-6_56",
            "Abstract": "We present and evaluate a procedure that utilizes mobility and throughput prediction to prefetch video streaming data in integrated cellular and WiFi networks. The effective integration of such heterogeneous wireless technologies will be significant for supporting high performance and energy efficient video streaming in ubiquitous networking environments. Our evaluation is based on trace-driven simulation considering empirical measurements and shows how various system parameters influence the performance, in terms of the number of paused video frames and the energy consumption. The proposed approach has been implemented in an Android-based prototype.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:2KloaMYe4IUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Priorities for Research on Current and Emerging Network Technologies",
            "Publication year": 2010,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wired/Wireless Internet Communications: 6th International Conference, WWIC 2008 Tampere, Finland, May 28-30, 2008 Proceedings",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=7K6rCAAAQBAJ&oi=fnd&pg=PP2&dq=info:HUsiJ4hPyiUJ:scholar.google.com&ots=937oTg1Sfp&sig=hWruvi2ydNDjmT7YSpsehAVkX4s",
            "Abstract": "This book constitutes the refereed proceedings of the 6th International Conference on Wired/Wireless Internet Communications, WWIC 2008, held in Tampere, Finland, in May 2008. The 18 revised full papers presented were carefully reviewed and selected from 67 submissions. The papers are organized in topical sessions on performance analysis of wireless systems, resource and QoS management, implementation techniques, mobility, cross-layer design, and wireless sensor networks.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer"
        },
        {
            "Title": "Throughput differentiation for TCP uplink traffic in IEEE 802.11 e wireless LANs",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541516/",
            "Abstract": "We investigate a model to achieve throughput differentiation and efficient channel utilization for TCP uplink traffic over IEEE 802.11e's enhanced distributed channel access (EDCA) mechanism, when TCP acknowledgement packets are given higher priority for accessing the wireless channel compared to data packets. The proposed model can be used to tune the minimum contention window of EDCA to support efficient throughput differentiation according to a weight parameter, while taking into account factors such as the CSMA/CA and RTS/CTS procedure and different physical layer transmission rates. Simulation results validate the accuracy of the proposed model, and show its effectiveness in supporting weighted throughput differentiation",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The impact of interference on the performance of a multi-path metropolitan wireless mesh network",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983840/",
            "Abstract": "Wireless mesh networks (WMNs) have attracted much attention lately for providing efficiently wireless services with high quality of service (QoS). Metropolitan WMNs are a low-cost solution for providing broadband wireless internet access in large areas. One of the fundamental issues of wireless communications is interference. In WMNs interference can be caused by simultaneous transmissions at links internal to the mesh network or by external sources. In this work we perform extensive measurements in a multi-radio metropolitan WMN deployed in the city of Heraklion, Greece. The basic goal is to investigate the impact of interference on the performance of the multi-path WMN. Towards that goal, we perform measurements with FTP, video streaming and raw data traffic for two scenarios, one with an efficient channel assignment (CA) that accounts for interference and another with a random CA that results in high …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interledger approaches",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8755830/",
            "Abstract": "While blockchains and more generally distributed ledger technologies (DLTs) are passing over their hype curve peak, their shortcomings are becoming more apparent. One relatively recent approach to address their performance, scalability, privacy, and other problems are to use multiple different DLTs instead of relying on just one. While there are no really established standards for combining several DLTs, a few repeating patterns can be observed. In this paper, we present a survey of interledger approaches, discussing and comparing their underlying mechanisms. A shared motivation for all of the discussed interledger solutions is to move away from the “one chain rules them all” model to one that allows the interconnection of multiple ledgers, with different features and advantages, while also supporting innovation. The interledger approaches discussed in this survey include (1) atomic cross-chain transactions …",
            "Abstract entirety": 0,
            "Author pub id": "Vj3O0cEAAAAJ:yMeIxYmEMEAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Selective Neighbor Caching Approach for Seamless Mobility in Information-Centric Networks",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=15824495043494415826&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimenting with services over an information-centric integrated satellite-terrestrial network",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6633548/",
            "Abstract": "The recent paradigm shift in the Internet's usage, from the host-centric to a content-centric communication model, where users request information irrespectively of its location, is coupled with an increasing need for converged and seamless access over heterogeneous wired and wireless networks. By integrating satellite communication components into a publish-subscribe Information-Centric Networking (ICN) architecture, we jointly exploit the capabilities and advantages of each: transparent use of terrestrial multicasting and satellite broadcasting, content-based traffic engineering, multipath transfer, in-network caching capabilities, and seamless mobility. Experimenting over a realized integrated-terrestrial ICN testbed, we demonstrate and illustrate key functionalities and gains for various services and applications.",
            "Abstract entirety": 1,
            "Author pub id": "Vj3O0cEAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        }
    ]
}]