[{
    "name": "Βασίλειος Ρόθος",
    "romanize name": "Vasileios Rothos",
    "School-Department": "Μηχανολόγων Μηχανικών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 6060,
    "Scholar name": "Vassilis Rothos",
    "Scholar id": "kQ_xRCIAAAAJ",
    "Affiliation": "School of Mechanical Engineering",
    "Citedby": 594,
    "Interests": [
        "Faculty of Engineering Aristotle University of Thessaloniki"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=kQ_xRCIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "WEAK CHAOS DETECTION IN THE FERMI-PASTA-ULAM-α SYSTEM USING q-GAUSSIAN STATISTICS",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/39830873/Weak_Chaos_Detection_in_the_Fermi-Pasta-20151109-29152-1vc19e1.pdf",
            "Abstract": "We study numerically statistical distributions of sums of orbit coordinates, viewed as independent random variables in the spirit of the Central Limit Theorem, in weakly chaotic regimes associated with the excitation of the first (k= 1) and last (k= N) linear normal modes of the Fermi-Pasta-Ulam-α system under fixed boundary conditions. We show that at low energies (E= 0.19), when the k= 1 linear mode is excited, chaotic diffusion occurs characterized by distributions that are well approximated for long times (t> 109) by a q-Gaussian Quasi-Stationary State (QSS) with q≈ 1.4. On the other hand, when the k= N mode is excited at the same energy, diffusive phenomena are absent and the motion is quasi-periodic. In fact, as the energy increases to E= 0.3, the distributions in the former case pass through shorter q-Gaussian states and tend rapidly to a Gaussian (ie q→ 1) where equipartition sets in, while in the latter we need to reach to E= 4 to see a sudden transition to Gaussian statistics, without any passage through an intermediate QSS. This may be explained by different energy localization properties and recurrence phenomena in the two cases, supporting the view that when the energy is placed in the first mode weak chaos and “sticky” dynamics lead to a more gradual process of energy sharing, while strong chaos and equipartition appear abruptly when only the last mode is initially excited.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:EsrhoZGmrkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Travelling waves of discrete nonlinear Schrödinger equations with nonlocal interactions",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00036810903208130",
            "Abstract": "Existence and bifurcation results are derived for quasi periodic travelling waves of discrete nonlinear Schrödinger equations with nonlocal interactions and with polynomial-type potentials. Variational tools are used. Several concrete nonlocal interactions are studied as well.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Stability of gap solitons in the presence of a weak nonlocality in periodic potentials",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1140/epjst/e2016-02664-1",
            "Abstract": " In this work, we study the stability and internal modes of one-dimensional gap solitons employing the modified nonlinear Schrödinger equation with a sinusoidal potential together with the presence of a weak nonlocality. Using an analytical theory, it is proved that two soliton families bifurcate out from every Bloch-band edge under self-focusing or self-defocusing nonlinearity, and one of these is always unstable. Also we study the oscillatory instabilities and internal modes of the modified nonlinear Schrödinger equation. ",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:4tNoA7Af41QC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Periodically forced nonlinear oscillatory acoustic vacuum",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/343124",
            "Abstract": "In this work, we study the in-plane oscillations of a finite lattice of particles coupled by linear springs under distributed harmonic excitation. Melnikov-type analysis is applied for the persistence of periodic oscillations of a reduced system. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:e9bUPLv0EjcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Perturbation-induced radiation by the Ablowitz-Ladik soliton",
            "Publication year": 2003,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.68.066610",
            "Abstract": "An efficient formalism is elaborated to analytically describe dynamics of the Ablowitz-Ladik soliton in the presence of perturbations. This formalism is based on using the Riemann-Hilbert problem and provides the means of calculating evolution of the discrete soliton parameters, as well as shape distortion and perturbation-induced radiation effects. As an example, soliton characteristics are calculated for linear damping and quintic perturbations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Direct perturbation theory for dark-bright solitons: Application to Bose-Einstein condensates",
            "Publication year": 2015,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/49/1/015202/meta",
            "Abstract": "We develop a direct perturbation theory for dark-bright solitons and derive evolution equations for the soliton parameters. In particular, first the linearization equation around the solitons is solved by expanding its solution into a set of complete eigenfunctions of the linearization operator. Then, suppression of secular growth in the linearized solution leads to the evolution equations of soliton parameters. The results are applied to a number of case examples motivated by the physics of atomic Bose-Einstein condensates, where dark-bright solitons have recently been studied both in theory and in experiments. We thus consider perturbations corresponding to (a) finite temperature-induced thermal losses, and (b) the presence of localized (δ-function) impurities. In these cases, relevant equations of motion for the dark-bright soliton center are in agreement with ones previously obtained via alternative methods, including …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:ZYsTHYU9jrMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Periodic travelling waves of forced FPU lattices",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10884-013-9316-3.pdf",
            "Abstract": "In this article, damped Fermi–Pasta–Ulam-type lattices driven by extended external forces are considered. The existence and uniqueness results of periodic travelling waves of the system are presented. The existence and the stability of periodic waves are also computed and discussed numerically.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Kink-like periodic travelling waves for lattice equations with on-site and inter-site potentials",
            "Publication year": 2005,
            "Publication url": "https://www.intlpress.com/site/pub/pages/journals/items/dpde/content/vols/0002/0004/a004/",
            "Abstract": "The existence of travelling generalized kinks with oscillation tails is studied for a class of 1D lattice equations with both onsite and intersite potential. The travelling wave equation of the corresponding discrete nonlinear equation is formulated as an advanced-delay differential equation which is reduced by a center manifold method to a 4-dimensional singular ODE with certain symmetries and with a symmetric heteroclinic structure. Bifurcations of solutions from the heteroclinic ones are investigated for the singular perturbation systems of autonomous od eqns in R 4. This gives the existence of generalized kink solutions with co-propagating oscillation tails.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "International Press of Boston"
        },
        {
            "Title": "Atomic Dark-Bright Solitons: Theory and Experiments",
            "Publication year": 2012,
            "Publication url": "https://idus.us.es/bitstream/handle/11441/94734/cuevas_ponencia_sevilla_2012_atomic.pdf?sequence=1",
            "Abstract": "Atomic Dark-Bright Solitons: Theory and Experiments Page 1 Atomic Dark-Bright Solitons: \nTheory and Experiments DJ Frantzeskakis* Department of Physics, University of Athens, \nGreece LENCOS 12, Seville, July 9-12, 2012 *In collaboration with: PG Kevrekidis, D. Yan (Amherst), \nR. Carretero-González (San Diego), M. Hoefer (North Carolina), P. Engels, J. Chang., C. \nHamner (Washington), P. Schmelcher, S. Middelkamp, J. Stockhofe (Hamburg), J. Cuevas, A. \nAlvarez (Seville) V. Achilleos (Athens), V. Rothos (Thessaloniki) Page 2 Outline Bοse-Einstein \ncondensates (BECs) - Binary BECs - Gross-Pitaevskii mean-field description Dark-bright \nsolitons in binary BECs - Single and multiple dark-bright solitons - SU(2) rotations: “beating” \ndark-dark solitons Dark-bright solitons at finite temperatures - Dissipative Gross-Pitaevskii \nequations - Different temperature-dependent damping regimes Conclusions and outlook -]…",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:_AkkBXT-jcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traveling waves in Fermi-Pasta-Ulam lattices with saturable nonlinearities",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/dcds.2011.30.835",
            "Abstract": "1 2 p2 n+ U (qn+ 1− qn)), where pn= qn is the momentum. After the pioneering work by E. Fermi, J. Pasta and S. Ulam [3], such systems became of common interest due to their unexpected properties and rich dynamics. Currently, FPU is one of the basic discrete models in the nonlinear mathematical physics. In the existing literature dynamical properties of FPU systems are studied mainly by means of approximate and numerical methods (see, eg,[10]). As for exact results, we first mention the well-known Toda lattice discovered in 1967. This system is defined by",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Homoclinic Structures for Nonlinear Integrable Wave Equations: New Approach",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-55856-6_116",
            "Abstract": "A method is proposed to generate homoclinic solutions for integrable nonlinear wave equations with periodic boundaries. This approach resembles the dressing method known in the theory of solitons. As an example, we obtain the homoclinic orbit for the modified nonlinear Schrödinger equation solvable by the Wadati-Konno-Ichikawa spectral problem.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Dynamics of the Ablowitz-Ladik soliton train",
            "Publication year": 2004,
            "Publication url": "https://journals.aps.org/pre/abstract/10.1103/PhysRevE.69.056607",
            "Abstract": "It is shown that dynamics of a train of N weakly interacting Ablowitz-Ladik solitons with (almost) equal velocities and masses is governed by the complex Toda chain model. The integrability of the complex Toda chain model provides the means to describe analytically various dynamical regimes of the N-soliton train and to predict initial soliton parameters responsible for each of the regimes. Numerical simulations corroborate well analytical predictions. A specific feature arising for the discrete soliton train system is the appearance of an additional (with respect to the lattice spacing) spatial scale-intersoliton distance. We comment on interplay between both spatial scales.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:qjMakFHDy7sC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Travelling waves in nonlinear magnetic metamaterials",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-02057-0_17",
            "Abstract": "In this article, a model of one-dimensional metamaterial formed by a discrete array of nonlinear resonators is considered. The existence and uniqueness results of periodic and asymptotic travelling waves of the system are presented. The existence and the stability of asymptotic waves are also computed and discussed numerically.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Cubic–quintic long-range interactions with double well potentials",
            "Publication year": 2013,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/47/3/035201/meta",
            "Abstract": "In the present work, we examine the combined effects of cubic and quintic terms of the long-range type in the dynamics of a double well potential. Employing a two-mode approximation, we systematically develop two cubic–quintic ordinary differential equations and assess the contributions of the long-range interactions in each of the relevant prefactors, gauging how to simplify the ensuing dynamical system. Finally, we obtain a reduced canonical description for the conjugate variables of relative population imbalance and relative phase between the two wells and proceed to a dynamical systems analysis of the resulting pair of ordinary differential equations. While in the case of cubic and quintic interactions of the same kind (eg both attractive or both repulsive), only a symmetry-breaking bifurcation can be identified, a remarkable effect that emerges eg in the setting of repulsive cubic but attractive quintic interactions …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:-f6ydRqryjwC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Travelling waves of forced discrete nonlinear Schrödinger equations",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/dcdss.2011.4.1129",
            "Abstract": "We address the existence and bifurcation of periodic travelling wave solutions in forced spatially discrete nonlinear Schrödinger equations with local interactions. We consider polynomial type and bounded nonlinearities. The mathematical methods are based in using Palais-Smale conditions and variational methods. Some generalizations are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:LkGwnXOMwfcC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Subharmonic bifurcations of localized solutions of a discrete NLS equation",
            "Publication year": 2005,
            "Publication url": "https://www.aimsciences.org/article/doi/10.3934/proc.2005.2005.756",
            "Abstract": "Using an analytical approach, we derive an explicit formula for the subharmonic Mel’nikov potential L p/q for perturbations of twist maps. Our method based on the integrability of map and the variational approach of twist map. If L p/q is non–constant the perturbed twist map is non–integrable and all the resonant curves are destroyed for| ε|≪ 1. We also apply our result to show the existence of such subharmonic bifurcations for a mapping representing localized oscillatory solutions of a discrete NLS equation with conservative and dissipative perturbations.1. Introduction. It has been known for sometime that the Melnikov function plays an important role in the study of the phenomenon of the splitting of separatrices associated with hyperbolic fixed points of dynamical systems [1]. A discrete analogue of Melnikov’s first theorem on the existence of separatrix intersections has been introduced for maps to [2],[10]. Very interesting results have also been obtained by Delshams & Ramirez-Ros [6] concerning the homoclinic Melnikov function for near integrable twist maps. The aim of this paper is to study the behavior of the family of periodic orbits around an elliptic fixed point of perturbed twist maps, through the computation of its subharmonic Melnikov function. In order to realise this goal, we use the twist generating function of the perturbed map to introduce the subharmonic Melnikov potential Lp/q. The differential of the subharmonic Melnikov potential Mp/q= dLp/q is the subharmonic Melnikov function for the twist perturbed map and provide the analytical criteria for non–integrability of twist maps under conservative or dissipative perturbations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:W7OEmFMy1HYC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Homoclinic orbits in a near-integrable mixed type CNLS system",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812704467_0037",
            "Abstract": "We consider a system of coupled nonlinear Schrödinger equations with even, periodic boundary conditions, which are damped and quasi-periodically forced. Under certain conditions, we establish criteria for the existence of homoclinic orbits to a spatially independent invariant torus. We compare the analysis with rigorous numerical simulation.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A criterion for non-persistence of travelling breathers for perturbations of the Ablowitz--Ladik lattice",
            "Publication year": 2004,
            "Publication url": "https://www.aimsciences.org/article/exportPdf?id=0db9afa6-c01e-495b-bf88-0d324163ed22",
            "Abstract": "The Ablowitz–Ladik lattice has a two-parameter family of travelling breathers. We derive a necessary condition for their persistence under perturbations of the system. From this we deduce non-persistence for a variety of examples of perturbations. In particular, we show that travelling breathers do not persist under many reversible perturbations unless an additional symmetry is preserved, and we address the case of Hamiltonian perturbations.1. Introduction. The phenomenon of discrete breathers, ie spatially localized periodic oscillations in nonlinear lattices, has attracted much recent interest (see eg the review articles [2, 4, 6, 8]). One largely unresolved topic in this context is the rigorous mathematical status of travelling discrete breathers: although such objects have repeatedly been observed in numerical simulations (eg [3, 5, 10]), their existence has been proved for only a few rather special models ([1, 5]). In search of a better mathematical understanding, a natural first question is whether the known travelling breathers persist under certain perturbations of the respective underlying system. In this note we discuss a necessary condition for smooth persistence of travelling discrete breathers under perturbations of the Ablowitz–Ladik (AL) lattice. Our condition establishes non-persistence for a variety of types of perturbations, but it fails to settle the persistence question for some important examples like the Salerno family, which will require more refined methods of analysis. Although our subsequent discussion of the persistence of travelling breathers applies to a wider class of lattices with hardly any modification, we shall, for the sake of concreteness …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:oYwriLWYh5YC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Gain–loss-driven travelling waves in PT-symmetric nonlinear metamaterials",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165212517301282",
            "Abstract": "In this work we investigate a one-dimensional parity-time (PT)-symmetric magnetic metamaterial consisting of split-ring dimers having gain or loss. Employing a Melnikov analysis we study the existence of localized travelling waves, i.e. homoclinic or heteroclinic solutions. We find conditions under which the homoclinic or heteroclinic orbits persist. Our analytical results are found to be in good agreement with direct numerical computations. For the particular nonlinearity admitting travelling kinks, numerically we observe homoclinic snaking in the bifurcation diagram. The Melnikov analysis yields a good approximation to one of the boundaries of the snaking profile.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:6IBXqrN-DEwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Homoclinic chaos in a pair of parametrically-driven coupled SQUIDs",
            "Publication year": 2015,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/574/1/012027/meta",
            "Abstract": "An rf superconducting quantum interference device (SQUID) consists of a superconducting ring interrupted by a Josephson junction (JJ). When driven by an alternating magnetic field, the induced supercurrents around the ring are determined by the JJ through the celebrated Josephson relations. This system exhibits rich nonlinear behavior, including chaotic effects. We study the dynamics of a pair of parametrically-driven coupled SQUIDs arranged in series. We take advantage of the weak damping that characterizes these systems to perform a multiple-scales analysis and obtain amplitude equations, describing the slow dynamics of the system. This picture allows us to expose the existence of homoclinic orbits in the dynamics of the integrable part of the slow equations of motion. Using high-dimensional Melnikov theory, we are able to obtain explicit parameter values for which these orbits persist in the full system …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:dhpJJ7xvgBgC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Bifurcations of periodics from homoclinics in singular ODE: Applications to discretizations of travelling waves of PDE",
            "Publication year": 2002,
            "Publication url": "https://www.aimsciences.org/article/exportPdf?id=f0c47f85-585d-4f7a-9f4b-0e7fbe78f603",
            "Abstract": "Bifurcations of periodic solutions from homoclinic ones are investigated for certain singularly perturbed systems of autonomous ordinary differential equations in R 4. Results are applied to discretization of travelling waves of certain pde",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:dMpQl7XwOw4C",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Travelling waves in Hamiltonian systems on 2D lattices with nearest neighbor interactions",
            "Publication year": 2007,
            "Publication url": "https://arxiv.org/abs/nlin/0701035",
            "Abstract": "We study travelling waves on a two--dimensional lattice with linear and nonlinear coupling between nearest particles and a periodic nonlinear substrate potential. Such a discrete system can model molecules adsorbed on a substrate crystal surface. We show the existence of both uniform sliding states and periodic travelling waves as well in a two-dimensional sine-Gordon lattice equation using topological and variational methods.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:ZqLB7dQ1iF4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Full-time dynamics of modulational instability in spinor Bose-Einstein condensates",
            "Publication year": 2007,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.76.013626",
            "Abstract": "We describe the full-time dynamics of modulational instability in F= 1 spinor Bose-Einstein condensates for the case of the integrable three-component model associated with the matrix nonlinear Schrödinger equation. We obtain an exact homoclinic solution of this model by employing the dressing method which we generalize to the case of the higher-rank projectors. This homoclinic solution describes the development of modulational instability beyond the linear regime, and we show that the modulational instability demonstrates the reversal property when the growth of the modulated amplitude is changed by its exponential decay.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:UeHWp8X0CEIC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "HOMOCLINIC ORBITS IN A NEAR-INTEGRABLE MIXED",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=-UdpDQAAQBAJ&oi=fnd&pg=PA261&dq=info:K1NkEOa4HxcJ:scholar.google.com&ots=Q4_I7-SFCx&sig=wMakhd6xDOybxfr4U__dfVD9kzY",
            "Abstract": "Soliton pulses are the heard of high speed fiber-optic telecommunication system and hold great potential for all optical switching devices. Novel soliton packing schemes propose to subdivide information streams into different wavelengths-wavelength division multiplexing (WDM), or into orthogonal polarizations-polarization division multiplexing (PDM). However, a proper modeling of these schemes, especially to address stability properties, requires careful attention to the various perturbations which are present in optical systems. To model the interaction of the orthogonal polarizations of a pulse, the widely studied nonlinear Schrödinger equation (NLS) is ex-tended to the integrable Manakov system. However, fiber-optic systems exhibit birefringence, differing phase and group velocities for different polarizations, as well nonlinear interactions between polarizations dependent upon amplitude—cross-phase modulation (XPM) and upon complex phase-four-wave mixing (FWM). The nonlinear terms break the integrability of the Manakov equation and numerical simulations including these nonlin-earities have demonstrated pulse splitting and inelastic collisions. We consider the mixed type coupled NLS equations:",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:qbqt7gslDFUC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Stability of waves in multi-component DNLS system",
            "Publication year": 2007,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/40/17/011/meta",
            "Abstract": "In this work, we systematically generalize the Evans function methodology to address vector systems of discrete equations. We physically motivate and mathematically use as our case example a vector form of the discrete nonlinear Schrödinger equation with both nonlinear and linear couplings between the components. The Evans function allows us to qualitatively predict the stability of the nonlinear waves under the relevant perturbations and to quantitatively examine the dependence of the corresponding point spectrum eigenvalues on the system parameters. These analytical predictions are subsequently corroborated by numerical computations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Travelling waves in Hamiltonian systems on 2D lattices with nearest neighbour interactions",
            "Publication year": 2007,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0951-7715/20/2/005/meta",
            "Abstract": "We study travelling waves on a two-dimensional lattice with linear and nonlinear coupling between nearest particles and a periodic nonlinear substrate potential. Such a discrete system can model molecules adsorbed on a substrate crystal surface. We show the existence of both uniform sliding states and periodic travelling waves as well in a two-dimensional sine-Gordon lattice equation using topological and variational methods.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Travelling waves in Hamiltonian systems on 2D lattices with nearest neighbor interactions",
            "Publication year": 2006,
            "Publication url": "http://www.mat.savba.sk/preprints/2006/06-03.PS",
            "Abstract": "We study travelling waves on a two {dimensional lattice with linear and nonlinear coupling between nearest particles and a periodic nonlinear substrate potential. Such a discrete system can model molecules absorbed on a substrate crystal surface. We show the existence of both uniform sliding states and periodic travelling waves as well in a two-dimensional sine-Gordon lattice equation using topological and variational methods.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Klaus, Martin (1-VAPI); Pelinovsky, Dmitry E.(3-MMAS)",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.176.5049&rep=rep1&type=pdf",
            "Abstract": "This is a study of algebraic solitons for a class of integrable nonlinear equations that includes MKdV, focusing NLS, derivative NLS, and Thirring equations. Algebraic solitons are solitons that decay to zero at infinity (or approach a nonzero value) at an algebraic rate. Algebraic solitons are explicit examples of an algebraically decaying potential u in the corresponding spectral problems. In this context, the authors study the bifurcation problem for embedded eigenvalues when an algebraically decaying potential is perturbed by a generic potential with a faster decay at infinity. This analysis, by means of renormalized Evans functions, provides details on the transformation of unstable algebraic solitons of the corresponding nonlinear integrable equations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bifurcation results for traveling waves in nonlinear magnetic metamaterials",
            "Publication year": 2014,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218127414501478",
            "Abstract": "In this work, we study a model of a one-dimensional magnetic metamaterial formed by a discrete array of nonlinear resonators. We focus on periodic and localized traveling waves of the model, in the presence of loss and an external drive. Employing a Melnikov analysis we study the existence and persistence of such traveling waves, and study their linear stability. We show that, under certain conditions, the presence of dissipation and/or driving may stabilize or destabilize the solutions. Our analytical results are found to be in good agreement with direct numerical computations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:mJbmKSuM8toC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Evans Function for the AKNS Problem with Algebraic Solitons",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-55856-6_118",
            "Abstract": "We study renormalization of the Evans function for the AKNS spectral problem on a real line with algebraically decaying potentials. We show that the Evans function may have pole singularities at embedded eigenvalues of the essential spectrum, which are related to algebraically decaying eigenfunctions. Stability of algebraic solitons in the initial-value problem for the modified KdV equation is studied with the renormalized Evans function.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:Zph67rFs4hoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Travelling waves in Hamiltonian systems on 2D lattices with nearest neighbour interactions",
            "Publication year": 2007,
            "Publication url": "https://iopscience.iop.org/article/10.1088/0951-7715/20/2/005/meta",
            "Abstract": "We study travelling waves on a two-dimensional lattice with linear and nonlinear coupling between nearest particles and a periodic nonlinear substrate potential. Such a discrete system can model molecules adsorbed on a substrate crystal surface. We show the existence of both uniform sliding states and periodic travelling waves as well in a two-dimensional sine-Gordon lattice equation using topological and variational methods.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Stability of discrete breathers in magnetic metamaterials",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-02057-0_18",
            "Abstract": "We consider the discrete Klein–Gordon equation for magnetic metamaterials derived by Lazarides, Eleftheriou, and Tsironis Phys Rev Lett 97:157406, 2006). We obtain a general criterion for spectral stability of multi-site breathers for a small coupling constant. We show how this criterion differs from the one derived in the standard discrete Klein–Gordon equation (Koukouloyannis and Kevrekidis, Nonlinearity 22:2269–2285, 2009; Pelinovsky and Sakovich, Nonlinearity 25:3423–3451, 2012).",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Statics and dynamics of atomic dark-bright solitons in the presence of impurities",
            "Publication year": 2011,
            "Publication url": "https://journals.aps.org/pra/abstract/10.1103/PhysRevA.84.053626",
            "Abstract": "Adopting a mean-field description for a two-component atomic Bose-Einstein condensate, we study the statics and dynamics of dark-bright solitons in the presence of localized impurities. We use adiabatic perturbation theory to derive an equation of motion for the dark-bright soliton center. We show that, counterintuitively, an attractive (repulsive) delta-like impurity, acting solely on the bright-soliton component, induces an effective localized barrier (well) in the effective potential felt by the soliton; this way, dark-bright solitons are reflected from (transmitted through) attractive (repulsive) impurities. Our analytical results for the small-amplitude oscillations of solitons are found to be in good agreement with results obtained via a Bogoliubov–de Gennes analysis and direct numerical simulations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Evans function for Lax operators with algebraically decaying potentials",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/article/10.1007/s00332-005-0652-7",
            "Abstract": "We study the instability of algebraic solitons for integrable nonlinear equations in one spatial dimension that include modified KdV, focusing NLS, derivative NLS, and massive Thirring equations. We develop the analysis of the Evans function that defines eigenvalues in the corresponding Lax operators with algebraically decaying potentials. The standard Evans function generically has singularities in the essential spectrum, which may include embedded eigenvalues with algebraically decaying eigenfunctions. We construct a renormalized Evans function and study bifurcations of embedded eigenvalues, when an algebraically decaying potential is perturbed by a generic potential with a faster decay at infinity. We show that the bifurcation problem for embedded eigenvalues can be reduced to cubic or quadratic equations, depending on whether the algebraic potential decays to zero or approaches a nonzero …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Multibreathers in Klein–Gordon chains with interactions beyond nearest neighbors",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278912002047",
            "Abstract": "We study the existence and stability of multibreathers in Klein–Gordon chains with interactions that are not restricted to nearest neighbors. We provide a general framework where such long range effects can be taken into consideration for arbitrarily varying (as a function of the node distance) linear couplings between arbitrary sets of neighbors in the chain. By examining special case examples such as three-site breathers with next-nearest-neighbors, we find crucial modifications to the nearest-neighbor picture of one-dimensional oscillators being excited either in-or anti-phase. Configurations with nontrivial phase profiles emerge from or collide with the ones with standard (0 or π) phase difference profiles, through supercritical or subcritical bifurcations respectively. Similar bifurcations emerge when examining four-site breathers with either next-nearest-neighbor or even interactions with the three-nearest one …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Homoclinic chaos in coupled SQUIDs",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0960077917301388",
            "Abstract": "An rf superconducting quantum interference device (SQUID) consists of a superconducting ring interrupted by a Josephson junction (JJ). The induced supercurrents around the ring are determined by the JJ through the celebrated Josephson relations. We study the dynamics of a pair of parametrically-driven coupled SQUIDs lying on the same plane with their axes in parallel. The drive is through the alternating critical current of the JJs. This system exhibits rich nonlinear behavior, including chaotic effects. We take advantage of the weak damping that characterizes these systems to perform a multiple-scales analysis and obtain amplitude equations, describing the slow dynamics of the system. This picture allows us to expose the existence of homoclinic orbits in the dynamics of the integrable part of the slow equations of motion. Using high-dimensional Melnikov theory, we are able to obtain explicit parameter values …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:e0LTWoPxLYMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Periodic and decaying solutions in discrete nonlinear Schrödinger with saturable nonlinearity",
            "Publication year": 2008,
            "Publication url": "https://royalsocietypublishing.org/doi/abs/10.1098/rspa.2008.0255",
            "Abstract": "We demonstrate the existence of solutions in the discrete nonlinear Schrödinger equation (DNLS) with saturable nonlinearity. We consider two types of solutions to DNLS periodic and vanishing at infinity. Calculus of variations and the Nehari manifolds are employed to establish the existence of these solutions. We present some extensions of our results, combining the Nehari manifold approach and the Mountain Pass argument.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:2osOgNQ5qMEC",
            "Publisher": "The Royal Society"
        },
        {
            "Title": "Travelling waves in a perturbed discrete sine-Gordon equation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/1-4020-2190-9_40",
            "Abstract": "The existence of traveling waves is studied analytical for discrete sine-Gordon equation with an inter-site potential. The reduced functional differential equation is formulated as an infinite dimensional differential equation which is reduced by a centre manifold method and to a 4-dimensional singular ODE with certain symmetries and with heteroclinic structure. The bifurcations of solutions from heteroclinic ones are investigated for singular perturbed systems.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "The effect of Slow Flow Dynamics on the Oscillations of a singular damped system with an essentially nonlinear attachment",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/43652508/The_Effect_of_Slow_Flow_Dynamics_on_the_20160312-9160-nyxhqq.pdf",
            "Abstract": "We study a three degree of freedom autonomous system with damping, composed of two linear coupled oscillators with an essentially nonlinear lightweight attachment. In particular, we are interested in strongly nonlinear interactions between the linear oscillators and the essentially nonlinear attachment. First, we reduce our system to a non-autonomous second order nonlinear damped oscillator. Then, we introduce a slow-fast partition of the dynamics and average out the main frequency components in order to obtain a reduced system that is studied through the Slow Invariant Manifold (SIM) approach. Depending on the parameters of the system we find different interesting nonlinear dynamical phenomena. With the help of the SIM approach we can study how the parameters of the original problem influence the asymptotic behavior of the orbits of the system. This is accomplished with the application of Tikhonov’s theorem. We classify the different cases of the dynamics according to the values of the parameters and the theoretically predicted asymptotic behavior of the orbits. Interesting phenomena are reported such as orbit capture, relaxation oscillations and complex structure of the basins of attraction.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:1Aeql8wG3wEC",
            "Publisher": "Aristotle University of Thessaloniki"
        },
        {
            "Title": "Travelling waves in nonlinear magneto-inductive lattices",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039615005112",
            "Abstract": "We consider a lattice equation modelling one-dimensional metamaterials formed by a discrete array of nonlinear resonators. We focus on periodic travelling waves due to the presence of a periodic force. The existence and uniqueness results of periodic travelling waves of the system are presented. Our analytical results are found to be in good agreement with direct numerical computations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:gkldIfsazJcC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Dynamics of the Perturbed Ablowitz-Ladik Soliton Beyond the Adiabatic Approximation",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/1-4020-2190-9_39.pdf",
            "Abstract": "A formalism to account for shape distortion and radiation effects for the perturbed Ablowitz-Ladik soliton is outlined.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "HOMOCLINIC ORBITS AND DRESSING METHOD",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4020-3503-6_6",
            "Abstract": "Chaos is frequently associated with orbits homoclinic to unstable modes of deterministic nonlinear PDEs. Bilinear Hirota method was successfully employed to obtain homoclinic solutions for NLS with periodic boundaries. We propose a new method to analytically generate homo-clinic solutions for integrable nonlinear PDEs. This approach resembles the dressing method known in the theory of solitons. The pole positions in the dressing factor are given by the complex double points of the Floquet spectrum associated with unstable modes of the nonlinear equation. As an example, we reproduce first the homoclinic orbit for NLS, and then obtain the homoclinic solution for the modified nonlinear Schrödinger equation solvable by the Wadati–Konno–Ichikawa spectral problem.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Dynamic interactions of traveling waves propagating in a linear chain with an local essentially nonlinear attachment",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165212508000875",
            "Abstract": "We study strongly nonlinear dynamical interactions between traveling waves propagating in a linear spring-mass chain with a strongly nonlinear, lightweight local attachment. We analyze the dynamics of this system by constructing a reduced model in the form of a strongly nonlinear integro-differential equation with inhomogeneous terms representing local and non-local interactions between the chain and the nonlinear attachment. Then we construct homoclinic and subharmonic Melnikov functions and prove the existence of chaotic motions and subharmonic periodic orbits in the combined chain-attachment system. In the limit of weak coupling between the particles of the chain we study the bifurcations that generate stable-unstable pairs of subharmonic motions. Generalizations of the methodology to a more general class of linear systems with local essentially nonlinear attachments are discussed. This work …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:tFzHCjejgA0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Intrinsic localized modes in coupled DNLS equations from the anti-continuum limit",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475412002807",
            "Abstract": "In the present work, we generalize earlier considerations for intrinsic localized modes consisting of a few excited sites, as developed in the one-component discrete nonlinear Schrödinger equation model, to the case of two-component systems. We consider all the different combinations of “up” (zero phase) and “down” (π phase) site excitations and are able to compute not only the corresponding existence curves, but also the eigenvalue dependence of the small eigenvalues potentially responsible for instabilities, as a function of the nonlinear parameters of the model representing the self/cross phase modulation in optics and the scattering length ratios in the case of matter waves in optical lattices. We corroborate these analytical predictions by means of direct numerical computations. We infer that all the modes which bear two adjacent nodes with the same phase are unstable in the two component case and the …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:kNdYIx-mwKoC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A new barrier to the existence of moving kinks in Frenkel–Kontorova lattices",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278903002616",
            "Abstract": "An explanation is offered for an observed lower bound on the wave speed of travelling kinks in Frenkel–Kontorova lattices. Kinks exist at discrete wavespeeds within a parameter regime where there is a resonance with linear waves (phonons). However, they fail to exist even in this codimension-one sense whenever there is more than one phonon branch in the dispersion relation; inside such bands only quasi-kinks with nondecaying oscillatory tails are possible. The results are presented for a discrete sine-Gordon lattice with an onsite potential that has a tunable amount of anharmonicity. Novel numerical methods are used to trace kinks with topological charge Q=1 and 2 in three parameters representing the propagation speed, lattice discreteness and anharmonicity. Although none of the analysis is presented as rigorous mathematics, numerical results suggest that the bound on allowable wavespeeds is sharp …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:u5HHmVD_uO8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Stability of localized structures in generalized DNLS equations near the anti-continuum limit",
            "Publication year": 2008,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/42/2/025207/meta",
            "Abstract": "In this work we consider the stability of localized structures in discrete nonlinear Schrödinger lattices with generalized nonlinearities, depending on the absolute value of the field. We illustrate how the continuation of solutions in one-, as well as higher dimensions proceeds from the anti-continuum limit and show how to generalize the results of Pelinovsky et al (2005 Physica D 212 1) for arbitrary nonlinearities. As a case example of particular experimental relevance, we showcase our main findings in the special setting of the lattice with the saturable (photorefractive) nonlinearity in one and two dimensions. Our analytical results are found to be in good agreement with direct numerical computations.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:4DMP91E08xMC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Homoclinic orbits for soliton equations solvable via the quadratic bundle",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0375960103007588",
            "Abstract": "A method is proposed to generate homoclinic solutions for an integrable nonlinear PDE with periodic boundaries. This approach resembles the dressing method known in the theory of solitons. The pole positions in the dressing factor are given by the complex double points of the Floquet spectrum associated with unstable modes of a seed solution of the nonlinear equation. As an example, we obtain the homoclinic orbit for the modified nonlinear Schrödinger equation solvable by the Wadati–Konno–Ichikawa spectral problem.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Nonlinear wave propagation in discrete and continuous systems",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1140/epjst/e2016-02648-1",
            "Abstract": " In this review we try to capture some of the recent excitement induced by a large volume of theoretical and computational studies addressing nonlinear Schrödinger models (discrete and continuous) and the localized structures that they support. We focus on some prototypical structures, namely the breather solutions and solitary waves. In particular, we investigate the bifurcation of travelling wave solution in Discrete NLS system applying dynamical systems methods. Next, we examine the combined effects of cubic and quintic terms of the long range type in the dynamics of a double well potential. The relevant bifurcations, the stability of the branches and their dynamical implications are examined both in the reduced (ODE) and in the full (PDE) setting. We also offer an outlook on interesting possibilities for future work on this theme. ",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:8JTMrWI6FdcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Traveling solitary waves in DNLS equations",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-89199-4_21",
            "Abstract": "The existence of localized traveling waves (sometimes called “moving discrete breathers” or “discrete solitons”) in discrete nonlinear Schrödinger (DNLS) lattices has shown itself to be a delicate question of fundamental scientific interest (see e.g [1]). This interest is largely due to the experimental realization of solitons in discrete media, such as waveguide arrays [2] optically induced photorefractive crystals [3] and Bose–Einstein condensates coupled to an optical lattice trap [4]; see Chap. 8.4 for more details.",
            "Abstract entirety": 1,
            "Author pub id": "kQ_xRCIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bifurcations of travelling wave solutions in the discrete NLS equations",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278905000515",
            "Abstract": "We study discrete nonlinear Schrödinger (NLS) equations, which include the cubic NLS lattice with on-site interactions and the integrable Ablowitz–Ladik lattice. Standing wave solutions are known to exist in the discrete NLS equations outside of the finite spectral band. We study travelling wave solutions which have nonlinear resonances with unbounded linear spectrum. By using center manifold and normal form reductions, we show that a continuous NLS equation with the third-order derivative term is a canonical normal form for the discrete NLS equation near the zero-dispersion limit. Bifurcations of travelling wave solutions near the zero-dispersion limit are analyzed in the framework of the third-order derivative NLS equation.We show that there exists a continuous two-parameter family of single-humped travelling wave solutions in the third-order derivative NLS equation, when it is derived from the integrable …",
            "Abstract entirety": 0,
            "Author pub id": "kQ_xRCIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "North-Holland"
        }
    ]
}]