[{
    "name": "Βασίλειος Τσαουσίδης",
    "romanize name": "Vasileios Tsaousidis",
    "School-Department": "Ηλεκτρολόγων Μηχ.& Μηχ Η/Υ",
    "University": "duth",
    "Rank": "Καθηγητής",
    "Apella_id": 5340,
    "Scholar name": "vassilis tsaoussidis",
    "Scholar id": "m3AXAvcAAAAJ",
    "Affiliation": "Professor of Computer Engineering, Democritus University of Thrace, Greece",
    "Citedby": 2462,
    "Interests": [
        "Delay-tolerant networking",
        "Information-Centric Networking",
        "Internet",
        "Congestion Control",
        "Energy efficiency"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=m3AXAvcAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Space for Internet and Internet for space",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S157087051400122X",
            "Abstract": "Space flight and Internet service are technologies that are currently complementary but seem to be on the verge of integration into a new “space internetworking” discipline. The authors believe a comprehensive realization of space internetworking technology could dramatically enhance space exploration, augment terrestrial industry and commerce, benefit the economically disadvantaged, and nurture human and civil rights.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:evX43VCCuoAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Experimenting with τ-AIMD over wireless asynchronous networks",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366406000831",
            "Abstract": "The work describes the performance of two congestion control algorithms: AIMD and τ-AIMD. The first is the default mechanism of TCP; the second is a proposed congestion control algorithm that improves fairness of AIMD. We consider asynchronous networks where TCP flows have different propagation delays, a portion of their link is wireless, and they compete for resources over a single bottleneck link. We show that τ-AIMD improves the performance of flows that have long propagation delay and the fairness of the network. In wireless links τ-AIMD outperforms AIMD and the cost of lost packets (or wasted energy) is the same as that of AIMD.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:isC4tDSrTZIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Effort/gains dynamics in heterogeneous networks",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.894",
            "Abstract": "We investigate the behaviour of TCP(α, β) protocols in the presence of wireless networks. We seek an answer to strategic issues of maximizing energy and bandwidth exploitation, without damaging the dynamics of multiple‐flow equilibrium. We take a fresh perspective on protocol design: What is the return of the effort that a protocol expends? Can we achieve more gains with less effort? We study first the design assumptions of TCP(α, β) protocols and discuss the impact of equation‐based modulation of α and β on protocol efficiency. We introduce two new measures to capture protocol behaviour: the ‘Extra Energy Expenditure’ and the ‘Unexploited Available Resource Index’. We confirm experimentally that, in general, smoothness and responsiveness constitute a tradeoff; however, we show that this tradeoff does not graft its dynamics into a conservative/aggressive behaviour, as it is traditionally believed. We …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:RGFaLdJalmkC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "The TCP minimum RTO revisited",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72606-7_84",
            "Abstract": "We re-examine the two reasons for the conservative 1-second Minimum TCP-RTO to protect against spurious timeouts: i) the OS clock granularity and ii) the Delayed ACKs. We find that reason (i) is canceled in modern OSs; we carefully design a mechanism to deal with reason (ii). Simulation results show that in next generation’s high-speed, wireless-access networks, TCP-RTO should not be limited by a fixed, conservative lower bound.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:g3aElNc5_aQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Measuring transport protocol potential for energy efficiency",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11424505_32",
            "Abstract": "We investigate the energy-saving potential of transport protocols. We focus on the system-related aspect of energy. Do we have to damage or enhance system fairness in order to provide energy efficiency? We depart from defining protocol potential; we compare different transmission strategies and protocol mechanisms; and we report our results on the impact of each mechanism on system energy. We highlight our conclusion that protocol fairness appears to be a key factor for system energy efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Intermittently-connected IoT devices: Experiments with an NDN-DTN architecture",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9369578/",
            "Abstract": "The Named Data Networking and Delay Tolerant Networking architectures were originally targeting distinct networking domains: NDN was designed for content retrieval within fixed networks, while DTN was aiming to deliver data in highly-dynamic wireless topologies with intermittent connectivity. In this paper, we argue that the two technologies can complement each other to shape a joint NDN-DTN scheme which can improve data retrieval from intermittently-connected devices, such as IoT and sensor networks in remote areas. We quantify the improvements by using both DTN- and NDN- associated metrics combined in a common analytical framework and show that NDN-DTN can greatly improve the Interest Satisfaction Ratio and Average Delay when compared to a DTN-only approach, especially in environments with a low Delivery Ratio. We verify our results through experiments with intermittently-connected …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:q09DtPQ_434C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Space-Data Routers: Enhancing Deep Space communications for scientific data transmission and exploitation from Mars through Space Internetworking",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014EGUGA..1614260S/abstract",
            "Abstract": "Dissemination and exploitation of data from Deep Space missions, such as planetary missions, face two major impediments: limited access capabilities due to narrow connectivity window via satellites (thus, resulting to confined scientific capacity) and lack of sufficient communication and dissemination mechanisms between deep space missions such the current missions to Mars, space data receiving centers, space-data collection centers and the end-user community. Although large quantities of data have to be transferred from deep space to the operation centers and then to the academic foundations and research centers, due to the aforementioned impediments more and more stored space data volumes remain unexploited, until they become obsolete or useless and are consequently removed. In the near future, these constraints on space and ground segment resources will rapidly increase due to the launch of …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficiency/Fairness tradeoffs in networks with wireless components and transient congestion",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1020162026168",
            "Abstract": "Our work explores the impact of aggressive/conservative congestion control strategies on the fairness and efficiency of reliable transport protocols, in a wired/wireless environment. Based on experiments, we study the behavior of congestion control mechanisms in response to wireless errors, and transient congestion caused by a small number of competing flows. We show that: (i) the traditional TCP algorithm proves to be inadequate in terms of efficiency and fairness when random wireless errors occur in the network and, (ii) an aggressive strategy does not necessarily yield better performance. On the contrary, in the combined presence of transmission errors and transient congestion a conservative strategy appears superior.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:vRqMK49ujn8C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "On the Efficiency and Fairness of TCP over Wired/Wireless networks",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Dimitris-Vardalis/publication/281587342_On_the_Efficiency_and_Fairness_of_TCP_over_WiredWireless_Networks/links/55eed87408aef559dc442bfb/On-the-Efficiency-and-Fairness-of-TCP-over-Wired-Wireless-Networks.pdf",
            "Abstract": "The Transmission Control Protocol (TCP) has been the dominant reliable transport layer protocol ever since the appearance of its original version in 1981 [28]. The motivation behind TCP was to add reliability on top of an inherently unreliable IP network. The original TCP incorporated a “sliding window” mechanism, which, in conjunction with packet acknowledgments and segment sequence numbers, guaranteed a reliable data transmission as well as flow control.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICN Research Group P. Mendes Internet-Draft COPELABS/University Lusofona Intended Status: Experimental Rute Sofia Expires: February 28, 2019 Senception/COPELABS/University Lusofona",
            "Publication year": 2018,
            "Publication url": "http://www.watersprings.org/pub/id/draft-mendes-icnrg-dabber-01.pdf",
            "Abstract": "This draft describes the Data reAchaBility BasEd Routing (DABBER) protocol, which has been developed to extend the reached of Named Data Networking based routing approaches to opportunistic wireless networks. By\" opportunistic wireless networks\" it is meant multi-hop wireless networks where finding an end-to-end path between any pair of nodes at any moment in time may be a challenge. The goal is to assist in better defining opportunities for the transmission of Interest packets towards the most suitable data source, based on metrics that provide information about: i) the availability of different data sources; ii) the availability and centrality of neighbor nodes; iii) the time lapse between forwarding Interest packets and receiving the corresponding data packets. The document presents an architectural overview of DABBER followed by specification options related to the dissemination of name-prefix information to support the computation of next hops, and the ranking of forwarding options based on the best set of neighbors to ensure a short time-to-completion.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:CC3C2HR4nz8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Achieving energy-efficiency with DTN: A proof-of-concept and roadmap study",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30630-3_30",
            "Abstract": "Mobile networking devices autonomy can be prolonged by condensing sporadic traffic at the last hop, allowing the receiver to sleep during idle intervals. We claim that Delay Tolerant Networking principles are a natural fit for this application and, along with a novel rendezvous mechanism, employ DTN to achieve energy efficiency. The effectiveness of the proposed scheme is supported by select evidence from our previous experimental work. The presented experimental evidence is followed by a detailed discussion on ongoing development work and future research directions.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:bnK-pcrLprsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Wired/Wireless Internet Communications",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-38401-1.pdf",
            "Abstract": "We welcome you to the proceedings of the 11 th WWIC (International Conference on Wired/Wireless Internet Communications) held in St. Petersburg, Russia, during June 5–7, 2013. The 11 th WWIC technical program addresses various aspects of next-generation wired and wireless networks. Based on interesting submissions, we selected a program covering a diverse set of topics presenting new and innovative developments. In particular, issues of MAC layer and scheduling were dealt with, as well as different aspects of mobility and security. It is also worth mentioning the emphasis on wireless networks, including, but not limited to, cellular networks, wireless local area networks, cognitive networks, and sensor networks. We wish to thank the Technical Program Committee members of the conference and associated reviewers for their hard work and important contribution to the conference. This year the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:Pqt4MY__2vwC",
            "Publisher": "WWIC"
        },
        {
            "Title": "On the properties of an adaptive TCP Minimum RTO",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366408006610",
            "Abstract": "The Internet Engineering Task Force (IETF) specified in RFC 2988 the Minimum TCP–RTO and recommended that the TCP Retransmission Timeout (RTO) should not be smaller than 1 s. According to RFC 2988, there are two main limitations that call for a lower bound to protect TCP from spurious timeouts:(i) the OS clock granularity (500 ms for most OSs at the time of RFC 2988 publication) and (ii) the Delayed Acknowledgments (usually set to 200 ms). We evaluate the correctness of the suggested policy and investigate the impact of the conservative 1-s Minimum TCP–RTO under modern networking conditions. We define a Cost Function to capture the impact of the extra waiting time, due to the conservative IETF specification. Our experimental analysis reveals that the OS clock granularity should not be a matter of concern for modern OSs; we carefully design a mechanism to deal with Delayed ACKs. We …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Wired/wireless internet communications",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.comcom.2006.01.014",
            "Abstract": "Editorial: Wired/wireless Internet communications: Computer Communications: Vol 29, No \n13-14 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books \nSIGs Conferences People More Search ACM Digital Library SearchSearch Advanced \nSearch Computer Communications Periodical Home Latest Issue Archive Authors \nAffiliations Award Winners More HomeBrowse by TitlePeriodicalsComputer \nCommunicationsVol. , No. -14Editorial: Wired/wireless Internet communications article \nEditorial: Wired/wireless Internet communications Share on Authors: Torsten Braun profile \nimage Torsten Braun University of Bern, Switzerland University of Bern, Switzerland View \nProfile , Georg J Carle profile image Georg Carle University of Tübingen, Germany \nUniversity of Tübingen, Germany View Profile , Yevgeni profile of …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Bundle streaming service: design, implementation and performance evaluation",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.2762",
            "Abstract": "We present bundle streaming service (BSS), a communication framework that allows for reliable data streaming over delay/disruptive tolerant networks. BSS improves the reception and storage of data streams through the application of sophisticated forwarding tactics and the exploitation of inherent delay/disruptive tolerant networking (DTN) architecture features. The proposed framework, which targets easy configuration and deployment, comprises two elements: a bundle forwarder and a software library. Both elements were implemented as part of the interplanetary overlay network DTN platform. Using European Space Agency's DTN testbed, we experimentally evaluate BSS performance across a wide range of network scenarios. Based on these emulation results, we discuss the associated performance trade‐offs along with potential improvement opportunities and demonstrate BSS's suitability for both terrestrial …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approaches to congestion control in packet networks. Internet Engineering",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=3441849676593357958&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic Shaping for Enabling Less-than-Best Effort Services at the Edges of Broadband Connections",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/37661057/lcdnet13-slenas.pdf",
            "Abstract": "Broadband connection sharing constitutes a network resource pooling technique that could evolve toward supporting the establishment of the “Free Internet for All” notion. This technique could be implemented through the User-Provided Network model in which any end-user device (eg ADSL Access Points) could behave as supplier of Internet connectivity. In this paper, the behavior of such a system is investigated from a queuemanagement perspective. A numerical analysis that takes into consideration both the high variability of broadband link speeds and different packet-size distributions is presented. Based on the results, we propose a hybrid packet-scheduling scheme that enables the application of Less-than-Best Effort services at the connection edges.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:HAmI6pRF5skC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wave & Wait protocol (WWP): low energy, high throughput for mobile IP-devices",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=16124866419363780540&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bundle layer end-to-end retransmission mechanism",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5733233/",
            "Abstract": "Delay Tolerant Networking (DTN) has been proposed as a global overlay architecture to provide network connectivity in challenged environments such as deep-space communications field. Bundle Protocol along with its convergence layer protocols transform end-to-end reliability into questionable hop-by-hop reliable communication and imposes a two-tier routing policy that allows flexible routes only within regions. In this paper we propose a Bundle layer end-to-end reliability mechanism (BLER) and evaluate its performance in a DTN testbed in conjunction with similar mechanisms. We highlight the advantages of BLER mechanism in space communication scenarios which cannot be adequately addressed by the current DTN architecture and hop-by-hop reliability mechanisms in general.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Keyword-based mobile application sharing",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2980137.2980141",
            "Abstract": "The advent and wide adoption of smartphones in the second half of'00s has completely changed our everyday mobile computing experience. Tens of applications are being introduced every day in the application markets. Given the technology progress and the fact that mobile devices are becoming strong computing devices, mobile applications are expected to follow suit and become computation-heavy, bandwidth-hungry and latency-sensitive. In this paper, we introduce a new mobile computing paradigm to alleviate some of the network stress that mobile applications are already putting into the network, eg, in case of crowded areas and events, where the mobile network effectively collapses. According to this paradigm, users can share the applications that they have on their mobile devices with nearby users that want access to processed information, which their own applications cannot provide. In a sense, then …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:CMPXdcK5v8EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Beyond AIMD: Explicit fair-share calculation",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214204/",
            "Abstract": "We introduce an alternative approach to congestion avoidance and control, which has the potential to increase efficiency and fairness in multiplexed channels. Our approach, bimodal congestion avoidance and control, is based on the principles of TCP's additive increase multiplicative decrease. It is designed to better exploit the system properties during equilibrium, without trading off responsiveness for smoothness. In addition, it is capable of achieving convergence to fairness in only two congestion cycles. As a result, both efficiency and fairness are improved, responsiveness is not degraded, and smoothness is significantly improved when the system is in equilibrium. We provide a theoretical analysis and we discuss the potential of our approach for packet networks. Our experiments confirm that bimodal congestion avoidance and control as a component of the transmission control protocol outperforms the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TCP-Real: receiver-oriented congestion control",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128602002918",
            "Abstract": "We introduce a receiver-oriented approach to congestion control, demonstrated by an experimental protocol, TCP-Real. The protocol allows for a measurement-based transmission strategy, which complements the “blind” increase/decrease window adjustments. Owing to its design, the protocol displays an inherent property to produce comprehensive dynamics in heterogeneous environments with wired or wireless networks and delay-sensitive or -tolerant applications. TCP-Real controls congestion as standard TCP does. However, its receiver-oriented nature and its “wave” communication pattern allow for two amending mechanisms: (i) congestion avoidance, which reduces unnecessary transmission gaps that hurt the performance of time-constrained applications, and (ii) advanced error detection and classification, which designates recovery tactics responsive to the nature of the errors, thereby enhancing the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Autonomous Fault Detection and Diagnosis in Wireless Sensor Networks using Decision Trees",
            "Publication year": 2019,
            "Publication url": "http://www.jocm.us/uploadfile/2019/0624/20190624102547359.pdf",
            "Abstract": "—Reliable communication in wireless sensor networks constitutes an essential factor in maintaining critical systems operational. Despite this, wireless sensor networks are known to be volatile and prone to faults disrupting their normal working state. Particularly in open environments, wireless sensor networks must be able to detect arising faults to minimize subsequent failures of the network. This study deals with the detection and identification of faults in wireless sensor networks, notably faults that occur due to externally driven events, affecting network services, such as data transfers and communication between nodes. Faults commonly occurring due to such factors are loss of connectivity because of faulty node interfaces, disrupted connectivity due to obstacles, and extreme packet loss because of increased noise conditions or congestion. Detection, identification, and recovery of sensor network faults have been studied extensively in the literature. In this paper, a Machine Learning approach is used to detect and diagnose these faults. A decision tree algorithm was used to train the model. The produced model is consistently able to identify the faults on test data with an overall accuracy of 96.46%. Results also include high precision and recall values for each separate fault case, thus producing a successful fault identification model.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:xIusEVNJREcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "End-to-end Support for Multimedia QoS in the Internet",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/end-end-support-multimedia-qos/22033",
            "Abstract": "An increasing demand for multimedia data delivery coupled with reliance in best-effort networks, such as the Internet, has spurred interest on effective quality of service (QoS) management for multimedia streams. Since today’s multimedia applications are expected to run in physically heterogeneous environments composed of both wired and wireless components, we assess the efficiency of transport-layer solutions for multimedia traffic in heterogeneous networks. In order to quantify the performance on media delivery, we investigate the multimedia application requirements vs. the QoS provided by the underlying network. The chapter also provides means for the perceptual QoS assessment of voice and video streams. In the sequel, we describe some representative end-to-end congestion control schemes, identifying the mechanisms that are most suitable for multimedia traffic. Our analysis is complemented with …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:ldfaerwXgEUC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "On the properties of system-wide responsive behavior",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4492592/",
            "Abstract": "High contention of flows is associated with unstable network behavior and unmanageable resource administration, i.e., convergence to equilibrium becomes a difficult task. In this paper, we propose a new approach to control congestion. In this context, we present an algorithm for active queue management, to notify simultaneously all competing flows about incipient congestion. Typically, AQM schemes notify only a small portion of participating flows about congestion events. Our notification scheme, called global notifier (GN), allows for an immediate and less aggressive adjustment of transmission windows with three consequent properties: (i) fairness is improved, (ii) smoothness of responsive flows is improved and (iii) system utilization is better regulated between the knee and the cliff. We detail our algorithm and the corresponding responsive behavior of participating flows, and we highlight significant performance …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting the potential of DTN for energy-efficient internetworking",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121214000089",
            "Abstract": "Since its original conception as a space-oriented communications architecture, Delay Tolerant Networking (DTN) has been generalized to address issues in terrestrial networks as well. In this work we employ DTN to form an internetworking overlay that exploits the surplus capacity of last hop wireless channels in order to prolong battery life for mobile networking devices. We propose a novel rendezvous mechanism and show experimentally that the DTN overlay can shape traffic, allowing the wireless interface of the mobile device to switch to the sleep state during idle intervals without degrading performance. The simulation experiments are based on a comprehensive DTN agent that incorporates the rendezvous mechanism and facilitates quantifying energy conservation. The DTN agent, implemented in ns-2, enables the study of additional Bundle Protocol design issues, such as route selection, bundle sizing …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Where does transport layer fit into space dtn architecture?",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5586851/",
            "Abstract": "Delay Tolerant Networking (DTN) has been proposed as a global overlay architecture to provide network connectivity in challenged environments such as deep-space communications field. Bundle Protocol along with its convergence layer protocols transform end-to-end reliability into questionable hop-by-hop reliable communication and imposes a two-tier routing policy that allows flexible routes only within regions. Following the OSI model, in this paper we discuss the advantages and disadvantages of having a transport protocol relying on DTN for providing reliable and transparent transfer of data between end systems and offering common transport layer services such as end-to-end packet-oriented retransmission, flow control, path diversity and redundant transmission. In that context, we highlight features from DS-TP and DTTP that correspond to the requirements of transport protocols for space. We present …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reputation-based Trust: A robust mechanism for Dynamic Adaptive Streaming over Named Data Networking",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9343351/",
            "Abstract": "Information Centric Networking (ICN), emerges as a suitable networking paradigm to address functional challenges of today’s overloaded Internet. Named Data Networking (NDN) architecture, as an ICN instance, appears as a promising candidate for next-generation Internet architecture. In addition, due to its reduced bandwidth requirements, NDN facilitates efficient content distribution, and hence, it is deemed suitable for supporting critical services such as multimedia streaming using standards like Dynamic Adaptive Streaming (DAS).Security and trust management in NDN are built on credential-based methods, i.e., based on cryptographic operations. However, the deployment of the default NDN defense means is restricted to the consumer-side, and it is insufficient against some attacks, such as bitrate oscillation attacks (BOAs). In this paper, we focus on investigating reputation-based trust as a means to …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:puFLaqDw8dcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Impact of End-to-end vs. Link-layer Mechanisms on Real-Time Performance over Wireless Links",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1620289/",
            "Abstract": "We evaluate selected research proposals towards the efficient real-time QoS management over wireless links. We mainly focus on real-time performance of link-and transport-level mechanisms that bind operationally wired and wireless links. Employing a new metric for the evaluation of real-time performance we demonstrate that there are occasions where increased goodput does not correspond to real-time performance gains. In the sequel, we exploit further the potential of transport layer approaches",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the efficiency and fairness of congestion control mechanisms in wired and wireless networks",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=16042075128842917726&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Space-Data Routers: Advanced data routing protocols for enhancing data exploitation for space weather applications",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014EGUGA..16.5793A/abstract",
            "Abstract": "Data sharing and access are major issues in space sciences, as they influence the degree of data exploitation. The availability of multi-spacecraft distributed observation methods and adaptive mission architectures require computationally intensive analysis methods. Moreover, accurate space weather forecasting and future space exploration far from Earth will be in need of real-time data distribution and assimilation technologies. The FP7-Space collaborative research project\" Space-Data Routers\"(SDR) relies on space internetworking and in particular on Delay Tolerant Networking (DTN), which marks the new era in space communications. SDR unifies space and earth communication infrastructures and delivers a set of tools and protocols for space-data exploitation. The main goal is to allow space agencies, academic institutes and research centers to share space-data generated by single or multiple missions, in …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:j8SEvjWlNXcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wired/Wireless Internet Communications",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-61382-6.pdf",
            "Abstract": "We welcome you to the joint proceedings of the 15th International Conference on Wired/Wireless Internet Communications (IFIP WWIC). The conference constitutes a forum for the presentation and discussion of the latest results in the field of wired/wireless networks and aims at providing research directions and fostering collaborations among the participants. In this context, the Program Committee accepts a limited number of papers that meet the criteria of originality, presentation quality, and topic relevance. IFIP WWIC is a single-track conference that has reached, over the past 14 years, a high-quality level, which is reflected by the paper acceptance rate as well as the level of attendance. Following the conference tradition, there is a best paper award. The 15th IFIP WWIC technical program addressed various aspects of nextgeneration data networks. This year, special attention was given to advanced wireless …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:WGv8Og3F3KgC",
            "Publisher": "Springer"
        },
        {
            "Title": "The TCP minimum RTO revisited",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72606-7_84",
            "Abstract": "We re-examine the two reasons for the conservative 1-second Minimum TCP-RTO to protect against spurious timeouts: i) the OS clock granularity and ii) the Delayed ACKs. We find that reason (i) is canceled in modern OSs; we carefully design a mechanism to deal with reason (ii). Simulation results show that in next generation’s high-speed, wireless-access networks, TCP-RTO should not be limited by a fixed, conservative lower bound.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Error differentiation with measurements based on wave patterns",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404000180",
            "Abstract": "We investigate the efficiency and fairness potential of an error differentiation mechanism with measurements based on wave patterns. Our work is focused on a receiver-oriented protocol, TCP-Real that allows for measurement-based congestion detection and error recovery instead of a ‘blind’ increase/decrease window adjustment. We conduct a comparative evaluation of congestion control mechanisms of standard TCP, TCP-Real, and TCP-friendly protocols in multiplexed wired/wireless networks for both delay-tolerant and delay-sensitive applications. We show that the receiver-oriented communication of TCP-Real (i) diminishes the impact of reverse path asymmetry on the transmission rate, (ii) allows for error recovery tactics that are responsive to the nature of the error detected (i.e. congestion versus bit corruption), and (iii) dictates transmission rate adjustments that conform to the level of present contention. As a …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the miscollaboration of congestion control mechanisms at the transport and the network layers",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4221039/",
            "Abstract": "Many sophisticated mechanisms have been implemented at both the transport and the network layers in order to estimate network conditions and avoid overload of network links. We evaluate the congestion control and avoidance scheme from a cross-layer perspective. We conduct simulations to investigate issues of miscollaboration between the network and transport layers that have negative impact on application performance. We identify several such scenarios; we discuss the reasoning and the extent of miscollaboration, and the appropriate measures to resolve the problem. We conclude that the common practise for evaluating research proposals lacks the appropriate experimental diversity, granularity or perspective and hence new mechanisms may favor a particular set of targeted protocols but damage some others. As a result, a portion of Internet traffic flows is frequently favored at the cost of co-existing …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An adaptive end‐to‐end RTO calculation framework for DTNs with scheduled connectivity",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sat.1217",
            "Abstract": "In this work, we propose an end‐to‐end retransmission framework for dynamically calculating efficient retransmission time‐out intervals in delay‐tolerant networks (DTNs) with scheduled connectivity. The proposed framework combines deterministic and statistical information about the network state to calculate worst‐case estimates about the expected round trip times. Such information includes connectivity schedules, convergence layer protocols specifics, communication link characteristics, and network statistics about the maximum expected packet error rates and storage congestion. We detail the implementation of the proposed framework within the end‐to‐end application data conditioning layer proposed for the DTN architecture, realized by the Delay‐Tolerant Payload Conditioning protocol, as part of the Interplanetary Overlay Network–DTN reference implementation, and evaluate its performance in a …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:svGagg1hbZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tcp-probing: Towards an error control schema with energy and throughput performance gains",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=7563360651066047046&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wired/Wireless Internet Communications: Third International Conference, WWIC 2005, Xanthi, Greece, May 11-13, 2005, Proceedings",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=2Dv3BwAAQBAJ&oi=fnd&pg=PA1&dq=info:d8CgJ7WeWw8J:scholar.google.com&ots=7vcs_gtiI8&sig=RF9I4jjxIDXoBg9Fxg70jyZnNlw",
            "Abstract": "Welcome to the 3rd International Conference on Wired/Wireless Internet C-munications (WWIC). After a successful start in Las Vegas and a selective c-ference in Germany, this year’s WWIC demonstrated the event’s maturity. The conference was supported by several sponsors, both international and local, and became the o? cial venue for COST Action 290. That said, WWIC has now been established as a top-quality conference to promote research on the convergence of wired and wireless networks. This year we received 117 submissions, which allowed us to organize an-citing program with excellent research results, but required more e? ort from the 54 members of the international Program Committee and the 51 additional reviewers. For each of the 117 submitted papers we asked three independent-viewers to provide their evaluation. Based on an online ballot phase and a TPC meeting organized in Colmar (France), we selected 34 high-quality papers for presentation at the conference. Thus, the acceptance rate for this year was 29%.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer"
        },
        {
            "Title": "Improving TCP smoothness by synchronized and measurement-based congestion avoidance",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/776322.776343",
            "Abstract": "In this paper, we observe that although multiplicative decrease is necessary to accomplish fairness in congestion control, it does not inevitably sacrifice system throughput, as long as the system operates between the knee and the cliff, according to an equation. However, even when the system throughput is relatively stable, end users of real-time applications do not necessarily experience a smooth traffic, mainly caused by the unsynchronized window adjustments due to random congestion indications. We analyzed and evaluated the negative impact of random window adjustments on smoothness, short-term fairness, and even long-term fairness measured by a novel fairness metric defined in this paper. Therefore, we propose an experimental congestion avoidance mechanism to improve TCP smoothness for media-streaming applications. The mechanism relies on a fine-grained RTT estimation to measure the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessment of Internet voice transport with TCP",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.789",
            "Abstract": "We investigate whether the current best‐effort technology of Internet stands up to the high quality standards of real‐time voice communication. More precisely, we assess VoIP quality within the context of transport protocol support and efficiency. Initially, we focus on TCP and UDP supportive role from the perspective of VoIP performance. Applying our metric for real‐time performance, we reach the outcome that UDP is always not the protocol of choice for VoIP, since it occasionally exhibits inadequate performance. Beyond that, we evaluate a solution‐framework based on TCP protocols, which favour real‐time traffic. Based on our measurements, we assess the efficiency of the associated congestion control and congestion avoidance mechanisms in terms of VoIP performance. We also study the effect of packet size on protocol behaviour and VoIP quality. Furthermore, we investigate VoIP traffic friendliness, as well …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:MXK_kJrjxJIC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Additive increase multiplicative decrease-fast convergence (AIMD-FC)",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812776730_0041",
            "Abstract": "Additive Increase Multiplicative Decrease is the dominant algorithm for congestion avoidance and control in the Internet. The major goal of AIMD is to achieve fairness and efficiency in allocating resources. In the context of packet networks AIMD attains its goal partially. We present here a salient modification that leads to better efficiency and faster convergence to fairness. Our control model is based on the assumptions of the original AIMD algorithm. Our improvement is based on a property of the protocols to share common knowledge, yet in a distributed manner. We exploit this property effectively, in the context of packet networks. We present experimental results with TCP that match the expectations of the theoretical analysis. Without entailing any performance tradeoff, our algorithm improves efficiency and fairness significantly.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:XiSMed-E-HIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wired/Wireless Internet Communication. 11th International Conference on Wired/Wireless Internet Communications, WWIC 2013, St. Petersburg, Russian Federation, 5.-7.6. 2013",
            "Publication year": 2013,
            "Publication url": "https://researchportal.tuni.fi/en/publications/wiredwireless-internet-communication-11th-international-conferenc",
            "Abstract": "Wired/Wireless Internet Communication. 11th International Conference on Wired/Wireless \nInternet Communications, WWIC 2013, St. Petersburg, Russian Federation, 5.-7.6.2013 — \nTampere University Research Portal Skip to main navigation Skip to search Skip to main content \nTampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units \nResearch output Datasets Activities Prizes Press / Media Equipment Search by expertise, \nname or affiliation Wired/Wireless Internet Communication. 11th International Conference on \nWired/Wireless Internet Communications, WWIC 2013, St. Petersburg, Russian Federation, \n5.-7.6.2013 Vassilis Tsaoussidis (Editor), Andreas J. Kassler (Editor), Yevgeni Koucheryavy \n(Editor), Abdelhamid Mellouk (Editor) Research output: Book/Report › Anthology › Scientific › \npeer-review Overview Translated title of the contribution Wired/Wireless Internet . 11th on /, , .…",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:43B52WW2E64C",
            "Publisher": "Springer"
        },
        {
            "Title": "Delay Tolerant Payload Conditioning Protocol",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128613003745",
            "Abstract": "Delay Tolerant Networking (DTN) architecture is a new communication architecture developed to provide network connectivity in challenging environments. It forms a store-and-forward overlay network that employs persistent storage to deal with link disconnections. Consistent with its store-and-forward requirements, the design of the transport function of the DTN architecture was primarily based on hop-by-hop operations in preference to the traditional end-to-end communication model. As a result, pure end-to-end functionality is absent from the current DTN architecture and thus has been shifted towards applications. In this study, we highlight the benefits of having an additional layer of application-independent protocol offering transparent application data conditioning services end-to-end and we introduce Delay Tolerant Payload Conditioning (DTPC) protocol, a novel protocol that realizes this layer. DTPC protocol …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extending internet into space–ESA DTN testbed implementation and evaluation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03819-8_37",
            "Abstract": "As the number and complexity of space missions increases, space communications enter a new era, where internetworking gradually replaces or assists traditional telecommunication protocols. The Delay Tolerant Network (DTN) architecture has recently emerged as a communication system for challenged networks, originally designed for the Interplanetary Internet. In the context of our project with ESA called \"Extending Internet into Space - ESA DTN Testbed Implementation and Evaluation\" we intend to deploy a distributed, flexible and scalable DTN testbed for space communications. The testbed will provide the supportive infrastructure for the design and evaluation of space-suitable DTN protocols, architectures, and routing policies to allow efficient deep-space communications. Throughout the project, we will demonstrate the operational capabilities of the DTN protocols in space; design and evaluate …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Energy/Throughput Tradeoffs of Reliable Transport Protocols",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15045444540457471451&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Equilibrium-RED: Adjusting RED's Dropping Probability for Maximum Fairness and Performance",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Delshifteh-Pakan-2/publication/263849790_Performance_Evaluation_of_Header_Compression_over_SPEP_included_Satellite_Links/links/00b7d53c1235baf41f000000/Performance-Evaluation-of-Header-Compression-over-SPEP-included-Satellite-Links.pdf#page=110",
            "Abstract": "RED is an Active Queue Management technique that has been around for many years. Contrary to the Droptail algorithm, RED manages to increase fairness dramatically, although occasionally against network performance. RED's efficiency is due to a dropping mechanism that, based on a function of average queue length, drops probabilistically packets from the queue. Unlike RED, Droptail may favor performance over fairness. In this paper we analyze RED's dropping algorithm and based on the results we attempt to create a RED variant for maximum performance and fairness: Equilibrium-RED. We present results that demonstrate EQU-RED’s ability to balance the trade-off between Droptail and classic RED behaviors.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Skin-like sensor enabled bridge structural health monitoring system",
            "Publication year": 2016,
            "Publication url": "https://www.ndt.net/events/EWSHM2016/app/content/Paper/114_Loupos.pdf",
            "Abstract": "Structural Health Monitoring (SHM) has an important role in the management of transport infrastructure. However, most SHM techniques are based on data obtained from dense networks of point-based sensors (rather than sparse networks of spatial sensors) and so, in relative terms, they are costly to implement. Most commercially available strain sensors have a limited maximum range-typically 1% to 2%-and are not well-suited to providing information of a severe loss of structural integrity. The SENSKIN project develops a dielectric-elastomer and micro-electronics-based skin-like sensor, based on the use of a large highly extensible capacitance sensing membrane and advanced micro-electronic circuitry, for monitoring transport infrastructure-such as bridges. The sensor will provide spatial measurements of strain of more than 10% and is being designed to (a) require low power to operate,(b) be easy to install (c) have a comparable or lower cost than conventional strain sensors,(d) allow simple signal processing, and (e) have the ability to self-monitor and selfreport. The system will support the new and emerging technology of Delay/Disruption-Tolerant Networking to secure that strain measurements acquired will reach the base station even under extreme conditions where communications may be disrupted. SENSKIN also develops a Decision-Support-System (DSS) for proactive condition-based structural interventions under normal operating conditions and reactive emergency intervention following an extreme event. In assessing potential rehabilitation options, the DSS will use the data supplied by the SENSKIN sensors together with …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:ON9TkA72AHEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Keynote 1: SPACE for Internet & INTERNET for Space",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8969781/",
            "Abstract": "Summary form only given, as follows. The complete presentation was not made available for publication as part of the conference proceedings. Space flight and Internet service are technologies that are currently complementary but seem to be on the verge of integration into a new ”space internetworking” discipline. I will claim that a comprehensive realization of space internetworking technology should provide an infrastructure for universal interconnection among humans and their artifacts and could dramatically enhance space exploration, augment terrestrial industry and commerce, benefit the economically disadvantaged, and nurture human and civil rights. Part of the talk will be based on joint work with Scott Burleigh, Vint Cerf and Jon Crowcroft.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:hrkNWuzUpWwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wired/Wireless Internet Communications: 9th IFIP TC 6 International Conference, WWIC 2011, Vilanova i la Geltrú, Spain, June 15-17, 2011, Proceedings",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=5FLDBAAAQBAJ&oi=fnd&pg=PR2&dq=info:hbw7868hHKQJ:scholar.google.com&ots=N5kRBotDji&sig=ATP9n2_oduZ0mpZ2XRHuLtF2_Tg",
            "Abstract": "This book constitutes the proceedings of the 9th IFIP TC 6 International Conference on Wired/Wireless Internet Communications, WWIC 2011, held in Vilanova i la Geltrú, Spain, in June 2011. The 26 contributions included were carefully reviewed and selected from 50 submissions. In addition the book contains 15 invited papers. The contributions are structured in topical sections on mobility and LTE networks; performance and simulation analysis; adaptive approaches to guarantee E2E network services; energy efficiency and cooperation in wireless networks; transmission and management; quality through routing, naming and control; wireless multi-hop communications challenges in the future internet; and emerging contributions.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:M8meJADSprsC",
            "Publisher": "Springer"
        },
        {
            "Title": "End-to-end loss differentiation for video streaming with wireless link errors",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s11235-009-9203-8",
            "Abstract": "Video delivery in heterogeneous wired/wireless networks is challenging, since link errors commonly degrade throughput performance, smoothness, and eventually impair the playback quality. We present an end-to-end Loss Differentiation Mechanism (LDA) which effectively decouples congestion from wireless loss in order to abolish the damage of error-induced multiplicative decrease on flow throughput and smoothness. The proposed LDA relies on Round Trip Time measurements to estimate the queuing delay and determine the appropriate error-recovery strategy. This mechanism can be easily adapted and incorporated into existing Additive Increase Multiplicative Decrease (AIMD) protocols, enabling them to utilize the available resources more efficiently. In this context, we incorporate the LDA into AIMD-based Scalable Streaming Video Protocol (SSVP), an end-to-end TCP-friendly protocol optimized …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:dhFuZR0502QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "DS-TP: Deep-space transport protocol",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4526328/",
            "Abstract": "We present deep-space transport protocol (DS- TP), a new reliable protocol for deep-space communication links. DS-TP's main advantage is its ability to complete file transfers faster than conventional TCP, SCPS-TP and Saratoga. Therefore, missions with small connectivity time are greatly favored. Deep space communication links are characterized by long propagation delays, high BERs, intermittent connectivity (i.e., blackouts) and bandwidth asymmetries. Common approaches to deal with the above unique characteristics are: rate-based, open-loop protocols to deal with huge propagation delays; regular retransmissions to deal with high BERs; transmission suspension to deal with blackouts; SNACKs to deal with bandwidth asymmetries. We adopt some of the above approaches, namely, the open-loop, rate-based transmission and the SNACKs and focus on the optimization of the rest, namely, the retransmission …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing data exploitation through DTN-based data transmission protocols",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014EGUGA..16.9058D/abstract",
            "Abstract": "Data distribution and data access are major issues in space sciences and geosciences as they strongly influence the degree of data exploitation. Processing and analysis of large volumes of Earth observation and space/planetary data face two major impediments: limited access capabilities due to narrow connectivity windows between spacecraft and ground receiving stations and lack of sufficient communication and dissemination mechanisms between space data receiving centres and the end-user community. Real-time data assimilation that would be critical in a number of forecasting capabilities is particularly affected by such limitations. The FP7-Space project\" Space-Data Routers\"(SDR) has the aim of allowing space agencies, academic institutes and research centres to disseminate/share space data generated by single or multiple missions, in an efficient, secure and automated manner. The approach of …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transport-Layer Design Perspectives for Heterogeneous Networks",
            "Publication year": 2006,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/lcn/2006/04116517/12OmNAWpyoG",
            "Abstract": "The purpose of this paper is to extend verification tests to systems with multiple autonomous agent knowledge bases. In particular, this paper focuses on those unique inter-agent anomalies that are generated as we go from single agent systems to multiple agent systems. For example, consider one agent with the rule “if A then B” and a rule in another agent “if A then C”. In such a setting, the agents would be constantly at odds. Alternatively we might find the following rules in one agent (“if A then B” and “if C then A”), while another agent that interacts with that agent might have the rule (“if B then C”). With those two interacting rule bases a dialogue starting with “A” could cycle indefinitely.One potential approach to multiple agent systems is to compare the knowledge base of each subset of agents to determine the existence verification issues. Where the number of agents is small this approach is feasible. However, for …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Network Working Group P. Mendes, Ed. Internet-Draft Airbus Intended status: Experimental R. Sofia Expires: March 19, 2021 fortiss GmbH",
            "Publication year": 2020,
            "Publication url": "https://www.ietf.org/archive/id/draft-mendes-icnrg-dabber-05.pdf",
            "Abstract": "This draft describes the Data reAchaBility BasEd Routing (DABBER) protocol. DABBER aims to provide a name-based routing solution to support the operation of Information-centric Networking frameworks in opportunistic wireless networks. By\" opportunistic wireless networks\" it is meant multi-hop wireless networks where finding an end-to-end path between any pair of nodes at any moment in time may be a challenge. The goal is to assist in better defining opportunities for the transmission of Interest packets in a storecarry-and-forward manner, based on a proactive approach. The document describes how to integrate DABBER in a networking node that implements some ICN approach, such as Named-Data Networking (NDN) or Content Centric Networking (CCN), along with the specification of the proactive approach based on the dissemination of name-prefix information.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:iWL_APfBKHwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spice testbed: A dtn testbed for satellite and space communications",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13326-3_20",
            "Abstract": "This paper presents SPICE testbed, a state-of-the-art Delay Tolerant Networking testbed for satellite and space communications deployed at the Space Internetworking Center, Greece. The core of the testbed relies on the Bundle Protocol and its architecture has been designed to support multiple DTN implementations and a variety of underlying and overlying protocols. SPICE testbed is equipped with specialised hardware components for the accurate emulation of space links and ground stations, such as Portable Satellite Simulator (PSS) and CORTEX CRT system, as well as protocols and mechanisms specifically designed for space DTNs. Performance and functionality evaluations on SPICE testbed show that it is an ideal platform to evaluate new mechanisms in a variety of space communication scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Wired/Wireless Internet Communication: 10th International Conference, WWIC 2012, Santorini, Greece, June 6-8, 2012, Proceedings",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=Xom6BQAAQBAJ&oi=fnd&pg=PP2&dq=info:zAzRmZ-5FjsJ:scholar.google.com&ots=yTZNRzvn0n&sig=fpG2-FQvLz7ltMhX-SWVzdgJLpA",
            "Abstract": "This book constitutes the refereed proceedings of the 10th International Conference on Wired/Wireless Internet Communications, WWIC, held in Santorini island, Greece during June 6-8, 2012. The 23 revised full papers and 6 short papers presented were carefully reviewed and selected from 50 submissions. The papers are organized in six thematically-distinct technical sessions, covering the following major topics: virtual networks and clouds, multimedia systems, wireless sensor networks and localization, delay-tolerant and opportunistic networks, handover techniques and channel access, and ad hoc networks",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer"
        },
        {
            "Title": "Αρχιτεκτονική Δρομολογητών για τη Διαμεταγωγή Διαστημικών Δεδομένων",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:wgKq3sYidysC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental Evaluation of Red in Heterogeneous Environments.",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13468160832150608833&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transport Layer Protocols",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781118256053.ch5",
            "Abstract": "This chapter contains sections titled:   Introduction   Core Functions at the Transport Layer   TCP Header   Congestion Control   Performance Metrics   Network as a Black Box   Measurement‐Based Congestion Control   Framework for Potential Improvements   TCP‐Friendly Protocols   Real‐Time Transport Protocol   Stream Control Transmission Protocol   Synergistic Approaches   Conclusion   Glossary   Cross References   References  IntroductionCore Functions at the Transport LayerTCP HeaderCongestion ControlPerformance MetricsNetwork as a Black BoxMeasurement‐Based Congestion ControlFramework for Potential ImprovementsTCP‐Friendly ProtocolsReal‐Time Transport ProtocolStream Control Transmission ProtocolSynergistic ApproachesConclusionGlossaryCross ReferencesReferences",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:BrmTIyaxlBUC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "Differentiating services for sensor internetworking",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.606.3088&rep=rep1&type=pdf",
            "Abstract": "We propose NCQ (Non-Congestive Queuing) as a scheduling discipline that allows for efficient interoperation of sensor networks with the Internet. NCQ promotes conditionally small data packets, which require comparatively minor service times, as long as their total service times cause insignificant delays to other packets in the queue. Therefore, NCQ introduces a new service philosophy, which prioritizes packets, and in turn corresponding flows, according to their impact on total delay. In this context, we also introduce a corresponding index to measure fairness as a function of the deviation of expected and received delay.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Protocol Behavior: More Effort, More Gains?, PIMRC 2004",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=7583868790575773035&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:BUYA1_V_uYcC",
            "Publisher": "September"
        },
        {
            "Title": "Behavior of TCP-Probing with Hand-offs",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.92.2048&rep=rep1&type=pdf",
            "Abstract": "Performance of standard TCP is significantly degraded during hand-off periods of mobile communications. We show here that carefully designed probing mechanisms can cancel this incompetent behavior of TCP for a wide range of hand-off periods. We compare TCP Tahoe and Reno with TCP Probing under various scenarios of hand-off duration, propagation delay and mobility conditions of the user. We measure the goodput efficiency of data transfer as well as the energy efficiency of the protocols’ mechanisms in terms of overhead and time. Our results show that TCP Probing demonstrates significant gains in both energy and throughput efficiency by avoiding unnecessary timeout extensions and retransmission of data which is likely to be lost due to hand-offs.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of τ-AIMD over wireless asynchronous networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11424505_9",
            "Abstract": "The work describes the performance of two congestion control algorithms: AIMD and τ-AIMD. The first is the default mechanism of TCP; the second is a proposed congestion control algorithm that improves fairness of AIMD. We consider asynchronous networks where TCP flows have different propagation delays, a portion of their link is wireless, and they compete for resources over a single bottleneck link. We show that τ-AIMD improves the performance of flows that have long propagation delay and the fairness of the network. In wireless links τ-AIMD outperforms AIMD and the cost of lost packets (or wasted energy) is the same as that of AIMD.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Improving TCP performance over networks with wireless components using ‘probing devices’",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.548",
            "Abstract": "TCP error control mechanism lacks the ability to detect with precision the nature of potential errors during communication. It is only capable of detecting the results of the errors, namely that segments are dropped. As a result, the protocol lacks the ability to implement an appropriate error recovery strategy cognizant of current network conditions and responsive to the distinctive error characteristics of the communication channel. TCP sender always calls for the sending window to shrink. We show that probing mechanisms could enhance the error detection capabilities of the protocol. TCP could then flexibly adjust its window in a manner that permits the available bandwidth to be exploited without violating the requirements of stability, efficiency and fairness that need to be guaranteed during congestion.Our experiments have three distinct goals: First, to demonstrate the potential contribution of probing mechanisms. A …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:P5F9QuxV20EC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "On the properties of an additive increase rate accelerator",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128608003496",
            "Abstract": "We propose AIRA, an Additive Increase Rate Accelerator. AIRA extends AIMD functionality towards adaptive increase rates, depending on the level of network contention and bandwidth availability. In this context, acceleration grows when resource availability is detected by goodput/throughput measurements and slows down when increased throughput does not translate into increased goodput as well. Thus, the gap between throughput and goodput determines the behavior of the rate accelerator.We study the properties of the extended model and propose, based on analysis and simulation, appropriate rate decrease and increase rules. Furthermore, we study conditional rules to guarantee operational success even in the presence of symptomatic, extra-ordinary events. We show that analytical rules can be derived for accelerating, either positively or negatively, the increase rate of AIMD in accordance with network …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:IWHjjKOFINEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AIMD for Asynchronous Networks",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9645972961483921032&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wave & wait protocol (WWP): high throughput and low energy for mobile IP-devices",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/875832/",
            "Abstract": "The work we present here reports on the further development and testing of an experimental transport-level protocol. The protocol runs on top of the IP, and is intended for mobile, wireless devices. Its central concern is to conserve battery-powered energy used for transmission while maintaining high levels of data throughput. It can be adjusted to achieve higher throughput at the expense of lesser energy-saving in accordance with the application's needs. It conserves transmission effort, adjusting data transmission below the perceived network congestion level, and thereby minimizes the need for duplicate data retransmission due to congested routers losing packets, and so on. It achieves high throughput by implementing a network probing mechanism that enables it to investigate instances in which prevailing throughput conditions appear to be deteriorating before committing to further data transmission. The …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Abstract Why TCP timers (still) don’t work well",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.107.2765",
            "Abstract": "We argue that the design principles of the TCP timeout algorithm are based solely on RTT estimations and may lead to flow synchronization, unnecessary retransmission effort and unfair resource allocation. We present a new Window-Based Retransmission Timeout algorithm (WB-RTO) for TCP, which exhibits two major properties:(i) it cancels retransmission synchronization, which dominates when resource demand exceeds resource supply and (ii) it reschedules flows on the basis of their contribution to congestion. WB-RTO achieves better fairness and slightly better goodput with significant less retransmission effort. Ó 2006 Elsevier BV All rights reserved.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:JavbeY_VQWIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D4. 1 “Flowlet Congestion Control–Initial Report”",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=14347844549428366679&hl=en&oi=scholarr",
            "Abstract": "This deliverable (D4.1) is the first out of five to be produced by WP4 to deal with QoS. In WP4 we address the challenges of QoS with congestion control mechanisms that enhance QoS by means of avoiding congestion problems that might result in packet loss, latency and low throughput. The UMOBILE project devises interactions between two different domains (see Figure 1): • The UMOBILE Domain which is a local network running the UMOBILE protocols (e.g., NDN, DTN). Providing the Internet access in this domain is optional as UMOBILE users can access the local services through public hotspot (e.g., WiFi AP) or WiFi direct (e.g., direct connection among users). • The Internet Domain is the conventional TCP/IP Internet and is an extension of the UMOBILE Domain where UMOBILE users (running either TCP/IP, NDN or DTN protocols) can access Internet services. For instance, as shown in the figure, the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:R6EwkKsDylYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wb-RTO: A Window-Based Retransmission Timeout for TCP, in",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.210.8014",
            "Abstract": "We present a new timeout algorithm for TCP, based on the observation that TCP-RTO should not be solely based on RTT estimations. We argue that the design principles of the current timeout algorithm may lead to flow synchronization, unnecessary retransmission effort and unfair resource allocation. WB-RTO exhibits two major properties:(i) it cancels retransmission synchronization which dominates when resource demand exceeds by far resource supply and (ii) reschedules flows on the basis of their contribution to congestion. I.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:WHBERAHVdrEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Differentiating services with noncongestive queuing (ncq)",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4663054/",
            "Abstract": "We discuss a new packet service paradigm, called \"Less Impact Better Servicerdquo (LIBS), which is realized through a novel queuing discipline, called \"noncongestive queuingrdquo (NCQ). NCQ prioritizes small packets when conditions permit and utilizes service thresholds to confine the delay impact of prioritization on congestive applications. We show that LIBS and NCQ satisfy more users with diverse demands on delay and throughput. We obtained both analytical and simulation results, which are very promising. Diversity is simulated by using FTP, sensor, and VoIP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Properties of Adaptive Additive Increase",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4492505/",
            "Abstract": "We discuss the impact of fixed window increase rules on network utilization, fair resource allocation and overall transmission effort. We exploit the dynamics of adaptive additive increase as the strategy of choice for regulating transmission in accordance with the current level of contention. We show that, based on the additive increase rate of flows, a contention-oriented responsive strategy can be designed to (i) increase utilization under low-contention, (ii) reduce overhead and transmission effort under heavy loads, and (iii) maintain system capability to reach fairness.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:rO6llkc54NcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Decentralized space-data dissemination for low-cost, dense satellite networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7376238/",
            "Abstract": "Recent trends in scientific low Earth orbit satellite missions involve small, low-cost satellites communicating with multiple low-cost ground stations. We propose a peer-to-peer multicast ground distribution scheme accompanied by a best-effort broadcasting mechanism with randomized retransmissions that is tailored for such satellite missions. Through our simulation tools, we assess the performance of the new, low-cost model; evaluate the benefits of decentralized ground distribution; and quantify the trade-off between data reliability and data return volume.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network Working Group P. Mendes, Ed. Internet-Draft Airbus Intended status: Experimental R. Sofia Expires: September 16, 2020 fortiss GmbH",
            "Publication year": 2020,
            "Publication url": "http://www.watersprings.org/pub/id/draft-mendes-icnrg-dabber-04.pdf",
            "Abstract": "This draft describes the Data reAchaBility BasEd Routing (DABBER) protocol, which aims to extend the operation of distributed Information Centric Networking frameworks to opportunistic wireless networks such as Delay Tolerant Networks. By\" opportunistic wireless networks\" it is meant multi-hop wireless networks where finding an end-to-end path between any pair of nodes at any moment in time may be a challenge. The goal is to assist in better defining opportunities for the transmission of Interest and Data packets in a store-carry-and-forward manner, based on a combination of proactive and reactive approaches. The document presents an architectural overview of DABBER followed by the specification of the proactive approach based on the dissemination of name-prefix information, and the reactive approach based on the encounters probability.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:7XUxBq3GufIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Proceedings of the Wired/Wireless Internet Communication, 11th International Conference, WWIC 2013",
            "Publication year": 2013,
            "Publication url": "https://www.diva-portal.org/smash/record.jsf?pid=diva2:732930",
            "Abstract": "URN: urn: nbn: se: kau: diva-33200 DOI: 10.1007/978-3-642-38401-1 ISBN: 978-3-642-38400-4 (print) ISBN: 978-3-642-38401-1 (print) OAI: oai: DiVA. org: kau-33200 DiVA, id: diva2: 732930",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:Kv9jytqXTosC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Wired: 9th IFIP TC 6 International Conference, WWIC 2011, Vilanova i la Geltrú, Spain, June 15-17, 2011, Proceedings",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=6859130518895939872&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:yNlG6JgpFqoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Less Impact Better Service (LIBS)",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s12243-010-0175-1",
            "Abstract": "We discuss a new packet service paradigm, called “Less Impact Better Service” (LIBS). In simple terms, LIBS primarily schedules packets based on the delay they cause and cancels service differentiation policies when the cumulative delay due to prioritization becomes significant for non-prioritized packets. Based on LIBS, we evaluate different service policies that prioritize small packets using different service boundaries and we show that, by and large, LIBS satisfies better a number of applications with diverse demands in delay and throughput. We emphasize on Voice over IP applications, which are delay-sensitive but also utilize small packets and rates. Among other traditional performance measures, we also measure fairness in the context of LIBS, that is, we address the question whether the delay experienced per flow is proportional to the delay caused by that flow. We obtained very promising …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Using Space-Data-Routers for the timely and targeted downloading of Land Surface Temperature data to local users",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Daglis-2/publication/272885062_Proceedings_of_NETSPACE_Workshop_February_2014/links/54f1e34c0cf2b36214ace415/Proceedings-of-NETSPACE-Workshop-February-2014.pdf#page=52",
            "Abstract": "Land Surface Temperature (LST) imagery is necessary for the assessment of the urban thermal environment, an issue of increasing scientific interest due to climate change and urbanization. The problem of the exploitation of the large satellite-derived LST archive is of spatio-temporal nature. The LST input datasets are acquired from various sensors with Thermal Infrared (TIR) bands onboard geostationary (eg Meteosat Second Generation MSG viewing Europe and Africa) and near polar orbit (eg Terra and Aqua) satellites. The problem of directing and downloading the vast volumes of quarterly-hour datasets to the local users timely and accurately is not solved yet. In particular the geostationary dataset is large. The daily European LST dataset (96 images) volume is 624MB/day, that is 222.4 GB/yr. In total the decadal archive to be searched will be of the order of TerraByte. We investigate the possibility to deploy Space-Data Routers to deliver this task. This is of primary importance for the future development of a global urban observatory with hundreds of users.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards an Opportunistic Software-Defined Networking Solution",
            "Publication year": 2019,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781315167084-3/towards-opportunistic-software-defined-networking-solution-lefteris-mamatas-alexandra-papadopoulou-vassilis-tsaoussidis",
            "Abstract": "This chapter employs a semi-Markov model for the prediction of contact opportunities. It introduces a semi-Markov model and detailed a number of equations suitable to predict different aspects of user mobility behavior, including detection of mobility patterns. The chapter describes a relevant scenario, a first architectural description of the studied platform along with the proposed semi-Markov stochastic model. It considers a heterogeneous network scenario consisting of both mobile and infrastructure nodes. The chapter investigates an software-defined network-inspired communication paradigm where infrastructure and opportunistic networks can efficiently interoperate. It argues that Opportunistic networks can bridge distant infrastructure networks using sophisticated routing protocols capable of detecting and exploiting user mobility patterns. The chapter also argues that Centralized infrastructure nodes can …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:gnsKu8c89wgC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Reliable transport protocols for delay tolerant networks: design and performance evaluation",
            "Publication year": 2012,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:LlXTz_FrCmAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting queueing delays in delay tolerant networks with application in space",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13174-0_18",
            "Abstract": "In this paper we present a study of queueing delays experienced in Delay Tolerant Networks with topology based on deterministic contact plan schedules. We examine a generic scenario and propose a sampling procedure that extracts measurements of queueing rates and queue lengths. Sampling queueing information is transmitted to network nodes, which then form time series and can be used to forecast future queueing rates. Through simulations we show that the introduced method can be useful for DTNs with predetermined contact schedules, such as the Interplanetary Internet, providing accurate end-to-end delivery delay predictions.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:2KloaMYe4IUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On transport layer mechanisms for real-time QoS.",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.81.6703&rep=rep1&type=pdf",
            "Abstract": "We study transport protocol performance from the perspective of real-time applications. More precisely, we evaluate TCP and UDP supportive role in terms of real-time QoS, network stability and fairness. A new metric for the evaluation of real-time application performance is proposed to capture both bandwidth and delay requirements. Using this metric as a primary criterion in our evaluation analysis, we reach several conclusions on the specific impact of wireless links, real-time traffic friendliness, and UDP/TCP protocol efficiency. Beyond that, we also reach an unexpected result: UDP traffic has occasionally negative impact compared with TCP traffic not only for the systemwide behavior, but also for the supporting application as well.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reliable Transport Protocols for Mobile Computing",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.29",
            "Abstract": "In recent years mobile computing has experienced significant growth, mainly due to the integration of wireless networks with the wired Internet. This integration itself experienced several stages of evolution: from the functional issues of network heterogeneity to the optimization of the Internet protocols. Currently, the design issues of reliable protocols for mobile computing possess a fundamental locus. More precisely, performance evaluation, throughput optimization, energy saving, and network/device functionality within the layered Internet call for further attention. Within this context, this special issue addresses the design concerns of reliable protocols for mobile computing.We have selected seven papers for presentation in the special issue, from a large pool of submitted papers in response to our call for papers. The first paper, authored by the guest editors, discusses open issues on the design of the dominant …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:GnPB-g6toBAC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "BOTTLENECK-QUEUE BEHAVIOR: How much can TCP know about it?",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=t9zOAwAAQBAJ&oi=fnd&pg=PA31&dq=info:Josj2nMzvD8J:scholar.google.com&ots=FdNlNINZlg&sig=hAx7NwJ6qzepg7JEsFCr40LBYkE",
            "Abstract": "We start off with an analysis on the effect of queuing delay on throughput. Departing from there, we claim that RTT alone is a better estimator than throughput. We investigate the potential of RTT-based metrics to approach the bottleneck queue behavior from TCP and we characterize the accuracy of our estimation.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Lulu. com"
        },
        {
            "Title": "UMOBILE D4. 5: Report on data collection and inference models",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=18003243002927999933&hl=en&oi=scholarr",
            "Abstract": "Background: This report is written in the framework of the UMOBILE project WP4 “Services enablement”, task 4.2 “Data Collection and Contextual Inference”. The task dealt with data mining in the networking context. Specifically, the task has worked upon i) devising mechanisms and tools that assist in the collection of data from sensors and other sources; ii) working on contextual awareness aspects relevant to networking in general, and to UMOBILE in particular; iii) the dissemination of the processed data to other UMOBILE services and modules, to assist in a future optimization of the network operation, based on contextualization. A relevant aspect worked in this task is the notion of usage contextualization and service personalization. A second relevant aspect concerns the capability to infer roaming behaviour in a way that keeps anonymity and privacy of the user as well as of the device. A third relevant aspect of …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:J6OZcwVsj5AC",
            "Publisher": "UMOBILE Consortium"
        },
        {
            "Title": "The dynamics of responsiveness and smoothness in heterogeneous networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1435512/",
            "Abstract": "Additive increase/multiplicative decrease-based protocols, including transmission control protocol (TCP), TCP-friendly, and a new generation of rate-based protocols, attempt to control the tradeoff of responsiveness and smoothness. Traditionally, smoothness has not been a main concern since it does not impact the performance of regular Internet applications such as the Web, FTP, or e-mail. However, multimedia-driven protocols attempt to favor smoothness at the cost of responsiveness. In general, smoothness and responsiveness constitute a tradeoff; however, we uncover undesirable dynamics of the protocols in the context of wireless/mobile networks with high-error rate or frequent handoffs: low responsiveness is not counterbalanced by gains in smoothness, but instead, produces a conservative behavior that degrades protocol performance with both delay-tolerant and -sensitive applications. Based on our …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A quality adaptation scheme for internet video streams",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72697-5_14",
            "Abstract": "We propose a layered quality adaptation scheme for video streams to smooth the short-term oscillations induced by Additive Increase Multiplicative Decrease (AIMD) mechanisms, and eventually refine the perceptual video quality. The layered scheme utilizes receiver buffering, adapting the video quality along with long-term variations in the available bandwidth. The allocation of a new layer is based on explicit criteria that consider the available bandwidth, as well as the amount of buffering at the receiver. Consequently, the adaptation mechanism prevents wasteful layer changes that have an adverse effect on user-perceived quality. In the sequel, we concentrate on the interactions of the layered approach with Scalable Streaming Video Protocol (SSVP). Exploiting performance measures related to the perceived quality of rate-adaptive video streams, we quantify the combination of SSVP rate control and …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "DTTP: a delay-tolerant transport protocol for space internetworks",
            "Publication year": 2008,
            "Publication url": "https://archive-ouverte.unige.ch/unige:72596/ATTACHMENT01#page=10",
            "Abstract": "We propose Delay-Tolerant Transport Protocol (DTTP) to address reliable data transfer in stressed network environments, such as space communications. Since existing TCP mechanisms do not work well (or at all) for such networks, new transport schemes are required. Intermittent connectivity in space environments calls for new transport approaches that smoothly adapt to the special networking conditions. DTTP is primarily a transport layer protocol and satisfies the inherent architecture requirements of Delay Tolerant Networking (DTN) in the absence of IP network infrastructure. It allows for reliable, efficient data transfer offering a number of application-oriented transmission strategies. Otherwise, when an IP architecture exists, DTTP operates as a standalone transport entity which interfaces with IP directly. We introduce the protocol's properties and functionality that enable its deployment in challenged networks. We conduct simulations that demonstrate the protocol's efficiency in scenarios with:(i) long propagation delays,(ii) minimum to relatively high packet error-rate, and (iii) intermittent connectivity.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AIMD for Asynchronous Networks",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=9645972961483921032&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On short packets first: a delay-oriented prioritization policy",
            "Publication year": 2009,
            "Publication url": "http://www.intersys-lab.org/media/papers/2008/tr-duth-ee-2008-8.pdf",
            "Abstract": "We propose a new scheduling discipline that allows for efficient interoperation of dedicated systems (such as sensor and voice networks) with the Internet. More precisely, our approach provides delay guarantees to applications that do not contribute to congestion because of their tiny packet sizes and low transmission rates. In addition, our approach uses a second level of prioritization that conditionally favors, in terms of delay, applications with slightly longer packets as well. Non-Congestive Queuing Plus (NCQ+) promotes applications that require comparatively small service times, as long as their total service times cause insignificant delays to other packets in the queue. Therefore, we prioritize packets, and in turn corresponding flows, according to their impact on total delay. We evaluate NCQ+ using ns-2 based experiments.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The interrelation of TCP responsiveness and smoothness in heterogeneous networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1021692/",
            "Abstract": "TCP(/spl alpha/,/spl beta/) protocols trade the congestion window increase value /spl alpha/ for the decrease ratio /spl beta/, to generate smoother traffic patterns and to maintain a friendly behavior. We study the design assumptions of TCP(/spl alpha/,/spl beta/) protocols and discuss the impact of equation-based modulation of /spl alpha/ and /spl beta/ on application efficiency. We confirm experimentally that, in general, smoothness and responsiveness constitute a tradeoff; however, we uncover undesirable dynamics of the protocols when the network or flow characteristics do not follow a prescribed and static behavior. For example, we show that smooth backward adjustments confine the protocol's capability to exploit resources that become available rapidly, and embarrass the fair and efficient growth of incoming flows. Furthermore, we show that in the context of wireless networks with high error rate, a low /spl …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Buffering... energy for mobile devices: A \"store and rendezvous\" approach",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-33936-8_9",
            "Abstract": "We exploit the traffic shaping potential of network storage and improve energy efficiency for mobile devices through the creation of idle communication intervals. We model the activity patterns between the WIRED/wireless gateway and the wireless battery-powered receiver, and employ a rendezvous mechanism that utilizes periods of inactivity created by the traffic shaping function of the network. In case multiple receivers are simultaneously active, a scheduling algorithm limits overlaps of buffer flushes. Our scenarios are based on the DTN paradigm, however, our approach is not DTN-specific. The presented simulation study involves three main types of Internet traffic (i.e. file transfer, streaming and web browsing) and demonstrates that our proposed scheme achieves significant energy conservation for mobile receivers involving, under most circumstances, only mild performance cost. ",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:JIEWM9yDoCIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Routing for opportunistic networks based on probabilistic erasure coding",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30630-3_22",
            "Abstract": "We investigate the problem of routing in opportunistic networks and propose a novel routing algorithm, which combines probabilistic routing with erasure coding. Erasure coding generates large amounts of code blocks with fixed overhead; we apply a sophisticated but realistic method to allocate the generated code blocks to nodes that relies on a probabilistic metric for evaluating node potential. Our goal is to enhance further the robustness of the erasure-coding based forwarding in worst-case delays but also in small-delay scenarios. We detail our algorithm and evaluate its performance against other well-known routing algorithms. We exploit scenarios with adequate resource storage as well as scenarios with limited storage capacity. In both cases, our algorithm yields promising results.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:olpn-zPbct0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "\"Connecting the Edges: A Universal, Mobile-Centric, and Opportunistic Communications Architecture,\"",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8291129/",
            "Abstract": "The Internet has crossed new frontiers with access to it getting faster and cheaper. Considering that the architectural foundations of today's Internet were laid more than three decades ago, the Internet has done remarkably well until today coping with the growing demand. However, the future Internet architecture is expected to support not only the ever growing number of users and devices, but also a diverse set of new applications and services. Departing from the traditional host-centric access paradigm, where access to a desired content is mapped to its location, an information-centric model enables the association of access to a desired content with the content itself, irrespective of the location where it is being held. UMOBILE tailors the information-centric communication model to meet the requirements of opportunistic communications, integrating those connectivity approaches into a single architecture. By …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:qhW0HyKmSusC",
            "Publisher": "IEEE Communications Magazine"
        },
        {
            "Title": "Evaluating TCP mechanisms for real-time streaming over satellite links",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11750390_6",
            "Abstract": "Real-time streaming over satellite IP networks is challenging, since satellite links commonly exhibit long propagation delays and increased error rates, which impair TCP performance. In this context, we quantify the effects of satellite links on TCP efficiency and streaming video delivery. We investigate a solution-framework composed by TCP implementations which are expected to perform adequately in such environments. Furthermore, we study the supportive role of Selective Acknowledgments (SACK). Along with protocol performance, we also evaluate the impact of delayed acknowledgments. Our simulation results illustrate that most existing end-to-end solutions do not comply with the stringent QoS provisions of time-sensitive applications, resulting in inefficient bandwidth utilization and increased delays in data delivery. Finally, with the absence of a satellite-optimized TCP implementation for real-time …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Wired/Wireless Internet Communications",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-642-21560-5.pdf",
            "Abstract": "The IFIP International Conference on Wired/Wireless Internet Communications (WWIC) was organized and hosted by the Advanced Network Architectures Lab (CRAAX) at the Technical University of Catalonia (UPC), in Vilanova i la Geltrú, Spain, during June 15–17, 2011. In this edition, the conference was for the first time technically sponsored by IFIP TC6. In particular, WWIC 2011 got the endorsement of WG 6.2 (Network and Internetwork Architectures) and WG 6.8 (Mobile and Wireless Communications). The conference attracted 50 submissions from 21 different countries in Asia, Europe, North America and Africa. All submitted papers went through a meticulous review by the Technical Program Committee members as well as other additional reviewers. After this strict review process, 22 high-quality papers were selected for publication in the conference proceedings as part of the IFIP",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer"
        },
        {
            "Title": "Delivery Time Estimation for Space Bundles",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6558026/",
            "Abstract": "We present a method for predicting delivery time of bundles in space internetworks. The bundle delivery time estimation (BDTE) tool exploits contact graph routing (CGR), predicts bundle route, and calculates plausible arrival times along with the corresponding probabilities. Latency forecasts are performed in an administrative node with access to an instrumentation database (DB) appropriate for statistical processing. Through both analysis and experimentation, we demonstrate that estimates of bundle earliest plausible delivery time and destination arrival probabilities can be provided.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Approaches to congestion control in packet networks",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Vassilis-Tsaoussidis/publication/2939228_Approaches_to_Congestion_Control_in_Packet_Networks/links/00b7d523c6991d472a000000/Approaches-to-Congestion-Control-in-Packet-Networks.pdf",
            "Abstract": "We discuss congestion control algorithms, using network awareness as a criterion to categorize different approaches. The first category (” the box is black”) consists of a group of algorithms that consider the network as a black box, assuming no knowledge of its state, other than the binary feedback upon congestion. The second category (” the box is grey”) groups approaches that use measurements to estimate available bandwidth, level of contention or even the temporary characteristics of congestion. Due to the possibility of wrong estimations and measurements, the network is considered a grey box. The third category (” the box is green”) contains the bimodal congestion control, which calculates explicitly the fairshare, as well as the network-assisted control, where the network communicates its state to the transport layer; the box now is becoming green.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The impact of chunk size on Named Data Networking performance",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9350754/",
            "Abstract": "Internet usage has evolved during the years towards accessing content, regardless of its location. The Named Data Networking architecture was designed to satisfy that need and replace today’s host-centric TCP/IP stack by placing named content at the core of the architecture. In this paper, we provide the first evaluation specifically targeting the impact of packet size in NDN performance. Our results show the impact of chunk sizes is far from negligible; it clearly affects NDN performance as measured by metrics such as throughput, delay, cache hits and cache entry lifetime. Attention should, therefore, be given to the selection of an appropriate chunk size in NDN deployments.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ibZ2AwG9z6wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient network management for collaborative services and application development",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/869544/",
            "Abstract": "Collaborative services and applications are becoming increasingly important and complex, and have requirements for real-time multimedia support, high bandwidth availability and low delays. The collaborative application view of QoS encompasses the transport network and the end systems, as well as computational requirements. Therefore, how to coordinate and integrate collaboration management and network resource sharing efficiently and effectively is becoming more complex: a higher-level functionality is required in parallel with a satisfying performance. The functionality should satisfy the requirements of different levels of collaboration and respect a hierarchy of priorities among users and tasks. The performance, depending on the application or the network, should be sufficient for real-time information exchange, which is quite often a \"heavy data exchange\". We have developed a management framework …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wired/Wireless Internet Communications: Second International Conference, WWIC 2004, Frankfurt/Oder, Germany, February 4-6, 2004, Proceedings",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=RS_3BwAAQBAJ&oi=fnd&pg=PA1&dq=info:US3SAUFkYa8J:scholar.google.com&ots=F1VEWTHmVb&sig=roQmnRaLQfq9PFhDFH8NH2RiYzM",
            "Abstract": "TheInternationalConferenceonWired/WirelessInternetCommunications (WWIC) was held for the second time, following a successful start in 2002, in LasVegas. The goal of theconferencewastopresenthigh-qualityresultsinthe? eld, andtoprovideaframework for research collaboration through focused discussions that designated future research efforts and directions. The number and the quality of submissions indicate that we are well on the way to establishing WWIC as a major event in the? eld of wired/wireless internet communications. We received around 60 competitive submissions from Europe, North America, the Middle East and the Far East. Each submission was reviewed by at least two experts, although the majority received three or more reviews. Based on this rigorous reviewing procedure, the International Program Committee selected 26 submissions for presen-tion and publication in the proceedings. Therefore, we should all expect the quality of a selective conference in this volume. We hope you will enjoy it. The papers selected for presentation at WWIC 2004 were stimulating and of utmost interest. They were organized into eight sessions: 1. Protocol engineering and energy ef? ciency in wireless networks 2. Mobility management and mobile devices 3. Transport layer and congestion control 4. Architecture, implementation and experimentation 5. Network and protocol modeling 6. Wireless network scheduling and analysis 7. Multimedia distribution and group communication 8. Service discovery. We would like to thank the authors for choosingWWIC 2004 to submit their results. We would also like to thank all the members of the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:_B80troHkn4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Experiments with adaptive error recovery strategies",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/935430/",
            "Abstract": "We report results on the efficiency of error recovery strategies over heterogeneous networks with both wired and wireless components. We investigate the relative impact of end-to-end delays and error patterns on protocol performance for three broad categories of protocol behavior: aggressive, conservative and adaptive. We monitor the network behavior using varying error conditions and we set end-to-end delays ranging from 10 to 200 ms in order to capture delay characteristics of wired, wireless and satellite networks. We show that (i) the end-to-end delay has varying impact on protocol performance. This impact depends on the recovery strategy, the error rate and the error type. (ii) Standard TCP Reno and Tahoe mechanisms that implement their respective recovery strategies display conflicting patterns of behavior, that might not conform to network conditions nor to their strategic goals. (iii) Adaptive behavior …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "QRP04-4: End-to-end Congestion Management for Real-Time Streaming Video over the Internet",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4151068/",
            "Abstract": "In this paper, we propose a new transport protocol, namely scalable streaming video protocol (SSVP), which employs an AIMD-oriented congestion control mechanism. SSVP, in a complementary role, operates on top of UDP and is specifically designed to support unicast video streaming applications. The transmission rate is controlled by properly adjusting the inter- packet-gap, spacing outgoing packets evenly to produce a smoothed flow. SSVP attempts to optimize the performance of streaming video delivery with concern to friendliness with interfering traffic. Quantifying SSVP's performance, we identify that the protocol utilizes a higher fraction of the available bandwidth, and maintains a regular transmission rate with oscillations of a smaller magnitude in comparison with existing congestion control schemes.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast convergence to network fairness",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121209003094",
            "Abstract": "Most AQM algorithms, such as RED, assure fairness through randomness in congestion notification. However, randomness results in fair allocation of network resources only when time limitations are not considered. This is not compatible with the current Internet, where traffic oscillations are frequent and the demand for fair treatment is rather urgent, due to short duration of most applications. Given the short duration of most modern Internet applications, fast convergence to fairness is necessitated. In this paper, we use fairness as the major criterion to adjust traffic and present a corresponding algorithm of active queue management, which is called Explicit Global Congestion Notifier (EGCN). EGCN notifies flows almost simultaneously about incipient congestion by marking packets arriving at the router’s queue, when the load in the network increases and buffer overflow is expected. This is a new approach compared …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Exploiting communication opportunities in disrupted network environments",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22572-2_13",
            "Abstract": "The capability of a mobility model to detect certain patterns of user behavior (e.g., favorite walks or walking habits) enables solutions for a number of challenging networking problems, including efficient opportunistic communications and handoff/cellular planning. We argue that the limited viewpoint of a single mobile node and its scarce resources (e.g., energy, memory or processing) are major obstacles for accurate estimations. Targeting at hybrid network environments, we offload prediction capabilities to the fixed nodes that may be available in the area, offering a global view and the capability of resource-demanding calculations.Here, we introduce a solution running on top of the infrastructure nodes that: (i) implements a mobility model which provides a number of mobility forecasts to the mobile users in the area, (ii) supports proactively the routing decisions of opportunistic mobile devices …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Enhancing space data exploitation through advanced data routing protocols",
            "Publication year": 2012,
            "Publication url": "http://www.helas.gr/conf/2011/posters/S_1/anastasiadis_2.pdf",
            "Abstract": "Data sharing and access are major issues in space sciences, as they influence the degree of data exploitation. The project “Space-Data Routers”, which was initiated recently, has the aim of allowing space agencies, academic institutes and research centres to share space-data generated by single or multiple missions, in an efficient, secure and automated manner. The approach of “Space-Data Routers” relies on space internetworking–and in particular on Delay-Tolerant Networking (DTN), which marks the new era in space communications, unifies space and earth communication infrastructures and delivers a set of tools and protocols for space-data exploitation. The project has started with defining limitations currently imposed by typical space mission scenarios, in which the National Observatory of Athens (NOA) is currently involved, including space exploration, planetary exploration and Earth observation missions. Here we are presenting the mission scenarios and the associated major scientific objectives of “Space-Data Routers”, with an emphasis on the Sun-Earth connection and the Mars hyperspectral imaging spectroscopy scenarios. In the case of the Sun-Earth connection scenario, we plan to test and validate the capabilities of Space-Data Routers in providing: a) Simultaneous real-time sampling of space plasmas from multiple points with cost-effective means and measuring of phenomena with higher resolution and better coverage to address outstanding science questions and b) Successful data transmission even in hostile communication conditions. In the case of the Mars hyperspectral imaging spectroscopy scenario we plan to test …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wired/Wireless Internet Communications",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/b136247.pdf",
            "Abstract": "Welcome to the 3rd International Conference on Wired/Wireless Internet Communications (WWIC). After a successful start in Las Vegas and a selective conference in Germany, this year’s WWIC demonstrated the event’s maturity. The conference was supported by several sponsors, both international and local, and became the official venue for COST Action 290. That said, WWIC has now been established as a top-quality conference to promote research on the convergence of wired and wireless networks.This year we received 117 submissions, which allowed us to organize an exciting program with excellent research results, but required more effort from the 54 members of the international Program Committee and the 51 additional reviewers. For each of the 117 submitted papers we asked three independent reviewers to provide their evaluation. Based on an online ballot phase and a TPC meeting organized in …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling free Internet access at the edges of broadband connections: a hybrid packet scheduling approach",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/2581555.2581564",
            "Abstract": "Broadband connection sharing constitutes a network resource pooling technique that could evolve toward supporting the establishment of the “Free Internet for all” notion. This technique could be implemented through the User-Provided Network model in which end-users could become suppliers of Internet connectivity. In this paper, the behavior of such system is investigated from a queuemanagement perspective. A numerical analysis that takes into consideration both the high variability of broadband link speeds and different packet-size distributions is presented. Based on these results, we propose a hybrid packet scheduling scheme that enables the application of Lessthan-Best-Effort services at the connection edges and allows for the development of different packet scheduling policies corresponding to different requirements. Some significant open issues and research directions are also highlighted.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "ACM"
        },
        {
            "Title": "A new approach to service differentiation: non-congestive queuing",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/46184477/A_new_approach_to_Service_Differentiatio20160602-9972-45przv.pdf",
            "Abstract": "We evaluate a new approach to service differentiation, based on distinguishing congestive and non-congestive data. We initially define as non-congestive data only minimal-size packets, which do not contribute to congestion themselves, but, however, do suffer delays caused by larger packets. Case examples of such data are typical sensor data. Non-Congestive Queuing (NCQ) needs not follow a state-full approach to traffic differentiation. We show that (i) non-congestive data gets a much better service from the network,(ii) congestive data suffers no extra delays; instead, both fairness and efficiency are occasionally improved due to lower contention. Having more flows finishing early may lead to better resource sharing.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing video streaming delivery over wired/wireless networks",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.103.9200&rep=rep1&type=pdf",
            "Abstract": "Delivering streaming video over wired/wireless networks is challenging, since link errors commonly compromise throughput performance, smoothness, and eventually impair the perceptual video quality. We combine an efficient Additive",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficiency of TCP-friendly window adjustment strategies in wired/wireless networks",
            "Publication year": 2002,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4868/0000/Efficiency-of-TCP-friendly-window-adjustment-strategies-in-wired-wireless/10.1117/12.475263.short",
            "Abstract": "TCP(a,b) protocols parameterize the congestion window increase value   and decrease ratio , motivated by the QoS requirements of multimedia applications for smooth rate adjustments. Based on a projection of the expected throughput of standard TCP(1,.5), modified versions of the protocol have been designed to generate smoother traffic patterns and to maintain a friendly behavior. In this paper, we study the design assumptions of TCP(a,b) and we discuss the impact of equation-based modulation of a and b on application efficiency. We confirm experimentally that, in general, smoothness and responsiveness constitute a tradeoff; however, we uncover undesirable dynamics of the protocols when the network is heterogeneous (wired/wireless) or the flow characteristics do not follow a prescribed and static behavior. For example, we show that smooth backward adjustments confine the protocol's capability to exploit …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:O3NaXMp0MMsC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Structural health monitoring system for bridges based on skin-like sensor",
            "Publication year": 2017,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1757-899X/236/1/012100/meta",
            "Abstract": "Structural health monitoring activities are of primal importance for managing transport infrastructure, however most SHM methodologies are based on point-based sensors that have limitations in terms of their spatial positioning requirements, cost of development and measurement range. This paper describes the progress on the SENSKIN EC project whose objective is to develop a dielectric-elastomer and micro-electronics-based sensor, formed from a large highly extensible capacitance sensing membrane supported by advanced microelectronic circuitry, for monitoring transport infrastructure bridges. Such a sensor could provide spatial measurements of strain in excess of 10%. The actual sensor along with the data acquisition module, the communication module and power electronics are all integrated into a compact unit, the SENSKIN device, which is energy-efficient, requires simple signal processing and it is …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:DwWRdx-KAo4C",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Exploiting the adaptive properties of a probing device for TCP in heterogeneous networks",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366402001342",
            "Abstract": "End-to-end protocols lack the functionality to efficiently adjust their error control strategies to the distinct characteristics of network environments and to specific constraints of communicating devices. In the context of heterogeneous networks, error control needs to be responsive to the nature of the errors spanning a conservative-through-to-aggressive behavioral spectrum. In the context of mobile, battery-powered devices, the recovery strategy should yield good performance with a minimal transmission effort. We exploit the potential of a probing device to implement an adaptive error control strategy efficiently by shaping data transmission to be assorted with the distinctive characteristics of the underlying wired or wireless network components. We graft our mechanism onto standard TCP; we present encouraging experimental results with wired, wireless and mobile networks.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Information-centric routing for opportunistic wireless networks",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3267955.3269011",
            "Abstract": "This poster describes DABBER, a protocol developed to extend the reach of Named Data Networking into wireless environments. Our key contribution lies in the fact that DABBER supports communication in opportunistic wireless environments by relying on data reachability metrics that take into consideration availability and centrality of adjacent nodes, as well as the availability of different data sources. The poster provides an overview to the DABBER architecture, and of the available open-source implementation.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:8rLWgkbgOXQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards flexibility and accuracy in space DTN communications",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2505494.2505499",
            "Abstract": "Although Interplanetary Telecommunications rely on preconfigured contact schedules to make routing decisions, there is a lack of appropriate mechanisms to notify the network about contact plan changes. In order to fill this gap, we propose and evaluate a framework for disseminating information about queueing delays and link disruptions. In this context, we present such a mechanism, focusing not only on its functional properties, but rather on its impact objectives: to improve accuracy and routing performance. Supportively, we couple this mechanism with a DTN-compatible protocol, namely Contact Plan Update Protocol (CPUP), which implements our dissemination policy. Through simulation of space scenarios we show that accuracy can be significantly improved in all cases while routing performance can achieve a wide range, from minor through to significant gains, conditionally.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A new service differentiation scheme: size based treatment",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4652631/",
            "Abstract": "The increase of real-time applications as well as the vast usage of portable wireless devices has led to a corresponding increase of real-time traffic with strict bandwidth and delay requirements. In order to satisfy the requirements of various applications we typically use service differentiation. However, as new real-time applications are created, their portion of the total traffic increases, thus making more and more difficult to satisfy completely their requirements. In this paper we propose a new scheme, which is based on the axiom that dasiadifferent types of applications typically utilize different packet sizespsila. With size based treatment (SBT) different packet sizes are dropped with different probability by the queue. Small sized packets can benefit and transmit on higher rates, increasing the total system fairness.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Packet size and DTN transport service: Evaluation on a DTN testbed",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5676669/",
            "Abstract": "We present a study of DTN transport layer service, evaluating its performance during a file transmission from a Mars relay satellite towards Earth. The experiments are being held in a DTN Testbed designed and implemented for emulating and evaluating deep-space communications. Bundle Protocol truncates application data into bundles of different size and Licklider Transmission Protocol is used as the convergence layer protocol, encapsulating bundles into blocks and fragmenting blocks into segments. Bundle size, LTP block size and segment size are under consideration to achieve better transmission in terms of delivery time, overhead and memory occupancy at the sending node. Our most interesting conclusion is that memory is released faster when using small bundles and LTP blocks. We also conclude that segments should be close to the maximum boundary of underlying layer's MTU, and that ignoring …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Performance of Reliable Transport Protocols over Wide Area Networks.",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=544208698736801695&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D5. 1 “Validation methodology and evaluation report”",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=17056466263885955093&hl=en&oi=scholarr",
            "Abstract": "Work Package 5 “Overall platform integration and validation” of UMOBILE project evaluates the solutions developed in the project. This Report is written in the framework of Tasks 5.1 “Definition of the validation of the setup” and 5.2: “Evaluation through Simulation and Emulation” of UMOBILE project. These two tasks aims at validating the architecture and services, derived from results developed in WP3 and WP4. The ultimate objective of UMOBILE is to advance networking technologies and architectures towards the conception and realization of Future Internet. In particular, UMOBILE extends Internet (i) functionally – by combining ICN and DTN technologies within a new architecture -, (ii) geographically – by allowing for internetworking on demand over remote and isolated areas – and (iii) socially – by allowing low-cost access to users but also free user-to-user networking.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:rJyh6hJnyfgC",
            "Publisher": "H2020 UMOBILE"
        },
        {
            "Title": "On the efficiency and fairness of AIMD-based congestion avoidance algorithms",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/46184512/On_the_Efficiency_and_Fairness_of_AIMD-b20160602-23750-6rru8t.pdf",
            "Abstract": "A major problem in packet networks is congestion. It is usually caused at the bottleneck links where packets get multiplexed. If packets arrive at a faster rate than the link can transmit them, they tend to overload the link and any new incoming packet will get lost. A prolonged congested link affects negatively the performance of the whole network system and applications. For example, in reference [45] and [23] the authors report the same problems caused by congestion in two different packet networks, the DARPANET (which now is named Internet and is a conglomerate of packet networks–private and public) and DECNET. The practice has shown that congestion avoidance techniques are crucial for the normal operation of the network system (see references [23, 45] for example).Many congestion avoidance techniques have been proposed, but the one that has gained ground is the AIMD (Additive Increase Multiplicative Decrease). It was studied theoretically in [23] in terms of congestion avoidance and fairness, and experimentally, in terms of congestion avoidance, in [45]. The principle of this algorithm is to increase the sending rate of the flows when the network is not congested, and to decrease it drastically when congestion occurs. Since it was already coded into TCP by Jacobson, and TCP established a standard interface for reliable transport protocols, the AIMD became the de-facto congestion avoidance mechanism of the Internet. Another strong reason for the acceptance of this algorithm is that its congestion avoidance process is executed entirely at the end-hosts (eg users terminals) rather than using complex schemes at the network nodes …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of CCSDS file delivery protocol over Delay Tolerant Networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5286338/",
            "Abstract": "Space communications enter a new era where a multihop architecture is being exploited and an increasing number of alternative communication paths may be available. Current space applications, such as CFDP for file transfer, rely on static routing and can not efficiently perform in these challenging environments. The most promising solution is the emerging delay tolerant networking (DTN) architecture and the accompanying bundle protocol which allow for reliable store-and-forward message switching, custody transfer and dynamic routing. However, a space-oriented file transfer protocol for DTN is required. In this work, we integrate CFDP with ION (a bundle protocol implementation produced by the Jet Propulsion Laboratory) and evaluate its performance in a DTN testbed.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Why TCP timers (still) don’t work well",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128606002805",
            "Abstract": "We argue that the design principles of the TCP timeout algorithm are based solely on RTT estimations and may lead to flow synchronization, unnecessary retransmission effort and unfair resource allocation. We present a new Window-Based Retransmission Timeout algorithm (WB-RTO) for TCP, which exhibits two major properties: (i) it cancels retransmission synchronization, which dominates when resource demand exceeds resource supply and (ii) it reschedules flows on the basis of their contribution to congestion. WB-RTO achieves better fairness and slightly better goodput with significant less retransmission effort.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:WF5omc3nYNoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On the Efficiency and Fairness of Protocol Recovery Strategies in Networks with Wireless Components",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=6847163636689434594&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shaping TCP Traffic in Heterogeneous Networks",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.74.2710&rep=rep1&type=pdf",
            "Abstract": "In this paper, we depart from TCP-Probing [13, 14] and propose an experimental transport protocol that has energy and throughput performance gains in both wired and wireless environments. Our approach decouples error recovery from contention estimation and focuses on how these two mechanisms can (i) feed the decision process and (ii) implement the protocol strategy by shaping traffic, accordingly. We use a validation mechanism, which possibly uncovers previous wrong estimations. Our analysis matches well our simulation results, which are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CA-RTO: a contention-adaptive retransmission timeout",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1523838/",
            "Abstract": "We show that TCP timers, based solely on RTT estimations and measurements, cannot capture with precision the level of flow contention. We notice that increased contention may stabilize RTT variation, minimize the deviation and, in turn, shorten the timeout. We show that this behavior is undesirable indeed, since it leads to unfair resource utilization. We propose CA-RTO, an algorithm that incorporates a contention parameter and a randomization technique into the retransmission timeout. We report significant improvement in fairness, great reduction of retransmitted packets and slight improvements in application goodput.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Protocol behavior: More effort, more gains?",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1370849/",
            "Abstract": "We investigate the behavior of TCP(/spl alpha/,/spl beta/) protocols in the presence of wireless networks. We seek an answer to strategic issues of maximizing energy and bandwidth exploitation, without damaging the dynamics of multiple-flow equilibrium. Our perspective is novel indeed: What is the return of the effort that a protocol expends? Can we achieve more gains with less effort? We study first the design assumptions of TCP(/spl alpha/,/spl beta/) protocols and discuss the impact of equation-based modulation of /spl alpha/ and /spl beta/ on protocol efficiency. We introduce two new metrics to capture protocol behavior: The \"extra energy expenditure\" and the \"unexploited available resource index\". We confirm, by simulation experiments, that, in general, smoothness and responsiveness constitute a tradeoff; however, we show that this tradeoff does not graft its dynamics into a conservative/aggressive behavior …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the performance of erasure coding over space dtns",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30630-3_23",
            "Abstract": "Erasure coding has attracted the attention of space research community due to its potential to present an alternative or complementary solution to ARQ schemes. Typically, erasure coding can enhance reliability and decrease delivery latency when long delays render ARQ-based solutions inefficient. In this paper, we explore the benefits of erasure coding for file transfers over space Delay Tolerant Networks, using a generic end-to-end mechanism built on top of the Bundle Protocol that incorporates LDPC codes along with an ARQ scheme. The results reveal significant insights on the tradeoff among efficient bandwidth exploitation and delivery latency. We quantify the performance gains when optimal erasure coding is applied and investigate in what extent theoretically optimal performance is affected when suboptimal code rates are used. Beyond that, we highlight the ability of erasure coding to provide …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "CARPOOL: Connectivity Plan Routing Protocol",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13174-0_21",
            "Abstract": "Basic Internet access is considered a human right, however geographical, technological and socio-economic reasons set barriers to universal Internet access. To address this challenge, we have proposed an access method based on message ferrying that enables free delay-tolerant Internet access to all, and developed Connectivity plAn Routing PrOtOcOL (CARPOOL), a reference routing protocol for the proposed access method. In this paper, we describe CARPOOL in depth and evaluate its performance for increasing traffic load. Focusing on an urban scenario, where means of public transport, such as buses, follow predefined routes and schedules, CARPOOL utilises a priori knowledge about their current location to extend Internet access provided by hotspots to users and areas that are not typically covered. Our simulation results show that CARPOOL effectively exploits the existing connectivity plan of …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluation of transport services for VoIP",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4024241/",
            "Abstract": "We study transport protocol performance from an application-specific perspective. Initially, we focus on TCP and UDP supportive role in the context of VoIP performance. Applying our metric for real-time performance, we discover that UDP has limited efficiency. Beyond UDP/TCP, we evaluate a solution-framework based on TCP protocols which incorporate variable congestion mechanisms. We also investigate VoIP traffic friendliness, as well as potential tradeoffs between protocol performance and fairness. Furthermore, we evaluate VoIP quality and protocol sensitivity versus a range of QoS parameter adjustments.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Διαδίκτυο κατ' απαίτηση: Γεωγραφική επέκτασή του",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:d6JCS5z0ckYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "TCP smoothness and window adjustment strategy",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1632044/",
            "Abstract": "We observe that even when the system throughput is relatively stable,end users of media-streaming applications do not necessarily experience smooth throughput, due to the unsynchronized window adjustments triggered by random congestion indications. We analyze and evaluate the negative impact of random window adjustments on smoothness, short-term fairness, and long-term fairness. We further propose an experimental congestion avoidance mechanism, namely TCP(/spl alpha/, /spl beta/, /spl gamma/, /spl delta/), based on coordinated window adjustments. The flow-level smoothness is enhanced significantly for media-streaming applications, without a cost on fairness and responsiveness. Responsiveness is even boosted when bandwidth is underutilized.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Deep-space transport protocol: a novel transport scheme for space DTNs",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366409000565",
            "Abstract": "The Delay-/Disruption-Tolerant Networking Architecture calls for new design principles that will govern data transmission and retransmission scheduling over challenged environments. In that context, novel routing, transport and application layer algorithms have to be established in order to achieve efficient and reliable communication between DTN-nodes.In this study, we focus on the evolution of the terrestrial Internet into the Interplanetary or Space Internet and propose adoption of the Deep-Space Transport Protocol (DS-TP) as the transport layer scheme of choice for the space networking protocol stack. We present DS-TP’s basic design principles and we evaluate its performance both theoretically and experimentally. We verify that practice conforms with theory and observe great performance boost, in terms of file delivery time between DTN-nodes, in case of DS-TP. In particular, the gain of DS-TP against …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "On TCP performance over asymmetric satellite links with real-time constraints",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036640700028X",
            "Abstract": "Real-time transmission over asymmetric satellite IP links is challenging, since satellite systems commonly exhibit long propagation delays, while bandwidth asymmetry often enforces a variable and infrequent rate of acknowledgment packets (ACKs) across the upstream channel with several undesirable implications. In this context, we formulate an analytical model in order to quantify the impact of satellite systems and link asymmetry on TCP performance and real-time delivery. We emphasize on the effects of asymmetric links, and especially on the implications that cause interruptions in the sending rate, and eventually disturb smooth delivery. Since TCP performance is in part throttled by the rate of arriving ACKs, we additionally investigate the impact of delayed ACKs. Although delayed ACKs occasionally diminish the transmission rate, we uncover notable gains in terms of smoothness and real-time delivery …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Queue-management architecture for delay tolerant networking",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21560-5_39",
            "Abstract": "During the last years, the interest in Delay/Disruption Tolerant Networks has been significantly increased, mainly because DTN covers a vast spectrum of applications, such as deep-space, satellite, sensor and vehicular networks. Even though the Bundle Protocol seems to be the prevalent candidate architecture for delay-tolerant applications, some practical issues hinder its wide deployment. One of the functionalities that require further research and implementation is DTN queue management. Indeed, queue management in DTN networks is a complex issue: loss of connectivity or extended delays, render occasionally meaningless any pre-scheduled priority for packet forwarding. Our Queue-management approach integrates connectivity status into buffering and forwarding policy, eliminating the possibility of stored data to expire and promoting applications that show potential to run smoothly. Therefore, our …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Bulk Data Transfers through an Airline Delay-Tolerant Network",
            "Publication year": 2015,
            "Publication url": "https://www.academia.edu/download/40019429/icsnc_2015_full.pdf#page=131",
            "Abstract": "In the era of big data, the Internet engineering community is searching for solutions to alleviate the issues caused by the constantly increasing data traffic. In this paper, we attempt to revive the sneakernet paradigm as a possible solution for non-real-time bulk data transfers. We propose a sample network architecture that takes advantage of the existing worldwide airline infrastructure, and leverages Delay-Tolerant Networking architecture to transfer data over the air in an automated way. We exploit Contact Graph Routing algorithm, which utilizes flight schedules to route bundles based on delivery delay or cost minimization. We examine the applicability of our proposal in a scenario that includes bulk space-data transfers between ESA data centers. Through simulations, we illustrate that the proposed scheme can deliver data efficiently between connected data centers, while the achieved throughput increases with the amount of data transmitted.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:aU4yMueWZ3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introducing size-oriented dropping policies as QoS-supportive functions",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5412870/",
            "Abstract": "The continuous increase of Internet users worldwide, as well as the extensive need to support real-time traffic and bulk data transfers simultaneously, has directed research towards service differentiation schemes. These schemes either propose techniques that provide users with the necessary quality guarantees or follow a \"better-than-best-effort\" approach to satisfy broadly the varying needs of different applications. We depart from our new service principle called Less Impact Better Service (LIBS) and propose a novel service differentiation method, namely size-oriented dropping policies, which uses packet size to categorize time-sensitive from delay-tolerant flows and prioritize packet dropping probability, accordingly. Unlike existing proposals, the distinction of flows is dynamic and the notion of packet size is abstract and comparative; a packet size is judged as a unit within a dynamic sample space, that is, current …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The interrelation of TCP Responsiveness and Smoothness",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.1300",
            "Abstract": "TCP (#,#) protocols trade the congestion window increase value# for the decrease ratio#, to generate smoother traffic patterns and to maintain a friendly behavior. In this paper, we study the design assumptions of TCP (#,#) protocols and discuss the impact of equationbased modulation of# and# on application efficiency. We confirm experimentally that, in general, smoothness and responsiveness constitute a tradeoff; however, we uncover undesirable dynamics of the protocols when the network or flow characteristics do not follow a prescribed and static behavior. For example, we show that smooth backward adjustments confine the protocol's capability to exploit resources that become available rapidly, and embarrass the fair and efficient growth of incoming flows. Furthermore, we show that in the context of wireless networks with high error rate, a low# dictates a conservative behavior that degrades the protocol performance with both delay-tolerant and-sensitive applications; and in the context of high contention of heterogeneous flows, a low# does not contribute to efficiency and friendliness. 1.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ZOYfmFL0FrgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A receiver-centric rate control scheme for layered video streams in the Internet",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121208000514",
            "Abstract": "We present a new end-to-end protocol, namely Dynamic Video Rate Control (DVRC), which operates on top of UDP and enables the adaptive delivery of layered video streams over the Internet. The protocol optimizes the performance on video delivery with concern to friendliness with interfering traffic. DVRC enables a closed-loop control between server and client, where the receiver detects the state of congestion, determines the proper transmission rate, and eventually opts for the optimal number of layers that should be delivered according to this rate. The protocol relies on a hybrid Additive Increase Additive Decrease (AIAD)/Additive Increase Multiplicative Decrease (AIMD) algorithm (namely AIAMD) that manages to differentiate congestive and non-congestive loss by utilizing history in its control rules. AIAMD combines the most desirable features of AIAD and AIMD, reacting gently to random loss and more …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fast-fair handling of flows",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCNDS.2017.081443",
            "Abstract": "Allocating fairly the maximum available bandwidth among competing flows is an important problem as it allows maximising system throughput and fairness. Given the dynamic nature of traffic load in current internet and the short duration of most modern applications, fast convergence to fairness is necessitated. In this paper, we use fairness as the major criterion to adjust traffic and present a novel congestion control scheme which allows each flow independently to estimate efficiently: 1) its deviation from the fair-share; 2) adjust its window to its fair-share. In our model, no flow is aware of the number of competitors in the channel, no flow is aware of the bandwidth and buffer capacity; however, the system reaches to equilibrium state fast, based on throughput measurements. Simulation results confirm that the proposed congestion scheme promotes fast system fairness without damaging system efficiency and …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:eIKNFFVQvJAC",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "TCP-probing: towards an error control schema with energy and throughput performance gains",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/896288/",
            "Abstract": "Today's universal communications increasingly involve mobile and battery-powered devices (e.g. hand-held, laptop) over wired and wireless networks. Energy efficiency as well as throughput, are becoming service characteristics of dominant importance in communication protocols. Although standard TCP versions lack the functionality to efficiently adjust their error-control strategies to distinct characteristics of network environments and to specific constraints of communicating devices, the wide range of TCP-based applications have rendered TCP the de facto standard for reliable end-to-end communications. In this work we propose \"grafting\" two components of strategic significance onto standard TCP: a probing mechanism and an immediate recovery strategy. Our results show that these enhancements yield higher throughput while maintaining lower levels of energy expenditure, and thus have the potential of …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the impact of guest traffic in open-access domestic broadband sharing schemes",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1806.02410",
            "Abstract": "Open-access domestic broadband connection sharing constitutes a voluntary practice that is associated with societal, economic and public-safety benefits. Despite this fact, broadband subscribers are usually hesitant to freely share their broadband connection with guests for a multitude of reasons; one of them being sharing their network might hinder their own broadband quality of experience. In this paper, we investigate experimentally the impact of uplink guest traffic on the sharer's broadband quality of experience under both generic and broadband-sharing-specific packet scheduling policies. Both guest-user traffic and access point profiles employed in our study are developed by analyzing real-world traffic traces and measurements, captured from actual broadband sharing networking environments. Our results validate the suitability of hybrid packet scheduling policies for broadband sharing schemes and show that only a few dozen kilobytes per second of uplink guest traffic can be tolerated by sharers without hampering their broadband quality of experience. In this context, we show that the selection of the most appropriate packet scheduling policy for broadband sharing, as well as its respective configuration, depend largely on the capacity of the broadband connection and the policy's packet-dropping behavior on guest traffic.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:E2bRg1zSkIsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Skin-like Sensor Enabled Bridge Structural Health Monitoring System",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:lSLsV1MU4ZUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive Head-to-Tail: Active Queue Management based on implicit congestion signals",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366408005446",
            "Abstract": "Active Queue Management is a convenient way to administer the network load without increasing the complexity of end-user protocols. Current AQM techniques work in two ways; the router either drops some of its packets with a given probability or creates different queues with corresponding priorities. Head-to-Tail introduces a novel AQM approach: the packet rearrange scheme. Instead of dropping, HtT rearranges packets, moving them from the head of the queue to its tail. The additional queuing delay triggers a sending rate decrease and congestion events can be avoided. The HtT scheme avoids explicit packet drops and extensive retransmission delays. In this work, we detail the HtT algorithm and demonstrate when and how it outperforms current AQM implementations. We also approach analytically its impact on packet delay and conduct extensive simulations. Our experiments show that HtT achieves better …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Experimental Methodologies for Evaluating congestion Control.",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=15529459099730334686&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Energy/Throughput Tradeoffs of TCP Error Control Strategies",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=8944534884543803265&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:URolC5Kub84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "WB-RTO: a window-based retransmission timeout",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.210.7153&rep=rep1&type=pdf",
            "Abstract": "CA-RTO: A Contention-Adaptive Retransmission Timeout Page 1 WB-RTO: A Window-Based \nRetransmission Timeout Ioannis Psaras, Vassilis Tsaoussidis Demokritos University of Thrace, \nXanthi, Greece Page 2 COMputer NETworks Group (COMNET) 2 Motivation and Contribution  \nWe observe that retransmission scheduling affects transmission scheduling  WB-RTO results \nin:  50% less retransmitted pkts  Higher Goodput, and  Better Fairness than TCP-RTO \nTCP-RTO WB-RTO Page 3 COMputer NETworks Group (COMNET) 3 Motivation-Contribution \n Perspective:  When contention increases, the timeout becomes the scheduler for the link. \n Motivation:  When contention is high, all flows measure similar RTTs.  TCP-RTO should \nnot be solely based on RTT measurements.  Congestion events cause retransmission \nsynchronization.  Algorithm:  Approximation of the current level of network  of the . …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Some open issues on internetworking for the next generation",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366404000118",
            "Abstract": "In this survey we focus on open issues of the wireless Internet. Our main intention is to elaborate what has to be done to integrate mobile devices in the Internet in such way that users do not experience any difference between wireless and fixed connections. We concentrate on the layers on top of IP, i.e. transport protocols, middleware platforms and applications. We provide an overview of existing solutions and a discussion of open issues andpromising research directions is given for each of these fields.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Experimental assessment of RED in wired/wireless networks",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.643",
            "Abstract": "The Internet is a heterogeneous environment comprising wired and wireless components, and transport protocols with different error recovery strategies. We use simulations to study the behaviour of random early detection (RED) gateways in such heterogeneous environments. We investigate two issues: (i) the performance trade‐offs of the dropping policy of RED over Drop‐Tail's, and (ii) the impact of RED's active queue management on more sophisticated protocols such as TCP‐SACK. Some of our results indicate that RED does not deal adequately with heterogeneity. In particular, it may happen that RED applies congestion avoidance techniques even when wireless errors force some senders to back off prior to actual congestion. Our scenarios involve a non‐monotonic transmission behaviour of transport protocols within one and the same congestion epoch; RED may escalate further bandwidth under …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:3fE2CSJIrl8C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "CARPOOL: extending free internet access over DTN in urban environment",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2502880.2502891",
            "Abstract": "In order to address the challenge of digital exclusion, we introduce an access method based on message ferrying that enables free delay-tolerant Internet access to all. Targeting an urban scenario, where means of public transport, such as buses and trams, follow a predefined route and schedule, we utilise a priori knowledge about their current location to extend Internet access provided by hotspots to users and areas that are not typically covered. In this paper, we explore how the deployment of DTN-capable nodes can extend free Internet coverage in metropolitan areas, we depict the inefficiency of existing DTN routing protocols in highly-dense environments and we propose Connectivity plAn Routing PrOtOcOL (CARPOOL), a reference routing protocol to support our claims. CARPOOL exploits the connectivity plan of public transportation, achieving high delivery ratio with minimum overhead.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:_Ybze24A_UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selective Rate Control for Media-Streaming Applications in Wireless Internet Environments",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394058/",
            "Abstract": "Media-streaming applications experience limited performance and perceptible quality degradation in the presence of random wireless errors, as the underlying congestion control typically interprets packet loss as the outcome of congestion. In this context, we propose a selective rate control, namely AIAMD, which manages to differentiate congestive and non-congestive loss by utilizing history in its control rules. AIAMD combines the most desirable features of additive increase additive decrease (AIAD) and additive increase multiplicative decrease (AIMD) controls, reacting gently to wireless loss and more aggressively to congestion. Exploring AIAMD's potential, we identify notable gains in terms of link utilization and media delivery, without compromising intra-protocol fairness.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SSVP: A congestion control scheme for real-time video streaming",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128607001594",
            "Abstract": "In this paper, we present a new end-to-end protocol, namely Scalable Streaming Video Protocol (SSVP), which operates on top of UDP and is optimized for unicast video streaming applications. SSVP employs Additive Increase Multiplicative Decrease (AIMD)-based congestion control and adapts the sending rate by properly adjusting the inter-packet-gap (IPG). The smoothness-oriented modulation of AIMD parameters and IPG adjustments reduce the magnitude of AIMD oscillation and allow for smooth transmission patterns, while TCP-friendliness is maintained. Our experimental results demonstrate that SSVP eventually adapts to the vagaries of the network and achieves remarkable performance on real-time video delivery. In the event where awkward network conditions impair the perceptual video quality, we investigate the potential improvement via a layered adaptation mechanism that utilizes receiver buffering …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Experiences in Architecting Redundant and Secure Networks.",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=6717574045825510680&hl=en&oi=scholarr",
            "Abstract": "In this paper we present our experiences in architecting and implementing redundant and secure computer networks. We begin by architecting simple networks and then we expand them to fully redundant and secure networks. We are concentrating on architecting local, through to extended-local networks, which are accessible from the Internet and host multiple web servers that connect to application servers which, in turn, connect to databases. We discuss common requirements that can be found in any network architecture such as functionality, scalability, adaptability, manageability, cost effectiveness, and security. Server security is out of our scope, but we do address methods for designing redundant servers.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transport protocol behavior and energy-saving potential",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4116673/",
            "Abstract": "We investigate the energy-saving potential of transport protocols. We seek an answer to strategic issues of maximizing energy and bandwidth exploitation, without damaging the dynamics of multiple-flow equilibrium. We claim that (i) an energy-saving strategy of the transport level needs to be associated with some energy potential index which, unlike energy expenditure, is not device-specific and (ii) system-wise an energy-efficient system of flows is not always a better choice: we show that a less energy-efficient system may be more reliable in terms of packet multiplexing and, in turn, may reduce the probability that some flows may expend their energy with zero gain. We present results using a real testbed",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reputation-Based Trust Approaches in Named Data Networking",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/576240",
            "Abstract": "Information-Centric Networking (ICN) has arisen as an architectural solution that responds to the needs of today’s overloaded Internet, departing from the traditional host-centric access paradigm. In this paper we focus on Named Data Networking (NDN), the most prominent ICN architecture. In the NDN framework, disseminated content is at the core of the design and providing trusted content is essential. In this paper, we provide an overview of reputation-based trust approaches, present their design trade-offs and argue that these approaches can consolidate NDN trust and security by working complementary to the existing credential-based schemes. Finally, we discuss future research directions and challenges. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:71d7Y1FijdoC",
            "Publisher": "https://doi.org/10.3390/fi11110241"
        },
        {
            "Title": "Reliable data streaming over delay tolerant networks",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30630-3_33",
            "Abstract": "Data streaming over Delay-Tolerant Networks (DTN) is a challenging task considering jointly the specific characterisics of DTN environments, the demanding nature of streaming applications and their wide applicability. Presently, there are not any advanced mechanisms available to support this functionality and typical configurations fail to efficiently transfer data streams. In this paper, we present our ongoing work in data streaming over DTNs and propose the Bundle Streaming Service (BSS) as a framework to improve the reception and storage of data streams. Our proposed framework exploits the characteristics of Delay Tolerant Networks to allow for reliable delay-tolerant streaming. Here, we present a simple usage scenario along with the proposed framework and evaluate it experimentally at a preliminary stage which, however, suffices to demonstrate its potential suitability for both terrestrial and Space …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:5ugPr518TE4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The impact of network and protocol heterogeneity on real-time application QoS",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1493832/",
            "Abstract": "We evaluate the impact of network, and protocol heterogeneity on real-time application performance. We focus on TCP and UDP supportive role, also in the context of network stability and fairness. We reach several conclusions on the specific impact of wireless links, MPEG traffic friendliness, and TCP version efficiency. Beyond that, we also reach an unexpected result: UDP traffic is occasionally worse than TCP traffic when the right performance metric is used.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adjusting transport segmentation policy of DTN Bundle Protocol under synergy with lower layers",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121210002657",
            "Abstract": "We assess Delay-Tolerant Network (DTN) performance in space under the scope of adjusting protocol data unit (PDU) size at various layers. We quantify the importance of combinatively adjusting size of DTN bundles, transport packets, and link frames. Through simulations, our paper reveals trade-offs that involve file delivery time, transmission effort of sending nodes, and memory resources release rate. Based on our findings, we propose a transport adaptation scheme that dynamically adjusts DTN bundle and transport packet size by means of heuristic search. To our knowledge, this is the first study to examine transport segmentation policy and interaction among various layers of the DTN protocol stack.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A DTN-ready application for the real-time dissemination of Earth Observation data received by Direct Readout stations",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Ioannis-Daglis-2/publication/272885062_Proceedings_of_NETSPACE_Workshop_February_2014/links/54f1e34c0cf2b36214ace415/Proceedings-of-NETSPACE-Workshop-February-2014.pdf#page=28",
            "Abstract": "The effective dissemination of satellite data in real-time or near-real-time is a crucial parameter for disaster monitoring in particular. To date data exchange between Direct Receiving stations has not been fully exploited for real-time data dissemination. Stations around the world store data locally, which are then disseminated on-demand via Internet gateways based on the standard TCP-IP protocols. On the other hand, Delay Tolerant Networks (DTNs), which deliver data by enabling store-and-forward transmission in order to cope with link failures, service disruptions and network congestion, could prove as an alternative and complementary transmission mechanism. In this paper, a scheme for the effective dissemination of Earth Observation data received by DR stations is proposed based on transmission capabilities provided by DTNs.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effective buffer and storage management in DTN nodes",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5345376/",
            "Abstract": "Current wired networks have been developed on the basis of the AIMD principle, which offers increased performance and fairness. Nevertheless, there is a vast spectrum of networks, from deep space to wireless sensor networks, where TCP fails to operate, as it results in frequent timeouts and intermittent or no connectivity at all. The DTN (delay/disruption tolerant networking) architecture and particularly the Bundle protocol, offers solutions in networks where low connectivity, big or variable delays and increased error rates are prevalent. Using persistent storage, a DTN node is able to overcome such limitations; the data can be transmitted several times until it is successfully received by the next hop. However, since the conditions in a DTN network might vary, from time to time we may experience high connectivity and low delays. In such cases, data does not need to be transferred to persistent storage, as it will be …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Universal, mobile-centric and opportunistic communications architecture: End-User Requirements Report",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:Oo_WeVVXg5wC",
            "Publisher": "EU Framework Programme for Research and Innovation HORIZON 2020"
        },
        {
            "Title": "Deployment Considerations for Information-Centric Networking (ICN)",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:zfsRRabFVBUC",
            "Publisher": "irtf"
        },
        {
            "Title": "Energy/throughput tradeoffs of TCP error control strategies",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/860618/",
            "Abstract": "Today's universal communications increasing involve mobile and battery-powered devices (e.g. hand-held, laptop, IP-phone) connected over wired and wireless networks. Energy efficiency, as well as throughput are becoming service characteristics of dominant importance in communication protocols. The wide applicability of IP-networks/devices, and the wide range of TCP-based applications, have rendered TCP the de facto reliable transport protocol standard not only for wired, but also for wireless and mixed (wired/wireless) communications. TCP's congestion control algorithms have been refined to achieve higher throughput. Even with these modifications, however, TCP versions do not incorporate a flexible error recovery strategy that is responsive to distinct environmental characteristics and device constraints. We have compared the energy- and throughput-efficiency of TCP error control strategies based on …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:p2g8aNsByqUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of real-time transport with link-layer retransmissions in wired/wireless networks",
            "Publication year": 2006,
            "Publication url": "https://journals.riverpublishers.com/index.php/JMM/article/view/5019",
            "Abstract": "Real-time transport over wired/wireless networks is challenging, since wireless links exhibit distinct characteristics, such as limited bandwidth and high error rates, due to fading or interference. We focus on the efficiency of mechanisms that bind operationally wired and wireless links. In this context, local error control is attractive, due to the remarkable feasibility of wireless link protocols in terms of wide range deployment. We investigate whether local retransmissions enable TCP to efficiently utilize wireless resources under the constraint of bounded end-to-end delay. Based on an analytical approach, as well as extensive simulations, we show that local recovery prevents wasteful end-to-end retransmissions and allows the transport protocol to utilize a higher fraction of the available bandwidth. However, we uncover undesirable effects of local error control which degrade the performance of real-time delivery in several occasions. Furthermore, we investigate whether local error control compares favorably with selected transport-layer mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimental evaluation of TCP-Probing in mobile networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1020110009330",
            "Abstract": "Performance of standard TCP is significantly degraded during hand-off periods of mobile communications. We show here that carefully designed probing mechanisms can cancel this incompetent behavior of TCP. We compare TCP Tahoe and Reno with TCP-Probing under various scenarios of hand-off duration, propagation delay and mobility conditions of the user. We measure the goodput efficiency of data transfer as well as the energy efficiency of the protocols' mechanisms in terms of overhead and time. Our results show that TCP-Probing demonstrates significant gains in both energy and throughput efficiency by avoiding unnecessary timeout extensions and retransmission of data which is likely to be lost during hand-offs.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Middleware design issues for application management in heterogeneous networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/875779/",
            "Abstract": "With the increase of the heterogeneity of the Internet and the complexity of distributed computing, application management is facing more and more sophisticated requirements. In a dynamic, synergistic, and geographically broad environment, cross-domain resource management is becoming an important factor for application quality of service. We present a middleware architecture and initial implementation of that middleware that satisfies applications according to expected requirements, application service level agreement and distributed networked resources in and beyond the local environment. The networked resources are grouped in a hierarchical manner and their usage is optimized through the resource management system. This framework presents the same interface for any given resource type, with only the parameters changing to reflect that resources' specific requirements. This system enables …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A DTN testbed architecture",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5345338/",
            "Abstract": "As the space communications infrastructure of the near future is yet to be standardized, many protocols have been proposed to cope with issues such as long propagation delays, high packet error rates and intermittent connectivity. In that context, we have designed a testbed, which incorporates space conditions, mission scenarios and space communication requirements, rendering the extensive evaluation and design of space protocols feasible and efficient.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Opportunistic forwarding for user-provided networks",
            "Publication year": 2017,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17445760.2017.1376667",
            "Abstract": "We study opportunistic forwarding in a community-based networking paradigm where mobile users and shared access points (SAPs) collectively provide Internet access to users (mobile or not), including those in areas where other connectivity options are not available. Our approach is based on an efficient interoperation of two challenging network types: the opportunistic and the user-provided networks (UPNs). This requires a re-evaluation of the existing assumptions regarding inter-contact patterns and their alignment to this hybrid environment. We confirm our arguments with numerical results from a stochastic model as well as experimental scenarios with realistic parameters using the ONE simulator. Our experiments are based on a reference routing algorithm we designed and implemented that extends the spray ’n focus protocol and exhibits the following characteristics: (i) is oriented to this integrated …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:anDooRL1HQEC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "TCP-real: improving real-time capabilities of TCP over heterogeneous networks",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/378344.378371",
            "Abstract": "We present a TCP-compatible and-friendly protocol which abolishes thr ee major shortfalls of TCP for reliable multimedia applications over heterogeneous networks:(i) ineffective bandwidth utilization,(ii) unnecessary congestion-oriented responses to wireless link errors (eg, fading channels) and operations (eg handoffs), and (iii) wasteful window adjustments over asymmetric, low-bandwidth reverse paths. We propose TCP-Real, a high-throughput transport protocol that minimizes transmission-rate gaps, thereby enabling better performance and reasonable playback timers. In TCP-Real, the receiver decides with better accuracy about the appropriate size of the congestion window. Slow Start and timeout adjustments are used whenever congestion avoidance fails; however, rate and timeout adjustments are cancelled whenever the receiving rate indicates sufficient availability of bandwidth. We detail the protocol …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Head-to-Tail: managing network load through random delay increase",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4381610/",
            "Abstract": "Window-based congestion control is typically based on exhausting bandwidth capacity, which occasionally leads to transient congestion. Moreover, flow synchronization may deteriorate conditions further, leading to persistent or more severe congestion, which is experienced by flows through increasing queuing delays and packet retransmission. Head-to-Tail is a new approach to queue scheduling that aspires to alleviate this problem. When conditions at the router's buffer indicate high risk for congestion, Head-to-Tail delays packets intentionally to fabricate the senders' impression about the network load. This implicit signal to reduce the transmission rate allows for a responsive behavior prior to congestion. In this paper, we evaluated Head-to-Tail with TCP Vegas and compared it with RED and other TCP variants. The initial results indicate that congestion events and retransmissions can be significantly eliminated.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Protocol engineering for wired and wireless networks",
            "Publication year": 2004,
            "Publication url": "http://www1.cs.columbia.edu/~wenyu/research/cfp/docs/CFP-ComputerCommunications.pdf",
            "Abstract": "Protocol engineering in wired/wireless networks is a complex issue. The protocol design has to take into account the distinctive characteristics of both wired and wireless networks (eg error characteristics), the constraints of user (mobile) devices (eg battery power, limited resources), the constraints and operations of the network devices (eg buffering limitations or handovers, respectively) and the requirements of user applications.This special issue of Computer Communications seeks contributions that tackle the above issues in the context of wired/wireless convergence from the perspective of protocol design, implementation, evaluation, analysis and/or simulation. We also seek original contributions along the lines of wireless or wired networks alone which, however, indirectly impact protocol/application performance in heterogeneous wired/wireless networks. Topics of interest include:",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:JV2RwH3_ST0C",
            "Publisher": "[Guildford, England; New York, NY]: IPC Science and Technology Press,[c1978-"
        },
        {
            "Title": "A rate control scheme for adaptive video streaming over the internet",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288777/",
            "Abstract": "In this paper, we propose a new streaming protocol, namely dynamic video rate control (DVRC), which enables adaptive video delivery over the Internet. DVRC operates on top of HDP providing a congestion-controlled flow of unreliable datagrams. The proposed rate control scheme is able to interact with new and existing video streaming applications which are capable of adjusting their rate based on congestion feedback. DVRC attempts to optimize the performance of video delivery with concern to friendliness with interfering traffic. Exploring DVRC's potential through extensive simulations, we identify notable gains in terms of bandwidth utilization and smooth video delivery. Furthermore, our results indicate that the protocol allocates a well-balanced amount of network resources maintaining friendliness with coexisting flows.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "τ‐AIMD for asynchronous receiver feedback",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.622",
            "Abstract": "In this work we first describe an asynchronous‐feedback model which corresponds to the diverse roundtrip times (RTTs) of competing flows within the same communication channel. We show that even when the feedback of the receivers/network is asynchronous, the duration of a congestion epoch represents ‘common knowledge’ for the competing flows. Based on this property, we propose a diverse linear increase scheme in proportion to the RTT of each flow and we adjust periodically the windows of the competing flows accordingly, in order to enhance fairness of asynchronous‐feedback environments. We name this scheme τ‐AIMD and show that fairness of flows in asynchronous systems is improved since the increase‐rate diversity of long and short RTT flows is largely canceled. We use the max–min notion of fairness to show that τ‐AIMD can constitute the foundation for other window‐based, end‐to‐end …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:yB1At4FlUx8C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Exploiting energy-saving potential in heterogeneous networks",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17445760801930922",
            "Abstract": "We investigate the energy-saving potential of transport protocols. We seek an answer to strategic issues of maximising energy and bandwidth exploitation, without damaging the dynamics of multiple-flow equilibrium. We claim that (i) an energy-saving strategy of the transport level needs to be associated with some energy potential index which, unlike energy expenditure, is not device-specific and (ii) system-wise an energy-efficient system of flows is not always a better choice: we show that a less energy-efficient system may be more reliable in terms of packet multiplexing and, in turn, may reduce the probability that some flows may expend their energy with zero gain. We perform experiments using a real testbed and ns-2 based simulations.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:aqlVkmm33-oC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "UMOBILE D3. 1-UMOBILE Architecture Report (1)",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=8852197809578247410&hl=en&oi=scholarr",
            "Abstract": "Background:This report is written in the framework of Task 3.1 “DTN overlay design and convergence layers for underlying protocols” of UMOBILE project. The deliverable aims to describe work on the UMOBILE core architecture and is accompanied by the implementation of the architecture so far and documentation on the code.  Objectives: The core activity of WP3 is the design and implementation of the UMOBILE platform. Departing from the existing properties of DTN and ICN, we establish an architectural framework that extends connectivity options by being delay-tolerant and exposing a common information-centric abstraction to applications. UMOBILE aims to advance networking technologies and architectures towards the conception and realization of Future Internet. In particular, UMOBILE extends Internet (i) functionally – by combining ICN and DTN technologies within a new architecture, (ii) geographically …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:Zbx7W2Xs4QsC",
            "Publisher": "UMOBILE Project gr. nr. 645124"
        },
        {
            "Title": "Design of delay-tolerant transport protocol (DTTP) and its evaluation for Mars",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S009457651000192X",
            "Abstract": "We present Delay-Tolerant Transport Protocol (DTTP) which enables fast and reliable communications in deep space. The proposed protocol regularly measures its performance through available paths towards destination, and develops its routing strategy accordingly. We evaluate DTTP performance across a wide range of network scenarios that pertain to Mars-to-Earth distances. Based on simulation results, we show that: (i) Delay-Tolerant Networking does not necessarily imply belated communications; (ii) DTTP can efficiently support reliable data transfers in challenged networks; and (iii) dynamic routing is feasible in space.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A delay‐oriented prioritization policy based on non‐congestive queuing",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.1215",
            "Abstract": "In this paper, we depart from our previously proposed Non‐Congestive Queuing (NCQ) mechanism and propose a new scheduling discipline that allows for efficient interoperation of dedicated systems (such as sensor and voice networks) with the Internet. More precisely, our approach provides delay guarantees to applications that do not contribute noticeably to congestion because of their tiny packet sizes and low transmission rates. In addition, our approach uses a second level of prioritization that conditionally favors, in terms of delay, applications with slightly longer packets as well. Based on the NCQ concept, Non‐Congestive Queuing Plus (NCQ+) promotes applications that require comparatively small service times, as long as their total service times cause insignificant delays to other packets in the queue. Therefore, we prioritize packets, and in turn corresponding flows, according to their impact on total delay …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:2P1L_qKh6hAC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Traffic shaping for enabling less-than-best effort services at the edges of broadband connections",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2502880.2502888",
            "Abstract": "Broadband connection sharing constitutes a network resource pooling technique that could evolve toward supporting the establishment of the\" Free Internet for All\" notion. This technique could be implemented through the User-Provided Network model in which any end-user device (eg ADSL Access Points) could behave as supplier of Internet connectivity. In this paper, the behavior of such a system is investigated from a queue-management perspective. A numerical analysis that takes into consideration both the high variability of broadband link speeds and different packet-size distributions is presented. Based on the results, we propose a hybrid packet-scheduling scheme that enables the application of Less-than-Best Effort services at the connection edges.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Space data routers for the exploitation of space data",
            "Publication year": 2012,
            "Publication url": "https://arc.aiaa.org/doi/pdf/10.2514/6.2012-1294714",
            "Abstract": "The goal of the “Space-Data Routers”(SDR) project is to explore concepts for an enhanced architecture for the exploitation of space data capable of mitigating current availability limitations with respect to volume, timeliness, and continuity. The objective is to establish a mission/application-oriented communication overlay for data dissemination on Earth and to include into this overlay space born sources and network nodes. Technically, that is achieved by deploying the Delay Tolerant Networking (DTN) stack and integrating the interfaces of various Space and Internet communication and networking protocols, including TM/TC, Space Packets, and AOS along with Ethernet, TCP/IP and UDP. In addition, the overlay supports and enforces policies for resource and data sharing as well as for data dissemination. These concepts will be implemented through the development of the Space-Data Router, a DTN-enabled …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of dynamic DTN routing protocols in space environment",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5286392/",
            "Abstract": "As the number of space elements increases, routing becomes an issue of great interest. The majority of routing schemes that have been proposed till now, employ a fairly static design and, only recently, more sophisticated protocols have been introduced. In this study, we evaluate some of the most prominent routing protocols for Delay-Tolerant Networks, Epidemic, PRoPHET and Contact Graph Routing, in space environment. Using COMNET Lab's DTN testbed, we show that for increasing delay, Contact Graph Routing significantly outperforms the other two routing schemes.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "UMOBILE D. 2.1. End-User Requirements Report",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=16968628397528345867&hl=en&oi=scholarr",
            "Abstract": "The document provides a set of use-cases with assumptions and requirements which shall be the basis for the remaining work in ULOOP, namely, in WP3 and WP4. Constrains, assumptions, and requirements for each use-case are presented. To assist the reader we provide an adequate description and a sound understanding of the terminology applied in the context of the document, the document uses a generic Metropolitan Area Network (MAN) model as the basis for all of the terminology and concepts provided in the document.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:xlVdBZVQT58C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Open issues on TCP for mobile computing",
            "Publication year": 2002,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.30",
            "Abstract": "We discuss the design principles of TCP within the context of heterogeneous wired/wireless networks and mobile networking. We identify three shortcomings in TCP's behavior: (i) the protocol's error detection mechanism, which does not distinguish different types of errors and thus does not suffice for heterogeneous wired/wireless environments, (ii) the error recovery, which is not responsive to the distinctive characteristics of wireless networks such as transient or burst errors due to handoffs and fading channels, and (iii) the protocol strategy, which does not control the tradeoff between performance measures such as goodput and energy consumption, and often entails a wasteful effort of retransmission and energy expenditure. We discuss a solution‐framework based on selected research proposals and the associated evaluation criteria for the suggested modifications. We highlight an important angle that did not …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:u5HHmVD_uO8C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "On protocol engineering: detect, confirm and adjust",
            "Publication year": 2006,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIPT.2006.010559",
            "Abstract": "In this paper, we depart from TCP-Probing (Tsaoussidis and Badr, 2000) and propose an experimental transport protocol that achieves energy and throughput performance gains in mixed wired and wireless environments. Our approach decouples error recovery from contention estimation and focuses on the way these two mechanisms can (i) feed the probing decision process and (ii) implement the protocol strategy by shaping traffic, according to detected conditions. We use a validation mechanism that uncovers previous possibly wrong estimations. Our analysis matches well our simulation results that are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Bimodal congestion avoidance and control",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.19.4492&rep=rep1&type=pdf",
            "Abstract": "We introduce an alternative approach to con-gestion avoidance and control, which has the potential to increase efficiency and fairness in multiplexed channels. Our approach, Bimodal Congestion Avoidance and Control, is based on the principles of Additive Increase Multiplicative Decrease. It is designed to better exploit the system properties during equilibrium, without trading off responsiveness for smoothness. In addition, it is capable of achieving convergence to fairness in only two congestion cycles. As a result, both efficiency and fairness are improved, responsiveness is not degraded, and smoothness is significantly improved when the system is in equilibrium. We provide a theoretical analysis for both static and dynamic environments and we discuss the potential of our approach for packet networks. Our experiments confirm that Bimodal Congestion Avoidance and Control as a component of the Transmission Control Protocol outperforms the traditional scheme.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "QoS management at the transport layer",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/844244/",
            "Abstract": "This work reports on further implementation and testing of the Application Oriented Transport Protocol (AOTP). AOTP is an experimental protocol above IP that provides end-to-end transport service with functionality to trade off reliability, throughput and/or jitter in order to support the application layer with the required quality of service. Our protocol, based on QoS tradeoffs, can favor application and/or user-specific QoS characteristics of importance, at the expense of others, less significant. We outline the protocol's specification and mechanisms. AOTP provides an adjustable partially reliable service, priority-based error recovery strategy and dynamic playback management. We have tested the mechanisms using a video transmission application and a simulated, low-bandwidth environment with variable error characteristics. We characterize the tradeoffs associated with these mechanisms; we argue that the …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DABBER: Information-centric Routing for Opportunistic Wireless Networks",
            "Publication year": 2018,
            "Publication url": "https://www.academia.edu/download/57496028/draft-mendes-icnrg-dabber-01.pdf",
            "Abstract": "This draft describes the Data reAchaBility BasEd Routing (DABBER) protocol, which has been developed to extend the reached of Named Data Networking based routing approaches to opportunistic wireless networks. By\" opportunistic wireless networks\" it is meant multi-hop wireless networks where finding an end-to-end path between any pair of nodes at any moment in time may be a challenge. The goal is to assist in better defining opportunities for the transmission of Interest packets towards the most suitable data source, based on metrics that provide information about: i) the availability of different data sources; ii) the availability and centrality of neighbor nodes; iii) the time lapse between forwarding Interest packets and receiving the corresponding data packets. The document presents an architectural overview of DABBER followed by specification options related to the dissemination of name-prefix information to support the computation of next hops, and the ranking of forwarding options based on the best set of neighbors to ensure a short time-to-completion.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:AubyX3KqGToC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Wave & Probe Communication Mechanisms",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/article/10.1023/A:1011122500883",
            "Abstract": "This paper is motivated by the modifications recently suggested to enhance TCP performance over wireless channels. We argue that TCP end-to-end error-control mechanism lacks the functionality to respond appropriately in situations where errors vary in nature, frequency, or duration. As a result, this mechanism could, under some circumstances, yield zero throughput achievements at high energy-cost, or degrade throughput performance without conserving energy. This incompetent behavior with respect to the energy/throughput tradeoff puts in question TCP's suitability as a universal, reliable transport protocol of choice, especially for battery-powered mobile devices for which energy is a critical resource and congestion is not the exclusive cause of errors.We propose “Wave” and “Probing” communication and control mechanisms that permit end-to-end protocols to detect congestion without …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Exploiting the efficiency and fairness potential of AIMD-based congestion avoidance and control",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912860300269X",
            "Abstract": "Additive increase multiplicative decrease (AIMD) is the dominant algorithm for congestion avoidance and control in the Internet. The major goal of AIMD is to achieve fairness and efficiency in allocating resources. In the context of packet networks, AIMD attains its goal partially. We exploit here a property of AIMD-based data sources to share common knowledge, yet in a distributed manner; we use this as our departing point to achieve better efficiency and faster convergence to fairness.Our control model is based on the assumptions of the original AIMD algorithm; we show that both efficiency and fairness of AIMD can be improved. We call our approach AIMD with fast convergence (AIMD-FC). We present experimental results with TCP that match the expectations of our theoretical analysis.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:qjMakFHDy7sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Analysis of contact graph routing enhancements for DTN space communications",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sat.1138",
            "Abstract": "In this paper, we analyze the performance of two contact graph routing (CGR) enhancements, namely, CGR with earliest transmission opportunity (CGR‐ETO) and overbooking management. CGR‐ETO aims to improve the accuracy of predicted bundle delivery time by exploiting existing information on queueing delay, in routing decisions. Overbooking management aims to proactively handle contact oversubscription, which occurs when high‐priority bundles are forwarded to a contact that is already fully subscribed by lower‐priority bundles. These two enhancements have been recently included in the official CGR version as part of the Interplanetary Overlay Network delay‐tolerant/disruption‐tolerant networking implementation maintained by the National Aeronautics and Space Administration. In parallel to the comparative evaluation of the enhancements against the original CGR, we introduce an experimental …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:f2PrUAIjnKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards an error control schema with energy and throughput performance gains [C]",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "UMOBILE D3. 3: UMOBILE ICN layer abstraction initial specification",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=7747404443450521564&hl=en&oi=scholarr",
            "Abstract": "This document covers the UMOBILE architecture ICN layer specification, as well as UMOBILE services, for the specification of the UMOBILE architecture.  The final goal of this document is to provide a detailed description of the overall specification of the UMOBILE architecture. Special attention is given to the needed alignment with the Delay-Tolerant Network (DTN) architecture and the most relevant proposal for an information-centric network architecture (ICN) that fits the identified UMOBILE system and network requirements. The provided specification drives the development and implementation of the UMOBILE architecture.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:09LM3QYkMKUC",
            "Publisher": "UMOBILE Project gr. nr. 645124"
        },
        {
            "Title": "Aira: Additive increase rate accelerator",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-79549-0_60",
            "Abstract": "We propose AIRA, an Additive Increase Rate Accelerator. AIRA extends AIMD functionality towards adaptive increase rates, depending on the level of network contention and bandwidth availability. In this context, acceleration grows when resource availability is detected by goodput/throughput measurements and slows down when increased throughput does not translate into increased goodput as well. Thus, the gap between throughput and goodput determines the behavior of the rate accelerator.We study the properties of the extended model and propose, based on analysis and simulation, appropriate rate decrease and increase rules. Furthermore, we study conditional rules to guarantee operational success even in the presence of symptomatic, extra-ordinary events. We show that analytical rules can be derived for accelerating, either positively or negatively, the increase rate of AIMD in …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A study of deploying smooth‐and responsive‐TCPs with different queue management schemes",
            "Publication year": 2009,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.978",
            "Abstract": "While there exist extensive research works on congestion control and active queue management, or the joint dynamics of a congestion control strategy with the random early detection (RED) algorithm, little has been done on the interactions between different window adjustment strategies and different queue management schemes such as DropTail and RED. In this paper, we consider a spectrum of TCP‐friendly additive increase and multiplicative decrease (AIMD) parameters. At the one end of this spectrum, smooth‐TCP enhances smoothness for multimedia applications by reducing the window decrease ratio upon congestion, at the cost of the additive increase speed and the responsiveness to available bandwidth. At the other end, responsive‐TCP enhances the responsiveness by increasing the additive increase speed, at the cost of smoothness. We investigate the network dynamics with various …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:NaGl4SEjCO4C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Contact graph routing enhancements for delay tolerant space communications",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6934518/",
            "Abstract": "In this paper we present two enhancements to Contact Graph Routing (CGR), a Delay-/ Disruption- Tolerant Networking routing algorithm developed by NASA JPL for space environments with predetermined connectivity schedules, such as Interplanetary communications and LEO satellite systems. The first enhancement, CGR-ETO, aims to improve the accuracy of predicted bundle delivery time by considering the available information on queueing delay. The second, the Overbooking Management, aims to proactively handle contact oversubscription, which occurs when high priority bundles are forwarded for transmission on a contact that is already fully subscribed by lower priority bundles. Both enhancements have been inserted as optional features in the Interplanetary Overlay Network CGR implementation in order to comparatively evaluate their performance on a GNU/Linux testbed running the full protocol stack …",
            "Abstract entirety": 0,
            "Author pub id": "m3AXAvcAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Promoting effective service differentiation with Size-oriented Queue Management",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128610002069",
            "Abstract": "As the heterogeneity of Internet traffic increases, the need to provide the necessary quality guarantees for a broad range of applications becomes more and more important. We propose an Active Queue Management scheme, namely Size-oriented Queue Management, which realizes service differentiation based on the Less Impact–Better Service principle. SQM manages to satisfy broadly the quality constraints of real-time applications, without compromising the performance of bulk data applications. Using packet size as criterion, we are able to distinguish time-sensitive flows and apply different dropping and scheduling policies to favor time-sensitive traffic. Our simulation results indicate that SQM manages to increase application satisfaction and augment the user-perceived quality.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Energy-efficient Internetworking with DTN",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21560-5_19",
            "Abstract": "We claim that Delay-Tolerant Networking has the potential to form an internetworking overlay that shapes traffic in a manner that exploits the capacity of last hop wireless channels and allows for energy-efficient internetworking. We demonstrate DTN potential for energy-efficient internetworking through an overlay-architecture and a tool we have developed that captures the required state transitions of the mobile device WNIC. We show experimentally that the DTN overlay can re-shape traffic in a manner that allows the receiver to exploit the energy-throughput tradeoff better: it may condense sporadic packets into a burst and, in return, prolong sleep and power-off duration without risk to miss incoming packets and without degradation in throughput.",
            "Abstract entirety": 1,
            "Author pub id": "m3AXAvcAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Klidarithmos Press"
        }
    ]
}]