[{
    "name": "Βασίλειος Διγαλάκης",
    "romanize name": "Vasileios Digalakis",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "tuc",
    "Rank": "Καθηγητής",
    "Apella_id": 4463,
    "Scholar name": "Vassilis Digalakis",
    "Scholar id": "8LcwaSYAAAAJ",
    "Affiliation": "Professor of Electrical and Computer Engineering, Technical University of Crete",
    "Citedby": 5426,
    "Interests": [
        "Machine Learning",
        "Pattern Recognition",
        "Speech Recognition",
        "Speech Processing",
        "Natural Language Processing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=8LcwaSYAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "An architecture for miultiemodal applications over wireless data networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4197788/",
            "Abstract": "As speech is a natural way of interaction between humans and machines, more and more applications will arise that exploit the specific feature. Multimodality comes as the next step in order to offer even more natural, friendlier and personalized interfaces. In this work, we present the architecture of a distributed system that utilizes the data channel (GPRS or 3G), in order to accommodate multimodal applications on a mobile device. Within the context of our work we also introduce a generic framework for creating applications of this kind. Finally, we integrate the proposed system in order to demonstrate a sample application",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IET"
        },
        {
            "Title": "Acoustic Modeling for Automatic Speech Recognition-Gaussian Mixture Clustering and Language Adaptation for the Development of a New Language Speech Recognition System",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7105794134277012815&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient speech recognition using subvector quantization and discrete-mixture HMMs",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0885230899901341",
            "Abstract": "This paper introduces a new form of observation distributions for hidden Markov models (HMMs), combining subvector quantization and mixtures of discrete distributions. Despite what is generally believed, we show that discrete-distribution HMMs can outperform continuous-density HMMs at significantly faster decoding speeds. Performance of the discrete HMMs is improved by using product-code vector quantization (VQ) and mixtures of discrete distributions. The decoding speed of the discrete HMMs is also improved by quantizing subvectors of coefficients, since this reduces the number of table lookups needed to compute the output probabilities. We present efficient training and decoding algorithms for the discrete-mixture HMMs (DMHMMs). Our experimental results in the air-travel information domain show that the high level of recognition accuracy of continuous-mixture-density HMMs (CDHMMs) can be …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:vRqMK49ujn8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Identification of linear systems in canonical form through an em framework",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5495726/",
            "Abstract": "Least-squares estimation has always been the main approach when applying prediction error methods (PEM) in the identification of linear dynamical systems. Regardless of the estimation algorithm, if there are no restrictions on the form of the matrices we want to estimate, the matrices can be determined up to within a linear transformation and thus the result may be different than the true solution and the convergence of iterative algorithms may be affected. In this paper, we apply a new identification procedure based on the Expectation Maximization framework to a family of identifiable state-space models. To our knowledge, this is the first complete solution of Maximum-Likelihood estimation for general linear state-space models.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Method and apparatus for automatic text-independent grading of pronunciation for language instruction",
            "Publication year": 2000,
            "Publication url": "https://patents.google.com/patent/US6055498A/en",
            "Abstract": "Pronunciation quality is automatically evaluated for an utterance of speech based on one or more pronunciation scores. One type of pronunciation score is based on duration of acoustic units. Examples of acoustic units include phones and syllables. Another type of pronunciation score is based on a posterior probability that a piece of input speech corresponds to a certain model, such as a hidden Markov model, given the piece of input speech. Speech may be segmented into phones and syllable for evaluation with respect to the models. The utterance of speech may be an arbitrary utterance made up of a sequence of words which had not been encountered before. Pronunciation scores are converted into grades as would be assigned by human graders. Pronunciation quality may be evaluated in a client-server language instruction environment.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Maximum likelihood stochastic transformation adaptation for medium and small data sets",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0885230801901688",
            "Abstract": "Speaker adaptation is recognized as an essential part of today’s large-vocabulary automatic speech recognition systems. A family of techniques that has been extensively applied for limited adaptation data is transformation-based adaptation. In transformation-based adaptation we partition our parameter space in a set of classes, estimate a transform (usually linear) for each class and apply the same transform to all the components of the class. It is known, however, that additional gains can be made if we do not constrain the components of each class to use the same transform. In this paper two speaker adaptation algorithms are described. First, instead of estimating one linear transform for each class (as maximum likelihood linear regression (MLLR) does, for example) we estimate multiple linear transforms per class of models and a transform weights vector which is specific to each component (Gaussians in our …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Method and apparatus for automatic recognition using features encoded with product-space vector quantization",
            "Publication year": 2001,
            "Publication url": "https://patents.google.com/patent/US6256607B1/en",
            "Abstract": "An automatic recognition system and method divides observation vectors into subvectors and determines a quantization index for the subvectors. Subvector indices can then be transmitted or otherwise stored and used to perform recognition. In a further embodiment, recognition probabilities are determined for subvectors separately and these probabilities are combined to generate probabilities for the observed vectors. An automatic system for assigning bits to subvector indices can be used to improve recognition.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple dialects and languages",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/351714.351733",
            "Abstract": "Multiple dialects and languages | The spoken language translator ACM Digital Library home \nACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced \nSearch Journals Magazines Proceedings Books SIGs Conferences People More Search ACM \nDigital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More \nHomeBrowse by TitleBooksThe spoken language translatorMultiple dialects and languages \nchapter Multiple dialects and languages Share on Authors: Vassilis V Digalakis profile image \nVassilis Digalakis View Profile , Leonardo G Neumeyer profile image Leonardo Neumeyer \nView Profile Authors Info & Affiliations Publication: The spoken language translatorSeptember \n2000 Pages 274–283 0citation 0 Downloads Metrics Total Citations0 Total Downloads0 \nLast 12 Months0 Last 6 weeks0 Get Citation Alerts New Citation Alert added! This alert : …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acoustic modelling",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/351714.351730",
            "Abstract": "Acoustic modelling | The spoken language translator ACM Digital Library home ACM home \nGoogle, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search \nJournals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital \nLibrary SearchSearch Advanced Search Browse Browse Digital Library Collections More \nHomeBrowse by TitleBooksThe spoken language translatorAcoustic modelling chapter Acoustic \nmodelling Share on Authors: Vassilis V Digalakis profile image Vassilis Digalakis View Profile , \nLeonardo G Neumeyer profile image Leonardo Neumeyer View Profile Authors Info & Affiliations \nPublication: The spoken language translatorSeptember 2000 Pages 240–249 0citation 0 \nDownloads Metrics Total Citations0 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get \nCitation Alerts New Citation Alert added! This alert has been successfully added and will to…",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:70eg2SAEIzsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic scoring of pronunciation quality",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167639399000461",
            "Abstract": "We present a paradigm for the automatic assessment of pronunciation quality by machine. In this scoring paradigm, both native and nonnative speech data is collected and a database of human-expert ratings is created to enable the development of a variety of machine scores. We first discuss issues related to the design of speech databases and the reliability of human ratings. We then address pronunciation evaluation as a prediction problem, trying to predict the grade a human expert would assign to a particular skill. Using the speech and the expert-ratings databases, we build statistical models and introduce different machine scores that can be used as predictor variables. We validate these machine scores on the Voice Interactive Language Training System (VILTS) corpus, evaluating the pronunciation of American speakers speaking French and we show that certain machine scores, like the log-posterior and …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:d1gkVwhDpl0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Method and system for automatic text-independent grading of pronunciation for language instruction",
            "Publication year": 2001,
            "Publication url": "https://patents.google.com/patent/US6226611B1/en",
            "Abstract": "Pronunciation quality is automatically evaluated for an utterance of speech based on one or more pronunciation scores. One type of pronunciation score is based on duration of acoustic units. Examples of acoustic units include phones and syllables. Another type of pronunciation score is based on a posterior probability that a piece of input speech corresponds to a certain model such as an HMM, given the piece of input speech. Speech may be segmented into phones and syllables for evaluation with respect to the models. The utterance of speech may be an arbitrary utterance made up of a sequence of words which had not been encountered before. Pronunciation scores are converted into grades as would be assigned by human graders. Pronunciation quality may be evaluated in a client-server language instruction environment.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gaussian mixture clustering and language adaptation for the development of a new language speech recognition system",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4100669/",
            "Abstract": "The porting of a speech recognition system to a new language is usually a time-consuming and expensive process since it requires collecting, transcribing, and processing a large amount of language-specific training sentences. This work presents techniques for improved cross-language transfer of speech recognition systems to new target languages. Such techniques are particularly useful for target languages where minimal amounts of training data are available. We describe a novel method to produce a language-independent system by combining acoustic models from a number of source languages. This intermediate language-independent acoustic model is used to bootstrap a target-language system by applying language adaptation. For our experiments, we use acoustic models of seven source languages to develop a target Greek acoustic model. We show that our technique significantly outperforms a …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A sub-optimal viterbi-like search for linear dynamic models classification.",
            "Publication year": 2007,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2007/i07_1717.pdf",
            "Abstract": "This paper describes a Viterbi-like decoding algorithm applied on segment-models based on linear dynamic systems (LDMs). LDMs are a promising acoustic modeling scheme which can alleviate several of the limitations of the popular Hidden Markov Models (HMMs). There are several implementations of LDMs that can be found in the literature. For our decoding experiments we consider general identifiable forms of LDMs which allow increased state space dimensionality and relax most of the constraints found in other approaches. Results on the AURORA2 database show that our decoding scheme significantly outperforms standard HMMs, particularly under significant noise levels.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a linear dynamical model based speech synthesizer",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Vassilios-Diakoloukas-2/publication/303881878_Towards_a_Linear_Dynamical_Model_based_Speech_Synthesizer/links/575a89e008aec91374a5ecfb/Towards-a-Linear-Dynamical-Model-based-Speech-Synthesizer.pdf",
            "Abstract": "We present recent developments towards building a speech synthesis system completely based on Linear Dynamical Models (LDMs). Specifically, we describe a decision tree-based context clustering approach to LDM-based speech synthesis and an algorithm for parameter generation using global variance with LDMs. In order to capture the speech dynamics, LDMs need coarser phoneme segmentation than the 5-state segmentation usually used in Hidden Markov Model (HMM)-based speech synthesis. Therefore, using LDMs to evaluate the clustering of longer phoneme segments improves the linguistic-to-acoustic mapping and leads to trajectories of synthetic speech parameters without discontinuities and closer to the natural ones. It also decreases the footprint of the system since the total number of decision tree leaves is smaller than the total number of leaves usually produced in a typical HMM-based …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large vocabulary continuous speech recognition in greek: corpus and an automatic dictation system.",
            "Publication year": 2003,
            "Publication url": "https://www.issco.unige.ch/en/staff/tsourakis/publications/DigalakisEA-Interspeech2003.pdf",
            "Abstract": "In this work, we present the creation of the first Greek Speech Corpus and the implementation of a Dictation System for workflow improvement in the field of journalism. The current work was implemented under the project called Logotypografia (Logos= logos, speech and Typografia= typography) sponsored by the General Secretariat of Research and Development of Greece. This paper presents the process of data collection (texts and recordings), waveform processing (transcriptions), creation of the acoustic and language models and the final integration to a fully functional dictation system. The evaluation of this system is also presented. The Logotypografia database, described here, is available by ELRA.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of general identifiable linear dynamic models with an application in speech recognition",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4218135/",
            "Abstract": "Although hidden Markov models (HMMs) provide a relatively efficient modeling framework for speech recognition, they suffer from several shortcomings which set upper bounds in the performance that can be achieved. Alternatively, linear dynamic models (LDM) can be used to model speech segments. Several implementations of LDM have been proposed in the literature. However, all had a restricted structure to satisfy identifiability constraints. In this paper, we relax all these constraints and use a general, canonical form for a linear state-space system that guarantees identifiability for arbitrary state and observation vector dimensions. For this system, we present a novel, element-wise maximum likelihood (ML) estimation method. Classification experiments on the AURORA2 speech database show performance gains compared to HMMs, particularly on highly noisy conditions.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The spoken language translator",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=15952499174096823490&hl=en&oi=scholarr",
            "Abstract": "21 chapters contributed by different authors who worked on the building of components and/or the overall system for the Spoken Language Translator (SLT), an early project in the area of automatic speech translation. The book presents a detailed description of various technologies developed during the period of the SLT project, with an emphasis on language and linguistic processing. It includes four parts: language processing and corpora, linguistic coverage, speech processing, and evaluation and conclusions. The SLT used a multiengine machine translation architecture. The main machine translation engine is a complex, unification grammar–based system intended to perform deep analysis and to produce high-quality output. The authors claim that the handcoded grammars used in SLT are linguistically motivated and generic in nature. Therefore, the grammar coverage is broad, and it is feasible to use these …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:08ZZubdj9fEC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "A configurable logic based architecture for real-time continuous speech recognition using hidden Markov models",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1008197523254",
            "Abstract": "An architecture is presented for real-time continuous speech recognition based on a modified hidden Markov model. The algorithm is adapted to the needs of continuous speech recognition by efficient encoding of the state space, and logarithmic encoding of the weights so that products can be computed as sums. The paper presents the algorithm and its application related modifications, the mapping of the algorithm to a special purpose architecture, and the detailed design of this architecture using configurable logic. Emphasis is given on how the attributes of the algorithm are exploited in a configurable logic based design. A concrete design example is presented with a coprocessor engine having one large FPGA, 64 Mbytes of synchronous DRAM (SDRAM), a small FPGA as a SDRAM controller, and 2 Mbytes SRAM. This engine operating at 66 MHz performs roughly nine times as fast as a high end …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "ClockWork-RNN Based Architectures for Slot Filling.",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stem-based maximum entropy language models for inflectional languages",
            "Publication year": 2003,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/eurospeech_2003/e03_2285.pdf",
            "Abstract": "In this work we build language models using three different training methods: n-gram, class-based and maximum entropy models. The main issue is the use of stem information to cope with the very large number of distinct words of an inflectional language, like Greek. We compare the three models with both perplexity and word error rate. We also examine thoroughly the perplexity differences of the three models on specific subsets of words.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speech emotion recognition using non-linear teager energy based features in noisy environments",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6334230/",
            "Abstract": "In this study, Teager-energy based Mel-frequency cepstral coefficients (TEMFCCs) are proposed for Automatic Speech Emotion Recognition (ASER) in noisy environments. TEMFCCs are obtained by taking the absolute value of the Teager-energy operator (TEO) of the short-time Fourier transform of the signal (STFT), warping it to a Mel-frequency scale, and taking the discrete cosine transform (DCT) of the log-Mel Teager-energy spectrum. Experiments on classification of discrete emotion categories show that TEMFCCs are more robust than MFCCs in noisy conditions, while TEMFCCs and MFCCs perform similarly for clean conditions.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Joint estimation of multiple undirected graphical models",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6958915/",
            "Abstract": "Gaussian graphical models are of great interest in statistical learning. Since the conditional independence between the variables corresponds to zero entries in the inverse covariance matrix, one can learn the structure of the graph by estimating a sparse inverse covariance matrix from sample data. This is usually done by solving a convex maximum likelihood problem with a l 1 -regularization term applied on the inverse covariance matrix. In this study, we develop an estimator for such models appropriate for data coming from several datasets that share the same set of variables and a common network substructure. We assume that there exist a few different edges among the networks while the others (edges) are common. To this end, we form an optimization problem that exploits the problem's special structure and we propose an alternating direction method for its solution. We confirm the performance improvement …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Combination of machine scores for automatic grading of pronunciation quality",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016763939900045X",
            "Abstract": "This work is part of an effort aimed at developing computer-based systems for language instruction; we address the task of grading the pronunciation quality of the speech of a student of a foreign language. The automatic grading system uses SRI's DecipherTM continuous speech recognition system to generate phonetic segmentations. Based on these segmentations and probabilistic models we produce different pronunciation scores for individual or groups of sentences that can be used as predictors of the pronunciation quality. Different types of these machine scores can be combined to obtain a better prediction of the overall pronunciation quality. In this paper we review some of the best-performing machine scores and discuss the application of several methods based on linear and nonlinear mapping and combination of individual machine scores to predict the pronunciation quality grade that a human expert …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:UeHWp8X0CEIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Rapid acoustic model development using Gaussian mixture clustering and language adaptation",
            "Publication year": 2004,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2004/i04_0017.pdf",
            "Abstract": "This work presents techniques for improved cross-language transfer of speech recognition systems to new, previously undeveloped, languages. Such techniques are particularly useful for target languages where minimal amounts of training data are available. We describe a novel method to produce a language-independent system by combining acoustic models from a number of source languages. This intermediate language-independent acoustic model is used to bootstrap a target-language system by applying language adaptation. For our experiments we use acoustic models of seven source languages to develop a target Greek acoustic model. We show that our technique significantly outperforms a system trained from scratch when less than 8 hours of read speech is available.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic pronunciation evaluation of foreign speakers using unknown text",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S088523080600009X",
            "Abstract": "In this study we present various techniques to evaluate the pronunciation of students of a foreign language without any knowledge of the uttered text. Previous attempts have shown that it is feasible to evaluate the pronunciation of a non-native speaker by having implicit or explicit knowledge of the uttered text, provided that enough utterances are available. Our approach is to use characteristics of the mother tongue (SOURCE language) of the speaker in the evaluation of his/her pronunciation. We recorded 20 Greek students speaking English (TARGET language) and evaluated their pronunciation using algorithms that include characteristics of the SOURCE language (Greek). We show that the pronunciation scores that are based on both TARGET- and SOURCE-language characteristics have better correlation with the human scores than those based only on characteristics of the TARGET language. As in previous …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Use of Clustering Information for Coarticulation Compensation in Speech Synthesis by Word Concatenation",
            "Publication year": 2001,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/eurospeech_2001/e01_0833.pdf",
            "Abstract": "The Weather Report Synthesizer is a speech synthesis system for weather forecasts in Greek. Instead of trying to improve the synthesis quality of PSOLA based diphone concatenation speech synthesizers, we have chosen to use words as the synthesis units. This approach has the advantage of low complexity and quick implementation, while at the same time it achieves better speech quality due to the fact that the synthesis units inherently possess the necessary prosodic feature diversity. The selection of the optimal sequence of words that form the synthesized speech, however, presents the greatest challenge in the synthesis process. Several features are taken into consideration during the selection, but we have identified Coarticulation at the edges of consecutive words to have the greatest effect on the quality of the synthesized utterance. We present a novel method for evaluating a measure on coarticulation …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Degradation of speech recognition performance over lossy data networks",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/1298216.1298237",
            "Abstract": "In this work we investigate the effects of lossy data networks on the speech recognition performance, utilizing a stock information corpus.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generic methodology of converting transliterated text to phonetic strings case study: greeklish",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.8072&rep=rep1&type=pdf",
            "Abstract": "In this work, we present a generic methodology for converting transliterated text (native language written with a non-native alphabet) to phonetic sequences. The goal is to create the same phonetic result that would be produced if a native speaker uttered the original text in native alphabet. In our work, we implemented the specific methodology as a front-end to a Text-to-Speech (TTS) server. To evaluate our algorithms we considered the case that corresponds to the Greek language, called Greeklish.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speech recognition",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/351714.351729",
            "Abstract": "Speech recognition | The spoken language translator ACM Digital Library home ACM home \nGoogle, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search \nJournals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital \nLibrary SearchSearch Advanced Search Browse Browse Digital Library Collections More \nHomeBrowse by TitleBooksThe spoken language translatorSpeech recognition chapter Speech \nrecognition Share on Authors: Vassilis V Digalakis profile image Vassilis Digalakis View Profile , \nHoracio Franco profile image Horacio Franco View Profile Authors Info & Affiliations Publication: \nThe spoken language translatorSeptember 2000 Pages 231–239 0citation 0 Downloads \nMetrics Total Citations0 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation Alerts \nNew Citation Alert added! This alert has been successfully added and will be sent to: a .…",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Global variance in speech synthesis with linear dynamical models",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7491224/",
            "Abstract": "Linear Dynamical Models (LDMs) have been used in speech synthesis recently as an alternative to hidden Markov models (HMMs). Among the advantages of LDMs are the ability to capture the dynamics of speech and the achievement of synthesized speech quality similar to HMM-based speech systems on a smaller footprint. However, such as in the HMM case, LDMs produce over-smoothed trajectories of speech parameters, resulting in muffled quality of synthetic speech. Inspired by a similar problem found in HMM-based speech synthesis, where the naturalness of the synthesized speech is greatly improved when the global variance (GV) is compensated, this paper proposes a novel speech parameter generation algorithm that considers GV in LDM-based speech synthesis. Experimental results show that the application of GV during parameter generation significantly improves speech quality.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Linear dynamical models in speech synthesis",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6853606/",
            "Abstract": "Hidden Markov models (HMMs) are becoming the dominant approach for text-to-speech synthesis (TTS). HMMs provide an attractive acoustic modeling scheme which has been exhaustively investigated and developed for many years. Modern HMM-based speech synthesizers have approached the quality of the best state-of-the-art unit selection systems. However, we believe that statistical parametric speech synthesis has not reached its potential, since HMMs are limited by several assumptions which do not apply to the properties of speech. We, therefore, propose in this paper to use Linear Dynamical Models (LDMs) instead of HMMs. LDMs can better model the dynamics of speech and can produce a naturally smoother trajectory of the synthesized speech. We perform a series of experiments using different system configurations to check on the performance of LDMs for speech synthesis. We show that LDM …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast speaker adaptation of large vocabulary continuous density HMM speech recognizer using a basis transform approach",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/859128/",
            "Abstract": "Maximum likelihood transformation-adaptation techniques have proven successful, but it is believed that faster convergence to speaker dependent (SD) performance can be achieved if we incorporate some form of a-priori knowledge in the adaptation process. In this paper, instead of estimating one linear transform per class of models for each new speaker, we transform the speaker-independent (SI) models using multiple linear transforms and a weight vector. To reduce the number of adaptation parameters, the multiple linear transforms are generated from training speakers and the adaptation parameters consist of a single weight vector per class. This can be seen as incorporating a-priori knowledge to our estimation process. Experiments conducted on the Spoken Language Translator database in the Swedish language using SRI's DECIPHER/sup TM/ system, show that the new method outperforms maximum …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Spoken Language Translator",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=13742293449636759908&hl=en&oi=scholarr",
            "Abstract": "21 chapters contributed by different authors who worked on the building of components and/or the overall system for the Spoken Language Translator (SLT), an early project in the area of automatic speech translation. The book presents a detailed description of various technologies developed during the period of the SLT project, with an emphasis on language and linguistic processing. It includes four parts: language processing and corpora, linguistic coverage, speech processing, and evaluation and conclusions. The SLT used a multiengine machine translation architecture. The main machine translation engine is a complex, unification grammar–based system intended to perform deep analysis and to produce high-quality output. The authors claim that the handcoded grammars used in SLT are linguistically motivated and generic in nature. Therefore, the grammar coverage is broad, and it is feasible to use these …",
            "Abstract entirety": 0,
            "Author pub id": "8LcwaSYAAAAJ:g5m5HwL7SMYC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "The spoken language translator",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=5VoNF8NElY8C&oi=fnd&pg=PR15&dq=info:kwonybSfFvcJ:scholar.google.com&ots=KpAABNjNj_&sig=-CRo1omvalQKjOXfw_C6JMq6WaA",
            "Abstract": "This book presents a detailed description of Spoken Language Translator (SLT), one of the first major projects in the area of automatic speech translation. The SLT system can translate between English, French, and Swedish in the domain of air travel planning, using a vocabulary of about 1500 words, and with an accuracy of about 75 per cent. The greater part of the book describes the language processing components, which are largely built on top of the SRI Core Language Engine, using a combination of general grammars and techniques that allow them to be rapidly customized to specific domains. Speech recognition is based on Hidden Markov Mode technology, and uses versions of the SRI DECIPHER system. This account of the Spoken Language Translator should be an essential resource both for those who wish to know what is achievable in spoken-language translation today, and for those who wish to understand how to achieve it.",
            "Abstract entirety": 1,
            "Author pub id": "8LcwaSYAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Cambridge University Press"
        }
    ]
}]