[{
    "name": "Βασίλειος Κόμης",
    "romanize name": "Vasileios Komis",
    "School-Department": "Επιστημών της Εκπαίδευσης & της Αγωγής στην Προσχολική Ηλικία",
    "University": "upatras",
    "Rank": "Καθηγητής",
    "Apella_id": 4952,
    "Scholar name": "Vassilis Komis",
    "Scholar id": "y-hRoJQAAAAJ",
    "Affiliation": "University of Patras",
    "Citedby": 4796,
    "Interests": [
        "Computer Education",
        "Educational Technology",
        "Computer Science Education",
        "Technology Enhanced Learning",
        "Learning Technologies"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=y-hRoJQAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Emerged Debugging Abilities in Early Childhood Education",
            "Publication year": 2020,
            "Publication url": "http://www.tara.tcd.ie/bitstream/handle/2262/92768/C2020-Proceedings.pdf?sequence=1&isAllowed=y#page=92",
            "Abstract": "ResultsFigure 1 shows the sequential programming structure (3 steps process: memory, movement (s), execution) of the Logo-like robotic environment linked to different categories of errors. The category of syntax errors led children/programmers to debug since control commands are involved for a program to run. For the logical errors category, most errors were described as lack of direction and orientation commands. A few cases characterized as semantic errors and related to the misconception of guidance commands. The range of qualitative categories brought to light that children/programmers are primarily developing strategies for debugging experienced programmers such as creating a new program (Sipitakiat & Nusen, 2012). Between the two ages, older children/programmers (5-6 year old) present an established programming behaviour where they recognise and identify syntax and semantic/logical errors and applying appropriate debugging strategy to fix them.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:B71Od6CY_ssC",
            "Publisher": "Constructionism 2020"
        },
        {
            "Title": "Expérimentations sur l’utilisation d’un logiciel de modélisation par petits groupes d’élèves",
            "Publication year": 2001,
            "Publication url": "https://www.persee.fr/doc/stice_1265-1338_2001_num_8_1_1527",
            "Abstract": "modeling, problem solving, quantitative and semi-quantitative modeling, qualitative, interface, ergonomic aspects, learning environments, environnements d’apprentissage, modélisation, aspects ergonomiques, interface, modélisation qualitative, semi-quantitative et quantitative, résolution de problèmes",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Persée-Portail des revues scientifiques en SHS"
        },
        {
            "Title": "Διδασκαλία με χρήση της τεχνολογίας",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=7435423128824036829&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:yqZeyBDMhiUC",
            "Publisher": "Κλειδάρθμος"
        },
        {
            "Title": "L’enseignement à distance",
            "Publication year": 2013,
            "Publication url": "https://journals.openedition.org/dms/258",
            "Abstract": "L’enseignement à distance, terme qui désigne habituellement tout processus d’enseignement où tuteurs et apprenants sont éloignés géographiquement (gestion de l’espace) et gèrent de manière souple et quasi autonome leur activité (gestion du temps), connaît un nouvel essor à l’ère des technologies informatiques. Les formes traditionnelles d’enseignement à distance disparaissant, ce terme devient habituellement synonyme, à tort ou à raison, de l’anglicisme e-learning. Nous présentons ci-dessous ...",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:738O_yMBCRsC",
            "Publisher": "Centre national d'enseignement à distance"
        },
        {
            "Title": "Preschool teachers’ perceptions about TPACK in Greek educational context",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:fSKd39tHJ84C",
            "Publisher": "Springer"
        },
        {
            "Title": "Overview of the Computer Programming Learning Environments for primary education",
            "Publication year": 2019,
            "Publication url": "https://resmicte.lis.upatras.gr/review/article/view/3140",
            "Abstract": "Over the past decade, the assessment of the general educational value of computer programming and computational thinking has been constantly increasing and, as a result, they are introduced to increasingly younger ages. In parallel, educational programming environments are significantly progressing, providing a variety of options for different ages. This paper presents an overview of the modern learning programming environments for primary education and proposes a classification system with categories corresponding to the technological and educational dimensions of the area. The paper aims to support teachers in learning design for the interdisciplinary approach of programming and the development of computational thinking.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:npT69zEmqdIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Factors affecting teachers’ views and perceptions of ICT in education",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Athanassios-Jimoyiannis/publication/303897609_FACTORS_AFFECTING_TEACHERS'_VIEWS_AND_PERCEPTIONS_OF_ICT_IN_EDUCATION/links/575bb20408aec91374a628b0/FACTORS-AFFECTING-TEACHERS-VIEWS-AND-PERCEPTIONS-OF-ICT-IN-EDUCATION.pdf",
            "Abstract": "This article presents the results of a study investigating current teachers’ beliefs and perceptions of ICT in education. The survey was administered in Greece to a total of 1165 primary and secondary education teachers, just after they had completed a training programme on basic ICT skills. The majority of the teachers in the sample stated positively towards the role that ICT could play in education. However, only a small percentage of them have adopted and use ICT in their instruction job. Our findings have also revealed some interfering factors, which make many teachers cautious or skeptical about ICT integration in the educational practice. We have also recorded differences in teachers’ beliefs and perceptions according to their gender and subject specialty. Finally, we conclude with some implications, which could be helpful to the educational policy authorities in their attempt to implement new initiatives aiming at teachers’ preparation to effectively integrate ICT in their everyday classroom practice.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:9UF2BbDYXHIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Les «Objets d’Apprentissage» à l’enseignement: quels choix didactiques et épistémologiques",
            "Publication year": 2011,
            "Publication url": "https://scholar.archive.org/work/wtly6dbe55f5fj7tkcrcevj3ce/access/wayback/https://gerflint.fr/Base/SE_europeen3/Ravanis.pdf",
            "Abstract": "Dans le présent article, des issues concernant l’utilisation éducative des Objets d’Apprentissage sont discutées en soulignant le développement d’un cadre conceptuel basé sur le champ de la Didactique des objets spécialisés d’enseignement. Les tendances traditionnelles et contemporaines, en vue de la relation entre Objets d’Apprentissage et Éducation, sont décrites, alors que des questions concernant cette relation sont posées. De plus, quelques concepts-clés qui permettent la constitution d’un cadre relatif à la création des Objets d’Apprentissage sont présentés. Dans ce cadre, l’étude des Objets d’Apprentissage peut être compatible avec les fonctions éducatives et sémiotiques que ces concepts-clés expriment.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Jeux programmables de type Logo à l’école maternelle",
            "Publication year": 2012,
            "Publication url": "http://adjectif.sandbox-jp.fr/spip.php?article140",
            "Abstract": "Dans ce bref article on présente un travail en cours concernant les jeux programmables de type Logo à l’école maternelle. Ce travail s’ inscrit dans le cadre du projet européen Fibonacci et consiste entre autres à étudier l’apprentissage des concepts préliminaires en programmation dans le contexte des écoles maternelles à l’aide des outils de robotique et plus précisément des jouets programmables. On présente d’abord la problématique concernant l’introduction de la robotique pédagogique à l’école maternelle, ensuite on met l’accent sur la scénarisation pédagogique pour aborder les notions de programmation à la petite enfance et, enfin, on discute les premiers résultats de la recherche.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:cUMtEw7vMgQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using learning analytics to identify successful learners in a blended learning course",
            "Publication year": 2013,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJTEL.2013.059088",
            "Abstract": "In this paper, students’ practices while using a Learning Content Management System in a blended learning environment were examined. This is a case study involving 337 students who attended an academic course based upon a blended learning approach over three years using Moodle. Eighteen variables depicting the students’ perceptions of Moodle, as well as their interaction with it, were examined using four complementary data mining and statistical analysis approaches: visualisation, decision trees, class association rules and clustering. The analysis of the collected data shows that failure in the course was associated with negative attitudes and perceptions of the students towards Moodle. On the other hand excellent grades were associated with increased use of the LCMS. Requirements elicitation of a learning analytics dashboard, are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Robotics and programming concepts in Early Childhood Education: A conceptual framework for designing educational scenarios",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-6501-0_8",
            "Abstract": "This chapter addresses the teaching of programming through robotics in early childhood education. It discusses the integration of education robotics principles and algorithmic and programming concepts in order to conceive, design and evaluate educational scenarios (didactic sequences). It then proposes a conceptual framework for designing educational scenarios that integrate programmable toys as a guide to teaching programming concepts. A descriptive analysis of the implementation of educational scenarios by in-service early childhood teachers in typical classrooms covers methodological issues emerging from this framework. Furthermore, it provides research results to encompass the conception and designing of educational scenarios in early childhood educational contexts concerning robotics.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:00hq1xGbIBsC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Opening up university courseware: Lessons learned",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=6985830136466108371&hl=en&oi=scholarr",
            "Abstract": "The process of opening up course ware and in general education is often tedious, in particular for small to medium size public Universities. This is particularly the case in recent times that these Institutions strive for resources as cuts and austerity measures affect public education. Yet in Greece, in the middle of a major economic crisis the Open Courseware project was implemented as a large scale action aiming at development of open courses in many Greek Universities. The University of Patras was particularly active in this. It develops a large number of open courses by the end of 2015 in many different disciplines. The lessons learned during the process are discussed in this paper, with main focus on technological and organizational problems and pitfalls, faculty reservations and attitudes, often found in Universities with similar characteristics.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:cocyvO7vrcwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "L'école primaire et les technologies informatisées: des enseignants face aux TICE",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=11335154872475103648&hl=en&oi=scholarr",
            "Abstract": "L'école primaire serait-elle un lieu protégé des évolutions techniques parfois un peu effrayantes qui déferlent dans la société? Ou bien ne serait-elle pas au contraire un laboratoire d'innovations pédagogiques dont certaines se banaliseront à terme? Elle est en tout cas le lieu central de la formation des générations à venir et, à ce titre, elle a une responsabilité particulière à l’égard des nouveaux défis posés par les nouveaux instruments et ressources dits «numériques» qui apparaissent sans cesse. Le présent ouvrage collectif s’ intéresse à la manière dont notre système scolaire propose des réponses à ces défis. Écrit par des chercheurs de différentes spécialités en vue d’un large public, il offre un panorama de la situation, en s’ intéressant aussi bien à l’utilisation en classe d’instruments mobiles qu’à la pensée informatique et à la formation des enseignants, ainsi qu’à l’enseignement à tous d’une culture numérique.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:3YQzwbzlpKYC",
            "Publisher": "Presses Univ. Septentrion"
        },
        {
            "Title": "Στάσεις και αντιλήψεις εκπαιδευτικών της δευτεροβάθμιας εκπαίδευσης σχετικά με την εφαρμογή των ΤΠΕ στη διδασκαλία τους",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=15070018073438002739&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:W91e3rS6dHEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On analysis of collaborative problem solving: An object-oriented approach",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563202000560",
            "Abstract": "During the last decade an increased interest has been observed on computer-supported collaborative problem solving. This relatively new area of research requires new methodological approaches of interaction and problem solving analysis. Usually analysis of collaborative problem solving situations is done through discourse analysis or interaction analysis, where in the center of attention are the actors involved (students, tutors etc.). An alternative framework, called “Object-oriented Collaboration Analysis Framework (OCAF)” is presented here, according to which the objects of the collaboratively developed solution become the center of attention and are studied as entities that carry their own history. This approach produces a reversed view of the process, according to which the solution is made of structural components that are ‘owned’ by actors who have contributed in various degrees to their development …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Effect of algorithms’ multiple representations in the context of programming education",
            "Publication year": 2008,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/17415650810930910/full/html",
            "Abstract": "The purpose of this paper is to compare the effect of different representations while teaching basic algorithmic concepts to novice programmers.A learning activity was designed and mediated with two conceptually different learning environments, each one used by a different group. The first group used the learning environment “Visual Flowchart”, which enables the students to construct and examine an algorithm using visual representation based on actual flowchart objects. The second group used the software “Language Interpreter”, which allows the students to express an algorithms using pseudocode.Analysis of results among the two groups showed no statistically significant differences in the students’ performance with respect to the tool they used to solve the activity, the school stream they followed in high school and their gender …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "Un apprentissage de la programmation dès l’école primaire: le concept de message sur ScratchJr",
            "Publication year": 2018,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/26699/1003362.pdf?sequence=1#page=305",
            "Abstract": "Ce travail est inscrit dans le cadre du projet DALIE de l’Agence Nationale de la Recherche française et son objet d’étude a été d’analyser la manière dont l’usage du logiciel ScratchJr peut permettre aux élèves de primaire de s’ approprier des notions de programmation. Dans ce contexte, nous avons choisi de mener une étude exploratoire dans une école primaire française auprès de douze élèves de cours préparatoire. Nous avons élaboré un scénario pédagogique de dix séances (une activité initiale, une activité de préparation psychologique, sept activités d’apprentissage, commençant par la familiarisation avec les concepts de l’interface et se terminant à l’apprentissage des concepts clés de programmation tels que la répétition et les messages, et une activité d’évaluation) qui visait au développement des compétences de programmation chez les jeunes élèves. Même si nous avons étudié plusieurs concepts différents de programmation comme la séquence, la synchronisation, l’itération, etc., nous avons choisi de nous concentrer dans cet article seulement sur l’analyse du concept des messages. Pour cela, nous allons analyser d’une part les réponses des élèves aux entretiens semi-directifs avant et après la mise en place du scénario pédagogique et d’autre part les programmes développés par les derniers au cours de la séance d’évaluation. Nous allons du coup plus loin que ce qu’on avait fait à Ioannina Touloupaki et al.(2016), où avaient été présentés les résultats qui ressortent seulement par les programmes élaborés au cours de la séance d’évaluation par les élèves de l’école maternelle en Grèce et du primaire en France.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:csTP5AdqY_wC",
            "Publisher": "Peter Lang"
        },
        {
            "Title": "Modeling activities with educational software with regard to computer’s operation",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/42268056/16.pdf",
            "Abstract": "In this work we present the design and the evaluation of a set of educational scenarios with the use of the modelling educational software «ModelsCreator». The scenarios in question are related with the learning of basic significances of computers’ technology in the secondary education. This work aims to contribute in the study of growth and of use of model instructive material based on open educational software on the ground of didactics of Sciences and more specifically on didactics of Informatics.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tools for task-based interaction and collaboration analysis",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=s6YW-cZBTqwC&oi=fnd&pg=PA13&dq=info:osF3JcEK7IMJ:scholar.google.com&ots=T_4C8MSQS8&sig=WU5VtNIdspr_dU8tvpE-MFwl3vI",
            "Abstract": "An innovative framework of interaction and collaboration analysis is proposed, jointly with tools to support the process. The proposed framework is based on a collaboration analysis first and individual task analysis subsequently, approach. The objective of this framework is to facilitate understanding of the group's and individual user's tasks and goals and associate the artifacts used with usability problems. An innovative aspect of the framework is the association of tasks to artifacts (tools) engaged by the users during the activity. The typical use of this framework is in interactive systems evaluation and design. The framework and the tools functionality are described in the paper. The framework is inspired by the Activity Theory perspective, which recognizes the importance of artifacts, actors and the context in which an activity takes place.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A study on heterogeneity during realtime collaborative problem solving",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-017-0195-2_50",
            "Abstract": "This paper discusses the effect of learning material heterogeneity on real-time computer-supported collaborative problem solving. A study has been contacted in the frame of an authentic educational activity in a Greek secondary school. The students involved were provided with sets of primitive resources of varying degrees of heterogeneity to be used during collaborative modelling activities. Analysis of students peer interaction and produced solutions revealed that, contrary to our expectations, the group with heterogeneous resources produced solutions of similar quality to that of the reference group that possessed homogeneous learning material, while they were more active, exchanged more messages, were involved in deeper discussions and overall collaborated in great extend. The reported findings can have implications in the design of education scenarios involving distance real-time collaboration.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Design for mobile learning in museums",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/design-mobile-learning-museums/26724",
            "Abstract": "This chapter discusses the design challenges of mobile museum learning applications. Museums are undoubtedly rich in learning opportunities to be further enhanced with effective use of mobile technology. A visit supported and mediated by mobile devices can trigger the visitors’ motivation by stimulating their imagination and engagement, giving opportunities to reorganize and conceptualise historical, cultural and technological facts in a constructive and meaningful way. In particular, context of use, social and constructivist aspects of learning and novel pedagogical approaches are important factors to be taken in consideration during the design process. A thorough study of existing systems is presented in the chapter in order to offer a background for extracting useful design approaches and guidelines. The chapter closes with a discussion on our experience in designing a collaborative learning activity for a …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Collaborative learning in massively multiplayer online games: A review of social, cognitive and motivational perspectives",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-improving-learning-motivation/52504",
            "Abstract": "In this chapter a theoretical framework is proposed for the investigation of Massively Multiplayer Online Games (MMOGs) as environments for the emergence of collaborative learning. Elements and features of MMOGs such as the integrated tasks, the interactions among players, the groups, the members’ characteristics, and the environment are examined through the perspective of their motivational, cognitive and social potential, based on literature review, interviews with players and participant observation. It is argued that MMOGs are environments that can integrate a wide range of motivational features, opportunities for social interactions and for the emergence of cognitive processes, into a meaningful context. Implications for the educational practice are also reviewed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An environment for constructing and exploring visual models of logic propositions by young students",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_50",
            "Abstract": "This paper presents the main characteristics of Logic Models Creator (LMC). LMC is a new educational environment for young students to build and explore logic models in graphical form. LMC allows visual representation of logic models using IF/THEN/ELSE constructs. In this paper we provide an overview of LMC architecture and discuss briefly an example of use of LMC. As discussed, LMC users in the reported case study managed to achieve effective communication and task evaluation during exploration of problems involving decision making.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Une analyse cognitive et didactique du langage de programmation ScratchJr",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=1xwsDwAAQBAJ&oi=fnd&pg=PA109&dq=info:-yyCumqinfQJ:scholar.google.com&ots=tHMkZOiGlb&sig=suJHsV7-OK6XnIqgdEsKKCczADM",
            "Abstract": "L'apprentissage de la programmation et le développement de la pensée infor-matique pendant la petite enfance reviennent, depuis quelques années, à l'ordre du jour. Cela est notamment dû à des avancées technologiques de deux ordres: l'apparition de tablettes et environnements de programmation visuelle destinés à des petits enfants, ainsi que le renouvellement des approches pédagogiques et des manières de considérer la question. Ainsi, le courant épistémologique promouvant un enseignement de la science informatique à tous les élèves de l'enseignement général (Wing, 2006) a contribué à remettre à l'ordre du jour des approches connues depuis longtemps autour du développement de la pensée logistique et organisées notamment autour du langage Logo (Papert, 1980). La réflexion sur ce qu'est la pensée informatique a occupé dans la dernière décennie une place croissante au sein de la recherche en éducation. En reprenant des préoccupations plus anciennes telles que l'apprentissage de l'algorithmique et de la programmation comme approche cognitive et en les inscrivant dans un contexte plus favorable auxinnovations techno-pédagogiques, ce courant de pensée a trouvé un certain écho dans les prescriptions des programmes scolaires et les pratiques pédagogiques. Comment, dans ce contexte, envisager un développement de la pensée informatique à l'école maternelle? Ce niveau constitue un niveau scolaire où nous ne disposons pas de beaucoup de travaux, à l'exception de ceux effectués dans les années 1980, à partir de Logo.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:9mnZQYLiiboC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ICT and science education: promises and usages. Introduction",
            "Publication year": 2012,
            "Publication url": "https://journals.openedition.org/rdst/632",
            "Abstract": "The paragraphs above refer to the beginning of the call for contributions for the topical part of this issue of the journal RDST initially entitled “Networking, design and use of digital resources for the teaching of sciences and techniques”. This call mentioned that the issue was intended to deliver review papers and disseminate new research towards : On the one hand assess the uses of ICT and computing in science and technical education and in training : what developments, what lessons can ...",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:1qzjygNMrQYC",
            "Publisher": "Éditions de l’École normale supérieure de Lyon"
        },
        {
            "Title": "Learning outcomes and processes in massively multiplayer online games: exploring the perceptions of players",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007%252Fs11423-013-9312-7",
            "Abstract": "Over the past decade research has recognised the learning potential of massively multiplayer online games (MMOGs). MMOGs can be used by the technology-enhanced learning research community to study and identify good educational practices that may inspire engaging, creative and motivating approaches for education and learning. To this end, in this research paper, we aim to explore the learning outcomes and processes emerging in the environment of MMOGs by initially studying the relevant perceptions of the players. Based on a theoretical framework referring to the cognitive, the social, and the affective aspects of a technology-supported learning environment, and through a mixed-method research and the analysis of qualitative data from 22 individual and group interviews, and quantitative data from a wider survey (minimum N = 221), we map and examine the cognitive, the skill-based, the …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:eflP2zaiRacC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Bridging the gap between physical and abstract worlds: Capturing observed phenomena in abstract models through ModellingSpace",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1652429/",
            "Abstract": "Observation and understanding of real world activities and phenomena is a basis of inquiry and reasoning and subsequently building of scientific knowledge. This involves moving from the perception of real world phenomena to constructing and exploring qualitative and quantitative relations that hold among the main elements. The transition between the two phases is not always smooth for the learners involved. In this paper, we present tools and activities that attempt to bridge the gap between the physical world experience and the abstract modeling and reasoning phase. Firstly, we discuss a modeling approach and the various representations involved. Then, we present the Video2Frames tool of ModellingSpace which is proposed to be used in order to create educational material by allowing the creation of abstract entities from video recordings of phenomena. Next an example of creation of educational material …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "‘Elven Elder LVL59 LFP/RB. Please PM me’: immersion, collaborative tasks and problem-solving in massively multiplayer online games",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17439884.2010.494429",
            "Abstract": "Although there is strong evidence that massively multiplayer online games (MMOGs) constitute environments of social interactions and effective learning, we currently lack the tools for investigating the effectiveness of the social networks emerging as well as the cognitive aspects and knowledge acquisition such environments involve. Within this context, we present a conceptual framework for the investigation of the collaborative problem‐solving processes emerging in such environments and we apply it in the investigation of a number of MMOGs through interviews and virtual ethnography. Our findings suggest the balanced convergence of multiple factors, such as the mechanics of the game, the design of the tasks, the collaboration and competition affordances and the content of the game, for the constitution of an effective environment for collaborative learning.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:isC4tDSrTZIC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Can distance education courses increase academic motivation?",
            "Publication year": 2008,
            "Publication url": "https://www.learntechlib.org/p/30064/",
            "Abstract": "The goal of this research was to better understand the impact of the implementation of a compulsory Web-based course on preservice teacher motivation. Subjects were enrolled in a four-year teacher education program (n= 429) in the province of Quebec, Canada. Our starting hypothesis was that the Web-based distance education course—designed to promote feelings of self-determination, affiliation, and competence—would positively impact the motivation of preservice teachers registered. The results presented are drawn from both quantitative measures and qualitative measures. Based on Deci and Ryan’s (1985, 2000) self-determination theory, results show that a technologically rich learning environment such as a distance education course can, eventually enhance preservice teachers’ motivation after a few weeks. Results also highlight that such a context promoting self-determination represents somewhat …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "An investigation into the educational affordances of blogs and wikis",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=9401425494714335991&hl=en&oi=scholarr",
            "Abstract": "A blog (weblog) is a frequently updated website consisting of dated entries, in text and multimedia format. In general, a blog is a publishing platform that offers a two way communication (read-write) to its users. It includes hyperlinks to other websites, blogs or other online content resources across the Internet, content organization tools easily customizable in terms of user needs, and many more features.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:UFuRdyijzaAC",
            "Publisher": "European Resource Center for Web"
        },
        {
            "Title": "Analysing students' shared activity while modeling a biological process in a computer‐supported educational environment",
            "Publication year": 2007,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1365-2729.2006.00214.x",
            "Abstract": " This paper reports on a case study with three dyads of high school students (age 14 years) each collaborating on a plant growth modeling task in the computer‐supported educational environment ‘ModelsCreator’. Following a qualitative line of research, the present study aims at highlighting the ways in which the collaborating students as well as the facilitator who supported them are engaged in the computer‐based modeling ‘activity’. The analysis is carried out with a two‐level analytic tool that has been derived within the theoretical framework of ‘activity theory’. Our results show that a wide range of modeling ‘operations’ is activated in the context of the three major modeling ‘actions’ of ‘analysis’, ‘synthesis’ and ‘testing‐interpreting’, which take place in the light of the facilitator‐driven ‘action’ of cognitive and technical support. Moreover, these actions are combined into ‘modeling units’ of various forms which are …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:aqlVkmm33-oC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Πληροφορική στην Εκπαίδευση",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=5828180577210819640&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:6_6x9JMR98MC",
            "Publisher": "Ελληνικό Ανοικτό Πανεπιστήμιο"
        },
        {
            "Title": "Results and prospects from the utilization of Educational Robotics in Greek Schools",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10758-021-09555-w",
            "Abstract": "Nowadays there is a growing research interest in the developments in the domain of Educational Robotics. The present paper is a systematic review of recently published Greek research pertaining to teaching interventions using robotic devices in order to present: a) a synthesis of the available results and the benefits from the utilization of educational robotics and b) a synthesis of research prospects for the educational utilization of robots. After a systematic online search, 54 relevant articles on Greek research approaches and published in conference proceedings were found and their content was analyzed by level of education (i.e., early childhood, primary, secondary). According to the findings of the published research, Educational Robotics appears to support the development of 21st century skills and can be utilized in teaching various subjects at the three levels of education. The conclusions of the …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:fXCg-C-QWH4C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "The implementation of Eduportfolio 3.0 in Canada and Greece: Advantages and challenges for future teachers",
            "Publication year": 2011,
            "Publication url": "https://www.learntechlib.org/p/38405/",
            "Abstract": "In connection with the primary theme of the ED-MEDIA conference, this presentation aims to (1) shed light on the development and features of an eportfolio system that would truly benefit everyone involved in education, both learners and educators; and (2) examine the eportfolio impact (advantages and challenges) on future teachers both in Canada and Greece.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "On tools for analysis of collaborative problem solving",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1215138/",
            "Abstract": "Analysis of collaborative problem solving involves analysis of dialogue and interaction, analysis of tasks and social roles through ethnographic and other field studies. Use of tools to facilitate this process can be very useful. We discuss first the key requirements of a new generation of interaction and collaboration analysis tools. We then present how these requirements have lead to the design of prototype tools, recently developed. These tools can relate and synchronize various streams of field data. An important characteristic of the tools is their support for a multilayer structure of annotations of various levels of abstraction, through which the activity can be interpreted and presented.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analyse des possibilités d’intégration d’un environnement collaboratif de modélisation dans des contextes scolaires contrastés",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/46027474/18.pdf",
            "Abstract": "L’article décrit le processus et les résultats de l’évaluation pédagogique de ModellingSpace, un environnement d’apprentissage collaboratif conçu pour développer les compétences de modélisation scientifique des élèves de 11 à 17 ans. Les auteurs se focalisent ici sur l’évaluation de la mise en œuvre de pratiques pédagogiques nouvelles dans le cadre d’un processus d’implantation qui a été mis en place dans des contextes scolaires authentiques avec l’aide de réseaux de praticiens disséminés dans 4 pays européens: la Belgique, la France, la Grèce et le Portugal.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Instrumental genesis of students’ comparison strategies in a digital environment of dynamic Geometry",
            "Publication year": 2019,
            "Publication url": "https://mmm.library.upatras.gr/index.php/ejupUNESCOchair/article/view/3050",
            "Abstract": "This paper reports on how a different learning approach in the context of digital environment of dynamic Geometry contributes to the construction of a variety of comparison strategies by students, according to the theory of instrumental genesis. We explore how the tool is shaping students’ actions and simultaneously how students shape the tool by attributing to it new uses. In our experiment participated 48 pupils (13-14 years old). From the qualitative analysis of the data comes that the students have dynamically exploited the tools of the educational software Cabri-Geometry II and approached the comparison of lengths in many different ways, most of them unusual for school practice.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:zDhyt2jClVkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of group size in synchronous collaborative problem solving activities",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/11695/",
            "Abstract": "In reported studies of synchronous collaborative problem solving activities, so far, there are usually groups of two partners involved. In this paper, we focus on groups of larger sizes and study through an authentic educational activity the effect of group size on group performance and patterns of interaction. It has been found that it is possible to design learning activities with group sizes greater than two and that the group size affects performance and interaction. It was discovered that group skill balance in particular is an important aspect in this context. Therefore, the designer of such activities should design carefully the activity in order to get most benefits from the collaborative setting.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Player characters as devices for supporting learning in massively multiplayer online games",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Iro-Voulgari/publication/236887919_Player_Characters_as_Devices_for_Supporting_Learning_in_Massively_Multiplayer_Online_Games/links/00b495255d16616920000000/Player-Characters-as-Devices-for-Supporting-Learning-in-Massively-Multiplayer-Online-Games.pdf",
            "Abstract": "In this paper, we explore the potential of player characters, in Massively Multiplayer Online Games, to support learning. We situate our study within a context consisted of the cognitive, the social, and the affective dimensions for the support of learning, on which we map relevant attributes of the player characters. For identifying these attributes, we employed a mixed method research approach and analyzed the perceptions of players based on data from interviews and a survey. Player characters seem to be at the intersection of the game mechanics and the real life player personality and may constitute dynamic elements for supporting learning in a virtual environment.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Discourse for the Integration of ICT in STEM Education: Attitudes Expressed in Texts on Education in Greece (1984-2006)",
            "Publication year": 2016,
            "Publication url": "http://aes.bio.bg.ac.rs/index.php/JSD/article/view/167",
            "Abstract": "In this article an attempt is made to study the attitudes in the “discourse” on the integration of Information and Communication Technologies (ICT) in Science, Technology, Engineering, and Mathematics (STEM) education in Greece during the critical period 1984-2006, the period when the most important programme related to this integration was completed. The approach to the discourse was carried out using quality analysis of texts in the journal “Contemporary Education” through the use of a specialized methodological tool. The results of the analysis revealed that until the middle of the period being examined, there was a strong tendency to adopt attitudes that claimed that the integration of ICTs would bring about and/or should bring about minimal change, while in recent years attitudes which adopt the perspective of real influence of ICTs in the change in teaching practices have started to increase.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:8moDcb_GFzgC",
            "Publisher": "Journal of Subject Didactics"
        },
        {
            "Title": "Designing and Implementing an Innovative Course about World Wide Web, Based on the Conceptual Representations of Students",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.192.9538",
            "Abstract": "Internet is nowadays included to all National Curriculums of the elementary school. A comparative study of their goals leads to the conclusion that a complete curriculum should aim to student’s acquisition of the abilities to navigate and search for information and additionally to emphasize on the evaluation of the information provided by the World Wide Web. In a constructivistic knowledge framework the design of a course has to take under consideration the conceptual representations of students. The following paper presents the conceptual representation of students of eleven years old, attending the Sixth Grade of Greek Elementary School about World Wide Web and their use in the design and implementation of an innovative course.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring group cohesion in massively multiplayer online games",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Iro-Voulgari/publication/282731004_Exploring_Group_Cohesion_in_Massively_Multiplayer_Online_Games/links/561a3af008ae6d17308962fd/Exploring-Group-Cohesion-in-Massively-Multiplayer-Online-Games.pdf",
            "Abstract": "In this study we focused on the identification of factors involved in the cohesion of Massively Multiplayer Online Games (MMOGs) groups. We operationalised cohesion as the forces that keep the group together and the links between group and members. We explored the perceptions of players through a mixed methods research approach, combining qualitative data from interviews and quantitative data from a survey. Our main findings involve the identification of social and achievement oriented factors relevant to the cohesion of the group. Social factors were relevant to the social and interpersonal relations among members, and the identification with the ideology and interests of the other members. Achievement oriented factors involved the benefits of the group for the achievement of the players' own individual goals and progress in the game, the accomplishment of group tasks, the help and support from the group, the quality of collaboration, participation in decision-making processes, justice, and fair distribution of the rewards. We further compared group cohesion with the satisfaction of the players by their groups. Our findings suggest that group cohesion and satisfaction are strongly related. Group cohesion is particularly critical for the development of a common knowledge space and the emergence of effective collaborative learning processes. The implications of this study involve the design elements that could promote cohesion in virtual environments, or the indications to be monitored by educators or coordinators employing gamebased learning, for further timely interventions, so that a learning and gaming experience can be supported and …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:N5XbD978G_MC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "ModellingSpace: Interaction Design and Architecture of a collaborative modelling environment",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64482",
            "Abstract": "This paper describes the architecture of the ModelllingSpace open problem-solving environment. Modelling- Space is a new learning environment supporting synchronous and asynchronous collaborative problem solving by students at a distance. We describe here the key design decisions of the ModellingSpace software and in particular issues related with support for students with heterogeneous sets of primitive entities, control of interaction and dialogue, representation of the entities and models in a format that permits exchange of primitive material, as well as architectural considerations of the distributed application relating to network bandwidth limitations. The paper provides also an outline of server-side tools designed for supporting a community of students, users of the ModellingSpace environment.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "L’étayage des enseignants de l’école maternelle au cours des activités de programmation avec le logiciel ScratchJr",
            "Publication year": 2018,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/47395/9783034333245.pdf?sequence=1#page=293",
            "Abstract": "Cette étude qualitative, qui fait partie du projet de recherche DALIE (Didactique et Apprentissage de l’Informatique à l’Ecole), s’ intéresse à explorer l’étayage de l’enseignant, afin de soutenir ses élèves de 4–6 ans, au cours d’activités de programmation informatique avec le logiciel ScratchJr. De quelle manière le rôle de l’enseignant est-il déterminant pour les acquis d’apprentissage? Nous identifions trois types principaux de manifestation d’étayage: l’étayage cognitif, l’étayage technique et l’étayage émotionnel. Dans ce travail, nous mettons l’accent sur les concepts de programmation qui demandent un soutien spécial de la part de l’enseignant. Il résulte que les notions par rapport au script, au programme et à la séquence sont celles qui nécessitent le plus l’intervention de l’enseignant et exigent donc une attention didactique particulière.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:V8JMcbNWlSUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aspects de la conception d’un environnement collaboratif de modélisation à distance, Desmoulins Cyril, Marquet Pascal, Bouhineau Denis",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12578804857598470634&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:mzRTpvMFn3IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interaction analysis as a tool for supporting collaboration: An overview",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-19814-4_5",
            "Abstract": "This chapter constitutes an overview of logfile-based interaction analysis techniques that can be used for the support of Computer Supported Collaborative Learning (CSCL) activities. Interaction analysis is central in the study of CSCL activities, since in such activities through interactions between partners the state of evolving group knowledge is communicated. This interaction is facilitated by tools that allow logging of events that take place, capturing thus information about the content and the process of collaboration. Automated analysis techniques of this information can be developed. The objective of this analysis is often to support participants, in several ways: explicitly, by providing feedback to them in order to regulate their practices, or by making adaptive changes to some aspects of the collaborative setting; or implicitly, by making available to them representations of their activities. This chapter presents …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Transferring experiences in logo-like environment in computational thinking game design",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Anastasia-Misirli/publication/347246452_TRANSFERRING_EXPERIENCES_IN_LOGO-LIKE_ENVIRONMENT_IN_COMPUTATIONAL_THINKING_GAME_DESIGN/links/60a559da299bf10613406f47/TRANSFERRING-EXPERIENCES-IN-LOGO-LIKE-ENVIRONMENT-IN-COMPUTATIONAL-THINKING-GAME-DESIGN.pdf",
            "Abstract": "A great deal of Computational Thinking is operationalised through computer programming-code literacy [1]. Literacy originally refers to the teaching and learning of reading and writing thus in terms of coding, literacy skills refer to programming languages. In the present study we present an organised digital environment for skills such as: algorithmic design, decomposition, abstraction and model representation [2], that children in preschool and first grades of primary age need to develop in terms of Computational Thinking (CT).We used different robotics devices and programming languages such as Logo, ScratchJr and Scratch depending on the age group and knowledge of students. A scenario-based teaching approach is adopted [3],[4] tracing children's ideas (pre-post tests) for robotics and programming with robust scheduled activities either teacher or child-led initiated: a) preparatory activities, b) activities for the initial knowledge construction, c) activities for the knowledge construction consolidation, d) evaluation activities and e) metacognitive activities.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:R8TPKZP7usQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Handling Signs in Inequalities by Exploiting Multiple Dynamic Representations – the Case of ALNuSet",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s40751-017-0029-9",
            "Abstract": "This article presents a research work aimed to study the role of computational tools in the conceptualization of algebraic properties according to the conceptual framework of instrumental genesis and the Design-Function-Tasks (DeFT) framework of multiple representations at Junior high school level. It concerns a didactical approach which takes advantage of the semiotic representations available by the computational tool ALNuSet in a way that could support students to understand the changing of signs while multiplying inequalities with negative numbers. Forty-eight subjects of the 2nd grade of Greek Junior high school, 13–14 years old, participated in our experiment. We engaged our students in an activity concerning the change of the direction in inequalities when we multiply them by negative quantities, by exploiting the functionalities available in the Algebraic line component of ALNuSet. A qualitative …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:SNyOjmPOlygC",
            "Publisher": "Springer"
        },
        {
            "Title": "Special issue articles Theme: E-learning and Human-Computer Interaction: Exploring Design Synergies for more Effective Learning Experiences",
            "Publication year": 2006,
            "Publication url": "https://www.ds.unipi.gr/et&s/journals/9_4/ets_9_4_contents.pdf",
            "Abstract": "Journal of Educational Technology & Society Page 1 iii ISSN 1436-4522. © International Forum \nof Educational Technology & Society (IFETS). The authors and the forum jointly retain the \ncopyright of the articles. Permission to make digital or hard copies of part or all of this work for \npersonal or classroom use is granted without fee provided that copies are not made or distributed \nfor profit or commercial advantage and that copies bear the full citation on the first page. \nCopyrights for components of this work owned by others than IFETS must be honoured. \nAbstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to \nredistribute to lists, requires prior specific permission and/or a fee. Request permissions from the \neditors at kinshuk@massey.ac.nz. ISSN 1436-4522 (online) and 1176-3647 (print). © \nInternational Forum of Educational Technology & Society (IFETS). The authors and the forum the . …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contribution à l’étude des raisonnements des élèves sur les acides et bases avec l’utilisation de vidéo, des objets reels et de logiciel éducatif",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Angelique-Dimitracopoulou/publication/338924349_Contribution_a_l'etude_des_raisonnements_des_eleves_sur_les_acides_et_bases_avec_l'utilisation_de_video_des_objets_reels_et_de_logiciel_educatif/links/5e33243092851c7f7f0e9f23/Contribution-a-letude-des-raisonnements-des-eleves-sur-les-acides-et-bases-avec-lutilisation-de-video-des-objets-reels-et-de-logiciel-educatif.pdf",
            "Abstract": "Les dispositifs technologiques destinés à l’enseignement de la physique sont étudiés du point de vue de leur apport, pour la formation des élèves de l’enseignement primaire, aux démarches de modélisation. Questions comme «quels modèles faut-il qu'enseignions-nous afin que les citoyens en général soient alphabets en chimie»,«Quels modèles doivent être développés, être remplacés ou être ajoutés pour que soit-il un individu compétent pour communiquer avec autres individus à une échelle limitée d’applications?» intéressent les scientifiques.Nous nous sommes interrogés sur l’utilisation de ces dispositifs (logiciel éducatif de modélisation appelé ModellingSpace, vidéos). Cela nous a conduit à nous intéresser à la manière dont les élèves grecs, d'âge 11-12 d'ans, traitaient les informations qu’ils appréhendaient à l’écran de la vidéo, l’écran de l’ordinateur (les informations symboliques) et les modèles qu’ils fabriquent à la surface de travail de logiciel de modélisation (la connaissance qu’ils ont bâtie des expériences qu’ils ont effectuées avec des objets quotidiens). Les élèves des classes de primaire ont été interrogés en groupes de trois. Premièrement ils expérimentent avec la vidéo, en suite avec les objets et finalement avec le logiciel. L'enquête s' intègre à la problématique plus générale qui examine les avantages des ces trois outils pédagogiques (vidéo, objets naturels, logiciel éducatif) et à qu'ils peuvent contribuer à la construction de concepts en chimie.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:kVKjLOQJbwAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Étude des processus de construction d'algorithmes et de programmes par les petits enfants à l'aide de jouets programmables",
            "Publication year": 2013,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00875628/",
            "Abstract": "L'objectif du travail est l'étude des processus de construction d'algorithmes et de programmes par les enfants de l'école maternelle en utilisant des jouets programmables. Dans ce cadre, nous avons conçu et implémenté des scénarios pédagogiques dont l'objectif est le développement des concepts préliminaires d'algorithmique et de programmation par les enfants de cet âge. Par une analyse détaillée de la manière avec laquelle une centaine d'enfants de 4 à 6 ans conçoivent, verbalisent et exécutent des algorithmes en utilisant le jouet programmable Bee-Bot nous essayons d'éclaircir certaines questions par rapport à la construction des concepts préliminaires de programmation. Nos résultats montrent que les enfants dans leur majorité construisent des algorithmes séquentiels avec plusieurs commandes (de six à douze). Le débogage devient un processus habituel car le tiers des enfants procède à des corrections effectives de leur programme. Enfin, les enfants mettent en route plusieurs stratégies de programmation.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Les compétences informationnelles des étudiants à l’heure du Web 2.0: proposition d’un modèle pour baliser les formations",
            "Publication year": 2014,
            "Publication url": "https://www.erudit.org/en/journals/documentation/1900-v1-n1-documentation01194/1022859ar/abstract/",
            "Abstract": "Dans notre société dite du savoir, il est plus important que jamais de former les étudiants aux compétences informationnelles. Par contre, plusieurs universités se limitent trop souvent aux modèles plus classiques de ces compétences, comme celui de l’Association of College & Research Libraries (ACRL 2000), qui ne prennent que trop peu en compte les outils et les possibilités du Web 2.0, avec lesquels sont pourtant si familiers les étudiants. Ce texte présente puis critique les modèles plus traditionnels afin de proposer par la suite un nouveau modèle des compétences informationnelles bonifié et à jour. Nous nous efforcerons de montrer en quoi notre modèle allie à la fois les forces des modèles plus classiques issus de la bibliothéconomie et des sciences de l’information, mais également les avantages et les défis du Web  2.0.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:oMtqKo3K3HAC",
            "Publisher": "Association pour l'avancement des sciences et des techniques de la documentation (ASTED)"
        },
        {
            "Title": "Spatial Abilities in Virtual Environment's Learning Spaces",
            "Publication year": 2012,
            "Publication url": "http://150.140.160.61:8000/static/magazine/international/2020/09/28/j35-diplas-komis-2013-spatial-habilities.pdf",
            "Abstract": "The recent three-dimensional virtual environment applications of Virtual Reality have a strong impact on the way the users interact with computer-generated spaces and on the role of the computer as a supportive tool and as a mediator for learning, as well. The researchers in the field of Educational Technology are content to build conceptual frameworks to study the cognitive representations formed by the students in this new technological platform and the students' knowledge acquisition. Moreover, they provide the students with virtual environment applications for learning in various domains. Such an approach to the study of learning is presented here, concerning the investigation and evaluation of factors that seem to be important and particularly decisive for the spatial perception. The learners were engaged with specific tasks inside an interactive 3D virtual space modelled using desktop virtual reality technology for learning. The experimental processes that were designed provided our research team with useful data and first conclusions for further research.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "L’introduction des TIC dans l’enseignement universitaire en Grèce: une étude de cas centrée sur la formation des futurs enseignants de l’Université de Patras",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Ravanis/publication/236577610_Komis_V_Filippidi_A_Karalis_T_Tselios_N_Ravanis_K_2008_L'introduction_des_TIC_dans_l'enseignement_universitaire_en_Grece_une_etude_de_cas_centree_sur_la_formation_des_futurs_enseignants_de_l'Universit/links/0c9605180447a0d140000000/Komis-V-Filippidi-A-Karalis-T-Tselios-N-Ravanis-K-2008-Lintroduction-des-TIC-dans-lenseignement-universitaire-en-Grece-une-etude-de-cas-centree-sur-la-formation-des-futurs-enseignants-de-lUniv.pdf",
            "Abstract": "Dans ce travail, nous présentons une étude de cas concernant l’utilisation des Technologies de l’Information et la Communication (TIC) dans le département d’éducation de l’université de Patras en tant qu’outil complémentaire pour la formation initiale des futurs enseignants. Plus précisément, l’objectif du présent travail est l’étude des pratiques innovantes de pédagogie universitaire basées sur des plateformes d’enseignement en ligne qui complètent les formations traditionnelles pour améliorer le processus d’enseignement universitaire et, dans notre cas, l’enseignement en laboratoire (en l’occurrence, des travaux pratiques en groupe dans le laboratoire d’informatique). L’étude a duré pendant un semestre au sein d’un cours obligatoire concernant l’usage éducatif des TIC. Nous avons utilisé la plateforme Moodle comme outil auxiliaire d’organisation du cours et de ses travaux dirigés et pratiques. Nos résultats montrent a) que les conceptions des étudiants sont très favorables à l’usage de tels outils et b) qu’il y a plusieurs pratiques d’usage de la plateforme par les étudiants et ces pratiques semblent conditionner de manière significative leurs apprentissages au terme du cours.Introduction-considérations théoriques",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:52neCvzbxIwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The role of real and virtual experiments in science learning",
            "Publication year": 2005,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64642",
            "Abstract": "Learning science requires understanding of concepts and formal relationships, a process that has often proved difficult for students. Numerous experiments for use in physics instruction are provided using different pedagogical tools. The paradigm described here adopts a socio-constructivist approach, where the student takes an active role in the construction of his knowledge, and it exploits three different media: a video in order to motivate students’ interest; objects from everyday life for the experiments; the technology-based learning environment “ModellingSpace”, which emphasize qualitative understanding, semi-quantitative understanding, requiring written explanations and cooperative learning. Results shows that the use of three media is essential in order to advance the reasoning of students in greater depth and pass to formal thought. The realisation of experiments in computer is not contrary to reality, but can supplement it.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "University of Zilina"
        },
        {
            "Title": "Une étude de cas centrée sur les usages des étudiants en sciences de l'éducation concernant les moteurs de recherche",
            "Publication year": 2011,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00690088/",
            "Abstract": "Dans ce travail, nous présentons une étude de cas concernant l'utilisation des moteurs de recherche par des étudiants en sciences de l'éducation quand ils travaillent en laboratoire d'informatique. Des usages concernant les moteurs de recherche réalisés durant la recherche d'information pour la résolution de trois problèmes informationnels ont été analysés. Les différences entre la formulation des requêtes dans les trois tâches ont été également étudiées. L'analyse des réponses des étudiants montre que la deuxième et la troisième tâches ont été mieux abordées. L'analyse des données montre que l'intervention didactique concernant le développement des compétences informationnelles a eu une influence positive sur l'usage des moteurs de recherche.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Athènes: New Technologies Editions"
        },
        {
            "Title": "Is searching self-efficacy related to search performance? A study of University students’ Web information searching strategies",
            "Publication year": 2010,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/27/Parissis_et_al_2010_A_study_of_web_information_searc_CceCLmv.pdf",
            "Abstract": "This paper investigates the information searching strategies while using Internet search engines. A case study was conducted in which 107 University students participated. The number of students who succeeded in completing the task and the expressed search strategies used in terms of the keywords, the length of the search engine queries used and the frequency of the logical operators in the searches carried out, were identified. The obtained results were described in accordance with their search engine self efficacy. This study revealed correlations between perceived result confidence, perceived satisfaction and effectiveness of search processes developed for the completion of the activity. The results revealed errors the students commit and misconceptions they have while using information searching strategies.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:o4Qvs5Y5TLQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design of collaboration-support tools for group problem solving",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Vassilis_Komis/publication/228983259_Design_of_collaboration-support_tools_for_group_problem_solving/links/09e4150e09134bcfc9000000.pdf",
            "Abstract": "This paper discusses human-computer interaction in the context of collaboration-support environments. In particular our experience with the design and experimentation with tools to support collaborative problem solving is described. Alternative design options are studied and their effect on synchronous collaboration at a distance, through observation of users’ performance is discussed. The use of collaboration analysis tools, which have been developed in the frame of this research is also outlined.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating Greek students' ideas about forces and motion",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1025457116654",
            "Abstract": "Educational research has shown that high school and university students also follow the Aristotelian idea about motion; for example, a continuous action of a force is necessary to keep an object in motion. The survey presented in this article aims at a deeper investigation of secondary education students' ideas about the forces involved in objects moving under the sole influence of gravity. The main objectives are: (1) to investigate other ideas or difficulties, which intervene and determine students' mental models about motion and force, and (2) to reveal how the students in the sample are grouped according to their alternative conceptions. Our study has been mainly determined by the revision in Science Curriculum established in Greece three years ago. A survey has been administered to a total of 146 students (15–16 years old) attending six typical public high schools in Greece. The results presented show …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:4TOpqqG69KYC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Aspects de la conception d'un environnement collaboratif de modélisation à distance",
            "Publication year": 2003,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00000143/",
            "Abstract": "Dans cet article nous traitons de la conception d'un environnement collaboratif d'apprentissage à distance centré sur le développement de compétences de modélisation scientifique. Dans un premier temps nous exposons les motifs cognitifs et pédagogiques qui nous ont amenés à concevoir cet outil. Ensuite, nous présentons brièvement les résultats des études de cas au cours desquelles ont été effectuées les expérimentations des premiers prototypes de l'environnement. Enfin, nous discutons de l'architecture de l'environnement et de ses principales fonctionnalités avant d'esquisser un plan des recherches à effectuer pour le valider.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Zph67rFs4hoC",
            "Publisher": "ATIEF; INRP"
        },
        {
            "Title": "Interventions portant sur la résolution de problèmes en contexte de recherche d'information: quels impacts sur les perceptions d'auto-efficacité d'étudiants universitaires?",
            "Publication year": 2019,
            "Publication url": "https://www.ijthe.ca/articles/view/361",
            "Abstract": "This study investigates the changes in university students’ perceptions towards the use of Web search engines after their exposure to a teaching intervention centered on the information problem-solving process. A total of 138 students of the Department of Educational Sciences and Early Childhood Education of the University of Patras were surveyed to measure perceived ease of use and usefulness of search engines and search engine self-efficacy. A questionnaire, part of which was based on the Technology Acceptance Model, was developed and distributed to respondents, both before and after the course, to measure their perceptions. The results revealed statistically significant improvement for the ease of use and usefulness of search engines, as well as for search engine self-efficacy.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:MaiMEk8tZqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Players' perceptions on the concept of the\" good player\" in MMOGs.",
            "Publication year": 2013,
            "Publication url": "https://www.academia.edu/download/31275467/2013.FDG.MMOs-IV-final.pdf",
            "Abstract": "In this paper we focus on the concept of the “Good Player” in Massively Multiplayer Online Games (MMOGs). Through a mixed method research (interviews and survey) we explore the perceptions of the players on the criteria that define a good player. We identified skills and qualities that are relevant not only to the gaming skills of the players but also to their personality, behavior, attitudes, and relations with others. These findings further suggest that MMOGs constitute designed environments and also communities with their own rules and expectations from the players. Expertise in MMOGs seems to require additional traits than efficiency in game tasks.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:geHnlv5EZngC",
            "Publisher": "Unknown"
        },
        {
            "Title": "La formation des enseignants du préscolaire et du primaire en Grèce entre 1984 et 2006: contradictions et défis",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Ravanis/publication/215576876_Karalis_T_Ravanis_K_Komis_V_2007_La_formation_des_enseignants_du_prescolaire_et_du_primaire_en_Grece_entre_1984_et_2006_contradictions_et_defis_In_T_Karsenti_R-P_Garry_J_Bechoux_S_Tchameni_Ngamo_eds_L/links/0c960516dd175964b6000000/Karalis-T-Ravanis-K-Komis-V-2007-La-formation-des-enseignants-du-prescolaire-et-du-primaire-en-Grece-entre-1984-et-2006-contradictions-et-defis-In-T-Karsenti-R-P-Garry-J-Bechoux-S-Tchameni-N.pdf",
            "Abstract": "Le texte aborde les évolutions des 20 dernières années de la formation des enseignants du préscolaire et du primaire en Grèce. Il présente notamment les différents cadres de réalisation, les institutions et les procédés de la formation initiale et de la formation continue des enseignants. Les auteurs font un examen critique des avantages et des contradictions qui ont accompagné la création et le fonctionnement des départements universitaires de formation au cours des dernières années. L’analyse met certes en exergue des problèmes de disfonctionnement et d’orientation des départements universitaires de pédagogie, mais souligne aussi divers éléments des programmes de formation et de recherches scientifiques qui annoncent la dynamique des évolutions probables.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching Mathematics in Early Childhood Education with ICT: The Views of Two Contrasting Teachers’ Groups",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Lavidas-2/publication/353524567_Teaching_Mathematics_in_Early_Childhood_Education_with_ICT_The_Views_of_Two_Contrasting_Teachers'_Groups/links/6102764a169a1a0103c45ae0/Teaching-Mathematics-in-Early-Childhood-Education-with-ICT-The-Views-of-Two-Contrasting-Teachers-Groups.pdf",
            "Abstract": "Accepted: 12 Jul. 2021 The aim of this study is to compare the views of preschool teachers using ICT to those who do not, on the basis of the benefits and the barriers that ICT bring in teaching and learning mathematics. Twenty preschool teachers took part in this study: nine who do not use ICT and eleven, who do use them for teaching mathematics. Data were collected with semi-structured interviews and analyzed using the thematic content analysis method. Results indicate that preschool teachers, who use ICT in teaching mathematics, teach mathematical concepts such as spatio-temporal, orientation, classification, matching, serializations, quantities, mathematical operations, patterns, comparisons, volume, shapes, and size. Moreover, despite the benefits of ICT observed by teachers of both groups, but mainly from the one using ICT, the overall use of ICT in the teaching of mathematics is obsoleted. The main barriers of ICT integration, according to preschool teachers are the lack of training on its integration and the preschool teachers’ role during the teaching of mathematics. Implications for in-service teacher training and educational policy are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:oi8PhiKYDwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Thinking Skills and Creativity",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/50443751/Scaffolding_through_talk_in_groupwork_le20161120-13375-14wvpr9.pdf",
            "Abstract": "Accepted 27 June 2009 Available online 4 July 2009",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:BMiRioqqltAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Method and Tools for analysis of collaborative problem-solving activities",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Olav-Bertelsen/publication/295847094_Proceedings_of_the_First_International_Workshop_on_Activity_Theory_Based_Practical_Methods_for_IT-Design_Copenhagen_Denmark_September_2-3_2004/links/572b0f9c08ae057b0a08c7ba/Proceedings-of-the-First-International-Workshop-on-Activity-Theory-Based-Practical-Methods-for-IT-Design-Copenhagen-Denmark-September-2-3-2004.pdf#page=7",
            "Abstract": "This paper provides an overview of the “Object-oriented Collaboration Analysis Framework (OCAF)” a method proposed for analysis and evaluation of collaborative problem solving activities of groups of actors, mediated by collaboration-support technology. This framework puts emphasis on the abstract and tangible objects that appear during the development of a solution to a given problem. The notions of the “objects’ histories” and “objects’ ownership” are introduced by this analytical framework. In the paper tools that have been developed to support this framework are described, together with extracts of studies that have been undertaken, during which OCAF has been effectively used.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Projet PanAf (Agenda panafricain de recherche sur l’intégration pédagogique des technologies de l’information et de la communication) : les opinions de ses chercheurs",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Vassilis_Komis/publication/316232170_Projet_PanAf_Agenda_panafricain_de_recherche_sur_l'integration_pedagogique_des_technologies_de_l'information_et_de_la_communication_les_opinions_de_ses_chercheurs/links/5c9dd0db92851cf0ae9e3f2f/Projet-PanAf-Agenda-panafricain-de-recherche-sur-lintegration-pedagogique-des-technologies-de-linformation-et-de-la-communication-les-opinions-de-ses-chercheurs.pdf",
            "Abstract": "Le présent article est issu d’une évaluation du projet PanAf («Agenda panafricain de recherche sur l’intégration pédagogique des TIC»)(Karsenti et Collin, 2012), soutenu par le Centre de recherche et de développement international (CRDI) et l’Université de Montréal.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:YXeC4bxG7-IC",
            "Publisher": "Frantice"
        },
        {
            "Title": "University teaching versus the MOOC: Reports from the field, current trends, and future directions",
            "Publication year": 2015,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3166968",
            "Abstract": "Despite the fact that some researchers consider the MOOC the most important experiment to date in university teaching, and despite the fact that The New York Times named 2012 “The Year of the MOOC”, we now realize that this new form of university teaching poses a number of challenges for designers, educators, and students alike. We also note a growing trend: the success of a MOOC is not necessarily measured in terms of the number of students who complete the course, but instead the number of students who enroll in it. These steep drop-out rates have been called a “funnel of participation”.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:gNZucvRojEcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Portrait critique de la pratique réflexive",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=9079409804432652659&hl=en&oi=scholarr",
            "Abstract": "L’inclusion de la pratique réflexive (Dewey, 1933; Schön, 1983) en formation initiale des maîtres s’ inscrit dans un mouvement international prenant place à partir des années 80 et dont l’objectif est de faire de l’enseignement un objet de réforme pour en accroître la qualité (OCDE, 1989). Elle forme désormais une compétence professionnelle dans la plupart des programmes de formation initiale des maîtres (Richardson, 1990) et constitue également un paradigme éducatif dominant (Paquay, 1994; Zeichner, 1983). Le fort intérêt que suscite la pratique réflexive en formation initiale n’est pourtant pas sans questionnement, lequel semble d’autant plus légitime que ce concept reste peu clair et peu consensuel au niveau théorique (Beauchamps, 2006; Fendler, 2003).Ayant pour finalité de contribuer à éclaircir la pratique réflexive (ses apports, ses limites, sa place) en formation initiale des maîtres, l’objectif de cet …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:s-mE-ZzancgC",
            "Publisher": "Récupéré sur https://www. karsenti. ca"
        },
        {
            "Title": "Tools to support interaction and collaboration analysis",
            "Publication year": 2003,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/28/Avouris_etal_2003.pdf",
            "Abstract": "Analysis of interaction between computer artefacts and learning actors in the context of collaborative problem solving is a tedious process, which needs to be supported by appropriate tools. In this paper we present tools, recently developed, that can support interrelation and synchronization of various streams of field data. A key characteristic of these tools is their support for a multi-level structure of annotations, through which the problemsolving activity can be interpreted and presented. This multi-level representation can be inter-related to the raw field data, and can drive the navigation of the researcher in the activity data. An example of use of these tools for analysis and evaluation of a collaborative problem solving activity is presented in the demo that accompanies this paper.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Don't leave me alone: effectiveness of a framed wiki-based learning activity",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2038558.2038567",
            "Abstract": "In this paper, the effectiveness of a framed wiki-based learning activity is examined. A one-group pretest-posttest design was conducted towards this aim. The study involved 146 first year university students of a Greek Education Department using wikis to learn basic aspects and implications of search engines in the context of a first year course entitled\" Introduction to ICT\". Data analysis showed significant improvement in learning outcomes, in particular for students with low initial performance. The average students' questionnaire score jumped from 38.6% to 55%. In addition, a positive attitude towards using wikis in their project was expressed by the students. The design of the activity, the context of the study and the results obtained are discussed in detail.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Examining Student Teachers’ Perceptions and Attitudes towards Game Based Learning",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3402942.3409611",
            "Abstract": "Although the appropriate design of the game is crucial for the attainment of learning objectives in game based learning, in formal education settings the role of the educators is critical. The experience and the competences of the educators are important for the success of the game based educational intervention. Our study is situated in this context, examining the perceptions, experience, and intentions to use digital games of student teachers. Our goal is to identify and propose areas where student teachers may be supported during their studies so that they are better prepared to implement games in primary and secondary education. The sample of this study was 125 university students who may potentially become primary and secondary education teachers. Data were collected through an online survey in Universities in Greece and analysed statistically. The results indicate that game experience and perceived …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:WYtWvJut7doC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Logging of fingertip actions is not enough for analysis of learning activities",
            "Publication year": 2005,
            "Publication url": "https://ivi.fnwi.uva.nl/tcs/QRgroup/AIED2005/W1proc.pdf#page=6",
            "Abstract": "In this paper we discuss key requirements for collecting behavioral data concerning technology supported learning activities. It is argued that the common practice of collecting machine generated logfiles of user actions is not enough for building a thorough view of the activity. Instead more contextual information is needed to be captured in heterogeneous media like video, audio files, snapshots, etc in order to re-construct the learning process. A software environment (Collaborative Analysis Tool ColAT) that supports inter-relation of such resources in order to analyse the collected evidence and produce interpretative views of the activity is described.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detecting errors during the construction of mathematical formulas in a spreadsheet environment: An empirical study involving novice users",
            "Publication year": 2017,
            "Publication url": "https://www.academia.edu/download/61457896/Lavidas__Komis__Voulgari_-_201720191208-72418-168smai.pdf",
            "Abstract": "In this study we examine the familiarization of students with the basic functions for formula insertion in a general purpose spreadsheet software. Two teaching interventions and two respective follow-up tests were conducted to 124 students of Educational Sciences, with little prior experience in the use of spreadsheets. Through the data collected (test results, registration forms for the students to record any difficulties they had during the tests, video captures of the interactions of the students with the software during the tests) the errors the students made and also any attempts to correct these errors were identified. Our findings indicated that the software error messages and the unexpected results were the main events that prompted the students to recognize their errors.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:96M4k3P_OWMC",
            "Publisher": "SCIREA"
        },
        {
            "Title": "L’enseignement des tableurs dans le collège grec: étude des cas et implications pour une approche interdisciplinaire",
            "Publication year": 2006,
            "Publication url": "http://150.140.160.61:8000/static/book/chapter/2021/01/08/ch3-komis-et-al.pdf",
            "Abstract": "Cet article s’ inscrit dans une recherche dont le but est d’étudier la place des tableurs dans le collège grec selon trois axes: l’axe du prescrit des programmes scolaires en informatique; l’axe des problèmes didactiques posés par les concepts de base des tableurs; l’axe d’une approche interdisciplinaire considérant les tableurs comme des outils de modélisation dans des différentes disciplines. Dans le système éducatif grec, le tableur est enseigné pour lui-même et une étude de cas montre que les élèves ont des difficultés à réinvestir ces connaissances dans le cadre de la résolution de problèmes de mathématiques. Ce résultat tend à montrer que l’utilisation efficace de progiciels spécialisés, comme c’est le cas du tableur, nécessite la mise en place d’un cadre conceptuel qui conjugue ceux de diverses disciplines.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IRDP"
        },
        {
            "Title": "Online versus face-to-face collaboration in the context of a computer-supported modeling task",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S074756321400243X",
            "Abstract": "This paper examines the differences between online synchronous and offline face-to-face collaboration in the context of a computer-supported modeling task. A mathematical problem was designed and set to the participants to solve. Their modeling process using ModellingSpace, a collaborative computer-supported educational environment, was monitored. 16 ninth grade students participated in the study, all worked in groups of two. Eight groups worked online, the remaining 8 offline. The analysis focused on the identification of students’ cognitive modeling strategies, their interactions and the learning gain for each type of collaboration. Both qualitative and quantitative approaches were adopted as well as two complementary coding schemes to better investigate the peers’ interactions. The results obtained suggest that pairs who worked online emphasized analysis and synthesis; they also demonstrated a higher …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:e0CZ6poB34oC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "L’usage des outils informatiques en analyse des données qualitatives",
            "Publication year": 2013,
            "Publication url": "https://www.adjectif.net/spip/spip.php?article216",
            "Abstract": "La Recherche Qualitative constitue un type de recherche en pleine évolution et elle a été métamorphosée par les technologies informatiques.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:b8wqy9DyMDUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Antecedents of collaborative learning in massively multiplayer online games",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28586-8_12",
            "Abstract": "Massively Multiplayer Online Games (MMOGs) are rich in goal-oriented activities and collaborative and social interactions, both essential for learning the game and progressing. In this chapter we employ a theoretical framework for linking learning and collaborative learning principles with MMOGs and investigate, through an exploratory and qualitative approach, features of the tasks, groups, and player interactions that may support the emergence of collaborative interactions and learning. The critical role of both the design of the environment and of the community of players is highlighted and it is concluded that their balanced inter-connection is critical for the emergence of effective collaborative interactions. Implications on further research are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Διδακτική της Πληροφορικής, Πρακτικά 4ου Συνεδρίου",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:-cHHJ4ChvFsC",
            "Publisher": "Εκδόσεις Νέων Τεχνολογιών, ISBN: 978-960-6759-07-9"
        },
        {
            "Title": "Εισαγωγή στις εκπαιδευτικές εφαρμογές των Τεχνολογιών της Πληροφορίας και των Επικοινωνιών",
            "Publication year": 2004,
            "Publication url": "https://dspace.lib.uom.gr/handle/2159/13504",
            "Abstract": "If you requested a file, please note that all items in our system that are freely accessible do not require any kind of authorization such as system registration or password.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:SZzxPo9m4nkC",
            "Publisher": "Εκδόσεις Νέων Τεχνολογιών"
        },
        {
            "Title": "Didactics of Informatics: from the Formation of the Scientific Field to the Conjunction among Research and School Practice",
            "Publication year": 2001,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/28/Komis_WorkShop_DidacticsOfInformatics.pdf",
            "Abstract": "In this article we attempt a short description and study concerning the basic concepts of Didactics of Informatics. Particularly, we discuss about the required didactic transposition of scientific concepts, meaning the mechanism that allows the transition from the scientific knowledge to a “teaching subject” and the teaching contract that determines the interaction in the classroom. We also consider the students’ representations regarding Informatics technologies and notions, and the socio-cognitive conflict procedures that should be favored in order to promote the necessary conceptual change.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Etude de la contribution des tableurs dans le processus de résolution des problèmes en mathématiques",
            "Publication year": 2007,
            "Publication url": "http://150.140.160.61:8000/static/magazine/international/2020/09/12/Skhole.pdf",
            "Abstract": "Le présent article a comme objectif l’étude de la contribution des tableurs dans la résolution des problèmes mathématiques. Une étude de cas a été menée pendant laquelle le tableur est utilisé comme outil de médiation dans des situations de résolution de problèmes algébriques. Trois paires d’élèves du collège ont résolu un problème ouvert concernant les notions de proportionnalité et de proportionnalité ouverte à l’aide du logiciel Excel. Une analyse qualitative des actions et des dialogues des élèves pendant la résolution du problème montre que les caractéristiques de base des tableurs pouvant contribuer de manière essentielle à la résolution des problèmes algébriques sont doubles: la représentation dynamique des données et l’automatisation des calculs.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ZbXHRDTBJTgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Students’ Perceptions",
            "Publication year": 2009,
            "Publication url": "https://iamlearn.org/wp-content/uploads/2018/01/mLearn2009_Proceedings.pdf#page=34",
            "Abstract": "In this article we investigate how university students are using handhelds and laptops for learning in formal and informal contexts, and which will be the ideal mobile learning device. By conducting exploratory research we focussed on students’ perceptions related to the use of these mobile devices. The results of our research indicate that students would like to have a device which should be a perfect combination of both a PDA (personal digital assistant) and a laptop so that it can adapt to various learning contexts: at home, at university, at the library and on the go.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:InLRhUNj-rwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring the scope and the conceptualization of computational thinking at the K-12 classroom level curriculum",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-93566-9_10",
            "Abstract": "The high impact of computer science (CS) in science, economy, and society has increased the international dialogue about the role of computational thinking (CT) in education. No sooner had this discussion come to a closing than several curricula developed, in the framework of various initiatives for the promotion of CT in K-12 education. In the meantime, concerns that CT is neither a unique and distinctive nor an adequate characterization of CS (Denning, Commun ACM 52:28–30, 2009), and thus supports a limited view of the role of CS in general education, were expressed. This chapter explores the conceptual interpretation of CT in widely known K-12 curricula. Furthermore, the paper explores the understanding of CT by the teachers as this is depicted in the pedagogical translation (Deng, J Curriculum Stud 41:585–604, 2009) of the curricula into learning activities. More specifically, directed qualitative …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:ECvNt0vk_34C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Les «Objets d’Apprentissage» à l’enseignement: quels choix didactiques et épistémologiques?",
            "Publication year": 2011,
            "Publication url": "http://nemertes.library.upatras.gr/jspui/handle/10889/13521",
            "Abstract": "Dans le présent article, des issues concernant l'utilisation éducative des Objets d’Apprentissage sont discutées en soulignant le développement d'un cadre conceptuel basé sur le champ de la Didactique des objets spécialisés d’enseignement. Les tendances traditionnelles et contemporaines, en vue de la relation entre Objets d’Apprentissage et Éducation, sont décrites, alors que des questions concernant cette relation sont posées. De plus, quelques concepts-clés qui permettent la constitution d'un cadre relatif à la création des Objets d’Apprentissage sont présentés. Dans ce cadre, l'étude des Objets d’Apprentissage peut être compatible avec les fonctions éducatives et sémiotiques que ces concepts-clés experiment.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:R0GtuAMwyXEC",
            "Publisher": "Le Gerflint"
        },
        {
            "Title": "\" Playing with\" museum exhibits: designing educational games mediated by mobile technology",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1551788.1551837",
            "Abstract": "In this paper, we describe two educational games mediated by mobile technology which were designed for use in the context of a traditional historical museum by young children. Our analysis focuses on the principles of the educational design, on the use of mobile technology and on the envisaged interaction between the exhibits and the children. The main argument of the paper is that mobile technology can support the play with the exhibits of a museum-instead of just viewing them in the more traditional way--and in this context the spectrum of children interaction with the exhibits can be broadened and enriched.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design Principles for an Open and Wide MODELLINGSPACE for Learning, Modelling & Collaboration in Sciences and Mathematics, In (Ed) C. Constantinou “Computer Based Learning in Sciences",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=12375108988203910911&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Digital games in early childhood education: greek preschool teachers’ views",
            "Publication year": 2021,
            "Publication url": "https://mmm.library.upatras.gr/mje/article/view/3764",
            "Abstract": "Research examining preschool teachers' views on the use of digital games in teaching and learning is quite limited. This study aims to investigate preschool teachers’ views about the integration of digital games in the classroom. Views from ten Greek preschool teachers were collected with semi-structured interviews and analyzed using thematic content analysis. Teachers mention that use various digital environment such as\" KidMedia\",\" RamKid\",\" Kidepedia\",\" TuxPaint\" as digital games and use them mainly for students’ assessment or just for relaxation, while fewer choose to teach through digital games. Teachers observe that children are more focused and are more productive without complaining and getting bored easily. Finally, participants report as barriers mainly the lack of equipment. Implications for in-service teacher training and educational policy are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Sg-YnEhjH50C",
            "Publisher": "Unknown"
        },
        {
            "Title": "L'enseignement de l'enseignement de l'enseignement de l'Informatique scolaire à grande échelle: le cas de la Grèce",
            "Publication year": 2013,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00875676/",
            "Abstract": "L'objectif du travail est de présenter les grandes lignes d'un programme de formation à l'enseignement de l'Informatique dans le système scolaire grec. Ce programme s'inscrit dans un plus vaste projet concernant l'introduction de l'informatique dans le système scolaire grec.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Tool to Support Interaction and Collaboration Analysis of Learning Activity",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.105.6204",
            "Abstract": "An increasing amount of data is collected today during studies in which students and educators are engaged in learning activities using information technology and other tools. These data are indispensable for analysis and evaluation of learning activities, for evaluation of new tools and for students’ meta-cognitive activities. The data can take various forms, including video and audio recordings, log files of computing-related activity, field notes, results of students work in electronic or other forms, activity sheets etc. The need for analysis tools, which can annotate these data, classify them, process them and facilitate their inspection, is of increased importance especially for science education, since the latter involves experimentation and use of laboratory and other equipment that necessitate thorough off-line analysis and evaluation. In this paper we discuss first the key requirements of a new generation of interaction and collaboration analysis tools. We then present how these requirements have lead to the design of a prototype tool, recently developed. This tool can relate and synchronize various streams of field data. An important characteristic of the tool is its support for a multi-layer structure of annotations of various levels of abstraction, through which the activity can be interpreted and presented. This multi-layer representation can be inter-related to the raw field data, and can drive the navigation of the researcher in the activity data. An example of use of this tool for analysis and evaluation of a collaborative problem solving activity is also included. KEYWORDS Behavioural analysis tools, computer-supported collaborative problem solving, video …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:6MVT8mER-OMC",
            "Publisher": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.105.6204"
        },
        {
            "Title": "PanAf Project (Pan-African Research Agenda on Pedagogical integration of Information and Communication Technologies): the views of its researchers",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=16997755880600724979&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:LYDvBi7O6RsC",
            "Publisher": "UNIV LIMOGES"
        },
        {
            "Title": "of an Open Educational Robotics Platform",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZVdxDwAAQBAJ&oi=fnd&pg=PA338&dq=info:RNeAID7bTtgJ:scholar.google.com&ots=SjDTZ9_pDR&sig=HFd70OkperjhhC88gqSUOx2gBKY",
            "Abstract": "Children’s learning in terms of programming is an objective nowadays, while environments that can effectively support the ability to understand these more profound concepts are limited. There are many and important reasons why computer programming, and particularly computational thinking (Wing, 2006), should be introduced as a subject in schools from the early ages. First of all, engaging a child with programming concepts helps him to strengthen his logical thinking. Although there are many programming languages that can be used in school, most do not have the proper features to be used by preschool and primary-school students. The difficulty concerns either the abstract structure of the programming language (eg, difficulty in learning how to compose the command semantics) or the language development environment that is unfriendly to users of this age. Research findings support that programming for kindergarten children is possible (Fessakis, Gouli, & Mavroudi, 2013; Misirli, 2015), but it should be done within a specific framework that provides easy and tangible handling and is motivational for children (Misirli, 2015). The most popular robotic constructions used as tools for the development of the algorithmic thinking of preschool and primary-school children (Table 21.1) consist mainly of closed-type software and hardware. This fact restricts their uses, which in any case are not inexhaustible, particularly in the case of young children whose capabilities to handle algorithmic concepts are limited due to their age. The main purpose of the already existing robotics platforms for preschool and primary-school children is their integration in …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:rsrKZ8bNWIsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Former les enseignants et les formateurs pour l’éducation formelle et non formelle: une discussion ouverte et continue en Grèce",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=9890984613821424693&hl=en&oi=scholarr",
            "Abstract": "Cet article tente un aperçu sur la formation des enseignants de l’éducation formelle et des formateurs des réseaux de l’éducation informelle en Grèce depuis les années 1980. D’abord, l’article présente les aspects essentiels des systèmes de formation des enseignants de tous les niveaux et contextes. Ensuite, l’article critique l’évolution du système de formation des différents niveaux d’éducation, les contradictions et les avantages de divers dispositifs et les perspectives d'avenir. Enfin, une attention particulière est portée sur les aspects de la formation pratique des enseignants qui revêt plusieurs formes selon le niveau d’enseignement (primaire, secondaire, etc.) et l’évolution chronologique.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ipSP0SfFaZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualization of synchronous collaborative modeling activities",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357763/",
            "Abstract": "This paper presents Synergo, a collaboration support environment that monitors the activity and permits visualization of various quantitative parameters, like density of interaction, symmetry of the activity, degree of collaboration etc, particularly useful for understanding the mechanics of collaboration. Synergo has been proposed as a testbed for analysis of small-group model-building synchronous interaction.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Symposium Learning environment design for modelling activities in a social context: the venture of modellingspace",
            "Publication year": 2003,
            "Publication url": "https://gnosis.library.ucy.ac.cy/bitstream/handle/7/64481/C1_Dimitracopoulou_LEARNING%20ENVIRONMENT%20DESIGN%20FOR%20MODELLING_CBLIS_2003.pdf?sequence=2",
            "Abstract": "Modelling, especially dynamic modelling, for many students of secondary education, is an extremely difficult cognitive activity. Professional tools are too hard for novices to use, user-unfriendly, and do not provide support for learners. Over the last decade, the interest in modeling activities and the possibilities offered by technology have led to the development of a number of systems addressed to young students (eg Model-It, SimQuest, Modellus, etc).",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:VFGfXyYpp08C",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "On studying collaborative learning interactions in massively multiplayer online games",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5962087/",
            "Abstract": "In this paper we propose and apply a framework for the investigation of the potential of Massively Multiplayer Online Games (MMOGs) for collaborative learning. We focus on the group structure and processes. The findings suggest the interconnection of design features and players' practices.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:2P1L_qKh6hAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characteristics of primary school students' Scratch code",
            "Publication year": 2020,
            "Publication url": "https://www.academia.edu/download/63641510/C2020_ScratchCode.pdf",
            "Abstract": "In the present study we discuss characteristics of primary school students’ Scratch code. Characteristics of code that appear in other Scratch code analyses include a) Dead code, b) Initialization problems, c) Extremely Fine-Grained Programming (EFGP), d) Duplicate code and e) Long scripts. Does student code reflect code that is found in large Scratch project repositories or other settings? Does student code have other characteristics? We taught two fifth-grade classes (23 students each) Scratch for 9 hours. Learning Scratch was part of a compulsory 1 hour per week ICT course. After each hour we gathered students' projects that comprised our data (code base). The analysis of the code base showed that many of the characteristics of code that were found elsewhere were also present in the classroom, namely, dead code, initialization problems and EFGP. Duplicate code and long scripts did not appear in the code base in a large percentage. We also discovered that students’ projects featured race conditions and code that had no effect. Such codes provide learning opportunities. When students create these types of codes, they face a problematic situation and they will have to reflect on their code. Since Scratch makes tinkering easy by design, they may find a way to move forward, otherwise the teacher should be able to assist them.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ZM__uENUXnMC",
            "Publisher": "Constructionism 2020"
        },
        {
            "Title": "Design principles for the support of modelling and collaboration in a technology-based learning environment",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2005.006791",
            "Abstract": "The aim of the paper is to present and discuss the main design concepts and principles, for a collaborative modelling environment for sciences addressed to young students 11–16 years old. The main issues under discussion concern central design questions such as: what must the main modelling primitives be when addressing young students belonging to a wide range of cognitive possibilities? In what specific ways can we support students' reasoning offering multiple representations? How can we ensure flexible collaboration and how can we support related needs in a community level? Furthermore, how can we support self-regulation and metacognitive development for students and how can we support teachers when working in typical school conditions? This paper, which focuses on the design principles, briefly presents the derived developed tools and functionalities of a collaborative modelling environment …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:ufrVoPGSRksC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Pour Comprendre Les MOOCs: Nature, Enjeux Et Perspectives (Understanding MOOCs: Nature, Issues and Perspectives)",
            "Publication year": 2017,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3134176",
            "Abstract": "Depuis l’apparition des MOOCs (Massive Open Online Course ou cours en ligne ouvert et massif [CLOM]), il y a un peu plus de 10 ans, la perception qu’en ont les chercheurs et le grand public a bien changé. On est passé d’une vision idéaliste à une conception plus réaliste des enjeux éducatifs et des implications financières associés à cette nouvelle modalité d’apprentissage.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:WTkkuPxyGkUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Player motivations in massively multiplayer online games",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901447/",
            "Abstract": "In this paper we explore the motivations of players for engagement in Massively Multiplayer Online Games (MMOGs). We employ a mixed method research (qualitative and quantitative approach) and identify aspects of MMOGs that motivate players, such as the sociability, the achievement, the challenges, the competition, and elements increasing immersion. We situate the findings within a learning context and discuss how these aspects further increase the effectiveness of a learning environment.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:38eRAUXPO10C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modelling interaction during small-group synchronous problem-solving activities: The Synergo approach",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.117.9727&rep=rep1&type=pdf#page=13",
            "Abstract": "Monitoring and analysis of activities of small groups of students-collocated or at a distance-engaged in synchronous collaborative problem solving activity is the subject of this paper. This is discussed in the frame of Synergo, a new synchronous collaboration support environment that monitors the activity and permits visualization of various quantitative parameters, like density of interaction, symmetry of partners’ activity, degree of collaboration etc, particularly useful for understanding the mechanics of collaboration. Synergo has been used for synchronous building of flow charts, concept maps, entity-relation diagrams and other semantic modeling activities by small groups of students and has been proposed as a testbed for micro-analysis of small scale interaction in order to gain an insight in collaborative learning.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spreadsheets as cognitive tools: A study of the impact of spreadsheets on problem solving of math story problems",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-011-9174-8",
            "Abstract": "In this study, we investigated the impact of computer spreadsheets on the problem solving practices of students for math story problems, and more specifically on the transition from arithmetic to algebraic reasoning, through the construction of algebraic expressions. We investigated the relationships among the students’ prior knowledge and skills, the verification processes, and the effectiveness of the problem solving tasks. For identifying the factors involved in the problem solving process and their role, in our analysis we employed the Structural Equation Modeling (SEM) approach. We mainly focused on math story problems and on students of tertiary education with little prior experience on the use of computers and spreadsheets. Analysis of the data indicates that spreadsheets can support the transition from arithmetic to algebraic reasoning and this transition is influenced by prior skills of the students …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:yD5IFk8b50cC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Διδακτική της Πληροφορικής",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=14719093457227683353&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:cAUKuAERoUMC",
            "Publisher": "Ελληνικό Ανοικτό Πανεπιστήμιο"
        },
        {
            "Title": "Can Open and Distance Learning Courses Increase Student Teachers Motivation During Their Training?",
            "Publication year": 2006,
            "Publication url": "https://www.learntechlib.org/p/24018/",
            "Abstract": "The goal of this study is to better understand the impact of the implementation of a compulsory Open and distance learning course on preservice teachers' motivation. Subjects were enrolled in a four-year teacher education program (n= 429) in the province of Quebec (Canada). Our starting hypothesis was that the open and distance learning course put in place would have a positive impact on the motivation of the preservice teachers. The results presented are drawn from both quantitative and qualitative data analysis. They highlight how the open and distance learning context put in place, after initially decreasing student teacher motivation, eventually nurtured preservice teachers' motivation.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Social Networks in Massively Multiplayer Online Games (MMOGs): the elusive boundary between the real and the virtual",
            "Publication year": 2012,
            "Publication url": "http://soda.dit.uop.gr/sites/hcivr2.dit.uop.gr/files/publicationfiles/Social_Networks_in_Massively_Multiplayer.pdf#page=25",
            "Abstract": "The Internet constitutes “the world’s largest social science observatory”(Contractor, 2009) while the MMOGs have been described as the “Petri dishes for social science”(Castronova, 2006), as “designed civilisations”,“digital nations” and “third places”(Squire, 2006; Steinkuehler, 2005; 2004). Beyond the designed environment and the gaming aspect, MMOGs constitute virtual spaces rich in social interactions. Players form groups and develop networks of people not only for attaining the goals of the game, but also for socially enhancing their in-game experience (Nardi & Harris, 2006). Our aim is to address the social aspect of MMOGs and discuss the formation and implications of social networks. Based on the analysis of data from virtual ethnography (participant observation, interviews) and questionnaires from our research, we identify issues and questions for further study relevant to the emergence and features of social networks in MMOGs. The main issues that emerged, in relation to the social networks in MMOGs, seem to be the following:",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Examining teachers’ beliefs about ICT in education: Implications of a teacher preparation programme",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/13664530701414779",
            "Abstract": "The survey presented in this article examines current teachers’ beliefs and attitudes towards information and communication technologies (ICT) in education. A total of 1165 primary and secondary education teachers participated in the study, immediately after following a training programme on basic ICT skills. The authors’ results showed that the majority of the teachers in the sample have positive attitudes towards the training programme they attended, the general role that ICT can play in education and the integration of ICT in the educational process. The authors’ findings also revealed some parameters that interfere negatively, thus making many teachers cautious of or sceptical about ICT integration in educational practice. Multivariate analysis identified three groups of teachers that exhibited a consistent approach: a group of teachers having positive attitudes towards the items of the research, a second group …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Routledge"
        },
        {
            "Title": "A methodological framework for investigating TPACK integration in educational activities using ICT by prospective early childhood teachers",
            "Publication year": 2018,
            "Publication url": "https://www.learntechlib.org/p/184091/",
            "Abstract": "This paper proposes a methodological framework for the study of how the Technological Pedagogical Content Knowledge (TPACK) model is integrated into educational activity design and implementation. The proposed framework was elaborated and applied in the context of a course in which student teachers from an early childhood education undergraduate program integrate TPACK into activity design and implementation using information and communications technologies (ICT). The specific methodological framework was designed to take into account the building blocks of TPACK for each part of the course (teaching, designing, and implementing) and to investigate and recombine these using appropriate methods and tools, such as thematic analysis for qualitative data processing and multidimensional data analysis. Findings show that after applying our initial methodological framework, several elements, for …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:-Z8x4v2cOtkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ΑΠΟ ΤΑ ΡΕΑΛΙΣΤΙΚΑ ΠΛΑΙΣΙΑ ΣΤΑ ΜΑΘΗΜΑΤΙΚΑ ΜΟΝΤΕΛΑ. Η ΠΕΡΙΠΤΩΣΗ ΤΩΝ ΓΡΑΜΜΙΚΩΝ ΣΥΝΑΡΤΗΣΕΩΝ ΣΤΗΝ Α'ΛΥΚΕΙΟΥ",
            "Publication year": 2007,
            "Publication url": "https://ejournals.epublishing.ekt.gr/index.php/enedim/article/view/18763",
            "Abstract": "Σκοπός της παρούσας έρευνας είναι να ανιχνεύσει τις ικανότητες μαθητών και μαθητριών της Λ'Τάξης Λυκείου να αντιστοιχίζουν λεκτικά προβλήμα τα σε μαθηματικά μοντέλα που τα περιγράφουν (στη περίπτωση μας μορφές γραμμικών συναρτήσεων).",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:T0nwzvlCxs8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sciences et technologies de l'information et de la communication en milieu éducatif: Analyse de pratiques et enjeux didactiques. Actes du colloque international DIDAPRO 4-Dida&Stic, 24-26 octobre 2011, Université de Patras",
            "Publication year": 2011,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00690147/",
            "Abstract": "Accès direct aux contributions dans les sommaires attachés. La recherche d'expression francophone sur les enjeux didactiques de l'informatique et des STIC a des racines anciennes (plus de 30 ans). Au cours du temps, elle a évolué en fonction des instruments informatisés disponibles et des choix institutionnels effectués par les différents États dans le domaine de la transmission d'une culture informatique aux nouvelles générations. Fin octobre 2011, la nouvelle édition de DIDAPRO a été organisée à l'Université de Patras (Grèce). L'appellation nouvelle Dida & STIC a pour raison d'expliciter davantage et de mieux représenter les différents aspects concernés aujourd'hui par la prise en compte de l'informatique et des sciences et technologies de l'information et de la communication depuis l'écale jusqu'à l'enseignement supérieur. Dans ce livre d'actes on trouvera des résultats de recherche et des réflexions menées aussi bien sur les enjeux de mise en oeuvre de systèmes de programmation pour résoudre des problèmes, que sur des utilisations possibles de logiciels et de ressources, sur la formation des enseignants et l'apprentissage des STIC elles-mêmes. La première partie regroupe des articles présentant un panorama assez large des recherches menées en didactique des progiciels et de l'informatique, incluant les utilisations des TIC. du début de l'enseignement secondaire à l'université: tableau numérique interactif (TNI), moteur de recherches, certificat informatique et internet, analyse des discours et des représentations, description d'un dispositif expérimental, invariants, dispositif de formation à distance. Les parties suivantes …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:EUQCXRtRnyEC",
            "Publisher": "New Technologies Editions, Athènes"
        },
        {
            "Title": "Children’s Debugging Processes and Strategies with a Simulated Robot: A Case Study",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-77022-8_6",
            "Abstract": "A new simulated robot environment that focuses on the debugging process is used in this study. The environment provides debugging features such as fast execution of commands, the ability to delete single commands and trace. Two 7-year-old children used the environment, and their activities were recorded. Children had to move a simulated robot through a maze using move and direction Logo-like commands. The children used the debugging features of the environment efficiently and solved the problems assigned to them. They followed the debugging strategies such as identification of the bug, pinpointing the problematic code segment and correcting the program. The instructor was able to help them through the process when it was needed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:3q5vy9RXY8EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The architecture and evaluation of a collaborative learning environment",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64575",
            "Abstract": "ModellingSpace is an open learning environment, particularly suitable for science education, which permits building of models by collaborating partners in various educational settings. This paper describes the main features of the ModellingSpace environment and in particular issues related with coordination and communication during problem solving. A number of evaluation studies of ModellingSpace, which have been recently contacted are also reported here. Through these studies the effectiveness and the limitations of the proposed architecture are identified and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "‘Scaffolding’ through talk in groupwork learning",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1871187109000261",
            "Abstract": "In the present study, we develop and deploy a conceptual framework of “scaffolding” in groupwork learning, through the analysis of the pursuit of a learning goal over time. The analysis follows individuals’ different experiences of an interaction as well as collective experiences, considering individual attainment as a result of a bi-directional contextualized conversation and action. We detect, describe and evaluate two (2) types of interaction that can be characterized as “scaffolding process”: the first concerns “Scaffolding individual thinking” and the second “Scaffolding collective thinking”. The latter, apart from presenting the educational advantages of collective thinking through peer discussion (D) and curriculum-focused evaluation context of Teacher Initiation – Student Response – Teacher Follow up (IRF), also presents the advantage of ‘spiral’ verbal exchanges in which the teacher “tunes in” to the students …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:IWHjjKOFINEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Design and implementation of educational scenarios with the integration of TDCK: A case study at a Department of Early Childhood Education",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4899-8080-9_10",
            "Abstract": "Studies worldwide indicate that while the question of whether or not to introduce the use of Information and Communications Technologies (ICT) in the educational process has received a positive response, a new and equally important question arises: How to prepare teachers in the best possible way, so that they can reconstruct, with the use of ICT, the educational process? In this context, several researchers, based on the theoretical framework of Pedagogical Content Knowledge (PCK) have created a new theoretical framework: the Technological Pedagogical Content Knowledge (TPCK). Given the conceptual constructs of the above-mentioned framework, this chapter aims to propose a new, enriched one: the Technological Didactical Content Knowledge (TDCK), which emerges from the need to take into account the teaching particularities of each subject area (mathematics, language, science, etc.). The …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:QxlgOPrhsAcC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Investigating preschoolers' problem solving strategies in computer-mediated collaborative environments",
            "Publication year": 2015,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2015.069452",
            "Abstract": "This study aims at investigating gender's influence on the collaborative behaviours among preschoolers in the context of a collaborative problem-solving task with computers. The collaborative task was mediated using the puzzle-solving game Incredible Machine. Their approaches towards the problem-solving task were examined while they worked in one of three gender groups (girls, boys, mixed). In order to classify the verbal interactions during their collaboration, Mercer's and Yelland's model was adopted as a means to understand the cognitive dimension of children's talk around computers. In addition, Inkpen's taxonomy of mouse usage across the group members' was adopted in order to deeply understand their expressed low level interaction styles. Analysis of results demonstrated significant deviations for all gender pairs, which are presented and discussed in detail.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:m8MyhXdlT-4C",
            "Publisher": "Inderscience Publishers (IEL)"
        },
        {
            "Title": "THE INTERPLAY BETWEEN LAPTOPS AND EDUCATION IN VARIOUS CONTEXTS: A STUDY ON STUDENTS FROM PARISIAN UNIVERSITIES",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=12958739286428256765&hl=en&oi=scholarr",
            "Abstract": "Learning with mobile technology has been a real challenge in the last few years. In this article we present the results obtained from a study conducted in France which investigated how university students use laptops in private and public contexts. In order to fulfill our aim, we have conducted an exploratory research which involved 262 subjects of different nationalities, studying in Parisian Universities. Our research tends to bring a new view on the use of these devices: surprisingly is not on the go that these devices are mostly used, but in the private area, at home. Issues like privacy and security are involved in this choice of the students. All students had their own device bought by more than 90% of them from their own resources. The research presented in this paper investigates aspects like:  uses of laptops in private context (e.g. at home) and in public contexts (e.g. university, library, in the train etc); benefits and …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IATED"
        },
        {
            "Title": "A tool to support interaction and collaboration analysis of learning activities",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64547",
            "Abstract": "An increasing amount of data is collected today during studies in which students and educators are engaged in learning activities using information technology and other tools. These data are indispensable for analysis and evaluation of learning activities, for evaluation of new tools and for students’ meta-cognitive activities. The data can take various forms, including video and audio recordings, log files of computing-related activity, field notes, results of students work in electronic or other forms, activity sheets etc. The need for analysis tools, which can annotate these data, classify them, process them and facilitate their inspection, is of increased importance especially for science education, since the latter involves experimentation and use of laboratory and other equipment that necessitate thorough off-line analysis and evaluation. In this paper we discuss first the key requirements of a new generation of interaction and collaboration analysis tools. We then present how these requirements have lead to the design of a prototype tool, recently developed. This tool can relate and synchronize various streams of field data. An important characteristic of the tool is its support for a multi-layer structure of annotations of various levels of abstraction, through which the activity can be interpreted and presented. This multi-layer representation can be inter-related to the raw field data, and can drive the navigation of the researcher in the activity data. An example of use of this tool for analysis and evaluation of a collaborative problem solving activity is also included.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:0EnyYjriUFMC",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "Computer-supported collaborative concept mapping: Study of synchronous peer interaction",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1020309927987",
            "Abstract": "The paper studies undergraduate students' synchronous peer interaction using a shared Activity Space and a text communication tool. Several groups of students collaborated in order to accomplish a data-modelling task in the context of a Databases University undergraduate course. The paper presents the collaboration support environment, i.e. a concept-mapping tool, used in this study. Subsequently, evaluation of the effectiveness of the environment in the educational process is discussed along various dimensions, like group synthesis, task control, content of communication, roles of the students and the effect of the tools used. Special emphasis is given in the ways the tools and the representations used complement each other and support the process. A discussion on the use of computer-supported collaborative problem solving environments is also included.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Robots de sol et robots humanoïdes à l'école primaire (descriptif d’atelier)",
            "Publication year": 2018,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01753388/",
            "Abstract": "Cet atelier a pour objectif de présenter un bref aperçu des outils robotiques utilisés à l’école primaire en les liant aux différentes formes d’apprentissages. L’accent est mis tant sur les apprentissages liés à la programmation informatique que sur ceux d’ordre transversal. Dans ce cadre, les fonctionnalités et les affordances principales des robots éducatifs de deux grandes catégories de robotique éducative, les robots de sol (mobiles préconstruits comme BeeBot ou BlueBot) et les robots humanoïdes (comme Nao) sont d’abord présentées. Ensuite, au biais d’une approche didactique, notre analyse s’intéresse aux scénarios à concevoir pour introduire les outils robotiques dans les apprentissages à l’école primaire. Cette scénarisation met l’accent sur les concepts à construire (tels que les concepts de programmation informatique ou de robotique pédagogique) et les compétences à développer (telles que la pensée computationnelle et la résolution de problèmes) à partir des séquences d’activités didactiques adéquates. Enfin, les scénarios conçus sur place sont présentés et analysés en les confrontant aux résultats obtenus pendant les usages des robots dans des situations réelles en classe.  Liste du matériel : robots de sol (BeeBot et BlueBot), robots humanoïdes (Nao)  1 Phases de l’atelier  1re phase : Présentation sommaire des fonctionnalités et des affordances principales des deux catégories d’outils robotiques : a) Robots de sol programmables (BeeBot et BlueBot), b) Robots humanoïdes (Nao).  2e phase : Conception participative des scénarios (en deux groupes selon les outils robotiques) à appliquer dans des différentes situations …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:_cFkbNEifk0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MuseumScrabble: Design of a mobile game for children’s interaction with a digitally augmented cultural space",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/62340",
            "Abstract": "Mobile technology has created new possibilities for location-based playful learning experiences. This article describes the MuseumScrabble mobile game, aimed at children visiting a historical museum. The game requires that the players explore the museum and link abstract concepts with physical artefacts using a mobile device. The focus of this article is on the interaction design process and the subsequent observations made during field evaluation of the game. Design principles that guide the development of such a game are presented and concern playfulness, learning, social interaction, physical aspects of the game and flow between physical and digital space. This article explores how these design principles are reflected in the study and how problem-solving strategies and collaboration and competition patterns are developed by children in this multi-player educational game.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Object-oriented analysis of collaborative problem solving activities",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=9167222179167493608&hl=en&oi=scholarr",
            "Abstract": "This paper provides an overview of the “Object-oriented Collaboration Analysis Framework (OCAF)” a method proposed for analysis and evaluation of collaborative problem solving activities of groups of actors, mediated by collaboration-support technology. This framework puts emphasis on the abstract and tangible objects that appear during the development of a solution to a given problem. The notions of the “objects’ histories” and “objects’ ownership” are introduced by this analytical framework. In the paper tools that have been developed to support this framework are described, together with extracts of studies that have been undertaken, during which OCAF has been effectively used.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:D_YRMw8gybsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enseigner les fonctionnalités et les usages des e-portfolios: une étude basée sur les conceptions des futurs enseignants",
            "Publication year": 2011,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00690090/",
            "Abstract": "Les portfolios sont principalement utilisés dans les domaines des arts et de l'architecture. Les professionnels de ces domaines y présentent leurs productions pour démontrer leurs habilités et pour prouver leur évolution. Pour sa part, l'usage du portfolio s' est intégré au domaine de l'enseignement à partir des années 1980. Il est défini comme\" une collection significative et intégrée des travaux de l'élève illustrant ses efforts, ses progrès et ses réalisations dans un ou plusieurs domaines témoignant de sa réflexion\". L'utilisation d'un portfolio peut permettre d'atteindre de multiples objectifs: fonction d'exposition pour témoigner des apprentissages et des progrès d'un apprenant; fonction évaluative qui représente l'évaluation des apprentissages; fonction réflexive avec laquelle l'apprenant a la possibilité de critiquer ses apprentissages; et fonction sociale où le portfolio est utilisé comme un outil de médiation entre l'élève, l'enseignant et le parent. Au cours des dernières années, l'expansion spectaculaire d'Internet a aidé la diffusion des portfolios électroniques ou ePortfolios à tous les niveaux professionnels et éducatifs. Le ePortfolio ajoute au potentiel du portfolio classique des possibilités supplémentaires: a) une flexibilité dans la nature et la modification du contenu (textuelle, audio, vidéo); b) une flexibilité dans la structuration du contenu (ajouter, archiver et supprimer des textes, créer de nouvelles rubriques); c) une accessibilité en ligne; et d) une fonction de réseautage social et de partage d'informations. Dans la littérature scientifique, le potentiel du ePortfolio est bien référencé. Celui-ci s' inscrit dans des approches cognitives et constructivistes d …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:abG-DnoFyZgC",
            "Publisher": "Athènes: New Technologies Editions"
        },
        {
            "Title": "Résoudre des problèmes d’interdépendance par la robotique",
            "Publication year": 2020,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-02420396/",
            "Abstract": "Des chercheurs montrent comment l'usage d'un robot qui se déplace sur le sol, le bluebot, peut favoriser chez les élèves une démarche de résolution collaborative de problèmes.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ae0xyBWlIcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A scenario-based approach for designing educational robotics activities for co-creative problem solving",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-55553-9_12",
            "Abstract": "Educational robotics are increasingly integrated from early childhood to postsecondary education. In some cases, robots are used as an extracurricular activity that is not oriented towards the learning objectives of the curriculum. In other cases, the educational robotics activities are aligned to the curriculum objectives or the development of the 21st century skills such as collaboration, problem solving, creativity, critical thinking and computational thinking. In this paper, we introduce a scenario-based approach for designing educational robotics activities aiming to support co-creative problem solving in K12 formal education contexts. After describing the scenario to support planning and orchestration of ER in K12 education, we introduce a taxonomy composed of five different ER activities according to the learners’ engagement in the co-creative knowledge building and problem solving process.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:xUD2GqFNeDMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Εισαγωγή στη Διδακτική της Πληροφορικής",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=8263551309255338385&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:BzPC9jo9PWgC",
            "Publisher": "Εκδόσεις Κλειδάριθμος"
        },
        {
            "Title": "Researching individual and collaborative pair learning in primary school students using digital knowledge maps for science education",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-3178-7_8",
            "Abstract": "Researching conceptual understanding and development in learning requires recording and evaluating students’ knowledge structures, either collaboratively or individually formed, but also requires investigating equally the learning process as well as the learning outcomes. The dynamic nature of knowledge maps, their potential as a life-long learning strategy, and their evaluation through a valid assessment protocol could serve those requirements. The following chapter records a case study in which 16 sixth grade students (10 years old) participated of a Greek state elementary school of an urban area, randomly selected. The students constructed and revised digital knowledge maps at various phases of a Science course both individually and in pairs. The research process involved collecting a succession of individually and collaboratively constructed knowledge maps. The series of knowledge maps was …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Educational scenarios with ICT: An operational design and implementation framework",
            "Publication year": 2013,
            "Publication url": "https://www.learntechlib.org/p/48594/",
            "Abstract": "This paper proposes a framework for designing educational scenarios that incorporate ICT as a guide for prospective and practicing teachers. The design and implementation framework for educational scenarios integrates ICT into the pedagogical problematic according to contemporary learning theories. Based on principles of science teaching, the framework draws on the main components of the TPACK framework. We provide theoretical support for the model and its basic components, and we examine its implementation by prospective and practicing preschool teachers.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:8AbLer7MMksC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "The architectural design of a real time collaborative concept-mapping environment from distance",
            "Publication year": 2001,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/28/FeidasKomisCSCL2001.pdf",
            "Abstract": "In this text we present the main pedagogical and technical principles concerning the design of Representation Tool (Version 2.0), an open ended educational software for collaborative concept mapping, based on Internet. Concept mapping is one of the most known ways for representing knowledge visually [Novak & Gowin, 1984; McAleese, 1998] and consequently for externalizing the representations of those who learn by using graphs in a tree or network form. The Representation Tool 2 equips its users with the appropriate tools for individual and collective expression of knowledge by facilitating the process of handling the concepts and the relations that link them. The Tool provides for the rapid development and exchange of concept maps through its common working environment and access to others creations (concept maps). It also has the potential for simultaneous map development either on local network level or over the Internet that is supported by appropriate dialogue boxes and negotiation tools. The collective development of concept maps and the procedure of negotiation enables real time collaboration, where social œ cognitive conflicts are more likely to emerge.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Robotique pédagogique et concepts préliminaires de la programmation à l'école maternelle: Une étude de cas basée sur le jouet programmable Bee-Bot",
            "Publication year": 2011,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00676143/",
            "Abstract": "Dans ce travail nous explorons l'usage des jouets programmables de type Logo pour aborder quelques concepts préliminaires à la programmation dans le contexte de l'école maternelle. Il s'agit d'une étude de cas qui se déroule dans sept écoles maternelles dans le cadre du projet européen Fibonacci. Par une approche d'ingénierie didactique nous avons conçu une série de scénarios éducatifs que nous sommes en train d'explorer dans ces écoles maternelles avec les maîtresses de classes. Les enfants (de 4 à 6 ans) en équipe de quatre à sept personnes utilisent un dispositif robotique (le jouet programmable Bee-Bot, les cartes à programmer le jouet et logiciel associé) dans un contexte d'initiation aux concepts de programmation de type Logo. Les premiers résultats montrent que des apprentissages des concepts préliminaires de programmation sont possibles s'ils s'inscrivent dans un contexte de scénarisation pédagogique adéquate.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:f2IySw72cVMC",
            "Publisher": "Athènes: New Technologies Editions"
        },
        {
            "Title": "On supporting young students in visual logic modeling",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_19",
            "Abstract": "Logic reasoning presents notable difficulties for young children. This paper presents Logic Model Creator (LMC), a new environment that supports building and exploration of intuitive visual representation of logic models by young children. LMC logic models are structured as hypothesis, decision and / or counter decision components. These models are built using visual entities which represent the learning concepts of a specific domain. In this paper we focus on the architecture of LMC and the basic functionality of the environment. In particular we describe the the dynamic creation of equivalent logic models according to the so-called Reference Logic Model, constructed by the students’ tutor. Furthermore an assessment module which provides immediate advice to the student in order to help them create a valid logic model is presented. Through experimentation it is demonstrated that the users of LMC can …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "An environment for studying collaborative learning activities",
            "Publication year": 2004,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.7.2.34.pdf",
            "Abstract": "Studies of collaborative learning activities often involve analyses of dialogue and interaction as well as analyses of tasks and actors’ roles through ethnographic and other field experiments. Adequate analysis tools can facilitate these studies. In this paper, we discuss key requirements of interaction and collaboration analysis tools. We indicate how these requirements lead to the design of new analysis environments. These environments support annotation and analysis of various kinds of collected data in order to study collaborative learning activities. An important characteristic of these tools is their support for a structure of annotations of various levels of abstraction, through which an activity can be interpreted and presented. This can serve as a tool for reflection and interpretation as well as for facilitation of research in collaborative learning.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "De 0 à 1 ou l’heure de l’informatique à l’école",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Qs68GpkTGbMC",
            "Publisher": "Peter Lang"
        },
        {
            "Title": "Enseigner avec les technologies: favoriser les apprentissages, développer des compétences",
            "Publication year": 2007,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=V0x4hnJj4V0C&oi=fnd&pg=PR1&dq=info:oAnVOi7EyGMJ:scholar.google.com&ots=SUFjX8a-HY&sig=pjOegCFzfmmfj-QxcsNDsRDh2vE",
            "Abstract": "Dans un contexte de renouveau pédagogique global, la visée de cet ouvrage consiste aussi à montrer comment les technologies peuvent contribuer à rencontrer les ambitions de l'école d'aujourd'hui dans laquelle ce n'est plus tant la connaissance des faits ou des principes qui importe, mais bien la capacité, en s' appuyant sur un support technologique adéquat, à retrouver ces faits à partir d'une ressource pertinente ou de mettre en ouvre certains principes pour résoudre de vrais problèmes dans des contextes signifiants. Tout en s' inscrivant dans les perspectives dégagées par de nombreux auteurs.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:UeHWp8X0CEIC",
            "Publisher": "PUQ"
        },
        {
            "Title": "La pédagogie universitaire face aux MOOCs: compte-rendu d’expériences, tendances actuelles et futures (University Teaching against MOOCs: Current and Future Trends)",
            "Publication year": 2015,
            "Publication url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3166967",
            "Abstract": "Même si certains chercheurs ont qualifié les MOOCs de plus importante expérience jamais réalisée en pédagogie universitaire (Weissmann, 2012), même si le New York Times parlait de l’année du MOOC (Pappano, 2012), il ya trois ans, on se rend compte aujourd’hui que cette nouvelle formule en pédagogie universitaire pose plusieurs défis, tant aux concepteurs, aux formateurs qu’aux apprenants. Une tendance importante se dessine: on ne parle plus nécessairement de réussite dans un MOOC et termes du nombre d’apprenants ayant terminé un cours, mais plutôt en fonction du nombre d’inscrits. C’est ce phénomène que Clow (2013) nomme l’entonnoir de participation à un MOOC.English Abstract: Despite the fact that some researchers consider the MOOC the most important experiment to date in university teaching (Weissmann, 2012), and despite the fact that The New York Times named 2012 “The Year of the MOOC”(Pappano, 2012), we now real-ize that this new form of university teaching poses a number of challenges for designers, educators, and students alike. We also note a growing trend: the success of a MOOC is not necessarily measured in terms of the number of students who complete the course, but instead the number of students who enroll in it. These steep drop-out rates have been called a “funnel of participation”(Clow, 2013).",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:aK62MiYD7mUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design principles for an open and wide MODELLINGSPACE of modelling, collaboration and learning",
            "Publication year": 2003,
            "Publication url": "http://gnosis.library.ucy.ac.cy/handle/7/64480",
            "Abstract": "The aim of the paper is to present and discuss the main design concepts and principles, for a collaborative modeling environment for sciences and mathematics (MODELLINGSPACE). It incorporates various representational formalisms, allows synchronous and asynchronous collaboration among students and supports teachers. The main design principles and related issues under discussion concern certain central design questions such as: what must be the main modeling primitives when addressed to young students 11-16 years old, in a wide range of cognitive possibilities? In what specific ways support students reasoning applying rich visualizations and multiple representations? How to assure flexible main collaborative actions and communications and how to support related learning community needs? The paper approaches equally important questions such as how to support selfregulation and metacognitive development for students and how to assure teachers needs accomplishment when working in typical real schools conditions?",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Department of Educational Sciences, University of Cyprus"
        },
        {
            "Title": "La pédagogie universitaire face aux MOOCs: compte-rendu d’expériences, tendances actuelles et futures",
            "Publication year": 2015,
            "Publication url": "https://www.erudit.org/en/journals/ritpu/1900-v1-n1-ritpu02919/1038834ar/abstract/",
            "Abstract": "Même si certains chercheurs ont qualifié les MOOCs de plus importante expérience jamais réalisée en pédagogie universitaire (Weissmann, 2012), même si le New York Times parlait de l’année du MOOC (Pappano, 2012), il y a trois ans, on se rend compte aujourd’hui que cette nouvelle formule en pédagogie universitaire pose plusieurs défis, tant aux concepteurs, aux formateurs qu’aux apprenants. Une tendance importante se dessine: on ne parle plus nécessairement de réussite dans un MOOC et termes du nombre d’apprenants ayant terminé un cours, mais plutôt en fonction du nombre d’inscrits. C’est ce phénomène que Clow (2013) nomme l’entonnoir de participation à un MOOC.Ce numéro thématique vise à participer à la littérature scientifique sur la question en présentant divers points de vue sur ce sujet d’actualité. Il sera, par exemple, question de comptes rendus d’expériences en France (Bar-Hen …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:LiF7i2gyBHwC",
            "Publisher": "CRIFPE"
        },
        {
            "Title": "Impact of Moodle usage practices on students’ performance in the context of a blended learning environment",
            "Publication year": 2010,
            "Publication url": "http://orion.westgate.gr/sall2010/documents/SALL%202010.pdf#page=12",
            "Abstract": "In this paper, students’ practices and performance were studied, while using a Learning Management System in a blended learning environment. This is a case study involving 117 students who attended an academic course based upon a blended learning approach, using an open source e-learning environment (Moodle). The course refers to ICT integration in education and has been reformulated to be offered in the context of blended learning. The course’s methodology was mainly based on a problem solving approach. The impact of nine variables depicting the expressed students’ practices while using Moodle was examined (spectrum of use, assignment view, forum add post, forum view, resource view user’s profile inspection, questionnaire and glossary inspection) on their performance. A multiple regression was applied to investigate relation between the students’ practices and their performance. From the analysis of the collected data it was depicted that the system usage is significantly related with the students’ performance, explaining the 20.2% of variance in their total grades.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effective combination of hybrid usability methods in evaluating educational applications of ICT: Issues and challenges",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-007-9045-5",
            "Abstract": "This paper focuses on usability evaluation of information and communication technologies applications in education (ICTE applications). Various classes of teaching and learning systems are discussed in terms of technologies used and pedagogical approaches. Their usability is analyzed according to various dimensions and the impact of system usability on the learning effectiveness is studied. We argue that various classes of ICTE applications such as multimedia/hypermedia applications, open educational environments and CSCL environments, based on different theoretical perspectives, require fundamentally different approaches in evaluating their usability. The paper is structured as follows: an overview of different usability evaluation approaches is presented first, followed by a discussion on applicability of these techniques in various categories of teaching and learning computer systems. Typical …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Smart Toys in Early Childhood and Primary Education: A Systematic Review of Technological and Educational Affordances",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1274998",
            "Abstract": "The present paper presents a systematic review of the last 30 years that concerns records on Smart Toys and focuses on toys regarding early childhood and primary education children (3–12 years old). This paper aims to analyse and categorise smart toys (50 articles) in terms of their technological and educational affordances. The results show that the toys are designed based on four main technological affordances and their combinations. The educational affordances of smart toys are studied in terms of different use modes and their learning objectives aimed to identify specific objectives in different subjects and objectives based on transversal competencies such as problem solving, spatial thinking, computational thinking, collaboration and symbolic thinking. Finally, with the multiple correspondence analysis, the correlations between smart toys’ individual technological and educational affordances are grouped with the evolution of affordances related to their development date. In conclusion, in recent years, smart toys concern special sciences (programming) and some 21st-century skills (STEM and computational thinking). In contrast, in the first 20 years, the interest focused more on transverse skills, such as collaboration, emotional thinking, symbolic thinking, story-telling and problem solving.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:V-j82LJCZ3MC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Application of synchronous collaboration in the Computer Science course of Hellenic Open University (in Greek)",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=16497471690010747417&hl=en&oi=scholarr",
            "Abstract": "Στο άρθρο αυτό παρουσιάζεται η εφαρμογή της σύγχρονης συνεργασίας από απόσταση (τηλε-συνεργασίας) στη Θεματική Ενότητα “Εισαγωγή στην Πληροφορική” στο Ελληνικό Ανοικτό Πανεπιστήμιο. Στο άρθρο παρουσιάζεται η μεθοδολογία προσέγγισης (πώς σχεδιάστηκε αρχικά η εφαρμογή), αλλά και τα προβλήματα και οι δυσκολίες που προέκυψαν κατά την εφαρμογή και πώς αυτές αντιμετωπίσθηκαν. Συζητούνται οι τεχνολογικές λύσεις που έκαναν εφικτή την εφαρμογή και η ανάλυση των δεδομένων που προέκυψε από τα αρχεία συνεργασίας κάθε ομάδας, αλλά και από την έρευνα που πραγματοποιήθηκε με τη συμμετοχή των φοιτητών. Το συμπέρασμα είναι ότι παρόλο που η εφαρμογή παρόμοιων λύσεων είναι διαδικασία που απαιτεί πολύ καλή οργάνωση και–κυρίως–σημαντική υποστήριξη και δέσμευση από την ομάδα που αναλαμβάνει το έργο, η σύγχρονη τηλε-συνεργασία έχει να ωφελήσει σημαντικά τους φοιτητές …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Les nouveaux outils et les nouvelles pratiques de recherche issus des technologies de l’information et de la communication",
            "Publication year": 2009,
            "Publication url": "http://150.140.160.61:8000/static/book/chapter/2021/01/08/ch12-karsentikomisdepover2009.pdf",
            "Abstract": "En sciences exactes, le recours aux technologies comme support, mais aussi comme élément dynamisant pour la recherche va de soi depuis longtemps. En 1944 déjà, Robert Oppenheimer soulignait la subtile alchimie qui se dégageait de l’interaction entre l’homme et la technologie dans le développement du savoir:«L'ouverture de la société, l'accès sans restriction au savoir et l'association spontanée et libre d'hommes soucieux de le faire progresser, c'est ce qui peut permettre à un monde technologique vaste, complexe, en expansion et en transformation constantes, toujours plus spécialisé et plus pointu, de garder son",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:5AT-p8ixKR4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A peer-to-peer architecture for synchronous collaboration over low-bandwidth networks",
            "Publication year": 2003,
            "Publication url": "http://delab.csd.auth.gr/~bci1/Panhellenic/231Margaritis.pdf",
            "Abstract": "The need for peer-to-peer collaboration over the Internet is increasing nowadays. There are many factors that make this task particularly difficult. Software designers and developers often come across the challenge of overcoming the raising technical and organizational problems. These problems include mostly the limited bandwidth of networks especially of dialup connections, but also the presence of firewalls and proxy servers in intranets that inhibit peer-to-peer communication. A flexible architecture needs to be defined that overcomes these problems and permits a smooth collaborative environment that would satisfy the needs of end users. This paper describes a study on these problems and provides solutions accordingly by defining the architecture of a peer-to-peer collaborative system developed and used for real-time collaborative modelling activities.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "L’usage des jouets programmables à l’école maternelle: Concevoir et utiliser des scénarios pédagogiques de robotique éducative",
            "Publication year": 2012,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/27/c82_komis-misirli-2012-l-usage-des-jouets-programmab_mavZzu5.pdf",
            "Abstract": "L’objectif du présent travail est l’étude de la conception et de l’implémentation des scénarios pédagogiques concernant l’usage de la robotique éducative et plus précisément des jouets programmables à l’école maternelle. Dans ce contexte, on étudie, à l’aide de la recherche évaluative orientée vers la conception (design based research), le processus de conception, d’application et d’évaluation des scenarios éducatifs dans des contextes réels de classes maternelles. Ces scénarios ont pour but le développement des concepts préliminaires de programmation et des concepts mathématiques par les enfants de la maternelle. Une analyse préliminaire de l’implémentation d’un scénario typique concernant les représentations des enfants sur les jouets programmables et sur leurs idées mentales des commandes de programmation du robot programmable montre qu’il y a eu une évolution importante de celles-ci vers les objectifs prévus par le scénario.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:1DAnfT_YoJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Un apprentissage de la programmation dès l'école maternelle? Une étude exploratoire en cycles 1 et 2 (descriptif de poster)",
            "Publication year": 2018,
            "Publication url": "https://hal.sorbonne-universite.fr/DIDAPRO7/hal-01753195v1",
            "Abstract": "Ce travail est inscrit dans le cadre du projet DALIE de l’Agence Nationale de la Recherche française et son objet d’étude a été d’analyser la manière dont les enfants de l’école maternelle jusqu’au CP arrivent à s’approprier des notions de base de programmation à l’aide du logiciel ScratchJr. Dans un premier temps, nous avons choisi de mener une étude exploratoire, dans le cadre de notre Master 2, dans une école primaire française auprès de douze élèves de cours préparatoire. Nous avons élaboré un scénario pédagogique de onze séances (une activité initiale, une activité de préparation psychologique, sept activités d’apprentissage, commençant par la familiarisation avec les concepts de l’interface et se terminant à l’apprentissage des concepts clés de programmation tels que la répétition et les messages et une activité d’évaluation) qui visait au développement des compétences de programmation chez …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:tJ_1M1FLfZ0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "OCAF: An object-oriented model of analysis of collaborative problem solving",
            "Publication year": 2002,
            "Publication url": "https://repository.isls.org/bitstream/1/3926/1/92-101.pdf",
            "Abstract": "Computer-supported collaborative problem solving requires new methodological approaches of interaction and problem solving analysis. Usually analysis of collaborative problem solving situations is done through discourse analysis or interaction analysis, where in the center of attention are the actors involved (students, tutors etc.). An alternative framework, called “Object-oriented Collaboration Analysis Framework (OCAF)” is presented here, according to which the objects of the collaboratively developed solution become the center of attention and are studied as entities that carry their own history. This approach produces a view of the process, according to which the solution is made of structural components that are ‘owned’by actors who have contributed in various degrees to their development. OCAF is based on both actions and dialogues of actors, providing qualitative as well as quantitative indicators of collaboration and solution quality. The paper presents first the framework notation. Examples of its use in analysis of distance groups and face-to-face collaborative activities are provided next, followed by the dimensions of the framework supported analysis for teachers and researchers. Web-based tools supporting the OCAF approach are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ZHo1McVdvXMC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "Conceptual Change in Algorithms Teaching: A Collaborative Approach",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/39447790/Conceptual_Change_in_Algorithms_Teaching20151026-23878-1rm6aac.pdf",
            "Abstract": "Teaching Algorithms is one of the most important and challenging educational topics regarding IT in High Schools. The aim of this research is to investigate whether and how Computer Supported Collaborative Learning (CSCL) environments facilitates the teacher to create activities and to define the mental models and conceptual changes during teaching in order to understand how students construct knowledge in the specific field during their activities. Two relevant activities for collaborative learning were developed with or without a computer; and from the study and the analysis of the activities interesting conclusions and questions.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The environments of educational robotics in Early Childhood Education: towards a didactical analysis",
            "Publication year": 2016,
            "Publication url": "https://electra.library.upatras.gr/index.php/ejupUNESCOchair/article/view/2751",
            "Abstract": "This article consist an analysis of educational robotics environments for early childhood and first primary education. Firstly generally presented a problematic for the role of these environments in educational contexts for young children and examined the main research in the area. Then it is developed a framework of didactical analysis of two main categories of educational robotics environments: a) building competencies when constructing and robots and b) constructing computational thinking. Finally, based on this framework the most known educational robotics environments are analysed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:6e4D8M0GhXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The construction of spatial awareness in early childhood: the effect of an educational scenario-based programming environment",
            "Publication year": 2019,
            "Publication url": "https://mmm.library.upatras.gr/review/article/view/3122",
            "Abstract": "A teaching intervention–educational scenario–was implemented by educators to 306 pre-schoolers in 17 classrooms. It was designed to foster children’s spatial awareness so as to help them construct a model of spatial concepts with reference to a mobile object around the space, the programmable toy Bee-Bot. The educational scenario encompasses instruments designed for gathering data of the pre and post children’s representations about direction and orientation concepts, the teaching activities conceived to deliver these concepts by using the programmable toy and finally instruments designed for evaluation. The evaluation took place after three weeks implementation and the results indicated statistically significant difference in children’s pre and post-test intervention representations and consequently construction of spatial knowledge not only to a functional context but moreover to a more symbolic one.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:knQODA9bSJkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Heterogeneity of learning material in synchronous computer-supported collaborative modelling",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504000314",
            "Abstract": "This paper examines the effect of heterogeneous resources, available to students, during computer-supported collaborative problem solving. A study of collaborative modeling has been conducted in the frame of an authentic educational activity in a secondary school. The students involved were provided with sets of primitive resources of varying degrees of heterogeneity to be used during synchronous computer-mediated modeling activities. Analysis of students' peer interaction and of the produced solutions revealed that, contrary to our expectations, the group with heterogeneous resources produced solutions of similar quality to those of the reference group, although they were more active, they exchanged more messages, they were involved in deeper discussions and collaborated more for building the constituent parts of the solution.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Using educational software to support collective thinking and test hypotheses in the computer science curriculum",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10639-009-9107-y",
            "Abstract": "This study analyses the discourse among the teacher and the students, members of three (3) small groups, who learn in the environment of a stand-alone computer. Two educational environments are examined: the first one, a “virtual laboratory” (Virtual scale-DELYS) and the second one, a computer modeling environment (ModelsCreator). The ‘Virtual Scale’ environment provides users with curriculum focused feedback and in that sense it can be categorized as directive. The ModelsCreator environment provides users merely with a representation of their own conception of curriculum concepts, so it can be categorized as an open-ended environment. The goal of this research is to exemplify the way the two educational software environments support (a) the development of collective thinking in peer— and teacher-led discussion and (b) students’ autonomy. The software tools of the “Virtual scale” along with …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer US"
        },
        {
            "Title": "La francophonie en question",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=2312129459365971221&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ZpfHopiqs50C",
            "Publisher": "RIFEFF, Université de Montréal"
        },
        {
            "Title": "Ninth grade students' mental representations of the refraction of light: didactic implications",
            "Publication year": 2013,
            "Publication url": "http://www.scielo.org.mx/scielo.php?script=sci_arttext&pid=S1870-35422013000200006",
            "Abstract": "The study of students' mental representations of physics concepts and phenomena constitutes a central part of physics education research, as they play a decisive role in teaching. In the study presented here, we investigate 213 ninth grade students' mental representations of the phenomenon of refraction, after they were taught about it in school. The empirical data was gathered through an interview using 3 tasks which involved the evaluation of hypothetical situations. The research data included mental representations that cause difficulty in the comprehension of refraction.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:tFyepMjQr3wC",
            "Publisher": "Sociedad Mexicana de Física"
        },
        {
            "Title": "Quels enjeux de savoir et quelle forme disciplinaire en France et en Grèce à propos de l’Informatique: le cas des collèges",
            "Publication year": 2006,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/28/Brandt-PomaresKomis_2005.pdf",
            "Abstract": "Le but de la présente communication est d’étudier le statut des savoirs informatiques et la forme disciplinaire adoptée pour l’enseignement des concepts de base en informatique (et plus généralement en TIC) et pour le développement des compétences associées pour une utilisation effective des technologies, dans deux systèmes scolaires qui adoptent des politiques éducatives différentes à propos de la discipline: les systèmes scolaires en France et en Grèce. Plus précisément, suivant une méthodologie d’analyse comparative, nous consacrons nos efforts sur le prescrit des programmes scolaires (le programme en Technologie en France et le programme en Informatique en Grèce) et sur les textes officiels en général concernant le niveau du collège dans les deux pays pour développer un modèle conceptuel permettant de faire des comparaisons pour comprendre et interpréter le développement actuel dans les deux cas. Nous avons choisi le collège puisque c’est le niveau scolaire où, depuis quelques années, il y a une situation stabilisée et bien définie dans les deux pays où l’essentiel des programmes scolaires est fondamentalement consacré à l’alphabétisation informatique et à l’utilisation effective des progiciels.Dans ce contexte, nous commençons par une analyse descriptive des situations actuelles en terme d’enseignement des notions informatiques en se basant principalement sur les programmes et les textes officiels entre les deux pays. Cette analyse pourrait être abordée soit en termes de complémentarité (Technologie et Informatique) soit en termes de diversification (Technologie versus Informatique). Il s’ agit, par conséquent …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:QndmRo8phpgC",
            "Publisher": "Apprendre (avec) les progiciels, Entre apprentissages scolaires et pratiques professionnelles DIDAPRO"
        },
        {
            "Title": "Beyond logging of fingertip actions: analysis of collaborative learning using multiple sources of data",
            "Publication year": 2007,
            "Publication url": "https://www.learntechlib.org/p/22973/",
            "Abstract": "In this article, we discuss key requirements for collecting behavioural data concerning technology-supported collaborative learning activities. It is argued that the common practice of analysis of computer generated log files of user interactions with software tools is not enough for building a thorough view of the activity. Instead, more contextual information is needed to be captured in multiple media like video, audio files, and snapshots, in order to re-construct the learning process. A software environment, Collaborative Analysis Tool,(ColAT) that supports interrelation of such resources in order to analyse the collected evidence and produce interpretative views of the activity is described.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "La recherche évaluative",
            "Publication year": 2011,
            "Publication url": "http://150.140.160.61:8000/static/book/chapter/2021/01/08/ch15-depover-et-al-recherche-evaluative.pdf",
            "Abstract": "Comme le fait remarquer Pinch (2009), la recherche évaluative doit occuper une place importante parmi les formes de recherches susceptibles d’être mobilisées en éducation. En effet, contrairement à d’autres domaines scien tifiques qui se consacrent surtout à la description des phénomènes, l’éducation est avant tout une science de l’action. Or, une action, pour être efficace et se donner un maximum de chances d’atteindre son but, doit être régulée. Cette régulation exige le recours à l’évaluation sous différentes formes.Lorsque l’évaluation comme moyen d’améliorer l’action est menée d’une manière systématique à partir de données empiriques, certains auteurs comme Patton (1990) ou Jones (2000) parlent de recherche évaluative, ou encore de recherche d’évaluation. Toutefois, pour considérer qu’il s’ agit d’un processus de recherche au sens strict, il convient d’ajouter une seconde condition, à savoir que les techniques mises en œuvre conduisent également à la production de nouvelles connaissances susceptibles d’enrichir, de compléter, de nuancer ce que l’on sait à propos d’un domaine.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:WbkHhVStYXYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploring secondary education teachers’ attitudes and beliefs towards ICT adoption in education",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/42268046/Jimoyiannis_Komis_2006.pdf",
            "Abstract": "The survey presented in this article aims at the investigation of secondary education teachers’ attitudes and beliefs about ICT in education. It has been administered to a total of 240 secondary education teachers, coming from the Ioannina prefecture, in Greece. Our results show that the great majority of the teachers in the sample are positive towards acquiring basic skills on ICT, applying ICT tools in their instruction and the role that ICT could play in education. We have recorded differences in teachers’ beliefs according to their attributes such as gender, specialty, teaching experience, computer experience, training on ICT, and computer ownership. Our findings have also revealed some parameters, which interfere making thus many teachers cautious or fearful about ICT integration in the educational practice. On the other hand, multivariate analysis has identified three discrete groups of teachers which have exhibited a persistent and rather consistent approach: a group having strongly positive attitudes about ICT in education, a second group of teachers which are in general positive, and a third one with negative or neutral beliefs.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synchronous collaboration in distance education: a case study on a science course",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357465/",
            "Abstract": "This paper describes our experience with introduction of synchronous collaborative problem solving activities in the frame of a distance learning computer science undergraduate course of the Hellenic Open University (HOU). Groups of students worked collaboratively at a distance in order to build a flowchart of an algorithm to a given problem. The technological and organization issues involved, the first findings of analysis of peer student interaction during this study, as well as some general implications for distance education are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TIC et apprentissage des sciences: promesses et usages. Introduction",
            "Publication year": 2012,
            "Publication url": "https://journals.openedition.org/rdst/80",
            "Abstract": "Comme les technologies disponibles se renouvellent rapidement, alors que les pratiques de formation les intégrant sont peu stabilisées, de nouvelles potentialités apparaissent notamment avec les technologies de réalité virtuelle ou de réalité augmentée et autour des utilisations nomades avec les téléphones portables et les tablettes permettant un accès à internet. De nouvelles pratiques de travail, individuelles ou réalisées en collaboration, émergent. En particulier, si des formes d’enseigne...",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Éditions de l’École normale supérieure de Lyon"
        },
        {
            "Title": "Real-time peer collaboration in open and distance learning",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/42268062/C75_Avouris_etal_HERCMA_2003.pdf",
            "Abstract": "In this paper an overview of some key issues of computer-support for real-time collaborative problem solving in the context of Open and Distance Learning (ODL) is attempted. Aspects of the synchronous collaboration-support environment Modelling Space are described. This environment has been recently used in a number of empirical studies involving collaborative problem solving. From these studies it has been found that the representational and operation tools of the ModellingSpace common activity space influence considerably interaction and communication. Also the coordination mechanism used was found that affects problem solving and collaboration. This environment is proposed here as a tool that can be effectively integrated as a service to the students of ODL courses, in addition to more traditional asynchronous collaboration tools, improving community building.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synchronization in Scratch: A Case Study with Education Science Students",
            "Publication year": 2015,
            "Publication url": "https://www.learntechlib.org/p/147289/",
            "Abstract": "The Scratch programming language is an introductory programming language for students. It is also a visual concurrent programming language, where multiple threads are executed simultaneously. Synchronization in concurrent languages is a complex task for novices to understand. Our research is focused on strategies and methods applied by novice programmers for synchronization using Scratch, mainly variables and messages. The projects of the students as well as recordings of their actions during the laboratory course compose the research data. It is shown that novice programmers are able to use messages more adequately than variables in order to coordinate the various objects of their programs.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:HkunuPqSaCsC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "La formation universitaire des enseignants du préscolaire et du primaire en Grèce: évolutions et perspectives",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/30383299/f2.pdf",
            "Abstract": "Emails: 1 ravanis@ upatras. gr, 2 balias@ upatras. gr, 3 karalis@ upatras. gr et 4 komis@ upatras. gr. Résumé: Dans cet article nous examinons les reformes institutionnelles intervenues en Grèce durant les années 1980 dans la formation initiale et continue des enseignants du préscolaire et du primaire. Nous entreprenons aussi une analyse critique des acquis, des stagnations et des contradictions qui ont accompagné l’universitarisation des établissements de formation des enseignants, en centrant notre intérêt sur le fonctionnement et l’essor des nouveaux départements universitaires.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "La pédagogie universitaire face aux MOOCs: compte-rendu d’expériences, tendances actuelles et futures",
            "Publication year": 2015,
            "Publication url": "https://www.ritpu.ca/img/pdf/ritpu-2015-v12n1-2-07.pdf",
            "Abstract": "Même si certains chercheurs ont qualifié les MOOCs de plus importante expérience jamais réalisée en pédagogie universitaire (Weissmann, 2012), même si le New York Times parlait de l’année du MOOC (Pappano, 2012), il y a trois ans, on se rend compte aujourd’hui que cette nouvelle formule en pédagogie universitaire pose plusieurs défis, tant aux concepteurs, aux formateurs qu’aux apprenants. Une tendance importante se dessine: on ne parle plus nécessairement de réussite dans un MOOC et termes du nombre d’apprenants ayant terminé un cours, mais plutôt en fonction du nombre d’inscrits. C’est ce phénomène que Clow (2013) nomme l’entonnoir de participation à un MOOC.Ce numéro thématique vise à participer à la littérature scientifique sur la question en présentant divers points de vue sur ce sujet d’actualité. Il sera, par exemple, question de comptes rendus d’expériences en France (Bar-Hen, Javaux et Villa-Vialaneix); d’une analyse des taux de rétention passif et actif en Belgique (Schiffino, Cogels, Baudewyns, Hamonic, Legrand et Reuchamps); d’une analyse",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:7LLGAk_PBK4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time collaborative problem solving: A study on alternative coordination mechanisms",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1215032/",
            "Abstract": "It is believed that computer-supported collaboration at a distance can stimulate learning. An innovative environment that permits real-time collaborative problem solving is described. In particular we study the effect of two alternative coordination mechanisms on the problem solving activity of pairs of students engaged in concept map building. The first mechanism imposes locking of the shared activity board for one student at a time, while the second mechanism allows access of all group members to the shared activity board in a contemporary way. The reported findings are of interest to researchers and practitioners who are involved in the design and study of real-time collaborative learning environments.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Massively multi-user online games: The emergence of effective collaborative activities for learning",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4700743/",
            "Abstract": "The features and potential of MMOGs to constitute environments for collaborative problem solving activities for learning are the main focus of this paper. Principles from the area of CSCL, problem-solving, cognition and learning can be applied to the design of an educational MMOG so as for effective interactions and collaboration among the players to be fostered. We attempt to propose a framework for the investigation and design of effective collaborative problem solving tasks within MMOGs.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Teachers’ Readiness to Adopt Mobile Learning in Classrooms: A Study in Greece",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s10758-020-09453-7",
            "Abstract": "Mobile devices have become a learning tool with great potential in both formal and informal learning; however, mobile learning readiness research in school education is relatively limited. This study investigated teachers’ readiness to adopt mobile learning in K-12 classrooms. A questionnaire was administered to 920 teachers in Greece and four factors were extracted, Possibilities, Benefits, Preferences and External influences. Teachers, in general, expressed positive perceptions on mobile learning readiness. The highest percentage of agreement regarded the possibilities of mobile learning (over 60%). ICT training and attendance of ICT conferences, both affected positively teachers’ perceptions on mobile learning benefits and preferences. Teachers who use mobile devices in class reported significantly more positive perceptions on all factors, while gender or age had no impact on perceptions. There …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:6B7w4NK6UsoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Les TIC dans le système éducatif grec-le difficile cheminement de l'intégration",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A pre-post study to assess the impact of an information-problem solving intervention on university students’ perceptions and self-efficacy towards search engines",
            "Publication year": 2019,
            "Publication url": "https://www.erudit.org/en/journals/ritpu/1900-v1-n1-ritpu05061/1066595ar/abstract/",
            "Abstract": "This study investigates the changes in university students’ perceptions towards the use of Web search engines after their exposure to a teaching intervention centered on the information problem-solving process. A total of 138 students of the Department of Educational Sciences and Early Childhood Education of the University of Patras were surveyed to measure perceived ease of use and usefulness of search engines and search engine self-efficacy. A questionnaire, part of which was based on the Technology Acceptance Model, was developed and distributed to respondents, both before and after the course, to measure their perceptions. The results revealed statistically significant improvement for the ease of use and usefulness of search engines, as well as for search engine self-efficacy.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:MIUEjqm7qCUC",
            "Publisher": "CRIFPE"
        },
        {
            "Title": "La recherche en éducation à l’ère des TIC",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=5594929506996065829&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:8xglSJ46CyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ModellingSpace: supporting young students to be thoroughly involved in modelling and collaborative modelling activities",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1357765/",
            "Abstract": "How to really support young students in cognitively demanding modeling & collaborative modeling activities? ModellingSpace environment was designed to deal with this problem. This short paper is focused on its main design principles and features related to modeling primitives, data representations, collaborative activities' support, metacognitive support for students, as well as to teachers' support.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Les technologies",
            "Publication year": 2018,
            "Publication url": "https://orfee.hepl.ch/handle/20.500.12162/2074",
            "Abstract": "Les technologies Accéder au site institutionnel HEP Vaud Se connecter Parcourir Cette entité \nAuteur Titre Année Périodique Type de référence Rechercher Déposer Analyser Aide feed \nDétail de la référence Les technologies Auteur, co-auteurs Karsenti, Thierry Komis, Vassilis \nDepover, Christian Collin, Simon Bugmann, Julien Editeur(s) scientifique(s) Karsenti, Thierry \nSavoie-Zajc, Lorraine Type de référence Parties d'ouvrages :: Contribution à des ouvrages \ncollectifs Date 2018 Langue de la référence Français Entité(s) de recherche Université de \nMontréal Référence APA Karsenti, T., Komis, V., Depover, C., Collin, S., et Bugmann, J. (2018). \nLes technologies. Dans T. Karsenti et L. Savoie-Zajc (Eds.), La recherche en éducation : étapes \net approches. (4e éd., pp. -406). Montréal, Canada: Presses de l’Université de Montréal.. \nTitre de l’ouvrage principal La recherche en éducation : étapes et approches. Maison d’de l’. '…",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:bYbwfsIO_fQC",
            "Publisher": "Presses de l’Université de Montréal."
        },
        {
            "Title": "Collaborative problem solving using an open modeling environment",
            "Publication year": 2002,
            "Publication url": "https://repository.isls.org/bitstream/1/3896/1/654-655.pdf",
            "Abstract": "An innovative learning environment, enabling collaborative modeling activities, is introduced in this paper. ModelsCreator 3.0 (MC3) supports semi-quantitative, quantitative and qualitative reasoning during modeling activities of collaborating young children. MC3 is also an open environment in terms of primitive modeling entities, models and collaborating partners. Synchronous modeling activity can be performed at a distance using MC3, based on a mechanism of light multiple processes (reactive agents) residing in collaborating hosts.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:3s1wT3WcHBgC",
            "Publisher": "International Society of the Learning Sciences (ISLS)"
        },
        {
            "Title": "Field evaluation of collaborative mobile applications",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/mobile-computing-concepts-methodologies-tools/26722",
            "Abstract": "This chapter presents a usability evaluation method for context aware mobile applications deployed in semi-public spaces that involve collaboration among groups of users. After reviewing the prominent techniques for collecting data and evaluating mobile applications, a methodology that includes a set of combined techniques for data collection and analysis, suitable for this kind of applications is proposed. To demonstrate its applicability, a case study is described where this methodology has been used. It is argued that the method presented here can be of great help both for researchers that study issues of mobile interaction as well as for practitioners and developers of mobile technology and applications.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:_kc_bZDykSQC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Design requirements for educational robotics activities for sustaining collaborative problem solving",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-55553-9_18",
            "Abstract": "The objective of this study is to identify the instructional design requirements of Educational Robotics (ER) activities for sustaining collaborative problem solving (CPS) skills. In CPS activities, learners work in teams towards the analysis, the identification and the solution of a problem. PISA and most of the 21st century skills frameworks have promoted the importance of CPS for 21st century education. In this study, we aim to analyze ER opportunities for 21st century education, in general, and CPS skills, according to the PISA CPS framework. To achieve this, we first review the design requirements of the learning activities that have been identified in the literature as sustaining CPS. Afterwards, we identify the design requirements of ER activities that can sustain the development of CPS. Activities engaging learners in authentic ill-defined problems, with a certain level of complexity are identified as design …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:KVXOKlNwS8oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "e-ProBotLab: Design and Evaluation of an Open Educational Robotics Platform",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-95059-4_21",
            "Abstract": "The purpose of this chapter is the overview of an educational robotic platform called e-ProBotLab (early Programming Robots Laboratory), which constitutes a laboratory prototype for the construction and programming of robotic devices, suitable for the development of computational thinking through the use of robotics in education. The e-ProBotLab platform constitutes a programming and robotics learning framework through practice. It was developed by the ICT in education research group (ICTE Group) of the department of Educational Sciences and Early Childhood Education of the University of Patras. The platform allows preschool students to program the robotic construction in a playful way, while the open-source technology used enables older students to construct the robotic device on their own, possibly with the aid of the instructor. Through the engagement with this platform, children are taught …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:dYRx7efp7U0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Reflective practice in initial teacher training: Critiques and perspectives",
            "Publication year": 2013,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/14623943.2012.732935",
            "Abstract": "Although reflective practice is now a key competency in many teacher training programs, the theoretical grounding remains problematic and the empirical approaches diverse. With the aim of advancing our understanding of the limitations of reflective practice in initial teacher training, this article draws a critical portrait of reflective practice in terms of theory, practice and methodology based on a review of the literature. We conclude by underscoring the need for a shared terminology and definition for reflective practice in initial training programs; currently, the lack of a clear concept hinders its operationalization in teacher training and its development in empirical research.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Routledge"
        },
        {
            "Title": "Science Education Ideas, Practices and Needs of Pre-Primary School Teachers in Greece.",
            "Publication year": 2006,
            "Publication url": "https://eric.ed.gov/?id=EJ1065278",
            "Abstract": "The present article presents the results obtained from a research on Science Education ideas, practices, and needs ofpre—pn'mary teachers in Greece. A questionnaire was administrated to a sample of 130 preprimary school teachers, and the data was analyzed through Multiple Correspondence Analysis. The results show that there are separate groups of teachers, whose ideas and science teaching activities are related to their age, previous teaching experience, and studies.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:sSrBHYA8nusC",
            "Publisher": "International Council of Associations for Science Education. Dokuz Eylul University Faculty of Education, Buca, Izmir 35150, Turkey"
        },
        {
            "Title": "Les TIC comme outils de recherche en sciences de l’éducation",
            "Publication year": 2011,
            "Publication url": "http://150.140.160.61:8000/static/book/chapter/2021/01/08/ch16-karsenti-et-al-les-tice-outil-de-recherche.pdf",
            "Abstract": "Résumé Introduction: Des technologies établies aux technologies émergentes: quels apports pour le processus de recherche?",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:OC7j4ufeY2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comprendre l’usage des plateformes d’enseignement et les outils Web 2.0 dans des contextes universitaires de formation hybride: aspects méthodologiques",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:tvutLEwYQz8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing PDA mediated educational activities for a museum visit",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.105.7164&rep=rep1&type=pdf",
            "Abstract": "The aim of the research presented in this paper is to design a class of exploratory, constructivist and collaborative educational activities, mediated by handheld computers for a museum. Design decisions are influenced by pedagogical, technological and contextual issues which shape the design space. Our goal is to create a class of activities that give the students the opportunity to harvest information from artifacts that provided traditionally little interaction opportunities, while collaborate and actively explore the museum area in a personal way. To clarify our decisions, which constitute the proposed approach for constructivist educational activities using handheld computers, we outline the general setting, the interaction model presented to the students in order to use efficiently the mobile devices and the pedagogical goals under the prism of activity theory which drives our decisions. A typical example of our approach is discussed in the paper: the ‘inheritance activity’was introduced to young students visiting a Cultural-Historical Museum. Results of the study helped us to refine our design decisions and are discussed in detail in the following.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing computer-supported dynamic modeling and ‘paper & pencil’concept mapping technique in students’ collaborative activity",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131506000030",
            "Abstract": "This study aims at highlighting the collaborative activity of two high school students (age 14) in the cases of modeling the complex biological process of plant growth with two different tools: the ‘paper & pencil’ concept mapping technique and the computer-supported educational environment ‘ModelsCreator’. Students’ shared activity in both cases is carried out in the presence of a facilitator providing technical as well as cognitive support when necessary. The objective of the study is to highlight the ways in which the collaborating students are engaged in the plant growth modeling activity in the two cases and also identify the activity’s similar and different aspects in each one. Our analysis is carried out on two complementary axes, the first of which concerns the process of collaboratively creating a plant growth model with each different tool, while the second has to do with the students’ conceptualizations of the …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "ModellingSpace: A tool for synchronous collaborative problem solving",
            "Publication year": 2004,
            "Publication url": "https://www.learntechlib.org/p/12961/",
            "Abstract": "ModellingSpace is a new learning environment, that allows collaboration of partners, collocated or at a distance in various educational settings. This paper describes the main features of the architecture of the ModellingSpace environment and in particular issues related with coordination and communication during problem solving. The results of an evaluation study of ModellingSpace, which has been recently contacted in order to examine the effect of various levels of locking of objects in the shared activity space are also reported here. Through this study, the effectiveness and the limitations of the proposed architecture are identified and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Se3iqnhoufwC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "University teaching versus the MOOC: Reports from the field, current trends, and future directions",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Vassilis_Komis/publication/340518623_University_teaching_versus_the_MOOC_Reports_from_the_field_current_trends_and_future_directions/links/5fa523b2a6fdcc062418a483/University-teaching-versus-the-MOOC-Reports-from-the-field-current-trends-and-future-directions.pdf",
            "Abstract": "Despite the fact that some researchers consider the MOOC the most important experiment to date in university teaching (Weissmann, 2012), and despite the fact that The New York Times named 2012 “The Year of the MOOC”(Pappano, 2012), we now realize that this new form of university teaching poses a number of challenges for designers, educators, and students alike. We also note a growing trend: the success of a MOOC is not necessarily measured in terms of the number of students who complete the course, but instead the number of students who enroll in it. These steep drop-out rates have been called a “funnel of participation”(Clow, 2013).This special thematic issue aims to add to the literature by presenting diverse perspectives on this contemporary problem. Featured articles will include reports of experiences in France (Bar-Hen, Javaux, & Villa-Vialaneix), an examination of passive and active retention rates in Belgium (Schiffino, Cogels, Baudewyns, Hamonic, Legrand, & Reuchamps), an enquiry into MOOC participation in France (Khaneboubi & Baron), attention channeling strat-",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:UPMPWMAU16oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ModelsCreator-Un logiciel de modélisation, les regles logiques et la prise de décision",
            "Publication year": 2001,
            "Publication url": "https://edutice.archives-ouvertes.fr/edutice-00001195/",
            "Abstract": "Les processus de résolution de problèmes et de prise de décision constituent une question importante de l'enseignement et de l'apprentissage. Les compétences acquises par les élèves au cours de ces processus devraient se trouver au centre même de l'acte éducatif. Cet article traite des processus de prise de décision dans le cadre de résolution des problèmes à l'aide du logiciel éducatif ModelsCreator. Ce logiciel constitue un environnement ouvert d'apprentissage, permettant aux élèves de concevoir, de construire et de modifier des modèles. Il s'agit d'un environnement de modélisation mettant l'accent sur le raisonnement qualitatif et semi-quantitatif, ainsi que sur les moyens alternatifs d'expression et de visualisation des modèles. Nous étudions les aspects de construction des modèles d'ordre logique et de prise de décision, de l'étude de leur comportement et de leur amélioration.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Participatory Analysis of Synchronous Collaborative Problem Solving using the OCAF methodology and tools",
            "Publication year": 2003,
            "Publication url": "http://150.140.160.61:8000/static/conference/international/2020/12/28/Avouris_etal_Interactive_event_proposal_CSCL2003.pdf",
            "Abstract": "This interactive event aims at introducing the participants in analysis of collaborative problem-solving activities, in which they are going to be first involved themselves, using the OCAF (Object-oriented collaboration analysis framework) methodology and Collaboration analysis tools.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Συνεργατική Τεχνολογία",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=8084873821784119482&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:LGh1lRt-7sUC",
            "Publisher": "Εκδόσεις Κλειδάριθμος"
        },
        {
            "Title": "Open courses in a Greek higher education institution: faculty views and attitudes",
            "Publication year": 2015,
            "Publication url": "http://eproceedings.epublishing.ekt.gr/index.php/openedu/article/view/19",
            "Abstract": "“Open Courses”, has been a large scale initiative to develop open courseware in Greek higher education. As the project has come to its end, a first evaluation of the outcomes is attempted in this paper at the level of one of the participating universities. The University of Patras has been a major partner in this project. It has been the Greek institution with the higher number of open courses developed in the frame of it. So it is worth looking closely into the produced results and in particular the views and attitudes of the faculty that participated in the process. In this paper, we report on the findings of a survey that was conducted during the final phase of the project. This survey asked key faculty members that participated in the action to provide their view on the experience and make suggestions on the future of open courseware in the University.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:HKuYlFsi-qEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Le contrôle de qualité: un outil indispensable pour asseoir la légitimité de la formation à distance",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Christian-Depover/publication/249962507_Le_controle_de_qualite_un_outil_indispensable_pour_asseoir_la_legitimite_de_la_formation_a_distance/links/00b7d5218c3d1450a6000000/Le-controle-de-qualite-un-outil-indispensable-pour-asseoir-la-legitimite-de-la-formation-a-distance.pdf#page=3",
            "Abstract": "À un moment où la formation à distance fait l’objet de toutes les attentions des milieux universitaires, il nous a paru opportun de mettre en avant le problème de la qualité et de son contrôle dans des dispositifs pédagogiques qui ambitionnent souvent de toucher des centaines, voire des milliers d’étudiants. Comme nous tenterons de le montrer dans cette contribution, les approches susceptibles d’être mobilisées à ce propos sont diverses et variées en fonction de l’idée qu’on se fait de ce qu’est la qualité, mais aussi en fonction des outils qu’on a choisi de mobiliser pour apprécier cette qualité. Nous terminerons en insistant sur l’importance de la démarche qualité qui doit guider le concepteur d’un dispositif de formation à distance tout au long de son itinéraire de conception.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:j33aPA1ap8EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time collaborative modelling over low-bandwidth networks",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/50010427/C68_Margaritis_Avouris_Komis_Dimitracopoulou_CSCL2003_poster.pdf",
            "Abstract": "ModellingSpace is an open learning environment, which permits building of models by collaborating partners in various educational settings. This paper describes briefly the main features of the ModellingSpace environment and in particular issues related with coordination and communication during problem solving, as well as architectural considerations of this distributed peer-to-peer application relating to maintaining acceptable performance under low bandwidth network conditions. This is an interactive paper followed by a computer presentation of the described software.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "High‐school students’ reasoning while constructing plant growth models in a computer‐supported educational environment",
            "Publication year": 2005,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09500690500069376",
            "Abstract": "This paper highlights specific aspects of high‐school students’ reasoning while coping with a modeling task of plant growth in a computer‐supported educational environment. It is particularly concerned with the modeling levels (‘macro‐phenomenological’ and ‘micro‐conceptual’ level) activated by peers while exploring plant growth and with their ability to shift between or within these levels. The focus is on the types of reasoning developed in the modeling process, as well as on the reasoning coherence around the central concept of plant growth. The findings of the study show that a significant proportion of the 18 participating dyads perform modeling on both levels, while their ability to shift between them as well as between the various elements of the ‘micro‐conceptual’ level is rather constrained. Furthermore, the reasoning types identified in peers’ modeling process are ‘convergent’, ‘serial’, ‘linked’ and …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "THE DISCOURSE ON THE INTEGRATION OF ICT IN STEM EDUCATION: APPROACHES EXPRESSED IN TEXTS ON EDUCATION IN GREECE (1984-2006)",
            "Publication year": 2018,
            "Publication url": "https://www.oapub.org/edu/index.php/ejoe/article/view/2093",
            "Abstract": "The views on the integration of Information and Communication Technologies (ICT) in education move towards various approaches regarding the aims and/or the nature of computerization that could be adopted in the Greek curricula, during the period 1984-2006, in which the most important curricular reforms related to this integration were completed. By employing the methodological tool of Aviram & Tami, this research carries out a quantitative and qualitative analysis of texts published in the Greek scientific Journal “Contemporary Education” and studies the discourse formulated about the integration of ICT in Greek Science, Technology, Engineering and Mathematics (STEM) education. This analysis attempts to distinguish and “map” the different approaches expressed by the articles' authors on this integration. The research results revealed a strong tendency of Greek STEM education to attach primarily didactic and administrative approaches to ICT integration leading to micro level changes. It is quite interesting that–during the time period of this study-none of authors' approaches were adopted a systemic view, in the direction of extensive changes in the Greek educational system, in order to facilitate the integration of ICT in STEM education.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:eP5N1itS6b0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enjeux dans la création d'une communauté d'enseignants engagés dans l'apprentissage de l'informatique",
            "Publication year": 2020,
            "Publication url": "https://hal.inria.fr/hal-02426274/",
            "Abstract": "L’accompagnement des enseignants du primaire et du secondaire en charge de l’enseignement de l’informatique est un enjeu majeur dans l’intégration effective de l’enseignement de l’informatique à l’école. La formation initiale et continue doit pouvoir permettre d’accompagner les enseignants dans leur propre apprentissage de l’informatique et les aider à développer leurs connaissances et leurs stratégies pédagogiques pour cet enseignement de l’informatique. Dans ce contexte, l’entraide et le développement d’un sentiment d’auto-efficacité doit permettre de sécuriser les enseignants intégrants des activités d’apprentissage de l’informatique à l’école. À cette fin, dans le cadre du projet Erasmus+ Communauté d’Apprentissage de l’Informatique (CAI), nous visons à développer une Communauté de Pratique (CoP) qui puissent permettre le partage, mais aussi le développement, de pratiques et de ressources pédagogiques co-construites autour de l’enseignement de l’informatique à l’école. Nous décrivons ici les enjeux de la création de cette CoP et les enjeux pour son développement et son évaluation.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:lu5AzqVF4qYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Antecedents of collaborative learning: Insights from massively multiplayer online games",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5702074/",
            "Abstract": "This study focuses on the investigation of features of Massively Multiplayer Online Games (MMOGs) relevant to the support of collaborative learning processes. Through qualitative research (interviews with players, participant observation in MMOGs, research in websites and for a) we identify and describe motivational, cognitive and social features of the tasks and the player interactions emerging within such environments.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bending the Rules... and Adding Some New Ones: Legal and Illegal Behaviours of Players in Massively Multiplayer Online Games",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/39447782/Bending_the_Rules__and_Adding_Some_New_O20151026-23878-nghfws.pdf",
            "Abstract": "In this paper we focus on the interaction of the players’ community in MMOGs with the game environment from the perspective of the rules, and the possible implications of these interactions, for the game design. We identify and describe two main types of behaviours: the brea ing of rules and the development of new ones, and conclude that whether these rules and behaviours are acceptable or not depends on both personal criteria and the social context.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Συνεργατική Τεχνολογία",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=8084873821784119482&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:2hlgnPHlchoC",
            "Publisher": "Εκδόσεις Κλειδάριθμος, ISBN: 978-960-461-232-1"
        },
        {
            "Title": "Computer simulations in physics teaching and learning: a case study on students' understanding of trajectory motion",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131500000592",
            "Abstract": "A major research domain in physics education is focused on the study of the effects of various types of teaching interventions aimed to help students' alternative conceptions transformation. Computer simulations are applications of special interest in physics teaching because they can support powerful modeling environments involving physics concepts and processes. In this study two groups (control and experimental) of 15–16 years old students were studied to determine the role of computer simulations in the development of functional understanding of the concepts of velocity and acceleration in projectile motions. Both groups received traditional classroom instruction on these topics; the experimental group used computer simulations also. The results presented here show that students working with simulations exhibited significantly higher scores in the research tasks. Our findings strongly support that computer …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Robotics in Primary Education–Robotique en Éducation Primaire: Introduction",
            "Publication year": 2019,
            "Publication url": "https://electra.lis.upatras.gr/review/article/view/3151",
            "Abstract": "This Special Issue of the Journal “Review of Science, Mathematics and ICT Education” is dedicated to the Educational Robotics in Primary Education. There is currently a real enthusiasm for educational robotics which is supported by the incessant emergence of new educational robots and articles published by the media. Undoubtedly, at least at the level of primary education, a new wave of technology appeared in order for concepts of programming (or\" coding\") sweeps to be applied, which consequently raises the question of what it can bring to teachers and learners over time. At the same time, scientific research in this field is making significant progress in recent years by providing interesting results in both basic and applied research. On the other hand, there are many challenges with obtaining data with respect to the appropriation of this type of approach by teachers. Indeed, initial and in-service training of teachers is a major challenge to develop learning activities with educational robots which help develop specific learning objectives as well as the development of high-order thinking skills.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:Xxrp-jDxsD4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing user support in open problem solving environments through Bayesian Network inference techniques",
            "Publication year": 2006,
            "Publication url": "https://www.jstor.org/stable/pdf/jeductechsoci.9.4.150.pdf",
            "Abstract": "During the last years, development of open learning environments that support effectively their users has been a challenge for the research community of educational technologies. The open interactive nature of these environments results in users experiencing difficulties in coping with the plethora of available functions, especially during their initial efforts to use the system. In addition,-from the tutors’ perspectivethe problem solving strategies of the students are often particularly difficult to identify. In this paper, we argue that such problems could be tackled using machine learning techniques such as Bayesian Networks. We show how we can take advantage of log files obtained during field studies to build an adaptive help system providing the most useful support to the student, according to the state of interaction. On the other hand, we attempt to support the tutor, by automating the process of diagnosing students …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:hC7cP41nSMkC",
            "Publisher": "International Forum of Educational Technology & Society"
        },
        {
            "Title": "Στάσεις και αντιλήψεις εκπαιδευτικών της δευτεροβάθμιας εκπαίδευσης σχετικά με την εφαρμογή των ΤΠΕ στη διδασκαλία τους",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:cpgjJtNNFA0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pour comprendre les MOOCs Nature, enjeux et perspectives",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=5044729971651577137&hl=en&oi=scholarr",
            "Abstract": "Depuis l’apparition des MOOCs (Massive Open Online Course ou cours en ligne ouvert et massif [CLOM]), il y a un peu plus de 10 ans, la perception qu’en ont les chercheurs et le grand public a bien changé. On est passé d’une vision idéaliste à une conception plus réaliste des enjeux éducatifs et des implications financières associés à cette nouvelle modalité d’apprentissage. La progression des MOOCs est considérable. On observe des taux de croissance du nombre d’inscrits qui avoisinent les 100% et une offre qui ne cesse de croître. Ils sont devenus un phénomène de société: le New York Times a même proclamé 2012 comme étant l’année du MOOC. C’est à l’étude de ce phénomène que vous convient les auteurs du présent ouvrage, en s’ appuyant à la fois sur l’analyse de l’abondante littérature scientifique et sur leur expérience de concepteurs de MOOCs. Ce livre propose des outils aux personnes qui souhaitent s’ engager directement dans cette aventure, mais aussi des réflexions sur l’arrivée de ce nouveau type de cours dans le paysage éducatif mondial.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:jvrRlaHg2sAC",
            "Publisher": "Presses de l'Université du Quebec"
        },
        {
            "Title": "Οι τεχνολογίες της πληροφορίας και της επικοινωνίας στην εκπαίδευση.  Πρακτικά εισηγήσεων  2 ου Πανελλήνιου Συνεδρίου με Διεθνή Συμμετοχή.  Πάτρα:  Εκδόσεις Νέων Τεχνολογιών.",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:LpHykl0McycC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Construire les notions de l’orientation et de la direction à l’aide des jouets programmables: Une étude de cas dans des écoles maternelles en Grèce",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=3569061024292552930&hl=en&oi=scholarr",
            "Abstract": "Elle se situe au carrefour de deux approches éducatives très propices au plan cognitif dans l’enseignement du premier degré: les activités de manipulation et de construction des objets tangibles à la base des dispositifs de type Lego ou autres, et les micromondes programmables (Depover, Karsenti et Komis, 2007). Dans ce cadre, en se basant surtout autour des travaux de Seymour Papert, les pédagogues et les didacticiens se sont penchés sur les apports cognitifs de la robotique en tant qu’outil pédagogique. Dans ce contexte, l’importance de la robotique pédagogique et ses apports cognitifs pour les enfants de l’école maternelle et primaire sont étudiés et validés depuis longtemps dans la littérature scientifique (Bers, 2008; Denis et Baron, 1994; Greff, 1996, 2001).",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:ThYxFsVAhEkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving database design teaching in secondary education: action research implementation for documentation of didactic requirements and strategies",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0747563204001177",
            "Abstract": "Database design and use has educational interest for utilitarian and learning reasons. Database technology has significant economic impact and the demand for database design cannot be covered by the existent educated experts. Furthermore, the database management systems available at schools could be used for the design and implementation of high quality learning activities. Databases are general purpose modeling environments that enable problem solving using conceptual frameworks closer to the solver and the problem than the machine architecture. Databases design introduction in the curricula of secondary education programs raises educational research questions. Research questions concern the didactics of the subject as well as the value of database design based learning activities. In this paper, we present some of the more significant findings of an action research concerning the database …",
            "Abstract entirety": 0,
            "Author pub id": "y-hRoJQAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Factors and processes involved in collaborative learning and problem solving in massively multiplayer online games: Aspects of the designed and the social environment",
            "Publication year": 2010,
            "Publication url": "https://www.academia.edu/download/1975123/C02.2010.Factors_and_Processes_Involved_in_Collaborative_Learning_and_Problem_Solving_in_Massively_Multiplayer_Online_Games-Aspects_of_t.pdf",
            "Abstract": "Massively Multiplayer Online Games (MMOGs) constitute virtual environments rich in task-oriented and social interactions among players. These interactions are directed both by the design of the environment as well as by the community of the players. There are strong indications that these environments constitute, beyond of environments for fun, environments of collaborative learning through interactions with peers. Through this paper, we review research in the area of collaborative learning and relate it to relevant findings from the area of research in MMOGs and findings from our own research, in an attempt to formulate a conceptual model for the investigation of collaborative learning processes in MMOGs.",
            "Abstract entirety": 1,
            "Author pub id": "y-hRoJQAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        }
    ]
}]