[{
    "name": "Γεώργιος Σπανουδάκης",
    "romanize name": "Georgios Spanoudakis",
    "School-Department": "Computer Science",
    "University": "City University London",
    "Rank": "Καθηγητής",
    "Apella_id": 10542,
    "Scholar name": "George Spanoudakis",
    "Scholar id": "XQSvrAwAAAAJ",
    "Affiliation": "Professor, City University London",
    "Citedby": 4772,
    "Interests": [
        "Software engineering",
        "software security",
        "biomedical computing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=XQSvrAwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Towards the Insurance of Healthcare Systems",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=RPHRDwAAQBAJ&oi=fnd&pg=PA185&dq=info:5K8zJUjqWcYJ:scholar.google.com&ots=0RN2trWzeR&sig=aCuOGZUtJfXIsQjbEDkLMTP14s0",
            "Abstract": "Insurance of digital assets is becoming an important aspect nowadays, in order to reduce the investment risks in modern businesses. GDPR and other legal initiatives makes this necessity even more demanding as an organization is now accountable for the usage of its client data. In this paper, we present a cyber insurance framework, called CyberSure. The main contribution is the runtime integration of certification, risk management, and cyber insurance of cyber systems. Thus, the framework determines the current level of compliance with the acquired policies and provide early notifications for potential violations of them. CyberSure develops CUMULUS certification models for this purpose and, based on automated (or semi-automated) certification carried out using them, it develops ways of dynamically adjusting risk estimates, insurance policies and premiums. In particular, it considers the case of dynamic certification, based on continuous monitoring, dynamic testing and hybrid combinations of them, to adapt cyber insurance policies as the conditions of cyber system operation evolve and new data become available for adjusting to the associated risk. The applicability of the whole approach is demonstrated in the healthcare sector, for insuring an e-health software suite that is provided by an IT company to public and private hospitals in Greece. The overall approach can reduce the potential security incidents and the related economic loss, as the beneficiary deploys adequate protection mechanisms, whose proper operation is continually assessed, benefiting both the insured and the insurer.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:HeT0ZceujKMC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "A multi-layer and multitenant cloud assurance evaluation methodology",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7037693/",
            "Abstract": "Data with high security requirements is being processed and stored with increasing frequency in the Cloud. To guarantee that the data is being dealt in a secure manner we investigate the applicability of Assurance methodologies. In a typical Cloud environment the setup of multiple layers and different stakeholders determines security properties of individual components that are used to compose Cloud applications. We present a methodology adapted from Common Criteria for aggregating information reflecting the security properties of individual constituent components of Cloud applications. This aggregated information is used to categorise overall application security in terms of Assurance Levels and to provide a continuous assurance level evaluation. It gives the service owner an overview of the security of his service, without requiring detailed manual analyses of log files.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "D2. 1: Security-aware SLA specification language and cloud security dependency model",
            "Publication year": 2013,
            "Publication url": "https://cordis.europa.eu/docs/projects/cnect/0/318580/080/deliverables/001-D21SecurityawareSLAspecificationlanguageandcloudsecuritydependencymodelv101.pdf",
            "Abstract": "In terms of cloud security, service level agreements and certificates share some strong similarities at their core: they both represent a form of assurance given to a customer about the security level provided by a service. Service level agreements represent the contractual commitments made by cloud providers to their customers, while certificates represent an assertion that has been verified to be true by a trusted authority. In this deliverable we mainly examine this core similarity between SLAs and certificates, in order to set the foundation for some of the work that will be done in the CUMULUS project, notably with the specification of a security property vocabulary.The implementation a certification process is a more complex process than creation of SLAs. Nevertheless, gaps in current SLAs specifications approaches and languages can inform us on issues that are likely to exist in the type of automated certification tools CUMULUS aims to provide. In section 1, we therefore start by highlight a key issue in current SLAs: the lack of standardized definition and measurement of security properties. For example, we show how competing cloud offerings can claim to offer similar “uptime” claims, which represent diverging performances in practice, simply by using a different definition for “uptime”. Our conclusion is that security properties in SLAs or certificates cannot simply be described by a",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:bKqednn6t2AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards a Collection of Security and Privacy Patterns",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/985826",
            "Abstract": "Security and privacy (SP)-related challenges constitute a significant barrier to the wider adoption of Internet of Things (IoT)/Industrial IoT (IIoT) devices and the associated novel applications and services. In this context, patterns, which are constructs encoding re-usable solutions to common problems and building blocks to architectures, can be an asset in alleviating said barrier. More specifically, patterns can be used to encode dependencies between SP properties of individual smart objects and corresponding properties of orchestrations (compositions) involving them, facilitating the design of IoT solutions that are secure and privacy-aware by design. Motivated by the above, this work presents a survey and taxonomy of SP patterns towards the creation of a usable pattern collection. The aim is to enable decomposition of higher-level properties to more specific ones, matching them to relevant patterns, while also creating a comprehensive overview of security-and privacy-related properties and sub-properties that are of interest in IoT/IIoT environments. To this end, the identified patterns are organized using a hierarchical taxonomy that allows their classification based on provided property, context, and generality, while also showing the relationships between them. The two high-level properties, Security and Privacy, are decomposed to a first layer of lower-level sub-properties such as confidentiality and anonymity. The lower layers of the taxonomy, then, include implementation-level enablers. The coverage that these patterns offer in terms of the considered properties, data states (data in transit, at rest, and in process), and platform connectivity …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:mlAyqtXpCwEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Towards a security, privacy, dependability, interoperability framework for the Internet of Things",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8514937/",
            "Abstract": "A popular application of ambient intelligence systems constitutes of assisting living services on smart buildings. As intelligence is imported in embedded equipment, the system becomes able to provide smart services (e.g. control lights, airconditioning, provide energy management services etc.). IoT is the main enabler of such environments. However, the interconnection of these cyber-physical systems and the processing of personal data raise serious security and privacy issues. In this paper we present a framework that can guarantee Security, Privacy, Dependability and Interoperability (SPDI) in IoT. Taking advantage of the underlying IoT deployment, the proposed framework not only implements the requested smart functionality but also provide modelling and administration that can guarantee those SPDI properties. Moreover, we provide an application example of the framework in a smart building scenario.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:q3CdL3IzO_QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-intrusive monitoring of service-based systems",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218843006001384",
            "Abstract": "This paper presents a framework for monitoring the compliance of systems composed of Web-services with requirements set for them at runtime. This framework assumes systems composed of Web-services which are co-coordinated by a service composition process expressed in BPEL and uses event calculus to specify the requirements to be monitored. These requirements may include behavioral properties of a system which are automatically extracted from the specification of its composition process in BPEL and/or assumptions that system providers can specify in terms of events extracted from this specification.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Biosensors and Internet of Things in smart healthcare applications: challenges and opportunities",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/B9780128153697000021",
            "Abstract": "The use of health and well-being monitoring technologies has been steadily increasing and such systems can now be found in smart homes, age-friendly workplaces, public spaces, and elsewhere. These monitoring technologies employ a wide variety of off-the-shelf smart sensors and medical devices to support functional, physiological, and behavioral monitoring and to address social interaction aspects of daily life. These systems focus either on specific health-related conditions or on supporting the more general aims of comfort, well-being, and quality of life. However, there remain several technological (interoperability, expandability, etc.) and societal (cost, privacy, etc.) challenges to be addressed before smart biosensor systems are widely adopted.Motivated by the above, this chapter highlights the challenges and opportunities surrounding the application of smart biosensors in healthcare and presents three …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:YohjEiUPhakC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Pattern-driven Security, Privacy, Dependability and Interoperability in IoT",
            "Publication year": 2020,
            "Publication url": "https://library.oapen.org/bitstream/handle/20.500.12657/47872/9781680836837.pdf?sequence=1#page=153",
            "Abstract": "This chapter presents the development of a pattern-driven approach for guaranteeing Security, Privacy, Dependability and Interoperability (SPDI) properties in the IoT domain. The chapter details how SPDI patterns can be introduced to guarantee multi-layer end-to-end properties, and how the enforcement of the patterns can help and satisfy the requirements for network dependability guarantees. Moreover, it briefly evaluates the presented approach and thus demonstrates how the application of patterns offers a solution to semantic interoperability challenges in IoT environments.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern-Based Design and Verification of Secure Service Compositions",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7891550/",
            "Abstract": "Ensuring the preservation of security is a key requirement and challenge for Service-Based Systems (SBS) due to the use of third party software services not operating under different security perimeters. In this paper, we present an approach for verifying the security properties of SBS workflows and adapting them if such properties are not preserved. Our approach uses secure service composition patterns. These patterns encode proven dependencies between service level and workflow level security properties. These dependencies are used in reasoning processes supporting the verification of SBS workflows with respect to workflow security properties and their adaptation in ways that guarantee the properties if necessary. Our approach has been implemented by extending the Eclipse BPEL Designer and validated experimentally. The experimental evaluation has produced positive results, indicating that even for …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Software traceability: a roadmap",
            "Publication year": 2005,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812775245_0014",
            "Abstract": "Traceability of software artefacts has been recognized as an important factor for supporting various activities in the software system development process. In general, the objective of traceability is to improve the quality of software systems. More specifically, traceability information can be used to support the analysis of implications and integration of changes that occur in software systems; the maintenance and evolution of software systems; the reuse of software system components by identifying and comparing requirements of new and existing systems; the testing of software system components; and system inspection, by indicating alternatives and compromises made during development. Traceability enables system acceptance by allowing users to better understand the system and contributes to a clear and consistent system documentation.Over the last few years, the software and system engineering …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speech audiometry test with picture-related sentence lists in Modern Greek for partially hearing children",
            "Publication year": 2017,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/21695717.2017.1389176",
            "Abstract": "Objective: The aim of this study was to develop Greek sentence-based speech audiometry test in quiet test for hearing-impaired (HI) children (G-SEBSAT).Methods: Seventy-six children were recruited following approval by the local ethics committee and after obtaining informed consent from their parents. The collection of vocabulary was based on showing pictures selected from popular reading materials in Greek to HI children. A grammatical content analysis was carried out to determine the average syntactic and morphological structures of the sentences used by the HI children. Ten picture-related sentence lists were developed based on the vocabulary and the grammatical analysis, and recorded by a male native speaker of standard Modern Greek. These were presented to both normal-hearing (NH) and HI children, and the average speech response threshold (SRT) as well as the slope of the SRT curve at the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:gsN89kCJA0AC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Identifying test requirements by analyzing sla guarantee terms",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6257827/",
            "Abstract": "Service Level Agreements (SLAs) are used to specify the negotiated conditions between the provider and the consumer of services. In this paper we present a stepwise method to identify and categorize a set of test requirements that represent the potential situations that can be exercised regarding the specification of each isolated guarantee term of an SLA. This identification is addressed by means of devising a set of coverage levels that allow grading the thoroughness of the tests. The utilization of these test requirements would focus on twofold objectives: (1) the generation of a test suite that allows exercising the situations described in the test requirements and (2) the support for the derivation of a monitoring plan that checks the compliance of these requirements at runtime. The approach is illustrated over an eHealth case study.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic creation of monitoring infrastructures",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-1614-2_8",
            "Abstract": "As a key part of monitoring and management, systems developed with a Service-Oriented Architecture (SOA) design pattern should utilise negotiated agreements between service providers and requesters. Typically, the results of these negotiations are specified in Service Level Agreements (SLAs), which are then used to monitor key levels of service provided, and to optionally specify preconditions and actions in case these levels are violated.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Diagnosis and Threat Detection Capabilities of the SERENITY Monitoring Framework",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-88775-3_14",
            "Abstract": "The SERENITY monitoring framework offers mechanisms for diagnosing the causes of violations of security and dependability (S&D) properties and detecting potential violations of such properties, called ȁCthreats”. Diagnostic information and threat detection are often necessary for deciding what an appropriate reaction to a violation is and taking pre-emptive actions against predicted violations, respectively. In this chapter, we describe the mechanisms of the SERENITY monitoring framework which generate diagnostic information for violations of S&D properties and detecting threats.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Security engineering for ambient intelligence: A manifesto",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/integrating-security-software.../24058",
            "Abstract": "The scenarios of Ambient Intelligence introduce a new computing paradigm and set new challenges for the design and engineering of secure and dependable sys-tems. This chapter describes SERENITY, a comprehensive approach to overcome those problems. The key to success in this scenario is to capture security expertise in such a way that it can be supported by automated means. SERENITY’s integral model of S&D considers both static and dynamic aspects by relying in two main innovations:(1) the enhanced notion of S&D patterns and integration schemes; and (2) the computer aided run-time monitoring of the implemented security solutions.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Zph67rFs4hoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Inconsistency management in software engineering: Survey and open research issues",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812389718_0015",
            "Abstract": "The development of complex software systems is a complex and lengthy activity that involves the participation and collaboration of many stakeholders (e.g. customers, users, analysts, designers, and developers). This results in many partial models of the developing system. These models can be inconsistent with each other since they describe the system from different perspectives and reflect the views of the stakeholders involved in their construction. Inconsistent software models can have negative and positive effects in the software development life-cycle. On the negative side, inconsistencies can delay and increase the cost of system development; do not guarantee some properties of the system, such as safety and reliability; and generate difficulties on system maintenance. On the positive side, inconsistencies can facilitate identification of some aspects of the system that need further analysis, assist with the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A monitoring approach for runtime service discovery",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10515-010-0077-5",
            "Abstract": "Effective runtime service discovery requires identification of services based on different service characteristics such as structural, behavioural, quality, and contextual characteristics. However, current service registries guarantee services described in terms of structural and sometimes quality characteristics and, therefore, it is not always possible to assume that services in them will have all the characteristics required for effective service discovery. In this paper, we describe a monitor-based runtime service discovery framework called MoRSeD. The framework supports service discovery in both push and pull modes of query execution. The push mode of query execution is performed in parallel to the execution of a service-based system, in a proactive way. Both types of queries are specified in a query language called SerDiQueL that allows the representation of structural, behavioral, quality, and contextual …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Automatic test case generation for WS-Agreements using combinatorial testing",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548914001020",
            "Abstract": "In the scope of the applications developed under the service-based paradigm, Service Level Agreements (SLAs) are a standard mechanism used to flexibly specify the Quality of Service (QoS) that must be delivered. These agreements contain the conditions negotiated between the service provider and consumers as well as the potential penalties derived from the violation of such conditions. In this context, it is important to assure that the service based application (SBA) behaves as expected in order to avoid potential consequences like penalties or dissatisfaction between the stakeholders that have negotiated and signed the SLA. In this article we address the testing of SLAs specified using the WS-Agreement standard by means of applying testing techniques such as the Classification Tree Method and Combinatorial Testing to generate test cases. From the content of the individual terms of the SLA, we identify …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:eMMeJKvmdy0C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Establishing and monitoring SLAs in complex service based systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5175897/",
            "Abstract": "In modern service economies, service provisioning needs to be regulated by complex SLA hierarchies among providers of heterogeneous services, defined at the business, software, and infrastructure layers. Starting from the SLA Management framework defined in the SLA@SOI EU FP7 Integrated Project, we focus on the relationship between establishment and monitoring of such SLAs, showing how the two processes become tightly interleaved in order to provide meaningful mechanisms for SLA management. We first describe the process for SLA establishment adopted within the framework; then,we propose an architecture for monitoring SLAs, which satisfies the two main requirements introduced by SLA establishment: the availability of historical data for evaluating SLA offers and the assessment of the capability to monitor the terms in a SLA offer.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revising Rules to Capture Requirements Traceability Relations: A Machine Learning Approach.",
            "Publication year": 2003,
            "Publication url": "http://staff.city.ac.uk/~aag/papers/seke2003.pdf",
            "Abstract": "In this paper we present a machine learning approach for generating requirements traceability relations. This approach is based on a new learning algorithm that produces traceability rules which are able to capture traceability relations between requirement statements specified in natural language and object models. The creation of these traceability rules is informed by examples of traceability relations which are provided by the user and is based on a generalisation of other existing traceability rules.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for requirents monitoring of service based systems",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1035167.1035181",
            "Abstract": "This paper proposes a framework for monitoring the compliance of systems composed of web-services with requirements set for th. This framework assumes systems composed of web-services that are co-ordinated by a service composition process expressed in BPEL4WS and uses event calculus to specify the properties to be monitored. The monitorable properties may include behavioural properties of a syst which are automatically extracted from the specification of its composition process in BPEL4WS and/or assumptions that syst providers can specify in terms of events extracted from this specification.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "SIREN–A network infrastructure for emergencies.",
            "Publication year": 2015,
            "Publication url": "http://eprints.bournemouth.ac.uk/24618/",
            "Abstract": "The SIREN project (Secure, Interoperable, UAV-assisted, Rapid Emergency Deployment Communication and sensing Infrastructure) implements a secure, distributed, open, self-configured and emergency-aware network and service platform for automated, secure and dependable support of multiple mission critical applications in highly demanding and dynamic emergency environments.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "WARDOG: Awareness detection watchbog for Botnet infection on the host device",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8715790/",
            "Abstract": "Botnets constitute nowadays one of the most dangerous security threats worldwide. High volumes of infected machines are controlled by a malicious entity and perform coordinated cyber-attacks. The problem will become even worse in the era of the Internet of Things (IoT) as the number of insecure devices is going to be exponentially increased. This paper presents WARDOG - an awareness and digital forensic system that informs the end-user of the botnet's infection, exposes the botnet infrastructure, and captures verifiable data that can be utilized in a court of law. The responsible authority gathers all information and automatically generates a unitary documentation for the case. The document contains undisputed forensic information, tracking all involved parties and their role in the attack. The deployed security mechanisms and the overall administration setting ensures non-repudiation of performed actions and …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:ClCfbGk0d_YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security and Dependability Solutions for Networks and Devices",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-88775-3_7",
            "Abstract": "In this chapter we give an overview over the denotation of the SERENITY artefacts S&D Classes, Patterns and Implementations in the context of networks and devices. In order to demonstrate their necessity we sketch an example for confidential and authentic communication and storage that utilizes a trusted platform module, and model the relevant pattern. We then dissociate solutions for network and device related S&D requirements from those targeting the context of organizational or workflow and web services based solutions. Then we give a summary of the broad field of application for network and device solutions. Finally we clarify the meaning and interaction between classes, patterns and implementations by giving some concrete examples.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A privacy-level model of user-centric cyber-physical systems",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39345-7_36",
            "Abstract": "In an interconnected cyber-world, Cyber-Physical Systems (CPSs) appear to play an increasingly important role in smart ecosystems. A variety of resource-constrained thin clients, such as sensors, RFIDs, actuators and smart devices, are included in the list of CPS. These devices can be used in a number of medical, vehicular, aviation, military and smart cities applications. A plethora of sensitive data is transmitted in insecure wireless or wired environments whilst adversaries are eager to eavesdrop, modify or destroy sensed data invading the privacy of user-centric CPSs. This work presents an overview and analysis of the most effective attacks, privacy challenges and mitigation techniques for preserving the privacy of users and their interconnected devices. In order to preserve privacy, a privacy-level model is proposed in which users have the capability of assigning different privacy levels based on the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:kRWSkSYxWN8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Model-driven cyber range training: a cyber security assurance perspective",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007%252F978-3-030-42051-2.pdf#page=185",
            "Abstract": "Security demands are increasing for all types of organisations, due to the ever-closer integration of computing infrastructures and smart devices into all aspects of the organisational operations. Consequently, the need for security-aware employees in every role of an organisation increases in accordance. Cyber Range training emerges as a promising solution, allowing employees to train in both realistic environments and scenarios and gaining hands-on experience in security aspects of varied complexity, depending on their role and level of expertise. To that end, this work introduces a model-driven approach for Cyber Range training that facilitates the generation of tailor-made training scenarios based on a comprehensive model-based description of the organisation and its security posture. Additionally, our approach facilitates the automated deployment of such training environments, tailored to each defined …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:4fGpz3EwCPoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Fault tolerance using an sdn pattern framework",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8254082/",
            "Abstract": "Software Defined Networking (SDN) and Network Function Virtualization (NFV) are a promising combination for programmable connectivity, rapid service provisioning and service chaining, as they offer the necessary end-to-end optimizations. However, with the actual exponential growth of connected devices, future networks such as SDN/NFV require an \"open-solutions\" architecture, facilitated by standards and a strong ecosystem. Such networks need to support communication services that offer guarantees about fault tolerance, redundancy, resilience and security. The construction of complex networks preserving Security and Dependability (S&D) properties is necessary to avoid system vulnerabilities, which may occur in the various layers of SDN architectures. In this work, we propose a pattern framework built in an SDN controller able to import design patterns in a rule-based language and provide fault …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic trust assessment of software services",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1294928.1294937",
            "Abstract": "Trust assessment is a key prerequisite for the adoption of software services but poorly supported by existing methods and technology especially when it comes to trust in dynamically composed and deployed software services. In this position paper, we discuss why this is the case and outline a programme of research focusing on the development of platform for dynamic trust assessment of software services.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining balance disorders' data for the development of diagnostic decision support systems",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S001048251630213X",
            "Abstract": "In this work we present the methodology for the development of the EMBalance diagnostic Decision Support System (DSS) for balance disorders. Medical data from patients with balance disorders have been analysed using data mining techniques for the development of the diagnostic DSS. The proposed methodology uses various data, ranging from demographic characteristics to clinical examination, auditory and vestibular tests, in order to provide an accurate diagnosis. The system aims to provide decision support for general practitioners (GPs) and experts in the diagnosis of balance disorders as well as to provide recommendations for the appropriate information and data to be requested at each step of the diagnostic process. Detailed results are provided for the diagnosis of 12 balance disorders, both for GPs and experts. Overall, the reported accuracy ranges from 59.3 to 89.8% for GPs and from 74.3 to 92.1 …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "UML-based service discovery framework",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11948148_33",
            "Abstract": "The development of service centric systems, i.e software systems constructed as compositions of autonomous services, has been recognised as an important approach for software system development. Recently, there has been a proliferation of systems which are developed, deployed, and consumed in this way. An important aspect of service centric systems is the identification of web services that can be combined to fulfill the functionality and quality criteria of the system being developed. In this paper we present the results of the evaluation of a UML-based framework for service discovery. This framework supports the identification of services that can provide the functionality and satisfy properties and constraints of service centric systems as specified during their design. Our approach adopts an iterative design process allowing for the (re-) formulation of the design models of service centric systems based …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Describing and Verifying Monitoring Capabilities for SLA-Driven Service Based Systems.",
            "Publication year": 2009,
            "Publication url": "https://core.ac.uk/download/pdf/42630437.pdf",
            "Abstract": "Monitoring the operation of Service Based Systems (SBS) to ensure compliance with a set of service level agreements (SLAs) for example cannot always rely on a pre-specified monitoring infrastructure, where all the information and components required for monitoring are a priori known and available. This because new services with unknown monitoring infrastructures and capabilities may be dynamically assembled to an SBS. To address the need for dynamic configuration of SBS monitoring infrastructures, this paper proposes a model for describing the monitoring capabilities of different services of an SBS and discusses the process for verifying the monitorability of required properties based on these capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "IoT European security and privacy projects: Integration, architectures and interoperability",
            "Publication year": 2018,
            "Publication url": "https://sintef.brage.unit.no/sintef-xmlui/handle/11250/2575162",
            "Abstract": "The chapter presents an overview of the eight that are part of the European IoT Security and Privacy Projects initiative (IoT-ESP) addressing advanced concepts for end-to-end security in highly distributed, heterogeneous and dynamic IoT environments. The approaches presented are holistic and include identification and authentication, data protection and prevention against cyber-attacks at the device and system levels. The projects present architectures, concepts, methods and tools for open IoT platforms integrating evolving sensing, actuating, energy harvesting, networking and Interface technologies. Platforms should provide connectivity and intelligence, actuation and control features, linkage to modular and ad-hoc cloud services, The IoT platforms used are compatible with existing international Developments addressing object identity management, discovery services, virtualisation of objects, devices and infrastructures and trusted IoT approaches.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:XoXfffV-tXoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Run-time monitoring of requirements for systems composed of web-services: Initial implementation and evaluation experience",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1530805/",
            "Abstract": "This paper describes a framework supporting the runtime monitoring of requirements for systems implemented as compositions of Web-services specified in BPEL. The requirements that can be monitored are specified in event calculus. The paper presents an overview of the framework and describes the architecture and implementation of a tool that we have developed to operationalise it. It also presents the results of a preliminary experimental evaluation of the framework.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Handbook of software engineering and knowledge engineering",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ILLcsh36RpEC&oi=fnd&pg=PR5&dq=info:8C-1LC601qIJ:scholar.google.com&ots=24k6Ih12Um&sig=k0szbHMvy3pK2o6Bly8Bq3GDB2g",
            "Abstract": "This is the first handbook to cover comprehensively both software engineering and knowledge engineering OCo two important fields that have become interwoven in recent years. Over 60 international experts have contributed to the book. Each chapter has been written in such a way that a practitioner of software engineering and knowledge engineering can easily understand and obtain useful information. Each chapter covers one topic and can be read independently of other chapters, providing both a general survey of the topic and an in-depth exposition of the state of the art. Practitioners will find this handbook useful when looking for solutions to practical problems. Researchers can use it for quick access to the background, current trends and most important references regarding a certain topic. The handbook consists of two volumes. Volume One covers the basic principles and applications of software engineering and knowledge engineering. Volume Two will cover the basic principles and applications of visual and multimedia software engineering, knowledge engineering, data mining for software knowledge, and emerging topics in software engineering and knowledge engineering. Sample Chapter (s). Chapter 1.1: Introduction (97k). Chapter 1.2: Theoretical Language Research (97k). Chapter 1.3: Experimental Science (96k). Chapter 1.4: Evolutionary Versus Revolutionary (108k). Chapter 1.5: Concurrency and Parallelisms (232k). Chapter 1.6: Summary (123k). Contents: Computer Language Advances (DE Cooke et al.); Software Maintenance (G Canfora & A Cimitile); Requirements Engineering (AT Berztiss); Software Engineering …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Formal certification and compliance for run-time service environments",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6274122/",
            "Abstract": "With the increased awareness of security and safety of services in on-demand distributed service provisioning (such as the recent adoption of Cloud infrastructures), certification and compliance checking of services is becoming a key element for service engineering. Existing certification techniques tend to support mainly design-time checking of service properties and tend not to support the run-time monitoring and progressive certification in the service execution environment. In this paper we discuss an approach which provides both design-time and runtime behavioural compliance checking for a services architecture, through enabling a progressive event-driven model-checking technique. Providing an integrated approach to certification and compliance is a challenge however using analysis and monitoring techniques we present such an approach for on-going compliance checking.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Runtime prediction",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-1614-2_9",
            "Abstract": "Monitoring the preservation of quality of service (QoS) properties during the operation of service-based systems at runtime is an important verification measure for determining whether current service usage is compliant with agreed SLAs. Monitoring, however, does not always provide sufficient scope for taking control actions against violations, as it only detects violations after they occur. This chapter describes a model-based prediction framework for detecting potential violations of QoS properties before they occur to enable the undertaking of control actions that could prevent the violations. EVEREST+ receives prediction specifications expressed in Event Calculus and automatically identifies relevant monitoring data that should be collected at runtime to infer QoS property prediction models. It then analyses runtime monitoring data to infer statistical prediction models for the relevant properties, and uses the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "MobileTrust: Secure knowledge integration in VANETs",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3364181",
            "Abstract": "Vehicular Ad hoc NETworks (VANET) are becoming popular due to the emergence of the Internet of Things and ambient intelligence applications. In such networks, secure resource sharing functionality is accomplished by incorporating trust schemes. Current solutions adopt peer-to-peer technologies that can cover the large operational area. However, these systems fail to capture some inherent properties of VANETs, such as fast and ephemeral interaction, making robust trust evaluation of crowdsourcing challenging. In this article, we propose MobileTrust—a hybrid trust-based system for secure resource sharing in VANETs. The proposal is a breakthrough in centralized trust computing that utilizes cloud and upcoming 5G technologies to provide robust trust establishment with global scalability. The ad hoc communication is energy-efficient and protects the system against threats that are not countered by the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:kh2fBNsKQNwC",
            "Publisher": "ACM"
        },
        {
            "Title": "SPD-safe: Secure administration of railway intelligent transportation systems",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/949854",
            "Abstract": "The railway transport system is critical infrastructure that is exposed to numerous man-made and natural threats, thus protecting this physical asset is imperative. Cyber security, privacy, and dependability (SPD) are also important, as the railway operation relies on cyber-physical systems (CPS) systems. This work presents SPD-Safe—an administration framework for railway CPS, leveraging artificial intelligence for monitoring and managing the system in real-time. The network layer protections integrated provide the core security properties of confidentiality, integrity, and authentication, along with energy-aware secure routing and authorization. The effectiveness in mitigating attacks and the efficiency under normal operation are assessed through simulations with the average delay in real equipment being 0.2–0.6 s. SPD metrics are incorporated together with safety semantics for the application environment. Considering an intelligent transportation scenario, SPD-Safe is deployed on railway critical infrastructure, safeguarding one outdoor setting on the railway’s tracks and one in-carriage setting on a freight train that contains dangerous cargo. As demonstrated, SPD-Safe provides higher security and scalability, while enhancing safety response procedures. Nonetheless, emergence response operations require a seamless interoperation of the railway system with emergency authorities’ equipment (eg, drones). Therefore, a secure integration with external systems is considered as future work. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Monitoring-based certification of cloud service security",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-26148-5_44",
            "Abstract": "In this paper, we present a novel approach to cloud service security certification. This approach could be used to: (a) define and execute automatically certification models, which can continuously and incrementally acquire and analyse evidence regarding the provision of services on cloud infrastructures through continuous monitoring; (b) use this evidence to assess whether the provision is compliant with required security properties; and (c) generate and manage digital certificates confirming the compliance of services if the acquired evidence supports this. We also present the results of an initial experimental evaluation of our approach based on the MySQL server and RUBiS benchmark.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Proactive sla negotiation for service based systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5575470/",
            "Abstract": "In this paper we propose a framework for proactive SLA negotiation that integrates this process with dynamic service discovery and, hence, can provide integrated runtime support for both these key activities which are necessary in order to achieve the runtime operation of service based systems with minimised interruptions. More specifically, our framework discovers candidate constituent services for a composite service, establishes an agreed but not enforced SLA and a period during which this pre-agreement can be activated should this become necessary.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Requirements monitoring for service-based systems: Towards a framework based on event calculus",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1342769/",
            "Abstract": "This work proposes a framework for run-time monitoring of the compliance of systems composed of Web-services with requirements set for them. The framework assumes systems composed of Web-services which are coordinated by a service composition process expressed in BPEL4WS and uses event calculus to specify the requirements to be monitored. These requirements include behavioural properties of the system which are automatically extracted from the specification of its composition process in BPEL4WS and/or assumptions that system providers can specify in terms of events extracted from this specification. Requirements are checked using a variant of techniques for checking integrity constraints against temporal deductive databases.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "G. Traceability Approach for I* and UML Models",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/30699541/10.1.1.124.1309.pdf",
            "Abstract": "In this paper we propose an approach that can be used to generate traceability relations between organisational models specified in i* and software systems models represented in UML (in particular use case and class diagrams). Our approach proposes different types of traceability relationships between i* and UML models and uses traceability rules to generate the different types of traceability relations between them. The traceability rules and traceable models are represented in XML. This makes possible the use of our approach in settings where the models are created and managed autonomously. The approach is supported by a prototype tool that interprets the rules and generates traceability relations.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The serenity runtime monitoring framework",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-88775-3_13",
            "Abstract": "This chapter describes SERENITY’s approach to runtime monitoring and the framework that has been developed to support it. Runtime monitoring is required in SERENITY in order to check for violations of security and dependability properties which are necessary for the correct operation of the security and dependability solutions that are available from the SERENITY framework. This chapter discusses how such properties are specified and monitored. The chapter focuses on the activation and execution of monitoring activities using S&D Patterns and the actions that may be undertaken following the detection of property violations. The approach is demonstrated in reference to one of the industrial case studies of the SERENITY project.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Towards hybrid cloud service certification models",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6930559/",
            "Abstract": "In this paper, we introduce a hybrid approach for certifying security properties of cloud services that combines monitoring and testing data. The paper argues about the need for hybrid certification and examines some basic characteristics of hybrid certification models.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Mojj43d5GZwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introduction: The SERENITY vision",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-88775-3_1",
            "Abstract": "In this chapter we present an overview of the SERENITY approach. We describe the SERENITY model of secure and dependable applications and show how it addresses the challenge of developing, integrating and dynamically maintaining security and dependability mechanisms in open, dynamic, distributed and heterogeneous computing systems and in particular Ambient Intelligence scenarios. The chapter describes the basic concepts used in the approach and introduces the different processes supported by SERENITY, along with the tools provided.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:M05iB0D1s5AC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Analysing security requirements in cloud-based service level agreements",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2659651.2659735",
            "Abstract": "In cloud computing, measurable services such as packet loss and memory are quantized into different levels to provide different level of services to users. Initially, there will be a service level agreement (SLA) between users and service providers (SPs) and/or SPs and infrastructure providers (IPs). However, the most crucial service required by the users and SPs in cloud computing is security and privacy. Security parameters can be used to prevent attacks and to protect data and systems. In literature, there is no comprehensive solution which quantify all the security parameters associated with the cloud computing paradigm. In this paper, for the first time, we attempt to generalize and quantify the security parameters.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The THREAT-ARREST cyber-security training platform",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007%252F978-3-030-42051-2.pdf#page=212",
            "Abstract": "Cyber security is always a main concern for critical infrastructures and nation-wide safety and sustainability. Thus, advanced cyber ranges and security training is becoming imperative for the involved organizations. This paper presets a cyber security training platform, called THREAT-ARREST. The various platform modules can analyze an organization’s system, identify the most critical threats, and tailor a training program to its personnel needs. Then, different training programmes are created based on the trainee types (ie administrator, simple operator, etc.), providing several teaching procedures and accomplishing diverse learning goals. One of the main novelties of THREAT-ARREST is the modelling of these programmes along with the runtime monitoring, management, and evaluation operations. The platform is generic. Nevertheless, its applicability in a smart energy case study is detailed.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Ri6SYOTghG4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Biologically inspired near extinct system reconstruction",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6701644/",
            "Abstract": "Recovery software system operations from a state of extensive damage without human intervention is a challenging problem as it may need to be based on a different infrastructure from the one that the system was originally designed for and deployed on (i.e., computational and communication devices) and significant reorganization of system functionalities. In this paper, we introduce a bio-inspired approach for reconstructing nearly extinct complex software systems. Our approach is based on encoding a computational DNA (co-DNA) of a system and computational analogues of biological processes to enable the transmission of co-DNA over computational devices and, through it, the transformation of these devices into system cells that can realise chunks of the system functionality, and spread further its reconstruction process.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:bnK-pcrLprsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A service discovery framework for service centric systems",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1531261/",
            "Abstract": "An important aspect of service-centric systems (i.e. systems composed of services) is the ability to support service discovery at run-time in order to cope with unavailable or malfunctioning services. In this paper we present a framework that supports run-time service discovery. The central characteristic of this framework is the combination of components for monitoring the compliance of service-centric systems with requirements at run-time and components for discovering services at run-time. The framework uses the former components to detect violations of requirements at run-time and uses the specifications of the violated requirements to generate queries for discovering services that could substitute for malfunctioning services. It also uses queries derived from the process specification for service discovery. These queries incorporate both structural and behavioural aspects of the required services.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A reactive security framework for operational wind parks using service function chaining",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8024604/",
            "Abstract": "The innovative application of 5G core technologies, namely Software Defined Networking (SDN) and Network Function Virtualization (NFV), can help reduce capital and operational expenditures in industrial networks. Nevertheless, SDN expands the attack surface of the communication infrastructure, thus necessitating the introduction of additional security mechanisms. A wind park is a good example of an industrial application relying on a network with strict performance, security, and reliability requirements, and was chosen as a representative example of industrial systems. This work highlights the benefit of leveraging the flexibility of SDN/NFV-enabled networks to deploy enhanced, reactive security mechanisms for the protection of the industrial network, via the use of Service Function Chaining. Moreover, a proof of concept implementation of the reactive security framework for an industrial-grade wind park …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An architecture for certification-aware service discovery",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6049020/",
            "Abstract": "Service-orientation is an emerging paradigm for building complex systems based on loosely coupled components, deployed and consumed over the network. Despite the original intent of the paradigm, its current instantiations are limited to a single trust domain (e.g., a single organization) One of the main reasons for this is the trust gap that normally arises when software services, offered by previously unknown providers, are to be selected at run-time, without any human intervention. The idea of machine-readable security certificates (called asserts) paves the way to automated reasoning about security properties of services. Similarly to current security certification schemes, the assessment of the security properties of a service is delegated to an independent third party (certification authority), who issues a corresponding assert, bound to the service. Building on the assert concept, this paper describes our proposal …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architectural patterns for secure IoT orchestrations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8766425/",
            "Abstract": "The vast amount of connected devices on the Internet of Things (IoT) creates an enormous potential for new applications, by leveraging synergies arising through the convergence of consumer, business and industrial Internet, and creating open, global networks connecting people, data, and “things”. In this context, the SEMIoTICS project aims to develop a pattern-driven framework, built upon existing IoT platforms, to enable and guarantee secure and dependable actuation and semi-autonomic behaviour in IoT/Industrial IoT applications. To achieve this, patterns are used to encode proven dependencies between the security, privacy, dependability and interoperability (SPDI) properties of individual smart objects and corresponding properties of orchestrations (composition) involving them. This paper sketches this approach followed by SEMIoTICS, whereby the SPDI patterns are used to generate IoT orchestrations …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:PVjk1bu6vJQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "UML: An evaluation of the visual syntax of the language",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/926344/",
            "Abstract": "Examination of the UML indicates weaknesses in its graphic syntax which undermine its structure as a visual language. Although the UML Notation claims to provide a \"canonical notation\", there are insufficient rules governing the graphic constructs used to produce the essential 'signifiers' of this visual language and to define their permissible combinations. The nature and composition of the graphical elements actually shown is a fundamental consideration, separate from the underlying constructs that they may signify. A much earlier formulation for notational systems, that provided by Nelson Goodman, clarifies the issues involved and makes it possible to set basic tests for a notational scheme, such as the UML, which require syntactic disjointness and differentiability. Application of these tests (plus others) to graphical primitives, simple characters and diagrams shows a variety of failures that lead to a fundamental …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Taming the cloud: safety, certification and compliance for software services",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31875-7_2",
            "Abstract": "The maturity of IT processes, such as software development, can be and is often certified. Current trends in the IT industry suggest that software systems in the future will be very different from their counterparts today, with an increasing adoption of the Service-Oriented Architecture (SOA) design pattern and the deployment of Software-as-a-Service (SaaS) on Cloud infrastructures. In this talk we discuss some issues surrounding engineering Software Services for Cloud infrastructures and highlight the need for enhanced control, service-level agreement and compliance mechanisms for Software Services. Cloud Infrastructures and Service Mash-ups.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:UxriW0iASnsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A service discovery framework based on linear composition",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4278701/",
            "Abstract": "Service discovery has been recognised as an important aspect of service oriented computing. This is even more the case when developing service centric systems in which software systems are constructed based on the identification and composition of Web services that together can fulfil the functionality of the system being developed. In this paper we present a framework that supports the discovery of services that can provide the functionality and satisfy the properties and constraints of service-based systems during their design phase. Our framework makes use of linear composition of service operations in which more than one Web service operations can be combined to fulfil a functionality of the system when no single operation can be identified. The discovery process is based on a graph-matching algorithm. A prototype tool has been developed to demonstrate and evaluate the framework.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Patterns for the design of secure and dependable software defined networks",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128616302080",
            "Abstract": "In an interconnected world, cyber and physical networks face a number of challenges that need to be resolved. These challenges are mainly due to the nature and complexity of interconnected systems and networks and their ability to support heterogeneous physical and cyber components simultaneously. The construction of complex networks preserving Security and Dependability (S&D) properties is necessary to avoid system vulnerabilities, which may occur in all the different layers of Software Defined Networking (SDN) architectures. In this paper, we present a model based approach to support the design of secure and dependable SDN. This approach is based on executable patterns for designing networks able to guarantee S&D properties and can be used in SDN networks. The design patterns express conditions that can guarantee specific S&D properties and can be used to design networks that have these …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:evX43VCCuoAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Query Language for Service Discovery.",
            "Publication year": 2009,
            "Publication url": "https://www.scitepress.org/Papers/2009/22604/22604.pdf",
            "Abstract": "To support the discovery of services during development and execution time of service-based systems, it is necessary to have ways of expressing the characteristics of the services to be discovered and the applications that will use them. In this paper, we present SerDiQueL, an XML-based query language that allows for the description of service discovery queries expressing structural, behavioural, quality, and contextual characteristics of services to be discovered. The language supports the identification of services during both development and execution of service-based systems and is supported by prototyped query processors performing similarity analysis between services and queries.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finding secure compositions of software services: Towards a pattern based approach",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6208741/",
            "Abstract": "In service based systems, there is often a need to replace services at runtime as they become either unavailable or they no longer meet required quality or security properties. In such cases, it is often necessary to build compositions of services that can replace a problematic service because no single service with a sufficient match to it can be located. In this paper, we present an approach for building compositions of services that can preserve required security properties. Our approach is based on the use of secure composition patterns which are applied in connection with basic discovery mechanisms to build secure service compositions.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring Data Integrity in Big Data Analytics Services",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8457900/",
            "Abstract": "Enabled by advances in Cloud technologies, Big Data Analytics Services (BDAS) can improve many processes and identify extra information from previously untapped data sources. As our experience with BDAS and its benefits grows and technology for obtaining even more data improves, BDAS becomes ever more important for many different domains and for our daily lives. Most efforts in improving BDAS technologies have focused on scaling and efficiency issues. However, an equally important property is that of security, especially as we increasingly use public Cloud infrastructures instead of private ones. In this paper we present our approach for strengthening BDAS security by modifying the popular Spark infrastructure so as to monitor at run-time the integrity of data manipulated. In this way, we can ensure that the results obtained by the complex and resource-intensive computations performed on the Cloud …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:HbR8gkJAVGIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CYRA: A Model-Driven CYber Range Assurance Platform",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1135174",
            "Abstract": "Digital technologies are facilitating our daily activities, and thus leading to the social transformation with the upcoming 5G communications and the Internet of Things. However, mainstream and sophisticated attacks are remaining a threat, both for individuals and organisations. Cyber Range emerges as a promising solution to effectively train people in cybersecurity aspects. A Training Programme is considered adequate only if it can adapt to the scope of the attacks they cover and if the trainees apply the learning material to the operational system. Therefore, this study introduces the model-driven CYber Range Assurance platform (CYRA). The solution allows a trainee to be trained for known and new cyber-attacks by adapting to the continuously evolving threat landscape and examines if the trainees transfer the acquired knowledge to the working environment. Furthermore, this paper presents a use case on an operational backend ICT system, showing how the CYRA platform was utilised to increase the security posture of the organisation. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:fFSKOagxvKUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Application of big data to support evidence-based public health policy decision-making for hearing",
            "Publication year": 2020,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/pmc7676484/",
            "Abstract": "Ideally, public health policies are formulated from scientific data; however, policy-specific data are often unavailable. Big data can generate ecologically-valid, high-quality scientific evidence, and therefore has the potential to change how public health policies are formulated. Here, we discuss the use of big data for developing evidence-based hearing health policies, using data collected and analyzed with a research prototype of a data repository known as EVOTION (EVidence-based management of hearing impairments: public health pOlicy-making based on fusing big data analytics and simulaTION), to illustrate our points. Data in the repository consist of audiometric clinical data, prospective real-world data collected from hearing aids and an app, and responses to questionnaires collected for research purposes. To date, we have used the platform and a synthetic dataset to model the estimated risk of noise …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:anf4URPfarAC",
            "Publisher": "Wolters Kluwer Health"
        },
        {
            "Title": "A framework for architecture-driven service discovery",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1138486.1138501",
            "Abstract": "Service discovery has been recognised as an important aspect in the development of service centric systems, ie software systems that are constructed based on the composition of web services. In order to develop service centric systems it is necessary to identify web services that can be combined to fulfil the functionality and quality criteria of the system being developed. In this paper we present a framework to support architecture-driven service discovery-that is the discovery of services that can provide the functionalities and satisfy properties and constraints of systems as specified during the design phase of the development lifecycle. Our framework assumes an iterative design process and allows for the (re-) formulation of the design models of service-centric systems based on the discovered services. A prototype tool has been developed and includes two main components: a UML 2.0 integration module, which …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic set-up of monitoring infrastructures for service based systems",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1774088.1774591",
            "Abstract": "Service based systems are intrinsically dynamic as the services deployed by them can be replaced at runtime. When this happens, the Service Level Agreements (SLAs) that regulate the provision of services may also need to change. Following such changes, the monitoring infrastructure that is used to monitor SLAs may also need to be modified to ensure the continuous provision of the necessary runtime checks. This paper presents a framework that supports the dynamic assessment of the monitorability of SLAs terms and the dynamic setup of an appropriate infrastructure for monitoring them following such changes. The monitorability checks are based on comparisons between the SLA terms for specific services and descriptions of the monitoring capabilities of these services which are expressed in languages introduced in the paper. The paper presents a prototype implementation of the framework and the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A certification framework for cloud security properties: the monitoring path",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-17199-9_3",
            "Abstract": "In this paper we describe the structure and functionality of a certification integrated framework aimed to support the certification of security properties of a Cloud infrastructure (IaaS), a platform (PaaS), or the software layer (SaaS). Such framework will bring service users, service providers and cloud suppliers to work together with certification authorities in order to ensure security properties and certificates validity in the continuously evolving cloud environment. For this purpose, the framework relies on multiple types of evidence gathering with respect to security, e.g., testing services, monitoring agents or trusted computing proofs. In this paper we will focus only on the monitoring case and will illustrate its use. Yet, this framework is designed to be able to follow models for hybrid, incremental and multi-layer security certification since cloud security has to build upon the entire cloud stack.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Proceedings of ACM ESEC/FSE International Workshop on Intelligent Technologies for Software Engineering WITSE03",
            "Publication year": 2003,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/4061/1/",
            "Abstract": "Dr. George Spanoudakis is a senior lecturer at the Department of Computing at City University, London. He holds a BSc (Honours) degree in Informatics, a MSc degree in Artificial Intelligence and a PhD degree in Computer Science. He has been a visiting associate professor at the Department of Computer Science at the University of Crete, and a visiting lecturer at the Department of Information Systems at the London School of Economics. He has served in the program committees of several international conferences and workshops on software engineering, having chaired workshops and conference sessions. Dr. Spanoudakis has acted as a reviewer for international scientific journals and has served as the editor of Requirenautics Quarterly, the Newsletter of the Requirements Engineering Specialist Group of the British Computer Society. He has published extensively in the area of software engineering. His current research interests include requirements specification and analysis, multi-perspective software modelling, management of inconsistencies in software documentation, and software traceability and measurement. For more information see: http://www. soi. city. ac. uk/~ gespan.Dr. Andrea Zisman is a lecturer at the Department of Computing at City University, London. She holds a PhD in Computer Science, a MSc in Applied Mathematics to Computer Science (Magna cum louver), and a B. Sc. in Computer Science (Honours). Previously, she worked as a research fellow at University College London, and as a software system consultant, developer and analyst. She has been a visiting researcher at AT&T Labs Research. Dr. Zisman has …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "QoS management specification support for multimedia middleware",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121203000165",
            "Abstract": "Middleware technologies are now widely used in order to provide support for the interaction of systems relying on different hardware and operating systems. At present middleware platforms, however, do not provide enough support for both the configuration and reconfiguration of quality of service (QoS) management aspects of real-time applications such as distributed multimedia systems. That is, current middleware only provides support for the low-level specification of QoS properties. This paper presents an architecture description language (ADL) called Xelha for the high-level specification of QoS management in multimedia middleware whereas lower-level aspects can be tuned by using an aspect-oriented suite of languages referred to as resource configuration description language (RCDL). Tool support is also provided for the interpretation of the Xelha and RCDL languages.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Extensions to pattern formats for cyber physical systems",
            "Publication year": 2014,
            "Publication url": "https://hillside.net/plop/2014/papers/proceedings/papers/14-mana.pdf",
            "Abstract": "Cyber Physical Systems (CPSs) are becoming not only increasingly complex but also increasingly important. Traditionally, CPSs were self-contained monolithic systems operating in a well-defined environment. CPSs today have evolved to large-scale systems including multiple interacting components. Due to the inherent complexity of the physical environments where CPSs operate and the ever changing operational and context conditions of these environments, CPSs need to be able to adapt in a semi-or fully autonomic manner. At the same time, in the course of adapting themselves, they need to satisfy key quality, security and privacy (QSP) requirements and be resilient to threats even if those were unknown at the time the CPS was designed. Engineering CPSs with such capabilities is a challenging problem that requires expert knowledge. Our approach to addressing this problem is based on the use of QSP-preserving patterns, ie, patterns that encode proven design and engineering solutions providing particular QSP properties. We argue that existing pattern formats miss some essential features of CPSs. As a step towards the realization of approach, in this paper we present a new pattern format that enables the representation of most important characteristics of QSP preserving patterns for CPS. Our format provides an initial basis for defining a full pattern language for engineering QSP preserving CPS.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Software traceability: a roadmap. handbook of software engineering and knowledge engineering",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=11093075451373465847&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:edDO8Oi4QzsC",
            "Publisher": "World Scientific Publishing Co."
        },
        {
            "Title": "A framework for dynamic service discovery",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4639319/",
            "Abstract": "Service discovery has been recognised as an important activity for service-based systems. In this paper we describe a framework for dynamic service discovery that supports the identification of service during the execution time of service-based systems. In the framework, services are identified based on structural, behavioural, quality, and contextual characteristics of a system represented in query languages. The framework supports both pull and push modes of query execution. In the approach, a service is identified based on the computation of distances between a query and a candidate service. A prototype tool has been implemented in order to illustrate and evaluate the framework. The paper also describes the results of a set of experiments that we have conducted to evaluate the work.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Secure Semantic Interoperability for IoT Applications with Linked Data",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9013147/",
            "Abstract": "Interoperability stands for the capacity of a system to interact with the units of another entity. Although it is quite easy to accomplish this within the products of the same brand, it is not facile to provide compatibility for the whole spectrum of the Internet-of-Things (IoT) and the Linked Data (LD) world. Currently, the different applications and devices operate in their own cloud/platform, without supporting sufficient interaction with different vendor-products. As it concerns the meaning of data, which is the main focus of this paper, semantics can settle commonly agreed information models and ontologies for the used terms. However, as there are several ontologies for describing each distinct 'Thing', we need Semantic Mediators (SMs) in order to perform common data mapping across the various utilized formats (i.e. XML or JSON) and ontology alignment (e.g. resolve conflicts). Our goal is to enable end-to-end vertical …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:9pM33mqn1YgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SMaRT: a workbench for reporting the monitorability of services from SLAs",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1985394.1985400",
            "Abstract": "Service Level Agreements (SLAs) for Software Services aim to clearly identify the service level commitments established between service requesters and providers. A dynamic configuration for the monitoring of these SLAs provides the opportunity for service monitor providers to offer and release monitoring infrastructures for different types of services. Whilst there has been work on automating this monitor matching and configuration, additional support may be needed in the negotiation and provision of monitors for which the current monitoring infrastructure does not provide suitable SLA term monitors. In this paper we describe an approach to effectively report and assist service monitoring support groups in managing this provision. The approach described is illustrated with mechanical support in the form of a SMaRT Workbench Eclipse IDE plug-in for reporting on the monitorability of SLAs for service monitoring …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Validation of service level agreements using probabilistic model checking",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8034979/",
            "Abstract": "With the fast growth of Information Technology (IT), organisations rely mostly on web services, cloud services and recently on Big Data Analytics services (BDA services), in order to support their business services. To securely use these services, service clients sign a Service Level Agreement (SLA) with service providers, regarding a particular service provision. Typically, SLAs define the properties that need to be preserved during the provision of a service (e.g., quality of service properties) and actions that will be applied if the service provision violates the defined properties (e.g., penalties or re-negotiation). Whilst significant research has focused on monitoring SLAs during the provision of services, the exploration and validation of the potential consequences of SLAs for the involved parties prior to putting them in operation is not addressed by existing research. In this paper, we present an approach to SLA …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assessing the genuineness of events in runtime monitoring of cyber systems",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404813000564",
            "Abstract": "Monitoring security properties of cyber systems at runtime is necessary if the preservation of such properties cannot be guaranteed by formal analysis of their specification. It is also necessary if the runtime interactions between their components that are distributed over different types of local and wide area networks cannot be fully analyzed before putting the systems in operation. The effectiveness of runtime monitoring depends on the trustworthiness of the runtime system events, which are analyzed by the monitor. In this paper, we describe an approach for assessing the trustworthiness of such events. Our approach is based on the generation of possible explanations of runtime events based on a diagnostic model of the system under surveillance using abductive reasoning, and the confirmation of the validity of such explanations and the runtime events using belief based reasoning. The assessment process that …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:LPZeul_q3PIC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Fully synthetic longitudinal real-world data from hearing aid wearers for public health policy modeling",
            "Publication year": 2019,
            "Publication url": "https://www.frontiersin.org/articles/10.3389/fnins.2019.00850/full",
            "Abstract": "Approximately one-third of people over 65 years of age, and 5% of the world’s population, is affected by hearing loss (HL)(World Health Organization, 2017). Disabling HL is associated with early cognitive decline in adults (Olusanya et al., 2014), and when unaddressed, HL restricts social integration and reduces employment and educational opportunities, hampers emotional well-being and, thus, poses an economic challenge at both the individual and national level (Wilson et al., 2017). Moreover, more and more individuals suffer from HL, which is primarily due to increases in everyday noise exposure and an increase of the aging population (World Health Organization, 2017). Despite the fact that age-related HL is the third leading cause of years lived with disability (Vos et al., 2017), the population of individuals with hearing loss is underserved because few public health policies focus on prevention, intervention, and rehabilitation for age-related HL (Reavis et al., 2016). This inadequate focus has been attributed to a lack of evidence supporting policies that actively promote hearing healthcare (Moyer, 2012; Barker et al., 2016). However, this specific issue is targeted in the EU-funded H2020 project EVOTION (www. h2020evotion. eu), which collects a large volume of heterogenous data from almost 1,000 hearing aid (HA) users with varying degrees of hearing loss to support the development of evidence-based policy making within the hearing healthcare field (Spanoudakis et al., 2017; Gutenberg et al., 2018). Data are being collected from five sources:(i) hearing aids,(ii) a smartphone app,(iii) a biosensor,(iv) audiology clinics, and (v) electronic …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:86PQX7AUzd4C",
            "Publisher": "Frontiers"
        },
        {
            "Title": "Reconciliation of object interaction models",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-0719-4_7",
            "Abstract": "This paper presents Reconciliation+, a tool-supported method which identifies overlaps between models of different object interactions expressed as UML sequence and/or collaboration diagrams, checks whether the overlapping messages of these models satisfy specific consistency rules, and guides developers in handling any inconsistencies detected.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "of Deliverable",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/30699484/D2.1.pdf",
            "Abstract": "This report is part of the deliverable D02. 1 and describes a query language (A-SerDiQueL) that we have developed in ASSERT4SOA to support dynamic service discovery based on a set of discovery criteria that relate not only to structural, behavioural and quality properties of the sought services but also criteria regarding security properties of services and ASSERTs (ie certificates) that may have been issued to assure such properties. The report describes also the design and implementation of a discovery engine that we have developed to support this query language and give examples of using it. The initial prototype implementation of the discovery engine has also been released as part of deliverable D02. 1, to enable a testing of the features of the engine. The final implementation of the engine will be delivered as part of the integrated ASSERT4SOA framework (ie, in deliverables D06. 2 and D06. 3).",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Detection of security and dependability threats: A belief based reasoning approach",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5210995/",
            "Abstract": "Monitoring the preservation of security and dependability (S&D) properties during the operation of systems at runtime is an important verification measure that can increase system resilience. However it does not always provide sufficient scope for taking control actions against violations as it only detects problems after they occur. In this paper, we describe a proactive monitoring approach that detects potential violations of S&D properties, called ldquothreatsrdquo, and discuss the results of an initial evaluation of it.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A pattern-driven framework for monitoring security and dependability",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74409-2_23",
            "Abstract": "In this paper we describe a framework that supports the dynamic configuration, adaptation and monitoring of systems that need to guarantee specific security and dependability (S&D) properties whilst operating in distributed settings. The framework is based on patterns providing abstract specifications of implementation solutions that can be used by systems in order to achieve specific S&D properties. The focus herein will be on the monitoring aspects of the framework which allow it to adapt to violations of the S&D requirements and changes to the current context.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multiparametric data analysis for diagnostic decision support in balance disorders",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7455928/",
            "Abstract": "In this work we present a framework for the analysis and mining of multiparametric data related to balance disorders. The overall concept is to define the schema of the analysis that provides optimal results for diagnostic decision support in balance disorders. The work is part of the integrated EMBalance platform which targets the management of patients with balance disorders, from the diagnosis to treatment and evolution of the disease. The obtained results in four different balance disorders range from 76.4% to 92.1%.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Identifying test requirements by analyzing SLA guarantee terms",
            "Publication year": 2012,
            "Publication url": "https://digibuo.uniovi.es/dspace/handle/10651/30851",
            "Abstract": "Identifying test requirements by analyzing SLA guarantee terms RUO Home Repositorio \nInstitucional de la Universidad de Oviedo View Item RUO Home Producción Bibliográfica \nde UniOvi: RECOPILA Ponencias, Discursos y Conferencias View Item RUO Home \nProducción Bibliográfica de UniOvi: RECOPILA Ponencias, Discursos y Conferencias View \nItem Toggle navigation español English Search RUO This Collection Browse All of RUOCommunities \nand CollectionsBy Issue DateAuthorsTitlesSubjectsxmlui.ArtifactBrowser.Navigation.browse_issnAuthor \nprofilesThis CollectionBy Issue DateAuthorsTitlesSubjectsxmlui.ArtifactBrowser.Navigation.browse_issn \nMy Account LoginRegister Statistics View Usage Statistics AÑADIDO RECIENTEMENTE \nNovedades Repositorio Cómo publicar Recursos FAQs Identifying test requirements by \nanalyzing SLA guarantee terms Author: Palacios Gutiérrez, Marcos Uniovi authority …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modern aspects of cyber-security training and continuous adaptation of Programmes to trainees",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/800120",
            "Abstract": "Nowadays, more-and-more cyber-security training is emerging as an essential process for the lifelong personnel education in organizations, especially for those which operate critical infrastructures. This is due to security breaches on popular services that become publicly known and raise people’s security awareness. Except from large organizations, small-to-medium enterprises and individuals need to keep their knowledge on the related topics up-to-date as a means to protect their business operation or to obtain professional skills. Therefore, the potential target-group may range from simple users, who require basic knowledge on the current threat landscape and how to operate the related defense mechanisms, to security experts, who require hands-on experience in responding to security incidents. This high diversity makes training and certification quite a challenging task. This study combines pedagogical practices and cyber-security modelling in an attempt to support dynamically adaptive training procedures. The training programme is initially tailored to the trainee’s needs, promoting the continuous adaptation to his/her performance afterwards. As the trainee accomplishes the basic evaluation tasks, the assessment starts involving more advanced features that demand a higher level of understanding. The overall method is integrated in a modern cyber-ranges platform, and a pilot training programme for smart shipping employees is presented. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Teaching Users New IoT Tricks: A Model-driven Cyber Range for IoT Security Training",
            "Publication year": 2021,
            "Publication url": "https://scholar.google.com/scholar?cluster=7707030666607699572&hl=en&oi=scholarr",
            "Abstract": "As IoT ecosystems become mainstream, malicious actors routinely launch impactful attacks that affect both organizations and individuals-eg, see the Mirai IoT botnet and its variants, and the intensification of these attacks in the COVID-19 era-ultimately corroding our trust in IoT applications and services.While a barrier in tackling these issues is the existence of heterogeneous IoT applications and devices with inherent security flaws [1][2], the situation is further exacerbated by the lack of cybersecurity awareness and training. Users are typically not informed of the relevant risks and how to minimize them, nor are they trained to promptly identify and react to cyber-attacks (eg, IoT botnets [3], and COVID-19-focused ones [4])). Instead, users act as enablers for the various threat actors to deploy attacks successfully, and this is true both for enterprise [5](eg, Industrial IoT) as well as consumer [6](eg, smart home) environments.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Review of the state of the art (in Security and Dependability Monitoring and Recovery)",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.154.6484",
            "Abstract": "CiteSeerX — Review of the state of the art (in Security and Dependability Monitoring and \nRecovery) Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo \nDocuments: Advanced Search Include Citations Authors: Advanced Search Include Citations \nTables: DMCA Review of the state of the art (in Security and Dependability Monitoring and \nRecovery) (2006) Cached Download as a PDF Download Links [www.soi.city.ac.uk] Save to List \nAdd to Collection Correct Errors Monitor Changes by G. Spanoudakis , C. Kloukinas , T. Tsigritis \n, K. Androutsopoulos , C. Ballas , Domenico Presenza Citations: 1 - 0 self Summary Citations \nActive Bibliography Co-citation Clustered Documents Version History Share Facebook \nTwitter Reddit Bibsonomy OpenURL Abstract Keyphrases dependability monitoring Powered \nby: Apache Solr About CiteSeerX Submit and Index Documents Privacy Policy Help Data -…",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Big Data Assurance Evaluation: An SLA-Based Approach",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8456439/",
            "Abstract": "The Big Data community has started noticing that there is the need to complete Big Data platforms with assurance techniques proving the correct behavior of Big Data analytics and management. In this paper, we propose a Big Data assurance solution based on Service-Level Agreements (SLAs), focusing on a platform providing Model-based Big Data Analytics-as-a-Service (MBDAaaS).",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:xtoqd-5pKcoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generating secure service compositions",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-25414-2_6",
            "Abstract": "Ensuring that the compositions of services that constitute service-based systems satisfy given security properties is a key prerequisite for the adoption of the service oriented computing paradigm. In this paper, we address this issue using a novel approach that guarantees service composition security by virtue of the generation of compositions. Our approach generates service compositions that are guaranteed to satisfy security properties based on secure service orchestration (SESO) patterns. These patterns express primitive (e.g., sequential, parallel) service orchestrations, which are proven to have certain global security properties if the individual services participating in them have themselves other security properties. The paper shows how SESO patterns can be constructed and gives examples of proofs for such patterns. It also presents the process of using SESO patterns to generate secure service …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Coverage-based testing for service level agreements",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6746184/",
            "Abstract": "Service level agreements (SLAs) are typically used to specify rules regarding the consumption of services that are agreed between the providers of the service-based applications (SBAs) and their consumers. An SLA includes a list of terms that contain the guarantees that must be fulfilled during the provisioning and consumption of the services. Since the violation of such guarantees may lead to the application of potential penalties, it is important to assure that the SBA behaves as expected. In this paper, we propose a proactive approach to test SLA-aware SBAs by means of identifying test requirements, which represent situations that are relevant to be tested. To address this issue, we define a four-valued logic that allows evaluating both the individual guarantee terms and their logical relationships. Grounded in this logic, we devise a test criterion based on the modified condition decision coverage (MCDC) in order …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proactive runtime service discovery",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4578469/",
            "Abstract": "In this paper we describe a framework that supports runtime service discovery in both pull and push modes. Our framework supports service discovery based on structural and behavioural models of services and applications, as well as quality and contextual constraints. In the approach, we use a proactive push mechanism in which services are identified in parallel to the execution of the system based on subscriptions of services and queries. A prototype tool has been implemented in order to illustrate and evaluate the framework.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supporting the reconciliation of models of object behaviour",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1007/s10270-004-0054-1",
            "Abstract": "This paper presents Reconciliation+, a method which identifies overlaps between models of software systems behaviour expressed as UML object interaction diagrams (i.e., sequence and/or collaboration diagrams), checks whether the overlapping elements of these models satisfy specific consistency rules and, in cases where they violate these rules, guides software designers in handling the detected inconsistencies. The method detects overlaps between object interaction diagrams by using a probabilistic message matching algorithm that has been developed for this purpose. The guidance to software designers on when to check for inconsistencies and how to deal with them is delivered by enacting a built-in process model that specifies the consistency rules that can be checked against overlapping models and different ways of handling violations of these rules. Reconciliation+ is supported by a toolkit …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Using web services to support legacy clinical systems",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.450.2864&rep=rep1&type=pdf",
            "Abstract": "Over the last years web service technologies have been proposed to support interoperability of distributed systems and applications. On the other hand, one of the main tasks of the e-Government Interoperability Framework is to adopt the Internet and World Wide Web specifications for all government systems, including NHS clinical systems. In this paper we present a web service approach to support data access of legacy laboratory information system in the Oxford John Radcliffe Hospital. This system contains a MSM database in which Internet access is enabled through Web Link. Our approach relies on using web services technology as an intermediary layer between the database and the client. We have developed two web services applications: web service server and web service consumer.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Health Informatics Committee of the British Computer Society; 1999"
        },
        {
            "Title": "A pattern-based approach for designing reliable cyber-physical systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7417794/",
            "Abstract": "Cyber-Physical Systems (CPS) appear to be of paramount importance due to their increasing use on critical infrastructure. New challenges have occurred because of the nature and the complexity of such systems in supporting heterogeneous physical and cyber components simultaneously. Failures or attacks on system components decrease system reliability creating severe consequences to CPS and the attached applications. The construction of complex CPS with respect to security and dependability (S&D) properties is necessary to avoid system vulnerabilities at design level. Design patterns are solutions for reusable designs and interactions of objects. In this work we present a pattern-based language for designing CPS able to guarantee S&D properties. The first set of S&D patterns includes the Reliability Component Composition (RCC) Patterns for designing reliable CPS. RCC patterns are encoded in …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:Fu2w8maKXqMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring security and dependability in mobile p2p systems",
            "Publication year": 2008,
            "Publication url": "http://e-centre.mdx.ac.uk/staffpages/kellyandroutsopoulos/Publications/icimp08.pdf",
            "Abstract": "Ensuring the dependability and security of mobile P2P systems is an intricate task due to the autonomous and decentralised nature of such systems. In this paper, we present a framework that provides increased support for security and dependability properties by monitoring the compliance of the operation of mobile P2P applications with them at runtime. The framework performs monitoring driven by policies specified for the individual peers in a P2P application and decouples the monitoring process from the operation of the application, to increase its resilience and avoid adverse effects on its performance.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Associations Between Hearing Performance and Physiological Measures-An Overview and Outlook.",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=xHc2DwAAQBAJ&oi=fnd&pg=PA100&dq=info:igTlvFN1sPYJ:scholar.google.com&ots=zbq6_LGlz6&sig=6hqwRFKYsl7IOGRLPHXrULfVLyg",
            "Abstract": "The current paper summarises the research investigating associations between physiological data and hearing performance. An overview of state-of-theart research and literature is given as well as promising directions for associations between physiological data and data regarding hearing loss and hearing performance. The physiological parameters included in this paper are: electrodermal activity, heart rate variability, blood pressure, blood oxygenation and respiratory rate. Furthermore, the environmental and behavioural measurements of physical activity and body mass index, alcohol consumption and smoking have been included. So far, only electrodermal activity and heart rate variability are physiological signals simultaneously associated with hearing loss or hearing performance. Initial findings suggest blood pressure and respiratory rate to be the most promising physiological measures that relate to hearing loss and hearing performance.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 2 Certification models",
            "Publication year": 2013,
            "Publication url": "https://cordis.europa.eu/docs/projects/cnect/0/318580/080/deliverables/001-D22Certificationmodelsv1.pdf",
            "Abstract": "The freedom of choice given by dynamic software provisioning on the cloud needs to be reconciled with the apparently conflicting requirement of making sure that software systems have the appropriate assurance levels for the intended purpose. In the case of security, influential guidelines like the US-‐NIST Special Publication (SP) 800-‐37s mandate users to check at the time of use that software systems hold the desired set of security properties. This requirement is very difficult to satisfy in a cloud-‐based service marketplace, and in general with any dynamic model of software provisioning.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:HtS1dXgVpQUC",
            "Publisher": "CUMULUS Project, Tech. Rep"
        },
        {
            "Title": "Advanced security service certificate for soa: Certified services go digital",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-8348-9788-6_15",
            "Abstract": "Service-oriented architectures (SOA) constitute a major architectural style for large-scale infrastructures and applications built from loosely-coupled services and subject to dynamic configuration, operation and evolution. They are the structuring principle of a multitude of applications and the enabling technology for recent software paradigms like Mashup or SaaS.Assessing the trustworthiness of such complex and continuously evolving systems is a challenging task since a) methodologies – mainly based on certification processes – developed for assessing conventional static systems can hardly handle the dynamicity and variety of SOA based systems, b) few artifacts can be used to support and automate the assessment of the trustworthiness of a stand-alone service, and no means exist to assess the trustworthiness of composite applications, c) there is no mechanism to express and confront claimed …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:sSrBHYA8nusC",
            "Publisher": "Vieweg+ Teubner"
        },
        {
            "Title": "Towards IoT orchestrations with security, privacy, dependability and interoperability guarantees",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9013275/",
            "Abstract": "The advent of the Internet of Things opens a plethora of possibilities, provided the research and industry communities are able to overcome a number of challenges such as the dynamicity, scalability, heterogeneity and end-to-end security and privacy requirements of such environments. Motivated by these challenges, this paper proposes leveraging architectural patterns to provide, in an integrated manner, security, dependability, privacy, and interoperability guarantees, across horizontal and vertical compositional structures of IoT applications. The pattern language design process and definition is presented, along with an implementation enabling the automated, pattern- driven property verification and adaptation of IoT orchestrations.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:GtLg2Ama23sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Issue on Security and Dependability Assurance of Software Architectures",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=16915030809974444727&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:PoWvk5oyLR8C",
            "Publisher": "ELSEVIER SCIENCE BV"
        },
        {
            "Title": "Information Monitors: An Architecture Based on XML",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-0299-1_38",
            "Abstract": "In this paper we present an approach to allow monitoring of XML documents on the World Wide Web. We describe a distributed information monitoring architecture based on monitor rules. The architecture preserves the autonomy of the participating documents and allows evolution of the system by adding, removing and modifying XML documents. In order to illustrate the approach we present an example in the financial domain.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Security and Dependability for Ambient Intelligence",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=8BqZCPbnJ_YC&oi=fnd&pg=PA1&dq=info:_0RDSegcajkJ:scholar.google.com&ots=6LSIDJFxLq&sig=4jnSVLA0OJMYzfNVwDSR_Mw86eo",
            "Abstract": "Security and Dependability for Ambient Intelligence is the primary publication for the SERENITY approach which provides security and dependability (S&D) solutions for dynamic, highly distributed and heterogeneous systems. The term Ambient Intelligence identifies an ambitious vision for pushing technological developments, that will enable heterogeneous networked systems and devices with computing capabilities (cars, house applications, mobile phones etc.). The objective of SERENITY is to enhance the security and dependability of ambient intelligence systems by providing a framework supporting the automated integration, configuration, monitoring and adaptation of security and dependability mechanisms. Security and Dependability for Ambient Intelligence, an edited volume contributed by world leaders in this field, covers the foundations of ambient systems, the problems that their highly dynamic and heterogeneous nature poses to security and dependability and solutions. These solutions include the language that has developed for specifying S&D patterns. This volume is designed for researchers and practitioners focusing on the dynamic integration, deployment and verification of security solutions in highly distributed systems incorporating ambient intelligence features. This book is also suitable as a reference or secondary text book for advanced-level students in computer science or electrical engineering.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "The runtime monitoring framework of SERENITY",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-0-387-88775-3.pdf#page=213",
            "Abstract": "This chapter describes SERENITY’s approach to runtime monitoring and the framework that has been developed to support it. Runtime monitoring is required in SERENITY in order to check for violations of security and dependability properties which are necessary for the correct operation of the security and dependability solutions that are available from the SERENITY framework. This chapter discusses how such properties are specified and monitored. The chapter focuses on the activation and execution of monitoring activities using S&D Patterns and the actions that may be undertaken following the detection of property violations. The approach is demonstrated in reference to one of the industrial case studies of the SERENITY project.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Advanced service monitoring configurations with SLA decomposition and selection",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1982185.1982519",
            "Abstract": "Service Level Agreements (SLAs) for Software Services aim to clearly identify the service level commitments established between service requesters and providers. The commitments that are agreed however can be expressed in complex notations through a combination of expressions that need to evaluated and monitored efficiently. The dynamic allocation of the responsibility for monitoring SLAs (and often different parts within them) to different monitoring components is necessary as both SLAs and the components available for monitoring them may change dynamically during the operation of a service based system. In this paper we discuss an approach to supporting this dynamic configuration, and in particular, how SLAs expressed in higher-level notations can be efficiently decomposed and appropriate monitoring components dynamically allocated for each part of the agreements. The approach is illustrated …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Behavior-aware, unified service discovery",
            "Publication year": 2007,
            "Publication url": "http://cgi.di.uoa.gr/~s3lab/papers/2007/soc@inside2007.pdf",
            "Abstract": "Composite services commonly expose the choreography of message exchanges realized by their constituent services through appropriate descriptions and interfaces. Such information is very useful in deciding whether a composite service fully meets the behavioral requirements of a specific application or not. However, expressing behavioral requirements towards a service is currently a challenging task, often requiring the use of complex semantic annotations and the employment of related supporting technologies. Moreover, choreography descriptions and interfaces may be expressed in various formats and they are published in various types of registries, repositories, or networks. These issues hinder the applicability and effectiveness of behavior-aware service discovery. To overcome the aforementioned obstacles and to promote interoperability at the service discovery level, we propose in this paper a novel, unified solution towards expressing and evaluating behavioral requirements towards services. In our approach, queries are conveniently created in a visual manner with the use of UML; they are translated into a generic XML-based query language, namely USQL; they are uniformly executed in a wide variety of target registries, repositories, and networks, by means of a powerful service search engine; and they can be matched against different types of service choreography descriptions.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "EMBalance data repository modeling and clinical application",
            "Publication year": 2016,
            "Publication url": "https://biblio.ugent.be/publication/8507404",
            "Abstract": "EMBalance data repository modeling and clinical application Universiteit Gent Add publications \nLists Sign in Academic Bibliography Search 200 years of publications by Ghent University \nresearchers. Search publications Advanced search Add to list 1.Search results 2.EMBalance \ndata repository modeling an... EMBalance data repository modeling and clinical application Nora \nKate MacDonald, Marios Prasinos, Themis P Exarchos, Dimitrios Kikidis, Laura Rammazzo, \nAmal Anwer, Leen Maes (UGent) , Laura Celis, Floris Wuyts (UGent) , Christoph Maurer, et \nal. (2016) In JOURNAL OF VESTIBULAR RESEARCH 26(1-2). p.194-194 Author Nora Kate \nMacDonald, Marios Prasinos, Themis P Exarchos, Dimitrios Kikidis, Laura Rammazzo, Amal \nAnwer, Leen Maes (UGent) , Laura Celis, Floris Wuyts (UGent) , Christoph Maurer, Marousa \nPavlou, Athanasios Bibas, George Spanoudakis, Linda Luxon and Doris Eva Bamiou , (…",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cyber Range Training Programme Specification Through Cyber Threat and Training Preparation Models",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-62433-0_2",
            "Abstract": "In light of the ever-increasing complexity and criticality of applications supported by ICT infrastructures, Cyber Ranges emerge as a promising solution to effectively train people within organisations on cyber-security aspects, thus providing an efficient mechanism to manage the associated risks. Motivated by this, the work presented herein introduces the model-driven approach of the THREAT-ARREST project for Cyber Range training, presenting in detail the Cyber Threat Training and Preparation (CTTP) models. These models, comprising sub-models catering for different aspects of the training, are used for specifying and generating the Training Programmes. As such, the paper also provides details on implementation aspects regarding the use of these models in the context of a usable cyber range training platform and two specific training scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:sNmaIFBj_lkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluation of Novel Approaches to Software Engineering",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Dip1O2bNi0gC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "UML-based service discovery tool",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4019609/",
            "Abstract": "The development of service centric systems has been recognised as an important approach for software system development. In this paper, we present a UML-based tool to identify services that can provide the functionality and satisfy properties and constraints of service centric systems specified during the design phase of the development of these systems and allows for the (re-) formulation of the design models based on the discovered services",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security track chairs welcome message",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6813990/",
            "Abstract": "Presents the introductory welcome message from the conference proceedings. May include the conference officers' congratulations to all involved with the conference event and publication of the proceedings record.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Property specification and static verification of UML models",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4529326/",
            "Abstract": "We present a static verification tool (SVT), a system that performs static verification on UML models composed of UML class and state machine diagrams. Additionally, the SVT allows the user to add extra behavior specification in the form of guards and effects by defining a small action language. UML models are checked against properties written in a special-purpose property language that allows the user to specify linear temporal logic formulas that explicitly reason about UML components. Thus, the SVT provides a strong foundation for the design of reliable systems and a step towards model-driven security.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A scheme for requirements monitoring of web service based systems",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/George-Spanoudakis/publication/239667930_A_Scheme_for_Requirements_Monitoring_of_Web_Service_Based_Systems/links/541a13bd0cf25ebee988870f/A-Scheme-for-Requirements-Monitoring-of-Web-Service-Based-Systems.pdf",
            "Abstract": "This technical report proposes a framework for monitoring the compliance of systems composed of web-services with requirements set for them. This framework assumes systems composed of web-services which are co-ordinated by a service composition process expressed in BPEL4WS and uses event calculus to specify the properties to be monitored. The monitorable properties may include behavioural properties of a system which are automatically extracted from the specification of its composition process in BPEL4WS and/or assumptions that system providers can specify in terms of events extracted from this specification.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "2021 IEEE International Conference on Smart Data Services",
            "Publication year": 2021,
            "Publication url": "https://www.computer.org/csdl/pds/api/csdl/proceedings/download-article/1yeQv21Mgnu/pdf",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:F9fV5C73w3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Plausible and adaptive requirement traceability structures",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/568760.568786",
            "Abstract": "This paper presents an extension of a traceability system which automates the generation of traceability relations between textual requirement artefacts and object models using heuristic traceability rules. These rules match syntactically related terms in the textual parts of the requirements artefacts with related elements in an object model (eg classes, attributes, operations) and create traceability relations of different types when a match is found. The extension described in this paper measures beliefs in:(1) the ability of specific traceability rules to generate correct traceability relations,(2) the satisfiability of traceability rules by particular types of artefacts, and (3) the correctness of individual traceability relations. It also provides a mechanism with well-founded semantics for revising these beliefs on the basis of partial (and even conflicting) assessments of the relations that these rules generate provided by different users.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Continuous certification of non-repudiation in cloud storage services",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7011347/",
            "Abstract": "This paper presents a certification model for Non-repudiation (NR) of cloud storage services. NR, i.e., The possession of proofs that certain exchanges have taken place amongst interacting parties, is a significant security property for cloud data storage services. Our model for certifying NR is based on continuous monitoring and has been defined and realised according to the CUMULUS approach. It also corresponds to certification of level 3 maturity in the reference certification framework of Cloud Security Alliance.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "MBotCS: A mobile botnet detection system based on machine learning",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-31811-0_17",
            "Abstract": "As the use of mobile devices spreads dramatically, hackers have started making use of mobile botnets to steal user information or perform other malicious attacks. To address this problem, in this paper we propose a mobile botnet detection system, called MBotCS. MBotCS can detect mobile device traffic indicative of the presence of a mobile botnet based on prior training using machine learning techniques. Our approach has been evaluated using real mobile device traffic captured from Android mobile devices, running normal apps and mobile botnets. In the evaluation, we investigated the use of 5 machine learning classifier algorithms and a group of machine learning box algorithms with different validation schemes. We have also evaluated the effect of our approach with respect to its effect on the overall performance and battery consumption of mobile devices.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Proactive and reactive runtime service discovery: A framework and its evaluation",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6375710/",
            "Abstract": "The identification of services during the execution of service-based applications to replace services in them that are no longer available and/or fail to satisfy certain requirements is an important issue. In this paper, we present a framework to support runtime service discovery. This framework can execute service discovery queries in pull and push mode. In pull mode, it executes queries when a need for finding a replacement service arises. In push mode, queries are subscribed to the framework to be executed proactively and, in parallel with the operation of the application, to identify adequate services that could be used if the need for replacing a service arises. Hence, the proactive (push) mode of query execution makes it more likely to avoid interruptions in the operation of service-based applications when a service in them needs to be replaced at runtime. In both modes of query execution, the identification of …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Predicting software service availability: Towards a runtime monitoring approach",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6009418/",
            "Abstract": "This paper presents a prediction model for software services availability measured by the mean-time-to-repair (MTTR) and mean-time-to-failure (MTTF) of a service. The prediction model is based on the experimental identification of probabilistic prediction for variables that affect MTTR/MTTF, based on monitoring service data collected at runtime.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cloud certification process validation using formal methods",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-69035-3_5",
            "Abstract": "The importance of cloud-based systems is increasing constantly as they become crucial for completing tasks in an effective and affordable manner. Yet, their use is affected by concerns about the security of the data and applications provisioned through them. Security certification provides a means of increasing confidence in such systems, by establishing that they fulfil certain security properties of interest. Certification processes involve security property assessments against specific threat models. These processes may be based on self-assessment, testing, inspection or runtime monitoring of security properties, and/or combinations of such methods (hybrid certification). One important question for all such processes is whether they actually deliver what they promise. This question is open at the moment and is the focus of our work. To address it, we have developed an approach that formalises certification …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A temporal abductive diagnostic process for runtime properties violations",
            "Publication year": 2008,
            "Publication url": "https://openaccess.city.ac.uk/13319/1/exact08.pdf",
            "Abstract": "The monitoring of properties of complex software systems can provide the core functionality for detecting violations of such properties. However, the violations detection cannot be always sufficient for the preservation of the properties. Except for the detection, the explanations of the occurrence of a violation could play significant role for the preservation task. In particular, diagnosis can indicate the cause (s) of a violation. Thus, diagnostic information is necessary for preserving the properties due to the support that can provide for deciding on the appropriate countermeasure against a violation. In this paper, we describe a process for diagnosing runtime violations of properties that we have developed as part of a runtime monitoring framework. The process is based on a combination of abductive, temporal and evidential reasoning over violations of process properties expressed in Event Calculus.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:k_IJM867U9cC",
            "Publisher": "CEUR-WS. org"
        },
        {
            "Title": "Web service trust: Towards a dynamic assessment framework",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5066452/",
            "Abstract": "Trust in software services is a key prerequisite for the success and wide adoption of services-oriented computing (SOC) in an open Internet world. However, trust is poorly assessed by existing methods and technologies, especially in dynamically composed and deployed SOC systems. In this paper, we discuss current methods for assessing trust in service-oriented computing and identify gaps of current platforms, in particular with regards to runtime trust assessment. To address these gaps, we propose a model of runtime trust assessment of software services and introduce a framework for realizing the model. A key characteristic of our approach is the support that it offers for customizable assessment of trust based on evidence collected during the operation of software services and its ability to combine this evidence with subjective assessments coming from service clients.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comprehensive monitoring of BPEL processes",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5481367/",
            "Abstract": "Service-oriented systems' distributed ownership has led to an increasing focus on runtime management solutions. Service-oriented systems can change greatly after deployment, hampering their quality and reliability. Their service bindings can change, and providers can modify the internals of their services. Monitoring is critical for these systems to keep track of behavior and discover whether anomalies have occurred. The Service-Centric Monitoring Language (SECMOL), a general monitoring specification language, clearly separates concerns between data collection, data computation, and data analysis, allowing for high flexibility and scalability. SECMOL also presents a concrete projection of the model onto three monitoring frameworks.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Data-informed Public Health Policy-Makers Platform",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/710238",
            "Abstract": "Hearing loss is a disease exhibiting a growing trend due to a number of factors, including but not limited to the mundane exposure to the noise and ever-increasing size of the older population. In the framework of a public health policymaking process, modeling of the hearing loss disease based on data is a key factor in alleviating the issues related to the disease and in issuing effective public health policies. First, the paper describes the steps of the data-driven policymaking process. Afterward, a scenario along with the part of the proposed platform responsible for supporting policymaking are presented. With the aim of demonstrating the capabilities and usability of the platform for the policy-makers, some initial results of preliminary analytics are presented in the framework of a policy-making process. Ultimately, the utility of the approach is validated throughout the results of the survey which was presented to the health system policy-makers involved in the policy development process in Croatia. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Pattern-driven security, privacy, dependability and interoperability management of IoT environments",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8858429/",
            "Abstract": "Achieving Security, Privacy, Dependability and Interoperability (SPDI) is of paramount importance for the ubiquitous deployment and impact maximization of Internet of Things (IoT) applications. Nevertheless, said requirements are not only difficult to achieve at system initialization, but also hard to prove and maintain at run-time. This paper highlights an approach to tackling the above challenges, through the definition of pattern language and a framework that can guarantee SPDI in IoT orchestrations. By integrating pattern reasoning engines at the various layers of the IoT infrastructure, and a machine-processable representation of said pattern through Drools rules, the proposed framework can provide ways to fulfill SPDI requirements at design time, and also provide the means to guarantee those SPDI properties and manage the orchestrations accordingly. Moreover, an application example of the framework is …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:bz8QjSJIRt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Significance of Inconsistencies in UML Models",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.127.2738&rep=rep1&type=pdf",
            "Abstract": "This paper presents a diagnostic framework for assessing the significance of inconsistencies in design models of software systems expressed in the Unified Modelling Language (UML). This assessment is based on significance criteria which software designers have to specify and associate with specific consistency rules. These criteria are defined in terms of characteristics of the model elements involved in the breach of a consistency rule. The framework establishes belief functions which measure the extent to which it may be believed from the model that an element has a characteristic, and uses them to derive beliefs for the significance criteria. Results of a set of preliminary experiments conducted to evaluate the framework are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A UML-based static verification framework for security",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00766-009-0091-y.pdf",
            "Abstract": "Secure software engineering is a new research area that has been proposed to address security issues during the development of software systems. This new area of research advocates that security characteristics should be considered from the early stages of the software development life cycle and should not be added as another layer in the system on an ad-hoc basis after the system is built. In this paper, we describe a UML-based Static Verification Framework (USVF) to support the design and verification of secure software systems in early stages of the software development life-cycle taking into consideration security and general requirements of the software system. USVF performs static verification on UML models consisting of UML class and state machine diagrams extended by an action language. We present an operational semantics of UML models, define a property specification language …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Runtime Service Discovery for Grid Applications",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/runtime-service-discovery-grid-applications/19346",
            "Abstract": "A Virtual Organisation in large-scale distributed systems is a set of individuals and/or institutions with some common purposes or interests that need to share their resources to further their objectives, which is similar to a human community in social networks that consists of people have common interests or goals. Due to the similarity between social networks and Grids, the concepts in social science (eg small world phenomenon) can be adopted for the design of new generation Grid systems. This chapter presents a Small World Architecture for Effective Virtual Organisations (SWEVO) for Grid resource discovery in Virtual Organisations, which enables Virtual Organisations working in a more collaborative manner to support decision makers. In SWEVO, Virtual Organisations are connected by a small number of interorganisational links. Not every local network node needs to be connected to remote Virtual …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:RGFaLdJalmkC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Usefulness of (1, 3) ß-D-glucan detection in bronchoalveolar lavage samples in Pneumocystis pneumonia and Pneumocystis pulmonary colonization",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1156523314002868",
            "Abstract": "Objective of the study Recent data demonstrate the usefulness of (1, 3) ß-d-glucan (BG) detection in serum samples to distinguish patients developing Pneumocystis pneumonia and patients who are colonized by the fungus. In contrast, data of BG detection in bronchoalveolar lavage (BAL) samples from these patient populations are still rare. Patients In this context, we determined BG levels in BAL samples from 11 Pneumocystis pneumonia (PCP) patients, 10 colonized patients, and 24 Pneumocystis-uninfected patients. Materials and methods BG levels were determined on each BAL sample using the Fungitell® kit (Associates of Cape Cod, Inc., Cape Cod, MA, USA) according to the manufacturer's instructions applied to serum sample examination. Results The BG levels in BAL samples from the PCP patient group (mean value 20 588 pg/mL) were significantly higher than those in the colonized patient group …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Towards a model-driven platform for evidence based public health policy making",
            "Publication year": 2017,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/17393/1/",
            "Abstract": "The effective management of various health conditions depends on and requires appropriate public health policies (PHP). Such policies are important for several aspects of healthcare provision, including:(a) screening for prevention of disease;(b) early diagnosis and treatment;(c) long-term management of chronic diseases and disabilities; and (d) setting-up standards. Although it is widely recognised that the PHP life cycle (ie, the analysis, action plan design, execution, monitoring and evaluation of public health policies) should be evidenced based, current support for it is mainly in the form of guidelines, and is not supported by data analytics and decision making tools tailored to it. In this paper, we present a novel model driven approach to PHP life cycle management and an integrated platform for realising this life cycle. Our approach is based on PHP decision making models. Such models steer the PHP decision making process by defining the data that need to be collected and the ways in which these data should be analysed in order to produce the evidence required for PHP making. Our work is part of a new research programme on public health policy making for the management of hearing loss, called EVOTION, that is funded by the European Union.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:vDijr-p_gm4C",
            "Publisher": "KSI Research Inc. and Knowledge Systems Institute"
        },
        {
            "Title": "Towards a framework for dynamic verification of peer-to-peer systems",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4222904/",
            "Abstract": "Ensuring dependability and security of peer-to-peer (P2P) systems is an intricate task due to the autonomous and volatile nature of peers and the decentralization that characterizes such systems. Dynamic verification provides the means of monitoring aspects of peer behaviour at runtime and the capacity to react to identified violations with the aim of preserving the system in the desired state. Thus, it can provide an extra layer of checking properties like security and dependability and lead to enhanced system resilience in this respect. In this paper, we introduce a framework that supports the dynamic verification of P2P systems.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest editors' introduction: Special section on intelligent data preparation",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Chengqi-Zhang-3/publication/3297450_Guest_Editors'_Introduction_Special_Section_on_Intelligent_Data_Preparation/links/0a85e53bd28e3b52c7000000/Guest-Editors-Introduction-Special-Section-on-Intelligent-Data-Preparation.pdf",
            "Abstract": "DATA preparation (or data preprocessing) is the first step of data processing applications, including machine learning, data mining, data warehousing, information retrieval, and pattern recognition. Industrial practice indicates that more than 80 percent of the data mining work concentrates on data preparation. Indeed, once the data is well prepared, the mined results are more accurate and reliable. This means that data preparation is also a critical step for other data processing applications. Among others, data preparation mainly involves data cleaning, data transformation, and data selection [1]. The principal aim of data preparation is to provide quality data for other steps of data processing applications, which are often accomplished in tandem with data mining and knowledge discovery. Indeed, the boundary can sometimes be blurry, but the general principle of data preparation can still be singled out from other data processing techniques. However, there has been relatively little focused work done for data preparation.Recognizing the unique importance of data preparation, we have organized a series of workshops and special issues in top-quality journals to facilitate the development of data preparation techniques. Our first activity was the organization of the First International Workshop on Data Cleaning and Preprocessing, in conjunction with the IEEE International Conference on Data Mining (ICDM) in 2002, which was known as the DCAP workshop (ie, data cleaning and preparation). High-quality papers from the workshop was also selected and published in a special issue on data preparation for data mining in the Applied Artificial …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Designing and Adapting Service-based Systems: A Service Discovery Framework",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-7091-0415-6_10",
            "Abstract": "This chapter describes a service discovery framework that has been developed within the EU 6th Framework projects SeCSE and Gredia. The framework supports design of service-based systems based on existing services and adaptation of service based systems during their execution due to different situations. It assumes services described from different perspectives and uses complex service discovery queries specified in an XML-based language that we have developed. The work is illustrated with the Cell Phone Operator case study.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:D03iK_w7-QYC",
            "Publisher": "Springer, Vienna"
        },
        {
            "Title": "SeCSE–Service centric system engineering: An overview",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TSEPXIng_x4C&oi=fnd&pg=PA241&dq=info:9THsnr2LuVwJ:scholar.google.com&ots=KQEGT_pbkK&sig=gIrxE5SJfAF1FRlMXRQQCgRc_eY",
            "Abstract": "The service-oriented paradigm is fostering a new breed of software system development. Complex applications are seen as compositions of remote services often owned by di¤ erent organizations. This approach is one of the pillars behind the NESSI vision of ‘‘the user, the individual, at the centre of future developments for an inclusive knowledge-based society for all,’’1 but requires methods and tools for its full and seamless adoption. The SeCSE project contributes to the deﬁnition of a sound service-oriented development discipline by means of some innovative solutions. Starting from existing standards, research achievements, and stakeholders’ expectations, the project aims at the following:1. Extending existing approaches to service speciﬁcation to include additional specialpurpose information, o¤ ering quality of service (QoS) and dependability statements, and supporting the use of such speciﬁcations for discovery and dynamic binding. 2. Developing linguistic mechanisms and methodological approaches for the development of self-adaptive service compositions where non-service-based parts can be integrated seamlessly to create a hybrid system. It also o¤ ers solutions for the validation, testing, and runtime monitoring of services and service-centric systems (SCSs). 3. Verifying the SeCSE methods, tools, and techniques against real-world problems and scenarios provided by the industrial partners.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards transparent and trustworthy cloud",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7962126/",
            "Abstract": "Despite its immense benefits in terms of flexibility, resource consumption, and simplified management, cloud computing raises several concerns due to lack of trust and transparency. Like all computing paradigms based on outsourcing, the use of cloud computing is largely a matter of trust. There is an increasing pressure by cloud customers for solutions that would increase their confidence that a cloud service/application is behaving in a secure and correct manner. Cloud assurance techniques, developed to assess the trustworthiness of cloud services, can play a major role in building trust. In this paper, we start from the assumption that an opaque cloud does not fit security, and present a reliable evidence collection process and infrastructure extending existing assurance techniques towards the definition of a trustworthy cloud. The proposed process and infrastructure are applied to a case study on cloud …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic verification and control of mobile peer-to-peer systems",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4561319/",
            "Abstract": "The development of dependable mobile P2P systems is an inherently challenging task since such systems may operate in largely uncontrolled environments and may engage new peers or lose existing ones without any form of centralised control. In these circumstances, dependability and security can be enhanced through the runtime monitoring (a.k.a. dynamic verification) of the compliance of the system behaviour against specific dependability and security properties and the execution of control in cases where properties are violated. In this paper we present a framework for the dynamic verification and control of mobile P2P systems, which uses peer-specific monitoring policies to specify application-level properties. The deployment of this framework for monitoring system behaviour adds an extra layer of security and dependability checking, which is independent from checks performed directly by the P2P system …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Incremental certification of cloud services",
            "Publication year": 2013,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/3236/",
            "Abstract": "Cloud is becoming fast a critical infrastructure. However, several recent incidents regarding the security of cloud services clearly demonstrate that security rightly remains one of the major concerns of enterprises and the general public regarding the use of the cloud. Despite advancements of research related to cloud security, we are still not in a position to provide a systematic assessment of cloud security based on real operational evidence. As a step towards addressing this problem, in this paper, we propose a novel approach for certifying the security of cloud services. Our approach is based on the incremental certification of security properties for different types of cloud services, including IaaS, PaaS and SaaS services, based on operational evidence from the provision of such services gathered through continuous monitoring. An initial implementation of this approach is presented.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the insurance of healthcare systems",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007%252F978-3-030-42051-2.pdf#page=198",
            "Abstract": "Insurance of digital assets is becoming an important aspect nowadays, in order to reduce the investment risks in modern businesses. GDPR and other legal initiatives makes this necessity even more demanding as an organization is now accountable for the usage of its client data. In this paper, we present a cyber insurance framework, called CyberSure. The main contribution is the runtime integration of certification, risk management, and cyber insurance of cyber systems. Thus, the framework determines the current level of compliance with the acquired policies and provide early notifications for potential violations of them. CyberSure develops CUMULUS certification models for this purpose and, based on automated (or semi-automated) certification carried out using them, it develops ways of dynamically adjusting risk estimates, insurance policies and premiums. In particular, it considers the case of dynamic …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:0izLItjtcgwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Diagnosing Runtime Violations of Security & Dependability Properties.",
            "Publication year": 2008,
            "Publication url": "https://core.ac.uk/download/pdf/48606872.pdf#page=690",
            "Abstract": "Monitoring the preservation of security and dependability (S&D) properties of complex software systems is widely accepted as a necessity. Basic monitoring can detect violations but does not always provide sufficient information for deciding what the appropriate response to a violation is. Such decisions often require additional diagnostic information that explains why a violation has occurred and can, therefore, indicate what would be an appropriate response action to it. In this paper, we describe a diagnostic procedure for generating explanations of violations of S&D properties developed as part of a runtime monitoring toolkit, called EVEREST. The procedure is based on a combination of abductive and evidential reasoning about violations of S&D properties which are expressed in Event Calculus.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:BUYA1_V_uYcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering services during service-based system design using UML",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5374424/",
            "Abstract": "Recently, there has been a proliferation of service-based systems, i.e., software systems that are composed of autonomous services but can also use software code. In order to support the development of these systems, it is necessary to have new methods, processes, and tools. In this paper, we describe a UML-based framework to assist with the development of service-based systems. The framework adopts an iterative process in which software services that can provide functional and nonfunctional characteristics of a system being developed are discovered, and the identified services are used to reformulate the design models of the system. The framework uses a query language to represent structural, behavioral, and quality characteristics of services to be identified, and a query processor to match the queries against service registries. The matching process is based on distance measurements between the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "EVEREST+ run-time SLA violations prediction",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1890912.1890915",
            "Abstract": "Monitoring the preservation of QoS properties during the operation of service-based systems at run-time is an important verification measure for checking if the current service usage is compliant with agreed SLAs. Monitoring, however, does not always provide sufficient scope for taking control actions against violations as it only detects violations after they occur.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pairing a Circular Economy and the 5G-Enabled Internet of Things: Creating a Class of? Looping Smart Assets?",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9106811/",
            "Abstract": "The increase in the world's population has led to a massive rise in human consumption of the planet's natural resources, well beyond their replacement rate. Traditional recycling concepts and methods are not enough to counter such effects. In this context, a circular economy (CE), that is, a restorative and regenerative by-design economy, can reform today's \"take-make-dispose\" economic model. On the other hand, the Internet of Things (IoT) continues to gradually transform our everyday lives, allowing for the introduction of novel types of services while enhancing legacy ones. Taking this as our motivation, in this article we analyze the CE/IoT interplay, indicating innovative ways in which this interaction can drastically affect products and services, their underlying business models, and the associated ecosystems. Moreover, we present an IoT architecture that enables smart object integration into the IoT ecosystem …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:HtEfBTGE9r8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a traceability approach for product families requirements",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.117.4536&rep=rep1&type=pdf",
            "Abstract": "The development of families of complex software-intensive products has become a reality. In such systems the documentation generated during the development life-cycle is of significant size and complexity, and are specified at different levels of abstraction and granularity.An example of the above situation is found in requirements documentation, in which there may be parts of the documents that specify common features of an entire product-family in broad market-terms, and parts that specify the exact functionality of the individual members of the family. Furthermore, depending on their purpose and contents, different parts of the documentation may be produced and owned by different stakeholders (eg marketing experts, developers). They may also evolve autonomously (eg certain functional requirements for an individual product in a family may change independently of the functional requirements for other members of the family). In such settings, support for inter-requirements traceability becomes very significant.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pattern-Based System Evolution: A Case-Study.",
            "Publication year": 2006,
            "Publication url": "http://dsrg.cs.clemson.edu/pdfs/pbseacs.pdf",
            "Abstract": "Design patterns help system designers apply proven solutions to commonly occurring problems in particular contexts. While their impact on software practice has been significant, the application of patterns has been limited to the early stages of the software lifecycle. In this paper, we show how the benefits of a pattern-centric approach can be leveraged across the lifecycle, specifically as the system evolves to meet changing requirements. The approach is based on a notation we have previously proposed for providing precise specifications of patterns and of how patterns are specialized for use in particular systems. In this paper, we summarize the main elements of the specification approach, show how such specifications allow us to capture essential pattern-centric information about a system, and demonstrate, via a simple but illustrative case-study, how this information allows us to preserve the design integrity of the system as it evolves.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering secure service compositions",
            "Publication year": 2014,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/4064/",
            "Abstract": "Security is an important concern for service based systems, i.e., systems that are composed of autonomous and distributed software services. This is because the overall security of such systems depends on the security of the individual services they deploy and, hence, it is difficult to assess especially in cases where the latter services must be discovered and composed dynamically. This paper presents a novel approach for discovering secure compositions of software services. This approach is based on secure service orchestration patterns, which have been proven to provide certain security properties and can, therefore, be used to generate service compositions that are guaranteed to satisfy these properties by construction. The paper lays the foundations of the secure service orchestration patterns, and presents an algorithm that uses the patterns to generate secure service compositions and a tool realising our entire approach.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:WA5NYHcadZ8C",
            "Publisher": "SciTePress"
        },
        {
            "Title": "Describing and Verifying Monitoring Capabilities for Service Based Systems",
            "Publication year": 2009,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/14404/",
            "Abstract": "Monitoring the operation of Service Based Systems (SBS) to ensure compliance with a set of service level agreements (SLAs) for example cannot always rely on a pre-specified monitoring infrastructure, where all the information and components required for monitoring are a priori known and available. This because new services with unknown monitoring infrastructures and capabilities may be dynamically assembled to an SBS. To address the need for dynamic configuration of SBS monitoring infrastructures, this paper proposes a model for describing the monitoring capabilities of different services of an SBS and discusses the process for verifying the monitorability of required properties based on these capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evidential Management of Inconsistencies in Object Interaction Models",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=15534708995178816026&hl=en&oi=scholarr",
            "Abstract": "This paper presents Reconciliation+, a tool-supported method which identifies overlaps between models of different object interactions expressed as UML sequence and/or collaboration diagrams, checks whether the overlapping elements of these models satisfy specific consistency rules, and guides developers in handling these inconsistencies. The method also keeps track of the decisions made and the actions taken in the process of managing inconsistencies. Thus, it covers the entire spectrum of the activities of what is known in the literature as\" inconsistency management\".",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Technical Report Series, TR-2000/04, ISSN 1364-4009, Department of Computing, City University"
        },
        {
            "Title": "IT-outsourcing and IT-offshoring: Trends and impacts on SE/KE curricula",
            "Publication year": 2007,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218194007003409",
            "Abstract": "As a result of IT outsourcing and offshoring, IT professionals and educators are faced with the following question: What SE & KE skill sets will make a software engineer or a knowledge engineer immune to the impact of outsourcing and offshoring? This article summarizes the position papers from a panel held during the 2006 International Conference on Software Engineering and Knowledge Engineering from July 5 to 7 at the Hotel Sofitel, Redwood City in California, USA. Bringing software and knowledge engineers closer to the needs of their prospective customers and providing more value than simply pure software development and maintenance, is an open challenge at least for traditional computer science and software engineering curricula.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:bFI3QPDXJZMC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Service Discovery for Service Centric Systems",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=9111298154580215299&hl=en&oi=scholarr",
            "Abstract": "A service discovery process for engineering service-centric systems (SCS) is proposed. Current software engineering practice is extended by explicitly including the discovery of existing services in a way that the services are composed into the SCS being developed. A number of different stakeholder roles are assisted by the process, which is divided in three main activities: Early Service Discovery (ESD), Architecture-driven Service Discovery (ASD), and Run-time Discovery (RTD). ESD and ASD are iterative activities that help the revision of system requirements, and architecture and design models, respectively. RTD ensures the resilience and re-configurability of SCS when services fail or start malfunctioning. The specific techniques used for discovery include information retrieval, similarity matching, and goal-based reasoning. Tools and prototypes to support ESD, ASD, and RTD are being developed and evaluated by our industrial partners.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Public health policy for management of hearing impairments based on big data analytics: EVOTION at Genesis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8251344/",
            "Abstract": "The holistic management of hearing loss (HL) requires appropriate public health policies for HL prevention, early diagnosis, long-term treatment and rehabilitation; detection and prevention of cognitive decline; protection from noise; and socioeconomic inclusion of HL patients. However, currently the evidential basis for forming such policies is limited. Holistic HL management policies require the analysis of heterogeneous data, including Hearing Aid (HA) usage, noise episodes, audiological, physiological, cognitive, clinical and medication, personal, behavioural, life style, occupational and environmental data. To utilise these data in forming holistic HL management policies, EVOTION, a new European research and innovation project, aims to develop an integrated platform supporting: (a) the analysis of related datasets to enable the identification of causal and other effects amongst them using various forms of big …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:EYYDruWGBe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for hierarchical and recursive monitoring of service based systems",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5072548/",
            "Abstract": "Runtime monitoring of Service Based Systems (SBSs) usually relies on information derived from I/O messages exchanged within business processes implementing services. When service provisioning is regulated by complex Service Level Agreements (SLAs) between service requesters, (composed) services, and infrastructure providers, monitoring may require additional features, such as (i) coordination among events captured at different sources involved in service provisioning and (ii) delegation of properties monitoring to local sites. This paper discusses an architecture and engagement protocol supporting the two aforementioned requirements for monitoring complex SLA-driven service provisioning.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The THREAT-ARREST Cyber Range Platform",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9527963/",
            "Abstract": "Emerging technologies are facilitating our daily activities and drive the digital transformation. The Internet of Things (IoT) and 5G communications will provide a wide range of new applications and business opportunities, but with a wide and quite complex attack surface. Several users are not aware of the underlying threats and most of them do not possess the knowledge to set and operate the various digital assets securely. Therefore, cyber security training is becoming mandatory both for simple users and security experts. Cyber ranges constitute an advance training technique where trainees gain hands-on experiences on a safe virtual environment, which can be a realistic digital twin of an actual system. This paper presents the cyber ranges platform THREAT-ARREST. Its design is fully model-driven and offers all modern training features (i.e. emulation, simulation, serious games, and fabricated data). The …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:LhH-TYMQEocC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring WS-Agreements: An Event Calculus–Based Approach",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72912-9_10",
            "Abstract": "In this chapter, we present a framework that we have developed to support the monitoring of service level agreements (SLAs). The agreements that can be monitored by this framework are expressed in an extension of WS-Agreement that we propose. The main characteristic of the proposed extension is that it uses an event calculus–based language, called EC-Assertion, for the specification of the service guarantee terms in a service level agreement that need to be monitored at runtime. The use of EC-Assertion for specifying service guarantee terms provides a well-defined semantics to the specification of such terms and a formal reasoning framework for assessing their satisfiability. The chapter describes also an implementation of the framework and the results of a set of experiments that we have conducted to evaluate it.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "From monitoring templates to security monitoring and threat detection",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4622581/",
            "Abstract": "This paper presents our pattern-based approach to run-time requirements monitoring and threat detection being developed as part of an approach to build frameworks supporting the construction of secure and dependable systems for ambient intelligence. Our patterns infra-structure is based on templates. From templates we generate event-calculus formulas expressing security requirements to monitor at run-time. From these theories we generate attack signatures, describing threats or possible attacks to the system. At run-time, we evaluate the likelihood of threats from run-time observations using a probabilistic model based on Bayesian networks.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evidential diagnosis of inconsistencies in object-oriented designs",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218194004001610",
            "Abstract": "This paper presents a diagnostic framework for assessing the significance of inconsistencies (i.e., violations of consistency rules) in software design models expressed in the Unified Modeling Language (UML). The assessment is based on significance criteria that software designers can specify and associate with specific consistency rules. These criteria define characteristics that the model elements involved in the violation of a rule should have for the inconsistency to be significant, and they are specified in a formal language derived from the Object Constraint Language (OCL). The satisfiability of the criteria by individual model elements is measured by belief functions defined by the framework. The measures generated by these functions are used to rank the inconsistencies caused by different model elements. The presented framework has been evaluated through a set of experiments. The results of these …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:J_g5lzvAfSwC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Diagnosis of balance disorders using decision support systems based on data mining techniques",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7367688/",
            "Abstract": "In this work we present the decision support of the EMBalance platform. EMBalance is a platform for the management of balance disorders in terms of diagnosis, treatment and evolution. The EMBalance platform aims to extend existing but generic and currently uncoupled balance modelling activities leading to a multi-scale and patient-specific balance model, which will be incorporated in a Decision Support System (DSS), towards the early diagnosis, prediction and the efficient treatment planning of balance disorders. The diagnosis part of the decision support system uses various data ranging from demographic characteristics to clinical examinations, auditory and vestibular tests. Currently we present some initial technical choices and indicative results of the decision support system for diagnosing balance disorders, based on data mining techniques and clinical guidelines.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evaluation of Novel Approaches to Software Engineering: 13th International Conference, ENASE 2018, Funchal, Madeira, Portugal, March 23–24, 2018, Revised Selected Papers",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=OaafDwAAQBAJ&oi=fnd&pg=PP6&dq=info:KFp05jTFoV4J:scholar.google.com&ots=S9lisE0k_7&sig=x6fyskQ2Ium2RY61N9pllbkDfiE",
            "Abstract": "This book constitutes the refereed proceedings of the 13th International Conference on Evaluation of Novel Approaches to Software Engineering, ENASE 2018, held in Funchal, Madeira, Portugal, in March 2018. The 17 revised full papers and 5 revised short papers presented were carefully reviewed and selected from 95 submissions. The papers are organized in topical sections on service science and business information systems and software engineering.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer"
        },
        {
            "Title": "Diagnosis of the significance of inconsistencies in object-oriented designs: a framework and its experimental evaluation",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121202000183",
            "Abstract": "This paper presents: (a) a framework for assessing the significance of inconsistencies which arise in object-oriented design models that describe software systems from multiple perspectives, and (b) the findings of a series of experiments conducted to evaluate it. The framework allows the definition of significance criteria and measures the significance of inconsistencies as beliefs for the satisfiability of these criteria. The experiments conducted to evaluate it indicate that criteria definable in the framework have the power to create elaborate rankings of inconsistencies in models.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A lightweight framework for secure life-logging in smart environments",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1363412712000465",
            "Abstract": "As the world becomes an interconnected network where objects and humans interact with each other, new challenges and threats appear in the ecosystem. In this interconnected world, smart objects have an important role in giving users the chance for life-logging in smart environments. However, smart devices have several limitations with regards to memory, resources and computation power, hindering the opportunity to apply well-established security algorithms and techniques for secure life-logging on the Internet of Things (IoT) domain. The need for secure and trustworthy life-logging in smart environments is vital, thus, a lightweight approach has to be considered to overcome the constraints of Smart Objects. The purpose of this paper is to present in details the current topics of life-logging in smart environments, while describing interconnection issues, security threats and suggesting a lightweight framework for …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "ASSERT4SOA: Toward security certification of service-oriented applications",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16961-8_11",
            "Abstract": "ASSERT4SOA project proposes machine readable certificates to be used to allow Web service requesters to automatically assess the security properties of Web services (and their providers) as certified by a trusted third party. This vision promises to open up an entire new market for certification services.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Supporting the Construction of Decision Models for Software Selection: Towards a Probabilistic Traceability Approach",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.114.6729&rep=rep1&type=pdf",
            "Abstract": "This paper describes an approach to the problem of constructing software package selection models. This approach is based on an analysis of the contents of package description documents using rules which can:(i) extract selection criteria from descriptions of package features,(ii) structure the extracted criteria in a package selection model, and (iii) trace these criteria onto descriptions of other package features which have the potential of satisfying them.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Quantitative assessment of the significance of inconsistencies in object-oriented designs",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.6.8421&rep=rep1&type=pdf",
            "Abstract": "This paper presents a framework for assessing the significance of inconsistencies which arise in object-oriented design models that describe systems from multiple perspectives. The framework allows the definition of significance criteria and measures the significance of inconsistencies as beliefs for the satisfiability of these criteria.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Slicing State-based Models",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30740306/10421.AndroustopoulosKelly1.Slides.pdf",
            "Abstract": "Slicing State-based Models Page 1 Slicing State-based Models Kelly Androutsopoulos CREST \n(Center for Research in Evolution, Search and Testing) University College of London Email: \nK.Androutsopoulos@cs.ucl.ac.uk Working with: David Clark, Nicolas Gold, Mark Harman, Rob \nHierons, Zheng Li, and Laurence Tratt Page 2 Program Slicing Page 3 Program Slicing We only \ncare about this line Page 4 Program Slicing Slicing Criterion What other lines affect the slicing \ncriterion ? Page 5 Program Slicing Slicing Criterion What other lines affect the slicing criterion \n? Page 6 Program Slicing Slicing Criterion Lines in the slice Page 7 Can slicing be applied \nat the model level ? Page 8 Why slicing state based models is hard • State-based models \nmay be: – Non-terminating – Non-deterministic – Interact with their environment • Problem \nof reconnecting graph after slicing. Page 9 An EFSM of a door controller of a lift system (…",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing secure service workflows in BPEL",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-45391-9_48",
            "Abstract": "This paper presents an approach that we have developed to support the design of secure service based applications in BPEL. The approach is based on the use of secure service composition patterns, which are proven to preserve composition level security properties if the services that are composed according to the pattern satisfy other properties individually. The secure service composition patterns are used for two purposes: (a) to analyse whether a given workflow fragment satisfies a given security property, and (b) to generate compositions of services that could substitute for individual services within the workflow that cause the violation of the security properties. Our approach has been implemented in a tool that is based on Eclipse BPEL Designer.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:HE397vMXCloC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Proactive sla negotiation for service based systems: Initial implementation and evaluation experience",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6009239/",
            "Abstract": "This paper describes a framework that we have developed to integrate proactive SLA negotiation with dynamic service discovery to provide cohesive runtime support for both these activities. The proactive negotiation of SLAs as part of service discovery is necessary for reducing the extent of interruptions during the operation of a service based system when the need for replacing services in it arises. The developed framework discovers alternative candidate constituent services for a service client application, and negotiates/agrees but does not activate SLAs with these services until the need for using a service becomes necessary. A prototype tool has been implemented to realize the framework. This prototype is discussed in the paper along with the results of the initial evaluation of the framework.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The green blockchains of circular economy",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2079-9292/10/16/2008",
            "Abstract": "Eco-friendly systems are necessitated nowadays, as the global consumption is increasing. A data-driven aspect is prominent, involving the Internet of Things (IoT) as the main enabler of a Circular Economy (CE). Henceforth, IoT equipment records the system’s functionality, with machine learning (ML) optimizing green computing operations. Entities exchange and reuse CE assets. Transparency is vital as the beneficiaries must track the assets’ history. This article proposes a framework where blockchaining administrates the cooperative vision of CE-IoT. For the core operation, the blockchain ledger records the changes in the assets’ states via smart contracts that implement the CE business logic and are lightweight, complying with the IoT requirements. Moreover, a federated learning approach is proposed, where computationally intensive ML tasks are distributed via a second contract type. Thus, “green-miners” devote their resources not only for making money, but also for optimizing operations of real-systems, which results in actual resource savings.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:yqoGN6RLRZoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Representation of security and dependability solutions",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-88775-3_5",
            "Abstract": "AmI considerations lead us to argue that it is essential for Security and Dependability (S&D) mechanisms to be able to adapt themselves to renewable context conditions in order to be applied to the ever-changing AmI scenarios. The key for this dynamic adaptation relies on the ability to capture the expertise of S&D engineers in such a way that it can be selected, adapted, used and monitored at runtime by automated means. S&D Artefacts proposed in this chapter represent the core of author’s approach to precisely model such expertise in form of semantic descriptions. They adopt an integral methodology covering the complete system life cycle going from S&D Classes, mostly used at development time, to S&D Patterns and S&D Implementations, perfectly suited for deployment and runtime use. This chapter traces the foundations and internals of S&D Artefacts, describing how they are defined and …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A Framework for Proactive SLA Negotiation.",
            "Publication year": 2010,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/4667/",
            "Abstract": "In this position paper we propose a framework for proactive SLA negotiation that integrates this process with dynamic service discovery and, hence, can provide integrated runtime support for both these key activities which are necessary in order to achieve the runtime operation of service based systems with minimised interruptions. More specifically, our framework discovers candidate constituent services for a composite service, establishes an agreed but not enforced SLA and a period during which this preagreement can be activated should this become necessary",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:eq2jaN3J8jMC",
            "Publisher": "SciTePress"
        },
        {
            "Title": "Tracing Software Requirements Artifacts.",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.114.2012&rep=rep1&type=pdf",
            "Abstract": "The support for traceability between requirement specifications has been recognised as an important task in the development life-cycle of software systems. In this paper we present an approach for automatic generation and maintenance of bi-directional traceability relations between commercial and functional requirements expressed in natural language, and requirement object models. The generation of traceability relations is based on two types of traceability rules: requirements-to-object-model rules and inter-requirements rules. Our approach support three different types of traceability relations namely overlaps, realises, and requires. The requirement artefacts and traceability rules are described in XML. A prototype tool has been developed to demonstrate our approach, and has been used in a series of experiments that we have conducted to evaluate it. The results of these experiments are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rule-based generation of requirements traceability relations",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0164121203002425",
            "Abstract": "The support for traceability between requirement specifications has been recognised as an important task in the development life cycle of software systems. In this paper, we present a rule-based approach to support the automatic generation of traceability relations between documents which specify requirement statements and use cases (expressed in structured forms of natural language), and analysis object models for software systems. The generation of such relations is based on traceability rules of two different types. More specifically, we use requirement-to-object-model rules to trace the requirements and use case specification documents to an analysis object model, and inter-requirements traceability rules to trace requirement and use case specification documents to each other. By deploying such rules, our approach can generate four different types of traceability relations. To implement and demonstrate our …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Translation of SLAs into monitoring specifications",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4614-1614-2_6",
            "Abstract": "The general architecture of the SLA@SOI framework supports the integration of different types of generic or special-purpose monitoring engines. While internally these engines may realise different monitoring approaches (or reasoning mechanisms), externally they support the same common interface. This interface enables the reasoning engines to receive the SLA guarantee terms that need to be monitored and to report monitoring results to the SLA@SOI framework. However, due to differences in the languages that the monitoring engines use to express operational monitoring specifications, the monitoring of SLAs expressed in the SLA specification language of SLA@SOI requires the translation of these SLAs into operational monitoring specifications. This chapter describes the translation scheme developed for the monitoring engine EVEREST, which has been used in the SLA@SOI framework for …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "The Interoperability of Things: Interoperable solutions as an enabler for IoT and Web 3.0",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8514952/",
            "Abstract": "This paper presents an overview of the interoperability concepts along with the challenges for the IoT domain and the upcoming Web 3.0. We identify four levels of interoperability and the relevant solutions for accomplishing vertical and horizontal compatibility between the various layers of a modern IoT ecosystem, referred to as: technological, syntactic, semantic, and organizational interoperability. The goal is to achieve cross-domain interaction and facilitate the proper usage and management of the provided IoT services and applications. An interoperability framework is also proposed where the involved system components can cooperate and offer the seamless operation from the device to the backend framework. This by-design end-to-end interoperation enables the interplay of several complex service composition settings and the management of the system via patterns. The overall proposal is adopted by the …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:ruyezt5ZtCIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimating event lifetimes for distributed runtime verification",
            "Publication year": 2008,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/2890/1/",
            "Abstract": "Runtime system verification has been proposed as a form of dynamic verification of software systems which can be applied in settings where complete static verification or exhaustive system testing is not practical. Runtime verification checks properties against runtime events generated during the operation of a system. Current approaches to runtime verification assume that runtime events are time-stamped by a single clock and, thus, can be totally ordered. They also assume that events are received by the reasoning engine in the same order as they have been produced. These assumptions are apparently true only in systems with a single clock. In this paper, we present the extension of a framework for runtime verification which can monitor distributed systems, in which events are produced by different components, each having its own clock.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Knowledge Systems Institute Graduate School"
        },
        {
            "Title": "Threat landscape and good practice guide for software defined networks/5g",
            "Publication year": 2015,
            "Publication url": "https://openaccess.city.ac.uk/id/eprint/15504",
            "Abstract": "5G represents the next major phase of mobile telecommunication systems and network architectures beyond the current 4G standards, aiming at extreme broadband and ultra-robust, low latency connectivity, to enable the programmable connectivity for the Internet of Everything2. Despite the significant debate on the technical specifications and the technological maturity of 5G, which are under discussion in various fora3, 5G is expected to affect positively and significantly several industry sectors ranging from ICT to industry sectors such as car and other manufacturing, health and agriculture in the period up to and beyond 2020. 5G will be driven by the influence of software on network functions, known as Software Defined Networking (SDN) and Network Function Virtualization (NFV). The key concept that underpins SDN is the logical centralization of network control functions by decoupling the control and packet forwarding functionality of the network. NFV complements this vision through the virtualization of these functionalities based on recent advances in general server and enterprise IT virtualization. Considering the technological maturity of the technologies that 5G can leverage on, SDN is the one that is moving faster from development to production. To realize the business potential of SDN/5G, a number of technical issues related to the design and operation of Software Defined Networks need to be addressed. Amongst them, SDN/5G security is one of the key issues, that needs to be addressed comprehensively in order to avoid missing the business opportunities arising from SDN/5G. In this report, we review threats and potential …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "European Union Agency for Network and Information Security (ENISA)"
        },
        {
            "Title": "Towards security monitoring patterns",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1244002.1244327",
            "Abstract": "Runtime monitoring is performed during system execution to detect whether the system's behaviour deviates from that described by requirements. To support this activity we have developed a monitoring framework that expresses the requirements to be monitored in event calculus-a formal temporal first order language. Following an investigation of how this framework could be used to monitor security requirements, in this paper we propose patterns for expressing three basic types of such requirements, namely confidentiality, integrity and availability. These patterns aim to ease the task of specifying confidentiality, integrity and availability requirements in monitorable forms by non-expert users. The paper illustrates the use of these patterns using examples of an industrial case study.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EMBalance data repository modeling and clinical application",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7367677/",
            "Abstract": "Dizziness is a common symptom for both benign and life-threatening disorders with subtle distinguishing features. This poses a clinical challenge for physicians dealing with patients suffering from dizziness and vertigo and managing them within primary care. The objective of the EMBalance project is to present a decision support system to assist general practitioners in the diagnosis and management of vestibular disorders. In this work we review the modeling techniques integrated with clinical data to produce a multi-scale, patient-specific balance model that is incorporated in the DSS based on data mining techniques. To understand this we have outlined both technical and clinical aspects to the project. Further we discuss how we intend to test this product in a multicentred, double blind, parallel group randomized controlled trial and the impact we expect the DSS to have both clinically and technologically.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Move to Meaningful Internet Systems: OTM 2010: International Workshops: AVYTAT, ADI, DATAVIEW, EI2N, ISDE, MONET, OnToContent, ORM, P2P-CDVE, SeDeS, SWWS and OTMA",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=tk2rHWVc5wgC&oi=fnd&pg=PR2&dq=info:ahNvwixbtt4J:scholar.google.com&ots=Hu_imN-YB8&sig=o1k7WtaQPfBS3g4evdsw2A1PVWY",
            "Abstract": "and ontologies, and CoopIS (CooperativeInformationSystems, since 1993), c-ering the application of these technologies in an enterprise context through, for example, work? ow systems and knowledge management. In 2007 the IS wo-shop (Information Security) was added to try covering also the speci? c issues of security in complex Internet-based information systems. Each of the main c-ferences speci? cally seeks high-quality contributions and encourages researchers to treat their respective topics within a framework that incorporates jointly (a) theory,(b) conceptual design and development, and (c) applications, in part-ular case studies and industrial solutions. Following and expanding the model created in 2003, we again solicited and selected quality workshop proposals to complement the more “archival” nature of the main conferences with research results in a number of selected and more “avant-garde” areas related to the general topic of Web-based distributed c-puting. For instance, the so-called Semantic Web has given rise to several novel research areas combining linguistics, information systems technology and ar-? cial intelligence, such as the modeling of (legal) regulatory systems and the ubiquitous nature of their usage. We were glad to see that seven of our s-cessful earlier workshops (ADI, EI2N, SWWS, ORM, OnToContent, MONET, ISDE) re-appearedin 2010 with, in some cases, a fourth or even? fth edition,-ten in alliance with other older or newly emerging workshops, and that no fewer than four brand-new independent workshops could be selected from proposals and hosted: AVYTAT, DATAVIEW, P2PCDVE, SeDeS.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:WZBGuue-350C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Coverage-Based Testing for Service Level Agreements",
            "Publication year": 2015,
            "Publication url": "https://digibuo.uniovi.es/dspace/handle/10651/30606",
            "Abstract": "Coverage-Based Testing for Service Level Agreements RUO Home Repositorio \nInstitucional de la Universidad de Oviedo View Item RUO Home Producción Bibliográfica \nde UniOvi: RECOPILA Artículos View Item RUO Home Producción Bibliográfica de UniOvi: \nRECOPILA Artículos View Item Toggle navigation español English Search RUO This \nCollection Browse All of RUOCommunities and CollectionsBy Issue DateAuthorsTitlesSubjectsxmlui.ArtifactBrowser.Navigation.browse_issnAuthor \nprofilesThis CollectionBy Issue DateAuthorsTitlesSubjectsxmlui.ArtifactBrowser.Navigation.browse_issn \nMy Account LoginRegister Statistics View Usage Statistics AÑADIDO RECIENTEMENTE \nNovedades Repositorio Cómo publicar Recursos FAQs Coverage-Based Testing for \nService Level Agreements Author: Palacios Gutiérrez, Marcos Uniovi authority ; García \nFanjul, José Uniovi authority ; Tuya González, Pablo Javier ; , : : : :…",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:0N-VGjzr574C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Formal methods in model-driven development for service-oriented and cloud computing",
            "Publication year": 2010,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.232.8422&rep=rep1&type=pdf",
            "Abstract": "Configuration of monitoring systems aligned with agreement and guarantees expressed in Service-Level Agreements (SLAs) can be a complex and time-consuming activity. For monitoring functional and non-functional aspects of services, the EU project SLA@ SOI has developed a model and language set to describe such SLAs aligning with a service monitoring system architecture for run-time monitoring. In this work we show how these models are formally and mechanically decomposed into terms and primitive events, whilst monitoring component selection for these terms and events is used to generate a complete monitoring system configuration for run-time.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A platform for context aware runtime web service discovery",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4279604/",
            "Abstract": "In this paper we describe a platform that supports context aware runtime service discovery. The platform supports service discovery based on structural and behavioural service models as well as complex context related service discovery conditions which are specified in a newly introduced query language. During discovery, context information is obtained through a uniform scheme of calling \"context operations\" and is subsequently used in the evaluation of service discovery queries.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security Certification for the Cloud: The CUMULUS Approach",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-25988-8_8",
            "Abstract": "This chapter presents a certification-based assurance solution for the cloud, which has been developed as part of the FP7 EU Project CUMULUS. It provides an overview of the CUMULUS certification models, which are at the basis of the certification processes implemented and managed by the CUMULUS certification framework. Certification models drive the collection of evidence used by the framework to assess whether the system under certification supports required security properties, and generate and manage certificates proving compliance to such properties (certification process). Collected evidence can be of different types (i.e., test-based, monitoring-based, and trusted computing-based evidence) and addresses the peculiarities of cloud environments. The framework also supports continuous and incremental evaluation of services in the production cloud.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Reactive security for SDN/NFV‐enabled industrial networks leveraging service function chaining",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.3269",
            "Abstract": "The innovative application of fifth‐generation core technologies, ie, software‐defined networking (SDN) and network function virtualization, can help reduce capital and operational expenditures in industrial networks. Nevertheless, SDN expands the attack surface of the communication infrastructure, thus necessitating the introduction of additional security mechanisms. These major changes could not leave the industrial environment unaffected, with smart industrial deployments gradually becoming a reality, a trend that is often referred to as the Fourth Industrial Revolution or Industry 4.0. A wind park is a good example of an industrial application relying on a network with strict performance, security, and reliability requirements and was chosen as a representative example of industrial systems. This work highlights the benefit of leveraging the flexibility of SDN/network function virtualization–enabled networks to …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Certifying services in cloud: The case for a hybrid, incremental and multi-layer approach",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6375614/",
            "Abstract": "The use of clouds raises significant security concerns for the services they provide. Addressing these concerns requires novel models of cloud service certification based on multiple forms of evidence including testing and monitoring data, and trusted computing proofs. CUMULUS is a novel infrastructure for realising such certification models.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architecture-driven service discovery for service centric systems",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/article/international-journal-web-services-research/3100",
            "Abstract": "Service discovery has been recognized as an important aspect in the development of service-centric systems, ie, software systems which deploy Web services. To develop such systems, it is necessary to identify services that can be combined in order to fulfill the functionality and achieve quality criteria of the system being developed. In this paper, we present a framework supporting architecture-driven service discovery (ASD)—that is the discovery of services that can provide functionalities and satisfy properties and constraints of systems as specified during the design phase of the development lifecycle based on detailed system design models. Our framework assumes an iterative design process and allows for the (re-) formulation of design models of service-centric systems based on the discovered services. The framework is composed of a query extractor, which derives queries from behavioral and structural UML …",
            "Abstract entirety": 0,
            "Author pub id": "XQSvrAwAAAAJ:0EnyYjriUFMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Runtime prediction of software service availability",
            "Publication year": 2011,
            "Publication url": "http://world-comp.org/p2011/SER4915.pdf",
            "Abstract": "This paper presents a prediction model for software service availability measured by the mean-time-to-repair (MTTR) and mean-time-to-failure (MTTF) of a service. The prediction model is based on the experimental identification of probability distribution functions for variables that affect MTTR/MTTF and has been implemented using a framework that we have developed to support monitoring and prediction of quality-of-service properties, called EVEREST+. An initial experimental evaluation of the model is presented in the paper.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:vV6vV6tmYwMC",
            "Publisher": "The Steering Committee of The World Congress in Computer Science, Computer Engineering and Applied Computing (WorldComp)"
        },
        {
            "Title": "A big data repository and architecture for managing hearing loss related data",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8333397/",
            "Abstract": "The vast amount of data, which arise in healthcare applications makes traditional data processing technology inadequate and requires the use of fast emerging big data technologies to cope with key challenges, including data heterogeneity, pace of acquisition, size, privacy and security. Addressing these challenges requires a shift from traditional data analysis systems and techniques to big data management and processing platforms as well as big data analytics centric architectures. In this paper, we introduce such an architecture. The architecture has been developed to support the acquisition and analysis of big data sets regarding hearing loss and the provision of related healthcare services for the purpose of informing public health policy making. The paper provides an overview of the system and presents the outcomes of an initial evaluation of its performance.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:-FonjvnnhkoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Constructing secure service compositions with patterns",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6274049/",
            "Abstract": "In service based applications, it is often necessary to construct compositions of services in order to provide required functionality in cases where this is not possible through the use of a single service. Whilst creating service compositions, it is necessary to ensure not only that the functionality required of the composition is achieved but also that certain security properties are preserved. In this paper, we describe an approach to constructing secure service compositions. Our approach is based on the use of composition patterns and rules that determine the security properties that should be preserved by the individual services that constitute a composition in order to ensure that security properties of the overall composition are also satisfied. Our approach extends a framework developed to support the runtime service discovery.",
            "Abstract entirety": 1,
            "Author pub id": "XQSvrAwAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        }
    ]
}]