[{
    "name": "Γεώργιος Στάμου",
    "romanize name": "Georgios Stamou",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "ntua",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 16773,
    "Scholar name": "Giorgos Stamou",
    "Scholar id": "R3y5dxMAAAAJ",
    "Affiliation": "Professor of Computer Science, National Technical University of Athens",
    "Citedby": 4679,
    "Interests": [
        "Artificial Intelligence",
        "Machine Learning",
        "Knowledge Representation",
        "Automated Reasoning",
        "Semantic Web"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=R3y5dxMAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "D2. 2.4: Alignment implementation and benchmarking results",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=7701825253997840996&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image Annotation on the Semantic Web: W3C",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=13280393035545478776&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:LI9QrySNdTsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multimedia Content and the Semantic Web",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=15440643430090193894&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:W5xh706n7nkC",
            "Publisher": "John Wiley & Sons Ltd"
        },
        {
            "Title": "A Hybrid Intelligence System for Facial Expression Recognition",
            "Publication year": 2002,
            "Publication url": "http://ktisis.cut.ac.cy/handle/10488/4030",
            "Abstract": "This paper presents an experimental study dealing with facial expression recognition which examines the appropriateness of a hybrid intelligence architecture for subsymbolic to symbolic mapping. The facial expression recognition enhances interactivity and assists human-computer interaction issues, letting the system become accustomed to the current needs and feelings of the user. Actual application of this technology is expected in educational environments, 3D video conferencing and collaborative workplaces, online shopping and gaming, virtual communities and interactive entertainment.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inside the Query Space of DL Knowledge Bases.",
            "Publication year": 2019,
            "Publication url": "http://ceur-ws.org/Vol-2373/paper-11.pdf",
            "Abstract": "We structure the query space of DL knowledge bases (KBs) by finding equivalent and partial ordering relations between answer sets of conjunctive queries, and defining a formal graph structure that allows qualitative and quantitative exploration of the query space. We also discuss how to compute such a graph for restricted DL-LiteR KBs.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:0N-VGjzr574C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic Representation, Enrichment, and Retrieval of Audiovisual Film Content",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=13549661453792759174&hl=en&oi=scholarr",
            "Abstract": "Searching audiovisual content for specific information has been a key issue in the development of multimedia technologies. Accessing huge amounts of video, television documentaries, or films and looking for specific categories of objects, events, or concepts over the Web is still one of the main challenges in multimedia analysis and multimedia search.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving fuel economy with LSTM networks and reinforcement learning",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-01421-6_23",
            "Abstract": "This paper presents a system for calculating the optimum velocities and trajectories of an electric vehicle for a specific route. Our objective is to minimize the consumption over a trip without impacting the overall trip time. The system uses a particular segmentation of the route and involves a three-step procedure. In the first step, a neural network is trained on telemetry data to model the consumption of the vehicle based on its velocity and the surface gradient. In the second step, two Q-learning algorithms compute the optimum velocities and the racing line in order to minimize the consumption. In the final step, the computed data is presented to the driver through an interactive application. This system was installed on a light electric vehicle (LEV) and by adopting the suggested driving strategy we reduced its consumption by 24.03% with respect to the classic constant-speed control technique.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:SpbeaW3--B0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Handling imprecise knowledge with fuzzy description logic",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/6221690/10.1.1.142.9330.pdf#page=127",
            "Abstract": "Fuzzy Description Logics have been proposed in the literature as a way to represent and reason with vague and imprecise knowledge. Their decidability, the empirically tractable and efficient reasoning algorithms, that carry over to fuzzy Description Logics, have attracted the attention of many research communities and domains that deal with a wealth of imprecise knowledge and information. In the current paper we present the syntax and semantics of fuzzy SHOIQ, investigating several properties of the semantics of transitivity, qualified cardinality restrictions and reasoning capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning ontology alignments using recursive neural networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11550907_128",
            "Abstract": "The Semantic Web is based on technologies that make the content of the Web machine-understandable. In that framework, ontological knowledge representation has become an important tool for the analysis and understanding of multimedia information. Because of the distributed nature of the Semantic Web however, ontologies describing similar fields of knowledge are being developed and the data coming from similar but non-identical ontologies can be combined only if a semantic mapping between them is first established. This has lead to the development of several ontology alignment tools. We propose an automatic ontology alignment method based on the recursive neural network model that uses ontology instances to learn similarities between ontology concepts. Recursive neural networks are an extension of common neural networks, designed to process efficiently structured data. Since …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Class-Wise Principal Component Analysis for hyperspectral image feature extraction",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.04496",
            "Abstract": "This paper introduces the Class-wise Principal Component Analysis, a supervised feature extraction method for hyperspectral data. Hyperspectral Imaging (HSI) has appeared in various fields in recent years, including Remote Sensing. Realizing that information extraction tasks for hyperspectral images are burdened by data-specific issues, we identify and address two major problems. Those are the Curse of Dimensionality which occurs due to the high-volume of the data cube and the class imbalance problem which is common in hyperspectral datasets. Dimensionality reduction is an essential preprocessing step to complement a hyperspectral image classification task. Therefore, we propose a feature extraction algorithm for dimensionality reduction, based on Principal Component Analysis (PCA). Evaluations are carried out on the Indian Pines dataset to demonstrate that significant improvements are achieved when using the reduced data in a classification task.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:NXb4pA-qfm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy non-homogeneous Markov systems",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1016164915513",
            "Abstract": "In this paper the theory of fuzzy logic and fuzzy reasoning is combined with the theory of Markov systems and the concept of a fuzzy non-homogeneous Markov system is introduced for the first time. This is an effort to deal with the uncertainty introduced in the estimation of the transition probabilities and the input probabilities in Markov systems. The asymptotic behaviour of the fuzzy Markov system and its asymptotic variability is considered and given in closed analytic form. Moreover, the asymptotically attainable structures of the system are estimated also in a closed analytic form under some realistic assumptions. The importance of this result lies in the fact that in most cases the traditional methods for estimating the probabilities can not be used due to lack of data and measurement errors. The introduction of fuzzy logic into Markov systems represents a powerful tool for taking advantage of the symbolic …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:-f6ydRqryjwC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A semantically-aided architecture for a web-based monitoring system for carotid atherosclerosis",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7318624/",
            "Abstract": "Carotid atherosclerosis is a multifactorial disease and its clinical diagnosis depends on the evaluation of heterogeneous clinical data, such as imaging exams, biochemical tests and the patient's clinical history. The lack of interoperability between Health Information Systems (HIS) does not allow the physicians to acquire all the necessary data for the diagnostic process. In this paper, a semantically-aided architecture is proposed for a web-based monitoring system for carotid atherosclerosis that is able to gather and unify heterogeneous data with the use of an ontology and to create a common interface for data access enhancing the interoperability of HIS. The architecture is based on an application ontology of carotid atherosclerosis that is used to (a) integrate heterogeneous data sources on the basis of semantic representation and ontological reasoning and (b) access the critical information using SPARQL query …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extending Fuzzy Description Logics for the Semantic Web.",
            "Publication year": 2007,
            "Publication url": "http://www.image.ntua.gr/papers/475.pdf",
            "Abstract": "Fuzzy Description Logics (Fuzzy DLs) and fuzzy OWL have been proposed as languages able to represent and reason about imprecise and vague knowledge. Such extensions have gained considerable attention the last couple of years since on the one hand they are pivotal for applications that are inherently imprecise, like multimedia analysis and retrieval, geospatial applications and more, while on the other hand they can be applied to Semantic Web applications, like querying with preferences, modelling levels of trust and proof and more. In the current paper we extend the current state-of-the-art on fuzzy extensions to Semantic Web languages by presenting the syntax and semantics of the fuzzy-SROIQ DL as well as the abstract, XML syntax and semantics of a fuzzy extension to OWL 1.1. Moreover, we provide reasoning support for a fuzzy version of fuzzy-SROIQ by extending well-known reduction techniques of fuzzy DLs to classical DLs for the additional axioms and constructors of fuzzy-SROIQ.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 2.1 Specification of a common framework for characterizing alignment",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=804167240227258532&hl=en&oi=scholarr",
            "Abstract": "Definition of a common semantic framework for characterizing alignment of heterogeneous information.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A systemic approach for effective semantic access to cultural content",
            "Publication year": 2012,
            "Publication url": "https://content.iospress.com/articles/semantic-web/sw051",
            "Abstract": "A large on-going activity for digitization, dissemination and preservation of cultural heritage is taking place in Europe and the United States, which involves all types of cultural institutions, ie, galleries, libraries, museums, archives and all types of cultural content. The development of Europeana, as a single point of access to European Cultural Heritage, has probably been the most important result of the activities in the field till now. Semantic interoperability is a key issue in these developments. This paper presents a system that provides content providers and users with the ability to map, in an effective way, their own metadata schemas to common domain standards and the Europeana (ESE, EDM) data models. Based on these mappings, semantic enrichment and query answering techniques are proposed as a means for providing effective access of users to digital cultural heritage. An experimental study is …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Semantic adaptation of neural network classifiers in image segmentation",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87536-9_93",
            "Abstract": "Semantic analysis of multimedia content is an on going research area that has gained a lot of attention over the last few years. Additionally, machine learning techniques are widely used for multimedia analysis with great success. This work presents a combined approach to semantic adaptation of neural network classifiers in multimedia framework. It is based on a fuzzy reasoning engine which is able to evaluate the outputs and the confidence levels of the neural network classifier, using a knowledge base. Improved image segmentation results are obtained, which are used for adaptation of the network classifier, further increasing its ability to provide accurate classification of the specific content.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Progressive semantic query answering",
            "Publication year": 2010,
            "Publication url": "http://people.csail.mit.edu/pcm/tempISWC/workshops/SSWS2010/SSWS2010-Proceedings.pdf#page=116",
            "Abstract": "Ontology-based semantic query answering algorithms suffer from high computational complexity and become impractical in most cases that OWL is used as a framework for data access in the Semantic Web. For this reason, most semantic query answering systems prefer to lose some possible correct answers of user queries rather than being irresponsible. Here, we present a method that follows an alternative direction that we call progressive semantic query answering. The idea is to start giving the most relevant correct answers to the user query as soon as possible and continue by giving additional answers with decreasing relevance until you find all the correct answers. We first present a systematic analysis that formalises the notion of answer relevance and that of query answering sequences that we call strides, providing a formal framework for progressive semantic query answering. Then, we describe a practical algorithm performing sound and complete progressive query answering for the W3C’s OWL 2 QL Profile.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy OWL: Uncertainty and the Semantic Web",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=13526048335811025481&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable querying services over fuzzy ontologies",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1367497.1367575",
            "Abstract": "Fuzzy ontologies are envisioned to be useful in the Semantic Web. Existing fuzzy ontology reasoners are not scalable enough to handle the scale of data that the Web provides. In this paper, we propose a framework of fuzzy query languages for fuzzy ontologies, and present query answering algorithms for these query languages over fuzzy DL-Lite ontologies. Moreover, this paper reports on implementation of our approach in the fuzzy DL-Lite query engine in the ONTOSEARCH2 system and preliminary, but encouraging, benchmarking results. To the best of our knowledge, this is the first ever scalable query engine for fuzzy ontologies.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resolution of composite fuzzy relation equations based on Archimedean triangular norms",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165011499001177",
            "Abstract": "Lately, the sup-t-norm composition of fuzzy relations has been used instead of the well-known max–min. Thus, there is a need for methods of studying and solving sup-t-norm fuzzy relation equations (t is any t-norm). In this paper, the solution existence problem is first studied and solvability criteria for composite fuzzy relation equations of any t-norm are given. Then, a methodology for solving fuzzy relation equations based on sup-t composition, where t is an Archimedean t-norm, is proposed. This resolution method is simpler and faster than those proposed for covering all the continuous t-norms. The result is important, since, as is shown in the paper, the only continuous t-norm that is not Archimedean is the “minimum”.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:IjCSPb-OGe4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Semantic and Reasoning Systems for Cities and Citizens",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10587-1_9",
            "Abstract": "The Semantic Web is finally leaving the lab. In this article, we examine some practical, industry-oriented Semantic Web systems and discuss the costs and benefits on this disruptive technology. We focus on applications for cities and citizens and present a set of key challenges and solutions made possible using semantics at scale. When applicable, we report on the differentiating factors for Semantic Technologies, showcasing their unique capabilities, as well as the cost of this paradigm shift.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:g3aElNc5_aQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "CrowdHeritage: Crowdsourcing for Improving the Quality of Cultural Heritage Metadata",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/986080",
            "Abstract": "The lack of granular and rich descriptive metadata highly affects the discoverability and usability of cultural heritage collections aggregated and served through digital platforms, such as Europeana, thus compromising the user experience. In this context, metadata enrichment services through automated analysis and feature extraction along with crowdsourcing annotation services can offer a great opportunity for improving the metadata quality of digital cultural content in a scalable way, while at the same time engaging different user communities and raising awareness about cultural heritage assets. To address this need, we propose the CrowdHeritage open end-to-end enrichment and crowdsourcing ecosystem, which supports an end-to-end workflow for the improvement of cultural heritage metadata by employing crowdsourcing and by combining machine and human intelligence to serve the particular requirements of the cultural heritage domain. The proposed solution repurposes, extends, and combines in an innovative way general-purpose state-of-the-art AI tools, semantic technologies, and aggregation mechanisms with a novel crowdsourcing platform, so as to support seamless enrichment workflows for improving the quality of CH metadata in a scalable, cost-effective, and amusing way. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "CultureLabs: Cultural heritage and digital technology at the service of social innovation",
            "Publication year": 2019,
            "Publication url": "http://shura.shu.ac.uk/25107/",
            "Abstract": "Studies and practice in the cultural field have long acknowledged the importance of participatory approaches for engaging visitors of cultural institutions, however, it is only recently that we are talking about steps to connecting institutional heritage with civic initiatives that can aid social cohesion and community empowerment. In dialogue with ongoing practices in this context, CultureLabs aims to develop novel methodologies and digital tools that can facilitate the organisation and wider deployment of participatory projects around cultural her - itage, focusing on the social inclusion of disadvantaged groups, and particularly of migrant communities. As a first step in this process, the CultureLabs team has conducted a series of interviews and surveys with the aim to identify and analyse the organisational needs and lessons learnt by different actors from the cultural, social, educational and public administration fields as well as the needs and viewpoints of different migrant communities. These needs have guided the design of an innovative online platform which seeks to offer a number of services for supporting more efficient and participatory governance of cultural heritage on one hand and for enabling inclusive and creative interactions with digital cultural heritage on the other. The CultureLabs platform will allow multiple and diverse stakeholders to discover and combine differ - ent resources and elements of best practices, the \"ingredients\", in order to form new \"recipes\" for social innovation according to their own needs and objectives.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:ClCfbGk0d_YC",
            "Publisher": "CEUR Workshop Proceedings"
        },
        {
            "Title": "A string metric for ontology alignment",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11574620_45",
            "Abstract": "Ontologies are today a key part of every knowledge based system. They provide a source of shared and precisely defined terms, resulting in system interoperability by knowledge sharing and reuse. Unfortunately, the variety of ways that a domain can be conceptualized results in the creation of different ontologies with contradicting or overlapping parts. For this reason ontologies need to be brought into mutual agreement (aligned). One important method for ontology alignment is the comparison of class and property names of ontologies using string-distance metrics. Today quite a lot of such metrics exist in literature. But all of them have been initially developed for different applications and fields, resulting in poor performance when applied in this new domain. In the current paper we present a new string metric for the comparison of names which performs better on the process of ontology alignment as well as …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Incremental query rewriting for OWL 2 QL",
            "Publication year": 2012,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.367.7027&rep=rep1&type=pdf#page=365",
            "Abstract": "A key application of Description-Logic based ontologies is Ontology-Based Data Access (OBDA)[9]. In such scenarios a TBox is used to describe the schema of the application while answers to conjunctive queries reflect both the schema and the data. Unfortunately, it is well-known that conjunctive query (CQ) answering over expressive Description Logics (DLs) is of very high computational complexity [7, 5].The need for efficient query answering has motivated the development of (families of) lightweight ontology languages, such as the DL-Lite family [3, 2]. Query answering in these languages is usually performed via a technique called query rewriting. According to this technique, a query and a DL-Lite ontology are transformed into a union of conjunctive queries (often called a UCQ rewriting) such that, the answers of the union of conjunctive queries over the input data and discarding the ontology are precisely the answers of the original query over the data and the ontology.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image Annotation on the Semantic Web. W3C Incubator Group Report 14 August 2007",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7020564662101693342&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:b1wdh0AR-JQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A hybrid intelligence system for facial expression recognition",
            "Publication year": 2002,
            "Publication url": "http://www.image.ntua.gr/papers/205.pdf",
            "Abstract": "This paper presents an experimental study dealing with facial expression recognition which examines the appropriateness of a hybrid intelligence architecture for subsymbolic to symbolic mapping. The facial expression recognition enhances interactivity and assists human-computer interaction issues, letting the system become accustomed to the current needs and feelings of the user. Actual application of this technology is expected in educational environments, 3D video conferencing and collaborative workplaces, online shopping and gaming, virtual communities and interactive entertainment.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advancing the terminological classification of semi-structured documents",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7372154/",
            "Abstract": "Usually, documents are given in textual form, accompanied by a set of terminological classifications (metadata), based on vocabularies of domain ontologies. This paper presents a novel method for advancing the above classification, by extracting more properties of the analyzed documents. We first extract additional roles from the textual part and together with roles extracted from the ontology statements, we construct an extended document vector representation. We then introduce a pruning algorithm that, for a given document collection, merges concepts of the ontology to produce classes with a sufficient number of corresponding instances. We then classify the documents to ontology classes using the Stanford linear Classifier. Finally, we propose an algorithm that assigns additional concept labels to documents, using the output of the classifier. Our system is evaluated in a set of real data and ontological …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fuzzy data fusion for multiple cue image and video segmentation",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-36420-7_9",
            "Abstract": "Fusion of multiple cue image partitions is described as an indispensable tool towards the goal of automatic object-based image and video segmentation, interpretation and coding. Since these tasks involve human cognition and knowledge of image semantics, which are absent in most cases, fusion of all available cues is crucial for effective segmentation of generic video sequences. This chapter investigates fuzzy data fusion techniques which are capable of integrating the results of multiple cue segmentation and provide time consistent spatiotemporal image partitions corresponding to moving objects.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Reasoning with the Fuzzy Description Logic f-: Theory, Practice and Applications",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-89765-1_16",
            "Abstract": "The last couple of years it is widely acknowledged that uncertainty and fuzzy extensions to ontology languages, like Description Logics (DLs) and OWL, could play a significant role in the improvement of many Semantic Web (SW) applications. Many of the tasks of SW like trust, matching, merging, ranking usually involve confidence or truth degrees that one requires to represent and reason about. Fuzzy DLs are able to represent vague concepts such as a “Tall” person, a “Hot” place, a “MiddleAged” person, a “near” destination and many more. In the current paper we present a fuzzy extension to the DL . First, we present the semantics while latter a detailed reasoning algorithm that decides most of the key inference tasks of fuzzy-. Finally, we briefly present the fuzzy reasoning system FiRE, which implements the proposed algorithm and two use case scenarios where we have applied fuzzy DLs …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Semantic representation of multimedia content",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20795-2_2",
            "Abstract": "Multimedia documents constitute extremely rich information resources, whose efficacious management is intertwined with the effective capturing of the underlying semantics. The conveyed meaning may span along multiple levels and relates to search and retrieval tasks, much as to the very extraction and interpretation of content descriptions. In this chapter we consider the formal representation of multimedia semantics that pertain to media and domain specific descriptions, for the purpose of supporting both the extraction and subsequent semantic management of such descriptions. To this end, firstly, we present first an overview of existing approaches to the representation of multimedia content and discuss open issues. Subsequently, we present the ontology infrastructure developed in the context of the BOEMIE project tailored towards the formal representation of multimedia content. Concluding, we present …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Expressive reasoning with horn rules and fuzzy description logics",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72982-2_4",
            "Abstract": "This essay describes fuzzy CARIN, a knowledge representation language combining fuzzy description logics with Horn rules. Fuzzy CARIN integrates the management of fuzzy logic into the non-recursive CARIN system. It provides a sound and complete algorithm for representing and reasoning about fuzzy  extended with non-recursive Horn rules. Such an extension is most useful in realistic applications dealing with uncertainty and imprecision, such as multimedia processing and medical applications. Additionally, it provides the ability of answering to union of conjunctive queries, which is a novelty not previously addressed by fuzzy DL systems.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Classifying Fuzzy Subsumption in Fuzzy-SC",
            "Publication year": 2008,
            "Publication url": "http://ceur-ws.org/Vol-353/StoilosStamouPan.pdf",
            "Abstract": "Fuzzy Description Logics (f-DLs) have been proposed as extensions of classical Description Logics able to handle imprecise and vague knowledge. Although several extensions to expressive DLs have been proposed today and many reasoning algorithms exist there is still no scalable and efficient reasoning system reported, mainly due to inherited computational complexity from crisp DLs and the lack for optimisation techniques for fuzzy DL reasoning algorithms. Following the paradigm of classical DLs, fuzzy extensions to tractable DLs have been proposed. In the current paper we present a fuzzy extension to the tractable DL EL+, creating f-EL+. Besides the syntax and the extended semantics we also provide a reasoning algorithm for f-EL+. Interestingly, our algorithm supports classification over fuzzy subsumption for which scalable reasoning is not known.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reasoning Web. Reasoning and the Web in the Big Data Era: 10th International Summer School 2014, Athens, Greece, September 8-13, 2014. Proceedings",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=x8VpBAAAQBAJ&oi=fnd&pg=PP5&dq=info:8sCgwtwSbssJ:scholar.google.com&ots=7uf-Q-eIJv&sig=8epQsXbc5_cMiaUAuDY8GIeiivI",
            "Abstract": "This volume contains the lecture notes of the 10th Reasoning Web Summer School 2014, held in Athens, Greece, in September 2014. In 2014, the lecture program of the Reasoning Web introduces students to recent advances in big data aspects of semantic web and linked data, and the fundamentals of reasoning techniques that can be used to tackle big data applications.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:PELIpwtuRlgC",
            "Publisher": "Springer"
        },
        {
            "Title": "Fuzzy semantic association of multimedia document descriptions",
            "Publication year": 2001,
            "Publication url": "http://www.image.ntua.gr/papers/184.pdf",
            "Abstract": "According to the emerging MPEG-7 standard, the semantic description of multimedia documents is expressed in terms of semantic entities such as objects, events, concepts, and fuzzy relationships among them. The above semantic entities can be used as index terms, in order to support the semantic search process. In this paper, we propose a method that associates the semantic entities with the aid of a fuzzy thesaurus. The proposed method is based on fuzzy relations and fuzzy reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Correction\" The electronic road: personalized content browsing\"",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1261107/",
            "Abstract": "Correction \"The electronic road: personalized content browsing\" Page 1 Correction In the \nJuly–September 2003 issue, the article “Internet Delivery of MPEG-4 Object-Based Multimedia” \nby Yasser Pourmohammadi-Fallah, Kambiz Asrar-Haghighi, and Hussein Alnuweiri showed \nthe three boxes in Figure 2, p. 70, labeled as “Compression layer.” The correct version is \nreprinted here. IEEE MultiMedia regrets this error. 53 January–March 2004 Compression layer \nSync layer Delivery layer Media-aware, delivery-unaware ISO/IEC 14496-3 audio ISO/IEC \n14496-2 visual Media-unaware, delivery-unaware ISO/IEC 14496-1 system Media-unaware, \ndelivery-aware ISO/IEC 14496-6 system Elementary stream interface (ESI) DMIF application \ninterface (DAI) Figure 2. MPEG-4 terminal architecture. Correction In the October–December \n2003 issue—in the article “The Electronic Road: Personalized Content Browsing” by Manolis , ’…",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "D2. 5.3 Report on Implementation and Optimisation Techniques for Ontology Query Systems",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/44067378/D2._5.3_Report_on_Implementation_and_Opt20160324-890-1o4f1ca.pdf",
            "Abstract": "EU-IST Network of Excellence (NoE) IST-2004-507482 KWEB Deliverable D2. 5.3 (WP2. 5)",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:VLnqNzywnoUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy OWL: Uncertainty and the Semantic Web.",
            "Publication year": 2005,
            "Publication url": "http://www.image.ntua.gr/papers/398.pdf",
            "Abstract": "In the Semantic Web context information would be retrieved, processed, shared, reused and aligned in the maximum automatic way possible. Our experience with such applications in the Semantic Web has shown that these are rarely a matter of true or false but rather procedures that require degrees of relatedness, similarity, or ranking. Apart from the wealth of applications that are inherently imprecise, information itself is many times imprecise or vague. For example, the concepts of a “hot” place, an “expensive” item, a “fast” car, a “near” city, are examples of such concepts. Dealing with such type of information would yield more realistic, intelligent and effective applications. In the current paper we extend the OWL web ontology language, with fuzzy set theory, in order to be able to capture, represent and reason with such type of information.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A deep-learning approach for multi-temporal savannah woody vegetation density assessment with Earth Observation data",
            "Publication year": 2019,
            "Publication url": "http://e-space.mmu.ac.uk/id/eprint/622305",
            "Abstract": "Bush encroachment in African savannahs has been identified as a land degradation process, mainly due to the detrimental effect it has on small pastoralist communities. Mapping and monitoring the extent covered by the woody component in savannahs has therefore become the focus of recent remote sensing-based studies. This is mainly due to the large spatial scale that the process of woody vegetation encroachment is related with and the fact that appropriate remote sensing data are now available free of charge. However, due to the nature of savannahs and the mixture of land cover types that commonly make up the signal of a single pixel, simply mapping the presence/absence of woody vegetation is somewhat limiting: it is more important to know whether an area is undergoing an increase in woody cover, ever if it is not the dominant cover type. More recent efforts have, therefore, focused in mapping the fraction of woody vegetation, which, clearly, is much more challenging. This paper proposes a methodological framework for mapping savannah woody vegetation and monitoring its evolution though time, based on very high-resolution data and multi-temporal medium-scale satellite imagery. We tested our approach in a South African savannah region, the Northwest Province (>100,000 km2), 0.5m-pixel aerial photographs for sampling and validation and Landsat data. We first mapped presence/absence of woody vegetation using samples selected over 5x5 km aerial photo subsets acquired between 2009 and 2013 and a Random Forest classifier. We then used these estimates to train a U-Net Convolutional Neural Network to produce …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 5.6: Fuzzy reasoning extensions",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=6077253972140809169&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semantic unification of heterogenous multimedia archives",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812704337_0104",
            "Abstract": "Multimedia Content is described via textual, semantic and structural Descriptors and Description Schemes, as introduced in MPEG-7. The semantic part of the description is closer to what the user expects from a multimedia search engine, however it poses difficulties, because of the potential incompatibility of the semantic entities among different archives. In this paper, we present FAETHON, a system that unifies the semantic description of heterogeneous archives, through the use of a semantic encyclopaedia.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Genre Recognition from Symbolic Music with CNNs",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-72914-1_7",
            "Abstract": "In this work we study the use of convolutional neural networks for genre recognition in symbolically represented music. Specifically, we explore the effects of changing network depth, width and kernel sizes while keeping the number of trainable parameters and each block’s receptive field constant. We propose an architecture for handling MIDI data which makes use of multiple resolutions of the input, called MuSeReNet - Multiple Sequence Resolution Network. Through our experiments we significantly outperform the state-of-the-art for MIDI genre recognition on the topMAGD and MASD datasets.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:0izLItjtcgwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Semantic Representation, Enrichment, and Retrieval of Audiovisual Film Content",
            "Publication year": 2015,
            "Publication url": "https://www.taylorfrancis.com/chapters/semantic-representation-enrichment-retrieval-audiovisual-film-content-alexandros-chortaras-stefanos-kollias-kostas-rapantzikos-giorgos-stamou/e/10.1201/b18681-19",
            "Abstract": "Digital signal processing is ubiquitous. It is an essential ingredient in many of today's electronic devices, ranging from medical equipment to weapon systems. It makes the difference between dumb and intelligent systems. This book is organized into five parts:(1) Introduction, which contains an account of Prof. Constantinides' contribution to the",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:4hFrxpcac9AC",
            "Publisher": "Jenny Stanford Publishing"
        },
        {
            "Title": "Representation of user preferences and adaptation to context in multimedia content–based retrieval",
            "Publication year": 2002,
            "Publication url": "http://image.ntua.gr/iva/files/Representation%20of%20user%20preferences%20and%20adaptation%20to%20context%20in%20multimedia%20content%20--%20based%20retrieval%20-%20M.%20Wallace2002.pdf",
            "Abstract": "The task of content–based retrieval is to provide users with the multimedia documents that best match their wishes. This process is not free of uncertainty; the role of the user profile is to remove a part of this uncertainty, using the information it contains concerning the user’s preferences, and thus improve the precision. For this aim MPEG-7 introduced description schemes representing users’ preferences and tools supporting user interaction. In this paper, using a formal representation of user preferences and a semantic knowledge base, we expand the user profile representation introduced in MPEG-7 in order to acquire more semantic information about the user. Furthermore, using the notion of context, we identify the part of the profile that is related to the user’s query, thus preventing irrelevant interests from affecting the process of content–based retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reformulating Ontological Queries Using Materialised Rewritings",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2912845.2912867",
            "Abstract": "Query rewriting is a prominent technique in ontology-based data access (OBDA) applications. Roughly speaking, a rewriting of a query Q wrt an ontology is another query Q'that can be directly evaluated over the data without further reference to the input ontology. In this paper, we observe that many OBDA applications could significantly benefit from precomputing rewritings for certain queries. For example, in query optimisation, materialised rewritings of frequently asked queries can be used to speed up the query reformulation process. Moreover, in systems where users have different levels of access to information, materialised rewritings for the views assigned to each user can be exploited to obtain the set of answers to the input query derivable from the assigned views. Consequently, we investigate the problem of reformulating a query given a set of materialised rewritings and present a practical algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptation of weighted fuzzy programs",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11840930_5",
            "Abstract": "Fuzzy logic programs are a useful framework for handling uncertainty in logic programming; nevertheless, there is the need for modelling adaptation of fuzzy logic programs. In this paper, we first overview weighted fuzzy programs, which bring fuzzy logic programs and connectionist models closer together by associating significance weights with the atoms of a logic rule: by exploiting the existence of weights, it is possible to construct a neural network model that reflects the structure of a weighted fuzzy program. Based on this model, we then introduce the weighted fuzzy program adaptation problem and propose an algorithm for adapting the weights of the rules of the program to fit a given dataset.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Scalable Reasoning with Tractable Fuzzy Ontology Languages",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/scalable-fuzzy-algorithms-data-management/38567",
            "Abstract": "The last couple of years it is widely acknowledged that uncertainty and fuzzy extensions to ontology languages, like description logics (DLs) and OWL, could play a significant role in the improvement of many Semantic Web (SW) applications like matching, merging and ranking. Unfortunately, existing fuzzy reasoners focus on very expressive fuzzy ontology languages, like OWL, and are thus not able to handle the scale of data that the Web provides. For those reasons much research effort has been focused on providing fuzzy extensions and algorithms for tractable ontology languages. In this chapter, the authors present some recent results about reasoning and fuzzy query answering over tractable/polynomial fuzzy ontology languages namely Fuzzy DL-Lite and Fuzzy EL+. Fuzzy DL-Lite provides scalable algorithms for very expressive (extended) conjunctive queries, while Fuzzy EL+ provides polynomial …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:yD5IFk8b50cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Specification of coordination of rule and ontology languages",
            "Publication year": 2004,
            "Publication url": "https://web.comlab.ox.ac.uk/files/1871/Rules.pdf",
            "Abstract": "EU-IST Network of Excellence (NoE) IST-2004-507482 KWEB Deliverable D2. 5.1 (WP2. 5)We provide a unified framework in which the existing (and future) proposals of integrating different sorts of rule based language with the OWL DL Web ontology language can be compared. We are in particular interested in the axiom-based approach, as the SWRL proposal is a special case of it. We identify serval decidable sub-languages of SWRL with their complexity results and further explore several (including datatype predicate, fuzzy and context) extensions of SWRL.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:dTyEYWd-f8wC",
            "Publisher": "The Knowledge Web project"
        },
        {
            "Title": "Image annotation on the semantic web",
            "Publication year": 2007,
            "Publication url": "https://dspace.lib.ntua.gr/xmlui/handle/123456789/27920",
            "Abstract": "Image annotation on the semantic web Αρχική Σελίδα → Κεντρική Βιβλιοθήκη ΕΜΠ→ \nΙδρυματικό Αποθετήριο → Δημοσιεύσεις μελών ΔΕΠσε περιοδικά → Εμφάνιση Τεκμηρίου HEAL \nDSpace Image annotation on the semantic web Αποθετήριο DSpace/Manakin Image \nannotation on the semantic web Troncy, R; Ossenbruggen, J; Pan, J; Stamou, G; Halaschek-Wiener, \nC; Simou, N; Tsouvaras, V URI: http://hdl.handle.net/123456789/27920 Ημερομηνία: 2007 \nΕμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή \nΔεν υπάρχουν αρχεία που σχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην \nακόλουθη συλλογή(ές) Δημοσιεύσεις μελών ΔΕΠσε περιοδικά Περιήγηση Σε όλο το DSpace \nΚοινότητες & Συλλογές Ανά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Αυτή η Συλλογή \nΑνά Ημερομηνία Εκδοσης Συγγραφείς Τίτλοι Θέματα Ο Λογαριασμός μου Σύνδεση Εγγραφή / - …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:MLfJN-KU85MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reasoning Web",
            "Publication year": 2014,
            "Publication url": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_2081981",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer"
        },
        {
            "Title": "On horn conjunctive queries",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-99906-7_8",
            "Abstract": "Most query rewriting systems focus on answering Conjunctive Queries that have only positive atoms because the use of negation can easily make the entailment problem undecidable. However, restricting the way we use negation on Conjunctive Queries can make the entailment problem decidable and can also ensure the existence of algorithms based on Query Rewriting that find their answers. In this paper, we propose a definition of Horn Conjunctive Queries to denote queries that have one negated atom. We also present an algorithm based on query rewriting that finds the answers of a Union of Horn Conjunctive Queries with respect to a set of Existential Rules. Additionally, we conduct some experiments to compare the performance with other state of the art systems that are able to answer conjunctive queries with negation using tableaux algorithms. The experimental data confirms that our system …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:i2xiXl-TujoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "D2. 5.1 Specification of Coordination of Rule and Ontology Languages",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=12825860902229236254&hl=en&oi=scholarr",
            "Abstract": "EU-IST Network of Excellence (NoE) IST-2004-507482 KWEB Deliverable D2. 5.1 (WP2. 5)We provide a unified framework in which the existing (and future) proposals of integrating different sorts of rule based language with the OWL DL Web ontology language can be compared. We are in particular interested in the axiom-based approach, as the SWRL proposal is a special case of it. We identify serval decidable sub-languages of SWRL with their complexity results and further explore several (including datatype predicate, fuzzy and context) extensions of SWRL.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:fEOibwPWpKIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multimedia Annotations and the Semantic Web. SemanticWeb Case Studies and Best Practices for eBusiness",
            "Publication year": 2005,
            "Publication url": "https://www.narcis.nl/publication/RecordID/oai:cwi.nl:16362",
            "Abstract": "Multimedia Annotations and the Semantic Web. SemanticWeb Case Studies... (2005) | www.narcis.nl \nKNAW KNAW Narcis Back to search results CWI Publication Multimedia Annotations and the \nSemantic Web. SemanticWeb Case Studies... (2005) Pagina-navigatie: Main Save publication \nSave as MODS Export to Mendeley Save as EndNote Export to RefWorks Title Multimedia \nAnnotations and the Semantic Web. SemanticWeb Case Studies and Best Practices for \neBusiness Author JR van Ossenbruggen (Jacco); G. Stamou; JZ Pan (Jeff) Supporting host \nHuman-centered Data Analysis Date issued 2005-01-01 Access Closed Access Language \nEnglish Type Conference Paper Publication https://ir.cwi.nl/pub/16362 OpenURL Search this \npublication in (your) library Persistent Identifier urn:NBN:nl:ui:18-16362 Metadata XML Source \nCWI Go to Website Navigation: Home about narcis login Nederlands contact Anna van .…",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synthesis and applications of lattice image operators based on fuzzy norms",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/959068/",
            "Abstract": "We use concepts from the lattice-based theory of morphological operators and fuzzy sets to develop generalized lattice image operators that can be expressed as nonlinear convolutions that are suprema or infima of fuzzy intersection or union norms. Our emphasis (different from previous works) is the construction of pairs of fuzzy dilation and erosion operators that form lattice adjunctions. This guarantees that their composition will be a valid algebraic opening or closing. The power, but also the difficulty, in applying these fuzzy operators to image analysis is the large variety of fuzzy norms and the absence of systematic ways in selecting them. Towards this goal, we have performed extensive experiments in applying these fuzzy operators to various nonlinear filtering and image analysis tasks, attempting first to understand the effect that the type of fuzzy norm and the shape/size of the structuring function has on the …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Specification of a common framework for characterizing alignment",
            "Publication year": 2005,
            "Publication url": "https://corescholar.libraries.wright.edu/cse/239/",
            "Abstract": "Definition of a common framework for characterizing alignment of heterogeneous information. This report describes various approaches towards this goal and shows the relations between them. It also provides a description of the alignment sructure and process.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient query answering over fuzzy dl-lite ontologies",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=2489263332953780343&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive rule-based recognition of events in video sequences",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1246753/",
            "Abstract": "Knowledge-based fuzzy inference and neural learning are used in this paper in order to model the event recognition task in semantic video analysis. The advantage of their use is the symbolic nature of the representation of the knowledge concerning the events to be recognized. Moreover, this knowledge can be adapted with the aid of data taken from video sequences. The proposed system has been tested in soccer video sequences for detecting some complex predetermined (and represented in the form of rules) events.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Connectionist weighted fuzzy logic programs",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0925231208002087",
            "Abstract": "Fuzzy logic programs are a useful framework for imperfect knowledge representation and reasoning using the formalism of logic programming. Nevertheless, there is the need for modeling adaptation of fuzzy logic programs, so that machine learning techniques, such as connectionist-based learning, can be applied. Weighted fuzzy logic programs bring fuzzy logic programs and connectionist models closer together by associating a significant weight with each atom in the body of a fuzzy rule: by exploiting the existence of the weights, it is possible to construct a connectionist model that reflects the exact structure of a weighted fuzzy logic program. Based on the connectionist representation, we first define the weight adaptation problem as the task of adapting the weights of the rules of a weighted fuzzy logic program, so that they fit best a set of training data, and then we develop a subgradient descent learning …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:70eg2SAEIzsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Semantic enrichment of documents: a classification perspective for ontology-based imbalanced semantic descriptions",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10115-021-01615-y",
            "Abstract": "This article presents a novel framework for the semantic enrichment of documents, exploiting the hierarchical ontological knowledge of a domain in conjunction with classification techniques. The main contributions of this work are fourfold: (a) a well-defined theoretical model for the semantic representation and enrichment of documents is defined, (b) a method for dealing with the problem of class imbalance is outlined, based on the transformation of the document representations into more balanced ones, (c) a methodology is proposed for assigning semantic labels in those cases where it is hard to decide which label fits best and (d) a set of novel metrics for evaluating the performance of the suggested framework are introduced. The extensive experimental procedure that follows, conducted on two popular datasets, exhibits promising results and constitutes a proof of the robustness of the overall approach.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:DUooU5lO8OsC",
            "Publisher": "Springer London"
        },
        {
            "Title": "Multimedia analysis and annotation requirements for the semantic web",
            "Publication year": 2005,
            "Publication url": "https://digital-library.theiet.org/content/conferences/10.1049/ic.2005.0771",
            "Abstract": "The Semantic Web is about adding formal structure and explicit semantics to web content for the purpose of more efficient information management and access by both humans and computers. Through the use of machine understandable semantics, web resources become much easier and more readily accessible. Populating the Semantic Web with multimedia metadata requires for appropriate technologies to support both the analysis (metadata extraction) and the annotation (metadata creation) processes. The media- and content-specific semantics of multimedia resources pose great challenges in terms of capturing and manipulating the two layer semantics given the available knowledge representation formalisms. The Knowledge Web project, advancing ontology technology research efforts and ensuring transferring the semantic web from academia to industry, has provided solutions to some of the most …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Query extensions and incremental query rewriting for OWL 2 QL ontologies",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s13740-012-0017-6",
            "Abstract": " Query rewriting over lightweight ontologies, like DL-Lite ontologies, is a prominent approach for ontology-based data access. It is often the case in realistic scenarios that users ask an initial query which they later refine, e.g., by extending it with new constraints making their initial request more precise. So far, all DL-Lite systems would need to process the new query from scratch. In this paper, we study the problem of computing the rewriting of an extended query by ‘extending’ a previously computed rewriting of the initial query and avoiding recomputation. Interestingly, our approach also implies a novel algorithm for computing the rewriting of a fixed query. More precisely, the query can be ‘decomposed’ into its atoms and then each atom can be processed incrementally. We present detailed algorithms, several optimisations for improving the performance of our query rewriting algorithm, and finally …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Context—Sensitive Query Expansion Based on Fuzzy Clustering of Index Terms",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36109-X_1",
            "Abstract": "Modern Information Retrieval Systemsmatic h the termscontained in a user’squery with available documentsthrough the use of an index. In thisw ork, we propose a method for expanding the query with its associated terms, in order to increase the system recall. The proposed method is based on a novel fuzzy clustering of the index terms, using their common occurrence in documentsasclus tering criterion. The clusters which are relevant to the termsof the query form the query context. The termsof the clustersthat belong to the context are used to expand the query. Clusters participate in the expansion according to their degree of relevance to the query. Precision of the result is thus improved. This statistical approach for query expansion is useful when no a priori semantic knowledge is available.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Reformulating ontological queries using materialised rewritings",
            "Publication year": 2016,
            "Publication url": "https://ora.ox.ac.uk/objects/uuid:1ab08560-5a81-4f6e-a23b-02eab9f8b5bb",
            "Abstract": "Query rewriting is a prominent reasoning technique in ontologybased data access (OBDA) applications. Roughly speaking, a rewriting of a query Q w.r.t. an ontology is another query Q^1 that can be directly evaluated over the data without further reference to the input ontology. In this paper, we observe that many OBDA applications could significantly benefit from precomputing rewritings for certain queries. For example, in query optimisation, materialised rewritings of frequently asked queries can be used to speed up the query reformulation process. Moreover, in systems where users have different levels of access to information, materialised rewritings for the views assigned to each user can be exploited to obtain the set of answers to the input query derivable from the assigned views. Consequently, we investigate the problem of reformulating a query given a set of materialised rewritings and present a practical algorithm. Subsequently, we use our approach to design a fully edged query rewriting algorithm which can exploit materialised rewritings to speed up the rewriting process. Our experimental results confirm the potential of our technique in practice.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Association of Computing Machinery"
        },
        {
            "Title": "Semantic classification of byzantine icons",
            "Publication year": 2009,
            "Publication url": "https://www.academia.edu/download/57740836/clasificarea_semantica_a_icoanei_bizantine.pdf",
            "Abstract": "Byzantine Iconography Byzantine art refers to the art of Eastern Orthodox states that were concurrent with the Byzantine Empire. Certain artistic traditions born in the Byzantine Empire, particularly regarding icon painting and church architecture, have continued in Greece, Bulgaria, Russia, and other Eastern Orthodox countries up to the present. The icons usually depict sacred figures from the Christian faith, such as Jesus, the Virgin Mary, the apostles, and the saints. At the beginning of the 17th century, iconography manuals represented the most important source of inspiration for icon painters. The 16th-century monk Dionysios from Fourna is credited as the author of the prototypical manual, Interpretation of the Byzantine Art. 2 In it, he defines the rules and iconographic patterns that painters still use to create icons.Byzantine iconography follows a unique convention of painting. The artistic language of Byzantine painters is characterized by apparent simplicity, overemphasized flatness, unreal and symbolic colors, lack of perspective, and strange proportions. The sacred figures are set beyond real time and real space through the use of gold backgrounds. The most important figure in an icon is depicted frontally, focusing on the eyes, facial expression, and hands. Clarity is the rule, not only in describing shapes but also in arranging figures in balanced compositions so that the narrative’s actions are clear. The figures have large eyes, enlarged ears, long, thin noses, and small mouths, each painted following specific rules.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Image annotation on the semantic web",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11423978645258309131&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "f-DLPs: Extending description logic programs with fuzzy sets and fuzzy logic",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4295599/",
            "Abstract": "The Semantic Web can be viewed as largely about \"Knowledge meets the Web\". Thus its vision includes ontologies and rules. A key requirement for the architecture of the Semantic Web is to be able to layer \"rules on top of ontologies\" and \"ontologies on top of rules\". This has as a counterpart the definition of a mapping between Description Logics and Logic Programming, which is known as Description Logic Programs. In this paper we extend the Description Logic Programs with fuzzy sets and fuzzy logic in order to be able to represent the imprecision and vagueness of real-life applications. We provide the common semantics of the mapping, and the conditions that must be met for this semantic equivalence, based on the model-theoretic semantics.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Query rewriting under ontology contraction",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33203-6_13",
            "Abstract": "Conjunctive query (CQ) answering is a key reasoning service for ontology-based data access. One of the most prominent approaches to conjunctive query answering is query rewriting where a wide variety of systems has been proposed the last years. All of them accept as input a fixed CQ q and ontology  and produce a rewriting for . However, in many real world applications ontologies are very often dynamic—that is, new axioms can be added or existing ones removed frequently. In this paper we study the problem of computing a rewriting for a CQ over an ontology that has been contracted (i.e., some of its axioms have been removed) given a rewriting for the input CQ and ontology. Our goal is to compute a rewriting directly from the input rewriting and avoid computing one from scratch. We study the problem theoretically and provide sufficient conditions under which this process is possible. Moreover …",
            "Abstract entirety": 0,
            "Author pub id": "R3y5dxMAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Report on query language design and standardisation",
            "Publication year": 2004,
            "Publication url": "https://www.sti-innsbruck.at/sites/default/files/D2.5.2.pdf",
            "Abstract": "EU-IST Network of Excellence (NoE) IST-2004-507482 KWEB Deliverable D2. 5.2 (WP2. 5)In the progress of realising the Semantic Web, developing and supporting Semantic Web query languages are among the most useful and important research problems. In [PFT+04], we have provided a unified framework for OWL-based rule and query languages. In this report, we focus on the problems of query answering for Semantic Web query languages (such as RDF, OWL DL and OWL-E) in the OWL-QL specification.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:a0OBvERweLwC",
            "Publisher": "The Knowledge Web project"
        },
        {
            "Title": "Fuzzy querying over fuzzy-DL-Lite",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=12668482938920062047&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Introducing Customised Datatypes and Datatype Predicates into {OWL}",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=1183473986543748970&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer"
        },
        {
            "Title": "Heuristics for Evaluation of AI Generated Music",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9413310/",
            "Abstract": "Evaluation of generative AI is a difficult problem, especially in artistic domains in which aesthetic qualities of generated samples are to an extent subjective, such as in music. The most widely accepted method for evaluating such models is to conduct a survey of users, which is a resource intensive process. In this work we propose a framework for cheaply evaluating generative models in the symbolic music domain by utilizing tools from music theory, such as the circle of fifths, with the goal of producing quantifiable metrics which reflect the “musicality” of a written score or MIDI file.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:HtEfBTGE9r8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Semi-automatic extraction of semantics from football video sequences",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_51",
            "Abstract": "In this paper we use a knowledge based inference model in combination with knowledge stored in a domain specific ontologies to organize and combine semantically-related entities, within multimedia documents in order to extract semantics from video sequences. The simulation results demonstrate that is possible to extract high-level information from video if low-level features are extracted with high precision. Within the scope of this work we are not particularly interested in the method by which the low level features are extracted from the video.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "OWL Query Answering Based on Query Extension.",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.661.6563&rep=rep1&type=pdf",
            "Abstract": "The paper presents an approach for optimizing query answering algorithms that are based on approximate instance retrieval. We consider SPARQL instance queries over OWL ontologies and use the OWL 2 Direct Semantics entailment regime of SPARQL for their evaluation. Approximate query answering algorithms are based on the creation of two sets; the set of certain or known query answers and the set of possible query answers, which require checks to determine whether they are real answers. Typically, it is expensive to check the possible answers hence our goal in this paper is to reduce the number of possible answers returned by approximate reasoning algorithms. We present an approach for using schema knowledge from the terminology (TBox) to optimize the evaluation of SPARQL instance queries. We proceed by transforming the query into a set of assertions (ABox). We then show how the TBox and this (small) query ABox can be used to build an equivalent query where the additional query atoms can be used for reducing the set of possible mappings for query variables.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Knowledge refinement using fuzzy compositional neural networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44989-2_111",
            "Abstract": "Fuzzy relations as representational tools and fuzzy compositional operators as reasoning components, are user in this paper in order to represent knowledge expressed in semantic rules. Furthermore, neural representation and resolution of composite fuzzy relation equations provides knowledge refinement and adaptation to a specific context. A two-layer fuzzy compositional neural network is proposed in this work, with a learning algorithm changing the weights and minimize the error of the small context changes.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The Fuzzy Description Logic f-SHIN.",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/30680298/385.pdf",
            "Abstract": "In the Semantic Web information would be retrieved, processed, combined, shared and reused in the maximum automatic way possible. Obviously, such procedures involve a high degree of uncertainty and imprecision. For example ontology alignment or information retrieval are rarely true or false procedures but usually involve confidence degrees or provide rankings. Furthermore, it is often the case that information itself is imprecise and vague like the concept of a “tall” person, a “hot” place and many more. In order to be able to represent and reason with such type of information in the Semantic Web (SW), as well as, enhance SW applications we present an extension of the Description Logic SHIN with fuzzy set theory. We present the semantics as well as detailed reasoning algorithms for the extended language.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "FAETHON: Unified intelligent access to heterogeneous audiovisual content",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.121.2606&rep=rep1&type=pdf",
            "Abstract": "In this paper, the FAETHON project is presented, whose overall objective is to develop an integrated information system that offers enhanced search and retrieval capabilities to users of heterogeneous digital audiovisual (a/v) archives. This novel system will exploit the advances in handling a/v content and related metadata, as introduced by MPEG-4 and worked out by MPEG-7, to offer advanced access services characterized by the tri-fold “semantic phrasing of the request (query)”,“unified handling” and “personalized response”.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "D2. 5.4 analysis of requirements for further language extensions",
            "Publication year": 2006,
            "Publication url": "https://fada.birzeit.edu/handle/20.500.11889/4183",
            "Abstract": "EU-IST Network of Excellence (NoE) IST-2004-507482 KWEB Deliverable D2.5.4 (WP2.5) Keyword list: description logics, ontology language, query language, RDF, OWL DL, OWL-E The current deliverable surveys a number of real-world use cases encountered in the course of the KnowledgeWeb project which demonstrate limitations of the Semantic Web ontology languages RDF and OWL. Approaches to overcoming these limitations are considered, including increased expressiveness of semantic languages, additional or alternative semantic models, and usability features which make ontologies easier to work with in real-world software architectures. Potential impacts of these approaches on the use cases presented here, as well as on other use cases including those identified by industrial work packages, are described. The issues raised by the use cases considered will play an important role in the future for the use of ontology languages in many applications. This deliverable builds upon the work presented in deliverables 2.5.1, 2.5.2, and 2.5.3, which presented RDF and OWL extensions for the representation of rules, queries, extended datatypes, uncertainty, and context, as well as studies on implementation and optimization issues.",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "State of the art on ontology alignment",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=10270466825520462969&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "R3y5dxMAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        }
    ]
}]