[{
    "name": "Γεώργιος Λέπουρας",
    "romanize name": "Georgios Lepouras",
    "School-Department": "Πληροφορικής & Τηλεπικοινωνιών",
    "University": "uop",
    "Rank": "Καθηγητής",
    "Apella_id": 18491,
    "Scholar name": "George Lepouras",
    "Scholar id": "AZ9U32YAAAAJ",
    "Affiliation": "Department of Informatics and Telecommunications, University of Peloponnese",
    "Citedby": 2793,
    "Interests": [
        "Human Computer Interaction",
        "Games",
        "Virtual Reality",
        "Personal Information Management",
        "Task Information Management"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=AZ9U32YAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A knowledge-based approach for developing multi-channel e-government services",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=15484889790947424413&hl=en&oi=scholarr",
            "Abstract": "Having realised the benefits resulting from delivering on-line public services in the context of electronic government, administrations strive to extend the spectrum of services offered to citizens and enterprises, as well as to engage multiple communication channels in service delivery, in order to increase the target audience and, consequently, the service effectiveness. Insofar, however, only the web channel has been sufficiently used for service delivery, whereas other channels have not been adequately exploited. One of the main reasons of this lag is the cost incurred for the development and maintenance of multiple versions of an electronic service, each version targeted to a different platform. In this paper, we present an approach and the associated tools for developing and maintaining electronic services that allows the automated production of different versions of the electronic service, each targeted to a specific platform.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "SmartGov: A knowledge-based platform for transactional electronic services",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46138-8_59",
            "Abstract": "Public transaction services (such as e-forms) although perceived the future of e-government have not yet realised their full potential. E-forms have a significant role in e-government, as they are the basis for implementing most of the twenty public services that all member states have to provide to their citizens and businesses. The aim of the SmartGov project is to specify, develop, deploy and evaluate a knowledge-based platform to assist public sector employees to generate online transaction services by simplifying their development, maintenance and integration with already installed IT systems. This platform will be evaluated in two European countries (in one Ministry and one Local Authority). This paper outlines key issues in the development of the SmartGov system platform.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An active ontology-based blackboard architecture for Web service interoperability",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1499537/",
            "Abstract": "Web services are functional, independent components that can be called over the Web to perform a task. Web services are provided by organizations to enable others to perform tasks the organization offers online. However, with an ever increasing number of Web services, finding the Web service that performs a certain task is not always easy. Furthermore, adopting an end-user point of view what is needed is the actual result and not the service per se. It is often the case that more than one service have to be combined to produce the anticipated outcome, e.g. in the case of life-events. To this end, we propose an active, ontology-based blackboard architecture that aims at tackling the problems inherent in dynamic synthesis of composite Web services and at facilitating user interaction with complex e-government transactions.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Augmented Reality and programming education: A systematic review",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212868921000544",
            "Abstract": "In recent years, Augmented Reality (AR) usage in the learning process has been growing. AR tools and environments lead to a variety of positive outcomes and impacts for educational purposes. Similarly, AR is changing the learning process in the Computer Science (CS) Education domain. There are numerous studies that adopt the immersive AR technology in order to improve Computational Thinking (CT) or programming skills, in several contexts. However, there are not sufficient studies that analyze the meaningful characteristics or the advantages and disadvantages of AR in the field. In order to better understand the impact of AR in programming education we performed a systematic literature review. This review analyzes 31 studies in the field. It explores the evolution of this developing technology, the challenges and issues that AR offers and discusses how this work can benefit student learning and further …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A heuristics-based approach to reverse engineering of electronic services",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0950584908000554",
            "Abstract": "Since the beginning of the electronic era, public administrations and enterprises have been developing services, through which citizens, businesses and customers can conduct their transactions with the offering entity. Each electronic service contains a substantial amount of knowledge in the form help texts, rules of use or legislation excerpts, examples, validation checks, etc. This knowledge has been extracted from domain experts when the services were developed, especially in the phases of analysis and design, and was subsequently translated into software. In the latter format though, knowledge cannot be readily used in organizational processes, such as knowledge sharing and development of new services. In this paper, we present an approach for reverse engineering electronic services in order to create knowledge items of high levels of abstraction, which can be used in knowledge sharing environments …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "From the web of data to a world of action",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1570826810000314",
            "Abstract": "This paper takes as its premise that the web is a place of action, not just information, and that the purpose of global data is to serve human needs. The paper presents several component technologies, which together work towards a vision where many small micro-applications can be threaded together using automated assistance to enable a unified and rich interaction. These technologies include data detector technology to enable any text to become a start point of semantic interaction; annotations for web-based services so that they can link data to potential actions; spreading activation over personal ontologies, to allow modelling of context; algorithms for automatically inferring ‘typing’ of web-form input data based on previous user inputs; and early work on inferring task structures from action traces. Some of these have already been integrated within an experimental web-based (extended) bookmarking tool, Snip …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:M05iB0D1s5AC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Formalization and visualization of the narrative for museum guides",
            "Publication year": 2018,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/20206",
            "Abstract": "There is a wide range of metadata standards for the documentation of museum related information, such as CIDOC-CRM; these standards focus on the description of distinct exhibits. In contract, there is a lack of standards for the digitization and documentation of the routes followed and information provided by museum guides. In this work we propose the notion of\" narrative'', which can be used to model a guided museum visit...",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Database Knowledge Enrichment Utilizing Trending Topics from Twitter",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9381421/",
            "Abstract": "Every day, many people use at least one social network (or social media) account. This development has been boosted by the rapid growth of technology, making both smartphones and mobile data much more accessible and inexpensive. Therefore, the number of social networks users is growing rapidly, accounting more than 1 billion active users worldwide. The ease of use, as well as the ability to communicate without spatial and temporal restrictions underpinned the rapid increase of the popularity of social networks, as well as their wide acceptance by the general public. This popularity influences people's opinion on many issues, shapes consumer habits and behaviour, mood, etc. The work of many scientists across multiple disciplines has focused on studying social media from various perspectives, including marketing, journalism and sociology. This paper investigates how trending information from social …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Facilitating VR museums web presence",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/41649421/FacilitatingVRMuseumsWebPresence.pdf",
            "Abstract": "The paper presents an environment that enables museum curators to catalogue and publish on the web exhibits in multiple languages and media including 3D, video, images. The system is extendable to accommodate new media types, languages, exhibits, information categories, etc. Visitors have the potential to formulate dynamic personalised exhibit collections using search mechanisms provided by the system.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "English Assistant: a support strategy for on-line second language learning",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/943875/",
            "Abstract": "We present an approach to the provision of on-line assistance for learners of English as a second language. The basis for this design is the application of directed support in the form of 'dynamic annotation' to English information. Critically, we aim to provide aid where it is likely to be needed most. Our work falls into two parts. Firstly, we have a mechanism that facilitates the dynamic annotation of English content Web pages. Secondly, we are investigating the application of criteria to drive the decision-making that underlies such support.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using Facebook as complementary teaching tool: A case study",
            "Publication year": 2012,
            "Publication url": "https://www.researchgate.net/profile/Vassilis_Komis/publication/236887910_Social_Networks_in_Massively_Multiplayer_Online_Games_MMOGs_the_elusive_boundary_between_the_real_and_the_virtual/links/53dfe2ea0cf2aede4b49c8db.pdf#page=23",
            "Abstract": "The popularity of social networks and particularly of Facebook among university students implies a clear educational potential. In a preliminary study, it was found that most of the 1 st year students at the Department of Computer Science and Technology (University of Peloponnese) use Facebook daily and many hours per day. It was decided that Facebook would be used as a complementary teaching tool for the course of “Research Methodology in English”(1 st year course). In total, 66 students attended the classes, all between 18-19 years of age. The course instructor created a new profile on Facebook (not a specific group, but seen as a physical person) and asked students to send friendship requests. The vast majority of students included the instructor in their friends’ lists (55 friend requests). The students were also aware that this was a research process and their participation is valuable. From the first day of use, the students were given a usage diary and were asked to fill in at least 5 logs each, in which they should write down the date of use, the duration, the medium (PC, mobile phone, etc.), the purpose of visit, difficulties they faced, any other comments. The diaries were collected at the end of the term. In addition, students were asked to answer a small questionnaire at the beginning of the term, to identify their cognitive style, since one of the main research hypotheses was that social media might be more beneficial for certain cognitive styles, rather than others (ie extroverts vs. introverts). The students’ cognitive styles would be compared at the end of the term with their overall course mark (to see whether certain cognitive styles managed …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The use of semantics in the CrossCult H2020 project",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-53640-8_17",
            "Abstract": "CrossCult is a newly started project that aims to make reflective history a reality in the European cultural context. In this paper we examine how the project aims to take advantage of advances in semantic technologies in order to achieve its goals. Specifically, we see what the quest for reflection is and, through practical examples from two of the project’s flagship pilots, explain how semantics can assist in this direction.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Comparing methods for numerical input in immersive virtual environments",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s10055-017-0312-5",
            "Abstract": "Numeric input is a sub-case of alphanumeric input where a user wishes to communicate a numerical value to the computer. While this is a straightforward task for windows-based environments, this is not the case for immersive virtual environments. In this paper we design, implement, and evaluate different methods based on gestures or hand-held devices such as wireless numeric keyboards and gamepads. The assessment showed that hand-held devices can be easier to use and faster for data input. A numeric keyboard can offer fast input for positive, small numbers, while the gamepad-based method can offer uniform performance. Although the gesture-based method did not perform as well, there is still scope for its use when a designer needs a method that leaves both user’s hands free during interaction.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Springer London"
        },
        {
            "Title": "Visualization method effectiveness in ontology-based information retrieval tasks involving entity evolution",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6978946/",
            "Abstract": "Incorporating digital tools in the business and scientific research workflows is at the moment an on-going process, challenging and demanding as every domain has its own needs in terms of data models and information retrieval methods. The information in some domains involves entity evolution, a characteristic that introduces additional tasks, such as finding all evolution stages of an entity, and poses additional requirements for the information retrieval process. In this paper we present a user study aiming to investigate the effectiveness of current ontology browsing and visualization methods for supporting users in tasks involving research on entity evolution.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bringing a peripheral, traditional venue to the digital era with targeted narratives",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212054819300098",
            "Abstract": "The current work presents a method of enhancing museum content with narratives targeting history reflection in a personalized manner, delivered by an especially designed mobile app. The mobile app is a part of a technology ecosystem that supports the visitor before, during and after her visit. Within the framework of the European H2020 CrossCult project, a method was designed, implemented and tested to enhance museum content with digital material, enriched narratives and means to actively engage visitors. In particular, the method was implemented and tested for the content of the Archaeological Museum of Tripolis (Greece) and specific content examples are presented here, together with data from visitor evaluation. The results showed that content was significantly and qualitatively enhanced and visitors recognized the potential of the app in triggering visitor curiosity, new forms of engagement, and the …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:35r97b3x0nAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Historical Archive Ontologies Requirements, Modeling and Visualization.",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=6558376191573669325&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Formalization and visualization of the narrative for museum guides",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-74497-1_1",
            "Abstract": "There is a wide range of meta-data standards for the documentation of museum related information, such as CIDOC-CRM; these standards focus on the description of distinct exhibits. In contrast, there is a lack of standards for the digitization and documentation of the routes followed and information provided by museum guides. In this work we propose the notion of the narrative, which can be used to model a guided museum visit. We provide a formalization for the narrative so that it can be digitally encoded, and thus preserved, shared, re-used, further developed and exploited, and also propose an intuitive visualization approach.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Context and Adaptivity-Driven Visualization Method Selection",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=17170785249083132956&hl=en&oi=scholarr",
            "Abstract": "Novel and intelligent visualization methods are being developed in order to accommodate user searching and browsing tasks, including new and advanced functionalities. Besides, research in the field of user modeling is progressing in order to personalize these visualization systems, according to its users’ individual profiles. However, employing a single visualization system, may not suit best any information seeking activity. In this paper we present a visualization environment, which is based on a visualization library, i.e. is a set of visualization methods, from which the most appropriate one is selected for presenting information to the user. This selection is performed combining information extracted from the context of the user, the system configuration and the data collection. A set of rules inputs such information and assigns a score to all candidate visualization methods. The presented environment additionally monitors user behavior and preferences to adapt the visualization method selection criteria.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:tOudhMTPpwUC",
            "Publisher": "Premier Reference Source"
        },
        {
            "Title": "Mobile and Context-Aware e-Commerce: Issues, Challenges and Research Directions",
            "Publication year": 2008,
            "Publication url": "http://soda.dit.uop.gr/sites/sdbs.dit.uop.gr/files/editorial-jeco-si.pdf",
            "Abstract": "Electronic commerce, nowadays, is trying to extend its target audience and elevate the quality of services offered to end-users. Two important directions towards meeting these goals are the embracement of mobile users, whose number grows following the advent of communication technologies, and the inclusion of context-aware features in the delivered services to improve the efficiency of the dialogues between users and systems. The context taken into account may involve characteristics regarding the human user, the geographical location and the time of access, the devices employed to access the service, the network through which the user communicates with the system, the nature of the transaction carried out and so forth.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptation to visitors’ visiting and cognitive style",
            "Publication year": 2006,
            "Publication url": "http://hci-vr.cst.uop.gr/papers/%5BC33%5D_Adaptation-AVICOM.pdf",
            "Abstract": "Aiming at developing educational/learning technologies for museum use, we soon became interested in the possibility of adapting the museum learning material to the visitor’s needs and especially learning needs within a museum. We are looking for quick and efficient ways to provide the visitor with appropriate learning content. The option of adaptivity seems very promising due to the fact that the available time for learning within a museum is very limited both because a person might only visit once and also because a typical visit does not usually exceed some minutes. For example, Falk (1991) found that a typical family visit lasted from 31 minutes to 105 minutes, from which the orientation period was between 3-10 minutes, the intensive looking period was between 15-40 minutes, the exhibit cruising period was between 20-45 minutes and the leave taking period between 3-10 minutes. Falk, et al.(1985) also found that visitors’ had an attention span of 30-45 minutes. After that, their attention dropped rapidly. In another study by Serrell (1998), it was found that 82% of visitors spent less than 20 minutes in different exhibitions (110 in total) of various sizes. From all the above, it becomes apparent that the time given for learning is very limited. To this end, it seems important to provide the visitor with personalized experience. Quick adaptivity seems like a good approach to the problem. However, and again due to time restrictions, we do not have the possibility of asking the visitor specific questıons that wıll enable us to ıdentıfy ındıvıdual features–a very necessary aspect of the personalızatıon process. We therefore, aim at solutions that will use salient …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Selected results of a comparative study of four ontology visualization methods for information retrieval tasks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4632101/",
            "Abstract": "The need for effective ontology visualization for design, management and browsing has arisen as a result of the progress in the areas of semantic Web and personal information management. There are several ontology visualizations available through existing ontology management tools, but not as many evaluations to determine their advantages and disadvantages and their suitability for various ontologies and user groups. This work presents selected results of an evaluation of four visualization methods in Protege.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using Social media to stimulate history reflection in cultural heritage",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=14533508508500627085&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Integrating e-government public transactional services into public authority workflows",
            "Publication year": 2004,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/EG.2004.004136",
            "Abstract": "Documents submitted by citizens through electronic services, deployed in the context of e-government, must usually undergo processing by some organisational information system in order to complete the citizens' requests and for the reply to be returned to the citizen. The integration, however, of the e-service delivery platform and the organisational information system is often hindered for a number of reasons, including security considerations, platform diversity or idiosyncrasies of legacy information systems. In this paper, we present a generic method for providing seamless communication between the two platforms, enabling the full integration of documents submitted through electronic services into the organisational workflow, thus leveraging the quality of services offered to citizens and facilitating e-service development and operation.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A comparative study of four ontology visualization techniques in protege: Experiment setup and preliminary results",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1648294/",
            "Abstract": "The continuing need for more effective information retrieval has lead to the creation of the notions of the semantic Web and personalized information management, areas of study that very often employ ontologies to represent the semantic context of a domain. Consequently, the need for effective ontology visualization for design, management and browsing has arisen. There are several ontology visualizations available through the existing ontology management tools, but not as many evaluations to determine their advantages and disadvantages and their suitability for various ontologies and user groups. This work presents the preliminary results of an evaluation of four visualization methods in Protege",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gaming and cognitive profiles for recommendations in museums",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6735569/",
            "Abstract": "This paper presents an approach to enhance museum visitors experience through the use of Gaming, Social Networks, and Recommendations. The originality of the dedicated social and mobile visit personalisation system is that it relies on both the user's cognitive profile and his interests, inferred from a game on Facebook.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "REVERSE ENGINEERING ELECTRONIC SERVICES From e-Forms to Knowledge",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.75.4886",
            "Abstract": "On their route to e-governance, public administrations have developed e-services. Each e-service encompasses a significant amount of knowledge in the form of examples, help texts, legislation excerpts, validation checks etc. This knowledge has been offered by domain experts in the phases of service analysis, design and implementation, being however bundled within the software, it cannot be readily retrieved and used in other organizational processes, including the development of new services. In this paper, we present an approach for reverse engineering e-services, in order to formulate knowledge items of a high level of abstraction, which can be made available to the employees of the organizations. Moreover, the knowledge items formulated in the reverse engineering process are stored into a knowledge-based e-service development platform, making them readily available for use in the development of other services. 1",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cyber-Range Federation and Cyber-Security Games: A Gamification Scoring Model",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9527972/",
            "Abstract": "Professional training is essential for organizations to successfully defend their assets against cyber-attacks. Successful detection and prevention of security incidents demands that personnel is not just aware about the potential threats, but its security expertise goes far beyond the necessary background knowledge. To fill-in the gap for competent security professionals, platforms offering realistic training environments and scenarios are designed that are referred to as cyber-ranges. Multiple cyber-ranges listed under a common platform can simulate more complex environments, referred as cyber-range federations. Security education approaches often implement gamification mechanics to increase trainees’ engagement and maximize the outcome of the training process. Scoring is an integral part of a gamification scheme, allowing both the trainee and the trainer to monitor the former’s performance and progress. In …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Capturing the historical research methodology: an experimental approach",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=11945301496623043746&hl=en&oi=scholarr",
            "Abstract": "The paper presents the results of a study on how historians conduct research in a historical archive, and the methodologies they use while searching. Historic research involves finding, using and correlating information within primary and secondary sources, in order to understand past events. Historians conduct research systematically, by examining past events to renew the past; historic research may involve interpretation to recapture the nuances, personalities, and ideas that have influenced these events, and the expected research outcome is to communicate an understanding of past events. Their main objective is to recreate the past, through existing records and their interconnections. The collection of historical data is accomplished through methodical and comprehensive research in primary and secondary sources.  An important factor in our study was to understand what kind of data or information historians …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:lSLTfruPkqcC",
            "Publisher": "IATED"
        },
        {
            "Title": "A governmental knowledge-based platform for public sector online services",
            "Publication year": 2002,
            "Publication url": "http://smartgov.e-gov.gr/deliverables/D31/SmartGov_D31.pdf",
            "Abstract": "This Deliverable provides the results of a research aiming to determine and present the relevant state-of-the-art. It includes a presentation of e-forms products and solutions, process models, best practices and knowledge management aspects all related to the public sector. Furthermore the current situation at the participating public authorities is presented in terms of services provided, policies and infrastructure and technologies used.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:UHK10RUVsp4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An XML model for electronic services",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/EG.2005.006647",
            "Abstract": "With the need for electronic services to be developed and deployed more and more rapidly, it is imperative that concrete models of electronic services are developed, to facilitate systematic work of electronic service stakeholders, concrete semantics, and coherent representations across services developed within an organisation. Using the XML language to develop such a model offers a number of additional advantages, such as rich semantics, facilitation of data interchange, extensibility, high abstraction levels, and possibility for mechanical processing. In this paper, we present the design aspects of an XML model for electronic services, which has been used for building a repository of interlinked elements representing e-services. A web-based interface for the management of this repository and a tool for automatically compiling e-service descriptions into executable images have been developed alongside. The …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:aqlVkmm33-oC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "A Spartan3e based low-cost system for gamma-ray detection in small SPECT or PET systems",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548500/",
            "Abstract": "The development and assessment of a readout system based on Field Programmable Gate Array (FPGA) for dedicated nuclear medicine cameras is presented. We have used Xilinx Spartan3e, which is one of the simplest FPGA evaluation boards. The aim of this work is to offer a simple, opensource data acquisition tool, which provides accurate results for nuclear imaging applications.. The system has been evaluated using three different experimental setups: Pulses from two position-sensitive photomultipliers (PSPMTs) and a Silicon Photomultiplier (SiPM), were recorded, using  99m Tc and  111 In point sources. Spartan3e FPGA has a dual channel, 14-bit analog to digital converter with a sampling rate of 1.5Msps per channel. The tool was designed using Xilinx's Embedded Development Kit and was based in Xilinx's Microblaze soft-core processor. PSPMT anode signals spectra of single position and SiPM …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Localisation and linguistic anomalies",
            "Publication year": 2001,
            "Publication url": "https://strathprints.strath.ac.uk/2484/",
            "Abstract": "Interactive systems may seek to accommodate users whose first language is not English. Usually, this entails a focus on translation and related features of localisation. While such motivation is worthy, the results are often less than ideal. In raising awareness of the shortcomings of localisation, we hope to improve the prospects for successful second-language support. To this end, the present paper describes three varieties of linguistic irregularity that we have encountered in localised systems and suggests that these anomalies are direct results of localisation. This underlines the need for better end-user guidance in managing local language resources and supports our view that complementary local resources may hold the key to second language user support.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AVI2CH 2020: Workshop on Advanced Visual Interfaces and Interactions in Cultural Heritage",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3399715.3400869",
            "Abstract": "AVI2CH is a meeting place for researchers and practitioners focusing on the application of advanced information and communication technology in cultural heritage (CH) with a specific focus on user interfaces, visualization and interaction. It builds on a series of PATCH workshops, since 2007 including three at AVI and also a series of European workshops on cultural informatics. Eleven papers range from novel interfaces in museums to wider community engagement; all share a common mission to ensure that the latest digital technology helps preserve the past in ways that enrich the lives of current and future generations",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontology for E-government public services",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/ontology-government-public-services/12643",
            "Abstract": "In the past few years, information and communication technologies are increasingly used for provision of public services, improvement of managerial effectiveness and promotion of democracy, a development that is commonly termed as e-government (Gil-Garcia, 2004). Transactional services are an indispensable tool for delivering public services and can additionally be used for democracy promotion (eg, via questionnaires and polls), thus, playing a central role in e-government. Transactional services development and promotion has also been in the focus of specific projects and initiatives (eg, European Commission, 2004) or supporting frameworks (eg, UK online, http://www. govtalk. gov. uk/schemasstandards/egif. asp). E-government services have now been developed to cover the basic services that should be delivered to citizens and enterprises (Cap Gemini Ernst & Young, 2004). Administrations realise …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Green synthesis of copper oxide nanoparticles and its applications",
            "Publication year": 2016,
            "Publication url": "https://scholar.google.com/scholar?cluster=5303503110506891855&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:URolC5Kub84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An active blackboard for service discovery, composition and execution",
            "Publication year": 2008,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJEG.2008.02045",
            "Abstract": "Organisations are turning to customer-centric electronic services, oriented to servicing customers' life-events. This development requires methods for automatically locating and synthesising individual services to compose complex ones that will service the customer's life-events, since manual composition, either at the customer or the organisation side, incurs functional, economic and technical problems. In this paper we present an active blackboard architecture, which automates the task of service composition based on the semantics of individual services and data dependencies between them. The blackboard incorporates registries, which facilitate service discovery and an execution engine that arranges for dynamic service composition and execution.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Spreading activation for web scale reasoning: Promise and problems",
            "Publication year": 2011,
            "Publication url": "https://soda.dit.uop.gr/sites/soda.dit.uop.gr/files/WebSci2011-Spreading-Act.pdf",
            "Abstract": "Various forms of spreading activation has been used in a number of web systems, not least in the PageRank algorithm. In our own work we have been using this as a technique for managing context over small and large ontologies, and both our own work and that in LarKC suggests that spreading activation has the potential to aid in reasoning over web-scale data sets including the growing set of linked open data resources. Of particular importance is that spreading activation can be applied locally to a dynamic selfselecting working set of an (practically) unbound linked data collection, as well as globally to the entire collection. However, this potential does not come without problems, some concerning the nature of the algorithm on any large data set, and some more to do with the particular nature of linked open data.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reusability in electronic services development",
            "Publication year": 2004,
            "Publication url": "http://helios.mm.di.uoa.gr/~costas/papers-subm/reusability-eservices.pdf",
            "Abstract": "Electronic government employs electronic services to facilitate interaction with citizens and enterprises and deliver a rich and high quality spectrum of services. Development of electronic services can be greatly assisted, both in terms of development cost and roll-out time, by exploiting the reusability inherent in them. Reusability may be promoted by identifying reusable objects in the context of electronic service development, building and populating a repository with such components and providing the means for developers to locate, extract and adapt them to suit the task at hand. In this paper we analyse electronic services to recognise reusable components and present means and techniques that empower electronic service developers to build electronic services through reusable components.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Museum personalization based on gaming and cognitive styles: the BLUE experiment",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/article/museum-personalization-based-on-gaming-and-cognitive-styles/146274",
            "Abstract": "This paper details and discusses experimental results obtained towards personalizing a museum visit through a personal mobile guide, using an approach relying on users' cognitive style, gaming, social networks, and recommendations. It describes the personalization system, which relies on a Facebook game to infer users' cognitive style, visiting style and interests, and a recommendation algorithm offering sequences of points of interests to visit. A qualitative and quantitative analysis of an experiment conducted in a museum is given, offering first conclusions and perspectives on the approach.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The Effect of Social Media Trending Topics Related to Cultural Venues’ Content",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8501878/",
            "Abstract": "Social media have gained the majority of attention on the Internet having an extreme number of daily visitors worldwide. The amount of information exchanged is vast, while users have become equally producers and consumers of data. Words like \"trending\", \"influencers\", \"likes\" and \"viral\" are in the daily agenda of data analyzers, as they are associated with factors that play an important role in the influence of social media content to its audience. These aspects are nowadays strongly taken into account by organizations that want to draw the public's attention to the content they deliver, and in this context cultural institutions have already started to take under great consideration not only their presence in social media, but also the monitoring and exploitation of social media dynamics. In this paper we propose a method that can enable cultural venues to benefit from matches between their own content and ongoing …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Formalization and Visualization of the Narrative for Museum Guides",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=OyFLDwAAQBAJ&oi=fnd&pg=PA3&dq=info:K9CaJ_ij7ScJ:scholar.google.com&ots=tna9FaAEzS&sig=szKycpbkEQByTs0qhOEDKw1Iyrg",
            "Abstract": "There is a wide range of meta-data standards for the documentation of museum related information, such as CIDOC-CRM; these standards focus on the description of distinct exhibits. In contrast, there is a lack of standards for the digitization and documentation of the routes followed and information provided by museum guides. In this work we propose the notion of the narrative, which can be used to model a guided museum visit. We provide a formalization for the narrative so that it can be digitally encoded, and thus preserved, shared, re-used, further developed and exploited, and also propose an intuitive visualization approach.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer"
        },
        {
            "Title": "Ontology visualization methods—a survey",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1287620.1287621",
            "Abstract": "Ontologies, as sets of concepts and their interrelations in a specific domain, have proven to be a useful tool in the areas of digital libraries, the semantic web, and personalized information management. As a result, there is a growing need for effective ontology visualization for design, management and browsing. There exist several ontology visualization methods and also a number of techniques used in other contexts that could be adapted for ontology representation. The purpose of this article is to present these techniques and categorize their characteristics and features in order to assist method selection and promote future research in the area of ontology visualization.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:u5HHmVD_uO8C",
            "Publisher": "ACM"
        },
        {
            "Title": "User Profile Ontology version 1",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=4592515297483348072&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:0EnyYjriUFMC",
            "Publisher": "ed"
        },
        {
            "Title": "The Use of Semantics in the CrossCult H2020 Project",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=TgshDgAAQBAJ&oi=fnd&pg=PA190&dq=info:5F6PiVkJfiQJ:scholar.google.com&ots=1hPtm7FZtm&sig=Kvq-q3xR6K4Rys2gFBf4UtyKWvg",
            "Abstract": "CrossCult is a newly started project that aims to make reflective history a reality in the European cultural context. In this paper we examine how the project aims to take advantage of advances in semantic technologies in order to achieve its goals. Specifically, we see what the quest for reflection is and, through practical examples from two of the project’s flagship pilots, explain how semantics can assist in this direction.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:hMsQuOkrut0C",
            "Publisher": "Springer"
        },
        {
            "Title": "An Observational Study on the Use of Comics in education",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8864896/",
            "Abstract": "In this paper we report on the findings of an observational study regarding the use of comics in an educational setting. The study is designed as a first level examination of the field, aimed to produce a set of parameters deserving a closer examination in experiments to follow.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Facebook as teaching tool in higher education: A case study",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=17852034173088215548&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "User profiling: Towards a Facebook game that reveals cognitive style",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-12157-4_28",
            "Abstract": "This paper presents an innovative approach based on social-network gaming, which will extract players’ cognitive styles for personalization purposes. Cognitive styles describe the way individuals think, perceive and remember information and can be exploited to personalize user interaction. Questionnaires are usually employed to identify cognitive styles, a tedious process for most users. Our approach relies on a Facebook game for discovering potential visitors’ cognitive styles with an ultimate goal of enhancing the overall visitors’ experience in the museum. By hosting such a game on the museum’s webpage and on Facebook, the museum aims to attract new visitors, as well as to support the user profiling process.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Evaluating the significance of the desktop area in everyday computer use",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4455955/",
            "Abstract": "Computers have become part of our homes and day-to-day lives. This paper presents selected results of an interview-based user study focused on information management on the personal computer. We focus on the Desktop, confirming results of previous studies as well as revealing new issues and ensuing design suggestions. While even basic competence users inventively appropriated the desktop, some features, in particular user-defined shortcuts, appeared counter-intuitive, and were underused. Users are still dissatisfied with their information organization and the challenge is to provide tools that support rather than replace the users 'flexible and creative use of the current desktop.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Applying clustering algorithms to web-based adaptive virtual environments",
            "Publication year": 2007,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00190",
            "Abstract": "The emergence of the World Wide Web during the past few years has provided a medium for communicating information faster and to more people than before. The technologies used allow for the development of personalised, adaptive to the users' needs, information systems. So far, the complexity of the design and implementation of Virtual Environments has restricted their usage in locally executed, stand-alone applications. In this paper we propose an architecture that permits and facilitates the dynamic, on-the-fly creation of Virtual Environments on the Web that adapt to the users' preferences and profiles. We focus on the algorithms available for creating an efficient virtual environment generation engine. We illustrate the proposed architecture with examples from a case study of a Virtual Museum.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:4DMP91E08xMC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Tailorable E-Government Information Systems",
            "Publication year": 2006,
            "Publication url": "https://www.igi-global.com/chapter/tailorable-government-information-systems/12675",
            "Abstract": "Real-world information, knowledge, and procedures after which information systems are modeled are generally of dynamic nature and subject to changes, due to the emergence of new requirements or revisions to initial specifications. E-government information systems (eGIS) present a higher degree of volatility in their environment, since requirement changes may stem from multiple sources, including legislation changes, organizational reforms, end-user needs, interoperability, and distribution concerns, etc.(Jansen, 2004; Prisma Project, 2002; Scholl, Klischewski, & Moon, 2005. To this end, the design and implementation of eGIS must adhere to paradigms and practices that facilitate the accommodation of changes to the eGIS as they occur in the real world. Object-oriented technologies have been extensively used to encapsulate reusable, tailorable software architectures as a collection of collaborating …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:k_IJM867U9cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Capturing the historical research methodology: an experimental approach",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=2991988803088632467&hl=en&oi=scholarr",
            "Abstract": "This paper presents the results of a study on how historians conduct research in a historical archive, and the methodologies they use while searching. Historic research involves finding, using, interpreting and correlating information within primary and secondary sources, in order to understand past events. The collection of historical data is accomplished through methodical and comprehensive research in primary and secondary sources. An important factor in our study was to understand what kind of data and/or information historians are looking for in a library/historical archive, either printed or digitized, and which research methodologies or research models they use while they investigate a historical archive. Since this issue has not been addressed insofar, and therefore there are no methods for elucidating research methodologies or research models that historians employ / use, we formulated a questionnaire comprising of seven information retrieval tasks commonly addressed in the context of historic research. History researchers were asked to describe in detail how they would proceed in searching for the information they need for completing these tasks. Through this procedure we aimed to investigate the different ways a historian can use to tackle a specific question, examine whether there exists a common research methodology, and the historic researchers' expectations and preferences. The insight gained from this investigation can be used for educational purposes, since it could be useful in the creation / development of a methodology for conducting research on historical information. Furthermore, the findings can be exploited in the …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "International Conference of Education, Research and Innovation"
        },
        {
            "Title": "Introduction to the Special Issue on “Culture Games”",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/fullHtml/10.1145/3453690",
            "Abstract": "Industries, stakeholders, and the public approach culture (both tangible and intangible) for a variety of purposes, and digital games can channel each of these purposes in different ways. In the context of a cultural experience, people may want to learn (with serious games) but also to have fun (with simple entertainment games), spend their free time (with casual games), socialize (with social or multiplayer games), or be creative (with collaborative creation games). Similarly, cultural institutions not only want to teach, but also attract more visitors (promotional games or advergames). In the past decade, there have been significant developments in game technologies used for cultural heritage purposes. Technologies such as crowdsourcing and human computation have become increasingly sophisticated. New game-oriented (but not only) media such as mixed-reality, virtual reality, and natural interaction (eg, motion …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:BUYA1_V_uYcC",
            "Publisher": "ACM"
        },
        {
            "Title": "SmartGov\": A Knowledge-Based Platform",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=mgFtCQAAQBAJ&oi=fnd&pg=PA362&dq=info:8SKBkf35lJYJ:scholar.google.com&ots=x8n4tCIZTX&sig=Bx1-8K5pvxqC55ZWN195mSiT2ig",
            "Abstract": "Public transaction services (such as e-forms) although perceived the future of e-government have not yet realised their full potential. E-forms have a significant role in e-government, as they are the basis for implementing most of the twenty public services that all member states have to provide to their citizens and businesses. The aim of the SmartGov project is to specify, develop, deploy and evaluate a knowledge-based platform to assist public sector employees to generate online transaction services by simplifying their development, maintenance and integration with already installed IT systems. This platform will be evaluated in two European countries (in one Ministry and one Local Authority). This paper outlines key issues in the development of the SmartGov system platform.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Study of low cost continuous Gd2O2S:Pr powder scintillator screens in photon counting mode using a dedicated small nuclear imaging camera",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548494/",
            "Abstract": "The aim of this study is to propose and evaluate a low cost alternative solution as a detector module in nuclear imaging. For this purpose, we have assessed the performance of Gd 2 O 2 S:Pr powder scintillator in the form of thick screens easily produced in our laboratory. All measurements were carried out in photon counting mode using  m99 Tc. To our knowledge, Gd 2 O 2 S:Pr powder phosphor screens have never been used in nuclear imaging. Evaluation was performed using a small field of view gamma camera. A general purpose collimator and a position sensitive photomultiplier tube R9232 were used. Different samples with coating thickness varying from 100 mg/cm 2  to 1.2 g/cm 2  were tested. The procedures for optimizing the thickness of the screen and PSPMT configuration together with quick and optimal amplification of 4 signals (Xa, Xb, Yc, Yd) are reported. The more efficient coating thickness of 600 …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting form semantics and validation checks to improve e-form layout",
            "Publication year": 2005,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWET.2005.007465",
            "Abstract": "On their route to the electronic era, organisations release on the web more and more complex form-based services, which require users to enter numerous data items interrelated by business rules. In such a context, it is crucial to provide optimal form layouts, in order to present the service users with interfaces that facilitate their work. This paper presents an integrated environment, which exploits data item interrelations manifested by the business rules (or validation checks), to optimise the layout of the web forms comprising a complex service. The approach is validated through its application on a tax return form e-service.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:blknAaTinKkC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "SmartGov: a knowledge-based platform for electronic transactional services",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=3758683826847192150&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:JQOojiI6XY0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "VIP: Visualization of integrated proteomics data",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4696670/",
            "Abstract": "The post-genomic era is characterized by the rapid data accumulation leading to unwieldy and large volumes of biological data. The proteomics results (large sets of identified proteins or peptides) that originate from several workflow steps, play an important role in the analysis of a proteomics experiment. As a result, the area of high-through-put proteomics created new visualization challenges in interpreting large-scale datasets. We present VIP, an interactive visualization tool for proteomics data, which integrates protein or peptide features emanating at every step of the proteomics analysis and combines them visually in synthetic maps. Our novel tool offers the flexibility to choose any desired features according to the analysis objectives, examine simultaneously more than one maps and interact with the visualization by querying and filtering the results. The synthetic maps visualization aims not only at summarizing …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a methodological framework for the cognitive-behavioural evaluation of educational e-games",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJLT.2011.043580",
            "Abstract": "The proposed methodological framework reviews and uses knowledge from the field of cognitive psychology in order to evaluate aspects of educational games. In particular, we concentrate on two components of human cognition that play a central role in learning, namely memory and motivation. After having reviewed theories in the field, we created a questionnaire in order to evaluate educational games. The questionnaire incorporates different experimental findings of cognitive psychology. In particular, we have applied Maslow’s motivation theory, behavioural findings on reinforcement, experimental findings about attention and memory. We present the results obtained from the evaluation of three games, Angry Birds, PAC-MAN and Mega Jump. The results confirmed the user ratings of the three games, showing that there seem to be cognitive reasons for the success/failure of different games. Finally, a list of …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Inderscience Publishers Ltd"
        },
        {
            "Title": "Towards a Framework for Adaptive Gameplay in Serious Games that Teach Programming: Association Between Computational Thinking and Cognitive Style",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68198-2_49",
            "Abstract": "Learning basic programming principles is the main process to acquire computational thinking skills, which comprise an essential capability for education worldwide. The game-based learning approach is a very promising learning strategy towards that direction. Digital games help learners become active and engaging in the acquisition of knowledge. Though, the learning process is not always clear through serious games that teach programming. Personality characteristics like cognitive style, seem to affect how efficiently and effectively learners perceive the knowledge. Cognitive style deals with the way learners perceive information and is a significant feature in improving programming learning. Thus, in order learners to achieve better performances through serious games that teach programming concepts, we need to investigate how cognitive style can be incorporated into the design of game-based …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Content enrichment through dynamic annotation",
            "Publication year": 2004,
            "Publication url": "https://strathprints.strath.ac.uk/2486/",
            "Abstract": "This paper describes a technique for interceding between users and the information that they browse. This facility, that we term 'dynamic annotation', affords a means of editing Web page content 'on-the-fly' between the source Web server and the requesting client. Thereby, we have a generic way of modifying the content displayed to local users by addition, removal or reorganising any information sourced from the World-Wide Web, whether this derives from local or remote pages. For some time, we have been exploring the scope for this device and we believe that it affords many potential worthwhile applications. Here, we describe two varieties of use. The first variety focuses on support for individual users in two contexts (second-language support and second language learning). The second variety of use focuses on support for groups of users. These differing applications have a common goal which is content enrichment of the materials placed before the user. Dynamic annotation provides a potent and flexible means to this end.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:RGFaLdJalmkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computing in the physical world engages students: Impact on their attitudes and self-efficacy towards Computer Science through robotic activities",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3265757.3265770",
            "Abstract": "There is a growing interest in physical computing to be used in school contexts to teach Computer Science. This study aimed to assess whether students' attitudes towards Computer Science and their self-efficacy with programming changed after engaging with robotic activities. Findings show that after completing a 10-week period with the Arduino robotics environment, students' positive attitudes towards Computer Science increased along with feelings of coding self-efficacy. In other words, students report liking Computer Science more and report feeling that they are more able to learn programming. These findings imply that using physical computing activities within the right context could change student attitudes towards and self-efficacy in Computer Science.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experiences from the development of thematic routes in 3 Greek museums",
            "Publication year": 2019,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/20243",
            "Abstract": "Υπατία - Experiences from the development of thematic routes in 3 Greek museums Toggle \nnavigation ΤΕΙ Αθήνας Είσοδος Αρχική Σελίδα / CrossCult Project / Publications / Εμφάνιση \nΤεκμηρίου Experiences from the development of thematic routes in 3 Greek museums \nAntoniou, A.; Vassilakis, C.; Wallace, M.; Lepouras, G.; Poulopoulos, V. URI: http://hdl.handle.net/11400/20243 \nΗμερομηνία Δημοσίευσης: 2017 Τύπος Τεκμηρίου: Δημοσίευση σε συνέδριο Όνομα Συνεδρίου: \nProceedings of Euromed 2017 Εμφάνιση πλήρους εγγραφής Αρχεία σε αυτό το τεκμήριο \nΑρχεία Μέγεθος Μορφότυπο Προβολή Δεν υπάρχουν αρχεία που σχετίζονται με αυτό το \nτεκμήριο. Οι παρακάτω άδειες σχετίζονται με αυτό το τεκμήριο: Creative Commons Αυτό το \nτεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) Publications Αναφορά Δημιουργού-Μη \nΕμπορική Χρήση-Όχι Παράγωγα Έργα 3.0 Ηνωμένες Πολιτείες Εκτός από όπου ορίζεται κάτι , --…",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Educational Robotics in the service of CSE: A study based on the PanHellenic competition",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2978249.2978262",
            "Abstract": "The present work is an observational study recording the participating teachers' attitudes from the PanHellenic Educational Robotics (ER) competition. The study investigates the benefits of students' involvement with robotics about skills, motivation and learning. Additionally, it is researched weather ER should be introduced in the Greek compulsory curricula. A qualitative methodology was used and although the sample was relatively small (N= 18), the results were quite homogeneous showing a very high level of engagement and motivation of teachers and students. The results show that there are numerous benefits for students: they seem to increase their collaboration, problem solving and creativity skills; understand STEM concepts about computer science and engineering and especially gaining programming knowledge. Moreover, most of the teachers consider that ER should be part of the compulsory curriculum.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-Citizens and e-Consumers: Is There a Difference?",
            "Publication year": 2001,
            "Publication url": "http://hci-vr.dit.uop.gr/papers/%5BC12%5D_citizensandcustomers-PCHCI.pdf",
            "Abstract": "Although the notions of electronic government and of electronic shopping seem very different at first glance, they actually share a lot of commonalities. For the electronic government the transformation of the casual web surfer to an electronic citizen, corresponds to that of transforming web surfers to e-shoppers. In the rest of the paper we investigate the differences between web surfers, business users, e-consumers and e-citizens, the factors concerning the development of successful electronic services as well as the differences and commonalities between business and government, under the role of electronic service provider. The paper concludes by identifying lessons and benefits that business and government may obtain from one another, with respect to the deployment of electronic services.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How do different cognitive styles affect learning programming? Insights from a game-based approach in Greek schools",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2940330",
            "Abstract": "Is there any relationship between students’ cognitive style and the ability to learn programming through serious games? The aim of this work is to assess the learning effectiveness and motivational appeal of digital games for learning basic programming concepts, involving secondary education students. For this purpose, the Code.org®’s activity named K-8 Intro to Computer Science was used. The study investigated students’ attitudes from gaming activities to reveal the quality of their learning experience. Next, students’ attitudes from games were correlated with their cognitive profile to reveal potential differences. Finally, students’ performance from the digital games was assessed to reveal game-based learning (GBL) effectiveness compared to their cognitive styles. In the study, 77 students of two Greek high schools participated in the context of the European Code Week. The results suggest that these specific …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "ACM"
        },
        {
            "Title": "Web Service Execution Streamlining",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4114724/",
            "Abstract": "Web services are functional, independent components that can be called over the Web to perform a task. Besides being used individually to deliver some well-specified functionality, Web services may be used as building blocks that can be combined to implement a more complex function. In such compositions, typically some Web services produce results that are used as input for Web services that will be subsequently invoked. In the execution schemes currently employed, Web services producing intermediate results deliver them to some \"coordinating entity\", which arranges the forwarding of these intermediate results to Web services that require them as input. In this paper we present an execution scheme that employs direct communication between producers and consumers of intermediate results. Besides performance improvement stemming from reduction of network communication, this scheme permits …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Creating an ontology for the user profile: Method and applications",
            "Publication year": 2007,
            "Publication url": "http://helios.mm.di.uoa.gr/~costas/papers-subm/onto-user-final.pdf",
            "Abstract": "User profiling is commonly employed nowadays to enhance usability as well as to support personalization, adaptivity and other user-centric features. Insofar, application designers model user profiles mainly in an ad-hoc manner, hindering thus application interoperability at the user profile level, increasing the amount of work to be done and the possibility of errors or omissions in the profile model. This work aims at creating a user profile ontology that incorporates concepts and properties used to model the user profile. Existing literature, applications and ontologies related to the domain of user context and profiling have been taken into account in order to create a general, comprehensive and extensible user model. This ontology can be used as a reference model, in order to alleviate the aforementioned issues. The model, available for download, is exemplified through its application in two different areas, personal information management and adaptive visualization.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontopim: From personal information management to task information management",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/5666118/pim2006_workshopproceedings06.pdf#page=78",
            "Abstract": "Personal Information Management (PIM) aims to support users in the collection, storage and retrieval of their personal information. In such a framework the focus is mainly on how better to handle the information collected. Task Information Management (TIM) on the other hand adopts a more usercentric view and aims to support users in performing their tasks. Possible ways of achieving this are to automatically find data users need in order to perform a task, to automate the execution of tasks and the synthesis of new more abstract tasks by identifying tasks users carry out often. PIM and TIM can be seen as complimentary since an efficient organization of personal information can help in the discovery of data relevant to a task. To this end, it is necessary to adopt a holistic approach in the design and implementation of a Task Information Management System.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive Virtual Reality Shopping Malls",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/adaptive-virtual-reality-shopping-malls/31004",
            "Abstract": "Firms and organizations are increasingly exploiting electronic channels to reach their customers and create new business opportunities. To this end, electronic shops have been developed, either offering products from a single firm or encompassing multiple individual electronic stores, comprising thus electronic shopping malls. Besides development activities, electronic shopping has attracted the attention of researchers, who have studied various perspectives, including user attitude, critical success factors, security, technical aspects, and so forth (eg, Fang & Salvendy, 2003; Wang, Makaroff, & Edwards, 2003). Two main concerns for e-commerce are personalization and enhancement of user experience. Personalization addresses the ability to offer content tailored to the preferences of each user (Anupam, Hull, & Kumar, 2001) or user group (Wang et al., 2003). Preferences may be explicitly declared by the user, or …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:Zph67rFs4hoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Connecting physical space, human personalities, and social networks: the Experimedia Blue project",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=1813151448749032449&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:bnK-pcrLprsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Facebook as Teaching Tool in Higher Education: A Case Study",
            "Publication year": 2018,
            "Publication url": "http://www.ijassh.com/index.php/IJASSH/article/view/97",
            "Abstract": "Social networks (SN) seem to play a significant role in young adults’ and university students’ lives. Since students already use them in their daily life, why shouldn’t formal higher education incorporate them? The paper presents qualitative and quantitative data gathered through one academic term, after using Facebook as a teaching tool in Higher Education and investigates ways that SN can be used in teaching and learning. Issues of students’ personalities, learning efficiency, motivation, cultural differences, gender differences and patterns of use are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "exhiSTORY: Smart Self-organizing Exhibits",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-38836-2_5",
            "Abstract": "Creating stories for exhibitions is a fascinating and in parallel laborious task. As every exhibition is designed to tell a story, museum curators are responsible for identifying, for each exhibit, its aspects that fit to the message of the story and position the exhibit at the right place in the story thread. In this context, we analyze how the technological advances in the fields of sensors and Internet of Things can be utilized in order to construct a “smart space,” which consists of self-organizing exhibits that cooperate with each other and provide visitors with comprehensible, rich, diverse, personalized, and highly stimulating experiences. We present the system named “exhiSTORY” that intends to provide the appropriate infrastructure to be used in museums and places where exhibitions are held in order to support smart exhibits. The architecture of the system and its application potential is presented and discussed.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:tYavs44e6CUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Comparing game input modalities: A study for the evaluation of player experience by measuring emotional state and game usability",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7128922/",
            "Abstract": "With the launch of new game controllers such as the Microsoft Kinect for Xbox, novel forms of game interaction are introduced such as gestures and voice. These new control mechanisms raise some questions regarding the user experience. In this paper, an initial study is presented for evaluating the user's experience and motivation, by measuring the emotional state (self report measures), during a simple game scenario. A game was designed and implemented in order to test this hypothesis. To investigate this topic a comparative study of two similar prototypes (mouse input vs. Kinect input) of a 2D game about the history of photography was conducted. Two different groups tested these two prototypes. The first findings from the pilot experiments indicated that using voice and gestures as an input method caused higher user valence and dominance than the use of mouse. In addition, users seemed to find the mouse …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Lifecycle of Transactional Services",
            "Publication year": 2007,
            "Publication url": "https://www.igi-global.com/chapter/encyclopedia-digital-government/11651",
            "Abstract": "Electronic government can be defined as the use of information and communication technologies in government for at least three purposes: providing public services, improving managerial effectiveness, and promoting democracy (Gil-Garcia, 2004). This definition recognizes transactional services (ie, services that involve filling-in, submission, and processing of electronic forms) as a vital component of e-government, since public service provision and interaction between citizens and government is mainly modeled through such services (eEurope, 2000). It is worth noting that among the 20 public services included in (eEurope, 2000) as “first steps towards ‘Electronic Government,’” 18 of them (90%) are transactional services, with the remaining two being informational services (information search and retrieval). Similar ratios hold for electronic services worldwide: for instance, the government of Dubai analyzed all …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Preliminary in vitro and in vivo evaluation of liposomal nanoparticles for passive and active tumour targeting by scintigraphic and MRI imaging",
            "Publication year": 2014,
            "Publication url": "https://ejnmmiphys.springeropen.com/articles/10.1186/2197-7364-1-S1-A82",
            "Abstract": "Liposomes belong to the most desirable drug delivery systems that enable their application in MRI and SPECT by incorporating lipids chelated to MR contrast agents as well as to radioactive tracers. Here we report our observation on a novel avb3-targeting liposome formulation (RGD-LP) and on the corresponding non-targeting control (NT-LP) for diagnosis and molecular imaging of tumor by exploiting SPECT/MRI technology. Radiolabelling was performed with 99mTc tricarbonyl core via the ligand cysteine (Cys). Both peptide and ligand were coupled to DSPE-PEG2000-Mal lipid. Radiochemical purity and in vitro stability tested in the presence of competitive ligands for 99mTc (I) were assessed by paper chromatography. For nuclear imaging a custom SPECT system (1.5 mm spatial resolution) was used and the results were correlated to the biodistribution data. Both liposomes disposed of a PEG surface density of 5.5% and were loaded with 25% of Gd-based lipid (B2286) for MRI studies. For recording MR images, cells were transferred into glass capillaries, centrifuged and placed in an agar phantom. MR images were acquired on a Bruker Avance300 spectrometer operating at 7.1 T. In vivo MRI experiments were carried out on U87MG tumor xenografts with a 1T scanner (Bruker, Icon Instrument).Radiolabelling yield (> 80%), radiochemical purity (> 90%), in vitro stability in the presence of excess amount of cysteine and in 10% FBS/DMEM were satisfactory to permit in vivo evaluation at normal mice. NT-LP-Cys showed higher blood retention and lower uptake at liver and spleen at later time points than RGD-LP which is in good correlation with …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Visualizing Hierarchies: Evaluating the Efficiency and Cognitive Effects of Six Visualization Techniques for Browsing and Management Tasks",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=5611594163574099739&hl=en&oi=scholarr",
            "Abstract": "Hierarchical data structures are one of the most commonly used data structures in computer science, and therefore numerous methods and techniques have been proposed for their visualization. In this paper, we present our findings from a user study, in which a number of folder visualization environments were evaluated to assess (a) how efficiently a number of tasks can be performed within the different environments (b) the extent to which using a particular visualization may help the user acquire an accurate cognitive image of the hierarchy structure and its contents and (c) the overall user experience from using a particular visualization environment. The visualization environments considered are representative of major visualization paradigms (zoomable user interfaces, context+focus and space-filling), while both 2D and 3D environments have been included.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Serving enhanced hypermedia information",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45886-7_6",
            "Abstract": "An apparent limitation of existing Web pages is their inability to accommodate differences in the interests and needs of individual users. The present paper describes an approach that dynamically customises the content of public Web-based information via an interceding ‘enhancement server’. The design and operation of this system is described with examples drawn from two current versions. Indications from early trials support the view that this approach affords considerable scope for accommodating the needs and interests of individual Web users.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An XML model for electronic services",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=303196789245608049&hl=en&oi=scholarr",
            "Abstract": "With the need for electronic services to be developed and deployed more and more rapidly, it is imperative that concrete models of electronic services are developed, to facilitate systematic work of electronic service stakeholders, concrete semantics, and coherent representations across services developed within an organisation. Using the XML language to develop such a model offers a number of additional advantages, such as rich semantics, facilitation of data interchange, extensibility, high abstraction levels, and possibility for mechanical processing. In this paper, we present the design aspects of an XML model for electronic services, which has been used for building a repository of interlinked elements representing e-services. A web-based interface for the management of this repository and a tool for automatically compiling e-service descriptions into executable images have been developed alongside. The model has been evaluated by a mixture of electronic service stakeholders, and the results of this evaluation are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:08ZZubdj9fEC",
            "Publisher": "Inderscience"
        },
        {
            "Title": "Personality Analysis of Social Media Influencers as a Tool for Cultural Institutions",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-01762-0_20",
            "Abstract": "                                              Nowadays, more and more cultural venues tend to utilize social media as a main tool for marketing, spreading their messages, engaging public and raising public awareness towards culture. It comes to a point where the massive of content in social media makes it a tedious procedure to contact the appropriate audience, the people that would really be stimulated by cultural information. In this notion, we assume that establishing conversations of high impact can possibly guide the cultural venues to audiences that can benefit more. These conversations usually include the so called influencers, users whose opinion can affect many people on social media; the latter usually referred to as followers. In this research paper we examine the characteristics of the influencers that can affect the procedures of a cultural venue on social media. The research is done within the scope of …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Guide for the Development of Game-Based Evacuation Simulators",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68198-2_51",
            "Abstract": "The evacuation process of complex scenarios like ships and buildings evacuation is a challenge under many conditions. Simulators are a worthy method to experiment in the field. However, it is very difficult to simulate evacuations and engage participants like in real conditions. This article presents a guide based on previous works about 3D evacuation simulators. The guide incorporates (i) hazardous elements such as fire sources, smoke, poisonous gasses, falling/flying objects; (ii) spatial elements such as bottleneck areas, congestion areas, stairs, elevators; (iii) human and the crowd behavior such as the behavior under psychological pressure and (iv) movement features such as the mimic behavior, the initial reaction time, the family-follow-up behavior, and the group-leader-follow-up behavior. Moreover, some evacuation scenarios such as ships and underground structures require the implementation of …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:p__nRnzSRKYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Component reuse in electronic services development",
            "Publication year": 2006,
            "Publication url": "https://content.iospress.com/articles/journal-of-computational-methods-in-sciences-and-engineering/jcm00134",
            "Abstract": "In the context of electronic government, e-services are a valuable instrument for offering high quality services to enterprises and individual citizens alike. While developing an e-service, it is usually possible to reuse elements that have already crafted for other e-services, such as personal detail forms or widgets for collecting social security numbers, decreasing thus both development effort and the time for deployment. A more generic framework for supporting reusability in development of e-services includes the identification of reusable objects, the creation and population of a repository containing such components, and the empowerment of developers with tools allowing for location, retrieval and adaptation of components for suiting their specific tasks. In this paper, we conduct an analysis to recognise e-service component that offer reusability opportunities and we present facilities and methods to enable e-service …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "‘Museum Escape’: A Game to Increase Museum Visibility",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZxS_DwAAQBAJ&oi=fnd&pg=PA342&dq=info:nQTQeZXhFWUJ:scholar.google.com&ots=KK4hpMRH2Y&sig=bR8q9DYLodpiRk-_ZHk-GADMNCY",
            "Abstract": "A peripheral museum with a nevertheless important collection of ancient items, wished to increase its visibility and digital presence in order to become more known and attract new visitors. Among the different solutions designed and implemented, we also designed a series of games of different kinds (ie mini vs complex games) for different purposes, like profiling of potential visitors and advertising the venue in social media. Based on lessons learnt from physical games played at museums of the same type in the same region, we designed and implemented a museum escape game. The game is presented here, to provide implementation details regarding the concept, the game mechanics, the interface design, the technical details, as well as the game art. We conclude with primary user testing and future steps that include plans for creating museum escape games with different technologies, like augmented reality and virtual reality.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Reusability in Governmental Electronic Services",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/reusability-governmental-electronic-services/9825",
            "Abstract": "Reusability in the everyday life is the capacity of using existing objects or even concepts again in the same or other contexts. When applied to information systems reusability is the capability of using the same parts of an application in other applications or in other contexts. As defined by IEEE (IEEE, 1990), reusability is the degree to which a software module or other work product can be used in more than one computing program or software system. Although rapid application development environments such as MS Visual. NETTM (Visual .NET, 2005) and DelphiTM (Borland Delphi, 2005) have to some extent employed reusability of components to aid the fast implementation of software applications, the extent to which existing objects can be used again in the implementation of new software systems is usually limited to basic building blocks of the interface. One problem that hinders reusability of larger building …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:mB3voiENLucC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "An Integrated Approach",
            "Publication year": 2003,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=mgFtCQAAQBAJ&oi=fnd&pg=PA276&dq=info:cS7PSDHvYd8J:scholar.google.com&ots=x8n4tCIZTZ&sig=c1oT7x1FOUI1kMV_O4-Vii9x-6Y",
            "Abstract": "Although form-based services are fundamental to e-government activities, their widespread does neither meet the citizen’s expectations, nor the offered technological potential. The main reason for this lag is that traditional software engineering approaches cannot satisfactorily handle all of electronic services lifecycle aspects. In this paper we present experiences from the Greek Ministry of Finance’s e-services lifecycle, and propose a new approach for handling e-service projects. The proposed approach has been used successfully for extending existing services, as well as developing new ones.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:u9iWguZQMMsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Mindmap-Inspired Semantic Personal Information Management",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Christos-Tryfonopoulos/publication/259703200_Mindmap-Inspired_Semantic_Personal_Information_Management/links/02e7e53933de8605fb000000/Mindmap-Inspired-Semantic-Personal-Information-Management.pdf",
            "Abstract": "Users nowadays need to manage large amounts of information, including documents, e-mails, contacts, and multimedia content. To facilitate the tasks of organisation, maintenance, and retrieval of personal information, a number of semantics-based methods have emerged; these methods employ (personal) ontologies as an underlying infrastructure for organising and querying the personal information space. In this paper we present OntoFM, a novel personal information management tool that offers a mindmapinspired interface to facilitate user interactions with the information base. Besides serving as an information retrieval aid, OntoFM allows the user to specify and update the semantic links between information items, constituting thus a complete personal information management tool.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A knowledge-based approach for developing multi-channel e-government services",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1567422306000585",
            "Abstract": "Having realised the benefits resulting from delivering on-line public services in the context of electronic government, administrations strive to extend the spectrum of services offered to citizens and enterprises, as well as to engage multiple communication channels in service delivery, in order to increase the target audience and, consequently, the service effectiveness. Insofar, however, only the web channel has been sufficiently used for service delivery, whereas other channels have not been adequately exploited. One of the main reasons of this lag is the cost incurred for the development and maintenance of multiple versions of an electronic service, each version targeted to a different platform. In this paper, we present an approach and the associated tools for developing and maintaining electronic services that allows the automated production of different versions of the electronic service, each targeted to a specific …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Tailorability in the context of E-government Information Systems: An approach",
            "Publication year": 2004,
            "Publication url": "http://soda.dit.uop.gr/sites/soda.dit.uop.gr/files/tailorability-for-egovernment.pdf",
            "Abstract": "The ever changing environment information systems model, and in particular e-government ones, intensifies the need for systems that are able to easily, efficiently and transparently adapt to changing environments. Accommodating unanticipated changes implies that systems must be able to adapt to changes occurring in and evolve in step with their changing environment. Adaptation is concerned with monitoring, analysing and understanding the patterns of the user’s interaction with the system. Similarly, an information system is said to be evolutionary if it can be purposefully used in a dynamic environment. E-government information systems, in virtue of their nature and function, are driven by the need to adapt and evolve. This suggests that the design and implementation of such systems must provide the necessary infrastructure for evolution and adaptability. In other words, egovernment information systems must abide to the Tailorable Information Systems paradigm. In this work we present a case study for the development of a Tailorable e-government information system.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A context-based adaptive visualization environment",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1648242/",
            "Abstract": "Digital libraries and historical archives are increasingly employing visualization systems to facilitate the information retrieval and knowledge extraction tasks of their users. Typically, each organization employs a single visualization system, which may not suit best the needs of certain user groups, specific tasks, or properties of document collections to be visualized. In this paper, we present a context-based adaptive visualization environment, which embeds a set of visualization methods into a visualization library, from which the most appropriate one is selected for presenting information to the user. Methods are selected by examining parameters related to the user profile, system configuration and the set of data to be visualized, and employing a set of rules to assess the suitability of each method. The presented environment additionally monitors user behavior and preferences to adapt the visualization method …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stimulation of reflection and discussion in museum visits through the use of social media",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s13278-017-0460-3",
            "Abstract": "In this paper, we examine how social media can be linked to cultural heritage and in particular how we can incorporate games, social networks, history reflection and culture. More specifically, we explore the following aspects: (a) how social media sites can be integrated into the museum user experience (b) how user interactions within the social media, both within the context of the museum experience and outside it, can be exploited to enhance the quality of recommendations made to the users, (c) how trending topics from social media can be used to link museum exhibits with today’s topics of interest and (d) how multi-level related terms extraction from social media data can lead to proposals for reflections to users. The end goal is to provide increased stimuli for users to study exhibits deeper and reflect on them, as well as to trigger discussion between the users, thus maximizing the impact of a museum …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "Reflections on mobile and life long learning: Museums as application fields",
            "Publication year": 2008,
            "Publication url": "http://hci-vr.cst.uop.gr/papers/%5BC44%5D_Reflections_MobileLearning2008.pdf",
            "Abstract": "Viewing mobile learning as a valuable tool for life long learning, the paper wishes to explore different scenarios for the use of visitors’ mobile phones within the museum environment. The museum is perceived as a life long learning institution and there are suggestions for the design of mobile learning technology that adapts to the different learning needs of a diverse public.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparing Game Input Modalities: A Study for the Evaluation of Player Experience by Measuring Self Reported Emotional States and Learning Outcomes",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-40216-1_23",
            "Abstract": "As new game controllers such as the Microsoft Kinect for Xbox are introduced into the market, new forms of game interaction are introduced such as gestures, voice and eye tracking, which raise some questions regarding the user experience. Is it possible that different input methods provide a more usable game setting and affect the player’s emotions and learning process? In this paper, a 2D game about the history of photography was designed and implemented to test these hypotheses. Two prototypes of this game were created, with the first requiring input only via mouse, while the second requiring input via voice and gestures (Kinect). Two different groups tested these two prototypes. The findings from previous pilot experiments indicated that using Kinect as an input method caused higher valence and dominance levels than the use of mouse and were further validated here. Additionally, the learning …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Visualizing meta-features in proteomic maps",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1186/1471-2105-12-308",
            "Abstract": "The steps of a high-throughput proteomics experiment include the separation, differential expression and mass spectrometry-based identification of proteins. However, the last and more challenging step is inferring the biological role of the identified proteins through their association with interaction networks, biological pathways, analysis of the effect of post-translational modifications, and other protein-related information. In this paper, we present an integrative visualization methodology that allows combining experimentally produced proteomic features with protein meta-features, typically coming from meta-analysis tools and databases, in synthetic Proteomic Feature Maps. Using three proteomics analysis scenarios, we show that the proposed visualization approach is effective in filtering, navigating and interacting with the proteomics data in order to address visually challenging biological questions. The novelty of …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:dhFuZR0502QC",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "Serious games: valuable tools for cultural heritage",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-50182-6_30",
            "Abstract": "                                                  Wishing to connect cultural heritage, games and social networks, the present work describes games to be used within the framework of a European H2020 project. For the purposes of supporting the museum visit, before, during and after, 5 games were designed for social networks to accomplish user profiling, to promote the museum and the application through social network dissemination, to introduce museum items and themes and to also function as visit souvenirs. The games are also presented in a generic framework for games in cultural heritage, which has been used successfully in the past.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "English Assistant: a support strategy for online second language learning",
            "Publication year": 2001,
            "Publication url": "https://strathprints.strath.ac.uk/2799/",
            "Abstract": "This paper presents an approach to the provision of on-line assistance for learners of English as a second language. The basis for this design is the application of directed support in the form of 'dynamic annotation' to English information. Critically, we aim to provide aid where it is likely to be needed most. Our work falls into two parts. Firstly, we have a mechanism that facilitates the dynamic annotation of English content web pages. Secondly, we are investigating the application of criteria to drive the decision-making that underlies such support.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Creating an Historical Archive Ontology: Guidelines and Evaluation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4221874/",
            "Abstract": "Ontologies have been proven invaluable tools both for the semantic Web and for personal information management. In the context of a historical archive an ontology may provide meaningful and efficient support for search tasks as well as be used as a tool for storage and presentation of historical data. The creation however of such an ontology is complex, since the digitized archive documents are not in text format and the concepts that must be captured may vary among different time periods. This work presents a user-centric methodological approach for extracting the ontology of an historical archive focusing on the evaluation issues related to this process. The approach is exemplified through cases from its application in the University of Athens Historical Archive.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Effectiveness of visualization for information retrieval through ontologies with entity evolution: the impact of ontology modeling",
            "Publication year": 2016,
            "Publication url": "https://www.igi-global.com/chapter/effectiveness-of-visualization-for-information-retrieval-through-ontologies-with-entity-evolution/142654",
            "Abstract": "Incorporating digital tools in the business and scientific research workflows is at the moment an on-going process, challenging and demanding as every domain has its own needs in terms of data models and information retrieval methods. The information in some domains involves entity evolution, a characteristic that introduces additional tasks, such as finding all evolution stages of an entity, and poses additional requirements for the information retrieval process. In this paper, we present a user study aiming to investigate how the different aspects of ontology modelling affect the performance and effectiveness of users regarding information retrieval tasks that are carried out using visualization methods. The results of the user study are analyzed and guidelines for ontology design are offered.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:738O_yMBCRsC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Methodology for Design of Online Exhibitions.",
            "Publication year": 2013,
            "Publication url": "http://soda.dit.uop.gr/sites/hcivr2.dit.uop.gr/files/publicationfiles/4615-13030-1-SM.pdf",
            "Abstract": "The process of designing systems or products largely depends on a number of decisions, like “who do I design for?”,“what should my product do?”,“what are the user requirements?” etc. The developing teams usually base their decisions on experience and/or heuristics and this is particularly the case, in the development of online products and especially online exhibitions. The different solutions are frequently case studies of specific museums or institutions that wish to provide online content to actual or possible visitors. In addition, the interdisciplinary nature of the endeavor, involving museology, technology but also education, poses important design problems. In the following sections, we present a generic methodology for the design of online exhibitions, using top-down processes and transferable findings across museum types that wish to assist the designers during the early decision stages.This paper provides an introduction to the field, emphasising its interdisciplinary nature and reviews related work in the area of online exhibition design. It also presents an overview of the methodology, elaborating on the individual methodology steps; in particular, the processes for determining the visitors’ perception of the museum (degree of museumness); the museum needs that require to be supported; the educational approach to be adopted; the relevance to life-long learning activities; the approach to adaptivity; and user involvement have been reviewed.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Transactional e-government services: An integrated approach",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-46138-8_44",
            "Abstract": "Although form-based services are fundamental to e-government activities, their widespread does neither meet the citizen’s expectations, nor the offered technological potential. The main reason for this lag is that traditional software engineering approaches cannot satisfactorily handle all of electronic services lifecycle aspects. In this paper we present experiences from the Greek Ministry of Finance’s e-services lifecycle, and propose a new approach for handling e-service projects. The proposed approach has been used successfully for extending existing services, as well as developing new ones.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:u_35RYKgDlwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Personal ontology creation and visualization for a personal interaction management system",
            "Publication year": 2008,
            "Publication url": "http://hci-vr.dit.uop.gr/papers/%5BC43%5D_pim2008-katifori-etal.pdf",
            "Abstract": "Ontologies offer a flexible and expressive layer of abstraction, very useful for capturing the semantics of information repositories and facilitating their retrieval either by the user or by the system to support user tasks. This work presents an ontology-based user profiler, in the context of a Personal Interaction Management System (PIMS). The profiler, based on an ontology of the users’ domain, enables them to create their personal ontology by initially choosing one of the available template ontologies as a starting point, which they subsequently populate and customize. The profiler employs a web interface which allows users to populate their personal ontology through forms, hiding ontology complexities and peculiarities. Forms are dynamically generated through ontology views, which are specified by ontology designers.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "\" Take me Home\": AR to Connect Exhibits to Excavation Sites.",
            "Publication year": 2020,
            "Publication url": "http://ceur-ws.org/Vol-2687/paper1.pdf",
            "Abstract": "We present the design and implementation of an AR application that connects museum objects to their original locations in archaeological sites; our aim is both to solve the museum de-contextualization problem and to promote exploration of the archaeological sites in a region. The application projects the museum object upon the archaeological site and its original location, bringing the landscape into the museum experience. We outline technical challenges encountered and solutions adopted. Since this is a work in progress, further user testing remains to evaluate our approach and the app.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:epqYDVWIO7EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Human Computer Interaction and Virtual Reality Lab (University of Peloponnese): Overview and Current Challenges.",
            "Publication year": 2018,
            "Publication url": "http://ceur-ws.org/Vol-2235/paper10.pdf",
            "Abstract": "HCI-VR lab in Short. The Human-Computer Interaction and Virtual Reality Lab, at the Department of Informatics and Telecommunications of the University of Peloponnese, aims to conduct high quality research in areas related to the analysis, design, development, and evaluation of HCI and VR systems and applications, and in parallel to support the teaching requirements of the department in the respective field. Over the last years the HCI-VR lab particularly focuses on Cultural Heritage and develops technologies primarily for spaces of cultural heritage that cover the diverse needs of heterogeneous audiences providing holistic visitor experience. The HCI-VR lab is actively participating in National and European projects on Cultural Heritage, such as FP7 Experimedia (https://hci-vr. dit. uop. gr/experimedia), H2020 CrossCult (www. crosscult. eu) and multiple projects from the National Strategic Reference Framework.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Task-Centered Information Management",
            "Publication year": 2007,
            "Publication url": "https://eprints.lancs.ac.uk/id/eprint/12865/",
            "Abstract": "Task-Centered Information Management - Lancaster EPrints LOADING Skip to main content \nLancaster University homepage Home Browse By Year By Subject By Department Search \nHelp Task-Centered Information Management Dix, Alan and Catarci, T. and Katifori, A. and \nLepouras, G. and Poggi, A. (2007) Task-Centered Information Management. In: First \nInternational DELOS Conference. LNCS (4877). Springer, pp. 197-206. Full text not \navailable from this repository. Item Type: Contribution in Book/Report/Proceedings \nUncontrolled Keywords: /dk/atira/pure/researchoutput/libraryofcongress/qa75 Subjects: \nDepartments: Faculty of Science and Technology > School of Computing & \nCommunications ID Code: 12865 Deposited By: ep_importer_comp Deposited On: 12 Aug \n2008 12:32 Refereed?: No Published?: Published Last Modified: 12 Apr 2020 23:22 URI: \nhttps://eprints.lancs.ac.uk/id/eprint/12865 Lancaster via …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Nano-Games for Cultural Venues: the HEAL game",
            "Publication year": 2020,
            "Publication url": "http://journal.seriousgamessociety.org/index.php/IJSG/article/view/344",
            "Abstract": "Many are the times when visitors leave an exhibition without a clue about its message. In an effort to eliminate this phenomenon, museums, institutes and organisations (MIOs) adopt more attractive, engaging and fun content to provide a high quality and fast learning experience. Games seem to be an interesting suggestion to this approach but they are time consuming. To this end, we introduce nano-games. We define nano-games as short, easy to master, self–contained games of a single level of difficulty, having basic and direct rules that stay unaltered throughout the play and challenge players with clearly defined goals reachable within tens of seconds of gameplay. This approach has been adopted and evaluated in the premises of European Center for Nuclear Research (CERN).",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:EYYDruWGBe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mindmap-Inspired Semantic Personal Information Management",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.676.7970",
            "Abstract": "Users nowadays need to manage large amounts of information, including documents, e-mails, contacts, and multimedia content. To facilitate the tasks of organisation, maintenance, and retrieval of personal information, a number of semantics-based methods have emerged; these methods employ (personal) ontologies as an underlying infrastructure for organising and querying the personal information space. In this paper we present OntoFM, a novel personal information management tool that offers a mindmap-inspired interface to facilitate user interactions with the information base. Besides serving as an information retrieval aid, OntoFM allows the user to specify and update the semantic links between information items, constituting thus a complete personal information management tool. Keywords personal information management, mindmaps, file manager,",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual museums for all: employing game technology for edutainment",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10055-004-0141-1.pdf",
            "Abstract": "Museums have started to realise the potential of new technologies for the development of edutainment content and services for their visitors. Virtual reality technologies promise to offer a vivid, enjoyable experience to the museums guests, but the cost in time, effort and resources can prove to be overwhelming. In this paper, we propose the use of 3D game technologies for the purpose of developing affordable, easy to use and pleasing virtual environments. To this end, we present a case study based on an already developed version of a virtual museum and a newly implemented version that uses game technologies. The informal assessment indicates that game technologies can offer a prominent and viable solution to the need for affordable desktop virtual reality systems.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Barriers to electronic service development",
            "Publication year": 2005,
            "Publication url": "https://www.jstor.org/stable/10.2979/ESJ.2005.4.1.41",
            "Abstract": "E-government initiatives have been proven to deliver significant benefits, both for suppliers of electronic services (public authorities and organizations) and for the public, to whom services are addressed. However, the pace with which electronic services are made available and adopted is lower than planned or expected; governments tend to be slow in releasing new services, and citizens often prefer to conduct business with the government through paper forms and physical presence, rather than using online methods. This indicates that certain barriers exist that hinder the transition to electronic services. In this paper, we present the results of a survey among electronic service stakeholder groups, to identify the most important barriers to electronic service development. Documentation of barriers is considered important, since administrations may take certain measures to overcome them. Hints on how specific …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:qjMakFHDy7sC",
            "Publisher": "Indiana University Press"
        },
        {
            "Title": "An Integrated Environment for Cataloguing and Online Presentation of Museum Exhibits",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/50404965/107.pdf",
            "Abstract": "The paper presents an integrated environment which enables museum personnel to catalogue and at the same time publish online museum exhibits. The system is based on international standards and is highly customisable to cater the needs of a variety of museum types. Moreover, the underlying database allows storing for the same exhibit documentations for different audiences and in multiple languages, while it is extendable to accommodate new media types, languages, exhibits and information categories. The administrative part of the environment permits the restriction of certain functions to specific personnel roles, enforcing thus a general museum security policy regarding access to and modification of information. The environment presented is currently in use at the Athens University History Museum.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Defence Scientific Information & Documentation Centre"
        },
        {
            "Title": "exhiSTORY: Smart exhibits that tell their own stories",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X17324093",
            "Abstract": "Museum exhibitions are designed to tell a story; this story is woven by curators and in its context a particular aspect of each exhibit, fitting to the message that the story is intended to convey, is highlighted. Adding new exhibits to the story requires curators to identify for each exhibit its aspects that fit to the message of the story and position the exhibit at the right place in the story thread. The availability of rich semantic information for exhibits, allows for exploiting the wealth of meanings that museum exhibits express, enabling the automated or semi-automated generation of practically countless stories that can be told. Personalization algorithms can then be employed to choose from these stories the ones most suitable for each individual user, based on the semantics of the stories and information within the user profile. In this work we examine how opportunities arising from technological advances in the fields of IoT …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:_B80troHkn4C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Proteomic feature maps: a new visualization approach in proteomics analysis",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1532046409000021",
            "Abstract": "The different steps of a proteomics analysis workflow generate a plethora of features for each extracted proteomic object (a protein spot in 2D gel electrophoresis (2-DE), or a peptide peak in liquid chromatography–mass spectrometry (LC–MS) analysis). Yet, the joint visualization of multiple object features on 2D gel-like maps is rather limited in currently available proteomics software packages. We introduce a new, simple, and intuitive visualization method that utilizes spheres to represent proteomic objects on proteomic feature maps, and exploits the spheres size and color to provide simultaneous visualization of user-selected feature pairs. Our contribution, a unified and flexible visualization mechanism that can be easily applied at any stage of a 2-DE or a LC–MS based differential proteomics study, is demonstrated and discussed using five representative scenarios. The joint visualization of proteomic object …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "A Context-Based Adaptive Visualization Environment",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11082437641237539593&hl=en&oi=scholarr",
            "Abstract": "Digital libraries and historical archives are increasingly employing visualization systems to facilitate the information retrieval and knowledge extraction tasks of their users. Typically, each organization employs a single visualization system, which may not suit best the needs of certain user groups, specific tasks, or properties of document collections to be visualized. In this paper, we present a context-based adaptive visualization environment, which embeds a set of visualization methods into a visualization library, from which the most appropriate one is selected for presenting information to the user. Methods are selected by examining parameters related to the user profile, system configuration and the set of data to be visualized, and employing a set of rules to assess the suitability of each method. The presented environment additionally monitors user behavior and preferences to adapt the visualization method selection criteria.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:NJ774b8OgUMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent user task oriented systems",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Antonella-Poggi/publication/252699132_OntoPIM_From_Personal_Information_Management_to_Task_Information_Management/links/54acf7d40cf23c69a2b85273/OntoPIM-From-Personal-Information-Management-to-Task-Information-Management.pdf#page=20",
            "Abstract": "Most existing human-computer interfaces are now based on the WIMP (Windows, Icons, Menus, Pointers) paradigm and on the desktop metaphor. Each application is targeted towards editing one specific type of “document”. Current desktop oriented systems propose a mostly disconnected set of generic tools (word processor, e-mail reader, drawing tool, CD burning application, etc.). In such a setting, a user which is executing a specific task (eg making a CD from a set of files) will likely use more than one of these tools. The fact that they are running on one system without being connected leads to awkward situations such as the user reentering or copying data between applications. Furthermore, the same user is very likely to run multiple times the same task and often, she will do this in a similar manner. For example, a music fan will likely find himself burning more than one music CD. Having a system which is aware that some task is being run would allow for some anticipation and could relieve the user from much routine procedures.To provide the user with complete power of her desktop computer, we propose the idea that she should be provided with a system having knowledge of her specific tasks. Such a task-oriented system should be designed to aid the user in managing her day-to-day tasks and helping her gain in efficiency. We consider that both tasks themselves and how they are to be lead are specific to each user. Building a system which is both adapted to the user and simple enough for being used by a non-expert user, is a challenge. At one extent, full adaptability is asking the user to specify herself her tasks. At the other extent …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time2hide: spatial searches and clutter alleviation for the desktop",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1385569.1385631",
            "Abstract": "With information abundance the user's desktop is often cluttered with files and folders. Existing tools partially address the clutter problem. Time2Hide enhances desktop functionality by allowing icons that are not used for a long time to gradually fade and merge with the background. This aims to alleviate the problem of icon clutter. Users can also perform spatial searches, defining areas of the desktop they wish to search for icons; can reveal one or more hidden files or can go back in time animating the desktop and its changes. With Time2Hide users can still use the desktop as a place for storing files and folders, without worrying about the possible clutter and without being afraid that the files might be moved to an unknown location. The new desktop has been implemented and evaluated. Evaluation results reveal that such an enhanced desktop can significantly support users and propose suggestions for further …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling visitors' profiles: A study to investigate adaptation aspects for museum learning technologies",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1841317.1841322",
            "Abstract": "The time restrictions that apply in museum learning increase the need for adaptive and/or adaptable technologies. However, deriving a visitor's profile is not an easy task, since most common ways (asking direct questions, recording user actions) are either intrusive or time consuming. Observing the visitors' movement (visiting style) within the museum could provide valuable information regarding adaptivity. In the present study, issues of visiting style were explored and statistical significance was found once different factors were analyzed. Most importantly, there seems to be a connection between the way people move in a museum and the way they prefer to approach and process information cognitively. Environmental factors that can affect the expression of visiting style were also identified.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:YOwf2qJgpHMC",
            "Publisher": "ACM"
        },
        {
            "Title": "The little ones, the big ones and the code: utilization of digital educational games in primary school pupils",
            "Publication year": 2015,
            "Publication url": "http://soda.dit.uop.gr/sites/hcivr2.dit.uop.gr/files/publicationfiles/TheLittleOnesTheBigOnesAndTheCode.pdf",
            "Abstract": "This paper is a case study on the use of educational digital games to elementary pupils and deals with games that promote algorithmic thinking as well as the basic principles of programming. The study involved 94 young pupils who worked in pairs (Pair Programming) trying to solve puzzle games from code. org website during their visit to the University of Peloponnese in the context of the European Code Week. Factors such as satisfaction, evaluation of perceived knowledge and willingness to use games in future in the learning process were examined. Furthermore it’s discussed whether a short activity like this can result to long term motivation of pupils. The article concludes that:(a) the pupils enjoyed the games and wished to repeat corresponding activities.(b) They considered that by playing, they acquired basic skills and knowledge as far as programming principles were concerned.(c) They preferred Pair Programming and estimated that they could learn better by assisting one another. Finally, it seems that the few hours visit was not enough to motivate most pupils to carry on with the activities at home by themselves.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tools for second language support",
            "Publication year": 2003,
            "Publication url": "https://strathprints.strath.ac.uk/2653/",
            "Abstract": "The second language problem is the context in which non-native English speakers are required to interact with English-based computer systems. In other papers, we have characterized this setting and proposed methods of supporting such users. The present paper details several tools that we have developed to assist in our work with second language support. A prime consideration in such tool development is to facilitate easy management of alternative language resources. The need for criteria to direct second language support and the role of such tools in helping to evaluate such criteria is detailed here.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Lawrence Erlbaum Associates"
        },
        {
            "Title": "Teacher and student views on educational robotics: The Pan-Hellenic competition case",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Anastasios-Theodoropoulos/publication/318304544_Teacher_and_student_views_on_educational_robotics_The_Pan-Hellenic_competition_case/links/596230bb0f7e9b819472ca24/Teacher-and-student-views-on-educational-robotics-The-Pan-Hellenic-competition-case.pdf",
            "Abstract": "The present work is an observational study recording the teachers’ and students’ attitudes from the Pan-Hellenic Educational Robotics (ER) competition. The study investigates the benefits of students’ involvement with robotics regarding skills, motivation and learning. Additionally, it is researched whether ER should be introduced in the compulsory curricula. A qualitative methodology was used with teachers. Although the sample was relatively small, the results were quite homogeneous showing a very high level of engagement and motivation of teachers and students. A mainly quantitative methodology was used to gather data from students. The results show that there are numerous benefits for students: they seem to increase their collaboration, problem solving and creativity skills; understand STEM concepts in computer science and engineering, and gaining programming knowledge in particular. Also, most of the teachers and many of the students consider that ER should be part of the compulsory curriculum. Under certain conditions, ER could be an essential part of the school program, as it can bring together young people from all over the world to learn and develop important 21st century skills.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual reality in the e-Society",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s10055-006-0064-0",
            "Abstract": "This special issue explores the extent to which virtual reality (VR) is affecting the creation of an electronic society. E-Society is a broad term used to describe a research area covering aspects of digital technologies for large user communities. Recent years have seen the emergence of various electronic services in an attempt to facilitate everyday life and improve the way common tasks are being carried out. E-business and e-learning were of the first areas of e-Society to emerge. E-business refers to the use of information and communication technologies to facilitate transactions between businesses and customers or between businesses. Online shops, often called virtual shops offer customers the possibility to buy products through Internet. E-learning on the other hand encompasses technologies that allow teachers and students to interact either synchronously or asynchronously.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "A framework for managing the lifecycle of transactional e-government services",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S073658530300011X",
            "Abstract": "Filling and submission of electronic forms is a key issue for e-government, since most electronic services offered in this context include some variant of electronic forms. Insofar, IT experts are placed in the centre of electronic forms services lifecycles, undertaking the analysis, design, implementation and maintenance phases. This practice, however, implies various impediments, such as the need for multitudinous teams with diverse skills. In this paper, we present experiences from developing and maintaining a set of electronic services for the Greek Ministry of Finance, and propose an approach to handling electronic services’ lifecycle that balances responsibilities between domain experts and IT professionals. This approach enables a more holistic management of the electronic service lifecycle, by employing modelling and representation in high levels of abstraction and incorporating tools for automatically …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Using social media to stimulate history reflection in cultural heritage",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753390/",
            "Abstract": "CrossCult H2020 is a European project, the aim of which is the reflection of history in a cultural setting. In this paper, we describe how social media can be linked to cultural heritage and in particular how we can incorporate games, social networks, history reflection and culture. The paper presents the case study of one of the project pilots, to show how history reflection can be enhanced with the use of social networks.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sound and kinesthesis in virtual environments: pilot experiment to compare physical and digital sound contradictions",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003737",
            "Abstract": "Although virtual reality is a field that attracts research interest over the past years, certain aspects of the virtual environments are often overlooked. For example, the importance of sound in virtual environments is recognized but it remains rather vague, since the relation between virtual world and physical world sounds is not studied in detail. In addition, kinesthetic parameters are also important, since the user movement can affect the overall experience. The present study focuses on human factors in conditions that the physical and the virtual world sounds are contradicting. Kinesthesis is also considered and combined with user vision and hearing. There were 2 experimental conditions, in one the users experienced three levels of sound-vision in a virtual world and no sound on the physical world, while they are walking on a smooth surface and in the second experimental condition, the same three levels of sound …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:t6usbXjVLHcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A game-engine based virtual museum authoring and presentation system",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1413634.1413714",
            "Abstract": "In this paper we present a system that facilitates virtual museum development and usage. The system is based on a game engine, ensuring thus minimal cost and good performance, and includes provisions that enable museum curators design the virtual museum without any specialized knowledge. Besides visual and auditory information, museum curators may also provide metadata which provide additional information to the visitor, while they can be also exploited for searching for exhibits with certain properties. A guide is also included in the museum, to present additional information to the visitors and aid them throughout their tour.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach to designing and implementing virtual museums",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/41649300/CHA2000b.pdf",
            "Abstract": "The current paper describes an approach to designing and implementing a virtual environment comprising ten different museums. The number of museums as well as the variety of their exhibits lead to the adoption of a generalised strategy that catered for all museum presentation needs and allowed for future expansion. Furthermore, the system architecture supports the delivery of multimedia content either over the Internet or via a local immersive virtual reality installation.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Building a VR-Museum in a Museum",
            "Publication year": 2001,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.493.3300&rep=rep1&type=pdf",
            "Abstract": "Past years have seen the exploitation of multimedia techniques and lately the introduction of virtual reality methods to create new forms of presentation for museums' exhibitions. Virtual Reality can offer a number of advantages to museums, offering a way to overcome some common problems like the lack of space or the need of visitors to interact with the exhibits. A broad categorisation of virtual museums reveals that they vary from fully immersive cave systems to simple multimedia presentations. In our approach to develop a virtual reality museum we have designed a virtual environment (VE) where guests can visit a total of ten different museums. The processes of digitisation, architectural design and exhibit presentation are outlined and points of particular importance are explained. Exhibits from the real world museums have been digitised and integrated in the VE. The system has been implemented in two versions: one fully immersive and one with a stereo display.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Visualizing the Educational Data Mining Literature",
            "Publication year": 2020,
            "Publication url": "https://www.ejers.org/index.php/ejers/article/view/2306",
            "Abstract": "This article provides a visualization of a literature review in students’ performance prediction using educational data mining (EDM) techniques for the period 2015-2019. The results of the review are presented concisely and simply with the use of diagrams. Various aspects of the literature are examined, such as the algorithms adopted, the type of results drawn, the educational setting of the application and the actual exploitation of the outcomes. Findings indicate that tertiary education dominates the EDM field; in contrast, the focus given to secondary and primary education is minimal.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving museum visitors' Quality of Experience through intelligent recommendations: A visiting style-based approach",
            "Publication year": 2013,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/33902",
            "Abstract": "This paper investigates the effect that smart routing and recommendations can have on improving the Quality of Experience of museum visitors. The novelty of our approach consists of taking into account not only user interests but also their visiting styles, as well as modeling the museum not as a sterile space but as a location where crowds meet and interact, impacting each visitor's Quality of Experience. The investigation is done by an empirical study on data gathered by a custom-made simulator tailored for the museum user routing problem. Results are promising and future potential and directions are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:_xSYboBqXhAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Ontofm: A personal ontology-based file manager for the desktop",
            "Publication year": 2013,
            "Publication url": "https://arxiv.org/abs/1307.2018",
            "Abstract": "Personal ontologies have been proposed as a means to support the semantic management of user information. Assuming that a personal ontology system is in use, new tools have to be developed at user interface level to exploit the enhanced capabilities offered by the system. In this work, we present an ontology-based file manager that allows semantic searching on the user's personal information space. The file manager exploits the ontology relations to present files associated with specific concepts, proposes new related concepts to users, and helps them explore the information space and locate the required file.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "‘Museum escape’: A game to increase museum visibility",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-34350-7_33",
            "Abstract": "A peripheral museum with a nevertheless important collection of ancient items, wished to increase its visibility and digital presence in order to become more known and attract new visitors. Among the different solutions designed and implemented, we also designed a series of games of different kinds (i.e. mini vs complex games) for different purposes, like profiling of potential visitors and advertising the venue in social media. Based on lessons learnt from physical games played at museums of the same type in the same region, we designed and implemented a museum escape game. The game is presented here, to provide implementation details regarding the concept, the game mechanics, the interface design, the technical details, as well as the game art. We conclude with primary user testing and future steps that include plans for creating museum escape games with different technologies, like …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:z_wVstp3MssC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Creating an Historical Archive Ontology: Guidelines and Evaluation",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=4090076112766562001&hl=en&oi=scholarr",
            "Abstract": "Ontologies have been proven invaluable tools both for the semantic web and for personal information management. In the context of a historical archive an ontology may provide meaningful and efficient support for search tasks as well as be used as a tool for storage and presentation of historical data. The creation however of such an ontology is complex, since the digitized archive documents are not in text format and the concepts that must be captured may vary among different time periods. This work presents a user-centric methodological approach for extracting the ontology of an historical archive focusing on the evaluation issues related to this process. The approach is exemplified through cases from its application in the University of Athens Historical Archive.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:uLbwQdceFCQC",
            "Publisher": "IEEE Xplore"
        },
        {
            "Title": "Real exhibitions in a virtual museum",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10055-004-0121-5.pdf",
            "Abstract": "When creating a virtual environment open to the public a number of challenges have to be addressed. The equipment has to be chosen carefully in order to be be able to withstand hard everyday usage, and the application has not only to be robust and easy to use, but has also to be appealing to the user, etc. The current paper presents findings gathered from the creation of a multi-thematic virtual museum environment to be offered to visitors of real world museums. A number of design and implementation aspects are described along with an experiment designed to evaluate alternative approaches for implementing the navigation in a virtual museum environment. The paper is concluded with insights gained from the development of the virtual museum and portrays future research plans.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Using bluetooth technology for personalised visitor information",
            "Publication year": 2005,
            "Publication url": "http://soda.dit.uop.gr/sites/hcivr2.dit.uop.gr/files/publicationfiles/USING_BLUETOOTH_TECHNOLOGY_FOR_PERSONALISED_VISITO.pdf",
            "Abstract": "The proposed technology intends to use museum visitors’ mobile phones, in order to decrease the cost of technology for museum use and also to avoid cognitive overload of visitors, by allowing them to use a device they own and know how to use. The use of Bluetooth technology within the museum environment can provide an efficient and easy way to provide visitors with personalised information on site. After distinguishing between four types of visitors, we propose brief scenarios of use, in order to cover each type’s needs.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A study of micro-augmentations: personality, gender, emotions and effects on attention and brain waves",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3291533.3291582",
            "Abstract": "The concept of micro-augmentations is a new augmented reality tool and methodology. It can provide novel ways to interact with cultural content (including learning content). The purpose of the present work was to study the effects of micro-augmentations on human brain waves and to find possible relations between micro-augmentations and personality characteristics, such as cognitive styles. The gender of the participants and the emotions they experienced during their exposure to micro-augmented content was also recorded and analyzed. An EEG headset was used to measure participant's brainwave activity and waves measured were theta, high beta, low gamma and high gamma, as well as participants' attention levels. After the experiments, participants answered questionnaire recording the emotions they experienced and their personality characteristics. The results of the study showed that micro …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Historical Archive Ontologies–Requirements, Modeling and Visualization",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=10253030016809286887&hl=en&oi=scholarr",
            "Abstract": "Most ontology development methodologies and tools for ontology management deal with ontology snapshots, i.e. they model and manage only the most recent version of ontologies, which is inadequate for contexts where the history of the ontology is of interest, such as historical archives. This work presents a set of requirements for the modeling and visualization of a temporal ontology used as a tool for the representation of historical information. In accordance to these requirements, a visualization plug-in was designed and implemented, featuring a set of tools that enable users to efficiently examine ontology temporal characteristics such as class and instance evolution along the timeline.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE Xplore"
        },
        {
            "Title": "The Personality of the Influencers, the Characteristics of Qualitative Discussions and Their Analysis for Recommendations to Cultural Institutions",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/350016",
            "Abstract": "Social media usage is affecting peoples’ views through opinion sharing, a fact that has started to attract cultural institutions, as it is possible that this procedure can possibly be a part of a museum experience. As the main goal of a cultural institution is the maximization of senses stimulation, the device that is offered to the visitors’ hands everyday and every moment, becomes an important tool for the art spaces. In this notion we perform research on issues that can be of great importance for the museum’s online presence and attraction. We focus on establishing the personality of influencers related to culture, as well as the characteristics of qualitative discussions on the social media. Crosscult Project is an EU funded project, that aims to spur a change in the way European citizens appraise History, and sets that basis of our research as the experiments are conducted within its scope of. Through the experimental procedure, we collect information in order to define the character of the influencer and the substances of a “serious” conversation.“Serious” conversations are regarded the ones in which a cultural organization can participate actively and benefit from the participation. We present the results of our experimental evaluation and analyze how cultural institutions can benefit from the outcomes of our research. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ye4kPcJQO24C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Personal ontology creation and visualization for a personal interaction management system",
            "Publication year": 2008,
            "Publication url": "https://www.academia.edu/download/30937720/pim2008-katifori-etal.pdf",
            "Abstract": "Ontologies offer a flexible and expressive layer of abstraction, very useful for capturing the semantics of information repositories and facilitating their retrieval either by the user or by the system to support user tasks. This work presents an ontology-based user profiler, in the context of a Personal Interaction Management System (PIMS). The profiler, based on an ontology of the users’ domain, enables them to create their personal ontology by initially choosing one of the available template ontologies as a starting point, which they subsequently populate and customize. The profiler employs a web interface which allows users to populate their personal ontology through forms, hiding ontology complexities and peculiarities. Forms are dynamically generated through ontology views, which are specified by ontology designers.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:g3aElNc5_aQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Context and adaptivity-driven visualization method selection",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/chapter/intelligent-user-interfaces/24476",
            "Abstract": "Novel and intelligent visualization methods are being developed in order to accommodate user searching and browsing tasks, including new and advanced functionalities. Besides, research in the field of user modeling is progressing in order to personalize these visualization systems, according to its users’ individual profiles. However, employing a single visualization system, may not suit best any information seeking activity. In this paper we present a visualization environment, which is based on a visualization library, ie is a set of visualization methods, from which the most appropriate one is selected for presenting information to the user. This selection is performed combining information extracted from the context of the user, the system configuration and the data collection. A set of rules inputs such information and assigns a score to all candidate visualization methods. The presented environment additionally …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:HDshCWvjkbEC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A fast pace method for involving children in edutainment-technology design",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4455974/",
            "Abstract": "Aiming at edutainment technologies for museums, elements of participatory design techniques and focus groups were combined under the theoretical framework of the cycle of creative imagination in order to involve 10 year-old children in the design process of such applications. In contrast to existing practices where children are called to evaluate games designed by adults, the proposed method involves children from the initial phases of development. The main advantage of the proposed method is its short duration (1-2 school days) allowing for its wide use. The distinct steps of the method assist children in visualizing the possibilities of using new technologies in museums. The method was tested with children in a primary school. The ideas produced by the children demonstrated their ability to generate concepts and inspire the development of new gaming technologies.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Subtitled interaction: Complementary support as an alternative to localization",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1071581903001332",
            "Abstract": "Many computer users face problems in their interaction as a result of the native language employed by the application. The language of the application is often at variance with the native language of its users. This issue is frequently addressed through localization. In turn, localization generates a range of new problems. We propose an alternative to localization that is analogous to cinematic subtitles. This has the potential to reduce the user interaction defects that otherwise arise with localization whilst benefiting users through an additional channel of information in their own language. This paper outlines a prototype implementation and describes our initial evaluation of this approach. We suggest that our complementary ‘subtitles’ promise consistent support for all applications in the user's computing environment and yield a system that is expandable and much easier to maintain than pre-localized software.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "International Journal of Virtual Communities and Social Networking",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/pdf.aspx?tid%3D146270%26ptid%3D118594%26ctid%3D15%26t%3Dtable+of+contents",
            "Abstract": "International Journal of Virtual Communities and Social Networking Page 1 The International \nJournal of Virtual Communities and Social Networking is indexed or listed in the following: ACM \nDigital Library; Bacon’s Media Directory; Cabell’s Directories; DBLP; GetCited; Google Scholar; \nINSPEC; JournalTOCs; Library & Information Science Abstracts (LISA); MediaFinder; The \nIndex of Information Systems Journals; The Standard Periodical Directory; Ulrich’s Periodicals \nDirectory Copyright The International Journal of Virtual Communities and Social Networking \n(IJVCSN) (ISSN 1942-9010; eISSN 1942-9029), Copyright © 2015 IGI Global. All rights, \nincluding translation into other languages reserved by the publisher. No part of this journal \nmay be reproduced or used in any form or by any means without written permission from the \npublisher, except for noncommercial, educational use including classroom teaching . or in . . …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interconnecting Objects, Visitors, Sites and (Hi) Stories across Cultural and Historical Concepts",
            "Publication year": 2016,
            "Publication url": "http://hypatia.teiath.gr/xmlui/handle/11400/20144",
            "Abstract": "Υπατία - Interconnecting Objects, Visitors, Sites and (Hi)Stories across Cultural and Historical \nConcepts Toggle navigation ΤΕΙ Αθήνας Είσοδος Αρχική Σελίδα / CrossCult Project / \nPublications / Εμφάνιση Τεκμηρίου Interconnecting Objects, Visitors, Sites and (Hi)Stories \nacross Cultural and Historical Concepts Vasilakis, Costas; Antoniou, Angeliki; Lepouras, \nGeorge; Wallace, Manolis; Lykourentzou, Ioanna; Naudet, Yannick URI: http://hdl.handle.net/11400/20144 \n10.1007/978-3-319-48496-9_39 Ημερομηνία Δημοσίευσης: 2016 Τύπος Τεκμηρίου: Δημοσίευση \nσε συνέδριο Όνομα Συνεδρίου: 6th International Euro-Mediterranean Conference (EuroMed \n2016), October 31st-November 5th, 2016, Nicosia, Cyprus Εμφάνιση πλήρους εγγραφής \nΑρχεία σε αυτό το τεκμήριο Αρχεία Μέγεθος Μορφότυπο Προβολή Δεν υπάρχουν αρχεία που \nσχετίζονται με αυτό το τεκμήριο. Αυτό το τεκμήριο εμφανίζεται στην ακόλουθη συλλογή(ές) «…",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:PELIpwtuRlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent context-sensitive interactions on desktop and the web",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1145706.1145710",
            "Abstract": "In this paper we describe briefly three systems: onCue a desktop internet-access toolbar, Snip! ta web-based bookmarking application and ontoPIM an ontology-based personal task-management system. These embody context issues to differing degrees, and we use them to exemplify more general issues concerning the use of contextual information in'intelligent'interfaces. We look at issues relating to interaction and'appropriate intelligence', at different types of context that arise and at architectural lessons we have learnt. We also highlight outstanding problems, in particular the need to computationally describe and communicate context where reasoning and inference is distributed.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improving e-Form Layout Through Analysis of Form Semantics and Validation Checks.",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.75.5562&rep=rep1&type=pdf",
            "Abstract": "Transaction services offered by public authorities vary from simple forms with few fields to multi-form compound documents with hundreds of input areas. In the latter case, field placement within forms is of particular importance for facilitating the filling and error correction processes. In this paper we present an approach to improving the form layout by exploiting validation checks that are usually associated with electronic forms, as well as semantic information that may be attached to form fields by designers.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Personalized augmented reality experiences in museums using Google Cardboards",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8022676/",
            "Abstract": "In this paper we examine the suitability of the Google Cardboard as a means for the delivery of personalized cultural experiences. Specifically, we develop the content and create the application required in order to provide highly personalized visits to the Archaeological Museum in Tripolis, Greece. We also examine the usability issues related to the use of Google Cardboards. Early results are promising, and based on them we also outline the next steps ahead.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:Mojj43d5GZwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Historical research in archives: user methodology and supporting tools",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00799-010-0062-4.pdf",
            "Abstract": "Historic research involves finding, using, and correlating information within primary and secondary sources, in order to communicate an understanding of past events. In this process, historians employ their scientific knowledge, experience, and intuition to formulate queries (who was involved in an event, when did an event occur etc.), and subsequently try to locate the pertinent information from their sources. In this article, the authors investigate how historians formulate queries, which query terms are chosen, and how historians proceed in searching for related information in sources. The insight gained from this investigation can be subsequently used for organizing documents within historical source repositories and building tools that will enable historians to access the needed information more rapidly and fully.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Students teach students: Alternative teaching in Greek secondary education",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10639-014-9327-7.pdf",
            "Abstract": "The students of a Greek junior high school collaborated to prepare the teaching material of a theoretical Computer Science (CS) course and then shared their understanding with other students. This study investigates two alternative teaching methods (collaborative learning and peer tutoring) and compares the learning results to the traditional learning context. A test was used to measure all participating students’ learning results and a questionnaire was distributed to record participant student attitudes towards the alternative teaching conditions. The questionnaire was designed to evaluate each aspect in terms of perceived knowledge, experience, satisfaction, diversity, oddness and interest. The analysis explores potential differences of students’ learning results between alternative and traditional teaching and also differences in the two aspects in relation to students’ preferences. Results provide evidence …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Multilingual Web Site Construction and Maintenance",
            "Publication year": 2000,
            "Publication url": "http://soda.dit.uop.gr/sites/sdbs.dit.uop.gr/files/ml-web-site.pdf",
            "Abstract": "The construction of multilingual web sites is probably the best answer to addressing the problem of the diverse cultural background of the Internet community. However, developing multiple instances of the same site in different languages induces increased overhead for both the implementation and the maintenance phase. The paper reviews current techniques and describes an alternative to constructing multilingual web sites, which eases the development and maintenance phases, without possessing any of the drawbacks of existing tools. The paper concludes proposing possible future enhancements.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domain expert user development: The SmartGov approach",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/1284621.1284623",
            "Abstract": "The European Union's SmartGov project transforms public-sector employees into developers of the government e-services used directly by the public.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ufrVoPGSRksC",
            "Publisher": "ACM"
        },
        {
            "Title": "ATMF: A Student-Centered Framework for the Effective Implementation of Alternative Teaching Methods for CSEd",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-39634-3_11",
            "Abstract": "The dynamic development of Informatics introduces new educational and pedagogical challenges, including the instructional design of teaching and learning. How can we teach our students better in such a growing and demanding field? Moreover, how can we motivate them and together have better learning results? This paper aims to give answers to these questions, through a student-centered framework for effectively encompassing alternative teaching methods within CS. The proposed framework (ATMF) summarizes the benefits of alternative teaching methods in contrast with known issues of traditional teaching. In addition, ATMF is built upon empirical evidence and concludes that alternative practices, if used under the right conditions, can provide increased motivation for learning and better learning outcomes.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:yB1At4FlUx8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Designing a virtual museum within a museum",
            "Publication year": 2001,
            "Publication url": "http://annacharisi.gr/wordpress/wp-content/uploads/2016/01/CHA2002-designVirtualMuseum.pdf",
            "Abstract": "A virtual environment system installed within a real museum can offer a number of advantages, which are discussed in this paper: overcoming the lack of exhibition space, responding to the need for interaction with certain exhibits, affording easy transfer of exhibitions to remote sites. This paper also presents an approach towards designing and developing a virtual reality museum comprising ten different museums. The processes of digitisation, architectural design and exhibit presentation are outlined and points of particular importance are explained. Exhibits from real world museums have been digitised and integrated in this VE.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "GrCHI: human-computer interaction set in rich heritage",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/fullHtml/10.1145/3226096",
            "Abstract": "Since then, we've been organizing networking gatherings and events each year, usually in conjunction with local and international conferences. Our most notable annual event is linked to World Usability Day. Usually two days long, it's co-organized with the Laboratory of New Technologies in Communication, Education, and the Mass Media of the National and Kapodistrian University of Athens (UoA NTLab). Our events take on different flavors depending on each year's theme; in 2010, an audience of more than 100 participants attended the Usability of Financial Systems event, with presentations from industry and academia focusing on information visualization. In 2011, for Education: Designing for Social Change, we gave the floor to 20 graduate and undergraduate students from eight different universities to present their theses.We have also been honored to host events with inspirational speakers by leveraging …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:5awf1xo2G04C",
            "Publisher": "ACM"
        },
        {
            "Title": "Visualizing a Temporally–Enhanced Ontology",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=16251135658204618312&hl=en&oi=scholarr",
            "Abstract": "Most ontology development methodologies and tools for ontology management deal with ontology snapshots, i.e. they model and manage only the most recent version of ontologies, which is inadequate for contexts where the history of the ontology is of interest, such as historical archives. This work presents a modeling for entity and relationship timelines in the Protege tool, complemented with a visualization plug-in, which enables users to examine entity evolution along the timeline.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for serious game development for cultural heritage: Case study for an archaeological site and museum",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2532630.2532633",
            "Abstract": "The unique aspects of different places seem to require games of different characteristics. This paper describes the initial steps of an attempt to design games for different places of cultural heritage and consists of three parts. In the first part, the descriptive model to be used as a classification method for games of different characteristics for cultural heritage sites is presented. In the second part, the model is used for the creation of different cultural heritage games. Finally, the third part presents a detailed case study of one of the developed games, showing the implementation and user testing processes as well as its efficiency in terms of education and visit motivation.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:xtRiw3GOFMkC",
            "Publisher": "ACM"
        },
        {
            "Title": "Domain expert user development",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=3547588852821486604&hl=en&oi=scholarr",
            "Abstract": "In a recent special issue of CACM [1] the approach of end-user development was presented and a number of articles tried to capture the benefits inherent in this approach and the broad range of issues that have to be tackled for end-user development to prosper.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:tS2w5q8j5-wC",
            "Publisher": "ACM"
        },
        {
            "Title": "BLUE Experiment Results and Evaluation",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=1470313084094695179&hl=en&oi=scholarr",
            "Abstract": "The goal of the BLUE experiment of EXPERIMEDIA is to explore the use of visitors' cognitive styles and content interest in order to personalize their experiences inside a museum. The related experimental runs were conducted at the Foundation of the Hellenic World (FHW) in Athens. The goals and requirements for the experiment have been described in EXPERIMEDIA deliverable D4. 8.1 and the initial experiment design in D4. 8.2.Four experimental sessions were conducted on four different dates. The total number of participants was 30: 15 male and 15 female with an average age of 30. Of the 30 participants 6 people visited alone, 17 with one or more friends, and 7 with family members. The sampling processes followed replicated the processes the museum will apply in order to attract new visitors, advertise exhibitions and also collect relevant information for user profiling.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Interview-Based User Study on the use of Visualizations for Folder Browsing",
            "Publication year": 2008,
            "Publication url": "https://scholar.google.com/scholar?cluster=12219672550458504703&hl=en&oi=scholarr",
            "Abstract": "Hierarchically structured data collections often need to be visualized for the purposes of digital information management and presentation. File browsing, in particular, has an inherent hierarchical structure and plays an important role in the context of Personal Information Management (PIM). A multitude of file browsers are nowadays available, offering different functionalities, while users adopt diverse practices and habits for browsing activities. In this paper, we investigate these aspects to obtain insights into their advantages and disadvantages and suggest solutions in the area of PIM, as well as in other domains employing similar visualization paradigms. The presented study focuses on the two most widespread visualizations used by file browsers, the indented list and zoomable interface paradigms, and assesses their effectiveness for various tasks and contexts, both by exploiting results on existing evaluations on hierarchy visualizations and folder hierarchy visualizations in particular, and by conducting an interview-based user study.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE Xplore"
        },
        {
            "Title": "Adaptive virtual reality museums on the web",
            "Publication year": 2005,
            "Publication url": "https://www.igi-global.com/chapter/adaptive-virtual-reality-museums-web/4185",
            "Abstract": "This chapter presents an architecture for supporting the creation of adaptive virtual reality museums on the Web. It argues whether the task of developing adaptive virtual reality museums is a complex one, presenting key challenges, and should thus be facilitated by means of a supporting architecture and relevant tools. The proposed architecture is flexible enough to cater for a variety of user needs, and modular promoting extensibility, maintainability, and tailorability. Adoption of this architecture will greatly simplify the development of adaptive virtual reality museums, reducing the needed effort to exhibit digitisation and user profile specification; user profiles are further refined dynamically through the user data recorder and the user modelling engine, which provide input for the virtual environment generator.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "ExhiSTORY: IoT in the service of Cultural Heritage",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8635759/",
            "Abstract": "Creating stories for exhibitions is a fascinating and in parallel laborious task. As every exhibition is designed to tell a story, museum curators are responsible for analyzing each exhibit in order to extract messages that form a story and position accordingly the objects in correct order within the museum space. In this context, we analyze how the technological advances in the fields of sensors and the Internet of Things can be utilized in order to construct a “smart space”, where exhibits can communicate with the visitors and to each other and can be organized automatically so that they can generate rich, personalized, coherent and highly stimulating experiences. We present the architecture of the system named “exhiSTORY”, that intends to provide the appropriate infrastructure to be used in museums and places where exhibitions are held, in order to support smart exhibits. We discuss and analyze the architecture of …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:dQ2og3OwTAUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Numerical input techniques for immersive virtual environments",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5068901/",
            "Abstract": "So far, in the literature, there exist only a few techniques for text input and none specifically for numeric input in immersive virtual environments. Initially, we evaluated two techniques for numerical input, one employing whole hand gloves gestures and a second employing Pinch gloves. While the first technique was proper only for small numbers and for limited use, the second technique performed well in all cases. The Pinch glove technique was revised to allow for hand tracking and re-evaluated with a larger group of users. Statistical analysis showed that the technique is promising and input rate is comparable to other input techniques.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "“γ-eye”: A paradigm shift in scintigraphic mouse imaging",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1120179716306408",
            "Abstract": "Small animal imaging has been well proven as a robust tool to non-invasively study the biodistribution of various biomolecules. A number of imaging systems are commercially available but with high purchase and maintenance costs. For this reason, we present the “γ-eye”, a dedicated γ-camera suitable for in-vivo scintigraphic molecular imaging. The “γ-eye” is a unique benchtop system with 5 × 10 cm2 field-of-view for whole-body mouse imaging.The “γ-eye” is based on two PositionSensitivePhotomultiplierTubes H8500 coupled to a CsINa pixelated scintillator and a low energy parallel hexagonal hole collimator. The external dimensions of the entire system, including all required electronics, are 45 × 30 × 15 cm3. All studies can be stored as raw data and in DICOM format and are handled through a Database-Manager. The software supports a real-time viewer mode with …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards a learning analytics platform for supporting the educational process",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6878750/",
            "Abstract": "In this paper, we present the vision of an open source learning analytics platform, able to harvest data from different sources, including e-learning platforms and environments, registrar's information systems, alumni systems, etc., so as to provide all stakeholders with the necessary functionality to make decisions on the learning process. The platform's architecture is modular, allowing the introduction of new functionality or connection to new systems to collect needed data. All data can be analyzed and presented though interactive visualizations to find correlations between metrics, to make predictions for students or student groups, to identify best practices for instructors and let them explore 'what-if' scenarios, to offer students personalized recommendations and personalized detailed feedback, etc. Our objective is to inform and empower all stakeholders to improve the learning experience.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:KxtntwgDAa4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A system to support dissemination of knowledge and sharing of experiences in the working environment: Review Code 066",
            "Publication year": 2003,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCEELL.2003.003277",
            "Abstract": "In the information era, enterprises strive to be productive and efficient. One feature of this goal is for employers to engage their employees in education programmes, to help them to gain new experiences and knowledge and to adapt to an ever-changing working environment. Such programmes must be carefully designed in order to achieve satisfactory results. Recently, enterprises, recognising the role that technology can play in the education of their employees, have adopted systems that supplement the traditional educational model with mechanisms that enable the sharing of experiences and knowledge. In this paper, we describe an architecture and a system prototype that allows users to search easily for information, interact with colleagues and share experiences, and to compose and disseminate best practices and knowledge. The design of this system is based on insights gained from the operation of the …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:4TOpqqG69KYC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "An interview-based user study on the use of visualizations for folder browsing",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4577934/",
            "Abstract": "Hierarchically structured data collections often need to be visualized for the purposes of digital information management and presentation. File browsing, in particular, has an inherent hierarchical structure and plays an important role in the context of personal information management (PIM). A multitude of file browsers are nowadays available, offering different functionalities, while users adopt diverse practices and habits for browsing activities. In this paper, we investigate these aspects to obtain insights into their advantages and disadvantages and suggest solutions in the area of PIM, as well as in other domains employing similar visualization paradigms. The presented study focuses on the two most widespread visualizations used by file browsers, the indented list and zoomable interface paradigms, and assesses their effectiveness for various tasks and contexts, both by exploiting results on existing evaluations on …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Interconnecting objects, visitors, sites and (Hi) stories across cultural and historical concepts: the CrossCult project",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48496-9_39",
            "Abstract": "Human History, is a huge mesh of interrelated facts and concepts, spanning beyond borders, encompassing global aspects and finally constituting a shared, global experience. This is especially the case regarding European history, which is highly interconnected by nature; however, most History-related experiences that are today offered to the greater public, from schools to museums, are siloed. The CrossCult project aims to provide the means for offering citizens and cultural venue visitors a more holistic view of history, in the light of cross-border interconnections among pieces of cultural heritage, other citizens viewpoints and physical venues. To this end, the CrossCult project will built a comprehensive knowledge base encompassing information and semantic relationships across cultural information elements, and will provide the technological means for delivering the contents of this knowledge base to …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "User-Computer Interaction: The methodology of supplementary support in the service of different cultural communities",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=16065109538792067253&hl=en&oi=scholarr",
            "Abstract": "The current thesis addresses the problem faced by users of different cultural communities during their interaction with software products which'speak'a language other than the users' mother tongue. In such a case except from the usual perception problems, users confront additional problems due to the unfamiliar language.To tackle the problem a number of methodologies have been proposed and are currently in use. All existing methodologies focus on the stage of software design, aiming to develop products that overcome the problem. However, their application has shown that not only they cannot solve efficiently the problem, but, in some cases they generate new side effects.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spreading activation over ontology-based resources: from personal context to web scale reasoning",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S1793351X10000973",
            "Abstract": "This paper describes methods to allow spreading activation to be used on web-scale information resources. Existing work has shown that spreading activation can be used to model context over small personal ontologies, which can be used to assist in various user activities, for example, in auto-completing web forms. This previous work is extended and methods are developed by which large external repositories, including corporate information and the web, can be linked to the user's personal ontology and thus allow automated assistance that is able to draw on the entire web of data. The basic idea is to augment the personal ontology with cached data from external repositories, where the choice of data to fetch or discard is related to the level of activation of entities already in the personal ontology or cached data. This relies on the assumption that the working set of highly active entities is relatively small; empirical …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:SeFeTyx0c_EC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Wikis in enterprise settings: a survey",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17517575.2011.580008",
            "Abstract": "The wiki technology is increasingly being used in corporate environments to facilitate a broad range of tasks. This survey examines the use of wikis on a variety of organisational tasks that include the codification of explicit and tacit organisational knowledge and the formulation of corporate communities of practice, as well as more specific processes such as the collaborative information systems development, the interactions of the enterprise with third parties, management activities and organisational response in crisis situations. For each one of the aforementioned corporate functions, the study examines the findings of related research literature to highlight the advantages and concerns raised by the wiki usage and to identify specific solutions addressing them. Finally, based on the above findings, the study discusses various aspects of the wiki usage in the enterprise and identifies trends and future research …",
            "Abstract entirety": 0,
            "Author pub id": "AZ9U32YAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Creating an Historical Archive Ontology: Guidelines and Evaluation.",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=17672301613246823018&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spreading activation user profile ontology",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7239275358271265793&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SMARTGOV: a governmental knowledge-based platform for public sector online services",
            "Publication year": 2002,
            "Publication url": "http://helios.mm.di.uoa.gr/~costas/papers-subm/smartgov-kmgov.pdf",
            "Abstract": "Public transaction services (such as e-forms), although perceived the future of e-government have not yet realised their full potential. E-forms have a significant role in e-government, as they are the basis for realising most of the twenty public services that all European Union member states have to provide to their citizens and businesses. The aim of this paper is to present a knowledgebased platform to assist public sector employees to generate online transaction services by simplifying their development, maintenance and integration with already installed IT systems.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:LkGwnXOMwfcC",
            "Publisher": "na"
        },
        {
            "Title": "Controlled caching of dynamic WWW pages",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46146-9_2",
            "Abstract": "In order to increase flexibility and provide up-to-date information, more and more web sites use dynamic content. This practice, however, increases server load dramatically, since each request results to code execution, which may involve processing and/or access to information repositories. In this paper we present a scheme for maintaining a server-side cache of dynamically generated pages, allowing for cache consistency maintenance, without placing heavy burdens on application programmers. We also present insights to architecture scalability and some results obtained from conducted experiments.",
            "Abstract entirety": 1,
            "Author pub id": "AZ9U32YAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]