[{
    "name": "Γεώργιος Χαλκιαδάκης",
    "romanize name": "Georgios Chalkiadakis",
    "School-Department": "Ηλεκτρολόγων Μηχανικών & Μηχανικών Υπολογιστών",
    "University": "tuc",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 19169,
    "Scholar name": "Georgios Chalkiadakis",
    "Scholar id": "KdYD5-cAAAAJ",
    "Affiliation": "Technical University of Crete",
    "Citedby": 2262,
    "Interests": [
        "Artificial Intelligence",
        "Algorithmic Game Theory",
        "Multiagent Systems",
        "Smart Grid",
        "Multi-Agent systems"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=KdYD5-cAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Overlapping coalition formation via probabilistic topic modeling",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1804.05235",
            "Abstract": "Research in cooperative games often assumes that agents know the coalitional values with certainty, and that they can belong to one coalition only. By contrast, this work assumes that the value of a coalition is based on an underlying collaboration structure emerging due to existing but unknown relations among the agents; and that agents can form overlapping coalitions. Specifically, we first propose Relational Rules, a novel representation scheme for cooperative games with overlapping coalitions, which encodes the aforementioned relations, and which extends the well-known MC-nets representation to this setting. We then present a novel decision-making method for decentralized overlapping coalition formation, which exploits probabilistic topic modeling, and in particular, online Latent Dirichlet Allocation. By interpreting formed coalitions as documents, agents can effectively learn topics that correspond to profitable collaboration structures.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Agent-Based Modeling of the Early Minoan Social Organization Structure",
            "Publication year": 2015,
            "Publication url": "http://www.intelligence.tuc.gr/~angelos/WorkingPaper.pdf",
            "Abstract": "In this work, we develop a generic agent-based model (ABM) for simulating ancient societies. Agents in our model are completely autonomous, in contrast to most existing ABMs used in archaeology. We employ this model to evaluate the impact of different social organization paradigms and agricultural strategies on population viability and evolving spatial distribution of settlement locations, at a particular region of the island of Crete during the Early Bronze Age (early Minoan civilization). Model parameter choices are based on archaeological studies, but are not biased towards any specific assumption. Interestingly, one of the social models examined is inspired by a recent framework for self-organizing agent organizations. Results over a number of different simulation scenarios demonstrate an impressive sustainability for settlements adopting a socio-economic organization model based on self-organization; while the emerging “stratified” populations are larger than their egalitarian counterparts. This provides support for archaeological theories proposing the existence of different social strata in Early Bronze Age Crete, considering them a pre-requisite for the emergence of the complex social structure evident in later periods. Moreover, observed population dispersion agrees with existing archaeological evidence.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Version"
        },
        {
            "Title": "AncientS-ABM: A Novel Tool for Simulating Ancient Societies",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-24209-1_21",
            "Abstract": " In this paper we demonstrate a tool that can be employed to build agent-based models (ABMs) for use in social archaeology. Specifically, our tool is based on the NetLogo modeling environment, and enables the creation of agent-based models of ancient societies, based on archaeological input. The models created by our tool can be used to obtain a better understanding of ancient societies, and assist archaeologists in testing the validity of existing or novel hypotheses and theories. We note that apart from assisting archaeologists in their work, the demonstrated tool can serve educational or recreational purposes as well: the ABMs created with the tool can, for instance, constitute the “backbone” of interactive platforms for use in schools or museums; and can conceivably be employed in history-focused digital strategic game environments.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Overlapping coalition formation",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-92185-1_37",
            "Abstract": "In multiagent domains, agents form coalitions to perform tasks. The usual models of cooperative game theory assume that the desired outcome is either the grand coalition or a coalition structure that consists of disjoint coalitions (i.e., a partition of the set of agents). However, in practice an agent may be involved in executing more than one task, and distributing his resources between several (not necessarily disjoint) coalitions. To tackle such scenarios, we introduce a model for cooperative games with overlapping coalitions. We then focus on concepts of stability in this setting. In particular, we define and study a notion of the core, which is a generalization of the corresponding notion in the traditional models of cooperative game theory. Under some quite general conditions, we characterize the elements of core. As a corollary, we also show that any element of the core maximizes the social welfare. We then …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Evolutionary agent-based modeling of past societies' organization structure",
            "Publication year": 2016,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/44928",
            "Abstract": "In this work, we extend a generic agent-based model for simulating ancient societies, by blending, for the first time, evolutionary game theory with multiagent systems' self-organization. Our approach models the evolution of social behaviours in a population of strategically interacting agents corresponding to households in the early Minoan era. To this end, agents participate in repeated games by means of which they exchange utility (corresponding to resources) with others. The results of the games contribute to both the continuous re-organization of the social structure, and the progressive adoption of the most successful agent strategies. Agent population is not fixed, but fluctuates over time. The particularity of the domain necessitates that agents in our games receive non-static payoffs, in contrast to most games studied in the literature; and that the evolutionary dynamics are formulated via assessing the perceived …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Coalition Structures in Weighted Voting Games.",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3Wsn3SwEBScC&oi=fnd&pg=PA393&dq=info:zMHRmQoubBEJ:scholar.google.com&ots=a2qvjJ9ynU&sig=8daRK2BcE75OgNgDRlThBXbLabw",
            "Abstract": "Weighted voting games are a popular model of collaboration in multiagent systems. In such games, each agent has a weight (intuitively corresponding to resources he can contribute), and a coalition of agents wins if its total weight meets or exceeds a given threshold. Even though coalitional stability in such games is important, existing research has nonetheless only considered the stability of the grand coalition. In this paper, we introduce a model for weighted voting games with coalition structures. This is a natural extension in the context of multiagent systems, as several groups of agents may be simultaneously at work, each serving a different task. We then proceed to study stability in this context. First, we define the CS-core, a notion of the core for such settings, discuss its non-emptiness, and relate it to the traditional notion of the core in weighted voting games. We then investigate its computational properties. We show that, in contrast with the traditional setting, it is computationally hard to decide whether a game has a non-empty CS-core, or whether a given outcome is in the CS-core. However, we then provide an efficient algorithm that verifies whether an outcome is in the CS-core if all weights are small (polynomially bounded). Finally, we also suggest heuristic algorithms for checking the non-emptiness of the CS-core.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative games with overlapping coalitions",
            "Publication year": 2010,
            "Publication url": "https://www.jair.org/index.php/jair/article/view/10668",
            "Abstract": "In the usual models of cooperative game theory, the outcome of a coalition formation process is either the grand coalition or a coalition structure that consists of disjoint coalitions. However, in many domains where coalitions are associated with tasks, an agent may be involved in executing more than one task, and thus may distribute his resources among several coalitions. To tackle such scenarios, we introduce a model for cooperative games with overlapping coalitionsor overlapping coalition formation (OCF) games. We then explore the issue of stability in this setting. In particular, we introduce a notion of the core, which generalizes the corresponding notion in the traditional (non-overlapping) scenario. Then, under some quite general conditions, we characterize the elements of the core, and show that any element of the core maximizes the social welfare. We also introduce a concept of balancedness for overlapping coalitional games, and use it to characterize coalition structures that can be extended to elements of the core. Finally, we generalize the notion of convexity to our setting, and show that under some natural assumptions convex games have a non-empty core. Moreover, we introduce two alternative notions of stability in OCF that allow a wider range of deviations, and explore the relationships among the corresponding definitions of the core, as well as the classic (non-overlapping) core and the Aubin core. We illustrate the general properties of the three cores, and also study them from a computational perspective, thus obtaining additional insights into their fundamental structure.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sequentially optimal repeated coalition formation under uncertainty",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s10458-010-9157-y",
            "Abstract": "Coalition formation is a central problem in multiagent systems research, but most models assume common knowledge of agent types. In practice, however, agents are often unsure of the types or capabilities of their potential partners, but gain information about these capabilities through repeated interaction. In this paper, we propose a novel Bayesian, model-based reinforcement learning framework for this problem, assuming that coalitions are formed (and tasks undertaken) repeatedly. Our model allows agents to refine their beliefs about the types of others as they interact within a coalition. The model also allows agents to make explicit tradeoffs between exploration (forming “new” coalitions to learn more about the types of new potential partners) and exploitation (relying on partners about which more is known), using value of information to define optimal exploration policies. Our framework effectively …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Factored mdps for optimal prosumer decision-making",
            "Publication year": 2015,
            "Publication url": "http://www.intelligence.tuc.gr/~gehalk/Papers/acFMDPsProsumAAMAS2015.pdf",
            "Abstract": "Tackling the decision-making problem faced by a prosumer (ie, a producer that is simultaneously a consumer) when selling and buying energy in the emerging smart electricity grid, is of utmost importance for the economic profitability of such a business entity. In this paper, we model, for the first time, this problem as a factored Markov Decision Process. By so doing, we are able to represent the problem compactly, and provide an exact optimal solution via dynamic programming—notwithstanding its large size. Our model successfully captures the main aspects of the business decisions of a prosumer corresponding to a community microgrid of any size. Moreover, it includes appropriate sub-models for prosumer production and consumption prediction. Experimental simulations verify the effectiveness of our approach; and show that our exact value iteration solution matches that of a state-of-the-art method for stochastic planning in very large environments, while outperforming it in terms of computation time.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative games with overlapping coalitions: Charting the tractability frontier",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370219300219",
            "Abstract": "The framework of cooperative games with overlapping coalitions (OCF games), which was proposed by Chalkiadakis et al.[1], generalizes classic cooperative games to settings where agents may belong to more than one coalition. OCF games can be used to model scenarios where agents distribute resources, such as time or energy, among several tasks, and then divide the payoffs generated by these tasks in a fair and/or stable manner. As the framework of OCF games is very expressive, identifying settings that admit efficient algorithms for computing ‘good’outcomes of OCF games is a challenging task. In this work, we put forward two approaches that lead to tractability results for OCF games. First, we propose a discretized model of overlapping coalition formation, where each agent i has a weight W i∈ N and may allocate an integer amount of weight to any task. Within this framework, we focus on the computation …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Exploring energy saving policy measures by renewable energy supplying cooperatives (REScoops)",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/T-Hoppe/publication/319006811_Exploring_energy_saving_policy_measures_by_renewable_energy_supplying_cooperatives_REScoops/links/5abce5bdaca27222c75449b4/Exploring-energy-saving-policy-measures-by-renewable-energy-supplying-cooperatives-REScoops.pdf",
            "Abstract": "Cooperatives for renewable energy supply (REScoops) provide their members renewably generated energy within a cooperative model that enables members to co-decide on the cooperative’s future. REScoops do not only collectively own renewable energy production facilities and supply this to their members, they also use their specific position as energy suppliers to take several actions to persuade their members to save energy. Although the activities that REScoops undertake to some extent resemble those of other organizations, because of their particular organisational and business model as citizens initiatives, the cooperative model, REScoops are supposed to be very well positioned for activities to influence and help their members to save energy. The paper discusses arguments why the REScoop model in energy supply can be an important contributor to reduce energy use by their members. Further this paper discusses measures that have been undertaken by REScoops studied in the REScoop Plus project. We use some illustrative examples to discuss if REScoops are in a relatively good position to take certain measures and succeed in persuading customers to lower their energy consumption level and elaborate on future experiments to explore the proposition that REScoop members save more energy due to actions of these REScoops towards their members.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:maZDTaKrznsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Multi-agent Systems Research: EUMAS 2020 Extended Selected Papers",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s42979-021-00752-z",
            "Abstract": "This topical collection consists of extended selected papers of the 17th European Conference on Multi-Agent Systems (EUMAS 2020). The conference was originally planned to be held in Thessaloniki, Greece, in April 2020, but due to the COVID19 pandemic, it was eventually held online between September 14–15, 2020. EUMAS 2020 followed the tradition of previous editions (Oxford 2003, Barcelona 2004, Brussels 2005, Lisbon 2006, Hammamet 2007, Bath 2008, Agia Napa 2009, Paris 2010, Maastricht 2011, Dublin 2012, Toulouse 2013, Prague 2014, Athens 2015, Valencia 2016, Evry 2017, Bergen 2018) in aiming to provide the prime European forum for presenting and discussing agents research as the annual designated event of the European Association of Multi-Agent Systems (EURAMAS). After a rigorous peer-review process, a total of 35 papers were accepted and presented at the conference …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer Singapore"
        },
        {
            "Title": "Dealing with expected thermal discomfort",
            "Publication year": 2020,
            "Publication url": "https://escholarship.org/content/qt05c575fc/qt05c575fc.pdf",
            "Abstract": "Optimizing the heating ventilation and air condition (HVAC) control process generally considers a trade-off between thermal discomfort and energy cost. Technically, this can be represented as a multi-objective optimization problem, where the occupants’ thermal preferences and the cost of energy consumed are two conflicting objectives. When the occupancy schedule is known in advance this problem typically reduces to minimizing the energy cost while meeting the thermal comfort constraint set by a user, typically defined as a setpoint-temperature-based comfort band. However, this approach is inadequate in dynamic occupancy settings where the optimization process is driven by occupancy estimates that are inherently uncertain. In particular, ensuring that the room temperature lays within a typically narrow comfort band, even when there is small probability of occupancy, significantly increases HVAC energy usage. In this case, accepting some probability of discomfort, is essential to reduce energy cost. We investigate three optimization HVAC control algorithms that deal with dynamic occupancy and we provide a comparative analysis to show the advantages and disadvantages of each approach with respect to their efficiency, effectiveness, applicability and usability in different settings.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting the power output of distributed renewable energy resources within a broad geographical region",
            "Publication year": 2012,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-098-7-981",
            "Abstract": "In recent years, estimating the power output of inherently intermittent and potentially distributed renewable energy sources has become a major scientific and societal concern. In this paper, we provide an algorithmic framework, along with an interactive web-based tool, to enable short-to-middle term forecasts of photovoltaic (PV) systems and wind generators output. Importantly, we propose a generic PV output estimation method, the backbone of which is a solar irradiance approximation model that incorporates free-to-use, readily available meteorological data coming from online weather stations. The model utilizes non-linear approximation components for turning cloud-coverage into radiation forecasts, such as an MLP neural network with one hidden layer. We present a thorough evaluation of the proposed techniques, and show that they can be successfully employed within a broad geographical region (the …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Cooperatives for demand side management",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/339761/",
            "Abstract": "We propose a new scheme for efficient demand side management for the Smart Grid. Specifically, we envisage and promote the formation of cooperatives of medium-large consumers and equip them (via our proposed mechanisms) with the capability of regularly participating in the existing electricity markets by providing electricity demand reduction services to the Grid. Based on mechanism design principles, we develop a model for such cooperatives by designing methods for estimating suitable reduction amounts, placing bids in the market and redistributing the obtained revenue amongst the member agents. Our mechanism is such that the member agents have no incentive to show artificial reductions with the aim of increasing their revenues",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Providing a scientific arm to renewable energy cooperatives",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-89845-2_51",
            "Abstract": "Renewable Energy-Supplying cooperatives (REScoops) are cooperatives of renewable energy producers and/or consumers, which are under formulation in the emerging European smart grid. Their emergence highlights the importance of proconsuming green energy and simultaneously puts forward principles such as energy democracy and self-consumption, assists the fight against energy poverty, and helps reduce GHG emissions. To this end, the incorporation of scientific and technological solutions into the REScoops’ everyday business and practices, is key for improving these practices and assessing their potential benefits, and as such for enabling them to deliver the maximum possible gains to their members and society at large. This chapter outlines three key axes of scientific research and solutions that can be used for REScoops, namely, (a) a statistical analysis, (b) an applied behavioural …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Employing agent-based modeling to study the impact of the Theran eruption on Minoan society",
            "Publication year": 2018,
            "Publication url": "http://www.intelligence.tuc.gr/~gehalk/Papers/ccsMinoanABMTheranEruption-CAA-GR-2018.pdf",
            "Abstract": "The purpose of this work is to deepen our understanding of the Bronze Age Minoan civilization’s decline, by utilizing an existing agent-based model (ABM) to study the extent by which the cataclysmic volcanic eruption of Thera (Santorini) impacted the Minoan social evolution. Considering agriculture as the main production activity sustaining the human population, we evaluate the volcanic eruption impact on different social organization models, focusing on the wider area of Malia in the island of Crete. The social organization paradigms examined are inspired by a framework for self-organizing agent organizations, and ideas from evolutionary game theory. Model parameter choices are based on archaeological theories and finds, but are not biased towards any specific assumption. Results over a number of different simulation scenarios demonstrate an impressive sustainability of household agents. However, in some scenarios we observe noticeable changes in the settlements' distribution, relating to significantly higher migration rates immediately after the eruption. Moreover, the eruption appears to have had a strong impact on social behaviour, transforming the initially cooperative agents' behaviour to a noncooperative one. This provides support for archaeological theories suggesting that the Theran eruption led to a gradual (and not immediate) breakdown of the Minoan socio-economic system, partly due to inner community competition and conflicts.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Probabilistic topic modeling, reinforcement learning, and crowdsourcing for personalized recommendations",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-59294-7_14",
            "Abstract": "We put forward an innovative use of probabilistic topic modeling (PTM) intertwined with reinforcement learning (RL), to provide personalized recommendations. Specifically, we model items under recommendation as mixtures of latent topics following a distribution with Dirichlet priors; this can be achieved via the exploitation of crowdsourced information for each item. Similarly, we model the user herself as an “evolving” document represented by its respective mixture of latent topics. The user’s topic distribution is appropriately updated each time she consumes an item. Recommendations are subsequently based on the divergence between the topic distributions of the user and available items. However, to tackle the exploration versus exploitation dilemma, we apply RL to vary the user’s topic distribution update rate. Our method is immune to the notorious “cold start” problem, and it can effectively cope with …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Bayesian Active Malware Analysis",
            "Publication year": 2020,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2020/pdfs/p1206.pdf",
            "Abstract": "We propose a novel technique for Active Malware Analysis (AMA) formalized as a Bayesian game between an analyzer agent and a malware agent, focusing on the decision making strategy for the analyzer. In our model, the analyzer performs an action on the system to trigger the malware into showing a malicious behavior, ie, by activating its payload. The formalization is built upon the link between malware families and the notion of types in Bayesian games. A key point is the design of the utility function, which reflects the amount of uncertainty on the type of the adversary after the execution of an analyzer action. This allows us to devise an algorithm to play the game with the aim of minimizing the entropy of the analyzer’s belief at every stage of the game in a myopic fashion. Empirical evaluation indicates that our approach results in a significant improvement both in terms of learning speed and classification score when compared to other state-of-the-art AMA techniques.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Lane-free microscopic simulation for connected and automated vehicles",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9564637/",
            "Abstract": "This paper presents the ongoing development of the microscopic TrafficFluid-Sim simulator, aimed primarily for Connected and Automated Vehicles (CAVs) under a novel lane-free traffic paradigm. In particular, TrafficFluid-Sim builds on the SUMO simulation infrastructure to model traffic environments featuring two novel vehicle characteristics: (i) Vehicles can be located at any arbitrary lateral position within the road boundaries; and (ii) Vehicles may exert, based on their automated driving and connectivity capabilities, “vehicle nudging” to other surrounding vehicles. As such, TrafficFluid-Sim enables simulation of novel CAV movement strategies for various types of road infrastructure and is an indispensable tool for the design, testing and evaluation of the characteristics of a future CAV traffic flow as an efficient artificial fluid, as envisaged by the ongoing TrafficFluid ERC project.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Agent cooperatives for effective power consumption shifting",
            "Publication year": 2013,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/8477",
            "Abstract": "In this paper, we present a directly applicable scheme for electricity consumption shifting and effective demand curve flattening. The scheme can employ the services of either individual or cooperating consumer agents alike. Agents participating in the scheme, however, are motivated to form cooperatives, in order to reduce their electricity bills via lower group prices granted for sizable consumption shifting from high to low demand time intervals. The scheme takes into account individual costs, and uses a strictly proper scoring rule to reward contributors according to efficiency. Cooperative members, in particular, can attain variable reduced electricity price rates, given their different load shifting capabilities. This allows even agents with initially forbidding shifting costs to participate in the scheme, and is achieved by a weakly budget-balanced, truthful reward sharing mechanism. We provide four variants of this approach, and evaluate it experimentally.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "for the degree of Doctor of Philosophy",
            "Publication year": 2007,
            "Publication url": "https://central.bac-lac.gc.ca/.item?id=NR39416&op=pdf&app=Library&oclc_number=664421133",
            "Abstract": "Learning through interaction with the environment is a fundamental idea underlying many theories of learning and intelligence. Reinforcement Learning (RL)[KLM96, SB98], from a computer science point of view, is the problem that an agent faces when trying to learn to act by trial and error through interactions with a dynamic environment. This is different from supervised learning, which is learning from examples provided by an external supervisor; it also contrasts with classical planning, in that agents do not know a priori how their actions will affect the world. An RL agent is a goal-seeking agent that can sense aspects of its environment and can choose actions to influence this environment, so as to maximize a numerical reward signal. Reinforcement learning is a highly active research area, and is strongly connected not only with artificial intelligence (AI) research–such as machine learning, planning and neural …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning Policies for Resolving Demand-Capacity Imbalances During Pre-tactical Air Traffic Management",
            "Publication year": 2017,
            "Publication url": "https://www.scipedia.com/public/Chalkiadakis_et_al_2017a",
            "Abstract": "Summarization: In this work we propose and investigate the use of collaborative reinforcement learning methods for resolving demand-capacity imbalances during pre-tactical Air Traffic Management. By so doing, we also initiate the study of data-driven techniques for predicting multiple correlated aircraft trajectories; and, as such, respond to a need identified in contemporary research and practice in air-traffic management. Our simulations, designed based on real-world data, confirm the effectiveness of our methods in resolving the demand-capacity problem, even in extremely hard scenarios. Παρουσιάστηκε στο: 15th German Conference on Multiagent System Technologie",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Utilizing agent-based modeling to gain new insights into the ancient Minoan civilization",
            "Publication year": 2014,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2014/aamas/p1371.pdf",
            "Abstract": "In this paper we develop an agent-based model to study land use, settlement, and social organization patterns at a particular region of the island of Crete during the Bronze Age. Considering farming as the main activity for sustaining the early Minoan civilization, we evaluate the impact of different social organization models and agricultural strategies on population viability and spatial distribution of settlement locations over a 2000 year period. Interestingly, one of the social models examined promotes the targeted redistribution of wealth, and is inspired by a recent framework for self-organizing agent organizations. Model parameters are based on archaeological studies, but are not biased towards any specific assumption. Results over a number of different simulation scenarios demonstrate an impressive sustainability for settlements adopting a socio-economic organization model based on self-organization; while the emerging “stratified” populations are larger than their egalitarian counterparts. This provides support for theories proposing the existence of different social strata in early Bronze Age Crete, considering them a pre-requisite for the emergence of the complex social structure evident in later periods. Moreover, observed population dispersion agrees with existing archaeological evidence.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimising game tactics for football",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2003.10294",
            "Abstract": "In this paper we present a novel approach to optimise tactical and strategic decision making in football (soccer). We model the game of football as a multi-stage game which is made up from a Bayesian game to model the pre-match decisions and a stochastic game to model the in-match state transitions and decisions. Using this formulation, we propose a method to predict the probability of game outcomes and the payoffs of team actions. Building upon this, we develop algorithms to optimise team formation and in-game tactics with different objectives. Empirical evaluation of our approach on real-world datasets from 760 matches shows that by using optimised tactics from our Bayesian and stochastic games, we can increase a team chances of winning by up to 16.1\\% and 3.4\\% respectively.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analyzing statistically the energy consumption and production patterns of European REScoop members: Results from the H2020 project REScoop Plus",
            "Publication year": 2017,
            "Publication url": "http://pure.tudelft.nl/ws/files/57300914/REScoopPLUS_finallysubmitted.pdf",
            "Abstract": "REScoops are cooperatives of renewable energy producers and/or consumers, which have begun to form in the emerging European Smart Grid. According to the Federation of REScoops in Europe (REScoop. eu), there are currently more than 2,397 REScoops, collectively having more than 650,000 members. As such, their emergence highlights the importance of producing and consuming green energy, and simultaneously puts forward principles such as energy democracy and self-consumption, assists the fight against energy poverty, and reduces Greenhouse Gas emissions. A core objective of the H2020 REScoop Plus project is to promote a better understanding and cultivate the behavioural change of the cooperatives’ engagement. In order for this goal to be met, it was essential to conduct a careful logging of and statistical analysis over the energy data stored by the REScoops, as well as the current state of their engagement in energy efficiency. Such tasks are imperative in order to support the claim that REScoop engagement promotes energy sobriety; and associate consumption reduction with specific behaviours, ICT tools, and Energy Efficiency practices. In this paper, we present the logging and statistical analysis conducted in REScoop Plus, and their results. Specifically, we outline the methodology used for formulating a comprehensive format for collecting the datasets for statistical analysis, a process that involved a lengthy and fruitful interaction with REScoops and their data experts; the extracted requirements for that common format; and the detailed guidelines communicated to the REScoops in order to enable data acquisition and …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rewarding cooperative virtual power plant formation using scoring rules",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360544216315079",
            "Abstract": "Virtual Power Plants (VPPs) are fast emerging as a viable means of integrating small and distributed energy resources (DERs), like wind and solar, into the electricity supply network (Grid). VPPs are formed via the aggregation of a large number of DERs, so that they exhibit the characteristics of a traditional generator in terms of predictability and robustness. In this work, we promote the formation of such “cooperative” VPPs (CVPPs) using techniques from the field of distributed Artificial Intelligence and game theory. In particular, we design a payment mechanism that encourages DERs to join CVPPs with increased size and visibility to the network operator. Our method is based on strictly proper scoring rules and incentivises the provision of accurate predictions of expected electricity generation from member DERs, which aids in the planning of the supply schedule at the Grid. We empirically evaluate our approach …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Optimal Prosumer Decision-Making Using Factored MDPs.",
            "Publication year": 2016,
            "Publication url": "https://www.ijcai.org/Proceedings/16/Papers/612.pdf",
            "Abstract": "Tackling the decision-making problem faced by a prosumer (ie, a producer that is simultaneously a consumer) when selling and buying energy in the emerging smart electricity grid, is of utmost importance for the economic profitability of such a business entity. In this work, we model, for the first time, this problem as a factored Markov Decision Process. By so doing, we are able to represent the problem compactly, and provide an exact optimal solution via dynamic programming—notwithstanding its large size. Our model successfully captures the main aspects of the business decisions of a prosumer corresponding to a community microgrid of any size. Moreover, it includes appropriate sub-models for prosumer production and consumption prediction. Experimental simulations verify the effectiveness of our approach; and show that our exact value iteration solution matches that of a state-of-the-art method for stochastic planning in very large environments, while outperforming it in terms of computation time.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:HDshCWvjkbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coalition formation under uncertainty: Bargaining equilibria and the Bayesian core stability concept",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1329125.1329203",
            "Abstract": "Coalition formation is a problem of great interest in AI, allowing groups of autonomous, rational agents to form stable teams. Furthermore, the study of coalitional stability concepts and their relation to equilibria that guide the strategic interactions of agents during bargaining has lately attracted much attention. However, research to date in both AI and economics has largely ignored the potential presence of uncertainty when studying either coalitional stability or coalitional bargaining. This paper is the first to relate a (cooperative) stability concept under uncertainty, the Bayesian core (BC), with (non-cooperative) equilibrium concepts of coalitional bargaining games. We prove that if the BC of a coalitional game (and of each subgame) is non-empty, then there exists an equilibrium of the corresponding bargaining game that produces a BC element; and conversely, if there exists a coalitional bargaining equilibrium (with …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Factored mdps for optimal prosumer decision-making in continuous state spaces",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-33509-4_8",
            "Abstract": "The economic profitability of Smart Grid prosumers (i.e., producers that are simultaneously consumers) depends on their tackling of the decision-making problem they face when selling and buying energy. In previous work, we had modelled this problem compactly as a factored Markov Decision Process, capturing the main aspects of the business decisions of a prosumer corresponding to a community microgrid of any size. Though that work had employed an exact value iteration algorithm to obtain a near-optimal solution over discrete state spaces, it could not tackle problems defined over continuous state spaces. By contrast, in this paper we show how to use approximate MDP solution methods for taking decisions in this domain without the need of discretizing the state space. Specifically, we employ fitted value iteration, a sampling-based approximation method that is known to be well behaved. By so …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An open MAS services architecture for the V2G/G2V problem",
            "Publication year": 2019,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2019/pdfs/p2198.pdf",
            "Abstract": "In this paper we propose an original and open multi-agent system architecture for the important and challenging to engineer vehicleto-grid (V2G) and grid-to-vehicle (G2V) energy transfer problem domain. To address the features required, we define two novel design patterns that can be used with statecharts in many real-world situations. The first one is based on the well-known factory design pattern, and the second on the class generalization relationship. These patterns can be coupled with ASEME, an agent-oriented software engineering methodology that uses statecharts for the inter-and intra-agent control models. The latter also fits well with the FIPA standards-compliant JADE agent platform that we used for implementation.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computational aspects of cooperative game theory",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=8187509873203022931&hl=en&oi=scholarr",
            "Abstract": "Let's read! We will often find out this sentence everywhere. When still being a kid, mom used to order us to always read, so did the teacher. Some books are fully read in a week and we need the obligation to support reading. What about now? Do you still love reading? Is reading only for you who have obligation? Absolutely not! We here offer you a new book enPDFd computational aspects of cooperative game theory edith elkind to read.Do you ever know the book? Yeah, this is a very interesting book to read. As we told previously, reading is not kind of obligation activity to do when we have to obligate. Reading should be a habit, a good habit. By reading, you can open the new world and get the power from the world. Everything can be gained through the book. Well in brief, book is very powerful. As what we offer you right here, this computational aspects of cooperative game theory edith elkind is as one of reading book for you.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:RGFaLdJalmkC",
            "Publisher": "Morgan & Claypool"
        },
        {
            "Title": "Sequential decision making with untrustworthy service providers",
            "Publication year": 2008,
            "Publication url": "https://eprints.soton.ac.uk/265168/",
            "Abstract": "In this paper, we deal with the sequential decision making problem of agents operating in computational economies, where there is uncertainty regarding the trustworthiness of service providers populating the environment. Specifically, we propose a generic Bayesian trust model, and formulate the optimal Bayesian solution to the exploration-exploitation problem facing the agents when repeatedly interacting with others in such environments. We then present a computationally tractable Bayesian reinforcement learning algorithm to approximate that solution by taking into account the expected value of perfect information of an agent's actions. Our algorithm is shown to dramatically outperform all previous finalists of the international Agent Reputation and Trust (ART) competition, including the winner from both years the competition has been run.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-Agent Systems and Agreement Technologies: 17th European Conference, EUMAS 2020, and 7th International Conference, AT 2020, Thessaloniki, Greece, September 14-15, 2020, Revised Selected Papers",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=LCASEAAAQBAJ&oi=fnd&pg=PR5&dq=info:BXBJJDJ7KFwJ:scholar.google.com&ots=7Gesx1nzvu&sig=G55kkuIZehWiP6U5QhjOaalr11Y",
            "Abstract": "This book constitutes the revised post-conference proceedings of the 17th European Conference on Multi-Agent Systems, EUMAS 2020, and the 7th International Conference on Agreement Technologies, AT 2020, which were originally planned to be held as a joint event in Thessaloniki, Greece, in April 2020. Due to COVID-19 pandemic the conference was postponed to September 2020 and finally became a fully virtual conference. The 38 full papers presented in this volume were carefully reviewed and selected from a total of 53 submissions. The papers report on both early and mature research and cover a wide range of topics in the field of autonomous agents and multi-agent systems.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "The price of democracy in coalition formation",
            "Publication year": 2009,
            "Publication url": "https://eprints.soton.ac.uk/267067/",
            "Abstract": "Whenever rational agents form coalitions to execute tasks, doing so via a decentralized negotiation process—while more robust and democratic—may lead to a loss of efficiency compared to a centralized solution. To quantify this loss, we introduce the notion of the Price of Democracy (PoD), which measures the amount of resources needlessly committed to the task(s) at hand. After defining this concept for general coalitional games, we instantiate it in the setting of weighted voting games, a simple but expressive class of coalitional games that can be used to model resource allocation in multiagent scenarios. We approach the problem of forming winning coalitions in this setting from a non-cooperative perspective, and put forward an intuitive deterministic bargaining process, which exhibits no delay of agreement (i.e., the agents are guaranteed to form a winning coalition in round one) and allows for efficient computation of bargaining strategies. We show a tight bound of 3/2 on the PoD of our process if two rounds of bargaining are allowed, and demonstrate that this bound cannot improve with more rounds. We then generalize our bargaining process to settings where multiple coalitions are allowed to be formed, show that this generalization also exhibits no delay of agreement, and discuss the PoD in such settings.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Deep reinforcement learning in strategic board game environments",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-14174-5_16",
            "Abstract": "In this paper we propose a novel Deep Reinforcement Learning (DRL) algorithm that uses the concept of “action-dependent state features”, and exploits it to approximate the Q-values locally, employing a deep neural network with parallel Long Short Term Memory (LSTM) components, each one responsible for computing an action-related Q-value. As such, all computations occur simultaneously, and there is no need to employ “target” networks and experience replay, which are techniques regularly used in the DRL literature. Moreover, our algorithm does not require previous training experiences, but trains itself online during game play. We tested our approach in the Settlers Of Catan multi-player strategic board game. Our results confirm the effectiveness of our approach, since it outperforms several competitors, including the state-of-the-art jSettler heuristic algorithm devised for this particular domain.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Cooperative electricity consumption shifting",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2352467716301850",
            "Abstract": "In this paper, we propose the formation of agent cooperatives offering large-scale electricity demand shifting services, and put forward a complete framework for their operation. Individuals, represented by rational agents, form cooperatives to offer demand shifting from peak to non-peak intervals, incentivized by the provision of a better electricity price for the consumption of the shifted peak load, similar to economy of scale schemes. We equip the cooperatives with a novel, directly applicable, and effective consumption shifting scheme, that allows for the proactive balancing of electricity supply and demand. Our scheme employs several algorithms to promote the formation of the most effective shifting coalitions. It takes into account the shifting costs of the individuals, and rewards them according to their shifting efficiency. In addition, it employs internal pricing methods that guarantee individual rationality, and allow …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cooperative game theory: Basic concepts and computational challenges",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6237463/",
            "Abstract": "Cooperative game theory studies situations in which agents can benefit by working together. This article outlines the key concepts of cooperative game theory, and discusess the challenges that arise in applying these in AI applications.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low-complexity non-intrusive approach to predict the energy demand of buildings over short-term horizons",
            "Publication year": 2020,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/17512549.2020.1835712",
            "Abstract": "Reliable, non-intrusive, short-term (of up to 12 h ahead) prediction of a building's energy demand is a critical component of intelligent energy management applications. A number of such approaches have been proposed over time, utilizing various statistical and, more recently, machine learning techniques, such as decision trees, neural networks and support vector machines. Importantly, all of these works barely outperform simple seasonal auto-regressive integrated moving average models, while their complexity is significantly higher. In this work, we propose a novel low-complexity non-intrusive approach that improves the predictive accuracy of the state-of-the-art by up to . The backbone of our approach is a K-nearest neighbours search method, that exploits the demand pattern of the most similar historical days, and incorporates appropriate time-series pre-processing and easing. In the context of this …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:yD5IFk8b50cC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Evolutionary Game-theoretic Modeling of Past Societies’ Organization Structure",
            "Publication year": 2017,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2017/pdfs/p1496.pdf",
            "Abstract": "In this work, we extend a generic agent-based model for simulating ancient societies, by blending, for the first time, evolutionary game theory with multiagent systems’ self-organization. Our approach models the evolution of social behaviours in a population of strategically interacting agents corresponding to households in the early Minoan era. To this end, agents participate in repeated games by means of which they exchange utility (corresponding to resources) with others. The results of the games contribute to both the continuous re-organization of the social structure, and the progressive adoption of the most successful agent strategies. Agent population is not fixed, but fluctuates over time. The particularity of the domain necessitates that agents in our games receive non-static payoffs, in contrast to most games studied in the literature; and that the evolutionary dynamics are formulated via assessing the perceived fitness of the agents, defined in terms of how successful they are in accumulating utility. We present a systematic evaluation of the performance of the various strategies, assuming several variations in the way agent fitness and agent organization fitness are defined, as well as in the way agents adopt new strategies. Overall, our results show that societies of strategic agents that self-organize via adopting the aforementioned evolutionary approach, demonstrate a sustainability that largely matches that of self-organizing societies of more cooperative agents; and that strategic cooperation is in fact, in many instances, an emergent behaviour in this domain. Our approach can provide intuitions to archaeological research, and help resolve …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:TFP_iSt0sucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bayesian reinforcement learning for coalition formation under uncertainty",
            "Publication year": 2004,
            "Publication url": "http://www.cs.toronto.edu/~gehalk/Papers/bayesianCoalForm_cpr.pdf",
            "Abstract": "Research on coalition formation usually assumes the values of potential coalitions to be known with certainty. Furthermore, settings in which agents lack sufficient knowledge of the capabilities of potential partners is rarely, if ever, touched upon. We remove these often unrealistic assumptions and propose a model that utilizes Bayesian (multiagent) reinforcement learning in a way that enables coalition participants to reduce their uncertainty regarding coalitional values and the capabilities of others. In addition, we introduce the Bayesian Core, a new stability concept for coalition formation under uncertainty. Preliminary experimental evidence demonstrates the effectiveness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "You are what you consume: a Bayesian method for personalized recommendations",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2507157.2507158",
            "Abstract": "In this paper, we propose a novel Bayesian approach for personalized recommendations. In our approach, we model both user preferences and items under recommendation as multivariate Gaussian distributions; and make use of Normal-Inverse Wishart priors to model the recommendation agent beliefs about user types. We employ a lightweight agent-user interaction process, during which the user is presented with and asked to rate a small number of items. We then interpret these ratings in an innovative way, using them to guide a Bayesian updating process that helps us both capture a user's current mood, and maintain her overall user type. We produced several variants of our approach, and applied them in the movie recommendations domain, evaluating them on data from the MovieLens dataset. Our algorithms are shown to be competitive against a state-of-the-art method, which nevertheless requires a …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Succinct Representation Scheme for Cooperative Games under Uncertainty",
            "Publication year": 2021,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2021/pdfs/p1661.pdf",
            "Abstract": "In this work we present a novel succinct representation for large partially observed cooperative games. The proposed representation exploits estimates over marginal contributions to form compact rules representing collaboration patterns with uncertain value. Specifically, given an initial set of MC-nets rules that use prior beliefs over values instead of the actual ones, we propose two types of merging that lead to a new set of even more compact rules.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Markov Chain Monte Carlo for Effective Personalized Recommendations",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-14174-5_13",
            "Abstract": "This paper adopts a Bayesian approach for finding top recommendations. The approach is entirely personalized, and consists of learning a utility function over user preferences via employing a sampling-based, non-intrusive preference elicitation framework. We explicitly model the uncertainty over the utility function and learn it through passive user feedback, provided in the form of clicks on previously recommended items. The utility function is a linear combination of weighted features, and beliefs are maintained using a Markov Chain Monte Carlo algorithm. Our approach overcomes the problem of having conflicting user constraints by identifying a convex region within a user’s preferences model. Additionally, it handles situations where not enough data about the user is available, by exploiting the information from clusters of (feature) weight vectors created by observing other users’ behavior. We evaluate …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Decentralized Bayesian reinforcement learning for online agent collaboration",
            "Publication year": 2012,
            "Publication url": "https://pure.ulster.ac.uk/en/publications/decentralized-bayesian-reinforcement-learning-for-online-agent-co-3",
            "Abstract": "Solving complex but structured problems in a decentralized manner via multiagent collaboration has received much attention in recent years. This is natural, as on one hand, multiagent systems usually possess a structure that determines the allowable interactions among the agents; and on the other hand, the single most pressing need in a cooperative multiagent system is to coordinate the local policies of autonomous agents with restricted capabilities to serve a system-wide goal. The presence of uncertainty makes this even more challenging, as the agents face the additional need to learn the unknown environment parameters while forming (and following) local policies in an online fashion. In this paper, we provide the first Bayesian reinforcement learning (BRL) approach for distributed coordination and learning in a cooperative multiagent system by devising two solutions to this type of problem. More specifically, we show how the Value of Perfect Information (VPI) can be used to perform efficient decentralised exploration in both model-based and model-free BRL, and in the latter case, provide a closed form solution for VPI, correcting a decade old result by Dearden, Friedman and Russell. To evaluate these solutions, we present experimental results comparing their relative merits, and demonstrate empirically that both solutions outperform an existing multiagent learning method, representative of the state-of-the-art.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:MXK_kJrjxJIC",
            "Publisher": "International Foundation for Autonomous Agents and Multiagent Systems"
        },
        {
            "Title": "Employing hypergraphs for efficient coalition formation with application to the V2G problem",
            "Publication year": 2016,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-672-9-1604",
            "Abstract": "This paper proposes, for the first time in the literature, the use of hypergraphs for the efficient formation of effective coalitions. We put forward several formation methods that build on existing hypergraph algorithms, and exploit hypergraph structure to identify agents with desirable characteristics. Our approach allows the near-instantaneous formation of high quality coalitions, while adhering to multiple stated requirements regarding coalition quality. Moreover, our methods are shown to scale to dozens of thousands of agents within fractions of a second; with one of them scaling to even millions of agents within seconds. We apply our approach to the problem of forming coalitions to provide (electric) vehicle-to-grid (V2G) services. Ours is the first approach able to deal with large-scale, realtime coalition formation for the V2G problem, while taking multiple criteria into account for creating electric vehicle coalitions.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:35N4QoGY0k4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Monte carlo tree search for the game of diplomacy",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3411408.3411413",
            "Abstract": "Monte Carlo Tree Search (MCTS) is a decision-making technique that has received considerable interest in the past decade due to its success in a number of domains. In this paper, we explore its application in the “Diplomacy” multi-agent strategic board game, by putting forward and evaluating eight (8) variants of MCTS Diplomacy agents. In the core of our MCTS agents lies the well-known Upper Confidence Bounds for Trees (UCT) bandit method, which attempts to strike a balance between exploration and exploitation during the search tree creation. Moreover, we devised a heuristic weighting system for prioritizing the tree nodes’ actions, and used it to effectively incorporate high-quality domain knowledge in some of our agents. We provide a thorough experimental evaluation of our approach, in which we systematically compare the performance of our agents against each other and against other opponents …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Collaborative Multiagent Decision Making for Lane-Free Autonomous Driving",
            "Publication year": 2021,
            "Publication url": "http://www.ifaamas.org/Proceedings/aamas2021/pdfs/p1335.pdf",
            "Abstract": "This paper addresses the problem of collaborative multi-agent autonomous driving of connected and automated vehicles (CAVs) in lane-free highway scenarios. We eliminate the lane-changing task, ie, CAVs may be located in any arbitrary lateral position within the road boundaries, hence allowing for better utilization of the available road capacity. As a consequence, vehicles operate in a much more complex environment, and the need for the individual CAVs to select actions that are efficient for the group as a whole is highly desired. We formulate this environment as a multiagent collaboration problem represented via a coordination graph, thus decomposing the problem with local utility functions, based on the interactions between vehicles. We produce a tractable and scalable solution by estimating the joint action of all vehicles via the anytime max-plus algorithm, with local utility functions provided by potential fields, designed to promote collision avoidance. Specifically, the fields have an ellipsoid form that is most suitable for lane-free highway environments. This novel use of max-plus with potential fields gives rise to a coordinated control policy that exploits only local information specific to each CAV. Our experimental evaluation confirms the effectiveness of our approach: lane-free movement allows for increased traffic flow rates, and vehicles are able to achieve speeds that are both high and close to their desired ones, even in demanding environments with high traffic flow.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "AI in Greece: The Case of Research on Linked Geospa al Data",
            "Publication year": 2018,
            "Publication url": "https://ojs.aaai.org/index.php/aimagazine/article/view/2801",
            "Abstract": "Artificial Intelligence has been an active research field in Greece for over forty years, and there are more than thirty AI groups throughout the country covering almost all subareas of AI. One milestone for AI research in Greece was in 1988, when the Hellenic Artificial Intelligence Society (EETN) was founded as a non-profit, scientific organization on devoted to organizing and promo ng AI research in Greece and abroad. This article explores current lines of AI research in Greece and gives some history of Greek AI research since 1968.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:GnPB-g6toBAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recommending fair payments for large-scale social ridesharing",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2792838.2800177",
            "Abstract": "We perform recommendations for the Social Ridesharing scenario, in which a set of commuters, connected through a social network, arrange one-time rides at short notice. In particular, we focus on how much one should pay for taking a ride with friends. More formally, we propose the first approach that can compute fair coalitional payments that are also stable according to the game-theoretic concept of the kernel for systems with thousands of agents in real-world scenarios. Our tests, based on real datasets for both spatial (GeoLife) and social data (Twitter), show that our approach is significantly faster than the state-of-the-art (up to 84 times), allowing us to compute stable payments for 2000 agents in 50 minutes. We also develop a parallel version of our approach, which achieves a near-optimal speed-up in the number of processors used. Finally, our empirical analysis reveals new insights into the relationship …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stochastic Filtering Methods for Predicting Agent Performance in the Smart Grid",
            "Publication year": 2014,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/37172",
            "Abstract": "A variety of multiagent systems methods has been proposed for forming cooperatives of interconnected agents representing electricity producers or consumers in the Smart Grid. One major problem that arises in this domain is assessing participating agents uncertainty, and correctly predicting their future behaviour. In this paper, we adopt two stochastic filtering techniques—the Unscented Kalman Filter equipped with Gaussian Processes, and the Histogram Filter—and use these to effectively monitor the trustworthiness of agent statements regarding their final actions. The methods are incorporated within a directly applicable scheme for providing electricity demand management services. Simulation results confirm that these techniques provide tangible benefits regarding enhanced consumption reduction performance, and increased financial gains.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Agent-based modeling of ancient societies and their organization structure",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10458-016-9325-9",
            "Abstract": "Some of the most interesting questions one can ask about early societies, are about people and their relations, and the nature and scale of their organization. In this work, we attempt to answer such questions with approaches introduced by multiagent systems. Specifically, we developed a generic agent-based model (ABM) for simulating ancient societies. Unlike most existing ABMs used in archaeology, our model includes agents that are autonomous and utility-based. Our model can (and does) also incorporate different social organization paradigms and technologies used in ancient societies. Equipped with such paradigms, our model allows us to explore the transition from a simple to a more complex society by focusing on the historical social dynamics—i.e., the flexibility and evolution of power relationships depending on social context and time. As a case study, we employ our model to evaluate the …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Computational aspects of cooperative game theory",
            "Publication year": 2011,
            "Publication url": "https://www.morganclaypool.com/doi/abs/10.2200/S00355ED1V01Y201107AIM016",
            "Abstract": "Cooperative game theory is a branch of (micro-)economics that studies the behavior of self-interested agents in strategic settings where binding agreements among agents are possible. Our aim in this book is to present a survey of work on the computational aspects of cooperative game theory. We begin by formally defining transferable utility games in characteristic function form, and introducing key solution concepts such as the core and the Shapley value. We then discuss two major issues that arise when considering such games from a computational perspective: identifying compact representations for games, and the closely related problem of efficiently computing solution concepts for games. We survey several formalisms for cooperative games that have been proposed in the literature, including, for example, cooperative games defined on networks, as well as general compact representation schemes such as …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:roLk4NBRz8UC",
            "Publisher": "Morgan & Claypool Publishers"
        },
        {
            "Title": "Probability Bounds for Overlapping Coalition Formation.",
            "Publication year": 2017,
            "Publication url": "https://www.ijcai.org/proceedings/2017/0047.pdf",
            "Abstract": "In this work, we provide novel methods which benefit from obtained probability bounds for assessing the ability of teams of agents to accomplish coalitional tasks. To this end, our first method is based on an improvement of the Paley-Zygmund inequality, while the second and the third ones are devised based on manipulations of the two-sided Chebyshev’s inequality and the Hoeffding’s inequality, respectively. Agents have no knowledge of the amount of resources others possess; and hold private Bayesian beliefs regarding the potential resource investment of every other agent. Our methods allow agents to demand that certain confidence levels are reached, regarding the resource contributions of the various coalitions. In order to tackle real-world scenarios, we allow agents to form overlapping coalitions, so that one can simultaneously be part of a number of coalitions. We thus present a protocol for iterated overlapping coalition formation (OCF), through which agents can complete tasks that grant them utility. Agents lie on a social network and their distance affects their likelihood of cooperation towards the completion of a task. We confirm our methods’ effectiveness by testing them on both a random graph of 300 nodes and a real-world social network of 4039 nodes.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-Agent Systems and Agreement Technologies",
            "Publication year": 2020,
            "Publication url": "https://digital.csic.es/handle/10261/235432",
            "Abstract": "This book constitutes the revised post-conference proceedings of the 17th European Conference on Multi-Agent Systems, EUMAS 2020, and the 7th International Conference on Agreement Technologies, AT 2020, which were originally planned to be held as a joint event in Thessaloniki, Greece, in April 2020. Due to COVID-19 pandemic the conference was postponed to September 2020 and finally became a fully virtual conference. The 38 full papers presented in this volume were carefully reviewed and selected from a total of 53 submissions. The papers report on both early and mature research and cover a wide range of topics in the field of autonomous agents and multi-agent systems.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:_xSYboBqXhAC",
            "Publisher": "Springer Nature/Springer"
        },
        {
            "Title": "Simple coalitional games with beliefs",
            "Publication year": 2009,
            "Publication url": "https://www.aaai.org/ocs/index.php/IJCAI/IJCAI-09/paper/viewPaper/306",
            "Abstract": "We introduce coalitional games with beliefs (CGBs), a natural generalization of coalitional games to environments where agents possess private beliefs regarding the capabilities (or types) of others. We put forward a model to capture such agent-type uncertainty, and study coalitional stability in this setting. Specifically, we introduce a notion of the core for CGBs, both with and without coalition structures. For simple games without coalition structures, we then provide a characterization of the core that matches the one for the full information case, and use it to derive a polynomial-time algorithm to check core nonemptiness. In contrast, we demonstrate that in games with coalition structures allowing beliefs increases the computational complexity of stability-related problems. In doing so, we introduce and analyze weighted voting games with beliefs, which may be of independent interest. Finally, we discuss connections between our model and other classes of coalitional games.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Extracting hidden preferences over partitions in hedonic cooperative games",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-29551-6_73",
            "Abstract": "The prevalent assumption in hedonic games is that agents are interested solely on the composition of their own coalition. Moreover, agent preferences are usually assumed to be known with certainty. In our work, agents have hidden preferences over partitions. We first put forward the formal definition of hedonic games in partition function form (PFF-HGs), and extend well-studied classes of hedonic games to this setting. Then we exploit three well-known supervised learning models, linear regression, linear regression with basis function, and feed forward neural networks, in order to (approximately) extract the unknown hedonic preference relations over partitions. We conduct a systematic evaluation to compare the performance of these models on PFF-HGs; and, in the process, we develop an evaluation metric specifically designed for our problem. Our experimental results confirm the effectiveness of our work.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Novel Method for Predicting the Power Output of Distributed Renewable Energy Resources",
            "Publication year": 2013,
            "Publication url": "http://artemis.library.tuc.gr/DT2013-0285/DT2013-0285.pdf",
            "Abstract": "In recent years, estimating the power output of inherently intermittent and potentially distributed weather-driven and non-scheduled renewable energy resources has become a major scientific and societal concern. In this thesis, we provide an algorithmic framework, along with an interactive web-based tool, to enable short-tomiddle term forecasts of Photovoltaic Systems (PVS) and Wind Turbine Generators (WTG) power output. Importantly, we propose a generic PVS power output estimation method, the backbone of which is a non-linear solar irradiance approximation model that incorporates free-to-use, readily available weather forecasting reports coming from online providers. We present a thorough evaluation of different approaches of the respective model, as well as aa thorough evaluation of our PVS power output estimation method. We show that our PVS power output estimation method can be successfully employed within a broad geographical region (the Mediterranean belt) and come with specific performance guarantees. Crucially, our methods do not rely on complex and expensive weather models and data, and our web-based tool can be of immediate use to the scientific community and society at large. iii",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coalitional Bargaining with Agent Type Uncertainty.",
            "Publication year": 2007,
            "Publication url": "https://www.aaai.org/Papers/IJCAI/2007/IJCAI07-198.pdf",
            "Abstract": "Coalition formation is a problem of great interest in AI, allowing groups of autonomous, individually rational agents to form stable teams. Automating the negotiations underlying coalition formation is, naturally, of special concern. However, research to date in both AI and economics has largely ignored the potential presence of uncertainty in coalitional bargaining. We present a model of discounted coalitional bargaining where agents are uncertain about the types (or capabilities) of potential partners, and hence the value of a coalition. We cast the problem as a Bayesian game in extensive form, and describe its Perfect Bayesian Equilibria as the solutions to a polynomial program. We then present a heuristic algorithm using iterative coalition formation to approximate the optimal solution, and evaluate its performance.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Moment of inertia of potentially tilted cuboids",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=10617894662071122399&hl=en&oi=scholarr",
            "Abstract": "Calculating the moment of inertia of a tilted cuboid is essential for many practical applications, such as modeling a solar tracking system. In this paper we provide a general equation for calculating the moment of inertia of a potentially tilted, respecting its axes of rotation, cuboid.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:u_35RYKgDlwC",
            "Publisher": "Technical report, University of Southampton"
        },
        {
            "Title": "Optimising Long-Term Outcomes using Real-World Fluent Objectives: An Application to Football",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.09469",
            "Abstract": "In this paper, we present a novel approach for optimising long-term tactical and strategic decision-making in football (soccer) by encapsulating events in a league environment across a given time frame. We model the teams' objectives for a season and track how these evolve as games unfold to give a fluent objective that can aid in decision-making games. We develop Markov chain Monte Carlo and deep learning-based algorithms that make use of the fluent objectives in order to learn from prior games and other games in the environment and increase the teams' long-term performance. Simulations of our approach using real-world datasets from 760 matches shows that by using optimised tactics with our fluent objective and prior games, we can on average increase teams mean expected finishing distribution in the league by up to 35.6%.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Artificial intelligence techniques for the smart grid",
            "Publication year": 2018,
            "Publication url": "https://www.tandfonline.com/doi/full/10.1080/17512549.2017.1410362",
            "Abstract": "In recent years, there is a rush in Artificial Intelligence (AI) research to produce practical solutions for the Smart Grid, the anticipated new generation of energy (primarily electricity) networks that will be able to make efficient use of renewable energy sources, support real time and efficient demand response, as well as the large-scale deployment of electric vehicles (EVs). AI techniques and methodologies can be instrumental in addressing sustainability problems, for example, to increase the efficiency and effectiveness of the way we manage and allocate our natural and societal resources. The drive to use AI for the Smart Grid has in turn led to novel questions and challenges for AI research, and to the realization that only the cross-fertilization of ideas and mixing of various techniques originating in different (sub-) fields can lead to the Holy Grail of an electricity Grid that takes full advantage of AI technologies to deliver …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Mechanism design for demand-side management",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7851148/",
            "Abstract": "As the penetration of renewables into the grid increases, so do the uncertainty and constraints that need to be taken into account during demand-side management (DSM). Mechanism design (MD) provides effective DSM solutions that incorporate end-user preferences and uncertain capabilities, without jeopardizing comfort. The authors discuss the state of the art in DSM methods, which they broadly classify as game theoretic (largely MD) and not. They then proceed to outline a novel scheme for large-scale coordinated demand shifting, a highly important problem. Their mechanism employs the services of cooperatives of electricity consumers, incentivizes truthfulness regarding the contributions promised by the participants, and incorporates profiling techniques that assess contributors' trustworthiness. It is shown via simulations over real-world datasets to effectively shift peak load and generate substantial …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sequential decision making in repeated coalition formation under uncertainty",
            "Publication year": 2008,
            "Publication url": "https://eprints.soton.ac.uk/265174/1/BayesRLCF08.pdf",
            "Abstract": "The problem of coalition formation when agents are uncertain about the types or capabilities of their potential partners is a critical one. In [3] a Bayesian reinforcement learning framework is developed for this problem when coalitions are formed (and tasks undertaken) repeatedly: not only does the model allow agents to refine their beliefs about the types of others, but uses value of information to define optimal exploration policies. However, computational approximations in that work are purely myopic. We present novel, non-myopic learning algorithms to approximate the optimal Bayesian solution, providing tractable means to ensure good sequential performance. We evaluate our algorithms in a variety of settings, and show that one, in particular, exhibits consistently good sequential performance. Further, it enables the Bayesian agents to transfer acquired knowledge among different dynamic tasks.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Application of Agent-Based Modelling and GIS in Minoan Crete",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=2nwvEAAAQBAJ&oi=fnd&pg=PA479&dq=info:adrJPLI3oHwJ:scholar.google.com&ots=JLbsIc8vg3&sig=XPWUd0hcNoIljQt0Bj8GcjKPKWg",
            "Abstract": "Agent-based modelling, including simulation within a GIS environmental framework, has been increasingly in use in Archaeology during the past decade, as a tool for assessing the plausibility of (alternative) hypotheses regarding ancient civilizations within a specific geographical context. In this paper, we describe a generic agent-based model for simulating ancient societies. We employ this model to evaluate the impact of different social organisation paradigms and agricultural strategies population dynamics and evolving spatial distribution of settlement locations. As a case study, we employ our model on an artificial ancient society during the Bronze Age (Minoan civilization) located in the area of Malia at Eastern Crete. Model parameter choices are based on archaeological studies, but are not biased towards any specific assumption. Results over a number of different simulation scenarios demonstrate increased sustainability for settlements adopting a socio-economic organisation model based on self-organisation.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CLFD: A Novel Vectorization Technique and Its Application in Fake News Detection",
            "Publication year": 2020,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03089216/",
            "Abstract": "In recent years, fake news detection has been an emerging research area. In this paper, we put forward a novel statistical approach for the generation of feature vectors to describe a document. Our so-called class label frequency distance (clfd), is shown experimentally to provide an effective way for boosting the performance of machine learning methods. Specifically, our experiments, carried out in the fake news detection domain, verify that efficient traditional machine learning methods that use our vectorization approach, consistently outperform deep learning methods that use word embeddings for small and medium sized datasets, while the results are comparable for large datasets. In addition, we demonstrate that a novel hybrid method that utilizes both a clfd-boosted logistic regression classifier and a deep learning one, clearly outperforms deep learning methods even in large datasets.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning hedonic games via probabilistic topic modeling",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-14174-5_5",
            "Abstract": "A usual assumption in the hedonic games literature is that of complete information; however, in the real world this is almost never the case. As such, in this work we assume that the players’ preference relations are hidden: players interact within an unknown hedonic game, of which they can observe a small number of game instances. We adopt probabilistic topic modeling as a learning tool to extract valuable information from the sampled game instances. Specifically, we employ the online Latent Dirichlet Allocation (LDA) algorithm in order to learn the latent preference relations in Hedonic Games with Dichotomous preferences. Our simulation results confirm the effectiveness of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "An Agent-Based Model for Simulating Inter-Settlement Trade in Past Societies",
            "Publication year": 2020,
            "Publication url": "https://pdfs.semanticscholar.org/ff85/a24110f0679cff57ff0a725db745c8648487.pdf",
            "Abstract": "Social and computational archaeology focuses largely on the study of past societies and the evolution of human behaviour. At the same time, agent-based models (ABMs) allow the e icient modeling of human agency, and the quantitative representation and exploration of specific properties and patterns in archaeological information. In this work we put forward a novel agent-based trading model, for simulating the exchange and distribution of resources across settlements in past societies. The model is part of a broader ABM populated with autonomous, utility-seeking agents corresponding to households; with the ability to employ any spatial interaction model of choice. As such, it allows the study of the settlements’ trading ability and power, given their geo-location and their position within the trading network, and the structural properties of the network itself. As a case study we use the Minoan society during the Bronze Age, in the wider area of “Knossos” on the island of Crete, Greece. We instantiate two well-known spatial interaction sub-models, XTENT and Gravity, and conduct a systematic evaluation of the dynamic trading network that is formed over time. Our simulations assess the sustainability of the artificial Minoan society in terms of population size, number and distribution of agent communities, with respect to the available archaeological data and spatial interaction model employed; and, further, evaluate the resulting trading network’s structure (centrality, clustering, etc.) and how it a ects inter-settlement organization, providing in the process insights and support for archaeological hypotheses on the settlement organization in place at the …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Journal of Artificial Societies and Social Simulation"
        },
        {
            "Title": "Competing with humans at fantasy football: Team formation in large partially-observable domains",
            "Publication year": 2012,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/8259",
            "Abstract": "We present the first real-world benchmark for sequentially-optimal team formation, working within the framework of a class of online football prediction games known as Fantasy Football. We model the problem as a Bayesian reinforcement learning one, where the action space is exponential in the number of players and where the decision maker's beliefs are over multiple characteristics of each footballer. We then exploit domain knowledge to construct computationally tractable solution techniques in order to build a competitive automated Fantasy Football manager. Thus, we are able to establish the baseline performance in this domain, even without complete information on footballers' performances (accessible to human managers), showing that our agent is able to rank at around the top percentile when pitched against 2.5 M human players.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cooperative game-theoretic approach to the social ridesharing problem",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370217300243",
            "Abstract": "In this work, we adopt a cooperative game theoretic approach in order to tackle the social ridesharing (SR) problem, where a set of commuters, connected through a social network, form coalitions and arrange one-time rides at short notice. In particular, we address two fundamental aspects of this problem. First, we focus on the optimisation problem of forming the travellers' coalitions that minimise the travel cost of the overall system. To this end, we model the formation problem as a Graph-Constrained Coalition Formation (GCCF) one, where the set of feasible coalitions is restricted by a graph (i.e., the social network). Our approach allows users to specify both spatial and temporal preferences for the trips. Second, we tackle the payment allocation aspect of SR, by proposing the first approach that computes kernel-stable payments for systems with thousands of agents. We conduct a systematic empirical evaluation that …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:r0BpntZqJG4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Coordination in multiagent reinforcement learning: A Bayesian approach",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/860575.860689",
            "Abstract": "Much emphasis in multiagent reinforcement learning (MARL) research is placed on ensuring that MARL algorithms (eventually) converge to desirable equilibria. As in standard reinforcement learning, convergence generally requires sufficient exploration of strategy space. However, exploration often comes at a price in the form of penalties or foregone opportunities. In multiagent settings, the problem is exacerbated by the need for agents to\" coordinate\" their policies on equilibria. We propose a Bayesian model for optimal exploration in MARL problems that allows these exploration costs to be weighed against their expected benefits using the notion of value of information. Unlike standard RL models, this model requires reasoning about how one's actions will influence the behavior of other agents. We develop tractable approximations to optimal Bayesian exploration, and report on experiments illustrating the …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Coalition Structure Generation via Approximately Equivalent Induced Subgraph Games",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9314263/",
            "Abstract": "We show that any characteristic function game (CFG) G can be always turned into an approximately equivalent game represented using the induced subgraph game (ISG) representation. Such a transformation incurs obvious benefits in terms of tractability of computing solution concepts for G. Our transformation approach, namely, AE-ISG, is based on the solution of a norm approximation problem. We then propose a novel coalition structure generation (CSG) approach for ISGs that is based on graph clustering, which outperforms existing CSG approaches for ISGs by using off-the-shelf optimization solvers. Finally, we provide theoretical guarantees on the value of the optimal CSG solution of G with respect to the optimal CSG solution of the approximately equivalent ISG. As a consequence, our approach allows one to compute approximate CSG solutions with quality guarantees for any CFG. Results on a real-world …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Evolutionary game-theoretic modeling of past societies' social organization",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=17509390903798966854&hl=en&oi=scholarr",
            "Abstract": "In this work, we extend a generic agent-based model for simulating ancient societies, by blending evolutionary game theory with multiagent systems’ self-organization. Our approach models the evolution of social behaviours in a population of strategically interacting agents corresponding to households in the Early Minoan era. To this end, agents participate in repeated games by means of which they exchange utility (resources) with others. The games’ outcomes contribute to both the continuous re-organization of the social structure, and the progressive adoption of the most successful strategies. We present a systematic evaluation of the performance of the various strategies, assuming several variations in the way agent and organization fitness are defined, as well as in the way agents adopt new strategies. Overall, results for societies adopting this evolutionary approach, demonstrate that strategic …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:YFjsv_pBGBYC",
            "Publisher": "MIT Press"
        },
        {
            "Title": "Characteristic function games with restricted agent interactions: Core-stability and coalition structures",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0004370215001812",
            "Abstract": "In many real-world settings, the structure of the environment constrains the formation of coalitions among agents. These settings can be represented by characteristic function games, also known as coalitional games, equipped with interaction graphs. An interaction graph determines the set of all feasible coalitions, in that a coalition C can form only if the subgraph induced over the nodes/agents in C is connected. Our work analyzes stability issues arising in such environments, by focusing on the core as a solution concept, and by considering the coalition structure viewpoint, that is, without assuming that the grand-coalition necessarily forms.The complexity of the coalition structure core is studied over a variety of interaction graph structures of interest, including complete graphs, lines, cycles, trees, and nearly-acyclic graphs (formally, having bounded treewidth). The related stability concepts of the least core and the …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:IWHjjKOFINEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Cooperatives of distributed energy resources for efficient virtual power plants",
            "Publication year": 2011,
            "Publication url": "https://eprints.soton.ac.uk/271950/",
            "Abstract": "The creation of Virtual Power Plants (VPPs) has been suggested in recent years as the means for achieving the cost-efficient integration of the many distributed energy resources (DERs) that are starting to emerge in the electricity network. In this work, we contribute to the development of VPPs by offering a game-theoretic perspective to the problem. Specifically, we design cooperatives (or “cooperative VPPs”—CVPPs) of rational autonomous DER-agents representing small-to-medium size renewable electricity producers, which coalesce to profitably sell their energy to the electricity grid. By so doing, we help to counter the fact that individual DERs are often excluded from the wholesale energy market due to their perceived inefficiency and unreliability. We discuss the issues surrounding the emergence of such cooperatives, and propose a pricing mechanism with certain desirable properties. Specifically, our mechanism guarantees that CVPPs have the incentive to truthfully report to the grid accurate estimates of their electricity production, and that larger rather than smaller CVPPs form; this promotes CVPP efficiency and reliability. In addition, we propose a scheme to allocate payments within the cooperative, and show that, given this scheme and the pricing mechanism, the allocation is in the core and, as such, no subset of members has a financial incentive to break away from the CVPP. Moreover, we develop an analytical tool for quantifying the uncertainty about DER production estimates, and distinguishing among different types of errors regarding such estimates. We then utilize this tool to devise protocols to manage CVPP membership. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards optimal solar tracking: a dynamic programming approach",
            "Publication year": 2015,
            "Publication url": "https://ojs.aaai.org/index.php/AAAI/article/view/9244",
            "Abstract": "The power output of photovoltaic systems (PVS) increases with the use of effective and efficient solar tracking techniques. However, current techniques suffer from several drawbacks in their tracking policy:(i) they usually do not consider the forecasted or prevailing weather conditions; even when they do, they (ii) rely on complex closed-loop controllers and sophisticated instruments; and (iii) typically, they do not take the energy consumption of the trackers into account. In this paper, we propose a policy iteration method (along with specialized variants), which is able to calculate near-optimal trajectories for effective and efficient day-ahead solar tracking, based on weather forecasts coming from on-line providers. To account for the energy needs of the tracking system, the technique employs a novel and generic consumption model. Our simulations show that the proposed methods can increase the power output of a PVS considerably, when compared to standard solar tracking techniques.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decentralized Large-Scale Electricity Consumption Shifting by Prosumer Cooperatives.",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=xfboDAAAQBAJ&oi=fnd&pg=PA175&dq=info:vaKrgsSxVZwJ:scholar.google.com&ots=zAhCLnQKfV&sig=v1dbaUkVatB3AmHZHjpTtNTj6lg",
            "Abstract": "In this work we address the problem of coordinated consumption shifting for electricity prosumers. We show that individual optimization with respect to electricity prices does not always lead to minimized costs, thus necessitating a cooperative approach. A prosumer cooperative employs an internal cryptocurrency mechanism for coordinating members decisions and distributing the collectively generated profits. The mechanism generates cryptocoins in a distributed fashion, and awards them to participants according to various criteria, such as contribution impact and accuracy between stated and final shifting actions. In particular, when a scoring rulesbased distribution method is employed, participants are incentivized to be accurate. When tested on a large dataset with real-world production and consumption data, our approach is shown to provide incentives for accurate statements and increased economic profits for the cooperative.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Coalitional stability in structured environments",
            "Publication year": 2012,
            "Publication url": "https://eprints.soton.ac.uk/273088/1/cmjCStabStrEnv2012.pdf",
            "Abstract": "In many real-world settings, the structure of the environment constrains the formation of coalitions among agents. Therefore, examining the stability of formed coalition structures in such settings is of natural interest. We address this by considering corestability within various models of cooperative games with structure. First, we focus on characteristic function games defined on graphs that determine feasible coalitions. In particular, a coalition S can emerge only if S is a connected set in the graph. We study the (now modified) core, in which it suffices to check only feasible deviations. Specifically, we investigate core non-emptiness as well as the complexity of computing stable configurations. We then move on to the more general class of (graph-restricted) partition function games, where the value of a coalition depends on which other coalitions are present, and provide the first stability results in this domain. Finally, we propose a “Bayesian” extension of partition function games, in which information regarding the success of a deviation is provided in the form of a probability distribution describing the possible reactions of non-deviating agents, and provide the first core-stability results in this model also.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Influence of State-Variable Constraints on Partially Observable Monte Carlo Planning.",
            "Publication year": 2019,
            "Publication url": "https://www.researchgate.net/profile/Alberto-Castellini/publication/334844546_Influence_of_State-Variable_Constraints_on_Partially_Observable_Monte_Carlo_Planning/links/5dcfaa03299bf1b74b4517bb/Influence-of-State-Variable-Constraints-on-Partially-Observable-Monte-Carlo-Planning.pdf",
            "Abstract": "Online planning methods for partially observable Markov decision processes (POMDPs) have recently gained much interest. In this paper, we propose the introduction of prior knowledge in the form of (probabilistic) relationships among discrete state-variables, for online planning based on the well-known POMCP algorithm. In particular, we propose the use of hard constraint networks and probabilistic Markov random fields to formalize state-variable constraints and we extend the POMCP algorithm to take advantage of these constraints. Results on a case study based on Rocksample show that the usage of this knowledge provides significant improvements to the performance of the algorithm. The extent of this improvement depends on the amount of knowledge encoded in the constraints and reaches the 50% of the average discounted return in the most favorable cases that we analyzed.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cooperative virtual power plant formation using scoring rules",
            "Publication year": 2012,
            "Publication url": "https://www.aaai.org/ocs/index.php/AAAI/AAAI12/paper/viewPaper/5002",
            "Abstract": "Virtual Power Plants (VPPs) are fast emerging as a suitable means of integrating small and distributed energy resources (DERs), like wind and solar, into the electricity supply network (Grid). VPPs are formed via the aggregation of a large number of such DERs, so that they exhibit the characteristics of a traditional generator in terms of predictability and robustness. In this work, we promote the formation of such\" cooperative''VPPs (CVPPs) using multi-agent technology. In particular, we design a payment mechanism that encourages DERs to join CVPPs with large overall production. Our method is based on strictly proper scoring rules and incentivises the provision of accurate predictions from the CVPPs---and in turn, the member DERs---which aids in the planning of the supply schedule at the Grid. We empirically evaluate our approach using the real-world setting of 16 commercial wind farms in the UK. We show that our mechanism incentivises real DERs to form CVPPs, and outperforms the current state of the art payment mechanism developed for this problem.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiagent reinforcement learning methods to resolve demand capacity balance problems",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201010",
            "Abstract": "In this article, we explore the computation of joint policies for autonomous agents to resolve congestions problems in the air traffic management (ATM) domain. Agents, representing flights, have limited information about others' payoffs and preferences, and need to coordinate to achieve their tasks while adhering to operational constraints. We formalize the problem as a multiagent Markov decision process (MDP) towards deciding flight delays to resolve demand and capacity balance (DCB) problems in ATM. To this end, we present multiagent reinforcement learning methods that allow agents to interact and form own policies in coordination with others. Experimental study on real-world cases, confirms the effectiveness of our approach in resolving the demand-capacity balance problem.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Bayesian approach to multiagent reinforcement learning and coalition formation under uncertainty",
            "Publication year": 2007,
            "Publication url": "http://www.cs.toronto.edu/~gehalk/PhDThesis/gehalk_thesis.pdf",
            "Abstract": "Sequential decision making under uncertainty is always a challenge for autonomous agents populating a multiagent environment, since their behaviour is inevitably influenced by the behaviour of others. Further, agents have to constantly struggle to find the right balance between exploiting current information regarding the environment and the rest of its inhabitants, and exploring so that they acquire additional information. Moreover, they need to profitably trade off short-term rewards with anticipated long-term ones, while learning through interaction about the environment and others—employing techniques from reinforcement learning (RL), a fundamental area of study within artificial intelligence (AI).Coalition formation is a problem of great interest within game theory and AI, allowing autonomous individually rational agents to form stable or transient teams (or coalitions) to tackle an underlying task. Agents participating in realistic scenarios of repeated coalition formation under uncertainty face the issues identified above, and need to bargain to succesfully negotiate the terms of their participation in coalitions—often having to compromise individual with team welfare effectively.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Aiming for Half Gets You to the Top: Winning PowerTAC 2020",
            "Publication year": 2021,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=iEw5EAAAQBAJ&oi=fnd&pg=PA144&dq=info:zL2Oo2RGMHoJ:scholar.google.com&ots=0lDd5cDOMQ&sig=PfQufwJ87_k9ItpghoBoryu8Img",
            "Abstract": "The PowerTAC competition provides a multi-agent simulation platform for electricity markets, in which intelligent agents acting as electricity brokers compete with each other aiming to maximize their profits. Typically, the gains of agents increase as the number of their customers rises, but in parallel, costs also increase as a result of higher transmission fees that need to be paid by the electricity broker. Thus, agents that aim to take over a disproportionately high share of the market, often end up with losses due to being obliged to pay huge transmission capacity fees. In this paper, we present a novel trading strategy that, based on this observation, aims to balance gains against costs; and was utilized by the champion of the PowerTAC-2020 tournament, TUC-TAC. The approach also incorporates a wholesale market strategy that employs Monte Carlo Tree Search to determine TUC-TAC’s best course of action when participating in the market’s double auctions. The strategy is improved by making effective use of a forecasting module that seeks to predict upcoming peaks in demand, since in such intervals incurred costs significantly increase. A post-tournament analysis is also included in this paper, to help draw important lessons regarding the strengths and weaknesses of the various strategies used in the PowerTAC-2020 competition.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "Stability of overlapping coalitions",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/1598780.1598789",
            "Abstract": "In multiagent systems, it is often the case that agents need to form teams in order to achieve their goals. This may happen even if the agents are controlled by different parties: while in this case the agents do not necessarily share the same set of goals and priorities, they still need to cooperate, as individual agents may not possess sufficient resources to perform their tasks independently. In such scenarios, a natural tool for modeling agent collaboration is coalitional game theory [Branzei et al. 2008], a research area that studies collaboration and team formation among rational entities.The two main questions studied by coalitional game theory are:(1) What teams, or coalitions, of agents are likely to arise? and (2) How are the agents going to share the benefits of cooperation? To answer these questions, it is usually assumed that the game ends with the agents forming the grand coalition, ie, the coalition that includes …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:_FxGoFyzp5QC",
            "Publisher": "ACM"
        },
        {
            "Title": "Learning policies for resolving demand-capacity imbalances during pre-tactical air traffic management",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-64798-2_15",
            "Abstract": "In this work we propose and investigate the use of collaborative reinforcement learning methods for resolving demand-capacity imbalances during pre-tactical Air Traffic Management. By so doing, we also initiate the study of data-driven techniques for predicting multiple correlated aircraft trajectories; and, as such, respond to a need identified in contemporary research and practice in air-traffic management. Our simulations, designed based on real-world data, confirm the effectiveness of our methods in resolving the demand-capacity problem, even in extremely hard scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Hedonic Utility Games",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3411408.3411412",
            "Abstract": "We initiate the study of a novel class of cooperative games, the Hedonic Utility Games (HUGs), that takes into consideration both hedonic and utility-related preferences. We first formally define HUGs, and show how to extend and apply existing stability solution concepts to them. Then, we put forward the novel Individually Rational-Individually Stable (IRIS) solution concept, developed specifically for HUGs, that characterizes the stability of coalition structures in such settings. In addition, we propose a natural,“trichotomous” hedonic preferences model; study certain HUGs’ properties in that model; and exploit it to characterize the feasibility of HUGs coalitions, and to obtain a probability bound for pruning the coalitional space, thus reducing the computational load of computing kernel-stable payoff configurations for IRIS partitions.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiagent reinforcement learning: Stochastic games with multiple learning players",
            "Publication year": 2003,
            "Publication url": "https://www.odu.edu/~jsokolow/projects/files/multiagent%20reinforced%20learning.pdf",
            "Abstract": "Learning through interaction is a fundamental idea underlying many theories of learning and intelligence. Reinforcement Learning (RL)[26, 49], from a computer science point of view, is the problem that an agent faces when trying to learn behavior by trial and error through interactions with a dynamic environment. This is different from supervised learning, which is learning from examples provided by a knowledgable external supervisor. A reinforcement learning agent is a goal-seeking agent that can sense aspects of its environment and can choose actions to influence this environment, so as to maximize a numerical reward signal. Reinforcement learning is a highly active research area, and is strongly interconnected not only with research in machine learning, artificial intelligence (AI) and neural networks, but neuroscience, psychology, and statistics, as well. The reinforcement learning problem becomes even more interesting when studied in the context of multiple reinforcement learning agents co-existing in the same environment. This situation constitutes the Multiagent Reinforcement Learning (MARL) problem. The presence of multiple reinforcement learning agents creates new opportunities for them to seize or obstacles to overcome so that they enhance their learning capabilities; it also raises important questions1 regarding the value of employing\" social behaviors\" like co-operation and co-ordination. Other particularly interesting issues arise given that learning in a multiagent world of this kind can be viewed as learning in a game with multiple players.The objective of this paper is to present a review of research done in this area, focusing …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interpreting the Past through Agent-Based Modeling and GIS",
            "Publication year": 2015,
            "Publication url": "http://www.intelligence.tuc.gr/~angelos/BestPracticeGuide_prePrint.pdf",
            "Abstract": "The past decade has seen archaeology taking an increasingly high interest in agent-based modeling (ABM). ABM’s emerging popularity is due to its ability to model individuals and societies, readily incorporate any geospatial data available, and encompass uncertainty inherent in archaeological theories or findings. Indeed, the unpredictability of interaction patterns within a simulated agent society, along with the strong possibility of emergent behavior, can help researchers gain new insights into existing theories; or even come up with completely novel explanations and paradigms regarding the ancient societies being studied. Agent-based modeling is thus a potentially powerful tool, which can be used to assess the plausibility of alternative hypotheses regarding ancient civilizations, their social organization, and social and environmental processes which might have existed. The purpose of this chapter is to provide an overview on ABM and corresponding methodologies, and present examples of recent work that has applied geospatial agent-based models in archaeology.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overlapping coalition formation games: Charting the tractability frontier",
            "Publication year": 2012,
            "Publication url": "http://www.intelligence.tuc.gr/~gehalk/Papers/zceOCFtractAAMAS2012.pdf",
            "Abstract": "Cooperative games with overlapping coalitions (OCF games)[3, 23] model scenarios where agents can distribute their resources among several tasks; each task generates a profit which may be freely divided among the agents participating in the task. The goal of this work is to initiate a systematic investigation of algorithmic aspects of OCF games. We propose a discretized model of overlapping coalition formation, where each agent i∈ N has a weight wi∈ N and may allocate an integer amount of weight to any task. Within this framework, we focus on the computation of outcomes that are socially optimal and/or stable. We discover that the algorithmic complexity of the associated problems crucially depends on the amount of resources that each agent possesses, the maximum coalition size, and the pattern of interaction among the agents. We identify several constraints that lead to tractable subclasses of OCF games, and provide efficient algorithms for games that belong to these subclasses. We supplement our tractability results by hardness proofs, which clarify the role of our constraints.",
            "Abstract entirety": 1,
            "Author pub id": "KdYD5-cAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient multi-criteria coalition formation using hypergraphs (with application to the v2g problem)",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-59294-7_9",
            "Abstract": "This paper proposes, for the first time in the literature, the use of hypergraphs for the efficient formation of effective coalitions. We put forward several formation methods that build on existing hypergraph pruning, transversal, and clustering algorithms, and exploit the hypergraph structure to identify agents with desirable characteristics. Our approach allows the near-instantaneous formation of high quality coalitions, adhering to multiple stated quality requirements. Moreover, our methods are shown to scale to dozens of thousands of agents within fractions of a second; with one of them scaling to even millions of agents within seconds. We apply our approach to the problem of forming coalitions to provide (electric) vehicle-to-grid (V2G) services. Ours is the first approach able to deal with large-scale, real-time coalition formation for the V2G problem, while taking multiple criteria into account for creating the …",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:k_IJM867U9cC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "First assessment of measures and tools implemented by renewable energy supplying cooperatives (REScoops) to stimulate energy savings among their members",
            "Publication year": 2017,
            "Publication url": "https://research.tudelft.nl/en/publications/first-assessment-of-measures-and-tools-implemented-by-renewable-e",
            "Abstract": "First assessment of measures and tools implemented by renewable energy supplying \ncooperatives (REScoops) to stimulate energy savings among their members — TU Delft \nResearch Portal Skip to main navigation Skip to search Skip to main content TU Delft Research \nPortal Logo Help & FAQ Home Researchers Research Units Research output Activities \nDatasets Press / Media Prizes Projects Search by expertise, name or affiliation First assessment \nof measures and tools implemented by renewable energy supplying cooperatives (REScoops) \nto stimulate energy savings among their members Thomas Hoppe, Frans Coenen, Georgios \nChalkiadakis, Theocharis Tsoutsos Organisation and Governance Research output: Chapter in \nBook/Conference proceedings/Edited volume › Conference contribution › Scientific Overview \nOriginal language English Title of host publication Annual NIG Work Conference Subtitle of on ‘…",
            "Abstract entirety": 0,
            "Author pub id": "KdYD5-cAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        }
    ]
}]