[{
    "name": "Γεώργιος Τσιατούχας",
    "romanize name": "Georgios Tsiatouchas",
    "School-Department": "Μηχανικών Ηλεκτρονικών Υπολογιστών και Πληροφορικής",
    "University": "uoi",
    "Rank": "Καθηγητής",
    "Apella_id": 4752,
    "Scholar name": "Yiorgos Tsiatouhas",
    "Scholar id": "gHsE8pYAAAAJ",
    "Affiliation": "University of Ioannina",
    "Citedby": 1024,
    "Interests": [
        "Integrated Circuit Design and Design for Testability"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=gHsE8pYAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Oscillation-based technique for post-bond parallel testing and diagnosis of multiple TSVs",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8106985/",
            "Abstract": "Through Silicon Vias (TSVs) are crucial elements for the reliable operation and the yield of three dimensional integrated circuits (3D ICs). Resistive open defects are a serious concern in TSV structures. In this paper, a post-bond, parallel testing technique is proposed for the detection and location of resistive open defects in TSVs, which is based on easily synthesizable all digital testing circuitry. The new testing scheme provides tolerance over process and temperature variations that may influence the embedded circuits. Extensive typical simulations and Monte-Carlo analysis results, using the 65nm technology of TSMC, accentuate the effectiveness of the new method.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A test and calibration strategy for adjustable RF circuits",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10470-012-9981-x",
            "Abstract": "A test and calibration strategy suitable for adjustable RF circuits is presented in this paper. Certain performance-affecting circuit elements are designed to be digitally controllable, providing the capability to adjust the performance characteristics of a circuit’s instance around their post-fabrication values, throughout a set of discrete states of operation. The alternate test methodology is adopted for test and calibration and a set of optimally selected test observables is used to develop regression models for the prediction of the circuit’s performance characteristics in every state of operation. In the test phase, measurements of the test observables are obtained from a subset of the circuit’s states. The processing of these observables provides accurate prediction of the RF circuit’s performance characteristics in all available states and enables the discrimination of defect-free from defective circuits. The latter is further …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer US"
        },
        {
            "Title": "The time dilation scan architecture for timing error detection and correction",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.520.5879&rep=rep1&type=pdf",
            "Abstract": "Timing failures of high complexity-high frequency circuit designs, which are mainly caused by test escapes and environmental as well as operating conditions, are a real concern in nanometer technologies. In this work, the Time Dilation (TimeD) scan architecture is proposed, which is suitable for both concurrent error detection/correction and off-line testing. The TimeD architecture offers concurrent multiple error detection and correction at the small penalty of one clock cycle delay at the normal circuit operation for each error correction. Moreover, it has lower silicon area requirements compared to previous techniques, and it imposes negligible overhead on the circuit performance.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A design for testability scheme for CMOS LC-tank voltage controlled oscillators",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:JETT.0000023677.58861.81",
            "Abstract": "In this paper, a new Design for Testability (DFT) scheme is proposed, for the testing of LC-tank CMOS Voltage Controlled Oscillators (VCOs). The proposed test-circuit is capable of detecting hard (catastrophic) and soft (parametric) faults, injected in the VCO. The test result is provided by a digital Fail/Pass signal. Simulation results reveal the effectiveness of the proposed circuit. The overall silicon area requirement of the proposed DFT scheme is negligible.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A new scheme for effective I/sub DDQ/testing in deep submicron",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/843684/",
            "Abstract": "I/sub DDQ/, testing has become a widely accepted defect detection technique in CMOS ICs. However its effectiveness in deep submicron is threatened by the increased transistor sub-threshold leakage current. In this paper a new l/sub DDQ/ testing scheme is proposed based on the use of a compensation circuit. The compensation circuit is used to eliminate, during testing, normal leakage current from the sensing node of the circuit under test so that already known [in the open literature] I/sub DDQ/ sensing techniques can be applied in deep submicron.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low power scan by partitioning and scan hold",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6219070/",
            "Abstract": "Scan testing dynamic power consumption can induce reliability problems in the circuit under test (CUT) during manufacturing testing. In this paper, we propose a scan chain partitioning technique, supported by a scan hold mechanism, for low power dissipation during the shift phase of the scan testing procedures. Substantial power reductions can be achieved either in built-in self test (BIST) or non-BIST scan-based testing environments, without test application time increase, fault coverage decrease, scan cell reordering and clock gating.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A current monitoring technique for IDDQ testing in digital integrated circuits",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926015000061",
            "Abstract": "Although IDDQ testing has become a widely accepted defect detection technique in CMOS ICs, its effectiveness in nanometer technologies is threatened by the increased leakage current variations. In this paper, a current monitoring technique that overcomes the current variations problem in IDDQ testing is proposed. According to this, a core is partitioned into two subcircuits and the intrinsic leakage current of the one subcircuit is used to control the leakage current at the IDDQ sensing node of the other and vice-versa during test application. This way process related leakage current variations are taken into account and small defective currents turn to be detectable according to the needs of modern nanometer technologies. Additionally, a Built-In Current Sensor is presented, which exploits the proposed technique and experimental results are illustrated by its application on a fabricated chip.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A state assignment algorithm for finite state machines",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/913003/",
            "Abstract": "In this paper an algorithm to generate an optimum initial state assignment for Finite State Machines is presented, that in combination with the Kantabutra-Andreou method (1994) can provide a state assignment with the minimum number of bits.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Double node charge sharing SEU tolerant latch design",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6873683/",
            "Abstract": "Single event upsets (SEUs) that affect adjacent nodes in a design, by charge sharing mechanisms among these nodes, are a great concern in nanometer SRAMs, since pairs of cells are influenced. The concern is also extended to SEU related soft error tolerant latch designs, where multiple memory elements are exploited. In this work, we deal with double node charge sharing SEUs (DNCS-SEUs) that affect latch operation and we propose a new latch topology that it is capable to provide soft error tolerance under these new circumstances where single nodes or pairs of nodes are influenced by an SEU. Simulation results validate the efficiency of the new design.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Low-Cost, Robust and Tolerant, Digital Scheme for Post-Bond Testing and Diagnosis of TSVs",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-021-05939-z",
            "Abstract": "Through Silicon Vias (TSVs) are crucial elements for the reliable operation and yield of three dimensional integrated circuits (3D ICs). Defects are a serious concern in TSV structures. A post-bond, parallel testing and diagnosis scheme is proposed in this work, for the detection and location of resistive open or short to substrate defects in TSVs, which is based on easily synthesizable all digital testing circuitry. The new testing method provides tolerance over process and temperature variations that may influence the embedded circuits. Extensive typical model simulations and Monte-Carlo analysis results, using the 65 nm technology of TSMC, prove the effectiveness of the new method. Additionally, two representative methods from the literature are simulated and compared to the proposed one, in terms of effectiveness, robustness, tolerance, cost and design for testability effort. The proposed scheme is proven to …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Memory-less pipeline dynamic circuit design technique",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572771/",
            "Abstract": "A desirable characteristic of VLSI circuits is high speed operation. The use of dynamic circuit design techniques can provide high speed operation at lower silicon area requirements, compared to full static CMOS designs. Another common design technique in order to achieve high operating speed is the use of pipeline schemes. However, the higher the required operating frequency, the higher the number of stages we must implement in the pipeline. In addition, a limiting factor in cases with a large number of stages, are the restrictions imposed from the required memory elements. These memory elements not only increase the silicon area of the implementation but also restrict the maximum achievable frequency due to their internal delays. In this paper, we propose a memory-less pipeline design style, where the combinational part is implemented with dynamic circuits that offer the desirable high speed operation …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A BIST scheme for testing and repair of multi-mode power switches",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5993821/",
            "Abstract": "It was shown recently that signature analysis can be used for the test, diagnosis and repair of a robust multi-mode power-gating architecture. A drawback of this approach is that it requires a tester in a production-test environment, and potentially expensive manufacturing steps are necessary to repair defective power switches. We propose a built-in self-test (BIST) and built-in-self-repair (BISR) scheme for test and repair of multi-mode power switches. The proposed method reduces test cost and obviates additional manufacturing steps for post-silicon repair. In addition to eliminating the need for an external tester, it offers protection against latent defects that are manifested as errors in the field. In this way, the robust BIST/BISR solution for power switches enhances the reliability of multi-core chips that employ aggressive power management techniques. Simulation results highlight the low hardware overhead and …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timing error tolerance in small core designs for SoC applications",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7080878/",
            "Abstract": "Timing errors are an increasing reliability concern in nanometer technology, high complexity and multi-voltage/frequency integrated circuits. A local error detection and correction technique is presented in this work that is based on a new bit flipping flip-flop. Whenever a timing error is detected, it is corrected by complementing the output of the corresponding flip-flop. The proposed solution is characterized by very low silicon area and power requirements compared to previous design schemes in the open literature. To validate its efficiency, it has been applied in the design of a MIPS microprocessor core in a 90 nm technology, while a demonstration version of the same core in an FPGA platform is presented.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:vV6vV6tmYwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A High Speed Circuit for Concurrent Detection of Soft Errors in CMOS ICs",
            "Publication year": 2006,
            "Publication url": "http://users.uoa.gr/~matakias/publications/2006_RADECS%20_matakias_A8.pdf",
            "Abstract": "A new circuit that exploits the temporal nature of transient faults to provide concurrent soft error detection is presented in this work. The idea is based on a current mode sense amplifier topology to achieve small error detection times and on a high density pre-sensing scheme to reduce silicon area requirements.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel architecture to reduce test time in march-based SRAM tests",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6232963/",
            "Abstract": "We present a scheme to reduce the test application time in memory march algorithm application by providing the capability to enable in parallel more than one output of the address decoder during write operations. The reduction in test time, depending on the march algorithm, ranges from 25% to 60%, while the hardware overhead increase for 1 Kbyte SRAM's is less than 2,5%.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:zA6iFVUQeVQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved alternate test accuracy using weighted training sets",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7845263/",
            "Abstract": "The alternate test paradigm has been proposed as a low-cost replacement to expensive and time consuming conventional specification tests of analog/radio-frequency (RF) integrated circuits. Feasibility of alternate tests may be compromised if the pertinent models that are used for the prediction of a circuit's performance are of poor accuracy. To construct accurate models across the whole design space, a large set of real data needs ideally to be collected from different wafers and lots over a long period of time, that is not possible in the early production stage. In this paper we show that, even when small training sets are available, alternate test accuracy can be significantly improved if the training set is statistically treated in a weighted fashion. The proposed technique is demonstrated for an alternate test procedure developed for a 180nm CMOS RF mixer.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel scheme for testing radio frequency voltage controlled oscillators",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1301855/",
            "Abstract": "In this paper, a novel scheme for testing LC-tank CMOS Voltage Controlled Oscillators (VCOs) is presented. The proposed test circuit is capable of detecting soft and hard faults in a percentage that can guarantee safe overall fault coverage. It has been realized that the proposed technique is capable of detecting open and short circuits as well as process variations outside the specified limits in the passive components of the VCO in a percentage that exceeds 93%. The test result is provided by a digital Fail/Pass signal. Simulation results reveal the effectiveness of the proposed circuit, which additionally presents negligible silicon area requirements in the design process.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparative study of different current mode sense amplifiers in submicron CMOS technology",
            "Publication year": 2002,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-cds_20020425",
            "Abstract": "A comparison of different current mode sense amplifiers using 0.25 μm CMOS technology is presented. The sense amplifiers under consideration are suitable for current sensing in SRAM and Flash non-volatile memories. Simulation results are given regarding the sensing delay time for different power supply voltages Vdd and bit-line capacitance values. Comparative results are also provided for the energy dissipated per sensing operation, while worst-case and high-temperature simulations are included, in order to expose limitations of the sensors in various operating conditions.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "Floorplanning with abutment constraints based on corner block list",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=9716046278887828135&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A scan flip-flop for low-power scan operation",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4511024/",
            "Abstract": "Power dissipation in digital systems may be significantly high during scan testing where a large portion of power is consumed in the combinational part. This paper presents a new scan Flip-Flop design to eliminate test power consumption in the combinational block during scan shifting by masking signal transitions at the combinational logic inputs. The new scheme achieves the same power reduction in the scan mode of operation as earlier approaches in the open literature, while it presents better propagation times, in the normal mode, and significantly lower silicon area overhead.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New high-speed multioutput carry look-ahead adders",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6600780/",
            "Abstract": "In this brief, an efficient implementation of an 8-bit Manchester carry chain (MCC) adder in multioutput domino CMOS logic is proposed. The carries of this adder are computed in parallel by two independent 4-bit carry chains. Due to its limited carry chain length, the use of the proposed 8-bit adder module for the implementation of wider adders leads to significant operating speed improvement compared to the corresponding adders based on the standard 4-bit MCC adder module.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Path delay fault testing of multiplexer-based shifters",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210110058139",
            "Abstract": "In this paper we present a method for path delay fault testing of multiplexer-based shifters. We show that many paths of the shifter are not single path propagating hazard free robustly testable (SPP-HFRT) and we present a path selection method such that all the selected paths are SPP-HFRT by (Olog2 n) test-vector pairs, where n is the length of the shifter's operand. The propagation delay along all other paths is a function of the delays along the selected paths. This is the first work addressing the problem of shifter path delay fault testing.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:_xSYboBqXhAC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Effective timing error tolerance in flip-flop based core designs",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-013-5419-3",
            "Abstract": "Timing errors turn to be a great concern in nanometer technology integrated circuits. This work presents a low-cost and power efficient, multiple timing error detection and correction technique for flip-flop based core designs. Two new flip-flop designs are introduced, which exploit a transition detector for timing error detection along with asynchronous local error correction schemes to provide timing error tolerance. The proposed, the Razor and the Time Dilation techniques were applied separately in the design of three versions of a 32-bit MIPS microprocessor core and the pci_bridge32 IWLS05 core, using a 90 nm CMOS technology. Comparisons based on simulation results validate the efficiency of the new design approach.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Periodic bias-temperature instability monitoring in SRAM cells",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7968221/",
            "Abstract": "A method and a circuitry for the periodic monitoring of the Bias-Temperature Instability (BTI) influence on SRAMs are presented in this paper. Periodic BTI monitoring provides the ability to predict failures in the memory operation, due to aging, and early react to avoid them. The proposed scheme is based on a simple, low silicon area overhead, differential ring oscillator that can be easily embedded in a typical SRAM without affecting the normal mode of operation.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A compact built-in current sensor for I/sub DDQ/testing",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/856619/",
            "Abstract": "In this paper a simple to implement, compact, build-in current sensor for I/sub DDQ/ testing of CMOS VLSI circuits based on current mirroring techniques is proposed. This sensor can attain small detection times and can be used for both on-line and off-line I/sub DDQ/ testing.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Periodic Aging Monitoring in SRAM Sense Amplifiers",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8474169/",
            "Abstract": "In nanometer technologies the reliability of Static Random Access Memories (SRAMs) is seriously affected by transistor Bias-Temperature Instability (BTI). In this work, a circuit for the periodic aging monitoring in SRAM sense amplifiers (due to BTI related transistor degradation) is presented. This degradation increases the input offset voltage of a sense amplifier. Periodic monitoring provides the ability to avoid SRAM failures by detecting over aged sense amplifiers (near failure) and then properly react in order to maintain the memory reliable operation. The monitoring scheme is based on a low cost differential ring oscillator, which can be easily embedded in an SRAM array without affecting the normal mode of operation.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Built-in self-test, diagnosis, and repair of multimode power switches",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6856311/",
            "Abstract": "Recently proposed power-gating structures for intermediate power-off modes offer significant power saving benefits as they reduce the leakage power during short periods of inactivity. Even though they are very effective for reducing static power consumption, their reliable operation can be compromised by process variations and manufacturing defects. In this paper, we propose a signature analysis technique to efficiently test power-gating structures that provide intermediate power-off modes. Based on this technique, a methodology to repair catastrophic and parametric faults, and to tolerate process variations is presented. For testing and repairing multimode power switches, we propose a robust built-in self-test and built-in self-repair scheme that reduces test cost and obviates additional manufacturing steps for post-silicon repair. Simulation results highlight the low-cost and effectiveness of the proposed method for …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost and power efficient timing error tolerance in flip-flop based microprocessor cores",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6233002/",
            "Abstract": "Strengthening failure mechanisms accentuate timing errors as a real threat in nanometer technology microprocessor cores. In this work, we present a low-cost and low-power, multiple timing error detection and correction technique, which is based on a new flip-flop design. This flip-flop exploits a transition detector for error detection along with an asynchronous local error correction scheme to provide timing error tolerance. The proposed and the well known Razor techniques were applied separately in the design of two versions of a 32-bit MIPS microprocessor core using a 90nm CMOS technology. Comparisons based on the experimental results validate the efficiency of the new design approach.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Aging Prediction and Tolerance for the SRAM Memory Cell and Sense Amplifier",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-021-05932-6",
            "Abstract": "Serious reliability concerns of Static Random Access Memories (SRAMs) in nanometer technologies are the increased process variations as well as the various aging mechanisms. Bias Temperature Instability (BTI) and Hot Carrier Injection (HCI) phenomena are the main factors related to the aging reliability reduction. This degradation affects speed, operating voltages, memory cell noise margins and sense amplifier input offset voltage. Thus, it is imperative to develop design techniques for aging tolerance that will provide the ability to sense aging levels, predict upcoming failures in the memory and early react to retain the reliable operation. In this work, a circuit for the periodic aging monitoring in SRAM sense amplifiers and memory cells is presented.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:J-pR_7NvFogC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Aging Monitors for SRAM Memory Cells and Sense Amplifiers",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-23781-3_7",
            "Abstract": "Static random access memories (SRAMs) in nanometre technologies undergo reliability degradation due to the increased process variations but also due to various aging mechanisms. Bias temperature instability (BTI) and hot carrier injection (HCI) phenomena are highly accused of the aging-related reliability reduction. This degradation is getting worse under excess stress conditions (high operating temperature and voltage levels). Aging phenomena significantly affect the performance characteristics of SRAMs since they affect among others speed, operating voltages, memory cells’ noise margins and sense amplifiers’ input offset voltage. Excessive performance degradation due to aging in an SRAM will lead to failures generation. Traditionally, designers use guard bands; extra margins are considered to guarantee that the memory will operate correctly during its lifetime. However, this approach negatively …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A low power NORA circuit design technique based on charge recycling",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1302017/",
            "Abstract": "In this paper we present a low power oriented design technique for NORA clocked circuits. This technique is based on a new switching scheme for charge recycling among circuit nodes. According to our approach and the corresponding simulations in a 0.18/spl mu/m CMOS technology, a maximum energy dissipation reduction of 19 % is reported while energy*delay product savings up to 14 % can be achieved.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new dynamic circuit design technique for high performance TSC checker implementations [totally self checking circuits]",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1319659/",
            "Abstract": "The use of a fault model that handles transistor level faults like transistor stuck-open and transistor stuck-on is highly desirable in modern designs. Unfortunately, in the case of self-checking checkers, exploited for on-line testing, the requirements of using pairs of test vectors or special circuits for I/sub DDQ/ monitoring may not be applicable. A variation of the dynamic circuit design technique, which uses multiple clocks to construct three phase logic structures, is presented which is capable of covering the above fault models. The proposed technique results in checker designs that combine high operating frequency and reduced area requirements while are capable of satisfying the required self-checking and fault-secure properties. Two-rail code checker designs are presented to demonstrate the proposed technique.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A build-in self-test technique for rf mixers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5491810/",
            "Abstract": "A Build-In Self-Test (BiST) circuit suitable for embedded RF Mixers in System-on-Chip applications is presented in this paper. This is a defect-oriented test scheme that dynamically sets the Mixer to operate in homodyne mode. The DC level generated at its output is used to control the oscillation frequency of a simple voltage controlled oscillator. Deviations of the oscillation frequency from the expected range of values indicate a defective Mixer. The proposed BiST technique has been applied to a typical receiver's differential RF Mixer using a 0.35μm CMOS technology. Simulation results validated the efficiency of the BiST circuit which was capable to provide a high fault coverage of catastrophic faults (which exceeds 91%) and a small test application time (1μs), at a silicon area cost approximately 16% of the Mixer area.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The Time Dilation Technique for Timing Error Tolerance",
            "Publication year": 2012,
            "Publication url": "http://olympias.lib.uoi.gr/jspui/handle/123456789/11091",
            "Abstract": "Repository of UOI \"Olympias\": The Time Dilation Technique for Timing Error Tolerance Skip \nnavigation Home Browse Communities & Collections Browse Items by: Issue Date Author Title \nSubject Item Type Advanced Search Help About DSpace Sign on to: My DSpace Receive email \nupdates Edit Profile Saved Searches Favorites Repository of UOI \"Olympias\" 1.Repository of OAI \n2.ΑΠΟΘΕΤΗΡΙΟ \"ΟΛΥΜΠΙΑΣ\" 3.Σχολή Θετικών Επιστημών 4.Τμήμα Μηχανικών Ηλεκτρονικών \nΥπολογιστών και Πληροφορικής 5.Άρθρα σε επιστημονικά περιοδικά ( Ανοικτά) Ελληνικά English \nPlease use this identifier to cite or link to this item: \nhttps://olympias.lib.uoi.gr/jspui/handle/123456789/11091 Institution and School/Department of \nsubmitter: Πανεπιστήμιο Ιωαννίνων. Σχολή Θετικών Επιστημών. Τμήμα Μηχανικών Ηλεκτρονικών \nΥπολογιστών και Πληροφορικής Keywords: Error Detection and Correction,B Hardware,B.6 Logic …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:UxriW0iASnsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On resistive open defect detection in DRAMs: The charge accumulation effect",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7138747/",
            "Abstract": "The test complexity of high density DRAMs increases with technology evolution, due to a larger impact of process variation and weak defects. In particular, resistive open defects turn to be a major concern in DRAMs. Our analysis and simulation results show that an important phenomenon exists, charge accumulation, which is currently not considered in DRAM testing. Charge accumulation occurs in DRAM cells that suffer from internal resistive opens; a weak value stored at a cell is strengthened when a sequence of read operations is applied to it. Typical DRAM testing procedures (like March tests) fail to provide enhanced coverage of resistive open defects, since they do not consider charge accumulation. This paper provides an effective test algorithm that targets resistive open defects, while considering the bit-line imbalance and the charge accumulation mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On testability of multiple precharged domino logic",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/838886/",
            "Abstract": "Domino circuits are increasingly popular because they offer a significant performance boost over static ones. An inherent problem with domino CMOS gates is that under specific input conditions the charge redistribution between parasitic capacitances at internal nodes of the circuit can destroy the noise margin and cause glitches at the output of a domino gate. Among the dominant solutions proposed, in the open literature, to overcome this problem is the technique of internal nodes multiple precharging. However the added precharge transistors are not testable for stuck-open and stuck-on faults. Undetectable stuck-open faults on these transistors cause reduction of the noise margins of the gate. Then the operation of the circuit in the field is sensitive to environmental factors, such as noise. In this paper we propose a new internal nodes multiple precharging scheme that leads to testable designs for stuck-open and …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimized built-in self-calibration of RF SoCs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495112/",
            "Abstract": "Built-in self-calibration (BiSC) of RF SoCs allows the restoration of a circuit's conformance to its specifications in case of violations due to process variations and device mismatches that are common in nanoscale technologies. A method to optimize BiSC is presented in this paper, by which the number of successfully restored circuits is maximized using the minimum possible number of calibration states. The method is assessed through a case study conducted on a typical RF mixer designed in a 180 nm CMOS technology, and it is shown that yield is doubled by using only five calibration states.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:uWQEDVKXjbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Soft error immune latch under SEU related double-node charge collection",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7229830/",
            "Abstract": "The susceptibility of memory elements (latches, flip-flops) to soft errors is increased as CMOS technology scales down, due to multi-node charge collection by the impact of energetic particles on silicon. Existing design solutions provide partial or no immunity to SEUs that affect a pair of nodes. In this work, we propose a new latch topology, which provides complete protection from SEU related double node charge sharing. Simulations results and comparisons on a variety of SEU tolerant techniques are presented to evaluate the efficiency of the proposed latch.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hierarchical architecture for concurrent soft error detection based on current sensing",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1030184/",
            "Abstract": "Robust circuit design techniques with respect to soft errors gain importance in the era of very deep submicron technologies. On-line testing will play an important role towards this direction. In this paper we propose a hierarchical architecture for concurrent soft error detection. This architecture is based on current sensing techniques and provides very low area overhead, small detection times and negligible performance penalty on the functional circuit under check.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High fan-in differential current mirror logic",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1693479/",
            "Abstract": "A new differential current mirror logic (DCML) family is presented. It is based on a dynamic differential topology and uses current mirrors to enhance current sensing and a sense amplifier to speed up output evaluation. Its performance in terms of delay, power and area is compared to that of cross coupled differential domino (CCDD) logic. Simulations, using a 0.18mum technology to implement high fan-in XOR/XNOR gates, were utilized to evaluate the performance of the two topologies. It is shown that for fan-ins higher than 4 the proposed logic family presents increasing reduction in delay and energy against single and multi-stage CCDD implementations, with the single-stage CCDD circuits degrading fast and being inefficient for fan-ins higher than 10. In parallel, the silicon area penalty of the DCML towards single-stage CCDD is very small and constant regardless of the gate fan-in, while multi-stage CCDDs take …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:3s1wT3WcHBgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Signature analysis for testing, diagnosis, and repair of multi-mode power switches",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5957916/",
            "Abstract": "Power-gating structures for intermediate power-off modes offer significant power saving benefits as they reduce the leakage power during short periods of inactivity. However, reliable operation of such devices must be ensured by using adequate test methods. We propose a signature analysis technique to efficiently test power-gating structures that provide intermediate power-off modes. In particular, the proposed technique can be used to test and diagnose an efficient multi-mode power-gating architecture that was proposed recently. In addition, we propose a methodology to repair catastrophic and parametric faults, and to tolerate process variations. Analysis and extensive simulations demonstrate the effectiveness of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Static power reduction using variation-tolerant and reconfigurable multi-mode power switches",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6484194/",
            "Abstract": "Multithreshold CMOS is very effective for reducing standby leakage power during long periods of inactivity. Recently, a power-gating scheme was presented to support multiple power-off modes and reduce the leakage power during short periods of inactivity. However, this scheme can suffer from high sensitivity to process variations, which impedes manufacturability. We propose a new power-gating technique that is tolerant to process variations and scalable to more than two intermediate power-off modes. The proposed design requires less design effort and offers greater power reduction and smaller area cost than the previous method. In addition, it can be combined with existing techniques to offer further static power reduction benefits. Analysis and extensive simulation results demonstrate the effectiveness of the proposed design.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Layout-based refined NPSF model for DRAM characterization and testing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6547154/",
            "Abstract": "As dynamic random access memories (DRAMs) are becoming denser with technology scaling, more complex fault behaviors emerge; examples are leakage, coupling effects, and cell neighborhoods interaction. The neighborhood pattern sensitive fault (NPSF) model is suitable to address such faulty behaviors and identify them during the characterization and/or test of new DRAM chips. However, NPSF test algorithms are extremely time-consuming and therefore not economically affordable. In this brief, we show how layout information can be used to refine and significantly simplify the NPSF model and reduce the test time complexity. As a case study, the folded DRAM array is considered. A realistic NPSF model, the Δ-type neighborhood, is introduced together with a time efficient test algorithm which is more than two-times cheaper than traditional ones. Even when incorporating bit-line influence and word-line …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An embedded test circuit for rf single ended low noise amplifiers",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4511191/",
            "Abstract": "This paper presents a cost effective Embedded Test Circuit (ETC) for single ended Low Noise Amplifiers (LNAs). The ETC operation is based on the observation that the presence of catastrophic faults, like resistive bridgings, shorts and opens, or parametric faults, result in the attenuation of the output voltage amplitude (gain reduction). The ETC along with a single ended LNA have been designed in a 0.35 μm CMOS technology to evaluate the efficiency of the proposed approach and experimental results are presented.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A high-density DRAM cell with built-in gain stage",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/925247/",
            "Abstract": "A high-density DRAM cell is proposed with a built-in vertical gain device topology. Due to the vertical built-in gain device, this cell exhibits increased reading speed, elongated refresh period, low-power oriented operation, and minor layout area penalty.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New test pattern generation units for NPSF oriented memory built-in self test",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957583/",
            "Abstract": "In this paper we present the design of deterministic test pattern generation (TPG) units which can be exploited in a built-in self-test (BIST) scheme for memory neighborhood pattern sensitive fault (NPSF) testing. The proposed TPG units generate the required Eulerian sequence of test patterns for memory type-1 NPSF testing.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An embedded IDDQ testing circuit and technique",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4633505/",
            "Abstract": "Quiescent current (I DDQ ) testing is a valuable defect detection technique in CMOS ICs. However, its application in very deep submicron technologies is susceptible to the increased transistor leakage current. In this paper, an I DDQ  testing technique and circuit are presented based on the background current compensation concept. This technique is independent from process and temperature variations and first experimental results from a fabricated circuit show that it is able to extend the viability of I DDQ  testing in future nanometer technologies.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An Alternative Post-bond Testing Method for TSVs",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9200295/",
            "Abstract": "Through Silicon Vias (TSVs) are crucial elements for the reliable operation and the yield of three-dimensional integrated circuits (3D ICs). Defects are a serious concern in TSV structures. An improvement of a post bond testing method for TSVs that is based on half Schmitt trigger structures instead of unbalanced inverters is proposed in this work. This method is also used for the detection of short defects, in addition to resistive open ones. Extensive typical model simulations and Monte-Carlo analysis results, using the 65nm technology of TSMC, prove the effectiveness of the proposed improved scheme, which is performing better in terms of robustness and tolerance.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Management of charge pump circuits",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926000000122",
            "Abstract": "In this paper, a controlling circuit is proposed for the management of charge pump circuits. This is achieved with the use of a pattern generator and a feedback circuit so that the produced high voltage of any given charge pump to be tuned to the desired specifications. The output of the pump generates the required high-voltage pattern independently of its load, the temperature variations and the frequency of the clock, while it is operating towards the minimum required power level.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:k_IJM867U9cC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Low power and high speed static CMOS digital magnitude comparators",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8617949/",
            "Abstract": "Digital magnitude comparators are of special interest in digital systems as they are used to compare the magnitude (equality, greater than or less than) of two binary numbers. In this work, a new architecture for magnitude comparators in static logic is presented. The proposed topology presents superior speed performance and reduced power consumption (that improve as the size of the comparator increases for comparators greater than 8bit) with respect to a state of the art magnitude comparator in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:B3FOqHPlNUQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "State reduction for efficient digital calibration of analog/RF integrated circuits",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10470-016-0880-4.pdf",
            "Abstract": "Calibration of analog/radio-frequency (RF) integrated circuits addresses the problem of yield loss that is a result of the increased variability commonly observed in nanoscale processes. In order to compensate for increased yield loss, calibration techniques have been developed that are applied to fabricated chips, aiming at the restoration of a circuit’s performance to its acceptable range of values that are defined by the specifications. To allow calibration, adjustable elements are introduced that provide multiple states of a circuit’s operation through built-in tuning knobs. Digital calibration—that refers to the case of discrete tuning knob settings—is performed by switching to a circuit’s state at which all performance characteristics are restored to their specified ranges. Due to the large number of performance characteristics of interest a large space of tuning knob settings should be explored, that leads to a series …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:p2g8aNsByqUC",
            "Publisher": "Springer US"
        },
        {
            "Title": "A current mode, parallel, two-rail code checker",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4483508/",
            "Abstract": "A current mode, periodic outputs, parallel two-rail code (TRC) checker, suitable for the implementation of high fan-in embedded checkers, is presented. The new checker is characterised by high testability, high speed operation and low silicon area requirements. The circuit has been designed, for various fan-in values, in a 0.18 mum technology and electrical simulations have been carried out to validate its operation, considering process, power supply and temperature variations as well as variations of the electrical parameters.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A class of easily path delay fault testable circuits",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/836466/",
            "Abstract": "The number of physical paths in a carry save or modified Booth multiplier, as well as in a non-restoring cellular array divider is prohibitively large for testing all paths for delay faults. Besides, neither all paths are robustly testable nor a basis consisting of SPP-HFRT paths exists. In this paper we present sufficient modifications of the above mentioned circuits so that a basis consisting of SPP-HFRT paths exists. The cardinality of the derived basis is very small. Also, hardware and delay overheads due to the modifications are respectively small and negligible.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-power scan testing: a scan chain partitioning and scan hold based technique",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-014-5453-9",
            "Abstract": "Power consumption during scan testing operations can be significantly higher than that expected in the normal functional mode of operation in the field. This may affect the reliability of the circuit under test (CUT) and/or invalidate the testing process increasing yield loss. In this paper, a scan chain partitioning technique and a scan hold mechanism are combined for low power scan operation. Substantial power reductions can be achieved, without any impact on the test application time or the fault coverage and without the need to use scan cell reordering or clock and data gating techniques. Furthermore, the proposed design solution for scan power alleviation, permits the efficient exploitation of X-filling techniques for capture power reduction or the use of extreme (power independent) compression techniques for test data volume reduction.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Domino CMOS SCD/SFS 2-out-of-3 and 1-out-of-3 code checkers",
            "Publication year": 2003,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/00207210310001595383",
            "Abstract": "In this paper we present new strongly code-disjoint (SCD) and strongly fault-secure (SFS) checkers for the 2-out-of-3 and1-out-of-3 codes. They are implementedin Domino CMOS logic andtake into account a comprehensive fault model consisting of stuck-at, transistor stuck-open andtransistor stuck-on faults. The proposedcheckers are the first known SCD/SFS 2-out-of-3 and 1-out-of-3 code checkers in the open literature that consider the above fault model without suffering from static power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:ldfaerwXgEUC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Ultra fast and low cost parallel two-rail code checker targeting high fan-in applications",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1339562/",
            "Abstract": "A novel current mode, periodic outputs, parallel two-rail code (TRC) checker is presented. The proposed topology is suitable for the implementation of high n-variable (high fan-in) two-rail code checkers targeting applications with a high count of monitoring lines. Compared to previous solutions, the new checker is characterised by high operating frequencies and low silicon area requirements while maintaining lower power operation at higher n-variable values.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Receiver Circuit for Low-Swing Interconnect Schemes",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5572778/",
            "Abstract": "This paper presents a new receiver circuit that is suitable for low-swing interconnect schemes in CMOS nanometer technologies. Compared to the conventional receiver, which utilizes a PMOS feedback transistor, the proposed configuration is based on an auxiliary cross-coupled structure, which provides significant reduction of the delay time and eliminates the short circuit current, during transitions. The new receiver outperforms the conventional one, especially when very low power supply voltages are used and large capacitive loads are driven. The proposed topology has been designed in a 90nm CMOS technology and the simulation results confirm that, with respect to the conventional receiver, the delay and energy savings may approach 87% and 60% respectively.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:fPk4N6BV_jEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Periodic monitoring of BTI induced aging in SRAM sense amplifiers",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8640112/",
            "Abstract": "Transistor bias-temperature instability (BTI) effects are a serious reliability concern in nanometer technology static random access memories (SRAMs). In this paper, a methodology and a circuit for the periodic monitoring of BTI induced aging in SRAM sense amplifiers is presented. It is reported in the literature that under realistic memory workloads the input offset voltage of a sense amplifier is increased due to asymmetric BTI-related transistor degradation. Increased sense amplifier input offset voltage may lead to failures generation in the field of operation. According to the proposed technique, periodic monitoring provides the ability to avoid SRAM failures by early detecting over-aged sense amplifiers (near failure) and then properly react in order to maintain the memory reliable operation. The aging monitoring scheme is based on a differential ring oscillator, which can be easily embedded in an SRAM array …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The leafs scan-chain for test application time and scan power reduction",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6463646/",
            "Abstract": "A scan-chain architecture that utilizes the existence of don't care bits (X-bits) in test cubes to provide test application time reduction at reduced power consumption is proposed. According to this scheme the scan-chain is divided into two segments, a first one that retains the shift capability and a second consisting of leaf cells. New test data are shifted in the first segment while only a single clock cycle is used to feed the second segment. In case of X-bits at the test data of the leaf cells the number of shift operations is drastically reduced. Experimental results validate the efficiency of the proposed architecture, which provides test time reductions up to 48%.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "INTEGRATION, the VLSI journal 30 (2001) 179",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=18289368155587014986&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A test technique and a BIST circuit to detect catastrophic faults in RF mixers",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5941433/",
            "Abstract": "A test technique and a Built-In Self-Test (BIST) circuit to detect catastrophic faults in RF Mixers is presented in this paper. During test application the Mixer is set to operate in homodyne mode and the DC levels generated at its outputs are used as test observables. These test observables are converted to digital signatures, by a simple embedded circuit, and are used to discriminate fault free from faulty Mixers. The proposed technique has been applied to a typical differential RF Mixer designed in a 0.18μm CMOS technology. Simulation results validated its efficiency to provide a high coverage of catastrophic faults which exceeds 90%.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the reuse of existing error tolerance circuitry for low power scan testing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7168949/",
            "Abstract": "Timing errors are a major threat in nanometer technology integrated circuits. Razor is a well known timing error tolerance design technique. However, its silicon area cost makes it unattractive for widespread use. In this work, we reuse the Razor topology in order to achieve low power scan testing operations and make this technique a viable solution which will serve both on-line and off-line testing requirements. In addition, the ability to apply this technique for at-speed scan testing is also explored in this work. According to the experimental results, the scan power consumption is drastically reduced since the signal transitions at the inputs of the combinational logic are eliminated during the scan testing operations.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Testable designs of multiple precharged domino circuits",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4162507/",
            "Abstract": "Domino CMOS circuits are an option for speeding up critical units. An inherent problem of Domino logic is that under specific input conditions the charge redistribution between parasitic capacitances at internal nodes of a circuit can violate the noise margins and cause erroneous responses at the output. The dominant solution to this problem is the multiple precharging of the gate's internal nodes. However, the added precharge transistors are not testable for stuck-open faults. Undetectable stuck-open faults at these transistors may cause noise margins reduction and consequently may affect the reliability of the circuit since its operation in the field will be sensitive to environmental factors such as noise. In this paper, we propose new multiple precharging design schemes that enhance Domino circuits' testability with respect to transistor stuck-open and stuck-on faults",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A robust and reconfigurable multi-mode power gating architecture",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5718815/",
            "Abstract": "Multi-threshold CMOS is a very effective technique for reducing standby leakage power during long periods of inactivity. Recently, a power-gating scheme was presented to support multiple power-off modes and reduce the leakage power during short periods of inactivity. However, this scheme suffers from high sensitivity to process variations, which impedes manufacturability and also limits its applicability to at most two intermediate power-off modes. We propose a new power-gating technique that is tolerant to process variations and scalable to more than two intermediate power-off modes. In addition, the proposed design requires minimum design effort and offers greater power reduction and smaller area cost than the previous method. Analysis and extensive simulation results demonstrate the effectiveness of the proposed design.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "NLTF based BIST circuit for DRAM testing",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495144/",
            "Abstract": "DRAM testing is of major importance in systems reliability. Effective fault models, like the Neighborhood Leakage and Transition Fault (NLTF) model, can be exploited for DRAM testing. An efficient NLTF-based Built-In Self Test (BIST) circuit, for the acceleration and simplification of DRAM testing procedures, is presented in this work.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timing Error Tolerance in Pulsed Latch Based Pipelines",
            "Publication year": 2015,
            "Publication url": "http://mocast.physics.auth.gr/images/Papers/PAPER_07F.pdf",
            "Abstract": "Timing error tolerance turns to be a major design concern in modern nanometer technology integrated circuits. In this work, we present a technique for multiple timing errors detection and correction, which is suitable for pulsed latch based pipelines. The proposed design provides timing error tolerance at a small penalty of extra time for each error correction. Besides that, it is characterized by low silicon area overhead and reduced power consumption, with respect to previous design schemes in the open literature. The proposed technique was applied in six designs that are combinations of benchmark circuits from the ISCAS’85 family, and the simulation results verified its efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Concurrent detection of soft errors based on current monitoring",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/937828/",
            "Abstract": "Transient faults in future ICs turns to be a major consideration as the silicon process scales down. In this paper we propose a new soft error detecting technique with low area overhead, high detection speed and negligible performance penalty on the functional circuit under check. Among the already known techniques for soft error detection in logic circuits the proposed technique is the only one that is based on current monitoring.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The use of pre-evaluation phase in dynamic CMOS logic",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1430150/",
            "Abstract": "Dynamic logic families have been shown to offer performance advantages over traditional CMOS logic. Their operation is based on the use of a clock signal that provides two operation phases: the precharge phase and evaluation phase. The precharge phase is setting the circuit at a predefined initial state while the actual logic response is determined during the evaluation phase. In this paper we examine potential advantages when an additional phase, called pre-evaluation, is introduced. During this phase a restricted voltage swing occurs depending on the desired outcome. This voltage swing is amplified during the final evaluation in order to produce the final logic response. By restricting the required voltage swing at internal logic nodes (especially in case of those presenting high capacitance) we are able to achieve higher performance coupled with reduced power consumption.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extending the viability of I/sub DDQ/testing in the deep submicron era",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/996706/",
            "Abstract": "I/sub DDQ/ testing has become a widely accepted defect detection technique in CMOS ICs. However, its effectiveness in deep submicron is threatened by the increased transistor sub-threshold leakage current. In this paper, a new I/sub DDQ/ testing scheme is proposed. This scheme is based on the elimination, during I/sub DDQ/ testing, of the normal leakage current from the sensing node of the circuit under test so that already known in the open literature I/sub DDQ/ sensing techniques can be applied in deep submicron.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Adjustable RF mixers' alternate test efficiency optimization by the reduction of test observables",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6582596/",
            "Abstract": "A method for the optimization of the efficiency of alternate tests for adjustable RF mixers is presented in this paper. Alternate tests provide a cost- and time-effective substitute for their conventional specification-based counterparts by attempting to predict rather than directly measuring a circuit's performance from its response to suitable test stimuli. In order to provide post-manufacture yield recovery through calibration, integrated RF circuits-especially nanometric circuits-are often designed to present some form of adjustability. Such a property offers a set of discrete states of operation, from which a performance-compliant state is selected by calibration. In general, an alternate test can be conducted for each discrete state of operation, thus providing a large set of test observables from which regression models can be constructed to predict performance in all available states. However, test time and cost concerns impose …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A versatile built-in self-test scheme for delay fault testing",
            "Publication year": 2000,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/date/2000/05370756/12OmNzC5SGO",
            "Abstract": "A new Built-In Self Test (BIST) scheme that can be used for both off-line production and periodic testing of delay faults as well as for concurrent detection of faults causing signal delays in the field is presented. The scheme is based on the IDDT monitoring of the outputs of the circuit under test (CUT) or functional circuit. The proposed scheme has minimal impact on the performance and silicon area of the design since the same response verifier circuit is used for both off-line and concurrent detection of errors in the field.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:GnPB-g6toBAC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "NBTI aging tolerance in pipeline based designs NBTI",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6604047/",
            "Abstract": "Aging mechanisms, like Negative Bias Temperature Instability (NBTI), are a great concern in CMOS nanometer technologies. In this work, we present pipeline oriented timing error tolerance techniques with a special interest in NBTI related performance degradation. Three scenarios are discussed that provide the required error tolerance in pipeline based designs. Moreover, a new flip-flop is presented, to support two of the above scenarios, which is capable to detect and locally correct timing errors. A main characteristic of the proposed flip-flop is the NBTI resistant error handling operation. Simulation results validate the efficiency of the new design.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A built-in self-test scheme for differential ring oscillators",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1410623/",
            "Abstract": "In this paper a new built-in self-test (BIST) scheme is proposed suitable for testing differential voltage controlled ring oscillators. The proposed testing-scheme is capable of detecting single realistic faults of the circuit under test. These faults can be either short or bridging faults between circuit nodes or open faults at the circuit branches. The test result is provided by a digital fail/pass indication signal. Exhaustive simulations have revealed the effectiveness of the proposed technique regarding its fault coverage.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Monitoring of BTI and HCI Aging in SRAM Decoders",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9131565/",
            "Abstract": "Bias Temperature Instability (BTI) and Hot Carrier Injection (HCI) phenomena degrade seriously the reliability of an SRAM. Such phenomena affect all SRAM blocks; among them the Address Decoders. Over-aged Decoders lead to potential read and/or write failures. It is imperative to develop design techniques that provide aging-tolerance in order to retain the SRAM reliable operation. An embedded circuit for the BTI and HCI aging monitoring in SRAM Decoders is presented along with an approach to react for memory repair after aging detection.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stuck-at fault diagnosis in scan chains",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6850663/",
            "Abstract": "Scan chain diagnosis turns out to be an important yield enhancement factor in modern nanometer technologies. An easy to implement and cost effective design-for-diagnosis technique is presented. The proposed technique is compatible with the standard scan chain architecture and provides fast stuck-at fault diagnosis capabilities, at the maximum resolution, through simple operations, using only four predefined diagnosis vectors and independently of any test response compaction circuitry at the outputs of the scan chains.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Variation tolerant BTI monitoring in SRAM cells",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8046203/",
            "Abstract": "Transistor aging, due to Bias-Temperature Instability (BTI) is a serious concern in Static Random Access Memories (SRAMs). Under BTI stress an SRAM cell becomes increasingly skewed, which in turn affects its performance characteristics and consequently the memory reliability. In this paper, a variation tolerant technique for the periodic monitoring of the BTI influence on SRAM cells is presented. Periodic aging monitoring provides the ability to predict oncoming failures in the memory operation and react early to avoid them. The proposed scheme is based on the duty cycle monitoring of a low cost differential ring oscillator that can be easily embedded in a typical SRAM without affecting the normal mode of operation.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Compact Built-In Current Sensor for Ippo Testing",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=12886422193726760793&hl=en&oi=scholarr",
            "Abstract": "In this paper a simple to implement, compact, build-in current sensor for Ippo testing of CMOS VLSI circuits based on current mirroring techniques is proposed. This sensor can attain small detection times and can be used for both on-line and off-line Ippo testing.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Single event upset tolerance in flip-flop based microprocessor cores",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6378204/",
            "Abstract": "Soft errors due to single event upsets (SEUs) in the flip-flops of a design are of increasing importance in nanometer technology microprocessor cores. In this work, we present a flip-flop oriented soft error detection and correction technique. It exploits a transition detector at the output of the flip-flop for error detection along with an asynchronous local error correction scheme to provide soft error tolerance. Alternatively, a low cost soft error detection scheme is introduced, which shares a transition detector among multiple flip-flops, while error recovery relies on architectural replay. To validate the proposed approach, it has been applied in the design of a 32-bit MIPS microprocessor core using a 90nm CMOS technology.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Octupole Vibration in Superdeformed ",
            "Publication year": 2002,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.89.282501",
            "Abstract": "Nine transitions of dipole character have been identified linking an excited superdeformed (SD) band in D 152 y to the yrast SD band. As a result, the excitation energy of the lowest level in the excited SD band has been measured to be 14 238 keV. This corresponds to a 1.3 MeV excitation above the SD ground state. The levels in this band have tentatively been determined to be of negative parity and odd spin. The measured properties are consistent with an interpretation in terms of a rotational band built on a collective octupole vibration.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:maZDTaKrznsC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Low-Power and High Performance Sinusoidal Clocked Dynamic Circuit Design",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7560225/",
            "Abstract": "Important characteristic of any VLSI circuit is its power consumption, reliability, operating speed and silicon area. Dynamic CMOS designs provide high operating speeds compared to static CMOS designs combined with low silicon area requirements. Pipelines can be used for achieving high circuit operating speeds. However, as the operating frequency increases, the number of pipeline stages should also increase and so the memory elements. These memory elements increase the area overhead and restrict the maximum achievable frequency due to their delays. Memory-less pipelines based on dynamic design address these issues but, still require high power consumption for the clock signal. In this paper we propose a sinusoidal three-phase clocking scheme that reduces the power required by the clock and offers high circuit operating frequencies. Thus the proposed technique provides advantages over …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Testing neighbouring cell leakage and transition induced faults in DRAMs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7271071/",
            "Abstract": "Due to their high density, modern DRAMs are very susceptible to the interactions between adjacent cells, which in turn increases the difficulty and complexity of memory testing. In this work, we studied the interaction mechanisms among neighbouring DRAM cells in order to provide an efficient testing solution. According to the open literature, there are two mechanisms responsible for this interaction: leakage currents and cell state transitions. The frequently used Coupling Fault (CF) model is inadequate to model the combined effect of these mechanisms, while testing procedures using the Neighborhood Pattern Sensitive Fault (NPSF) model are not time efficient solutions. Towards this direction, we propose a new fault model, the Neighborhood Leakage and Transition Fault (NLTF) model for DRAMs, which effectively models the faulty behavior related to neighbouring cell interference. In addition, we developed a …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scan chain based at-speed diagnosis in the presence of scan output compaction schemes",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801956",
            "Abstract": "The use of scan chains in diagnosis operations turns to be an important yield enhancement factor in nanotechnologies. However, scan chain output compaction schemes drastically reduce the ability to effectively diagnose (locate) faults in a defective circuit. In addition, scan chains are not friendly to at-speed diagnosis, where timing faults must be located. A new at-speed scan chain diagnosis technique is presented, which guarantees the maximum diagnostic resolution independently of the presence of any scan chain output compaction schemes.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Placement and Routing in Computer Aided Design of Standard Cell Arrays by Exploiting the Structure of the Interconnection Graph",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.3722/cadaps.2008.325-337",
            "Abstract": "Standard cell placement and routing is an important open problem in current CAD VLSI research. We present a novel approach to placement and routing in standard cell arrays inspired by geometric constraint usage in traditional CAD systems. Placement is performed by an algorithm that places the standard cells in a spiral topology around the center of the cell array driven by a DFS on the interconnection graph. We provide an improvement of this technique by first detecting dense graphs in the interconnection graph and then placing cells that belong to denser graphs closer to the center of the spiral. By doing so we reduce the wirelength required for routing. Routing is performed by a variation of the maze algorithm enhanced by a set of heuristics that have been tuned to maximize performance. Finally we present a visualization tool and an experimental performance evaluation of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Physical design oriented DRAM neighborhood pattern sensitive fault testing",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5012108/",
            "Abstract": "Although the Neighborhood Pattern Sensitive Fault (NPSF) model is recognized as a high quality fault model for memory arrays, the excessive test application time cost associated with it, compared to other fault models, restricts its wide adoption for memory testing. In this work we exploit the physical design (layout) of folded DRAM memory arrays to introduce a new neighborhood type for NPSF testing and a pertinent test and locate algorithm. This algorithm reduces drastically the test application time (about 58% with respect to the well known Type-1 neighborhood) aiming to make the NPSF model also a cost attractive choice. In addition, we introduce the Neighborhood Word-Line Sensitive Fault model and the corresponding test algorithm to cover those faults along with NPSFs, achieving test application time cost reduction from 33% to 41%, depending on various assumptions, with respect to the Type-1 neighborhood.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A sense amplifier based circuit for concurrent detection of soft and timing errors in CMOS ICs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214360/",
            "Abstract": "We propose a new concurrent soft and timing error detection circuit that exploits the time redundancy approach to achieve tolerance with respect to transient and delay faults. The idea is based on current mode sense amplifier topologies to provide fast error detection times.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timing error tolerance in nanometer ICs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560189/",
            "Abstract": "Timing error tolerance turns to be an important design parameter in nanometer technology, high speed and high complexity integrated circuits. In this work, we present a low cost, multiple timing error detection and correction technique, which is based on a new Flip-Flop design. The proposed design approach provides timing error tolerance at the small penalty of one clock cycle delay in the circuit operation for each error correction. In addition, it is characterized by very low silicon area requirements compared to previous design schemes in the open literature. The proposed technique has been applied in a 90nm pipeline design of a digital FIR filter and the simulation results validated its efficiency.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new flash memory sense amplifier in 0.18/spl mu/m CMOS technology",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/957628/",
            "Abstract": "In this paper a new sense amplifier suitable for current sensing in EPROM, E/sup 2/PROM and flash memories read operation is presented. The proposed sense amplifier provides fast response with low silicon area requirements that make it easily adaptable to the bit-line pitch. In this work simulation results are presented, in 0.18 /spl mu/m CMOS technology, regarding the delay time versus different precharge voltages and bitline capacitance values, while worst case and high temperature simulations are included in order to expose limitations of the sensors in various operating conditions. Moreover, comparisons are given according to a conventional sensing scheme. Finally, a compact layout design is presented to illustrate the area efficiency of the proposed sense amplifier.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "High performance and low power dynamic circuit design",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5981329/",
            "Abstract": "Dynamic circuit design techniques can provide high speed operation at lower silicon area requirements, compared to full static CMOS designs. In this paper, we present a memoryless pipeline dynamic design technique with a pre-evaluation phase hidden inside the precharge phase. The combinational logic is implemented with dynamic circuits that offer the desirable high speed operation while the memory elements are eliminated due to an intelligent three phase clocking scheme. According to simulation results high quality designs can be achieved, in terms of performance, energy consumption and area, with respect to alternative dynamic design styles.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Static CMOS Implementation of Magnitude Comparators",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8862135/",
            "Abstract": "Digital magnitude comparators are used in computer systems to compare two binary numbers and determine if these are equal, or if one number is greater or less than the other. In this work, a new magnitude comparator's architecture is presented. The proposed comparator architecture is designed in static CMOS logic and compared against the state of the art magnitude comparators in the literature, shows less area overhead, and for small input operands (which are commonly used in practice) presents lower delay and power-delay product.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:LPZeul_q3PIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A design technique for energy reduction in NORA CMOS logic",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4026686/",
            "Abstract": "In this work, a design technique to reduce the energy consumption in NO RAce (NORA) circuits is presented. The technique is based on a unidirectional switch topology combined with a new clocking scheme permitting both charge recycling between circuit nodes and elimination of the short circuit current. Calculations proved that energy savings higher than 20% can be achieved. Simulation results from NORA designs in a 0.18-mum CMOS technology are presented to demonstrate the effectiveness of the proposed technique to achieve both energy and energy-delay product reduction",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast, Parallel two-rail code checker with enhanced testability",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1498149/",
            "Abstract": "A current mode, periodic outputs, parallel two-rail code (TRC) checker, suitable for high n-variable (high fan-in) implementations, is presented. The checker is characterized by high testability, high operating frequencies and low silicon area requirements. The circuit has been designed, for various n-variable values, in a 0.18/spl mu/m technology and SPICE simulations have been carried out to validate its operation.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New memory sense amplifier designs in CMOS technology",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/911469/",
            "Abstract": "In this paper two-stage sense amplifier designs are proposed which are suitable for current sensing in SRAM and flash memories read operations. The first-stage of these sense amplifiers is characterized by its low power operation and its small area overhead which requires only three transistors in the pitch of a bit line pair for the sensing of the stored data in the selected memory cell. Compact layout designs and simulations in 0.25 /spl mu/m CMOS technology have been carried out to evaluate the efficiency of the proposed schemes.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A built-in I/sub DDQ/testing circuit",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541662/",
            "Abstract": "Although I/sub DDQ/ testing has become a widely accepted defect detection technique for CMOS ICs, its effectiveness in very deep submicron technologies is threatened by the increased transistor leakage current. In this paper, a built-in I/sub DDQ/ testing circuit is presented, that aims to extend the viability of I/sub DDQ/ testing in future technologies and first experimental results are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A built-in voltage measurement technique for the calibration of RF mixers",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6472072/",
            "Abstract": "A built-in technique to measure internal DC voltage levels used for the calibration of radio frequency (RF) mixers is presented in this paper. According to a common alternate test approach, RF mixer calibration is based on the prediction of the circuit's performance characteristics that requires the acquisition of a set of DC voltage observables obtained from specific nodes of the mixer operating in homodyne mode. These observables, however, often correspond to internal nodes where direct access is not always possible. Furthermore, accurate calibration might require a relatively large set of voltage observables whose direct access would lead to a waste of resources and to increased cost. The proposed built-in technique provides digital readings for the DC levels at all nodes of interest through a single interface by exploiting the use of a voltage acquisition circuit implemented by a simple analog to digital converter …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new technique for IDDQ testing in nanometer technologies",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926002000238",
            "Abstract": "IDDQ testing has become a widely accepted defect detection technique in CMOS ICs. However, its effectiveness in very deep submicron technologies is threatened by the increased transistor leakage current. In this paper, we propose a technique for the elimination, during testing, of the normal leakage current from the sensing node of a circuit under test. In this way the already known in the open literature IDDQ sensing techniques can be applied in the nanometer technologies.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:dhFuZR0502QC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Soft error interception latch: double node charge sharing SEU tolerant design",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/pdf/10.1049/el.2014.4374",
            "Abstract": "As technology scales down, soft errors, because of single event upsets (SEUs) that affect multiple nodes (through multiple node charge sharing), become a serious concern in nanometre technology integrated circuits. Existing radiation hardening techniques provide partial or no immunity when more than one node are affected. A new latch topology is presented that guarantees soft error tolerance when a single node or any arbitrary combination of node pairs is affected by an SEU. The proposed scheme exploits a positive feedback loop which consists of C‐elements. Simulation results validate the efficiency of the new design over existing soft error hardening techniques such as BISER, FERST and TPDICE.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:qUcmZB5y_30C",
            "Publisher": "The Institution of Engineering and Technology"
        },
        {
            "Title": "The time dilation technique for timing error tolerance",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6374611/",
            "Abstract": "Timing error tolerance is of great importance in nanometer technology integrated circuits. In this paper, the Time Dilation design technique is proposed that provides concurrent error detection and correction in the field of application and also supports off-line manufacturing scan testing. By utilizing a new scan Flip-Flop, the Time Dilation technique is capable to detect and correct multiple errors at the minimum penalty of one clock cycle delay. The silicon area overhead and the power consumption are substantially reduced, as compared to the Razor design approach, since no additional memory elements are required. At the same time, the proposed technique introduces only negligible performance degradation since no extra circuitry is inserted in the critical paths of a design.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power efficient scan testing by exploiting existing error tolerance circuitry in a design",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6847834/",
            "Abstract": "Timing errors are a major threat in modern integrated circuits. Suitable error tolerance design techniques exist, like Razor, aiming to confront with this situation. However, the silicon area cost of these solutions makes them unattractive for widespread use. In this paper, aiming to broaden the applicability of timing error tolerance techniques, we explore the ability to extend their use for low power scan testing operations. A low power scan version of the Razor technique is presented, which drastically reduces the scan power consumption by eliminating the signal transitions at the input of the combinational logic during the scan operations.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A test pattern generation unit for memory NPSF built-in self test",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/911571/",
            "Abstract": "In this paper we present the design of a deterministic Test Pattern Generation (TPG) unit which can be exploited in a Built-In Self-Test (BIST) scheme for memory Neighborhood Pattern Sensitive Fault (NPSF) testing. The proposed TPG generates the required 5-bit Eulerian sequence that is needed for memory Type-1 NPSF testing.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A method for the estimation of defect detection probability of analog/RF defect-oriented tests",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7092609/",
            "Abstract": "A method to realistically estimate the defect detection probability achieved by defect-oriented analog/RF integrated circuit tests at the circuit design level is presented in this paper. The proposed method also provides insight to the efficiency of the various available defect-oriented testing techniques, thus allowing the selection of the most suitable for a specific circuit. The effect of structural defects in the presence of process variations and device mismatches is taken into account, by the exploitation of the defect probability distributions and the statistical models of the used technology. Although the proposed methodology is generally applicable to the entire class of analog circuits, its application to simple RF circuits which consist of a few elements seems to be more practical, due to the affordable computational cost implied by circuits with shorter defect dictionaries. In order to obtain results without a reliability …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An embedded I/sub DDQ/testing architecture and technique",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1194773/",
            "Abstract": "In this paper an embedded I/sub DDQ/ testing architecture is presented that targets to overcome the excessive hardware overhead requirements in built-in current sensing based testing applications. Moreover, a technique that utilises the IEEE 1149.1 boundary scan standard to control the proposed architecture is provided. The proposed solution is characterised by low silicon area requirements and permits the application of I/sub DDQ/ testing also in case that the chip is mounted on a printed circuit board.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Testing wireless transceivers' RF front-ends utilizing defect-oriented BIST techniques",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6463501/",
            "Abstract": "In modern nanotechnologies, the testing of embedded wireless transceivers' RF front-ends is a great concern. The test technique presented in this work is based on dedicated built-in self test (BIST) structures for each building block of the transceiver. These BIST circuits utilize defect-oriented test techniques. Experimental results on a CMOS transceiver design are discussed to accentuate the efficiency of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timing error mitigation in microprocessor cores",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7841316/",
            "Abstract": "Timing errors in the memory elements of a design are of increasing importance in nanometer technology microprocessor cores. In this work, we present a flip-flop oriented timing error detection and correction technique. It exploits a transition detector at the input of the flip-flop for error detection along with an asynchronous local error correction scheme to provide timing error tolerance. To validate the proposed approach, it has been applied in the design of a 32-bit MIPS microprocessor core which was fabricated in a 65nm CMOS technology.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BTI and HCI degradation detection in SRAM cells",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937664/",
            "Abstract": "The influence of Bias-Temperature Instability (BTI) and Hot Carrier Injection (HCI) on Static Random Access Memory (SRAM) aging is of major importance. In this paper a circuit for the periodic monitoring of BTI and HCI degradation in SRAM cells is proposed. Periodic aging monitoring provides the ability to avoid failures in the memory array by locating and replacing over-degraded cells. The proposed scheme exploits a low cost differential ring oscillator that can be easily embedded in a typical SRAM without affecting its normal mode of operation.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Device simulation of a n-DMOS cell with trench isolation",
            "Publication year": 2001,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269200001087",
            "Abstract": "The DMOS cell, a high-voltage transistor, implemented in low voltage standard 0.18 μm double-well CMOS technology with trench isolation is studied. The operation of the cell is investigated with the use of a device simulator while the effect of the trench to the operation of the cell is revealed.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:-f6ydRqryjwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A versatile built-in self test scheme for delay fault testing (poster paper)",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/343647.344343",
            "Abstract": "A new Built-In Self Test (BIST) scheme is presented that can be used for both offfline production or periodic testing of delay faults as well as for concurrent detection of faults causing signal delays in the field. The scheme is based on the I''7 monitoring of the outputs of the circuit under test (CUT). The proposed scheme has minimal impact on the performance and silicon area of the design since the same response verifier circuit is used for both offfline and concurrent detection of errors in the field.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Machine Learning in Alternate Testing of Integrated Circuits",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-15628-2_16",
            "Abstract": "Integrated circuit (IC) fabrication involves sophisticated and sensitive equipment, while design complexity and scale of integration are increasing in order to obtain the largest functionality within the smallest possible chip area. As ICs scale down, increasing uncertainties in the manufacturing processes lead to increased numbers of malfunctioning chips that have to be detected and withdrawn early in the production stage in order to assure product quality. Testing an IC for compliance with its specifications might require a considerable amount of time and resources, since a wide range of different tests—each tailored for a specific performance characteristic—should be performed, resulting in the collection of extremely large data sets that correspond to test data. In order to reduce test time and cost, several machine learning techniques have been applied for the identification of patterns and non-linear …",
            "Abstract entirety": 0,
            "Author pub id": "gHsE8pYAAAAJ:8AbLer7MMksC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A built-in-test circuit for RF differential low noise amplifiers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5378476/",
            "Abstract": "This paper presents an efficient, low-cost, built-in test (BIT) circuit for radio frequency differential low noise amplifiers (DLNAs). The BIT circuit detects amplitude alterations at the outputs of the DLNA, due to parametric or catastrophic faults, and provides a single digital Pass/Fail indication signal. A triple modular redundancy approach has been adopted for the BIT circuit design to avoid possible yield loss in case of a malfunctioning test circuitry. The technique has been evaluated on a typical CMOS RF DLNA and simulation results are presented.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Timing error detection and correction by time dilation",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12267-5_15",
            "Abstract": "Timing failures in high complexity - high frequency integrated circuits, which are mainly caused by test escapes and environmental as well as operating conditions, are a real concern in nanometer technologies. The Time Dilation design technique supports both on-line (concurrent) error detection/correction and off-line scan testing. It is based on a new scan Flip-Flop and provides multiple error detection and correction at the minimum penalty of one clock cycle delay at the normal circuit operation for each error correction. No extra memory elements are required, like in earlier design approaches in the open literature, reducing drastically the silicon area overhead, while the performance degradation is negligible since no extra circuitry is inserted in the critical paths of a design.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A pipeline architecture incorporating a low-cost error detection and correction mechanism",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4263461/",
            "Abstract": "High reliability requirements in many modern applications make soft errors an extremely important design aspect and pose new challenges in nanometer technologies. In addition, timing faults that may escape fabrication tests become a real concern in high complexity, high frequency designs. To confront this situation, a concurrent error detection and correction circuit and technique are presented in this work. Their application in pipeline architectures is analyzed and the pipeline error recovery mechanism is illustrated. The proposed scheme is characterized by low silicon area requirements, compared to earlier approaches, and the need of only a single clock cycle for pipeline recovery.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A design for testability technique for mixed-signal differential circuits",
            "Publication year": 2005,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1742-6596/10/1/085/meta",
            "Abstract": "In this paper a new DFT scheme is proposed suitable for testing mixed signal differential circuits. The proposed testing-scheme is capable of detecting single catastrophic faults injected into the circuit under test. These faults can be either shorts and opens or bridgings between non contiguous nodes of the circuit. The test result is provided by a digital fail/pass indication signal. Exhaustive simulations have revealed the effectiveness of the proposed technique in terms of fault coverage and cost.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:M05iB0D1s5AC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "SRAM oriented memory sense amplifier design in 0.18/spl mu/m CMOS technology",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1010661/",
            "Abstract": "In this paper a new two-stage sensing scheme suitable for current sensing in SRAM read operation is presented. The proposed scheme provides fast response with low silicon area requirements, since it incorporates only three transistors in the pitch of the bit lines for the sensing of the stored data in the selected memory cell. Process and temperature variation related simulations are provided in order to explore the operating range of the sensors in various conditions. In addition, comparison results are given with respect to a conventional sensing scheme. Finally, a compact layout design is presented to illustrate the area efficiency of the proposed sensing architecture.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast deployment of alternate analog test using Bayesian model fusion",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7092541/",
            "Abstract": "In this paper, we address the problem of limited training sets for learning the regression functions in alternate analog test. Typically, a large volume of real data needs to be collected from different wafers and lots over a long period of time to be able to train the regression functions with accuracy across the whole design space and apply alternate test with high confidence. To avoid this delay and achieve a fast deployment of alternate test, we propose to use the Bayesian model fusion technique that leverages prior knowledge from simulation data and fuses this information with data from few real circuits to draw accurate regression functions across the whole design space. The technique is demonstrated for an alternate test designed for RF low noise amplifiers.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A circuit for concurrent detection of soft and timing errors in digital CMOS ICs",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:JETT.0000042516.12841.36",
            "Abstract": "In this paper a new circuit for concurrent soft and timing error detection in CMOS ICs is presented. The circuit is based on current mode sense amplifier topologies to provide fast error detection times. After an error has been detected it can be corrected by using a retry cycle.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Aging monitoring in SRAM sense amplifiers",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376646/",
            "Abstract": "Transistor aging due to Bias-Temperature Instability (BTI) and Hot Carrier Injection (HCI) phenomena seriously affects the reliable operation of Static Random Access Memories (SRAMs). In this paper, a circuit for the periodic monitoring of BTI and HCI related transistor degradation in SRAM sense amplifiers is proposed. This degradation increases the response time of a sense amplifier. Periodic aging monitoring provides the ability to avoid failures in the memory array by detecting over aged sense amplifiers (near failure) and adjusting the clock frequency in order to maintain the reliable operation of the memory. The proposed scheme exploits a low cost Differential Ring Oscillator that can be easily embedded in a typical SRAM without affecting its normal mode of operation.",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A stress-relaxed negative voltage-level converter",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4132970/",
            "Abstract": "In this brief, a new embedded negative voltage-level converter (level shifter) is presented. The proposed circuit can convert a positive input signal to a negative output signal with reduced or even without (depending on the application) voltage stress on the used MOS devices. The circuit has been designed in a 0.18-mum triple-well standard CMOS technology, using double-gate-oxide-thickness MOS transistors with an absolute maximum rating of 4.0 V, a nominal power supply of 1.8 V, and a required negative voltage of -3.3 V. Simulation results are provided to demonstrate the efficiency of the proposed topology. According to the results, 1.82-ns delay and 0.53-mW power consumption are reported",
            "Abstract entirety": 1,
            "Author pub id": "gHsE8pYAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        }
    ]
}]