[{
    "name": "Γεώργιος Παπαϊωάννου",
    "romanize name": "Georgios Papaioannou",
    "School-Department": "Πληροφορικής",
    "University": "aueb",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 8098,
    "Scholar name": "Georgios Papaioannou",
    "Scholar id": "aZVSd0QAAAAJ",
    "Affiliation": "Professor of Computer Graphics, Athens University of Economics and Business",
    "Citedby": 1458,
    "Interests": [
        "Computer Graphics",
        "Shape Analysis"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=aZVSd0QAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The magic of the z-buffer: A survey",
            "Publication year": 2001,
            "Publication url": "https://otik.uk.zcu.cz/handle/11025/11293",
            "Abstract": "The wide availability of hardwired Z-buffer has sparked an explosion in the number of applications of the algorithm whose origins lie in hidden surface elimination. This paper presents a much-needed survey of key applications of the Z-buffer from the fields of rendering, modelling and vision in a common notation in order to help users make better use of this resource.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:UeHWp8X0CEIC",
            "Publisher": "University of West Bohemia"
        },
        {
            "Title": "Fractured Object Reassembly via Robust Surface Registration.",
            "Publication year": 2015,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/egsh.20151005.021-024/021-024.pdf?sequence=1",
            "Abstract": "The reassembly of fractured 3D objects from their parts is an important problem in cultural heritage and other domains. We approach reassembly from a geometric matching perspective and propose a pipeline for the automatic solution of the problem, where an efficient and generic three-level coarse-to-fine search strategy is used for the underlying global optimization. Key to the efficiency of our approach is the use of a discretized approximation of the surfaces’ distance field, which significantly reduces the cost of distance queries and allows our method to systematically search the global parameter space with minimal cost. The resulting reassembly pipeline provides highly reliable alignment, as demonstrated through the reassembly of fractured objects from their fragments and the reconstruction of 3D objects from partial scans, showcasing the wide applicability of our methodology.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:SnGPuo6Feq8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Illumination‐Guided Furniture Layout Optimization",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cgf.13930",
            "Abstract": "Lighting plays a very important role in interior design. However, in the specific problem of furniture layout recommendation, illumination has been either neglected or addressed with empirical or very simplified solutions. The effectiveness of a particular layout in its expected task performance can be greatly affected by daylighting and artificial illumination in a non‐trivial manner. In this paper, we introduce a robust method for furniture layout optimization guided by illumination constraints. The method takes into account all dominant light sources, such as sun light, skylighting and fixtures, while also being able to handle movable light emitters. For this task, the method introduces multiple generic illumination constraints and physically‐based light transport estimators, operating alongside typical geometric design guidelines, in a unified manner. We demonstrate how to produce furniture arrangements that comply with …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:hvmnpdAuIbkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multi-view ambient occlusion with importance sampling",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2448196.2448214",
            "Abstract": "Screen-space ambient occlusion and obscurance (AO) techniques have become de-facto methods for ambient light attenuation and contact shadows in real-time rendering. Although extensive research has been conducted to improve the quality and performance of AO techniques, view-dependent artifacts remain a major issue. This paper introduces Multi-view Ambient Occlusion, a generic per-fragment view weighting scheme for evaluating screen-space occlusion or obscurance using multiple, arbitrary views, such as the readily available shadow maps. Additionally, it exploits the resulting weights to perform adaptive sampling, based on the importance of each view to reduce the total number of samples, while maintaining the image quality. Multi-view Ambient Occlusion improves and stabilizes the screen-space AO estimation without overestimating the results and can be combined with a variety of existing screen …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A multiview and multilayer approach for interactive ray tracing",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2856400.2856401",
            "Abstract": "We introduce a generic method for interactive ray tracing, able to support complex and dynamic environments, without the need for precomputations or the maintenance of additional spatial data structures. Our method, which relies entirely on the rasterization pipeline, stores fragment information for the entire scene on a multiview and multilayer structure and marches through depth layers to capture both near and distant information for illumination computations. Ray tracing is efficiently achieved by concurrently traversing a novel cube-mapped A-buffer variant in image space that exploits GPU-accelerated double linked lists, decoupled storage, uniform depth subdivision and empty space skipping on a per-fragment basis. We illustrate the effectiveness and quality of our approach on path tracing and ambient occlusion implementations in scenarios, where full scene coverage is of major importance. Finally, we report …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:zGdJYJv2LkUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing Virtual Walkthroughs of Archaeological Sites",
            "Publication year": 2003,
            "Publication url": "https://scholar.google.com/scholar?cluster=8138420700419768028&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Shape Classification of Building Information Models using Neural Networks",
            "Publication year": 2021,
            "Publication url": "http://graphics.cs.aueb.gr/graphics/docs/papers/BIM3DOR.pdf",
            "Abstract": "The Building Information Modelling (BIM) procedure introduces specifications and data exchange formats widely used by the construction industry to describe functional and geometric elements of building structures in the design, planning, cost estimation and construction phases of large civil engineering projects. In this paper we explain how to apply a modern, low-parameter, neural-network-based classification solution to the automatic geometric BIM element labeling, which is becoming an increasingly important task in software solutions for the construction industry. The network is designed so that it extracts features regarding general shape, scale and aspect ratio of each BIM element and be extremely fast during training and prediction. We evaluate our network architecture on a real BIM dataset and showcase accuracy that is difficult to achieve with a generic 3D shape classification network.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:m92CDrhVnKEC",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "The Ancient Olympic Games: Being Part of the Experience",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2384368.2384371",
            "Abstract": "This paper presents the virtual reality applications that the Foundation of the Hellenic World has produced associated with the Olympic Games in ancient Greece. The separate virtual reality shows are presented in terms of interactivity and educational value. The technical aspects of the productions are next explained in detail, with an emphasis on character animation, dynamics and occlusion culling for surround screen projection environments. These techniques were mostly utilised in the recent production regarding the ancient pentathlon, where much effort has been made to recreate the feeling of the games and help the user/spectator be an interacting part of the edutainment activity.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Accelerating k+-buffer using efficient fragment culling",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2699276.2721402",
            "Abstract": "In the last decade, significant research has been conducted for addressing the problem of multi-fragment rendering from different perspectives. While the hardware-accelerated A-buffer is the dominant structure for holding multiple fragments via per-pixel linked lists, several variants have been proposed to alleviate the cost of excessive allocation and random access of video-memory. k-buffer is a widely-accepted A-buffer approximation, able to capture the k-closest to the viewer fragments, due to its reduced memory and computation requirements. To alleviate contention of distant fragments when rendering highly-complex scenes, k+-buffer [Vasilakis and Fudos 2014] concurrently performs culling checks to efficiently discard fragments that are farther from all currently maintained fragments. Unfortunately, the fragment elimination process is performed inside the pixel shader execution, thus not exploiting the …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:5bg8sr1QxYwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CVC: The Contourlet Video Compression algorithm for real-time applications",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1510.00561",
            "Abstract": "Nowadays, real-time video communication over the internet through video conferencing applications has become an invaluable tool in everyone's professional and personal life. This trend underlines the need for video coding algorithms that provide acceptable quality on low bitrates and can support various resolutions inside the same stream in order to cope with limitations on computational resources and network bandwidth. In this work, a novel scalable video coding algorithm based on the contourlet transform is presented. The algorithm utilizes both lossy and lossless methods in order to achieve compression. One of its most notable features is that due to the transform utilised, it does not suffer from blocking artifacts that occur with many widely adopted compression algorithms. The proposed algorithm takes advantage of the vast computational capabilities of modern GPUs, in order to achieve real-time performance and provide satisfactory encoding and decoding times at relatively low cost, making it suitable for applications like video conferencing. Experiments show that the proposed algorithm performs satisfactorily in terms of compression ratio and speed, while it outperforms standard methods in terms of perceptual quality on lower bitrates.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:DrR-2ekChdkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "k+-buffer: An Efficient, Memory-Friendly and Dynamic-buffer Framework",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7070744/",
            "Abstract": "Depth-sorted fragment determination is fundamental for a host of image-based techniques which simulates complex rendering effects. It is also a challenging task in terms of time and space required when rasterizing scenes with high depth complexity. When low graphics memory requirements are of utmost importance, k-buffer can objectively be considered as the most preferred framework which advantageously ensures the correct depth order on a subset of all generated fragments. Although various alternatives have been introduced to partially or completely alleviate the noticeable quality artifacts produced by the initial k-buffer algorithm in the expense of memory increase or performance downgrade, appropriate tools to automatically and dynamically compute the most suitable value of k are still missing. To this end, we introduce k + -buffer, a fast framework that accurately simulates the behavior of k-buffer in a …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:DkZNVXde3BIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-time volume-based ambient occlusion",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5383355/",
            "Abstract": "Real-time rendering can benefit from global illumination methods to make the 3D environments look more convincing and lifelike. On the other hand, the conventional global illumination algorithms for the estimation of the diffuse surface interreflection make heavy usage of intra- and interobject visibility calculations, so they are time-consuming, and using them in real-time graphics applications can be prohibitive for complex scenes. Modern illumination approximations, such as ambient occlusion variants, use precalculated or frame-dependent data to reduce the problem to a local shading one. This paper presents a fast real-time method for visibility sampling using volumetric data in order to produce accurate inter- and intraobject ambient occlusion. The proposed volume sampling technique disassociates surface representation data from the visibility calculations, and therefore, makes the method suitable for both …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:WF5omc3nYNoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Rasterisation-based progressive photon mapping",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-020-01897-3",
            "Abstract": "Ray tracing on the GPU has been synergistically operating alongside rasterisation in interactive rendering engines for some time now, in order to accurately capture certain illumination effects. In the same spirit, in this paper, we propose an implementation of progressive photon mapping entirely on the rasterisation pipeline, which is agnostic to the specific GPU architecture, in order to synthesise images at interactive rates. While any GPU ray tracing architecture can be used for photon mapping, performing ray traversal in image space minimises acceleration data structure construction time and supports arbitrarily complex and fully dynamic geometry. Furthermore, this strategy maximises data structure reuse by encompassing rasterisation, ray tracing and photon gathering tasks in a single data structure. Both eye and light paths of arbitrary depth are traced on multi-view deep G-buffers, and photon flux is gathered by …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:RuPIJ_LgqDgC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Interactive volume-based indirect illumination of dynamic scenes",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15690-8_12",
            "Abstract": "In this paper we present a novel real-time algorithmto compute the global illumination of dynamic scenes with arbitrarily complex dynamic illumination. We use a virtual point light (VPL) illumination model on the volume representation of the scene. Unlike other dynamic VPL-based real-time approaches, our method handles occlusion (shadowing and masking) caused by the interference of geometry and is able to estimate diffuse inter-reflections from multiple light bounces.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "High quality elliptical texture filtering on gpu",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1944745.1944749",
            "Abstract": "The quality of the available hardware texture filtering, even on state of the art graphics hardware, suffers from several aliasing artifacts, in both spatial and temporal domain. Those artifacts are mostly evident in extreme conditions, such as grazing viewing angles, highly warped texture coordinates, or extreme perspective and become especially annoying when animation is involved.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "3D object repair using 2D algorithms",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11758525_36",
            "Abstract": "A number of three-dimensional algorithms have been proposed to solve the problem of patching surfaces to rectify and extrapolate missing information due to model problems or bad geometry visibility during data capture. On the other hand, a number of similar yet more simple and robust techniques apply to 2D image data and are used for texture restoration. In this paper we make an attempt to bring these two-dimensional techniques to the 3D domain due to their obvious advantage of simplicity and controllability. Creating a depth image with the help of a voxelisation algorithm will allow us to apply a variety of image repair algorithms in order to mend a 3D object. The use of three variations of the texture synthesis algorithm is investigated. Constrained texture synthesis and its variations using the Haar wavelet and image decomposition methods are also proposed in order to preserve patterns appearing on …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "DIRT: deferred image-based ray tracing.",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Vardis/publication/304216453_DIRT_Deferred_Image-based_Ray_Tracing/links/5769d4b508ae7d2478cd8a0a/DIRT-Deferred-Image-based-Ray-Tracing.pdf",
            "Abstract": "We introduce a novel approach to image-space ray tracing ideally suited for the photorealistic synthesis of fully dynamic environments at interactive frame rates. Our method, designed entirely on the rasterization pipeline, alters the acceleration data structure construction from a per-fragment to a per-primitive basis in order to simultaneously support three important, generally conflicting in prior art, objectives: fast construction times, analytic intersection tests and reduced memory requirements. In every frame, our algorithm operates in two stages: A compact representation of the scene geometry is built based on primitive linked-lists, followed by a traversal step that decouples the ray-primitive intersection tests from the illumination calculations; a process inspired by deferred rendering and the path integral formulation of light transport. Efficient empty space skipping is achieved by exploiting several culling optimizations both in xy-and z-space, such as pixel frustum clipping, depth subdivision and lossless buffer down-scaling. An extensive experimental study is finally offered showing that our method advances the area of image-based ray tracing under the constraints posed by arbitrarily complex and animated scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Hck25ST_3aIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image-based techniques for enhancing virtual reality environments",
            "Publication year": 2003,
            "Publication url": "https://www.academia.edu/download/41875997/Image-Based_Techniques_for_Enhancing_Vir20160201-11554-1ovst7e.pdf",
            "Abstract": "This paper describes the methodological aspects of the application of various established image-based graphics techniques in virtual reality applications, in order to visually enrich and extend the common capabilities of virtual environment visualization platforms. The paper describes these techniques and goes to the extent of explaining various practical implementation issues. Examples and application case studies are provided to demonstrate the enhancements.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Compact YCoCg Frame Buffer",
            "Publication year": 2012,
            "Publication url": "http://jcgt.org/published/0001/01/02/paper.pdf",
            "Abstract": "In this article we present a lossy frame-buffer compression format, suitable for existing commodity GPUs and APIs. Our compression scheme allows a full-color image to be directly rasterized using only two color channels at each pixel, instead of three, thus reducing both the consumed storage space and bandwidth during the rendering process. Exploiting the fact that the human visual system is more sensitive to fine spatial variations of luminance than of chrominance, the rasterizer generates fragments in the YCoCg color space and directly stores the chrominance channels at a lower resolution using a mosaic pattern. When reading from the buffer, a simple and efficient edge-directed reconstruction filter provides a very precise estimation of the original uncompressed values. We demonstrate that the quality loss from our method is negligible, while the bandwidth reduction results in a sizable increase in the fill rate of the GPU rasterizer.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applications of computer graphics, VR and computer vision in cultural heritage",
            "Publication year": 2006,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=2199990",
            "Abstract": "Localización: Tecnologías de la información y comunicación (TICs), arte y patrimonio cultural: aplicaciones, desarrollo local y aprendizaje informal: Primer Seminario Internacional celebrado en Donostia-San Sebastián el 5 de mayo de 2003/coord. por Aurkene Alzua Sorzabal, 2006, ISBN 84-9830-036-3, págs. 117-127",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:SGW5VrABaM0C",
            "Publisher": "Servicio de Publicaciones= Argitalpen Zerbitzua"
        },
        {
            "Title": "WebRays: Ray tracing on the web",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4842-7185-8_18",
            "Abstract": "This chapter introduces WebRays, a GPU-accelerated ray intersection engine for the World Wide Web. It aims to offer a flexible and easy-to-use programming interface for robust and high-performance ray intersection tests on modern browsers. We cover design considerations, best practices, and usage examples for several ray tracing tasks.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:m4fbC6XIj1kC",
            "Publisher": "Apress, Berkeley, CA"
        },
        {
            "Title": "Graphics and visualization: principles & algorithms",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=9UwhIdwmS9cC&oi=fnd&pg=PP1&dq=info:MDrp8dUKf94J:scholar.google.com&ots=pQYFXPzC44&sig=jTpLR6Qc0fcB7h5cHwdgsVggUaQ",
            "Abstract": "This book is a comprehensive introduction to visual computing, dealing with the modeling and synthesis of visual data by means of computers. What sets this book apart from other computer graphics texts is the integrated coverage of computer graphics and visualization topics, including important techniques such as subdivision and multi-resolution modeling, scene graphs, shadow generation, ambient occlusion, and scalar and vector data visualization. Students and practitioners will benefit from the comprehensive coverage of the principles that are the basic tools of their trade, from fundamental computer graphics and classic visualization techniques to advanced topics.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:W7OEmFMy1HYC",
            "Publisher": "CrC Press"
        },
        {
            "Title": "Segmentation and surface characterization of arbitrary 3d meshes for object reconstruction and recognition",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/905491/",
            "Abstract": "Polygonal models are the most common representation of structured 3D data in computer graphics, pattern recognition and machine vision. The method presented here automatically identifies and labels all compact surface regions of a polygonal mesh, visible or not, and extracts valuable invariant features regarding their geometric attributes. A method that is independent of the mesh topology is also presented for the surface bumpiness estimation and the identification of coarse surface regions.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:NxmKEeNBbOMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Progressive Screen-Space Multichannel Surface Voxelization",
            "Publication year": 2018,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781351261524-19/progressive-screen-space-multichannel-surface-voxelization-athanasios-gaitatzes-georgios-papaioannou",
            "Abstract": "This chapter presents the novel concept of progressive voxelization, an incremental image-based volume generation scheme for fully dynamic scenes that addresses the view-dependency issues of image-based voxelization within the time constraints. The performance of the optimized progressive voxelization is identical to that of the cleanup stage as expected, since it is essentially a modified cleanup stage. It follows that the dual stage version performance will always be slower than the optimized one. In terms of voxelization robustness, our algorithm complements single-frame screen-space voxelization and supports both moving image viewpoints and fully dynamic geometry and lighting. When using the technique for lighting effects, as in the case of the LPV algorithm of or the ray marching techniques of, the volume attributes must include occlusion information, sampled normal vectors, direct lighting (VPLs), and …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:zdjWy_NXXwUC",
            "Publisher": "A K Peters/CRC Press"
        },
        {
            "Title": "Progressive Screen-Space Multichannel Surface Voxelization",
            "Publication year": 2013,
            "Publication url": "https://www.taylorfrancis.com/chapters/progressive-screen-space-multichannel-surface-voxelization-athanasios-gaitatzes-georgios-papaioannou/e/10.1201/b14077-14",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:yY3RG6sOEgwC",
            "Publisher": "AK Peters/CRC Press"
        },
        {
            "Title": "From reassembly to object completion: A complete systems pipeline",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3009905",
            "Abstract": "The problem of the restoration of broken artifacts, where large parts could be missing, is of high importance in archaeology. The typical manual restoration can become a tedious and error-prone process, which also does not scale well. In recent years, many methods have been proposed for assisting the process, most of which target specialized object types or operate under very strict constraints. We propose a digital shape restoration pipeline consisting of proven, robust methods for automatic fragment reassembly and shape completion of generic three-dimensional objects of arbitrary type. In this pipeline, first we introduce a novel unified approach for handling the reassembly of objects from heavily damaged fragments by exploiting both fracture surfaces and salient features on the intact sides of fragments, when available. Second, we propose an object completion procedure based on generalized symmetries and …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:silx2ntsSuwC",
            "Publisher": "ACM"
        },
        {
            "Title": "A GPU based real-time video compression method for video conferencing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6622719/",
            "Abstract": "Recent years have seen a great increase in the everyday use of real-time video communication over the internet through video conferencing applications. Limitations on computational resources and network bandwidth require video encoding algorithms that provide acceptable quality on low bitrates and can support various resolutions inside the same stream. In this work, the authors present a scalable video coding algorithm based on the contourlet transform that incorporates both lossy and lossless methods, as well as variable bitrate encoding schemes in order to achieve compression. Furthermore, due to the transform utilized, it does not suffer from blocking artifacts that occur with many widely adopted compression algorithms. The proposed algorithm is designed to achieve real-time performance by utilizing the vast computational capabilities of modern GPUs, providing satisfactory encoding and decoding times …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Object Completion using k‐Sparse Optimization",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cgf.12741",
            "Abstract": "We present a new method for the completion of partial globally‐symmetric 3D objects, based on the detection of partial and approximate symmetries in the incomplete input dataset. In our approach, symmetry detection is formulated as a constrained sparsity maximization problem, which is solved efficiently using a robust RANSAC‐based optimizer. The detected partial symmetries are then reused iteratively, in order to complete the missing parts of the object. A global error relaxation method minimizes the accumulated alignment errors and a non‐rigid registration approach applies local deformations in order to properly handle approximate symmetry. Unlike previous approaches, our method does not rely on the computation of features, it uniformly handles translational, rotational and reflectional symmetries and can provide plausible object completion results, even on challenging cases, where more than half of the …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:PkcyUWeTMh0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "MSAA-Based Coarse Shading for Power-Efficient Rendering on High Pixel-Density Displays",
            "Publication year": 2015,
            "Publication url": "https://www.highperformancegraphics.org/wp-content/uploads/2015/PosterAbstracts/msaa-based-coarse-shading.pdf",
            "Abstract": "Figure 1: Our technique reduces the total number of pixel shader invocations (by 3.63× in this scene) when compared to standard per-pixel shading, resulting in a reduction of the total rendering time and power consumption. The clarity of geometric edges is preserved and the resulting image shows very few perceivable differences when observed on a high pixel-density display. The heatmap measures the number of shader invocations per 2× 2 pixel block. RS: Regular Sampling. IS: Interleaved Sampling. Modeling and texturing by Glen Fox.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:69ZgNCALVd0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast approximate visibility on the GPU using precomputed 4d visibility fields",
            "Publication year": 2010,
            "Publication url": "https://dspace5.zcu.cz/handle/11025/11052",
            "Abstract": "We present a novel GPU-based method for accelerating the visibility function computation of the lighting equation in dynamic scenes composed of rigid objects. The method pre-computes, for each object in the scene, the visibility and normal information, as seen from the environment, onto the bounding sphere surrounding the object and encodes it into maps. The visibility function is encoded by a four-dimensional visibility field that describes the distance of the object in each direction for all positional samples on a sphere around the object. In addition, the normal vectors of each object are computed and stored in corresponding fields for the same positional samples for use in the computation of reflection in ray-tracing. Thus we are able to speed up the calculation of most algorithms that trace rays to real-time frame rates. The pre-computation time of our method is relatively small. The space requirements amount to 1 byte per ray direction for the computation of ambient occlusion and soft shadows and 4 bytes per ray direction for the computation of reflection in ray-tracing. We present the acceleration results of our method and show its application to two different intersection intensive domains, ambient occlusion computation and stochastic ray tracing on the GPU.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:hC7cP41nSMkC",
            "Publisher": "Václav Skala-UNION Agency"
        },
        {
            "Title": "A contourlet transform based algorithm for real-time video encoding",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8437/843704/A-contourlet-transform-based-algorithm-for-real-time-video-encoding/10.1117/12.924327.short",
            "Abstract": "In recent years, real-time video communication over the internet has been widely utilized for applications like video conferencing. Streaming live video over heterogeneous IP networks, including wireless networks, requires video coding algorithms that can support various levels of quality in order to adapt to the network end-to-end bandwidth and transmitter/receiver resources. In this work, a scalable video coding and compression algorithm based on the Contourlet Transform is proposed. The algorithm allows for multiple levels of detail, without re-encoding the video frames, by just dropping the encoded information referring to higher resolution than needed. Compression is achieved by means of lossy and lossless methods, as well as variable bit rate encoding schemes. Furthermore, due to the transformation utilized, it does not suffer from blocking artifacts that occur with many widely adopted compression …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A Survey of Multifragment Rendering",
            "Publication year": 2020,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cgf.14019",
            "Abstract": "In the past few years, advances in graphics hardware have fuelled an explosion of research and development in the field of interactive and real‐time rendering in screen space. Following this trend, a rapidly increasing number of applications rely on multifragment rendering solutions to develop visually convincing graphics applications with dynamic content. The main advantage of these approaches is that they encompass additional rasterised geometry, by retaining more information from the fragment sampling domain, thus augmenting the visibility determination stage. With this survey, we provide an overview of and insight into the extensive, yet active research and respective literature on multifragment rendering. We formally present the multifragment rendering pipeline, clearly identifying the construction strategies, the core image operation categories and their mapping to the respective applications. We describe …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:Zh0EY9V9P6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fast fragment assemblage using boundary line and surface matching",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4624516/",
            "Abstract": "In the recent past, fragment matching has been treated in two different approaches, one using curve matching methods and one that compares whole surfaces or volumes, depending on the nature of the broken artefacts. Presented here is a fast, unified method that combines curve matching techniques with a surface matching algorithm to estimate the positioning and respective matching error for the joining of three-dimensional fragmented objects. Combining both aspects of fragment matching, essentially eliminates most of the ambiguities present in each one of the matching problem categories and helps provide more accurate results with low computational cost.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient 3D object retrieval using depth images",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1026711.1026743",
            "Abstract": "In this paper, we present a new three-dimensional object retrieval method. This method employs depth buffers for representing and comparing the objects. Specifically, multiple depth buffers per object (computed from different points of view) are compared for surface and volume similarity. Our method is easily extensible for hierarchical comparisons at multiple resolutions and is highly parallelizable. We have employed this method for both inter-class and intra-class retrieval tasks on a gallery of over 3 000 three-dimensional objects of vehicles with very encouraging results. The accuracy of the method depends on the number of depth buffers and the depth buffer resolution",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sampling Clear Sky Models using Truncated Gaussian Mixtures",
            "Publication year": 2021,
            "Publication url": "http://diglib.eg.org/handle/10.2312/sr20211288",
            "Abstract": "Parametric clear sky models are often represented by simple analytic expressions that can efficiently generate plausible, natural radiance maps of the sky, taking into account expensive and hard to simulate atmospheric phenomena. In this work, we show how such models can be complemented by an equally simple, elegant and generic analytic continuous probability density function (PDF) that provides a very good approximation to the radiance-based distribution of the sky. We describe a fitting process that is used to properly parameterise a truncated Gaussian mixture model, which allows for exact, constant-time and minimal-memory sampling and evaluation of this PDF, without rejection sampling, an important property for practical applications in offline and real-time rendering. We present experiments in a standard importance sampling framework that showcase variance reduction approaching that of a more …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:eI34FqJmdUoC",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Fractured 3D object restoration and completion",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2787626.2792633",
            "Abstract": "The problem of object restoration from eroded fragments where large parts could be missing is of high relevance in archaeology. Manual restoration is possible and common in practice but it is a tedious and error-prone process, which does not scale well. Solutions for specific parts of the problem have been proposed but a complete reassembly and repair pipeline is absent from the bibliography. We propose a shape restoration pipeline consisting of appropriate methods for automatic fragment reassembly and shape completion. We demonstrate the effectiveness of our approach using real-world fractured objects.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:rTD5ala9j4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards Automated 3D Reconstruction of Defective Cultural Heritage Objects.",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.709.6200&rep=rep1&type=pdf",
            "Abstract": "Due to recent improvements in 3D acquisition and shape processing technology, the digitization of Cultural Heritage (CH) artifacts is gaining increased application in context of archival and archaeological research. This increasing availability of acquisition technologies also implies a need for intelligent processing methods that can cope with imperfect object scans. Specifically for Cultural Heritage objects, besides imperfections given by the digitization process, also the original artifact objects may be imperfect due to deterioration or fragmentation processes. Currently, the reconstruction of previously digitized CH artifacts is mostly performed manually by expert users reassembling fragment parts and completing imperfect objects by modeling. However, more automatic methods for CH object repair and completion are needed to cope with increasingly large data becoming available.In this conceptual paper, we first provide a brief survey of typical imperfections in CH artifact scan data and in turn motivate the need for respective repair methods. We survey and classify a selection of existing reconstruction methods with respect to their applicability for CH objects, and then discuss how these approaches can be extended and combined to address various types of physical defects that are encountered in CH artifacts by proposing a flexible repair workflow for 3D digitizations of CH objects. The workflow accommodates an automatic reassembly step which can deal with fragmented input data. It also includes the similarity-based retrieval of appropriate complementary object data which is used to repair local and global object defects. Finally, we discuss …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:BrOSOlqYqPUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing a Real-Time playback system for a Dome Theater",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/41347791/VAST-2006optimized.pdf",
            "Abstract": "Most dome display systems today employ pre-rendered shows for attracting visitors. In addition since the technology is well established, developers have many tools at their disposal for creating such shows. On the contrary real-time shows for dome displays are just starting to appear. As a result the production of such shows is not a standardized process. Slowly, progress is made. Graphics generator cards are able to support the required SXGA+ resolutions and the supporting cluster systems are able to supply the processing power and memory bandwidth that such real-time systems require. Tools have to be developed and new processes have to be established. The Foundation of the Hellenic World (FHW) having produced numerous real-time productions for immersive flat display systems has great experience in realizing such shows. In this paper we present the technological developments for the production of real time applications for digital dome display systems.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessment of the optimization procedure for the nonlinear suspension system of a heavy vehicle",
            "Publication year": 2016,
            "Publication url": "http://www.mvm.fink.rs/Journal/Archive/2016/2016V42N2/Dimitrous_et_all/Dimitrous_et_all_Paper.pdf",
            "Abstract": "Suspension systems influence the overall performance of the vehicle by receiving the loads created by the road excitation. These loads are transmitted through the tires and the wheels ensuring that vibrations are isolated and not perceived by the passengers. Depending on the aspect of interest regarding the design of a suspension system, the focus of the studies is turned on the ride comfort or the road holding of the vehicle being the basic needs for a good suspension system. Ride comfort is related to the passenger’s perception of the moving vehicle’s environment, while road holding is the degree to which a car maintains contact with the road surface in various types of directional changes. Keeping the tires in contact with the ground constantly is of vital importance for the friction between the vehicle and the road affecting the vehicle’s ability to steer, brake and accelerate. Time domain statistics, such as mean suspension deflection, maximum and RMS values of suspension acceleration are often used in suspension design as criteria for road comfort ability. The main conflict and common trade-off in the automotive industry is the one concerning the displacement and the acceleration of the suspension. A hard configuration with high spring stiffness and high damping is required for reducing the suspension displacement. On the other hand, low spring stiffness and low damping is required for reducing suspension acceleration. This conflict depicts the trade-off between the ride comfort and the road holding. Multibody dynamics have been used extensively by automotive industry to model and design vehicle suspension. Before modern optimization …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:ji7lAbPyDbYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reconstruction of three-dimensional objects through matching of their parts",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/982888/",
            "Abstract": "The problem of re-assembling an object from its parts or fragments has never been addressed with a unified computational approach, which depends on the pure geometric form of the parts and not on application-specific features. We propose a method for the automatic reconstruction of a model based on the geometry of its parts, which may be computer-generated models or range-scanned models. The matching process can benefit from any other external constraint imposed by the specific application.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "GPU Accelerated Computation of Geometric Descriptors in Parametric Space",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-29971-6_3",
            "Abstract": "We present a novel generic method for the fast and accurate computation of geometric descriptors. While most existing approaches perform the computations directly on the geometric representation of the model, our method operates in parametric space, decoupling the computational complexity from the underlying mesh geometry. In contrast to other parametric space approaches, our method is not restricted to specific descriptors or parameterisations of the surface. By using the parametric space representation of the mesh geometry, we can trivially exploit massive parallel GPU architectures and achieve interactive computation times, while maintaining high accuracy. This renders the method suitable for computations involving large areas of support and animated shapes.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Xl6nMSl579sC",
            "Publisher": "Springer"
        },
        {
            "Title": "Presampled Visibility for Ambient Occlusion",
            "Publication year": 2008,
            "Publication url": "https://otik.uk.zcu.cz/handle/11025/1316",
            "Abstract": "We present a novel method to accelerate the computation of the visibility function of the lighting equation, in dynamic scenes composed of rigid, non-penetrating objects. The main idea of the technique is to pre-compute for each object in the scene its associated four-dimensional field that describes the visibility in each direction for all positional samples on a sphere around the object, we call this a displacement field. We are able to speed up the calculation of algorithms that trace visibility rays to near real time frame rates. The storage requirements of the technique, amounts from one byte to one bit per ray direction making it particularly attractive to scenes with multiple instances of the same object, as the same cached data can be reused, regardless of the geometric transformation applied to each instance. We suggest an acceleration technique and identify the sampling method that gives the best results based on experimentation.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tile-based caching optimization for 360 videos",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3323679.3326515",
            "Abstract": "Panoramic, or 360 video streaming and playback are prime components of mixed-reality and panoramic movie-viewing experiences, they offer an immersive viewing experience, and they are becoming increasingly popular, albeit very resource-demanding. Caching of 360 video content at caches close to the user reduces content delivery delay and bandwidth consumption. In 360 video streaming, the recently proposed tiling approach allows the streaming of different parts (tiles) of the 360 content at different resolutions as opposed to monolithic single-stream transmission.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:unp9ATQDT5gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Remote Teaching Advanced Rendering Topics Using the Rayground Platform",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9535170/",
            "Abstract": "Rayground is a novel online framework for fast prototyping and interactive demonstration of ray tracing algorithms. It aims to set the ground for the online development of ray-traced visualization algorithms in an accessible manner for everyone, stripping off the mechanics that get in the way of creativity and the understanding of the core concepts. Due to the COVID-19 pandemic, remote teaching and online coursework have taken center stage. In this work, we demonstrate how Rayground can incorporate advanced instructive rendering media during online lectures as well as offer attractive student assignments in an engaging, hands-on manner. We cover things to consider when building or porting methods to this new development platform, best practices in remote teaching and learning activities, and time-tested assessment and grading strategies suitable for fully online university courses.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:wUn16MOA3RoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "KETTLE: A Real-time Model for Orchestral Timpani",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Papaioannou-3/publication/228947736_Kettle_A_real-time_model_for_orchestral_timpani/links/550bbb2c0cf265693cef9414/Kettle-A-real-time-model-for-orchestral-timpani.pdf",
            "Abstract": "The orchestral timpani are a key component in western classical music, although their weight, size, and fragility make their transportation very difficult. Current commercial software synthesizers for the Orchestral Timpani are primarily sample-based and work with a MIDI keyboard, giving the user control over the note amplitude and pitch. This approach implements a virtual five-piece set of orchestral timpani, which is controlled using a pressuresensitive graphics tablet. A brief analysis of the mechanics and playing techniques of the Timpani is presented, followed by their approximation by this model’s control scheme and sound engine. Thereon, the details of the model’s implementation are explained, and finally the results of the model are presented along with conclusions on the subject.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting Unbroken Surface Congruity for the Acceleration of Fragment Reassembly",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.2312/gch.20171305",
            "Abstract": "Virtual reassembly problems are often encountered in the cultural heritage domain. The reassembly or\" puzzling\" problem is typically described as the process for the identification of corresponding pieces within a part collection, followed by the clustering and pose estimation of multiple parts that result in a virtual representation of assembled objects. This work addresses this problem with an efficient, user-guided computational approach. The proposed approach augments the typical reassembly pipeline with a smart culling step, where geometrically incompatible fragment combinations can be quickly rejected. After splitting each fragment into potentially fractured and intact facets, each intact facet is examined for prominent linear or curved structures and a heuristic test is employed to evaluate the plausibility of facet pairs, by comparing the number of feature curves associated with each facet, as well as the geometric …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:Xz60mAmATU4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time diffuse global illumination using radiance hints",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2018323.2018326",
            "Abstract": "GPU-based interactive global illumination techniques are receiving an increasing interest from both the research and the industrial community as real-time graphics applications strive for visually rich and realistic dynamic three-dimensional environments. This paper presents a fast new diffuse global illumination method that generates a sparse set of low-cost radiance field evaluation points (radiance hints) and computes an arbitrary number of diffuse inter-reflections within a given volume. The proposed approximate technique combines ideas from exiting grid-based radiance caching techniques with reflective shadow maps as well as a stochastic scheme for visibility calculations, in order to achieve high frame rates for multiple light bounces.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic Reconstruction of Archaeological Finds–A Graphics Approach",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Practical Framebuﬀer Compression",
            "Publication year": 2018,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781351052221-17/practical-framebu%EF%AC%80er-compression-pavlos-mavridis-georgios-papaioannou",
            "Abstract": "The total framebuﬀer memory can further increase when using algorithms that store multiple intermediate render buﬀers, such as deferred rendering or when simply rendering at very high resolutions in order to drive high-density displays, which is a rather recent trend in mobile and desktop computing. The same is also true when driving multiple displays from the same GPU, in order to create immersive setups. All of these factors vastly increase the consumed memory and put an enormous stress on the memory subsystem of the GPU.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:mB3voiENLucC",
            "Publisher": "AK Peters/CRC Press"
        },
        {
            "Title": "Generalized Digital Reassembly using Geometric Registration",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7419572/",
            "Abstract": "We present a novel and generic user-guided approach for the digital reconstruction of cultural heritage finds from fragments, which operates directly on generic 3D objects. Central to our approach is a three-tier geometric registration approach that addresses the reassembly problem using i) the contact surface of the fractured objects, ii) feature curves on the intact surfaces and iii) partial object symmetries. In contrast to most existing methodologies, our approach is more generic and addresses even the most difficult cases, where contact surface is unusable, small or absent. We evaluate our method using digitized fragments from the Nidaros Cathedral.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:jSAVyFp_754C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Real-Time Video Encoding Scheme Based on the Contourlet Transform",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=am2fDwAAQBAJ&oi=fnd&pg=PA155&dq=info:o0VVPHKmF-4J:scholar.google.com&ots=YaXIm6AZMP&sig=yEwJnSECjsFCzdQSWH8vrV5yDYI",
            "Abstract": "Real-time video communication over the internet and other heterogeneous IP networks has become a significant part of modern communications, underlining the need for highly effi‐-cient video coding algorithms. The most desirable characteristic of such an algorithm would be the ability to maintain satisfactory visual quality while achieving good compression. Ad‐-ditional advantageous characteristics would be low computational complexity and real-time performance, allowing the algorithm to be used in a wide variety of less powerful comput‐-ers. Transmission of video over the network would benefit by the ability to adapt to the net‐-work's end-to-end bandwidth and transmitter/receiver resources, as well as by resistance to packet losses that might occur. Additionally, scalability and resistance to noise would be highly advantageous characteristics for a modern video compression algorithm. Most state of the art video compression techniques like the H. 264, DivX/Xvid, MPEG2 fail to achieve real time performance without the use of dedicated hardware due to their high computa‐-tional complexity. Moreover, in order to achieve optimal compression and quality they de‐-pend on multipass statistical and structural analysis of the whole video content, which cannot happen in cases of live video stream generation as in the case of video-conferencing.In this chapter, a more elaborate analysis of a novel algorithm for high-quality real-time vid‐-eo encoding, originally proposed in [1], is presented. The algorithm is designed for content obtained from low resolution sources like web cameras, surveillance cameras, etc. Critical to the efficiency of video …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:IWHjjKOFINEC",
            "Publisher": "BoD–Books on Demand"
        },
        {
            "Title": "Practical Framebuﬀer Compression",
            "Publication year": 2013,
            "Publication url": "https://www.taylorfrancis.com/chapters/practical-framebu%EF%AC%80er-compression-pavlos-mavridis-georgios-papaioannou/e/10.1201/b14077-20",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Og1tA8FjbJAC",
            "Publisher": "AK Peters/CRC Press"
        },
        {
            "Title": "A Parametric Space Approach to the Computation of Multi-Scale Geometric Features",
            "Publication year": 2015,
            "Publication url": "https://www.scitepress.org/papers/2015/52257/52257.pdf",
            "Abstract": "In this paper we present a novel generic method for the fast and accurate computation of geometric features at multiple scales. The presented method works on arbitrarily complex models and operates in the parametric space. The majority of the existing methods compute local features directly on the geometric representation of the model. Our approach decouples the computational complexity from the underlying geometry and in contrast to other parametric space methods, it is not restricted to a specific feature or parameterization of the surface. We show that the method performs accurately and at interactive rates, even for large feature areas of support, rendering the method suitable for animated shapes.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:QUX0mv85b1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual reality systems and applications: the ancient olympic games",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_15",
            "Abstract": "This paper presents the virtual reality systems, interaction devices and software used at the Foundation of the Hellenic World (FHW). The applications that FHW has produced, associated with the Olympic Games in ancient Greece, are then detailed. The separate virtual reality shows are presented in terms of interactivity and educational value. Technical aspects of the productions are explained, with an emphasis on surround screen projection environments. These techniques were mostly utilized in the recent production regarding the ancient Olympic Games, where much effort has been made to recreate the feeling of the games and help the user/spectator be an interacting part of the edutainment activity.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Volume-based Diffuse Global Illumination",
            "Publication year": 2010,
            "Publication url": "http://www.virtuality.gr/Papers/CGVCVIP-2010/CGVCVIP-2010optimized.pdf",
            "Abstract": "In this paper we present a novel real-time algorithm to compute the global illumination of scenes with dynamic geometry and arbitrarily complex dynamic illumination. We use a virtual point light (VPL) illumination model on the volume representation of the scene. Light is propagated in void space using an iterative diffusion approach. Unlike other dynamic VPL-based real-time approaches, our method handles occlusion (shadowing and masking) caused by the interference of geometry and is able to estimate diffuse inter-reflections from multiple light bounces.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting multiresolution models to accelerate ray tracing",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0097849302002479",
            "Abstract": "In this paper, it is shown how multiresolution models can be exploited in order to improve the efficiency of the ray tracing process without significant image deterioration. To this effect a set of criteria are established which determine the level of detail model that should be used for each ray–object intersection. These criteria include the distance from the observer and the amount of distortion to which a ray has been subjected before hitting the object. The resulting images are indistinguishable to the naked eye from those obtained using the maximum resolution models but require significantly less time to compute. Our method can be used in conjunction with previous ray tracing acceleration methods.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "A Generic Physically-based Approach to the Opening Design Problem",
            "Publication year": 2016,
            "Publication url": "https://diglib.eg.org/handle/10.2312/egsh20161017",
            "Abstract": "Today architectural design harnesses photorealistic rendering to accurately assess energy transport for the design of energyefficient buildings. In this context, we present an automatic physically-based solution to the opening design problem, i.e. the goal-driven process of defining openings on the input geometry given a set of lighting constraints, to better exploit natural daylight. Based on a hierarchical approach that combines a linear optimization strategy and a genetic algorithm, our method computes the optimal number, position, size and shape of openings, using a path tracing-based estimator to precisely model the light transport for arbitrary materials and geometry. The method quickly converges to an opening configuration that optimally approximates the desired illumination, with no special geometry editing requirements and the ability to trade quality for performance for interactive applications. We validate our …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:EsEWqaRxkBgC",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Illumination-driven Light Probe Placement",
            "Publication year": 2021,
            "Publication url": "https://diglib.eg.org/bitstream/handle/10.2312/egp20211026/003-004.pdf?sequence=1&isAllowed=y",
            "Abstract": "We introduce a simplification method for light probe configurations that preserves the indirect illumination distribution in scenes with diverse lighting conditions. An iterative graph simplification algorithm discards the probes that, according to a set of evaluation points, have the least impact on the global light field. Our approach is simple, generic and aims at improving the repetitive and often non-intuitive and tedious task of placing light probes on complex virtual environments. CCS Concepts",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:wLxue7F8ec0C",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Efficient occlusion culling using solid occluders",
            "Publication year": 2006,
            "Publication url": "https://dspace5.zcu.cz/handle/11025/6658",
            "Abstract": "Occlusion culling is a genre of algorithms for rapidly eliminating portions of three-dimensional geometry hidden behind other, visible objects prior to passing them to the rendering pipeline. In this paper, an extension to the popular shadow frustum culling algorithm is presented, which takes into account the fact that many planar occluders can be grouped into compound convex solids, which in turn can provide fewer and larger culling frusta and therefore more efficient elimination of hidden geometry. The proposed method combines planar and solid occluders using a unified selection approach and is ideal for dynamic environments, as it doesn’t depend on precalculated visibility data. The solid occluders culling algorithm has been applied to commercially deployed virtual reality systems and test cases and results are provided from actual virtual reality shows.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Václav Skala-UNION Agency"
        },
        {
            "Title": "Improving k-buffer Methods via Occupancy Maps.",
            "Publication year": 2015,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/egsh.20151017.069-072/069-072.pdf?sequence=1&isAllowed=y",
            "Abstract": "In this work, we investigate an efficient approach to treat fragment racing when computing k-nearest fragments. Based on the observation that knowing the depth position of the k-th fragment we can optimally find the k-closest fragments, we introduce a novel fragment culling component by employing occupancy maps. Without any softwareredesign, the proposed scheme can easily be attached at any k-buffer pipeline to efficiently perform early-z culling. Finally, we report on the efficiency, memory space, and robustness of the upgraded k-buffer alternatives providing comprehensive comparison results.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:EPG8bYD4jVwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Inverse lighting design using a coverage optimization strategy",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-016-1237-9",
            "Abstract": "Lighting design is an essential process in computer cinematography, games, architectural design and various other applications for correctly illuminating or highlighting parts of a scene and enhancing storytelling. When targeting specific illumination goals and constraints, this process can be tedious and counter-intuitive even for experienced users and thus automatic, goal-driven methods have emerged for the estimation of a lighting configuration to match the desired result. We present a general automatic approach to such an inverse lighting design problem, where the number of light sources along with their position and emittance are computed given a set of user-specified lighting goals. To this end, we employ a special hierarchical light clustering that operates in the lighting goal coverage domain and overcomes limitations of previous approaches in environments with high occlusion or structural …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:UuEBAcK4md4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Predictive digitisation of cultural heritage objects",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-017-4928-y",
            "Abstract": "3D digitisation has been instrumental in the cultural heritage domain for over a decade, contributing to the digital preservation and dissemination of cultural heritage. Still, the typical 3D acquisition workflow remains complex and time-consuming. This work presents the concept of predictive digitisation by means of a platform, aiming to speed-up and simplify 3D digitisation, exploiting similarities in digital repositories of Cultural Heritage objects.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:UmS_249rOGwC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Texture compression using wavelet decomposition: a preview",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2159616.2159664",
            "Abstract": "We present a new fixed-rate texture compression scheme based on the energy compaction properties of the Discrete Wavelet Transform. Targeting existing commodity graphics hardware and APIs, our method is using the DXT compression formats to perform the quantization and storage of the wavelet transform coefficients, ensuring very fast decoding speeds. An optimization framework minimizes the quantization error of the coefficients and improves the overall compression quality. Our method provides a variety of low bitrate encoding modes for the compression of grayscale and color textures. These encoding modes offer either improved quality or reduced storage over the DXT1 format. Furthermore, anisotropic texture filtering is performed efficiently with the help of the native texture hardware. The decoding speed and the simplicity of the implementation make our approach well suited for use in games and other …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Rayground: An Online Educational Tool for Ray Tracing.",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Vasilakis/publication/341827905_Rayground_An_Online_Educational_Tool_for_Ray_Tracing/links/5ed65bba45851529452849b5/Rayground-An-Online-Educational-Tool-for-Ray-Tracing.pdf",
            "Abstract": "In this paper, we present Rayground; an online, interactive education tool for richer in-class teaching and gradual self-study, which provides a convenient introduction into practical ray tracing through a standard shader-based programming interface. Setting up a basic ray tracing framework via modern graphics APIs, such as DirectX 12 and Vulkan, results in complex and verbose code that can be intimidating even for very competent students. On the other hand, Rayground aims to demystify ray tracing fundamentals, by providing a well-defined WebGL-based programmable graphics pipeline of configurable distinct ray tracing stages coupled with a simple scene description format. An extensive discussion is further offered describing how both undergraduate and postgraduate computer graphics theoretical lectures and laboratory sessions can be enhanced by our work, to achieve a broad understanding of the …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:4aZ_i-5WJEQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PU learning-based recognition of structural elements in architectural floor plans",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s11042-020-10295-9",
            "Abstract": "This work introduces a computational method for the recognition of structural elements in architectural floor plans. The proposed method requires minimal user interaction and is capable of effectively analysing floor plans in order to identify different types of structural elements in various notation styles. It employs feature extraction based on Haar kernels and PU learning, in order to retrieve image regions, which are similar to a user-defined query. Most importantly, apart from this user-defined query, the proposed method is not dependent on learning from labelled samples. Therefore, there is no need for laborious annotations to form large datasets in various notation styles. The experimental evaluation has been performed on a publicly available and diverse dataset of floor plans. The results show that the proposed method outperforms a state-of-the-art method, with respect to retrieval accuracy. Further experiments …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:t-hv7AR41mYC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Realistic real-time underwater caustics and godrays",
            "Publication year": 2009,
            "Publication url": "https://www.graphicon.ru/html/2009/conference/se5/29/29_Paper.pdf",
            "Abstract": "Realistic rendering of underwater scenes has been a subject of increasing importance in modern real-time 3D applications, such as open-world 3D games, which constantly present the user with opportunities to submerge oneself in an underwater environment. Crucial to the accurate recreation of these environments are the effects of caustics and godrays. In this paper, we shall present a novel algorithm, for physically inspired real-time simulation of these phenomena, on commodity 3D graphics hardware, which can easily be integrated in a modern 3D engine.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Variable k-buffer using Importance Maps.",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Vasilakis/publication/316602372_Variable_k-buffer_using_Importance_Maps/links/590722bea6fdccd580d4888a/Variable-k-buffer-using-Importance-Maps.pdf",
            "Abstract": "Successfully predicting visual attention can significantly improve many aspects of computer graphics and games. Despite the thorough investigation in this area, selective rendering has not addressed so far fragment visibility determination problems. To this end, we present the first “selective multi-fragment rendering” solution that alters the classic k-buffer construction procedure from a fixed-k to a variable-k per-pixel fragment allocation guided by an importance-driven model. Given a fixed memory budget, the idea is to allocate more fragment layers in parts of the image that need them most or contribute more significantly to the visual result. An importance map, dynamically estimated per frame based on several criteria, is used for the distribution of the fragment layers across the image. We illustrate the effectiveness and quality superiority of our approach in comparison to previous methods when performing order-independent transparency rendering in various, high depth-complexity, scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:SIv7DqKytYAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient 3D Object Retrieval Using Depth Images",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=3406397151978787201&hl=en&oi=scholarr",
            "Abstract": "In this paper, we present a new three-dimensional object retrieval method. This method employs depth buffers for representing and comparing the objects. Specifically, multiple depth buffers per object (computed from different points of view) are compared for surface and volume similarity. Our method is easily extensible for hi-erarchical comparisons at multiple resolutions and is highly parallelizable. We have employed this method for both inter-class and intra-class retrieval tasks on a gallery of over 3,000 three-dimensional objects of vehicles with very encouraging results. The accuracy of the method depends on the number of depth buffers and the depth buffer resolution.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:BmWJbWwHJAwC",
            "Publisher": "Association for Computing Machinery (ACM)"
        },
        {
            "Title": "Real-time radiance caching using chrominance compression",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.675.5338&rep=rep1&type=pdf",
            "Abstract": "This paper introduces the idea of expressing the radiance field in luminance/chrominance values and encoding the directional chrominance in lower detail. Reducing the spherical harmonics coefficients for the chrominance components allows the storage of luminance in higher order spherical harmonics in the same memory budget resulting in finer representation of intensity transitions. We combine the radiance field chrominance compression with an optimized cache population scheme, by generating cache points only at locations, which are guaranteed to contribute to the reconstructed surface irradiance. These computation and storage savings allow the use of higher-order spherical harmonics representation to sufficiently capture and reconstruct the directionality of diffuse irradiance, while maintaining fast and customizable performance. We exploit this radiance representation in a low-cost real-time radiance caching scheme, with support for arbitrary light bounces and view-independent indirect occlusion and showcase the improvements in highly complex and dynamic environments. Furthermore, our general qualitative evaluation indicates benefits for offline rendering application as well.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:IsPWOBWtZBwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Media productions for a dome display system",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1180495.1180548",
            "Abstract": "As the interest of the public for new forms of media grows, museums and theme parks select real time Virtual Reality productions as their presentation medium. Based on three-dimensional graphics, interaction, sound, music and intense story telling they mesmerize their audiences. The Foundation of the Hellenic World (FHW) having opened so far to the public three different Virtual Reality theaters, is in the process of building a new Dome-shaped Virtual Reality theatre with a capacity of 130 people. This fully interactive theatre will present new experiences in immersion to the visitors. In this paper we present the challenges encountered in developing productions for such a large spherical display system as well as building the underlying real-time display and support systems.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:IjCSPb-OGe4C",
            "Publisher": "ACM"
        },
        {
            "Title": "A simple and fast technique for fur rendering",
            "Publication year": 2002,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Papaioannou-3/publication/245063770_A_Simple_and_Fast_Technique_for_Fur_Rendering/links/56a5f5ad08aeef24c58da7f3/A-Simple-and-Fast-Technique-for-Fur-Rendering.pdf",
            "Abstract": "Recently an effective technique has been introduced in graphics bibliography for simulating and rendering properly shaded fur, grass or similar textures using multiple layers of concentric textures. This paper is a guide to simple step-by-step modeling of furry objects with shadows that can be directly implemented either in standard rendering software or in rendering APIs for real time applications, without requiring specialized graphics hardware.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Technical report, University of Athens"
        },
        {
            "Title": "Multi-scale 3D Digitization at Nidaros Cathedral: From Archiving to Large-scale Visualization",
            "Publication year": 2013,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:oi2SiIJ9l4AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Practical Elliptical Texture Filtering on the GPU",
            "Publication year": 2018,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781351261524-10/practical-elliptical-texture-filtering-gpu-pavlos-mavridis-georgios-papaioannou",
            "Abstract": "In this chapter, the authors present a series of simple and effective methods to perform high quality texture filtering on modern Graphics Processing Units (GPU). They provide an overview of the theory behind texture filtering and the elliptical weighted average (EWA) filter. Hardware texture filtering, even on state-of-the-art graphics hardware, suffers from several aliasing artifacts, in both the spatial and temporal domain. The authors deals with an approximation of the EWA filter that uses the underlying anisotropic filtering hardware of the GPU to construct a filter that closely matches the shape and the properties of the EWA filter, offering vast improvements in the quality of the texture mapping. The authors argues that certain characteristics make their method practical for use in games and other interactive applications, as well as applications that require increased fidelity in texture mapping, like GPU ren-derers and …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "AK Peters/CRC Press"
        },
        {
            "Title": "Interactive dynamics for large virtual reality applications",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_29",
            "Abstract": "Recent commercial virtual reality shows have become very demanding in terms of interactive credibility and visual realism. In an effort to push further the immersive quality and the sense of ’being there’ in the most recent VR production of the Foundation of the Hellenic World “A Walk through Ancient Olympia”, the user, apart from virtually visiting the historical site, becomes an interacting part of the edutainment activity. Described in this paper is a new script-controlled generic dynamics system devised for heavy interactive VR applications and used in the above commercial production, which utilises the notion of force-fields and also simulates aerodynamic effects in a real-time, computationally efficient manner. The impact of the interactive dynamics system on the usability and virtual presence is also discussed, in the context of a fully immersive stereoscopic surround-screen virtual reality environment and a …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Stereo matching using optic flow",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077201498901413",
            "Abstract": "A method for the determination of pixel correspondence in stereo image pairs is presented. The optic flow vectors that result from the displacement of the point of projection are obtained and the correspondence between pixels of the various objects in the scene is derived from the optic flow vectors. The proposed algorithm is implemented and the correspondence vectors are obtained. Various specialized improvements of the method are implemented and thoroughly tested on sequences of image pairs giving rise to interesting conclusions. The algorithm is highly-parallelizable and therefore suitable for real-time applications.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:roLk4NBRz8UC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Global illumination using imperfect volumes",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/Papers/2011/33186/33186.pdf",
            "Abstract": "This paper introduces the concept of imperfect volumes, a fast one-pass point-based voxelization algorithm, and presents its applications to the global illumination problem. As often noted, diffuse indirect illumination has the characteristics of a low frequency function, consisting of smooth gradations. We exploit this by performing the indirect lighting computations on a rough approximation of the scene, the imperfect volume. The scene is converted on the fly to a dense point cloud, and each point is directly rendered to a volume texture, marking the corresponding voxel as occupied. A framebuffer reprojection scheme ensures that voxels visible to the main camera will get more points. Ray-marching is then used to compute the ambient occlusion or the indirect illumination of each voxel, and the results are stored using spherical harmonics. We demonstrate that the errors introduced by the imperfections in the volume are small and that our method maintains a high frame rate on scenes with high geometric complexity.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient sparse icp",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167839615000552",
            "Abstract": "The registration of two geometric surfaces is typically addressed using variants of the Iterative Closest Point (ICP) algorithm. The Sparse ICP method formulates the problem using sparsity-inducing norms, significantly improving the resilience of the registration process to large amounts of noise and outliers, but introduces a significant performance degradation. In this paper we first identify the reasons for this performance degradation and propose a hybrid optimization system that combines a Simulated Annealing search along with the standard Sparse ICP, in order to solve the underlying optimization problem more efficiently. We also provide several insights on how to further improve the overall efficiency by using a combination of approximate distance queries, parallel execution and uniform subsampling. The resulting method provides cumulative performance gain of more than one order of magnitude, as …",
            "Abstract entirety": 0,
            "Author pub id": "aZVSd0QAAAAJ:eO3_k5sD8BwC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Inverse Light Design for High-Occlusion Environments",
            "Publication year": 2015,
            "Publication url": "https://www.scitepress.org/Papers/2015/52914/52914.pdf",
            "Abstract": "Lighting design is a demanding but very important task in computer cinematography, games and architectural design. Computer-assisted lighting design aims at providing the designers with tools to describe the desired outcome and derive a suitable lighting configuration to match their goal. In this paper, we present an automatic approach to the inverse light source emittance and positioning problem, based on a layered linear/non-linear optimization strategy and the introduction of a special light source indexing according to the compatibility of each individual luminary position with the desired illumination. Our approach is independent of a particular light transport model and can quickly converge to an appropriate and plausible light configuration that approximates the desired illumination and can handle environments with high occlusion.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:kzcSZmkxUKAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Facet Extraction and Classification for the Reassembly of Fractured 3D Objects.",
            "Publication year": 2014,
            "Publication url": "http://graphics.cs.aueb.gr/graphics/docs/papers/eg2014_segmentation_poster.pdf",
            "Abstract": "The reassembly of fractured 3D objects is a critical problem in computational archaeology, and other application domains. An essential part of this problem is to distinguish the regions of the object that belong to the original surface from the fractured ones. A general strategy to solve this region classification problem is to first divide the surface of the object into distinct facets and then classify each one of them based on statistical properties. While many relevant algorithms have been previously proposed ([PKT01],[HFG∗ 06],[WW08]), a comparative evaluation of some well-known segmentation strategies, when used in the context of such a problem, is absent from the bibliography. In this poster we present our ongoing work on the evaluation of the performance and quality of segmentation algorithms when operating on fractured objects. We also present a novel method for the classification of the segmented regions to intact and fractured, based on their statistical properties.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:YsrPvlHIBpEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the automatic assemblage of arbitrary broken solid artefacts",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0262885603000088",
            "Abstract": "Presented here is a fast method that combines curve matching techniques with a surface matching algorithm to estimate the positioning and respective matching error for the joining of three-dimensional fragmented objects. Furthermore, this paper describes how multiple joints are evaluated and how the broken artefacts are clustered and transformed to form potential solutions of the assemblage problem.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Fast Radius Search Exploiting Ray-Tracing Frameworks",
            "Publication year": 2021,
            "Publication url": "http://jcgt.org/published/0010/01/02/paper-lowres.pdf",
            "Abstract": "Spatial queries to infer information from the neighborhood of a set of points are frequently performed in rendering and geometry-processing algorithms. Traditionally, these are accomplished using radius and k-nearest neighbors search operations, which utilize kd-trees and other specialized spatial data structures that fall short of delivering high performance. Recently, advances in ray-tracing performance, with respect to both acceleration data-structure construction and ray-traversal times, have resulted in a wide adoption of the ray-tracing paradigm for graphics-related tasks that spread beyond typical image synthesis. In this work, we propose an alternative formulation of the radius-search operation that maps the problem to the ray-tracing paradigm in order to take advantage of the available GPU-accelerated solutions for it. We demonstrate the performance gain relative to traditional spatial search methods, especially on dynamically updated sample sets, using two representative applications: geometry processing of point-wise operations on scanned point clouds and global illumination via progressive photon mapping.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:YTuZlYwrTOUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Automated Modeling Method For Multiple Detail Levels Of Real-time Trees",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5116553/",
            "Abstract": "Rendering realistic outdoor scenes in realtime applications is a difficult task to accomplish since the geometric complexity of the objects, and most notably of trees, is too high for current hardware to handle efficiently in large amounts.Our method generates trees with self-similarity, and later exploits this property by heavily sharing pre-rendered textures of similar parts of the tree. The intrinsic tree hierarchy of the trees, combined with their self-similarity, allows generation of multiple levels of detail. Here we present the flow of the processing stage, from the collection of the required input data until the export of the models in all their levels of detail as well as related and additional data.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Texture compression using wavelet decomposition",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1467-8659.2012.03203.x",
            "Abstract": "In this paper we introduce a new fixed‐rate texture compression scheme based on the energy compaction properties of a modified Haar transform. The coefficients of this transform are quantized and stored using standard block compression methods, such as DXTC and BC7, ensuring simple implementation and very fast decoding speeds. Furthermore, coefficients with the highest contribution to the final image are quantized with higher accuracy, improving the overall compression quality. The proposed modifications to the standard Haar transform, along with a number of additional optimizations, improve the coefficient quantization and reduce the compression error. The resulting method offers more flexibility than the currently available texture compression formats, providing a variety of additional low bitrate encoding modes for the compression of grayscale and color textures.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:-f6ydRqryjwC",
            "Publisher": "Blackwell Publishing Ltd"
        },
        {
            "Title": "Virtual reality systems and applications",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/50869127/Virtual_reality_systems_and_applications20161213-26383-rb63f2.pdf",
            "Abstract": "As the interest of the public for new forms of media grows, museums and theme parks select real time Virtual Reality productions as their presentation medium. Based on threedimensional graphics, interaction, sound, music and intense story telling they mesmerize their audiences. The Foundation of the Hellenic World (FHW) having opened so far to the public three different Virtual Reality theaters, is in the process of building a new Dome-shaped Virtual Reality theatre with a capacity of 130 people. This fully interactive theatre will present new experiences in immersion to the visitors. In this paper we present the challenges encountered in developing productions for such a large spherical display system as well as building the underlying realtime display and support systems.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Two Simple Single-pass GPU methods for Multi-channel Surface Voxelization of Dynamic Scenes",
            "Publication year": 2011,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.719.428&rep=rep1&type=pdf",
            "Abstract": "An increasing number of rendering and geometry processing algorithms relies on volume data to calculate anything from effects like smoke/fluid simulations, visibility information or global illumination effects. We present two real-time and simple-to-implement novel surface voxelization algorithms and a volume data caching structure, the Volume Buffer, which encapsulates functionality, storage and access similar to a frame buffer object, but for threedimensional scalar data. The Volume Buffer can rasterize primitives in 3d space and accumulate up to 1024 bits of arbitrary data per voxel, as required by the specific application. The strength of our methods is the simplicity of the implementation resulting in fast computation times and very easy integration with existing frameworks and rendering engines.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:_kc_bZDykSQC",
            "Publisher": "The Eurographics Association"
        },
        {
            "Title": "Detail highlighting using a shadow edge histogram",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.2312/egsh.20171017",
            "Abstract": "In this paper we propose a simple and effective technique for setting up a configuration of directional light sources to accentuate the prominent geometric features of complex objects by increasing the local shadow contrast near them. Practical applications of such a task are encountered among others in professional photography, and cinematography. The method itself, which is based on a voting mechanism, quickly produces consistent and view-independent results, with minimal user intervention.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:c1e4I3QdEKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Light optimization for detail highlighting",
            "Publication year": 2018,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1111/cgf.13545",
            "Abstract": "In this paper we propose an effective technique for the automatic arrangement of spot lights and other luminaires on or near user‐provided arbitrary mounting surfaces in order to highlight the geometric details of complex objects. Since potential applications include the lighting design for exhibitions and similar installations, the method takes into account obstructing geometry and potential occlusion from visitors and other non‐permanent blocking geometry. Our technique generates the most appropriate position and orientation for light sources based on a local contrast maximization near salient geometric features and a clustering mechanism, producing consistent and view‐independent results, with minimal user intervention. We validate our method with realistic test cases including multiple and disjoint exhibits as well as high occlusion scenarios.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:X9ykpCP0fEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual archaeologist: Assembling the past",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/909015/",
            "Abstract": "We present a complete method, encapsulated in our Virtual Archaeologist system, for the full reconstruction of archaeological finds from 3D scanned fragments. Virtual Archaeologist is designed to assist archaeologists in reconstructing monuments or smaller finds by avoiding unnecessary manual experimentation with fragile and often heavy fragments. An automated procedure cannot completely replace the archaeology expert, but provides a useful estimation of valid fragment combinations, and accurately measures fragment matches. In Virtual Archaeologist, we regard the reconstruction problem from a general, geometric point of view, relying on the broken surface morphology to determine correct matches between fragments.",
            "Abstract entirety": 1,
            "Author pub id": "aZVSd0QAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        }
    ]
}]