[{
    "name": "Γεώργιος Σταμούλης",
    "romanize name": "Georgios Stamoulis",
    "School-Department": "Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών",
    "University": "uth",
    "Rank": "Καθηγητής",
    "Apella_id": 3733,
    "Scholar name": "George Stamoulis",
    "Scholar id": "5uRFCLsAAAAJ",
    "Affiliation": "Professor of Electrical and Computer Engineering, University of Thessaly",
    "Citedby": 1523,
    "Interests": [
        "Low Power Design Techniques",
        "CAD Tools for IC analysis and Design",
        "Smart Grids",
        "Wireless Sensor Networks",
        "Optimization Algorithm"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=5uRFCLsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Transferring Structured Data and applying business processes in remote Vessel’s environments using the\" InfoNet\" Platform",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8544918/",
            "Abstract": "The purpose of this paper is a presentation of a fully implemented platform (InfoNet), that has been installed in more than 120 Vessels. The described platform serves and facilitates the structured data transferring between the Operational Vessel's unstable environment and the Office one. In addition, it can apply business processes not only to office side but also to Vessel's remote environment. \"InfoNet\" platform is multipurpose and can interface with multiple components and modules of any ERP, CRM or other structured platform that the organization uses in both sides (vessels and/or Office). We are using the \"InfoNet\" platform for various implementations. The platform is composed of two main modules, e-Forms (e-Applications) and e-SMS (e-Documents). All gathered data, apart the operation usage, have been also used for further analysis. We have used the produced information of the above data in combination …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gate Delay Estimation With Library Compatible Current Source Models and Effective Capacitance",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9382263/",
            "Abstract": "As process geometries shrink below 45 nm, accurate and efficient gate-level timing analysis becomes even more challenging. Modern VLSI interconnects are more resistive, signals no longer resemble saturated ramps, and gate input pins exhibit a significant Miller effect. Over recent years, the semiconductor industry has adopted current source models (CSMs) for accurate gate modeling. Industrial gate models, however, are precharacterized assuming capacitive loads, which poses significant challenges to the approximation of the highly resistive load interconnect with an effective capacitance (   ). In fact, most related works are either computationally expensive or unable to approximate the output slew. Furthermore, they require additional precharacterization and ignore the Miller effect. In this article, we present an iterative methodology for fast and accurate gate delay estimation. The proposed approach accurately …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Differences in dyslexic students before and after a remediation program: A clinical neuropsychological and event related potential study",
            "Publication year": 2018,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/21622965.2017.1297710",
            "Abstract": "Developmental dyslexia is defined as an unexpected specific and persistent failure to acquire efficient reading skills despite conventional instruction, adequate intelligence and sociocultural opportunity. This article reports the outcomes of a study that evaluated the implementation of a 4-month intervention program. The intervention consisted of structured activities aiming at improving (a) the children’s phonological awareness, (b) their visual and auditory memory, (c) their visual discrimination ability, and (d) their text comprehension. Participants were 12 children diagnosed as dyslexic matched with 12 typically achieving peers of similar age and gender. Baseline assessment consisted of a clinical neuropsychological battery of tests and Event Related Potentials (ERPs) and resulted in confirming the discrepancy between the dyslexic and the control group. Following the remediation program, the dyslexic group did …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:UxriW0iASnsC",
            "Publisher": "Psychology Press"
        },
        {
            "Title": "Energy-aware joint power, packet and topology optimization by simulated annealing for WSNs",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6705741/",
            "Abstract": "Energy-aware connectivity in wireless sensor networks (WSNs) can increase their network lifetime. This can be achieved by optimizing the power control, a particular communication mechanism and the topology control. To this end, in this paper', an energy-aware joint power, packet and topology optimization for WSNs is provided. More specifically, we assume power control based on feedback information, packet transmission through automatic-repeat-request(ARQ) mechanism and topology control assuming specific coverage constraints. This particular joint optimization problem is considered as NP-complete and heuristic methods are usually applied in such complicated cases. In particular, we employ Simulated Annealing (SA) for a step-by-step evaluation of the average energy consumption of sensor nodes, which is considered the objective function of our optimization problem. In each step of the SA algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CARROT–A Tool for Fast and Accurate Soft Error Rate Estimation",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11796435_34",
            "Abstract": "We present a soft error rate (SER) analysis methodology within a simulation and design environment that covers a broad spectrum of design problems and parameters. Our approach includes modeling of the particle hit at the transistor level, fast Monte-Carlo type simulation to obtain the latching probability of a particle hit on all nodes of the circuit, embedded timing analysis to obtain the latching window, and fine-grained accounting of the electrical masking effects to account for both the effects of scaling and of pulse duration versus the period of the system clock to get an estimate of the maximum SER of the circuit. This approach has been implemented in CARROT and placed under a broad design environment to assess design tradeoffs with SER as a parameter.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Double hit viral parasitism, polymicrobial CNS residency and perturbed proteostasis in Alzheimer’s disease: a data driven, in silico analysis of gene expression data",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016158902030465X",
            "Abstract": "The aim of this study was to determine the interaction of peripheral immunity vs. the CNS in the setting of AD pathogenesis at the transcriptomic level in a data driven manner. For this purpose, publicly available gene expression data from the GEO Datasets repository. We performed differential gene expression and functional enrichment analyses were performed on the five retrieved studies: (a) three hippocampal cortex (HC) studies (b) one study of peripheral blood mononuclear cells (PBMC) and (c) one involving neurofibrillary tangle – containing neurons of the entorhinal cortex (NFT EC). Subsequently, BLAST was used to determine protein conservation between human proteins vs. microbial, whereas putative protein / oligopeptide antigenicity were determined via RANKPep. Gene ontology and pathway analyses revealed significantly enriched viral parasitism pathways in both PBMC and NFT – EC datasets …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:vbGhcppDl1QC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Data replication and virtual machine migrations to mitigate network overhead in edge computing systems",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7949154/",
            "Abstract": "Several virtual machine (VM) placement algorithms have been proposed and studied in the literature with various scopes such as server consolidation or network cost minimization. In most cases, decisions on VM migrations are taken without factoring in directly the data access cost by VMs. In this paper, we investigate the use of data replication in conjunction with the VM assignment problem and target on developing algorithms that decide both on which data should be replicated where and which VM must be migrated so as to minimize the network overhead among traditional cloud and mobile cloud systems. We discuss both the un-capacitated case and the more realistic case whereby datacenters (for the traditional cloud case) and micro-datacenters (for the mobile cloud case) have limited storage and computing capacity. We propose an algorithm based on hyper-graph partitioning to solve the aforementioned …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Screening for Disorders of Mathematics via a web application",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942893/",
            "Abstract": "Dyscalculia is a neurodevelopmental disorder that affects the ability of a child to learn arithmetic. Dyscalculia appears despite normal intelligence, proper schooling, adequate environment, socioeconomic status and motivation. The first aim of the present research protocol was to construct a battery of tests that can be delivered by computer in order to screen children's arithmetic skills. Our second aim was to develop a Web application screener for dyscalculia that assesses children aged from 8-11 years old and that, to the best of our knowledge, does not exist. The hypothesis of the present study was that Greek students that are already diagnosed by paper-and-pencil tests as dyscalculic, will present lower performance and higher time latencies in the tasks of the aforementioned Web application screener. A total of sixty, right handed children (30 male and 30 female, age range 8-11 years old) participated in this …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low-power CMOS-VLSI circuit for signal conditioning in integrated capacitive sensors",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1426136/",
            "Abstract": "Capacitive sensor manufacturing processes are rarely compatible with CMOS technologies and, thus, monolithic integration of sensing device and signal-conditioning IC is often not possible. Multi-chip packaging and wire bonding is employed instead, to interconnect sensor and IC dies. In such cases, sensor capacitance is comparable or even smaller than the parasitic interconnection capacitance, while interconnection parasitic resistance inserts additional signal distortion. The signal-conditioning IC must be designed to compensate for these parasitic effects. Switched-capacitor ICs may fulfil such specifications but the use of several operational amplifiers and intricate clocking schemes increase design complexity, die-size, and power consumption, which is inappropriate for wireless applications. In this work a low-power switched-capacitor IC for sub-fF capacitance measurements is presented. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "www. sensorsportal. com ISSN 1726-5479",
            "Publication year": 2011,
            "Publication url": "https://search.proquest.com/openview/16e5263c5f346900f61b3ec8f13bc0d9/1?pq-origsite=gscholar&cbl=52938",
            "Abstract": "Contents Page 1 Sensors & Transducers Journal Contents Volume 127 Issue 4 April 2011 \nwww.sensorsportal.com ISSN 1726-5479 Research Articles Going Fabless with MEMS \nBhaskar Choubey ............................................................................................................................... 1 \nMicromachined Polycrystalline Si Thermopiles in a T-shirt Vladimir Leonov, Yvonne van \nAndel, Ziyang Wang, Ruud JM Vullers and Chris Van Hoof........... 15 Virtual Fabrication of \nSilicon Nitride Based Multifunctional MEMS Pressure Sensor Mahesh Kumar Patankar.................................................................................................................... \n27 General Development of a New Hall Effect Sensor Vlassis N. Petoussis, Panos D. \nDimitropoulos, George Stamoulis.................................................... 36 Inspection of Pipe Inner \nSurface using Advanced Pipe Crawler Robot with PVDF Sensor based Rotating Probe \nVimal Agarwal, Harutoshi Ogai, Kentarou Nishijima and ..............…",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:LPZeul_q3PIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Multiple Transient Faults in Combinational Logic with Placement Considerations",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8741538/",
            "Abstract": "Integrated circuit susceptibility to radiation-induced faults remains a major reliability concern. The continuous downscaling of device feature size and the reduction in supply voltage in CMOS technology tend to worsen the problem. Thus, the evaluation of Soft Error Rate (SER) in the presence of multiple transient faults is necessary, since it remains an open research field. This tool is based on Monte-Carlo simulations and, in combination with the implementation of the masking mechanisms and the consideration of placement information, provides an accurate SER estimation.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wireless sensor networks: Business models and market issues",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4389893/",
            "Abstract": "Networks of sensors are continuously gaining ground in all types of industry applications and are believed to be evolving in a way similar to the evolution of the first interconnected computer systems into what we call today the Internet. A heterogeneous infrastructure is thus about to emerge as a dense web of rich information sources that will transform the World Wide Web into what has been called the \"Real World Web\" (RWW). The authors hereby assimilate the impact of this transformation process, the actors involved, the operational and business models associated with it.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploiting Extended Krylov Subspace for the Reduction of Regular and Singular Circuit Models",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9371552/",
            "Abstract": "During the past decade, Model Order Reduction (MOR) has become key enabler for the efficient simulation of large circuit models. MOR techniques based on moment-matching are well established due to their simplicity and computational performance in the reduction process. However, moment-matching methods based on the ordinary Krylov subspace are usually inadequate to accurately approximate the original circuit behaviour. In this paper, we present a moment-matching method which is based on the extended Krylov subspace and exploits the superposition property in order to deal with many terminals. The proposed method can handle large-scale regular and singular circuits, and generate accurate and efficient reduced-order models for circuit simulation. Experimental results on industrial IBM power grid benchmarks demonstrate that our method achieves an error reduction up to 83.69% over a standard …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Customizable Wireless Sensor System for Estimating and Transmitting Human Stress Levels Biosignals with IoT Platform",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Apostolis-Xenakis/publication/342866438_Mobility_Tracking_Signalling_Optimisation_in_Mobile_Networks/links/5f107dae92851c1eff15c209/Mobility-Tracking-Signalling-Optimisation-in-Mobile-Networks.pdf",
            "Abstract": "Stress is a natural reaction of our body when we are facing new emotions and demanding tasks at our daily lives. Anxiety further enhances the feeling of fear. In addition, anxiety is caused due to a stimulus that makes people feeling weak, because of an overall insecurity regarding what is going to happen. The difference between stress and anxiety lies in the fact that stress is an internal emotion as opposed to external psycho-compressive factors that constitute stress (ie such as a loss of a beloved person, a natural disaster, pressure in working conditions etc.). In this paper, we design, propose and test a wireless sensor system for measuring and transmitting biometric magnitudes of heart rate and blood oximetry. Parts of our system can be easily attached to a set of persons, who take part in an experimental process of controlled stress and anxiety environment and record stress biosignals. Our system is based on a lightweight customized 802.15. 4 wireless protocol design, able to guarantee energy efficiency of our testbed.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:XD-gHx7UXLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cross-layer energy-aware topology control through Simulated Annealing for WSNs",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790616300313",
            "Abstract": "In this paper, we optimize the energy consumption and node placements of a wireless sensor network (WSN) using Simulated Annealing (SA). We propose an energy-aware optimization of the power control, the packet transmission and the topology control in WSNs. An optimization problem of minimizing the energy consumption, which incorporates the power control, the packet transmission through error correcting codes (ECC) and the topology control fulfilling specific coverage constraints, is formulated. The considered joint optimization problem is proved NP-complete and for that reason a heuristic method based on SA is applied. By applying SA algorithm, an updated topology is evaluated at any convergence point and thus a near-optimal transmit power and packet length, in conjunction with node placements is achieved jointly. Our results confirm that the proposed near optimal topology deployment proposed …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:_xSYboBqXhAC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Adaptive Operation-Based ALU and FPU Clocking",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9200282/",
            "Abstract": "The operating clock period in modern circuits is designated under worst-case operating conditions, in order to ensure error free functionality. To accomplish this goal, designers take into account the timing of the circuit critical path that provides an upper limit for the clock rate. However, that limit imposes heavy performance penalties on the design, since the critical path is not frequently excited during runtime. In contrast with the prevailing methodology, the better-thanworst-case (BTWC) paradigm treats the circuit timing requirements in a more flexible way, as it does not commit to serve the demands of the worst-case scenario. In this work we develop a novel timing analysis methodology inspired by the BTWC approach. Instead of performing the standard critical path analysis, we focus on analyzing the timing requirements of each operation separately. In the sequel we specify an adaptive clock period that is derived …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Sparsification of the Reluctance Matrix in RLCk Circuit Transient Analysis",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8434875/",
            "Abstract": "The ever increasing frequency scaling of contemporary very large scale integrated circuits has introduced the necessity to factor in signal integrity the analysis of inductive effects arising within the different blocks of an IC. The efficient simulation of the inductive effects requires sparsification of the dense inductance matrix, or its inverse (called reluctance matrix) which is diagonally dominant and more amenable to sparsification. However, direct truncation of matrix entries below a certain threshold introduces unacceptable error in transient analysis for the high sparsity ratios we are interested in. In this paper, we present a graph sparsification algorithm that preserves the eigenvalues of the reluctance matrix and results to sparse approximations that offer better and bounded accuracy in transient analysis. Experimental results indicate that sparsity ratios over 99% can be attained with a negligible error in transient analysis.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "System and method for fast power grid and substrate noise simulation",
            "Publication year": 2012,
            "Publication url": "https://patents.google.com/patent/US20120016652A1/en",
            "Abstract": "Systems and methods related to fast simulation of power supply networks and identification of a set of extrema (eg, maxima or minima) waveforms associated with the power supply networks. In accordance with an embodiment, a method is provided for simulating an electrical circuit, comprising preselecting an input vector file, initializing a supply voltage to a fixed value, performing event driven simulation using the input vector file, so as to extract time-varying power supply current waveforms at a plurality of power grid points. The method also comprises simulating a power grid using a linear network simulator or other SPICE type simulation tool, so as to derive time-varying voltage waveforms from the current waveforms for each point on the power grid. The method further comprises comparing current and/or voltage waveforms with a previous simulation; and repeating the above steps from event driven simulation …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient Linear System Solution Techniques in the Simulation of Large Dense Mutually Inductive Circuits",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8988760/",
            "Abstract": "The verification of integrated Circuits (ICs) in deep submicron technologies requires that all mutual inductive effects are taken into account to properly validate the performance and reliable operation of the chip. However, the inclusion of all mutual inductive couplings results in a fully dense inductance matrix that renders the circuit simulation computationally prohibitive. In this paper, we present efficient techniques for the solution of the linear systems arising in transient analysis of large mutually inductive circuits. These techniques involve the compression of the dense inductance matrix block by low-rank products in hierarchical matrix format, as well as the development of a Schur-complement preconditioner for the iterative solution of the transient linear system (which comprises sparse blocks alongside the dense inductance block). Experimental results indicate that substantial compression rates of the inductance …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimum weighted clustering algorithm for wireless sensor networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801999",
            "Abstract": "Extending network lifetime is a primary design objective for a wireless sensor network (WSN). Efficient clustering among sensor nodes seems a promising solution to evenly balance energy consumption and thus extend node and network lifetime. One of the most dominant clustering algorithms for energy efficient cluster formation is LEACH, because it balances node energy consumption. However, stochastic cluster head election of LEACH poses problems. In this paper, we propose a new clustering algorithm, named Minimum Weighted Clustering Algorithm (MWCLA) and compare its effectiveness with LEACH. MWCLA functions as follows: 1) Selects cluster heads based on cost criterion and quantifies the suitability of candidate cluster head by applying weights and 2) Rotates cluster head roles among nodes in a deterministic way, based on residual energy levels. In our simulations, we compare MWCLA with …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhanced Tetris Legalization",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2984393.2984410",
            "Abstract": "Legalization and detailed placement methods for standard cell designs, are two of the most notable topics in current VLSI research. Being the final steps in a classic placement procedure they must be efficient in terms of the delay overhead they introduce to the overall design flow and the quality of the final solution. In this paper we present a combined solution of the aforementioned steps, based on Tetris a particular simple and fast legalization algorithm, that produces considerable results taking into account the tradeoff between total wirelength, total cell displacement and runtime.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent design and algorithms to control a stereoscopic camera on a robotic workspace",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Christos-Drosos-2/publication/317609683_Intelligent_Design_and_Algorithms_to_Control_a_Stereoscopic_Camera_on_a_Robotic_Workspace/links/5a818ec2a6fdcc0d4badaa1f/Intelligent-Design-and-Algorithms-to-Control-a-Stereoscopic-Camera-on-a-Robotic-Workspace.pdf",
            "Abstract": "As a result of the increasingly demands in modern industry, the development of robotic systems with greater flexibility between processes and lower human factor modification and intervention requirements, were necessary. The visual control technology simplifies the process of calibration of a robot with the assistance of visual feedback. The visual inspection of a robot includes the use of industrial cameras and a computer vision system to control its position relative to the work piece. In this paper a system will be designed and constructed, which will be using computer vision to monitor a production line and remove the defective products. For this purpose a stereoscopic camera will be built that will perform and calculate the object’s coordinates in its environment. The system controller will make the trajectory planning into the three-dimensional environment, and the control of the robotic arm.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Applying a Convolutional Neural Network in an IoT Robotic System for Plant Disease Diagnosis",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9284356/",
            "Abstract": "Plant diseases are major threat to green product quality and agricultural productivity. Agronomists and farmers often encounter great difficulties in early detection of plant diseases and controlling their potential production damages. Thus, it is of great importance for stakeholders to diagnose plant diseases at very early stages of plant growing by exploiting state-of-the art technologies, consider appropriate actions and avoid further economic losses. Artificial Intelligence (AI) techniques, field sensors, data analytics and inference algorithms are some contemporary tools which could be helpful for early plant disease diagnosis. In this paper, we present a plant Disease Diagnosis Support System (DDSS) that utilizes an Internet of Things platform to control a lightweight robotic system. The DDSS applies a Convolution Neural Network learning algorithm to perform early plant disease diagnosis and classification. The …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:z_wVstp3MssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Supporting service differentiation in wireless sensor networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065038/",
            "Abstract": "The evolution of wireless sensor technology allows for the provision of enhanced services to miscellaneous application domains. In parallel, Quality of Service (QoS) support becomes necessary to satisfy the needs of these new service models. This paper presents QoS requirements from a service model perspective and describes challenges for QoS support in WSNs. We also provide a review of current efforts in Medium Access Control (MAC) QoS support in WSNs. Then, we investigate various performance metrics of IEEE 802.15.4 standard in order to determine the technological issues that arise. From the outcome of the experiments conducted, using ns-2, we identified that different schemes of services and application scenarios for different ways of deployment, scales of network and traffic load can satisfy diverse user needs and requirements.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Outside-in induction of the IFITM3 trafficking system by infections, including SARS-CoV-2, in the pathobiology of Alzheimer’s Disease",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2666354621000466",
            "Abstract": "IFITM3 is a viral restriction protein that enables sequestration of viral particles and subsequent trafficking to lysosomes. Recently, IFITM3 upregulation was found to induce gamma – secretase activity and the production of amyloid beta. The purpose of this study was to determine whether dysregulation of IFITM3-dependent pathways was present in neurons and peripheral immune cells donated by AD patients. As a secondary aim, we sought to determine whether these perturbations could be induced by viruses, including SARS-CoV-2.Gene set enrichment analyses (GSEA) previously performed on publicly available transcriptomic data from tissues donated by AD patients were screened for enriched pathways containing IFITM3. Subsequently, signature containing IFITM3, derived from entorhinal cortex (EC) neurons containing neurofibrillary tangles (NFT) was screened for overlap with curated …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:tuHXwOkdijsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Operation Dependencies in Loop Pipelining for High-Level Synthesis",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8544930/",
            "Abstract": "Research and industry interest in high-level synthesis has been renewed in the last few years, proven by the introduction of new tools or improved versions of existing tools. Academic tools like Gaut or CCC have recently appeared in new versions with expanded functionality in order to cover increased hardware design requirements. Likewise, industrial tools like Xilinx VivadoHLS or, more recently, Cadence Stratus have appeared and are continuously evolving in their effort to succeed in the market. One technology that high-level synthesis tools have chosen to invest on is compiler-driven code optimizations, which are a promising means to improve efficiency of automatically generated hardware. Loop transformations are among the most popular compiler optimizations, for both software and hardware targets. Loop unrolling and loop pipelining, coupled with careful instruction reordering, can deliver highly …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A 2.45 GHz power harvesting circuit in 90nm CMOS",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724642/",
            "Abstract": "In this work, an overview of the state-of-the-art of the design techniques of power harvesting (rectifying) circuits is presented. The evolution of each circuit, the advantages and design constraints, are investigated and compared. Furthermore, a novel 2.45 GHz power-harvesting circuit is implemented in 90 nm CMOS. Using voltage and power conversion efficiency as a FOM, the optimum rectifier topology is determined. When input power is -19.73 dBm, the proposed rectifier allows improving the Power and the Voltage Conversion Efficiency, achieving a PCE of 14.68% (for R L =1MΩ) and a VCE of 29.21%.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:ULOm3_A8WrAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A parallel fast transform-based preconditioning approach for electrical-thermal co-simulation of power delivery networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6513787/",
            "Abstract": "Efficient analysis of massive on-chip power delivery networks is among the most challenging problems facing the EDA industry today. Due to Joule heating effect and the temperature dependence of resistivity, temperature is one of the most important factors that affect IR drop and must be taken into account in power grid analysis. However, the sheer size of modern power delivery networks (comprising several thousands or millions of nodes) usually forces designers to neglect thermal effects during IR drop analysis in order to simplify and accelerate simulation. As a result, the absence of accurate estimates of Joule heating effect on IR drop analysis introduces significant uncertainty in the evaluation of circuit functionality. This work presents a new approach for fast electrical-thermal co-simulation of large-scale power grids found in contemporary nanometer-scale ICs. A state-of-the-art iterative method is combined with …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A placement-aware soft error rate estimation of combinational circuits for multiple transient faults in CMOS technology",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8602855/",
            "Abstract": "A considerable disadvantage that comes with the downscaling of the CMOS technology is the ever-increasing susceptibility of Integrated Circuits (ICs) to soft errors. Therefore, the study of the radiation-induced transient faults in combinational logic has become one of the most challenging issues as the absence of appropriate error-protection mechanisms may lead to system malfunctions. This paper presents an efficient and accurate layout-based Soft Error Rate (SER) estimation analysis for ICs in the presence of both single and multiple transient faults, since the latter are more prevalent as technology downscales. The proposed tool, i.e. SER estimator, is based on Monte-Carlo simulations taking into account a detailed grid analysis of the circuit layout for the identification of the vulnerable areas of a circuit and, in addition, temperature as one of the factors that affect the generated pulse width. The widening of the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An RTL-to-grid design flow for power grid verification based on a statistical estimation engine",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1689890/",
            "Abstract": "The most important reliability problem of modern power distribution networks is the voltage drop or IR-drop problem. In this paper we present a design flow based on industrial tools for power grid verification, where the grid is modeled as a linear resistive network and the necessary maximum current estimates are statistically obtained by recent advances in the field of extreme value theory. Experimental results include the verification of power grid for a choice of different real designs",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:TFP_iSt0sucC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The use of LEGO mindstorms in elementary schools",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7942895/",
            "Abstract": "Popular interest in robotics has increased significantly over the last years. It has been claimed that robotics can provide new benefits to the learning process at all levels of education. The main ideas of the present study adhered to the constructionist theory, according to which the learning process is not only transmitted from teacher to pupil, but rather constructed in the mind of the pupil in the form of active learning. The purpose of the present study was to implement a robotic toy (Lego Mindstorms NXT  TM ) in a Greek primary school, in order to teach twelve year-old children some of the basic concepts of geometry. The main hypothesis of the present study was that children who used the Lego Mindstorms NXT platform would score higher on an evaluation questionnaire than children who formed the control group. Descriptive statistical analysis was performed in order to evaluate the correct answers of the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:u9iWguZQMMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Monte Carlo approach for maximum power estimation based on extreme value theory",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/992765/",
            "Abstract": "A Monte Carlo approach for maximum power estimation in CMOS very large scale integration (VLSI) circuits is proposed. The approach is based on the largely unexploited area of statistics known as extreme value theory. Within this framework, it attempts to appropriately model the extreme behavior of the probability distribution of the peak instantaneous power drawn from the power supply bus, in order to yield a close estimate of its maximum possible value. The approach features a relatively small number of necessary input patterns that does not depend on the circuit size, user-specified accuracy, and confidence levels for the final estimate, simplicity in the algorithmic implementation, noniterative single-loop execution, highly accurate simulation-based operation, and easy integration within the design flow of CMOS VLSI circuits. Experimental results establish the above claims and demonstrate the overall efficiency …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On planning the adoption of new video standards in social media networks: a general framework and its application to HEVC",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s13278-017-0450-5",
            "Abstract": "In recent years, we have witnessed an explosion in the growth of social media networks, powered by the proliferation of handheld smart devices with high processing capabilities and a plethora of sensors including high-resolution cameras. A key component of information exchange in such networks, accounting for the majority of network traffic, is video. Currently, the de facto video coding standard in use is H.264/AVC which was sufficient in addressing the challenges posed by HD more than a decade ago, but is less than efficient in the new era of 4K smart device cameras and 8K TV screens. Given that newer standards exist and are capable of achieving higher compression rates at the same quality compared to H.264/AVC, we envision that within the next few years, the related industry will shift toward one of the newer video coding standards. For a social media network, such a transition poses manifold …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer Vienna"
        },
        {
            "Title": "A sparsity-aware MOR methodology for fast and accurate timing analysis of VLSI interconnects",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8795262/",
            "Abstract": "Signoff timing analysis is essential in order to verify the proper operation of VLSI circuits. As process technologies scale down towards nanometer regimes, the fast and accurate timing analysis of interconnects has become crucial, since interconnect delay represents an increasingly dominant portion of the overall circuit delay. It is a common view that traditional SPICE transient simulation of very large interconnect models is not feasible for full-chip timing analysis, while static Elmore-based methods can be inaccurate by orders of magnitude. Model Order Reduction (MOR) techniques are typically employed to provide a good compromise between accuracy and performance. However, all established MOR techniques result in dense system matrices that render their simulation impractical. To this end, in this paper we propose a sparsity-aware MOR methodology for the timing analysis of complex interconnects …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:N5tVd3kTz84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parallel Fast Transform-Based preconditioners for Large-Scale power Grid analysis on graphics processing units (GPUs)",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7407316/",
            "Abstract": "Efficient analysis of on-chip power delivery networks is one of the most challenging problems facing the electronic design automation industry today. The fast dc and transient simulation of power grids is necessary to determine the proper operation of the integrated circuits at the design phase, but is made very difficult by the sheer size of modern power grids, reaching quite a few million nodes in nanometer-scale integrated circuits. This paper presents two efficient and highly parallel preconditioning mechanisms for the analysis of large-scale power grids of near-2-D structure (with small via resistances) or 3-D structure (with large via resistances) by iterative solution methods. The proposed preconditioners approximate the matrices of practical power grids well enough to ensure fast convergence of the iterative method, while their application within the core of the method is based on a fast transform solver which …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:bFI3QPDXJZMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Forecasting of Day-Ahead Natural Gas Consumption Demand in Greece Using Adaptive Neuro-Fuzzy Inference System",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/709578",
            "Abstract": "(1) Background: Forecasting of energy consumption demand is a crucial task linked directly with the economy of every country all over the world. Accurate natural gas consumption forecasting allows policy makers to formulate natural gas supply planning and apply the right strategic policies in this direction. In order to develop a real accurate natural gas (NG) prediction model for Greece, we examine the application of neuro-fuzzy models, which have recently shown significant contribution in the energy domain.(2) Methods: The adaptive neuro-fuzzy inference system (ANFIS) is a flexible and easy to use modeling method in the area of soft computing, integrating both neural networks and fuzzy logic principles. The present study aims to develop a proper ANFIS architecture for time series modeling and prediction of day-ahead natural gas demand.(3) Results: An efficient and fast ANFIS architecture is built based on neuro-fuzzy exploration performance for energy demand prediction using historical data of natural gas consumption, achieving a high prediction accuracy. The best performing ANFIS method is also compared with other well-known artificial neural networks (ANNs), soft computing methods such as fuzzy cognitive map (FCM) and their hybrid combination architectures for natural gas prediction, reported in the literature, to further assess its prediction performance. The conducted analysis reveals that the mean absolute percentage error (MAPE) of the proposed ANFIS architecture results is less than 20% in almost all the examined Greek cities, outperforming ANNs, FCMs and their hybrid combination; and (4) Conclusions: The produced …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:2KloaMYe4IUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Proposing a method of network topology optimization in wireless sensor in precision agriculture",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Panagiotis-Kikiras/publication/235610349_Proposing_a_Method_of_Network_Topology_Optimization_in_Wireless_Sensors_in_Precision_Agriculture/links/54d5e9b90cf2970e4e65dc35/Proposing-a-Method-of-Network-Topology-Optimization-in-Wireless-Sensors-in-Precision-Agriculture.pdf",
            "Abstract": "In this paper we are going to propose a new way to build a wireless sensor network which is based on measuring the field’s electrical conductivity, staying away from the classic network grid implementation. Furthermore we are going to explain the way a typical WSN works, which are the pros and cons and the technical characteristics, as well as how electrical conductivity can influence our decision to build the WSN topology and the advantage of this approach comparing to the typical ones.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "802.15. 4-based Efficient Wireless Sensor System Design for Monitoring Blood Oxygen and Heart Rate in IoT Medical Applications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9284381/",
            "Abstract": "Oxygen levels and heart rate joint monitoring is based on specialized, and most of the times, expensive oximetry devices. According to literature, many studies highlight the necessity of connecting oximetry devises, under well-known wireless protocols, such as Bluetooth, Wifi, ZigBee and others, for more efficient real time monitoring of human bio signals. However, most of the studies indicate a gap regarding an energy efficient and cost - effective end to end system for wireless monitoring of oxygen and heart rates, in IoT medical applications. To this end, our work, focuses on the design of a wireless oximeter device that bases its operation on the integrated and power efficient MAX30100 circuitry, and a customized lightweight ZigBee – based protocol for wireless bio signals transfer.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exploring an ensemble of methods that combines fuzzy cognitive maps and neural networks in solving the time series prediction problem of gas consumption in Greece",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/568490",
            "Abstract": "This paper introduced a new ensemble learning approach, based on evolutionary fuzzy cognitive maps (FCMs), artificial neural networks (ANNs), and their hybrid structure (FCM-ANN), for time series prediction. The main aim of time series forecasting is to obtain reasonably accurate forecasts of future data from analyzing records of data. In the paper, we proposed an ensemble-based forecast combination methodology as an alternative approach to forecasting methods for time series prediction. The ensemble learning technique combines various learning algorithms, including SOGA (structure optimization genetic algorithm)-based FCMs, RCGA (real coded genetic algorithm)-based FCMs, efficient and adaptive ANNs architectures, and a hybrid structure of FCM-ANN, recently proposed for time series forecasting. All ensemble algorithms execute according to the one-step prediction regime. The particular forecast combination approach was specifically selected due to the advanced features of each ensemble component, where the findings of this work evinced the effectiveness of this approach, in terms of prediction accuracy, when compared against other well-known, independent forecasting approaches, such as ANNs or FCMs, and the long short-term memory (LSTM) algorithm as well. The suggested ensemble learning approach was applied to three distribution points that compose the natural gas grid of a Greek region. For the evaluation of the proposed approach, a real-time series dataset for natural gas prediction was used. We also provided a detailed discussion on the performance of the individual predictors, the ensemble predictors, and …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A high performance and low power hardware architecture for the transform & quantization stages in H. 264",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5202691/",
            "Abstract": "In this work, we present a hardware architecture prototype for the various types of transforms and the accompanying quantization, supported in H.264 baseline profile video encoding standard. The proposed architecture achieves high performance and can satisfy quad full high definition (QFHD) (3840middot2160@150Hz) coding. The transforms are implemented using only add and shift operations, which reduces the computation overhead. A modification in the quantization equations representation is suggested to remove the absolute value and resign operation stages overhead. Additionally, a post-scale Hadamard transform computation is presented. The architecture can achieve a reduction of about 20% in power consumption, compared to existing implementations.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast Transform-Based Solvers as Parallel Preconditioners for Large-Scale Power Grid Analysis on Massively Parallel Architectures",
            "Publication year": 2012,
            "Publication url": "http://inf-server.inf.uth.gr/~kodalouk/publications/P4_DAC_SRC_2012.pdf",
            "Abstract": "Konstantis Daloukas, Nestoras Evmorfopoulos, Panagiota Tsompanopoulou, George Stamoulis \nPage 1 • Design of reliable power delivery networks is of utmost importance in contemporary \nnano-scale ICs. • Typically, power delivery networks consist of millions of nodes. - 3D \nrectangular meshes, with very regular spatial geometry. - Usually modeled as RLC networks. • \nAnalysis is a challenging and time-consuming process. - Amounts to solving a large linear \nsystem of the form Ax = b • Multi-core and GPU architectures can provide the necessary \ncomputational power to tackle power grid analysis of large-scale ICs. POWER GRID ANALYSIS \nACKNOWLEDGEMENTS The first author is supported by a grant from ‘Bodossaki’ public benefit \nfoundation. Fast Transform-Based Solvers as Parallel Preconditioners for Large-Scale Power \nGrid Analysis on Massively Parallel Architectures Konstantis Daloukas, Nestoras , , George …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The neuroinvasive phenotype of COVID-19's the community: Data from Carnegie Mellon University's Delphi Group",
            "Publication year": 2021,
            "Publication url": "https://pesquisa.bvsalud.org/global-literature-on-novel-coronavirus-2019-ncov/resource/pt/covidwho-1307833",
            "Abstract": "aims:There are accumulating clinical and translational studies that have confirmed and expanded the concept of SARS-CoV-2 neuroinvasive potential in the setting of COVID-19. The aim of our study was to determine COVID-19's neuroinvasive potential in the community using the survey results from Carnegie Mellon University's Delphi Group.Methods:Data from December 2020's responders that had been tested for COVID-19 and received a positive/negative diagnosis (n= 48,629; 12,117 COVID-19 positive) were used in this study. Among available symptom data, we defined COVID-19 associated potential neuroinvasion (COVID 18/PNI; PNI) as the simultaneous presence of headache, fever and nausea. Logistic regression was used to determine predictors of PNI among comorbidities, sex a nd age.Results:COVID-19/PNI was detected 1212 responders. A binary logistic regression model accounting for other symptoms, age, gender and comorbidities revealed that the major determinant of PNI was self-described immune system compromise, comprising the entirety of PNI (1,212/1,212). A multivariate logistic regression model adjusting for other symptoms, age and comorbidities revealed that PNI affected responders reporting all comorbidities except heart disease, sleep disturbances, sore throat, olfactory/gustatory symptoms, age between 65-74 years and non-binary gender/other gender (p-value< 0.05). Out of these responders, only 30 (0.2%) were hospitalized.Conclusion:Our study reveals a vulnerable population among in COVID-19/PNI affects immunocompromised patients, known to have subtle or atypical symptoms even in bona fide …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "QoS and MPLS design issues in NoCs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8544942/",
            "Abstract": "Nowadays real application traffic, and especially streaming applications running in multi core environments require more and more bandwidth. Networks on Chips (NoC) should be able not only to provide adequate bandwidth resources but also variable length traffic with multi rate packets, each representing a different class of service (FEC classes) and hence, it should provide QoS support. It is common knowledge that in original networks, QoS provision along with packet forwarding and routing at high rates is supported by the MPLS concept. This paper is a brief and compact survey, that gives a smart look on critical design issues of MPLS technology applied in NoCs, based on recent reference work. All types of MPLS based NoC architectures are presented and their pros and cons are discussed. Moreover, other important issues are pointed out, such as non interference, security and fault management, giving …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:kRWSkSYxWN8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "THANOS: Eliminating Redundant States in Transient Thermal Analysis",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8923377/",
            "Abstract": "Efficient thermal simulation has recently become a cutting edge research topic, as it requires the solution of very large equation systems. However, in most cases, temperature is not required to be computed at every point on the IC but only at specific hotspots and in some predefined time windows, in order to assess the circuits compliance with thermal specifications. In this paper, we propose a computationally efficient low-rank time-limited Balanced Truncation algorithm, which retains the system-theoretic advantages in the model order for fast hotspot thermal simulation.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "INTRODUCING A NEW HALL EFFECT SENSOR",
            "Publication year": 2011,
            "Publication url": "https://www.scitepress.org/papers/2011/33973/33973.pdf",
            "Abstract": "Silicon Hall plates show an offset of a few millitesla. A large portion of this offset is caused by mechanical stress in the device. The offset can be reduced when the spinning-current principle is applied. In this paper we present a model and numerical analysis of a new Hall effect sensor which using a novel offset reduction method. We call it “Wheel Hall Senor” and senses all 3 filed dimensions. The flux-density of BZ is proportional to the DC component of the output signal, whereas the BX and BY components are proportional to the first harmonic of the output signal. Furthermore we calculate the function which governs the changes in the electric field inside the new Hall effect sensor in presence of magnetic field. This function help us to control in MatLab environment the equipotential lines and to monitor the changes in biasing conditions. About the new sensor, the combination of his pioneering form and the elaborate sequence of using the dynamic spinning current technique, could be lead to satisfactory results of produced Hall voltage with small noise in a presence of external magnetic field.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Frequency-Limited Reduction of Regular and Singular Circuit Models Via Extended Krylov Subspace Method",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9102448/",
            "Abstract": "During the past decade, model order reduction (MOR) has become key enabler for the efficient simulation of large circuit models. MOR techniques based on balanced truncation (BT) offer very good error estimates and can provide compact models with any desired accuracy over the whole range of frequencies (from dc to infinity). However, in most applications the circuit is only intended to operate at specific frequency windows, which means that the reduced-order model can become unnecessarily large to achieve approximation over all frequencies. In this article, we present a frequency-limited approach which, combined with an efficient low-rank sparse implementation of the extended Krylov subspace (EKS) method, can handle large input models and provably leads to reduced-order models that are either smaller or exhibit better accuracy than full-frequency BT.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:35r97b3x0nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "General development of a new Hall effect sensor",
            "Publication year": 2011,
            "Publication url": "https://search.proquest.com/openview/b1786d7194342be7e47c80b5efc75ba1/1?pq-origsite=gscholar&cbl=52938",
            "Abstract": "Silicon Hall plates show an offset of a few millitesla. A large portion of this offset is caused by mechanical stress in the device. The offset can be reduced with a factor 10^ sup 3^ to 10^ sup 5^ when the spinning-current principle is applied. This paper presents a structure of a new Hall effect sensor which uses a novel offset reduction method and the function which governs the changes in the electric field inside the new Hall effect sensor in presence of magnetic field. This function helps us to control in MatLab environment the equipotential lines and to monitor the changes when biasing conditions are change. The combination of his form and the elaborate sequence of using dynamic spinning current technique, can lead to satisfactory results of produced Hall voltage with small noise in a presence of external magnetic field.[PUBLICATION ABSTRACT]",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IFSA Publishing, SL"
        },
        {
            "Title": "Evaluation of Early Introduction to Concurrent Computing Concepts in Primary School",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-73210-7_64",
            "Abstract": "Learning computer programming is a basic literacy in the digital age, which helps children develop creative problem solving, logical thinking and mental flexibility. Many countries have introduced computer science in their curriculum. For example, in the educational system of United Kingdom, pupils are introduced to computer science topics from the age of six, while in Greece the teaching of computer programming commences at the age of eleven. Given differences in culture, available infrastructures, as well as the age pupils are introduced to computer science, the challenge of forming a computer science curriculum that not only offers basic background but expands the cognitive horizon and cultivates the imagination of students, still remains a challenge. Towards this end, this study focuses on exploring the potential merits of introducing concurrent programming concepts early in the learning process …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Internet Addiction and Anxiety Among Greek Adolescents: An Online Survey",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_75",
            "Abstract": "The relationship between Internet addiction and anxiety symptomatology is a scientific field of particular research interest. Internet addiction creates emotional, psychological and social dysfunctions in several aspects of an individual’s life such as at home, at school and/or at work. During the sensitive period of adolescence these dysfunctions may be determinants for the development in adulthood. The main purpose of the present study was to identify the Internet addicted students aged from 13 to 15-years-old and assess the coexistence of anxiety psychopathological symptomatology. Another aim of the present study was to use an online application in order to deliver the Internet Addiction Diagnostic Questionnaire of Young and the Revised Children’s Manifest Anxiety Scale. The results of the present study revealed that 15.3% of participants were found to be Internet addicted. These adolescents presented …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Heuristics for Iterative Detailed Standard Cell Placement",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2984393.2984409",
            "Abstract": "In cell placement a number of cells with rectangular shapes, must be placed inside a chip area so that no cells overlap and a target function is optimized. In standard cell placement all rectangles have the same width and the chip area is split into rows of equivalent width. Cells must be placed inside rows without overlaps and without exceeding row boundaries. A final solution is obtained using at least two stages. In the first stage, often called global placement, cells are distributed so as to optimize the target function. This initial distribution might violate problem constraints, therefore at a second stage often referred to as detailed placement cells are assigned to rows and overlaps are alleviated. In this paper we focus on heuristics in the context of iterative detailed placement whereby after assigning cells to rows, an iterative process further improves the optimization function, in our case wire length. The basis of the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A 3-D Fast Transform-based preconditioner for large-scale power grid analysis on massively parallel architectures",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6783398/",
            "Abstract": "Efficient analysis of on-chip power delivery networks is one of the most challenging problems that EDA is confronted with. This paper addresses the problem of simulating general multi-layer power delivery networks with significant via resistances. An iterative solution method is combined with an efficient and extremely parallel preconditioning mechanism based on the application of a 3D Fast Transform solver, which enables harnessing the computational resources of massively parallel architectures, such as GPUs. Experimental evaluation of the proposed methodology on a set of large-scale industrial benchmarks demonstrates a speed-up of 290.2X for a 2.62M-node design over a state-of-the-art parallel direct solver, and a speed-up of 75.5X for a 10.51M-node design over a parallel iterative solver with a general-purpose preconditioner, when GPUs are utilized.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast and accurate BER estimation methodology for I/O links based on extreme value theory",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6513560/",
            "Abstract": "This paper introduces a novel approach towards the statistical analysis of modern high-speed I/O and similar communication links, which is capable of reliably to determine extremely low (∼10 −12  or lower) bit error rates (BER) by using techniques from extreme value theory (EVT). The new method requires only a small amount of voltage values at the received eye center, which can be generated by running circuit/system level simulations or measuring fabricated I/O circuits, to predict link BERs. Unlike conventional techniques, no simplifying assumptions on link noise and interference sources are required making this approach extremely portable to any communication system operating with very low BER. Our experimental results show that the BER estimates from the proposed methodology are on the same order of magnitude as traditional time domain, transient eye diagram simulations for links with BER of 10 −6 …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heuristics for tile parallelism in HEVC",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8081462/",
            "Abstract": "HEVC has emerged as the new video coding standard promising increased compression ratios compared to its predecessors. This performance improvement comes at a high computational cost. For this reason, HEVC offers three coarse grained parallelization potentials namely, wave front, slices and tiles. In this paper we focus on tile parallelism which is a relatively new concept with its effects not yet fully explored. Particularly, we investigate the problem of partitioning a frame into tiles so that in a resulting one on one tile-CPU core assignment the cores are load balanced, thus, maximum speedup can be achieved. We propose various heuristics for the problem with a focus on low delay coding and evaluate them against state of the art approaches. Results demonstrate that particular heuristic combinations clearly outperform their counterparts in the literature.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Large-scale power grid analysis on parallel architectures",
            "Publication year": 2018,
            "Publication url": "https://patents.google.com/patent/US9858369B2/en",
            "Abstract": "Systems and methods related to fast simulation of power delivery networks are described. A method is provided for simulating the time-domain responses of a plurality of points of a multi-layer power delivery network, comprising selecting a model of the power delivery network of a circuit, parsing the characteristic data describing the power delivery network, forming a circuit matrix relating to said circuit characteristic data, creating a preconditioner matrix with a specialized structure that allows solution by a Fast Transform solver, simulating the circuit using said circuit and preconditioner matrices by a computer, including a non-transitory computer readable storage medium and at least one processor, but preferably multiple processors, and reporting the responses at selected nodes and branches of the power delivery network.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Low-Power VLSI architecture for Intra and Inter prediction in H. 264",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1689908/",
            "Abstract": "The H.264 video coding standard can achieve considerably higher coding efficiency than previous standards. The keys to this high code efficiency are mainly the two prediction modes (intra & inter) provided by the standard. Unfortunately these come at a cost in considerable increased complexity at the encoder. Therefore it is of high importance to design architectures that minimize the cost of the prediction modes. One computational element that is met in both, inter and intra prediction modes, is that of the sum of absolute differences (SAD). In this paper we present a new algorithm that can replace SAD in the two main prediction modes, and which can provide a more efficient hardware implementation",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The implementation of a web application for screening children with dyslexia",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-50340-0_36.pdf",
            "Abstract": "Developmental dyslexia is defined as an unexpected specific and persistent failure to acquire efficient reading skills despite conventional instruction, adequate intelligence and sociocultural opportunity. The main aim of the present research protocol was to construct a web screening battery of tests in order to screen children’s reading, orthographic and cognitive skills. The main hypothesis of the present study was that Greek students that were already diagnosed as dyslexic, shall present significantly lower scores. A total of sixty, right handed children (30 male and 30 female, age range 8–11 years old M = 8.93, SD = 0.83) participated in this study. Reading, cognitive and orthographic skills of children with dyslexia and typically achieving children were examined, using a battery that consisted of seven tasks. Subsequent analysis of variance revealed that the children with dyslexia had statistically significant (p …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Accurate Minimum Area Design of Power/Ground Meshes Subject to Voltage-Drop Constraints",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=15114196509166452642&hl=en&oi=scholarr",
            "Abstract": "The problem of optimum design of general (graph-based) power distribution networks with respect to the voltage drop effect is addressed in this paper. A rigorous formulation based on linear circuit theory is established for the relevant constrained optimization problem, so that the resultant network occupies the minimum possible area under specific voltage drop constraints at all IC functional blocks. The necessary maximum current estimates for the optimization procedure are accurately obtained-by statistical means-from recent advances in the field of extreme value theory. Experimental tests include the design of power grid for a choice of different topologies and voltage drop tolerances in a typical benchmark circuit.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:ZeXyd9-uunAC",
            "Publisher": "OLD CITY PUBLISHING INC"
        },
        {
            "Title": "Supervising committee",
            "Publication year": 2021,
            "Publication url": "https://ir.lib.uth.gr/xmlui/bitstream/handle/11615/56309/22878.pdf?sequence=1",
            "Abstract": "Modelling and simulating complex dynamic systems have always been a demanding and challenging task especially when considering the formulation of strategies and the development of certain policies in the context of decision-making, with respect to sustainability planning. In this direction, Fuzzy Cognitive Maps (FCMs) which constitute a powerful Neuro-fuzzy quasiquantitative modelling methodology, are the right candidate to address both complexity and non-linearity with respect to complex systems’ behavior. Additionally, they can handle the lack of reliable quantitative data along with the presence of uncertain information, in terms of knowledge representation and reasoning during the simulation process. Moreover, they seem to be a promising tool to incorporate human experience and other existing knowledge as well as new aggregation participatory approaches for aggregating numerous individual models designed by experts or stakeholders, that will produce more reliable models for decision-making. Afterall, FCMs have found extreme and extensive applicability in multiple research domains which is proved by the enormous list of publications in the literature, over the last decade.In the context of policy-making, energy demand forecasting is another significant and challenging task for tailoring efficient policies towards energy sustainability management and planning. Thus, the selection of accurate forecasting techniques is important for policy-makers to apply precise forecasts highly essential for supporting them in choosing the right strategies. Most of the forecasting methods until recently, are characterized by structure complexity …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Monte-Carlo approach for the estimation of average transition probabilities in sequential logic circuits",
            "Publication year": 2001,
            "Publication url": "https://www.hindawi.com/journals/apec/2001/041403/",
            "Abstract": "This paper presents an efficient and accurate Monte-Carlo approach to the problem of estimating average node switching probabilities in sequential circuits, which are used in average power estimation and reliability analysis of these circuits. Specific error bounds for the proposed estimation method are given at a certain level of confidence. This method is based on the analysis of paths in the State Transition Graph (STG) of the circuit and is validated by both theoretical analysis as well as experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A neuropsychological approach of developmental dyscalculia and a screening test via a web application",
            "Publication year": 2017,
            "Publication url": "https://www.academia.edu/download/66447156/4688.pdf",
            "Abstract": "Traditional definitions of Developmental Dyscalculia state that a child must substantially underachieve on mathematical abilities tests relative to the level expected for the given age, education and intelligence. However, current cognitive developmental neuropsychological studies suggest that not only the core numerical but also the cognitive skills of children with developmental dyscalculia present deficits. The main aim of the proposed research protocol was to construct a battery of six tests that can be delivered by computer in order to screen children’s arithmetic and cognitive skills. The hypothesis of the study was that children that are already diagnosed by paper and pencil tests as dyscalculic will present lower scores and larger time latencies not only in mathematical but also in cognitive tasks. A total of 134 right handed children (74 male and 60 female, age range 8–12 years) participated in this study. The students with disorders in mathematics (N= 67, 37 male and 30 female age range 8–12 years M= 10.15 SD= 1.10) had a statement of dyscalculia after assessment at a Centre of Diagnosis, Assessment and Support, as it is required by Greek Law. A comparison group without any learning disabilities was individually matched with the dyscalculic group according to age, sex and grade (N= 67, 37 male and 30 female, age range 8–12 years old, M= 10.24 SD= 1.12). Statistical analysis revealed that children with dyscalculia had statistically significant lower mean scores of correct answers and larger time latencies in all tasks compared to their average peers that participated in the comparison group. These findings suggest that children with …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Use of a Sequential Deep Learning Scheme for Financial Fraud Detection",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-80126-7_37",
            "Abstract": "Forecasting fraud detection has never been more essential for the finance industry than today. The detection of fraud has been a major concern for the banking industry due to the high impact on banks’ revenues and reputation. Fraud can be related with an augmented financial risk, which is often underestimated until it is too late. Recently, deep learning models have been introduced to detect and forecast possible fraud transactions with increased efficiency compared to the conventional machine learning methods and statistics. Such methods gain significant popularity due to their ability to estimate the unknown distribution of the collected data, thus, increasing their capability of detecting more complex fraud events. In this paper, we introduce a novel multistage deep learning model that combines a feature selection process upon an Autoencoder model and a deep convolutional neural network to detect …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:M7yex6snE4oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A novel Hall effect sensor using elaborate offset cancellation method",
            "Publication year": 2009,
            "Publication url": "https://search.proquest.com/openview/6d4bb3a4479eb08c5dd6fef687142877/1?pq-origsite=gscholar&cbl=52938",
            "Abstract": "The Hall effect is caused by a traverse force that is formed in the electrons or holes of metal element or semiconductor when are polarized by current source and simultaneously all the system it is found vertical in external magnetic field. Result is finally the production of difference of potential (Hall voltage) in address vertical in that of current and magnetic field directions. In the present work is presented a new Hall sensor exploiting the former operation. In combination with his pioneering form and using dynamic spinning current technique with an elaborate sequence, it leads to satisfactory results of produced Hall voltage with small noise in a presence of external magnetic field. Anyone can see both the spinning current and anti-Hall technique in the same sensor simultaneously.[PUBLICATION ABSTRACT]",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IFSA Publishing, SL"
        },
        {
            "Title": "Efficient IC hotspot thermal analysis via low-rank Model Order Reduction",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926018305224",
            "Abstract": "Efficient full-chip thermal simulation is among the most challenging problems facing the EDA industry today, due to the need for solution of very large systems of equations that require unreasonably long computational times. However, in most cases, temperature is not required to be computed at every point of the IC but only at certain hotspots, in order to assess the circuit's compliance with thermal specifications. This makes the thermal analysis problem amenable to Model Order Reduction techniques. System-theoretic techniques like Balanced Truncation offer very reliable bounds for the approximation error, which can be used to control the order and accuracy of the reduced models during creation, at the expense of greater computational complexity to create them. In this paper, we propose a computationally efficient low-rank Balanced Truncation algorithm based on extended Krylov subspace method, which …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Parallel Preconditioners Based on Fast Poisson Solvers for Efficient Large-Scale Power Grid Analysis",
            "Publication year": 2012,
            "Publication url": "http://inf-server.inf.uth.gr/~kodalouk/publications/P3_DAC_WIP_2012.pdf",
            "Abstract": "• Typically, power delivery networks consist of millions of nodes.-3D rectangular meshes, with very regular spatial geometry.-Usually modeled as RLC networks.• Analysis is a challenging and time-consuming process.-Amounts to solving a large linear system of the form Ax= b• Multi-core and GPU architectures can provide the necessary computational power to tackle power grid analysis of large-scale ICs.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Low power general purpose loop acceleration for NDP applications",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3437120.3437288",
            "Abstract": "Modern processor architectures face a throughput scaling problem as the performance bottleneck shifts from the core pipeline to the data transfer operations between the dynamic random access memory (DRAM) and the processor chip. To address such issue researchers have proposed the near-data processing (NDP) paradigm in which the instruction execution is moved to the DRAM die thus, lowering the data movement between the processor and the DRAM. Previous NDP works focus on specific application types and thus the general purpose application execution paradigm is neglected. In this work we propose an NDP methodology for low power general purpose loop acceleration. For this reason we design and implement a hardware loop accelerator from the ground up to improve the throughput and lower the power consumption of general purpose loops. We adopt a novel loop scheduling approach which …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobivoke: A Mobile System Architecture to Support off School Collaborative Learning Process",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75175-7_57",
            "Abstract": "The collaborative learning paradigm offers one of the most solid approaches to increase the participation, interest and knowledge level of pupils (typical achieving and/or learning disabled students) during the educational process. Recent advances in the field have offered a plethora of tools to facilitate collaboration during school time. Nevertheless, the possibility of applying the collaborative learning principles together with personalized exercise/project assignments (whenever deemed necessary) during off school hours is often overlooked. Motivated by the fact that most pupils/students nowadays have access to smart mobile devices, e.g., tablets, in this paper a system architecture (Mobivoke) is proposed that enables the coupling of individual devices into a social group and offers the means to build applications for orchestrating and monitoring the off school learning process in a collaborative manner.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Exploring Brazilian photovoltaic solar energy development scenarios using the fuzzy cognitive map wizard tool",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9177573/",
            "Abstract": "Photovoltaic Solar Energy (PSE) sector has gained great attention during the last decades due to its significant role in the transition to sustainable energy systems. As a viable energy option, PSE has the potential to meet many of the challenges facing the world, along with the diminution of world's dependency to fossil fuels, greenhouse gas emissions reduction and global warming mitigation. In the case of Brazil, the adoption of photovoltaic solar energy is mainly driven by the shortages and several other barriers that are met in the Brazilian energy sector. The development of the Brazilian PSE is the main concern of this study, and authors focus on the investigation of certain factors and their influence on this main outcome with the use of Fuzzy Cognitive Maps (FCMs). FCM is a well-established methodology for scenario analysis and management in diverse domains, and is based on fuzzy logic and neural networks …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compiler transformations in hardware synthesis of Mpeg2 codes",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495167/",
            "Abstract": "High-level synthesis is the technique that translates high-level programming language programs into equivalent hardware descriptions. The use of conventional programming languages as input to high-level synthesis is challenging, due to the conceptual differences between software programs and hardware descriptions, but is nonetheless becoming the preferred input to high-level synthesis tools. Compilers play an important role in this process, since they can not only bridge such differences, thus making high-level synthesis tools better accepted by the scientific community, but they can also apply code transformations that target an optimized hardware output. In this paper, we discuss a number of transformations that can be implemented in the C language front end of the CCC high-level synthesis tool. We present experiments of such transformations conducted on the MPEG2 open-source code, which prove that …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power, performance and area prediction of 3D ICs during early stage design exploration in 45nm",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6122374/",
            "Abstract": "In this work, the impact of across-chip temperature and power supply voltage variations, on performance predictions in 3D ICs, is investigated. To make this possible, a novel design flow is proposed to perform design exploration of 3D ICs. Power supply voltage and thermal variations are modeled, to allow accurate PPA (power, performance and area) predictions. Using the main parts of this design flow, in a system comprising hundreds of million gates, complicated mechanisms are shown to determine the performance of the system. With increasing number of dies, timing is shown to exhibit 4 distinct regions, where either temperature or voltage drop is the dominant limiting factor. Power consumption does not scale monotonically with increasing die number. As a consequence, optimum system performance is in no way achieved by minimizing temperature and voltage drop, as is assumed in the literature so far. The …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:k_IJM867U9cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Depressive Symptomatology of University Students Via a Web Application",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_49",
            "Abstract": "Depression is a serious mental health disorder that affects approximately 2–5% of school-age children and adults. In addition to the emotional suffering, depression often disrupts cognitive functions and leads to the deterioration of academic performance. In depressed adults, short and long-term memory as well as attention are the most affected cognitive functions. There are only a limited number of studies on cognitive functions in university students with depressive symptomatology. However, deficits in short-term memory and meta-memory have been reported. Impaired ability to concentrate on task performance is one of the major problems in child and adult patients with depression. A number of studies suggest that university students neglect or even give up on theirs studies after their first year as students. Furthermore, a large number of students finish their studies taking more time than they normally …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Introducing a new hall effect sensor-Novel dynamic offset reduction method",
            "Publication year": 2011,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/32189",
            "Abstract": "Silicon Hall plates show an offset of a few millitesla. A large portion of this offset is caused by mechanical stress in the device. The offset can be reduced when the spinning-current principle is applied. In this paper we present a model and numerical analysis of a new Hall effect sensor which using a novel offset reduction method. We call it \"Wheel Hall Senor\" and senses all 3 filed dimensions. The flux-density of BZ is proportional to the DC component of the output signal, whereas the BX and BY components are proportional to the first harmonic of the output signal. Furthermore we calculate the function which governs the changes in the electric field inside the new Hall effect sensor in presence of magnetic field. This function help us to control in MatLab environment the equipotential lines and to monitor the changes in biasing conditions. About the new sensor, the combination of his pioneering form and the elaborate sequence of using the dynamic spinning current technique, could be lead to satisfactory results of produced Hall voltage with small noise in a presence of external magnetic field.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:pyW8ca7W8N0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fuzzy Cognitive Map-Based Sustainable Socio-Economic Development Planning for Rural Communities",
            "Publication year": 2019,
            "Publication url": "https://ideas.repec.org/a/gam/jsusta/v12y2019i1p305-d303472.html",
            "Abstract": "Every development and production process needs to operate within a circular economy to keep the human being within a safe limit of the planetary boundary. Policymakers are in the quest of a powerful and easy-to-use tool for representing the perceived causal structure of a complex system that could help them choose and develop the right strategies. In this context, fuzzy cognitive maps (FCMs) can serve as a soft computing method for modelling human knowledge and developing quantitative dynamic models. FCM-based modelling includes the aggregation of knowledge from a variety of sources involving multiple stakeholders, thus offering a more reliable final model. The average aggregation method for weighted interconnections among concepts is widely used in FCM modelling. In this research, we applied the OWA (ordered weighted averaging) learning operators in aggregating FCM weights, assigned by various participants/ stakeholders. Our case study involves a complex phenomenon of poverty eradication and socio-economic development strategies in rural areas under the DAY-NRLM ( Deendayal Antyodaya Yojana -National Rural Livelihoods Mission) in India. Various scenarios examining the economic sustainability and livelihood diversification of poor women in rural areas were performed using the FCM-based simulation process implemented by the “FCMWizard” tool. The objective of this study was three-fold: (i) to perform a brief comparative analysis between the proposed aggregation method called “OWA learning aggregation” and the conventional average aggregation method, (ii) to identify the significant concepts and their …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:NJ774b8OgUMC",
            "Publisher": "MDPI, Open Access Journal"
        },
        {
            "Title": "Pathogen-induced autoimmunity and impaired proteostasis in Alzheimer's disease: a data-driven, in silico immunology approach",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=6306968788213143192&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:epqYDVWIO7EC",
            "Publisher": "WILEY"
        },
        {
            "Title": "A ZigBee–based Lightweight Wireless Sensor System for measuring action potential bio signals in Agriculture IoT Applications",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9284340/",
            "Abstract": "The deployment and integration of a low power pervasive wireless sensor system, for measuring and processing action potentials bio signals for plants, is an interesting and challenging technical task. In our experiments, we focus on measuring electrical potentials for Chrysanthemum and Sansevieria plants. We note that the wireless pervasive sensor system, for real time data collection, should be optimally designed in terms of energy and communication costs. Therefore, in our work, we design and propose an optimized ZigBee – based lightweight end to end system to measure and evaluate plant action potentials. Our system’s design functionality response results, demonstrated a significant reduction in the firmware code length, to be loaded in the microcontroller unit, potential use of 8 – bit microcontrollers with low memory capacity and reduced development costs for hundreds of measuring plant points and …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:nrtMV_XWKgEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scheduling video transcoding jobs in the cloud",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8726540/",
            "Abstract": "Video transcoding is the process of producing from an original (already encoded) input video sequence, multiple output sequences, each at potentially different bitrate, resolution and/or format. Transcoding is essential to support video delivery towards clients that use different players and have different network access capabilities. In the most basic scheme the input sequence is decoded and then re-encoded at the desired levels. Although significant research on fast transcoding schemes exists, the transcoding process is still computationally intensive. For this reason efficient scheduling methods that allocate resources to transcoding jobs are necessary in order to achieve good overall performance. Such policies usually aim at allocating transcoding jobs over co-located servers, thus, they typically overlook parameters such as network traffic. Motivated by the case of transcoding in the Cloud, in this paper we …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:5ugPr518TE4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Combinatorial Multigrid Preconditioned Iterative Method for Large Scale Circuit Simulation on GPU s",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8434892/",
            "Abstract": "Efficient large scale circuit simulation is among the most challenging problems facing the EDA industry today, since it is the only feasible way to verify a circuit's behaviour prior to manufacturing. In recent years, the emphasis has been placed on preconditioning methods which reduce the number of iterations for solving large Symmetric Diagonally Dominant systems resulting after the Modified Nodal Analysis. This paper presents a GPU-accelerated Preconditioned Conjugate Gradient (PCG) iterative method preconditioned by the Combinatorial Multigrid (CMG) for fast DC and transient analysis of large-scale linear circuits. Experimental results on IBM industrial power grids demonstrate speedups up to 4.69× and 4.50× for the PCG method and the CMG preconditioning algorithm, respectively, over the optimized CPU implementations.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Topology control with coverage and lifetime optimization of wireless sensor networks with unequal energy distribution",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0045790617313149",
            "Abstract": "In this work, we use an unequal energy distribution algorithm, with which we succeed to extend network lifetime. In the sequel, we, we provide the best effort coverage by arranging the nodes using topology control principles. We formulate an optimization problem and define an objective function that incorporates both network coverage and lifetime that should be both maximized. Such a complex problem can be solved in polynomial time through Simulated Annealing (SA). An updated topology is evaluated in each convergence point and a near optimal node placement together with near optimal unequal energy allocation charge scheme is achieved. Results reveal that the proposed near optimal topology leads to greater coverage and lifetime as compared to several random deployments. We complete this work by providing a reliability study of the results, which is carried out by analysing the survival function of the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Selective inversion of inductance matrix for large-scale sparse RLC simulation",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2593069.2593213",
            "Abstract": "The inverse of the inductance matrix (reluctance matrix) is amenable to sparsification to a much greater extent than the inductance matrix itself. However, the inversion and subsequent truncation of a large dense inductance matrix to obtain the sparse inverse is very time-consuming, and previously proposed window-based techniques cannot provide adequate accuracy. In this paper we propose a method for selective inversion of the inductance matrix to a prescribed sparsity ratio, which is also amenable to parallelization on modern architectures. Experimental results demonstrate its potential to provide efficient and accurate approximation of the reluctance matrix for simulation of large-scale RLC circuits.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling qos in the internet of things",
            "Publication year": 2012,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.960.9047&rep=rep1&type=pdf",
            "Abstract": "With the emergence of the Internet of Things (IoT), it is necessary to define service models, which can categorize IoT applications and determine the Quality of Service (QoS) factors necessary to satisfy the requirements of those services. On the other hand, as Wireless Sensor Networks (WSN) constitute a main component of the IoT, they become a key factor concerning QoS provision. In this perspective, we focus our analysis on the possible WSNs integration approaches in the IoT while providing QoS and which best practices to adopt. Furthermore, regarding QoS requirements, we also define service models for the IoT and expose their feasibility through a categorization of IoT applications.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A low-power/low-noise readout circuit for integrated capacitive sensors",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1634429/",
            "Abstract": "A switched-capacitor integrated system is presented in this work that attains sub-fF measurement resolution in integrated capacitive sensors, with 1.5-kHz bandwidth and 50-muW average power consumption in continuous function mode. The proposed design employs a pair of nonoverlapping clocks and an operational transconductance amplifier (OTA) that can be made as simple as a basic differential pair. The system exhibits 0.8% linearity error and 0.01 fF/degC temperature drift. It is appropriate for differential, absolute, and ratiometric capacitance measurements, and shows robustness against interconnection parasitics, transistor dimensional mismatch, and process variations, which are an important feature in the case of sensor-die CMOS postprocessing",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "National Technical University, Department of Electrical and Computer Engineering, Athens",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=RN_UCgAAQBAJ&oi=fnd&pg=PA341&dq=info:SRSnoRDXPlIJ:scholar.google.com&ots=MbSIaCJ8is&sig=6WLSUTO5y4vcOVhs69IeHIenx1M",
            "Abstract": "The problem of maximum power estimation in CMOS VLSI circuits is addressed. Estimation of a chip's maximum power requirements, as they relate to electromigration and IR-drop failures in its supply bus is becoming important as we move into the deep-submicron where guardbanding that has been used up to now is no longer acceptable. An approach of statistical nature, based on recent advances in the field of extreme value theory is proposed. Expertimental results establish our claims and they demonstrate the overall efficiency of the proposed approach in comparison to previously employed techniques.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:D03iK_w7-QYC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "On the Impact of Electrical Masking and Timing Analysis on Soft Error Rate Estimation in Deep Submicron Technologies",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9568306/",
            "Abstract": "Soft errors constitute a crucial reliability concern for the Integrated Circuits (ICs) as the continuous CMOS technology downscaling renders them vulnerable to radiation-induced hazards. Therefore, the Soft Error Rate (SER) evaluation represents a necessary process to design radiation-hardened ICs. A SPICE-oriented electrical masking analysis, combined with a TCAD characterization process, contributes to an accurate SER estimation. The impact of a Static Timing Analysis (STA) methodology on SER and the consideration of the actual interconnect delay are discussed. Experimental results on various benchmarks, synthesized with respect to 45nm and 15nm technology, indicate the SER variation as the device scales down.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:WZBGuue-350C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimized analytics query allocation at the edge of the network",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-34914-1_18",
            "Abstract": "The new era of the Internet of Things (IoT) provides the space where novel applications will play a significant role in people’s daily lives through the adoption of multiple services that facilitate everyday activities. The huge volumes of data produced by numerous IoT devices make the adoption of analytics imperative to produce knowledge and support efficient decision making. In this setting, one can identify two main problems, i.e., the time required to send the data to Cloud and wait for getting the final response and the distributed nature of data collection. Edge Computing (EC) can offer the necessary basis for storing locally the collected data and provide the required analytics on top of them limiting the response time. In this paper, we envision multiple edge nodes where data are stored being the subject of analytics queries. We propose a methodology for allocating queries, defined by end users or applications, to …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Simulation Techniques for Large-Scale Circuits",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=13788404181599843854&hl=en&oi=scholarr",
            "Abstract": "Computational methods have their own version of Moore’s law, which states that the size of problems that can be solved in a given amount of time doubles every few years. However, it is also a historical fact that the size of problems that need to be solved always increases faster than our ability to solve them, necessitating algorithmic breakthroughs and paradigm shifts beyond the raw increase of computational power offered by Moore’s law. One of these problems is the simulation of electrical and electronic circuits.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:a0OBvERweLwC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "End–to–End Secure Data Delivery in Wireless Sensor Networks",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.476.577&rep=rep1&type=pdf",
            "Abstract": "Typical sensor nodes are resource constrained devices containing user level applications, operating system components, and device drivers in a single address space, with no form of memory protection. A malicious user could easily capture a node and tamper the applications running on it, in order to perform different types of attacks. In this paper, we propose a 3-Tier Security Framework composed by physical security schemes, cryptography of communication channels and live forensics protection techniques that allows for secure WSN deployments. Each of the abovementioned techniques maximizes the security levels leading to a tamper proof sensor node. Even if the physical protection of the nodes is bypassed which is common in wireless sensor attacks, the attacker must surpass 2 more security tiers in order to perform a valid attack on the underlying network. By applying the proposed security framework, secure communication between nodes is guaranteed, identified captured nodes are silenced and their destructive effect on the rest of the network infrastructure is minimized due to the early measures applied. Our main concern is to propose a framework that balances its attributes between robustness, as long as security is concerned and cost effective implementation as far as resources (energy consumption) are concerned.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data driven phenotyping and COVID-19 case definitions: a pattern recognition approach.",
            "Publication year": 2021,
            "Publication url": "https://www.medrxiv.org/content/10.1101/2021.04.30.21256219v1.abstract",
            "Abstract": "Introduction COVID-19 has pathological pulmonary as well as several extrapulmonary manifestations and thus many different symptoms may arise in patients. The aim of our study was to determine COVID-19 syndromic phenotypes in a data driven manner using survey results extracted from Carnegie Mellon University9s Delphi Group. Methods Monthly survey results (>1 million responders per month; 320.326 responders with positive COVID-19 test and disease duration <30 days were included in this study) were used sequentially in identifying and validating COVID-19 syndromic phenotypes. Logistic Regression Weighted Multiple Correspondence Analysis (LRW MCA) was used as a preprocessing procedure, in order to weight and transform symptoms recorded by the survey to eigenspace coordinates (i.e. object scores per case / dimension), with a goal of capturing a total variance of >75%. These scores along with symptom duration were subsequently used by the Two Step Clustering algorithm to produce symptom clusters. Post-hoc logistic regression models adjusting for age, gender and comorbidities and confirmatory linear principal components analyses were used to further explore the data. The model created from 66.165 included responders in August, was subsequently validated in data from March to December 2020. Results Five validated COVID 19 syndromes were identified in August: 1. Afebrile (0%), Non-Coughing (0%), Oligosymptomatic (ANCOS) 2. Febrile (100%) Multisymptomatic (FMS) 3. Afebrile (0%) Coughing (100%) Oligosymptomatic (ACOS), 4. Oligosymptomatic with additional self-described symptoms (100%; OSDS …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:LI9QrySNdTsC",
            "Publisher": "Cold Spring Harbor Laboratory Press"
        },
        {
            "Title": "A pareto-efficient algorithm for data stream processing at network edges",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8591010/",
            "Abstract": "Data stream processing has received considerable attention from both research community and industry over the last years. Since latency is a key issue in data stream processing environments, the majority of the works existing in the literature focus on minimizing the latency experienced by the users. The aforementioned minimization takes place by assigning the data stream processing components close to data sources. Server consolidation is also a key issue for drastically reducing energy consumption in computing systems. Unfortunately, energy consumption and latency are two objective functions that may be in conflict with each other. Therefore, when the target function is to minimize energy consumption, the delay experienced by users may be considerable high, and the opposite. For the above reason there is a dire need to design strategies such that by targeting the minimization of energy consumption …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:eMMeJKvmdy0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A new SOI monolithic capacitive sensor for absolute and differential pressure measurements",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0924424705001743",
            "Abstract": "In the present work, a new monolithic capacitive pressure sensor is being introduced. The sensor is manufactured according to a custom, 15-step SOI process. The process primarily offers great flexibility as far as sensor design is concerned. Absolute or differential pressure sensing is possible by simply arranging proper sensor package. Measurement sensitivity and span are easily regulated over a wide range of values by setting one-single design parameter. Attention is paid to avoid p–n junction formation in order to improve the sensor robustness against temperature increase and allow high-temperature post-processing without doping profile degradation. The presented design allows the implementation of an ordinary p-well CMOS post-process. Sensitivity of 2 mV/kPa, within a span of 180 kPa (2%) and a bandwidth of 25 kHz, is achievable by means of a CMOS switched-capacitor ASIC that is developed and …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A generic framework for a Peer to Peer Blockchain based Fog Architecture in Industrial Automation",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8908360/",
            "Abstract": "Industrial Internet of things (IIoT) is referred exclusively to smart and cheap sensor based devices lying on top of machines or machine parts, to collect and process massive raw data and therefore to make intelligent decisions autonomously, without human intervention, according to the Industry 4.0 requirements. However, there are still challenges to address, such as the massive amount of data generated in high speeds and the fast processing requirements and also challenges in the security domain, such as data integrity and ID authentication. Currently decentralized IoT/Fog network architectures would come in handy, in order to release data processing “burden” from isolated Cloud servers. On the other hand, Blockchain has emerged as a key technology for handling manufacturing, raw or processed data, in safety and security environment, while distributing it to the physical world, consisting of heterogeneous …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A connectivity-based legalization scheme for standard cell placement",
            "Publication year": 2017,
            "Publication url": "https://www.scirp.org/html/1-7601236_78754.htm",
            "Abstract": "Standard cell placement algorithms have been at the forefront of academic research concerning the physical design stages of VLSI design flows. The penultimate step of a standard cell placement procedure is legalization. In this step the manufacturability of the design is directly settled, and the quality of the solution, in terms of wirelength, congestion, timing and power consumption is indirectly defined. Since the heavy lifting regarding processing is performed by global placers, fast legalization solutions are protruded in state-of-the-art design flows. In this paper we propose and evaluate a legalization scheme that surpasses in execution speed two of the most widely used legalizers, without not only corrupting the quality of the final solution in terms of interconnection wirelength but improving it in the process.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:WbkHhVStYXYC",
            "Publisher": "Scientific Research Publishing"
        },
        {
            "Title": "A framework for scheduling the encoding of multiple smart user videos",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753380/",
            "Abstract": "The ever increasing number of video uploads in social media platforms, together with the incorporation of live video broadcasts and a growing demand for higher video resolution, will likely pose the most significant performance challenge for social media providers in the years to come. The current state of the art in most social media platforms, involves videos in H.264/AVC format. However, recent advances in video encoding such as the HEVC standard offer better compression ratios compared to H.264/AVC at the expense of higher computational demands. As HEVC is gradually replacing the old standard, the possibility of reducing bandwidth consumption and server load by using the more efficient compression scheme can't be overlooked. In this paper we propose a framework to tackle the challenges of adopting HEVC as well as high resolution videos in social media platforms.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WEVIAN: A Web-based Placement Visualizer/Analyzer",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3139367.3139396",
            "Abstract": "One of the most important stages of a typical ASIC (Application-specific integrated circuit) design flow, is physical design. The most prominent step of the aforementioned stage is placement. Major design challenges are regulated while traversing this stage in order to accommodate the final sign-off. Various aspects of the design might be modified during this step, and the primary manner to keep track of these modifications is usually through detailed text reports, concerning universal metrics like density and wire-length, and generic static visualizations, due to the timing overhead it introduces to the overall procedure. However, a detailed and interactive depiction of the final result might provide insights concerning the quality of the final solution and the effectiveness of the applied algorithms. In this paper we present WEVIAN, a web-based placement visualizer/analyzer that enhances the design procedure by adding …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:sSrBHYA8nusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Assessment of Machine Learning Techniques for Building an Efficient IDS",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9283814/",
            "Abstract": "Intrusion Detection Systems (IDS) are the systems that detect and block any potential threats (e.g. DDoS attacks) in the network. In this project, we explore the performance of several machine learning techniques when used as parts of an IDS. We experiment with the CICIDS2017 dataset, one of the biggest and most complete IDS datasets in terms of having a realistic background traffic and incorporating a variety of cyber attacks. The techniques we present are applicable to any IDS dataset and can be used as a basis for deploying a real time IDS in complex environments.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Learning difficulties screening web application",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7318103/",
            "Abstract": "Learning disabilities is a generic term that refers to a heterogeneous group of disorders. The aim of the present pilot study was to examine the efficacy of a new web neurocognitive screening tool, the “askisi” that was developed to provide a brief screening measure for learning difficulties. Participants were twenty children who had been initially identified with learning difficulties and a control group of twenty students' age- and sex-matched with the children with learning difficulties. Group members' ages range between 8 and 12 years old. The set of tasks which all children had to undergo included 10 test that examined children's rreading, spelling, arithmetic and cognitive skills. In our effort to enhance the aforementioned procedure we created a client-server web application that implements its core characteristics. The results indicated that children with learning difficulties had significantly less correct responses in …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Epigenetic regulation of apoptosis via the PARK7 interactome in peripheral blood mononuclear cells donated by tuberculosis patients vs. healthy controls and the response to treatment: A systems biology approach",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1472979220301050",
            "Abstract": "The aims of our study were to determine for the first time differentially expressed genes (DEGs) and enriched molecular pathways involving the PARK7 interactome in PBMCs donated from tuberculosis patients.Data on a previously reconstructed PARK7 interactome (Vavougios et al., 2017) from datasets GDS4966 (Case-Control) and GDS4781 (Treatment Series) were retrieved from the Gene Expression Omnibus (GEO) repository. Gene Enrichment analysis was performed via the STRING algorithm and the GeneTrail2 software.17 and 22 PARK7 interactores were determined as DEGs in the active TB vs HD and Treatment Series subset analyses, correspondingly, associated with significantly enriched pathways (FDR <0.05) involving p53 and PTEN mediated, stress responsive apoptosis regulation pathways. The treatment subset was characterized by the emergence of an additional layer of …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Churchill Livingstone"
        },
        {
            "Title": "An automatic multi-agent web image and associated keywords retrieval system",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5367695/",
            "Abstract": "Web-based image search engines and CBIR techniques are blind to the actual content. As a result querying for a specific object is often cluttered with irrelevant data, leading to low precision. Furthermore recall rates are also very low since retrieval procedures are usually based either on context (surrounding text) and file captions or on low-level visual features. In this paper an automatic multi-agent image retrieval system is proposed. Our novel system exploits the format of multimedia sharing Web sites to discover the underlying structure in order to finally infer and extract multimedia files and corresponding associated keywords from the Web pages. The system first identifies the section of the Web page that contains the multimedia file to be extracted and then extracts it by using clustering techniques and other tools of statistical origin. Experimental results on real-world image sharing Web sites are presented and …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:S16KYo8Pm5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New Tasks for a Dyslexia Screening Web Application",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=6jeNDwAAQBAJ&oi=fnd&pg=PA263&dq=info:c2wcwsWdnB0J:scholar.google.com&ots=Y7KaaVfOUT&sig=nv-GY7OGBMflryschgjXwW5VnDI",
            "Abstract": "Dyslexia is the most common learning disability and it is characterized by a persistent failure to acquire reading skills despite normal intelligence, adequate cognitive abilities, conventional instruction and sociocultural opportunities. The main target of the present study was to extend our previous dyslexia screener web application by constructing and embedding new tasks. An extended battery of tests was implemented, which included sentence comprehension, auditory working memory, syllable composition and word explanation skills. Moreover, another aim of the study was to incorporate these tests into our existing web application. Statistical analysis revealed that dyslexic children presented lower correct responses (p< 0.01) and larger time latency (p< 0.05) in comparison to their average peers in all four tasks of the web application. Additionally, the main purpose of delivering a screening procedure via internet is that the users are doing something useful while perceiving that they are “playing a game”. The present study does not replace a seven task battery of tests with a four task one. One the contrary, it enriches an already used seven task battery with four more tests in order to design a more complete dyslexia web application screener.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:ye4kPcJQO24C",
            "Publisher": "Springer"
        },
        {
            "Title": "An End-to-End Framework for Securing the Internet of Things",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12945671616797689082&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Studying the Role of Proximity in Advancing Innovation Partnerships at the Dawn of Industry 4.0 era",
            "Publication year": 2020,
            "Publication url": "https://search.proquest.com/openview/15863703bec7aeb5050ad14437d656d6/1?pq-origsite=gscholar&cbl=396494",
            "Abstract": "The fourth Industrial revolution (aka Industry 4.0 wave), presupposes the completion of digital business transformation. Industry 4.0 wave is based on cyber-physical production systems (CPS), aiming to connect the physical and digital production spaces. Under this framework, Industry 4.0 digital operations require the re-establishment of IT systems, in a way that human and machines are interconnected and interact in real-time, thus creating a more flexible, resourceefficient and optimal way of manufacturing. To this end, Industry 4.0 encompasses concepts that include Industrial Internet of Things (IIoT) and Artificial Intelligence (AI) in manufacturing, which promotes better smart production phases. Under the new digital framework of Industry 4.0, the role of proximity in advancing innovation partnerships and promoting efficient technology and knowledge transfer among the engaged partners, should be carefully …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Data stream processing at network edges",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8425473/",
            "Abstract": "This paper studies the problem of finding an assignment of data stream processing components onto servers under the objective to minimize both energy consumption and average delay experienced by end users within the system. The aforementioned problem is studied under the context of internet of things (IoT), where servers belonging to micro-datacenters are placed at network edges and thus close to data. We propose two algorithms to tackle the aforementioned problem taking into account limited server and network resources at micro-datacenters. The first algorithm is called Delay Aware Algorithm (DA) and results in a delay efficient assignment without taking into account energy consumption. The second algorithm is called Energy Efficient and Delay Aware Algorithm (EFDA) and results in a both energy and delay efficient assignment of application processing components onto servers within the system. We …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "U-Park: Parking management system based on wireless sensor network technology",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=2715482158074115984&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design of an Autonomous Robotic Vehicle for Area Mapping and Remote Monitoring",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Christos-Drosos-2/publication/317609682_Design_of_an_Autonomous_Robotic_Vehicle_for_Area_Mapping_and_Remote_Monitoring/links/5a818eaa458515ce614106aa/Design-of-an-Autonomous-Robotic-Vehicle-for-Area-Mapping-and-Remote-Monitoring.pdf",
            "Abstract": "The increase of human needs has pushed the robotics sector to evolve even more. One area that begins to bloom in robotic systems are semi-autonomous or autonomous monitoring and guarding vehicles from a distance. The present platform is an example of such a system. It will be the analysis of its design, construction and operation. The operator driving the vehicle will have video feed and additional information about the space monitor. This system could be the basis of a complete automated platform with more sensors that will cover more needs.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intelligent tasks allocation at the edge based on machine learning and bio-inspired algorithms",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s12530-021-09379-0",
            "Abstract": "Current advances in the Internet of Things (IoT) and Cloud involve the presence of an additional layer between them acting as mediator for data transfer and processing in close distance to end users. This mediator is the edge computing (EC) infrastructure. In EC, we can identify an ecosystem of heterogeneous nodes capable of interacting with IoT devices, collecting and locally processing the data they report. The ultimate goal is to eliminate the latency we face when relying on Cloud to perform the desired processing activities. In EC, any processing is performed over a number of geo-distributed datasets formulated by the collected data that exhibit specific statistical characteristics. Processing can have the form of tasks requested by end users or applications. It becomes obvious that in the EC ecosystem, we have to carefully decide the EC nodes that will host and execute any requested task. In this paper, we extend …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Large scale circuit simulation exploiting combinatorial multigrid on massively parallel architectures",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376654/",
            "Abstract": "The complexity of modern very large scale integrated circuits renders circuit simulation very essential in the design process, as it is the only feasible way to verify circuit's behaviour prior to manufacturing. The heart of circuit simulation relies on the solution of huge systems resulting after the modelling using Modified Nodal Analysis. Matrices arising in those systems are sparse Symmetric Diagonally Dominant (SDD) matrices, and as a result, iterative methods for efficiently manipulating them are very crucial to the performance of the simulation. In recent years, the emphasis has been placed on preconditioning methods which reduce the number of iterations for solving such systems, while significant advancements have been accomplished in efficient implementations on massively parallel architectures like GPUs. This paper presents a GPU-accelerated simulator, based on the Preconditioned Conjugate Gradient …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "User authentication method and implementation using a three-axis accelerometer",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-16644-0_18",
            "Abstract": "The rapid growth of accelerometer use on consumer electronics has brought an opportunity for unique user authentication. We present an efficient recognition algorithm for such interaction using a single three-axis accelerometer. Unlike common user authentication methods which require memorizing complex phrases and are prone to physical attacks, our method requires a single training sample for a gesture pattern which allows users to authenticate themselves in a fast and secure manner. Our work imitates the use of physical handwritten signatures, which are a common authentication technique and tries to integrate them in a digital form. The presented method aims at providing easy to remember personalized gesture passwords through the muscle memory ability of the human body. An implementation using the wii remote sensor, along with identification results for different users is presented as a …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Tktimer: fast & accurate clock network pessimism removal",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7001415/",
            "Abstract": "As integrated circuit process technology progresses into the deep sub-micron region, the phenomenon of process variation has a growing impact on the design and analysis of digital circuits and more specifically in the accuracy and integrity of timing analysis methods. The assumptions made by the analytical models, impose excessive and unwanted pessimism in timing analysis. Thus, the necessity of removing the inherited pessimism is of utmost importance in favour of accuracy. In this paper an approach to the common path pessimism removal timing analysis problem, TKtimer, is presented. By utilizing certain key techniques such as branch-and-bound, caching, tasklevel parallelism and enhanced algorithmic techniques, the approach described by this paper is able to handle any type and size of clock network trees and showed 100% accuracy combined with reasonable execution time within a straightforward …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A 3-D hybrid Jiles-Atherton/Stoner-Wohlfarth magnetic hysteresis model for inductive sensors and actuators",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1634426/",
            "Abstract": "The Jiles-Atherton (JA) theory of hysteresis is currently used in the majority of commercial CAD tools, mainly due to its implementation simplicity in fast and stable algorithms. The JA model provides precise results in the case of isotropic, polycrystalline, multidomain magnetic devices, where flux-reversal is governed by pinning mechanisms. Dynamic response of such devices, including Eddy-current loss and magnetic resonance, can also be accurately modeled. However, JA theory is not applied for three-dimensional (3-D) magnetization simulations and does not account for anisotropy that affects severely hysteresis curves of single-domain, thin-film devices, which are usually incorporated in miniature inductive sensors and actuators. In that case, the Stoner-Wohlfarth (SW) theory can be applied, which, however, does not account for dynamic response and incremental energy loss. In this work, we employ a virtual 3 …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for secure data delivery in wireless sensor networks",
            "Publication year": 2012,
            "Publication url": "https://search.proquest.com/openview/4b56b920b77838b9fb946633ed577cfe/1?pq-origsite=gscholar&cbl=52938",
            "Abstract": "Typical sensor nodes are resource constrained devices containing user level applications, operating system components, and device drivers in a single address space, with no form of memory protection. A malicious user could easily capture a node and tamper the applications running on it, in order to perform different types of attacks. In this paper, we propose a 3-layer Security Framework composed by physical security schemes, cryptography of communication channels and live forensics protection techniques that allows for secure WSN deployments. Each of the abovementioned techniques maximizes the security levels leading to a tamper proof sensor node. By applying the proposed security framework, secure communication between nodes is guaranteed, identified captured nodes are silenced and their destructive effect on the rest of the network infrastructure is minimized due to the early measures applied …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:4JMBOYKVnBMC",
            "Publisher": "IFSA Publishing, SL"
        },
        {
            "Title": "Fuzzy cognitive map-based sustainable socio-economic development planning for rural communities",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/606944",
            "Abstract": "Every development and production process needs to operate within a circular economy to keep the human being within a safe limit of the planetary boundary. Policymakers are in the quest of a powerful and easy-to-use tool for representing the perceived causal structure of a complex system that could help them choose and develop the right strategies. In this context, fuzzy cognitive maps (FCMs) can serve as a soft computing method for modelling human knowledge and developing quantitative dynamic models. FCM-based modelling includes the aggregation of knowledge from a variety of sources involving multiple stakeholders, thus offering a more reliable final model. The average aggregation method for weighted interconnections among concepts is widely used in FCM modelling. In this research, we applied the OWA (ordered weighted averaging) learning operators in aggregating FCM weights, assigned by various participants/stakeholders. Our case study involves a complex phenomenon of poverty eradication and socio-economic development strategies in rural areas under the DAY-NRLM (Deendayal Antyodaya Yojana-National Rural Livelihoods Mission) in India. Various scenarios examining the economic sustainability and livelihood diversification of poor women in rural areas were performed using the FCM-based simulation process implemented by the “FCMWizard” tool. The objective of this study was three-fold:(i) to perform a brief comparative analysis between the proposed aggregation method called “OWA learning aggregation” and the conventional average aggregation method,(ii) to identify the significant concepts and their …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:W5xh706n7nkC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "More Than Structured Programming in Primary School Syllabus",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=uF7XDwAAQBAJ&oi=fnd&pg=PA212&dq=info:vFLoEBtkP_AJ:scholar.google.com&ots=WF6gNBx2aK&sig=htr6XLZDcgb0-P1SWARMrfkpGZ0",
            "Abstract": "Computer programming was introduced to primary schools by many countries with the aim of advancing logic and algorithmic thinking of students. The bulk of a typical syllabus (eg, in the case of Greece) for computer programming courses at 5th and 6th grade primary school, consists of teaching structured programming concepts. While the comprehension of basic program flow concepts such as branch instructions and loops is of paramount importance, overextending the teaching of the basics may lead to students losing their interest due to lack of challenge. On the other hand, in a mixed classroom environment there exist both students with substantial skills in modern computer technology and others with smaller such experience, eg, due to societal and economic factors. To avoid discouraging both the talented pupils by re-visiting the same topics and the less experienced ones by not providing an alternative way of learning, we investigate instructing advanced computer programming concepts in a playful way using pair programming. Results reveal that teaching advanced programming concepts using pair programming can improve the overall programming skills of mixed classroom students.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Collecting and Using Vessel s live data from on board equipment using ‘Internet of Vessels (IoV) platform’",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=3637951021177823253&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Teaching concurrent programming concepts using Scratch in primary school: Methodology and Evaluation",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Nikos-Zygouris/publication/325887536_Teaching_Concurrent_Programming_Concepts_Using_Scratch_in_Primary_School_Methodology_and_Evaluation/links/5b2bc3c04585150d23bd72e1/Teaching-Concurrent-Programming-Concepts-Using-Scratch-in-Primary-School-Methodology-and-Evaluation.pdf",
            "Abstract": "Computer programming can help children develop problem solving and analytical skills. Thus, many countries have included computer science in the curriculum of primary school. Given differences in culture, available infrastructures, as well as the age pupils are introduced to computer science, forming a computer science curriculum still remains a challenge. Towards this end, this study focuses on exploring the potential merits of introducing concurrent programming concepts early in the learning process. The basic premise is that although concurrent programming at its full details is a rather advanced topic even at university level, it is everyday practice to perform two or more tasks simultaneously that might need (or not) some sort of synchronization. Therefore, the tutor can capitalize on everyday experience to explain basic concepts on concurrency. Such correlation between life experience and concurrent programming challenges may expand the cognitive functions of the pupils and provide them with further background to improve analytical thinking. The proposed curriculum for fifth and sixth grade primary school was adopted in seven classes in Greece. Results indicate that uninitiated to programming pupils at the age of ten (fifth grade) were able to comprehend basic concurrency topics, while pupils at the age of eleven (sixth grade) with some programming familiarity were able to understand more advanced concepts.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MAXIMUM POWER ESTIMATION IN CMOS VLSI CIRCUITS",
            "Publication year": 2001,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812810861_0076",
            "Abstract": "The problem of maximum power estimation in CMOS VLSI circuits is addressed. Estimation of a chip's maximum power requirements, as they relate to electromigration and IR-drop failures in its supply bus is becoming important as we move into the deep-submicron where guardbanding that has been used up to now is no longer acceptable. An approach of statistical nature, based on recent advances in the field of extreme value theory is proposed. Expertimental results establish our claims and they demonstrate the overall efficiency of the proposed approach in comparison to previously employed techniques.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large-scale power grid analysis on parallel architectures",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US10671787B2/en",
            "Abstract": "Systems and methods related to fast simulation of power delivery networks are described. A method is provided for simulating the time-domain responses of a plurality of points of a multi-layer power delivery network, comprising selecting a model of the power delivery network of a circuit, parsing the characteristic data describing the power delivery network, forming a circuit matrix relating to said circuit characteristic data, creating a preconditioner matrix with a specialized structure that allows solution by a Fast Transform solver, simulating the circuit using said circuit and preconditioner matrices by a computer, including a non-transitory computer readable storage medium and at least one processor, but preferably multiple processors, and reporting the responses at selected nodes and branches of the power delivery network.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SER analysis of multiple transient faults in combinational logic",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2984393.2984414",
            "Abstract": "In the VLSI field, reliability of chips is a major issue and it becomes more significant considering the continuous technology down-scaling. Modern chips are extremely sensitive to various factors such as radiation and, thus, it is crucial to implement tools for the evaluation of their vulnerability to the aforementioned hazards. We present a Soft Error Rate estimation methodology for sequential circuits, based on Monte-Carlo simulations and taking into account Multiple Event Transients. Our tool incorporates the masking effects in order to quantify the number of transients that will be latched from the sequential elements. The verification with HSPICE shows a deviation of about 10%.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "2D simulator for eddy current field filters",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1877705811057754",
            "Abstract": "Hall devices are magnetic field current sensors based on the Hall effect. A bias current is applied via contacts through the Hall plates which are placed along magnetic field. High frequency components affect the Hall plates in a non- linear manner, disturbing the uniform biasing current flow. This problem can be alleviated by the development of a flux shaping device. A CAD tool is presented here, which can simulate the behavior of shields with different shape in order to choose the one that may be optimally used.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A tool for calculating energy consumption in wireless sensor networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_58",
            "Abstract": "Energy and total useful lifetime are primary design concerns of fundamental importance, in a variety of real life applications, where the deployment of a Wireless Sensor Network is desired. In this paper the authors introduce AVAKIS, a tool for calculating the energy consumption of the various components of a sensor node. The proposed tool is an architectural level simulator, in which the system building blocks are described by a high level behavioral model. The methodology used in order to estimate power consumption is based on both the characteristics of the components, and on a number of user-defined initialization parameters.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Collecting and using vessel's live data from on board equipment using “Internet of Vessels (IoV) platform”(May 2017)",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8088242/",
            "Abstract": "The purpose of this paper is a presentation of a recursive project (a platform), that started three years ago, in which shore management companies can collect, transmit, store, analyze and finally use and present vessels live data on a Geographical Information System used as Global Monitoring Platform. We used those data for further analysis, and we produced information about engine performance, gas emissions, navigation, Vessel performance etc. The produced information of the above data could be used as an input to a support decision system or to an alerting system, back to the Maritime Company that monitors the Vessel.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Global and Pointer Variables in High-Level Synthesis",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9221802/",
            "Abstract": "High-level synthesis (HLS) has been an important tool in digital circuit design for more than two decades, especially for processor components like accelerators or coprocessors. However, many high-level language characteristics have not been ported in such tools, under the false assumption that HLS programmers have a good understanding of hardware and of how actual circuits operate. This work is concentrated on the use of global and static variables in HLS. Such variables are often not allowed in HLS tools, since their storage class makes their support difficult. We will present an intelligent global and static variable placement methodology, which attempts to nullify the negative effects of supporting such variables, by carefully selecting variables to be placed globally, within an appropriate memory module. Addressing of such a module is direct, which allows the use of static pointers in the input high-level …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:EYYDruWGBe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On formulating and tackling integrated circuit placement as a scheduling problem",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801965",
            "Abstract": "Integrated circuit (IC) placement consists of placing the cells of the IC on a chip plane so that overall performance is optimized. Various performance criteria have been considered with the most common being wire length. In this paper we tackle the problem with the optimization goal of reducing end to end delay, also called critical or longest path. We investigate the case where the chip plane has a priori (before placement)\" sweet\" spots, discuss its complexity and show the problem's relevance to job scheduling. In the experimental evaluation we provide hindsight on the optimization margins of scheduling heuristics.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:dfsIfKJdRG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Efficient sparsification of dense circuit matrices in model order reduction",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3287624.3287658",
            "Abstract": "The integration of more components into ICs due to the ever increasing technology scaling has led to very large parasitic networks consisting of million of nodes, which have to be simulated in many times or frequencies to verify the proper operation of the chip. Model Order Reduction techniques have been employed routinely to substitute the large scale parasitic model by a model of lower order with similar response at the input/output ports. However, all established MOR techniques result in dense system matrices that render their simulation impractical. To this end, in this paper we propose a methodology for the sparsification of the dense circuit matrices resulting from Model Order Reduction, which employs a sequence of algorithms based on the computation of the nearest diagonally dominant matrix and the sparsification of the corresponding graph. Experimental results indicate that a high sparsity ratio of the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:tkaPQYYpVKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A macromodel technique for VLSI dynamic simulation by mapping pre-characterized transitions",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4751900/",
            "Abstract": "Accurate simulation of digital circuits is an essential part of the design process. High precision models are generally used to confirm logic behavior and estimate power dissipation, which has become an extremely important design parameter. Unfortunately high precision analysis is expensive in computer execution time, and there is always a trade-off between accuracy and speed. This work proposes a new circuit simulation approach by storing a set of pre-characterized transition configurations for each standard library cell in a lookup table. The lookup table contains information about the voltage and the current transient waveform produced by SPICE simulation. The method achieves good accuracy levels for yielding the total or partial current waveform of a circuit in significantly less time compared to SPICE or other commercial tools.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Participatory modelling for poverty alleviation using fuzzy cognitive maps and OWA learning aggregation",
            "Publication year": 2020,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0233984",
            "Abstract": "Participatory modelling is an emerging approach in the decision-making process through which stakeholders contribute to the representation of the perceived causal linkages of a complex system. The use of fuzzy cognitive maps (FCMs) for participatory modelling helps policy-makers develop dynamic quantitative models for strategising development interventions. The aggregation of knowledge from multiple stakeholders provides consolidated and more reliable results. Average aggregation is the most common aggregation method used in FCMs-based modelling for weighted interconnections between concepts. This paper proposes a new aggregation method using learning OWA (ordered weighted averaging) operators for aggregating FCM weights assigned by various stakeholders. Besides, we report a comparative analysis of ‘OWA learning aggregation’ with the conventional average aggregation method, while evaluating the theory of change for the world’s most extensive poverty alleviation programme in India. The results of the FCMWizard web-based tool show that the proposed method provides an opportunity to policy-makers for evaluating outcomes of proposed policies while addressing social resilience and economic mobility.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "A Preconditioned Iterative Approach for Efficient Full Chip Thermal Analysis on Massively Parallel Platforms",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/383970",
            "Abstract": "Efficient full-chip thermal simulation is among the most challenging problems facing the EDA industry today, especially for modern 3D integrated circuits, due to the huge linear systems resulting from thermal modeling approaches that require unreasonably long computational times. While the formulation problem, by applying a thermal equivalent circuit, is prevalent and can be easily constructed, the corresponding 3D equations network has an undesirable time-consuming numerical simulation. Direct linear solvers are not capable of handling such huge problems, and iterative methods are the only feasible approach. In this paper, we propose a computationally-efficient iterative method with a parallel preconditioned technique that exploits the resources of massively-parallel architectures such as Graphic Processor Units (GPUs). Experimental results demonstrate that the proposed method achieves a speedup of 2.2× in CPU execution and a 26.93× speedup in GPU execution over the state-of-the-art iterative method. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:Mojj43d5GZwC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A power-supply noise aware dynamic timing analysis methodology, based on a statistical prediction engine",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8368570/",
            "Abstract": "As technologies continue to shrink, industry seeks even faster ultra-low power ICs, requiring more accurate estimation of the worst case delay. Although traditional Static Timing Analysis (STA) methods incorporate data regarding interconnects and noise over power supply networks, they are still considered to be overly pessimistic. The only way to accurately capture dynamic effects in the estimation of the worst case delay is through Dynamic Timing Analysis (DTA). In this paper we propose a novel methodology to precisely estimate a tight upper bound of the worst case delay, using Extreme Value Theory on the results of voltage drop-aware simulation.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:D_sINldO8mEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Precise identification of the worst-case voltage drop conditions in power grid verification",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1233501.1233526",
            "Abstract": "Identifying worst-case voltage drop conditions in every module supplied by the power grid is a crucial problem in modern IC design. In this paper we develop a novel methodology for power grid verification which is based on accurately constructing the space of current variations of the supplied modules and locating its precise points that yield the worst-case voltage drop conditions. The construction of the current space is performed via plain simulation and statistical extrapolation using results from extreme value theory. The method overcomes limitations of past methods which either relied on loosely bounding the worst-case voltage drop, or abstracted the current space in a vague and incomplete set of bound-type constraints. Experimental results verify the potential of the proposed method to identify worst-case conditions and demonstrate the pessimism inherent in previous bound-type approaches.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Tetris-based legalization heuristic for standard cell placement with obstacles",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376559/",
            "Abstract": "Legalization techniques are used both as a final stage and potentially as part of an iterative process of a global cell placement algorithm that distributes cells over a chip area in order to optimize criteria such as wirelength, routability, thermal dissipation etc. Although very efficient dynamic programming algorithms exist for standard cell placement legalization they usually incur high computational complexity, thus, might not be appropriate for acting as subcomponents in an iterative global placement process. On the other hand fast, single pass approaches such as Tetris heuristic, may offer low performance in terms of final placement quality. In this paper we turn our attention to legalization in standard cell placement under the presence of obstacles, with the aim of developing a fast yet efficient solution for the problem. The proposed heuristic is based on Tetris and involves judicious chip area splitting. Experiments with …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:q3oQSFYPqjQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast transform-based preconditioners for large-scale power grid analysis on massively parallel architectures",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2429384.2429466",
            "Abstract": "Efficient analysis of massive on-chip power delivery networks is among the most challenging problems facing the EDA industry today. In this paper, we present a new preconditioned iterative method for fast DC and transient simulation of large-scale power grids found in contemporary nanometer-scale ICs. The emphasis is placed on the preconditioner which reduces the number of iterations by a factor of 5X for a 2.6 M-node industrial design and by 72.6X for a 6.2 M-node synthetic benchmark, compared with incomplete factorization preconditioners. Moreover, owing to the preconditioner's special structure that allows utilizing a Fast Transform solver, the preconditioning system can be solved in a near-optimal number of operations, while it is extremely amenable to parallel computation on massively parallel architectures like graphics processing units (GPUs). Experimental results demonstrate that our method …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Decision-making process for photovoltaic solar energy sector development using fuzzy cognitive map technique",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/668446",
            "Abstract": "Photovoltaic Solar Energy (PSE) sector has sparked great interest from governments over the last decade towards diminution of world’s dependency to fossil fuels, greenhouse gas emissions reduction and global warming mitigation. Photovoltaic solar energy also holds a significant role in the transition to sustainable energy systems. These systems and their optimal exploitation require an effective supply chain management system, such as design of the network, collection, storage, or transportation of this energy resource, without disregarding a country’s certain socio-economic and political conditions. In Brazil, the adoption of photovoltaic solar energy has been motivated not only by the energy matrix diversification but also from the shortages, problems, and barriers that the Brazilian energy sector has faced, lately. However, PSE development is affected by various factors with high uncertainty, such as political, social, economic, and environmental, that include critical operational sustainability issues. Thus, an elaborate modelling of energy management and a well-structured decision support process are needed to enhance the performance efficiency of Brazilian PSE supply chain management. This study focuses on the investigation of certain factors and their influence on the development of the Brazilian PSE with the help of Fuzzy Cognitive Maps. Fuzzy Cognitive Map is an established methodology for scenario analysis and management in diverse domains, inheriting the advancements of fuzzy logic and neural networks. In this context, a semi-quantitative model was designed with the help of various stakeholders from the specific energy …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:tKAzc9rXhukC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Electromigration: Estimation methodology for the sub-45nm era",
            "Publication year": 2014,
            "Publication url": "https://www.academia.edu/download/35911464/156.pdf",
            "Abstract": "Electromigration is starting to be one of the most significant problems considering reliability in integrated circuits design. The problem is induced by the large current density in circuit interconnections. Furthermore, the continuous reduction of the size of the integrated and the simultaneous increase of the currents flowing in semiconductors have introduced challenges in the design that increasingly are taking into consideration electromigration. The present work outlines the implementation of a tool that checks for violations in integrated circuits due to electromigration and calculates the mean time to failure based upon Black’s formula. Finally, the calculations take into account information like the self-healing effect and the mean current besides the maximum current, unlike most other academic and commercial tools.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:ldfaerwXgEUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Domocus: Lock free parallel legalization in standard cell placement",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937644/",
            "Abstract": "In the cell placement problem a circuit's cells must be placed within a specified chip area so that they are row aligned and contain no overlaps. The problem is usually tackled in phases, whereby in the first phase a global placer performs an initial spreading of cells with regards to some optimization criterion, most commonly wire length minimization. The output of the first phase might violate alignment and overlap constraints, therefore in a second phase, called legalization, the target is to restore constraint violations while incurring minimal changes compared to global placement. Since legalization may also be a subcomponent of iterative global placers, efficient algorithms both in terms of solution quality and running time are of paramount importance. In this paper we present a framework for lock-free parallelism of legalization scheme. The framework is evaluated using Abacus, an algorithm that is well documented …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Review of Learning Design Choices of Primary School Programming Courses in Empirical Researches",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9453891/",
            "Abstract": "Programming, most recently in the form of Computational Thinking (CT), is emerging as a new subject in primary schools worldwide. By data-based decision making, teachers, as learning designers, make decisions on instruction design based on a broad range of evidence, such as student assessment scores and classroom teaching observations. Given the current limitations on conclusive, field-proven teaching practices and an underlying “culture” to use as a basis, we turn to pertinent empirical studies that the growing scientific interest on introducing programming in primary school curricula has produced. The hypothesis is that we may overcome the lack of extensive experience in designing a programming course by reviewing the above evidence, in order to frame learning situations and methods.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Live forensics framework for wireless sensor nodes using sandboxing",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1868630.1868643",
            "Abstract": "Typical sensor nodes are resource constrained devices containing user level applications, operating system components, and device drivers in a single address space, with no form of memory protection. A malicious user could easily capture a node and tamper the applications running, in order to perform different types of attacks. In this paper, we propose a remote live forensics protection architecture that prevents the execution of tampered software while alarming the owners of the sensors network. Using sandboxing to restrict application memory accesses within the address space and forensic techniques to validate the authenticity of the running applications we prevent malicious code from being executed while specifying the intrusion.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Placement-based SER estimation in the presence of multiple faults in combinational logic",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8106949/",
            "Abstract": "Susceptibility of modern ICs to radiation-induced faults constitutes a matter of great concern in the recent years. Particularly, the transient faults and their impact on the combinational logic remain an intriguing issue, since the evaluation of their behavior is quite significant, especially for critical systems, for the development of error-resistant techniques in design process. For an accurate estimation of Soft Error Rate both single and multiple transient faults should be regarded since the appearance of the latter is more noticeable as technology downscales. The proposed tool, i.e. SER estimator, is based on Monte-Carlo simulations, in order to obtain an accurate result, and takes advantage of placement information to identify the vulnerable parts of a circuit. Finally, the verification shows a fairly good accuracy compared with SPICE.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Hotspot Thermal Simulation Via Low-Rank Model Order Reduction",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8434858/",
            "Abstract": "Efficient full-chip thermal simulation is among the most challenging problems facing the EDA industry today, due to the need for solution of very large systems of equations that require unreasonably long computational times. However, in most cases, temperature is not required to be computed at every point of the IC but only at certain hotspots, in order to assess the circuits compliance with thermal specifications. This makes the thermal analysis problem amenable to Model Order Reduction (MOR) techniques. System-theoretic techniques like Balanced Truncation (BT) offer very reliable bounds for the approximation error, which can be used to control the order and accuracy of the reduced models during creation, at the expense of greater computational complexity to create them. In this paper, we propose a computationally efficient low-rank BT algorithm that retains all the system-theoretic advantages in the reduction …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:1qzjygNMrQYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Architectural and compiler techniques for energy reduction in high-performance microprocessors",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/845897/",
            "Abstract": "In this paper, we focus on low-power design techniques for high-performance processors at the architectural and compiler levels. We focus mainly on developing methods for reducing the energy dissipated in the on-chip caches. Energy dissipated in caches represents a substantial portion in the energy budget of today's processors. Extrapolating current trends, this portion is likely to increase in the near future, since the devices devoted to the caches occupy an increasingly larger percentage of the total area of the chip. We propose a method that uses an additional minicache located between the I-Cache and the central processing unit (CPU) core and buffers instructions that are nested within loops and are continuously otherwise fetched from the I-Cache. This mechanism is combined with code modifications, through the compiler, that greatly simplify the required hardware, eliminate unnecessary instruction fetching …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Managing forest fires with i-protect fire simulation module",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6377406/",
            "Abstract": "Emergency management is an essential capability in modern society. As disasters can happen at any time and can differ from each other considerably, it is necessary to develop a supple framework which can comply with each situation. This article discusses the fire simulation component of i-Protect. i-Protect is an Emergency Management Framework aiming to support emergency management process during the four phases of a crisis: mitigation, preparedness, response and recovery.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "i-Protect: An open source emergency management framework",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6065119/",
            "Abstract": "Emergency management is an essential capability in modern society. As disasters can happen at any time and can differ from each other considerably, it is necessary to develop a supple framework which can comply with each situation. The aim of this paper is to provide an overview of the i-Protect Emergency Management Framework and analyze in details each of its components. As a proof of concept, we also present two case studies: an urban chemical explosion and a wildland fire simulation engine.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient Circuit Reduction in Limited Frequency Windows",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8795231/",
            "Abstract": "Model Order Reduction (MOR) has become key enabler for the efficient simulation of large circuit models. MOR techniques based on Balanced Truncation (BT) offer very good error estimates and can provide compact models with any desired accuracy over the whole range of frequencies (from DC to infinity). However, in most applications the circuit is only intended to operate at specific frequency windows, which means that the reduced-order model can become unnecessarily large to achieve approximation over all frequencies. In this paper, we present a frequency-limited approach which, combined with low-rank factorized solution, can handle large input models and provably leads to reduced-order models that are either smaller or exhibit better accuracy than full-frequency BT.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:VL0QpB8kHFEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance Evaluation of Batch Encodings in HEVC Using Slice Level Parallelism",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003782",
            "Abstract": "HEVC has emerged as the new video standard to replace H. 264/AVC. Although the new standard is able to achieve significantly higher compression ratios compared to the older one, it entails high computational demands. To alleviate the problem, parallelism opportunities are offered by the standard at different levels namely, slice, tile and wave front. In this paper we evaluate the performance of slice level parallelism in HEVC encoding. Although significant previous work exists on slice parallelization, particularly for H. 264/AVC, usually the experimental evaluation was limited to characterizing the performance when encoding one sequence at a time. Our focus is to evaluate slice parallelism when a batch of encoding jobs is submitted to the system, with CPU core requirements potentially exceeding the available resources.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance and power simulation of a functional-unit-network processor with simplescalar and wattch",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2801948.2801958",
            "Abstract": "Loop acceleration is a means to enhance performance of a single-or multiple-issue microprocessor core. A new edge-like processor architecture incorporates a loop accelerator directly in the out-of-order back end of the processor, forming an extended hypercube interconnected network of functional unit nodes. In this work, we have simulated a full processor pipeline of our architecture in a high-level language. In particular, we have extended the Simplescalar, a well-known processor simulator, to include our multifunctional-unit back-end design, and to support our special instructions for loop acceleration. Thus, instructions forming qualified loops are scheduled and dispatched only once for execution, remaining in the back end for all loop iterations, interchanging values in a data-flow fashion. We have also utilized the Wattch power estimation tool, which has been traditionally coupling Simplescalar to produce an …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accurate estimation of dynamic timing slacks using event-driven simulation",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9137017/",
            "Abstract": "The pessimistic nature of conventional static timing analysis has turned the attention of many studies to the exploitation of the dynamic data-dependent excitation of paths. Such studies may have revealed extensive dynamic timing slacks (DTS), however, they rely on frameworks that inherently make worst-case assumptions and still ignore some data-dependent timing properties. This may cause significant DTS underestimation, leading to unexploited frequency scaling margins and incorrect timing failure estimation. In this paper, we develop a framework based on event-driven timing simulation that identifies the underestimated DTS, and evaluate its gains on various post-place-and-route designs. Experimental results show that our event-driven simulation scheme achieves on average 2.35% and up-to 194.51% DTS improvement over conventional graph-based techniques. When compared to existing frequency scaling …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:j8SEvjWlNXcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comparative transcriptomics of sporadic Parkinson's disease and Tuberculosis gene expression data: a data-driven case for a second hit, outside in copper-phagosome disorder",
            "Publication year": 2020,
            "Publication url": "https://scholar.google.com/scholar?cluster=10683262903447805960&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:vDijr-p_gm4C",
            "Publisher": "WILEY"
        },
        {
            "Title": "A statistically-based engine for p/g network optimization",
            "Publication year": 2005,
            "Publication url": "https://ir.lib.uth.gr/xmlui/handle/11615/29022",
            "Abstract": "The problem of optimum design of general (tree or graph-based) power distribution networks with respect to the voltage drop effect is addressed in this paper. A rigorous formulation based on linear circuit theory is established for the relevant constrained optimization problem, so that the resultant network occupies the minimum possible area under specific voltage drop constraints at all IC functional blocks. The necessary maximum current estimates for the optimization procedure are accurately obtained - by statistical means - from recent advances in the field of extreme value theory. Experimental tests include the design of power grid for a choice of different topologies and voltage drop tolerances in a typical benchmark circuit.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Instruction-Flow-Based Timing Analysis in Pipelined Processors",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8956266/",
            "Abstract": "Microprocessor design utilizes timing analysis in order to establish the maximal operation clock speed of the circuit. In static timing analysis, clock frequency is set in accord with the worst-case delay in the circuit operation, regardless of the possible circuit inputs. Dynamic timing analysis approaches consider variations in the inputs, obtaining more accurate values for the clock speed. However, such methodologies are in general very slow. Recent research on static timing analysis is focused on better-than-worst-case algorithms, which attempt to introduce a dynamic flavor to the static approach. The work presented in this paper is concentrated on a certain aspect of better-than-worst-case timing analysis for processor design, obtaining a more optimistic clock speed than the one produced by pure static analysis. Certain variations of the inputs to the processor circuit are considered, in order to overcome the limitations …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:JQOojiI6XY0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A design flow for the precise identification of the worst-case voltage drop in power grid analyses",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4621551/",
            "Abstract": "Modern IC designs contain hundreds of millions of transistors and new approaches of multicore chips take place in commercial products. Identifying worst-case voltage drop conditions in every hierarchical module supplied by the power grid is a crucial reliability problem in modern IC design. In this paper we focused our efforts on a complete design flow using innovative results of our recent research work. This approach demonstrates a new implementation of construction of the current space which is performed via plain simulation and statistical extrapolation using results from extreme value theory. Experimental results verify the potential of the estimation engine using industrial EDA tools and perform power grid verification using a custom hierarchical design.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:maZDTaKrznsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SCIZER: A scalable placement visualizer/analyzer",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8089993/",
            "Abstract": "The major design challenges of ASIC design, like power dissipation, timing, voltage-drop, interconnect and reliability are tackled during the Physical Design phase of any flow. The placement procedure can significantly modify parts of the design and consequently metrics relevant to the aforementioned challenges. Text reports cannot always generate useful insight based solely on these metrics. Design visualization can be of utmost importance in deciding if the placement strategy followed is leading to fruition. In this paper we present a placement visualizer/analyzer that helps capture the most critical aspects of a placed design and empowers the user to draw safer conclusions concerning the quality of the final result.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Survey of Fault Diagnosis and Accommodation of Unmanned Underwater Vehicles.",
            "Publication year": 2018,
            "Publication url": "https://www.academia.edu/download/64485654/Survey%20of%20fault%20diagnosis%20and%20accommodation%20of%20unmanned%20underwater%20vehicles.pdf",
            "Abstract": "In the last years, the use of unmanned underwater vehicles in various applications such as monitoring, inspection and surveillance of underwater facilities, has been significantly increased. The mission success depends heavily on the ability to diagnose, isolate and accommodate faults that may occur in the thrusters and sensors of the vehicles during the operation. This paper presents an overview on the methods employed for thruster and sensor fault detection, isolation and accommodation of underwater robotic vehicles.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Work in Progress: Web-Delivered Reading Improvement Battery of Tasks",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68198-2_59",
            "Abstract": "Learning to read requires the development of highly organized brain systems that are capable of incorporating spelling, phonological and lexical-semantic features of written words. The main aim of the present research protocol is to strengthen the speed and accuracy of phonological awareness for children with reading impairments by designing and implementing a web delivered set of tasks. “Poke the Reading Ability” is a web-delivered application, that helps readers increase their reading speed, accuracy and comprehension by training them to avoid subvocalization (saying words in their head while reading), backtracking (going back to re-read words or sentences), and fixations, factors that have negative effects on reading speed and accuracy. “Poke the Reading Ability” includes a graphical environment that encourages learners to complete activities, while “playing an internet game”. HTML5, CSS …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Power reduction in an H. 264 encoder through algorithmic and logic transformations",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1165573.1165598",
            "Abstract": "The H. 264 video coding standard can achieve considerably higher coding efficiency than previous video coding standards. The keys to this high coding efficiency are the two prediction modes (Intra & Inter) provided by H. 264. Unfortunately, these result in a considerably higher encoder complexity that adversely affects speed and power, which are both significant for the mobile multimedia applications targeted by the standard. Therefore, it is of high importance to design architectures that minimize the speed and power overhead of the prediction modes. In this paper we present a new algorithm, and the logic transformations that enable it, that can replace the standard Sum of Absolute Differences (SAD) approach in the two main prediction modes, and provide a power efficient hardware implementation without perceivable degradation in coding efficiency or video quality.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Layout-Based Soft Error Rate Estimation and Mitigation in the Presence of Multiple Transient Faults in Combinational Logic",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9137014/",
            "Abstract": "Cosmic radiation resulting in transient faults to the combinational logic of Integrated Circuits (ICs), constitutes a major reliability concern for space applications. In addition, continuous technology shrinking allows for the presence of Single-Event-Multiple-Transients (SEMTs), and renders modern chips more susceptible to soft errors. The study and evaluation of the impact of such errors on ICs functionality, as well as the pursuit of techniques to mitigate Soft Error Rate (SER), tend to become an essential part of the design process. This paper presents a Monte-Carlo-based SER estimation method, taking into account all masking mechanisms, which determines the vulnerable areas of a circuit based on layout information. Two layout-aware approaches are examined, the All-to-All and TMR-based, resulting in sufficient SER mitigation. The former, implies spacing among all components, while the latter converts the most …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Heuristics to augment the performance of Tetris legalization: making a fast but inferior method competitive",
            "Publication year": 2017,
            "Publication url": "https://www.ingentaconnect.com/contentone/asp/jolpe/2017/00000013/00000002/art00005",
            "Abstract": "As process minimum feature sizes shrink, interconnect capacitance becomes a larger proportion of the total switched capacitance, thus standard cell and component placement increasingly affects power consumption. Therefore, minimizing the total interconnect wire length becomes a power reduction exercise as well. The final step of a standard cell placement process consists of legalization where the target is to eliminate overlaps as well as aligning cell positions to eligible rows. The simplest, yet fastest method in the literature is the Tetris algorithm which is commonly used as a performance yardstick for other more efficient but computationally demanding methods. In this paper we propose and evaluate standalone variations to the basic Tetris algorithm that aim at significantly improving its performance sometimes at the expense of running time. We then introduce combinations of the standalone heuristics. All …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:p2g8aNsByqUC",
            "Publisher": "American Scientific Publishers"
        },
        {
            "Title": "Improved Parallel Legalization Schemes for Standard Cell Placement with Obstacles",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/385120",
            "Abstract": "In standard cell placement, a circuit is given consisting of cells with a standard height,(different widths) and the problem is to place the cells in the standard rows of a chip area so that no overlaps occur and some target function is optimized. The process is usually split into at least two phases. In a first pass, a global placement algorithm distributes the cells across the circuit area, while in the second step, a legalization algorithm aligns the cells to the standard rows of the power grid and alleviates any overlaps. While a few legalization schemes have been proposed in the past for the basic problem formulation, few obstacle-aware extensions exist. Furthermore, they usually provide extreme trade-offs between time performance and optimization efficiency. In this paper, we focus on the legalization step, in the presence of pre-allocated modules acting as obstacles. We extend two known algorithmic approaches, namely Tetris and Abacus, so that they become obstacle-aware. Furthermore, we propose a parallelization scheme to tackle the computational complexity. The experiments illustrate that the proposed parallelization method achieves a good scalability, while it also efficiently prunes the search space resulting in a superlinear speedup. Furthermore, this time performance comes at only a small cost (sometimes even improvement) concerning the typical optimization metrics. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Optimization of an Integrated Circuit Placement Algorithm in a Parallel Environment",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/35911471/154.pdf",
            "Abstract": "This paper presents an implementation of GORDIAN [1], a method for Global Placement of standard-cell based circuit designs, incorporating a number of algorithmic optimizations and parallelization in order to reduce the total runtime and memory requirements and improve the solution quality. Experimental results are presented, comparing GODRIAN to other state-of-the-art academic placers, which highlight the improved execution speed and the limited memory footprint which are GORDIAN’s main advantages. Thus, GORDIAN runs faster than any other proven placer while still producing acceptable results, enabling million-cell designs to be placed within a few minutes.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Minimal-area loop pipelining for high-level synthesis with CCC",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8088235/",
            "Abstract": "Increased complexity of computer hardware makes close to impossible to rely on hand-coding at the-level of HDLs for digital hardware design. High-level synthesis can be employed instead, in order to automatically obtain HDL codes from highlevel language functional descriptions. With high-level synthesis it becomes easier to design coprocessors, accelerators, and other special-purpose hardware. Nonetheless, compiler optimizations can improve efficiency of automatically generated hardware descriptions and make high-level synthesis to become the dominant technology to build more complicated hardware as well. Compilers, well known and explored software tools, can allow programmers to use their software skills on hardware programming, without any language compromises. Furthermore, compiler optimizations transform the input code, in order to produce a high-quality high-performance output hardware …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A parallel iterative approach for efficient full chip thermal analysis",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8376634/",
            "Abstract": "Efficient full-chip thermal simulation is among the most challenging problems facing the EDA industry today, especially for modern 3D integrated circuits, due to the huge linear systems resulting from thermal modeling approaches that require unreasonably long computational times. Direct linear solvers are not capable of handling such huge problems and iterative methods are the only feasible approach. In this paper, we propose a computationally efficient iterative method with a parallel preconditioned technique that exploits the resources of massively parallel architectures such as Graphic Processor Units (GPUs). Experimental results, demonstrate that the proposed method achieves a speedup of 2.2X in CPU execution and a 26.93X speedup in GPU execution over the state of the art iterative method.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Characterization of the worst-case current waveform excitations in general RLC-model power grid analysis",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5653921/",
            "Abstract": "Validating the robustness of power distribution in modern IC design is a crucial but very difficult problem, due to the vast number of possible working modes and the high operating frequencies which necessitate the modeling of power grid as a general RLC network. In this paper we provide a characterization of the worst-case current waveform excitations that produce the maximum voltage drop among all possible working modes of the IC. In addition, we give a practical methodology to estimate these worst-case excitations on the basis of a sample of the excitation space acquired via plain circuit simulation. In the course of characterizing the worst-case excitations we also establish that the voltage drop function for RLC grid models has nonnegative coefficients, which has been an open problem so far.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A rigorous approach for the sparsification of dense matrices in model order reduction of RLC circuits",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8806988/",
            "Abstract": "The integration of more components into modern Systems-on-Chip (SoCs) has led to very large RLC parasitic networks consisting of million of nodes, which have to be simulated in many times or frequencies to verify the proper operation of the chip. Model Order Reduction techniques have been employed routinely to substitute the large scale parasitic model by a model of lower order with similar response at the input/output ports. However, all established MOR techniques result in dense system matrices that render their simulation impractical. To this end, in this paper we propose a methodology for the sparsification of the dense circuit matrices resulting from Model Order Reduction of general RLC circuits, which employs a sequence of algorithms based on the computation of the nearest diagonally dominant matrix and the sparsification of the corresponding graph. Experimental results indicate that a high sparsity …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:5awf1xo2G04C",
            "Publisher": "IEEE"
        },
        {
            "Title": "System and method for determining simulated response extrema for integrated circuit power supply networks",
            "Publication year": 2013,
            "Publication url": "https://patents.google.com/patent/US8516423B2/en",
            "Abstract": "Systems and methods related to fast simulation of power supply networks and identification of a set of extrema (eg, maxima or minima) waveforms associated with the power supply networks. In accordance with an embodiment, a method is provided for estimating the worst case voltage drop on the power delivery network of a circuit, comprising selecting a model of a power delivery network of a circuit, simulating the circuit over a predefined number of vectors, collecting dynamic voltage waveforms at each of a plurality of points on the power delivery network, calculating a dynamic worst case voltage waveform at each of the plurality of points, and reporting the dynamic worst case voltage waveform along with an associated confidence interval.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "„Novel Dynamic Technique Reducing the Offset Voltage in a Hall Effect Sensor”",
            "Publication year": 2011,
            "Publication url": "https://scholar.archive.org/work/yp4v3djwdnejrpmhmgbpopl46m/access/wayback/https://www.ama-science.org/proceedings/download/AGD2",
            "Abstract": "Silicon Hall plates show an offset of a few millitesla. $ large portion of this offset is caused by mechanical stress in the device. The offset can be reduced with a factor 103 to 105 when the spinning-current principle is applied. In this paper we present a model and numerical analysis of a new Hall effect sensor which using a novel offset reduction method.We call it “Wheel Hall Senor”. The device exploits the signals attributed to Hall voltage, Hall current and geometric MR effect. $ sa result the device is equivalent to an “ideal” voltage or current Hall sensor with geometrical factor of one (GH= 1). Moreover it provides for high-speed spinning, given that the voltage distribution changes moderately between different phases. This is equivalent to minimum charge inMection that 0 in turn±allows spinning frequency increase. The device senses all 3 filed dimensions, namely the flux-density of%= is proportional to the DC component of the output signal, whereas the%; and%< components are proportional to the first harmonic of the output signal. Finally the device can be made in a way to reuse the current, if integrated in a BiCMOS technology providing for matched JFETs. Furthermore we calculate the function which governs the changes in the electric field inside the new Hall effect sensor in presence of magnetic field. This function help us to control in MatLab environment the equipotential lines and to monitor the changes when biasing conditions are change. The combination of his pioneering form and the elaborate sequence of using the dynamic spinning current technique, leads to satisfactory results of produced Hall voltage with small noise in a presence …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Investigating wireless sensor network lifetime under static routing with unequal energy distribution",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6411757/",
            "Abstract": "In a Wireless Sensor Network (WSN) the sensed data must be gathered and transmitted to a base station where it is further processed by end users. Since that kind of network consists of low-power nodes with limited battery power, power efficient methods must be applied for node communication and data gathering in order to achieve long network lifetimes. In such networks where in a round of communication many sensor nodes have data to send to a base station, it is very important to minimize the total energy consumed by the system so that the total network lifetime is maximized. The lifetime of such sensor network is the time until base station can receive data from all sensors in the network. In this work1, besides the conventional protocol of direct transmission or the use of dynamic routing protocols proposed in literature that potentially aggregates data, we propose an algorithm based on static routing among …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Graph-Based Sparsification and Synthesis of Dense Matrices in the Reduction of RLC Circuits",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9328823/",
            "Abstract": "The integration of more components into modern integrated circuits (ICs) has led to very large  RLC  parasitic networks consisting of millions of nodes that have to be simulated in many times or frequencies to verify the proper operation of the chip. Model order reduction (MOR) techniques have been employed routinely to substitute the large-scale parasitic model with a model of lower order with a similar response at the input–output ports. However, established MOR techniques generally result in dense system matrices that render their simulation impractical. To this end, in this article, we propose a methodology for the sparsification of the dense circuit matrices resulting from MOR of general  RLC  circuits, which employs a sequence of algorithms based on the computation of the nearest diagonally dominant matrix and the sparsification of the corresponding graph. In addition, we describe a procedure for synthesizing …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:tYavs44e6CUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CCSOpt: a continuous gate-level resizing tool",
            "Publication year": 2015,
            "Publication url": "http://mocast.physics.auth.gr/images/NewPapers/PAPER_20F.pdf",
            "Abstract": "Optimal continuous transistor/device sizing has been a holy grail in the EDA community. However, efforts to this end have been hampered by the sheer size of the optimization problem (millions of variables and constraints), modeling issues especially in the timing domain. This research work proposes",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An IoT–Sensor Based Hand Trembling Robotic System for Studying Parkinson’s Symptoms",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Apostolis-Xenakis/publication/344264801_An_IoT_-Sensor_Based_Hand_Trembling_Robotic_System_for_Studying_Parkinson's_Symptoms/links/5f61c5544585154dbbd574ab/An-IoT-Sensor-Based-Hand-Trembling-Robotic-System-for-Studying-Parkinsons-Symptoms.pdf",
            "Abstract": "Several studies related to treatment of Parkinson's disease, have been performed, using mechanical support methods. Most of these studies use accelerometer technology to track the patient's movement with Parkinson's disease, as it enables the recording of full motion range and acceleration in all directions, with great accuracy. With our proposed system, we aim to reflect the patient's hand movements, in real time, as accurately as possible in a robotic arm located remotely inside a laboratory. Additionally, our system records data concerning Parkinson's patient trembling and transmits absolute position and acceleration regarding two points, ie the elbow and the wrist. To do so, we design a lightweight-custom ZigBee protocol, with which the wireless sensors transmits data in an IoT fashion.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of Tetris-based legalization heuristics",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3003733.3003778",
            "Abstract": "Algorithms for standard cell placement legalization have attracted significant research efforts in the past. A prominent member of this category is the Tetris algorithm which is a simple and particularly fast method for legalizing an initial placement containing overlaps. In the relevant literature sophisticated legalization schemes were proposed using Tetris as a performance yardstick. In order to achieve better performance such schemes usually sacrifice the fast running time of Tetris by a large margin. In this paper we turn our focus on simple Tetris variations that improve performance without seriously compromising running time. Specifically, we present five generic heuristic variations of the initial Tetris algorithm. Through experimental evaluation we conclude on the merits of each approach.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:KxtntwgDAa4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Screening Executive Functions of Preschool Children via a Web Application",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-68198-2_12",
            "Abstract": "The present research protocol describes the tasks of a web application that was constructed in order to assess the executive functions of preschool aged children. A total of 65 children four and five years old participated in this study. In order to screen executive functions, we used (1) a go/nogo task, (2) a visual working memory task (3) an auditory working memory task (4) a graph phoneme discrimination task (5) a phonological discrimination task and (6) a visual discrimination task. The results revealed that children at the age of four years old presented lower scores of correct answers and larger latencies in comparison to children at the age of five years. Also, females had more correct answers in the tasks of the web application in comparison to males. Additionally, the main purpose of delivering a screening procedure via internet is to make preschoolers do something useful while perceiving that they are …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:gsN89kCJA0AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Triggering and data collection framework for sensing application level events",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6347563/",
            "Abstract": "In this paper we propose an interface between the various automatic identification devices and the filtering and collection role proposed by the EPCglobal architecture. This interface, namely the read cycle report interface, acts as a generic abstraction layer for all readers, fixed and mobile, imposing a unified approach for communicating data to an ALE server. Moreover, it enables external applications to associate the start or stop of an event cycle with an actual statement occurring in the physical world such as the press of a submit button on a web page, or the scan of a barcode on a printed label or the crossing of a container from a laser beam.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ACM INTERNATIONAL CONFERENCE PROCEEDING SERIES",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=12150325797210977153&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Topology optimization in wireless sensor networks for precision agriculture applications",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4394974/",
            "Abstract": "In this paper a new way to build a wireless sensor network is proposed, which is based on measuring the field's electrical conductivity, staying away from the classic network grid implementation. Furthermore it is explained how a typical WSN works, which are the pros and cons and the technical characteristics, as well as how electrical conductivity can influence the decision to build the WSN topology and the advantage of this approach comparing to the typical ones.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:hMod-77fHWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Uncertainty Driven Workflow Scheduling Using Unreliable Cloud Resources",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9306707/",
            "Abstract": "The Cloud infrastructure offers to end users a broad set of heterogenous computational resources using the pay-as-you -go model. These virtualized resources can be provisioned using different pricing models like the unreliable model where resources are provided at a fraction of the cost but with no guarantee for an uninterrupted processing. However, the enormous gamut of opportunities comes with a great caveat as resource management and scheduling decisions are increasingly complicated. Moreover, the presented uncertainty in optimally selecting resources has also a negatively impact on the quality of solutions delivered by scheduling algorithms. In this paper, we present a dynamic scheduling algorithm (i.e., the Uncertainty-Driven Scheduling - UDS algorithm) for the management of scientific workflows in Cloud. Our model minimizes both the makespan and the monetary cost by dynamically selecting …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A low–power VLSI architecture for intra prediction in h. 264",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11573036_60",
            "Abstract": "The H.264 video coding standard can achieve considerably higher coding efficiency than previous standards. The key to this high code efficiency are mainly the Intra and Inter prediction modes provided by the standard. However, the compression efficiency of the H264 standard comes at the cost of increased complexity of the encoder. Therefore it is very important to design video architectures that minimize the cost of the prediction modes in terms of area, power dissipation and design complexity. A common aspect of the Inter and Intra Prediction modes, is the Sum of Absolute Differences (SAD). In this paper we present a new algorithm that can replace the SAD in Intra Prediction, and which provides a more efficient hardware implementation.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A software tool for FCM aggregation employing credibility weights and learning OWA operators",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8900676/",
            "Abstract": "In this study, we present the functionalities of a new tool for FCMs using credibility weights and OWA-based operators for aggregation tasks. The average aggregation method for weighted interconnections among concepts is the most used method in FCM modeling. The aim of this research work is to (i) propose an alternative aggregation method based on learning OWA operators in aggregating FCM weights, assigned by many experts and/or stakeholders and (ii) to estimate and rank the experts' credibility using a distance-based method. The applicability and usefulness of the proposed methodology in modeling and decision-making is demonstrated using poverty eradication strategies under DAY-NRLM (Deendayal Antyodaya Yojana-National Rural Livelihoods Mission) of India. The results produced by the proposed learning OWA operators are compared with the known average aggregation method of FCMs …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Loop pipelining in high-level synthesis with CCC",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7937663/",
            "Abstract": "High-level synthesis allows the use of high-level programming languages for hardware design. Traditional programming with the C and ADA languages can lead to efficient hardware description through recently developed high-level synthesis tools. Compilers play an important role in this process, since they can bridge differences between software programming and hardware design methodologies, thus making high-level synthesis tools better accepted by the scientific community. Furthermore, modern compiler optimizations can be employed in order to obtain optimal hardware descriptions. Loop transformations are often the focus of compiler optimizations, since they can result in significant performance improvement, for both software and hardware programming. In this paper, we discuss the implementation of loop pipelining in the front-end compiler of the CCC high-level synthesis tool, and in particular we …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:SP6oXDckpogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SMACD 2019-16TH INTERNATIONAL CONFERENCE ON SYNTHESIS, MODELING, ANALYSIS AND SIMULATION METHODS AND APPLICATIONS TO CIRCUIT DESIGN, PROCEEDINGS",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=13891268511625967196&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SPECIAL SECTION ON LOW-POWER ELECTRONICS AND DESIGN-SPECIAL SECTION PAPERS-Architectural and Compiler Techniques for Energy Reduction in High-Performance Microprocessors",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=11377852378255842739&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "New York, NY: Institute of Electrical and Electronics Engineers, c1993-"
        },
        {
            "Title": "EVT-based worst case delay estimation under process variation",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8342220/",
            "Abstract": "Manufacturing process variation in sub-20nm processes has introduced ever increasing overhead in Static Timing Analysis (STA) in order to guarantee the reliable operation of the circuit. Chip designers apply corner-based analysis and add guard-bands to design parameters in order to take into account the impact of process variation on timing. However, the aforementioned techniques are either too slow as the number of design parameters proliferates with the integration of more components into a chip or inaccurate due to the assumption that the worst case delay resides at the corners of design parameters. In this paper, we present a novel statistical methodology, which relies on Extreme Value Theory (EVT), to estimate the worst case delay of VLSI circuits under variations in gate/interconnect parameters. Despite the previous statistical approaches toward maximum delay estimation, our methodology can be …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A power grid analysis and verification tool based on a Statistical Prediction Engine",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724643/",
            "Abstract": "Voltage drops are one of the most stringent problems in modern IC implementation, which is exacerbated by the ever decreasing transistor sizes and interconnect line widths. In order to find the true worst case voltage drop that a power net of a design might suffer, the designer would have to check the voltage drops that occur from the simulation of all possible input vector pairs of a design. This is a prohibitive amount of simulations for modern ICs that have hundreds of inputs. Consequently, designers face two basic challenges, fast and accurate estimation of worst case voltage-drop and accurate modeling of the power distribution network. In this paper we present a voltage-drop aware tool for power grid analysis and verification based on a statistical engine, which can estimate the true worst case voltage drops on a design with a typical confidence level of 99%. The statistical engine is based on extensions to the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "SET Pulse Characterization and SER Estimation in Combinational Logic with Placement and Multiple Transient Faults Considerations",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/614844",
            "Abstract": "Integrated circuit susceptibility to radiation-induced faults remains a major reliability concern. The continuous downscaling of device feature size and the reduction in supply voltage in CMOS technology tend to worsen the problem. Thus, the evaluation of Soft Error Rate (SER) in the presence of multiple transient faults is necessary, since it remains an open research field. In this work, a Monte-Carlo simulation-based methodology is presented taking into consideration the masking mechanisms and placement information. The proposed SER estimation tool exploits the results of a Single Event Transient (SET) pulse characterization process with HSPICE to obtain an accurate assessment of circuit vulnerability to radiation. A new metric, called Glitch Latching Probability, which represents the impact of the masking effects on a SET, is introduced to identify gate sensitivity and, finally, experimental results on a set of ISCAS’89 benchmarks are presented. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:kzcrU_BdoSEC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "APPLYING FUZZY COGNITIVE MAPS AND OWA LEARNING AGGREGATION FOR PARTICIPATORY MODELLING",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=827989935741902390&hl=en&oi=scholarr",
            "Abstract": "Participatory modelling is an emerging approach in the decision-making process through which stakeholders contribute to the representation of the perceived causal linkages of a complex system. The use of fuzzy cognitive maps (FCMs) for participatory modelling helps policy-makers develop dynamic quantitative models for strategising development interventions. The aggregation of knowledge from multiple sources provides consolidated and more reliable results. Average aggregation is the most common aggregation method used in FCMs-based modelling for weighted interconnections between concepts. This paper goes one step further to propose a new aggregation method using learning OWA (ordered weighted averaging) operators for aggregating FCM weights assigned by various stakeholders. In this paper, we report a comparative analysis of ‘OWA learning aggregation’with the conventional average …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the statistical memory architecture exploration and optimization",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7092447/",
            "Abstract": "The worsening of process variations and the consequent increased spreads in circuit performance and consumed power hinder the satisfaction of the targeted budgets and lead to yield loss. Corner based design and adoption of design guardbands might limit the yield loss. However, in many cases such methods may not be able to capture the real effects which might be way better than the predicted ones leading to increasingly pessimistic designs. The situation is even more severe in memories which consist of substantially different individual building blocks, further complicating the accurate analysis of the impact of variations at the architecture level leaving many potential issues uncovered and opportunities unexploited. In this paper, we develop a framework for capturing non-trivial statistical interactions among all the components of a memory/cache. The developed tool is able to find the optimum memory/cache …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:HoB7MX3m0LUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mobility Tracking Signalling Optimisation in Mobile Networks",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Apostolis-Xenakis/publication/342866438_Mobility_Tracking_Signalling_Optimisation_in_Mobile_Networks/links/5f107e53299bf1e548ba9aeb/Mobility-Tracking-Signalling-Optimisation-in-Mobile-Networks.pdf",
            "Abstract": "Signalling load optimization on the air-interface is vital for mobile telecommunications. There is a trade-off between signalling load due to the need to update the mobile location (tracking update load) when in idle mode versus the signalling load to locate the mobile when paged. This paper demonstrates that there is an optimum size for a Tracking Area List (TAL) in terms of Tracking Areas (TAs). The solution is provided in analytical form, and it is applicable to the mobile network technologies that adopt the flexible TAL method for tracking update, which means it is applicable in 4G/LTE Networks and it is targeted for future (5G) mobile networks.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:ipzZ9siozwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Fuzzy Logic Controller for Tasks Scheduling Using Unreliable Cloud Resources",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2009.10515",
            "Abstract": "The Cloud infrastructure offers to end users a broad set of heterogenous computational resources using the pay-as-you-go model. These virtualized resources can be provisioned using different pricing models like the unreliable model where resources are provided at a fraction of the cost but with no guarantee for an uninterrupted processing. However, the enormous gamut of opportunities comes with a great caveat as resource management and scheduling decisions are increasingly complicated. Moreover, the presented uncertainty in optimally selecting resources has also a negatively impact on the quality of solutions delivered by scheduling algorithms. In this paper, we present a dynamic scheduling algorithm (i.e., the Uncertainty-Driven Scheduling - UDS algorithm) for the management of scientific workflows in Cloud. Our model minimizes both the makespan and the monetary cost by dynamically selecting reliable or unreliable virtualized resources. For covering the uncertainty in decision making, we adopt a Fuzzy Logic Controller (FLC) to derive the pricing model of the resources that will host every task. We evaluate the performance of the proposed algorithm using real workflow applications being tested under the assumption of different probabilities regarding the revocation of unreliable resources. Numerical results depict the performance of the proposed approach and a comparative assessment reveals the position of the paper in the relevant literature.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Source-level compiler optimizations for high-level synthesis",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2984393.2984406",
            "Abstract": "With high-level synthesis becoming the preferred method for hardware design, tools that operate on high-level programming languages and optimize hardware output are crucial for successful synthesis. In high-level synthesis, conventional programming language codes describe hardware behavior. Those codes are translated into RTL-level description by some appropriate tool. Common such tools that not only translate, but also optimize code, are programming language compilers. Compilers can make the transition from software to hardware smooth, allowing programmers to use their software skills on hardware programming, without any language compromises. Nonetheless, compilers also utilize optimization techniques to obtain a better output hardware description. In this paper, we discuss compiler issues for high-level synthesis, and present the results of several compiler transformations that can be …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:NhqRSupF_l8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Pseudo-FG technique for efficient energy harvesting",
            "Publication year": 2012,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/el.2011.3576",
            "Abstract": "A novel 2.45 GHz RF power harvester has been implemented in a 90 nm standard CMOS process. The proposed architecture reduces the threshold voltage (Vth) by employing a pseudo floating-gate (pseudo-FG) new technique and achieves better performance compared with other conventional rectifiers at 90 nm and 2.45 GHz, without additional fabrication cost. The system is initially optimised via a matching-boosting circuit, which has a dominant dual role. Extremely low power (−15.43 dBm) RF signals can be rectified and converted to 1.25 V DC.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "A novel low-power motion estimation design for H. 264",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4429988/",
            "Abstract": "The H.264 video coding standard can achieve considerably higher coding efficiency than previous video coding standards. The keys to this high coding efficiency are the two prediction modes (Intra & Inter) provided by H.264 which adopt many new features such as variable block size searching, motion vector prediction etc. However, these result in a considerably higher encoder complexity that adversely affects speed and power, which are both significant for the mobile multimedia applications targeted by the standard. Therefore, it is of high importance to design architectures that minimize the speed and power overhead of the prediction modes. In this paper we present a new algorithm, and the architecture that implements it, that can replace the standard sum of absolute differences (SAD) approach in the two main prediction modes, supports the variable block size motion estimation (VBSME) as it is defined in the …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intelligent parking management system based on wireless sensor network technology",
            "Publication year": 2013,
            "Publication url": "https://search.proquest.com/openview/889f40aa1a29d887d727793ed5778a50/1?pq-origsite=gscholar&cbl=52938",
            "Abstract": "Wireless Sensor Networks can be considered as one of the most challenging and emerging technologies empowering the provision of enhanced services to miscellaneous application domains. The objective of this paper is to examine and present an implementation of a real-time parking management system. This system adapts efficiently into a contemporary urban environment, and eventually provides to users the ability to find and navigate easily to a free curb space. The system is comprised of a deployed sensor network based on two collaborative vehicle detection schemes supported by an event-driven processing algorithm and a web based application. The evaluation of the system is performed by conducting a number of experiments in order to select the optimal sensing modality and confirm the feasibility of the proposed application system in actual running conditions. Results demonstrate that the proposed …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:SeFeTyx0c_EC",
            "Publisher": "IFSA Publishing, SL"
        },
        {
            "Title": "Barcode Data Fusion through Application Level Events Compliant Middleware",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2411137.2412020",
            "Abstract": "In this paper we propose a mechanism for fusing data identified by a barcode scanner and sensor data through ALE compliant middleware. In this way the ALE server becomes an Auto-ID instead of RFID middleware, offering to capturing applications a unified view of the statements performed in a specific plant or warehouse, regardless of the technology used to capture these statements. The mechanism defines the notion of the generalized EPC, along with its corresponding generalized EPC pattern.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Voltage-drop-constrained optimization of power distribution network based on reliable maximum current estimates",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1382625/",
            "Abstract": "The problem of optimum design of tree-shaped power distribution networks with respect to the voltage drop effect is addressed in this paper. An approach for the width adjustment of the power lines supplying the circuit's major functional blocks is formulated, so that the network occupies the minimum possible area under specific voltage drop constraints at all blocks. The optimization approach is based on precise maximum current estimates derived by statistical means from recent advances in the field of extreme value theory. Experimental tests include the design of power grid for a choice of different topologies and voltage drop tolerances in a typical benchmark circuit.",
            "Abstract entirety": 1,
            "Author pub id": "5uRFCLsAAAAJ:0EnyYjriUFMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "New Tasks for a Dyslexia Screening Web Application",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-11932-4_26",
            "Abstract": "Dyslexia is the most common learning disability and it is characterized by a persistent failure to acquire reading skills despite normal intelligence, adequate cognitive abilities, conventional instruction and sociocultural opportunities. The main target of the present study was to extend our previous dyslexia screener web application by constructing and embedding new tasks. An extended battery of tests was implemented, which included sentence comprehension, auditory working memory, syllable composition and word explanation skills. Moreover, another aim of the study was to incorporate these tests into our existing web application. Statistical analysis revealed that dyslexic children presented lower correct responses (p < 0.01) and larger time latency (p < 0.05) in comparison to their average peers in all four tasks of the web application. Additionally, the main purpose of delivering a screening procedure …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "EXPLORING OWA OPERATORS FOR AGGREGATING FUZZY COGNITIVE MAPS CONSTRUCTED BY EXPERTS/STAKEHOLDERS IN AGRICULTURE",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=14211323335758212419&hl=en&oi=scholarr",
            "Abstract": "Fuzzy cognitive maps are graph-based models mostly constructed in a participatory setting either by experts to given domains or by a large number of stakeholders in various scientific areas of interest. Usually each expert or stakeholder designs individually a FCM based on his/her knowledge or opinion for the specific application domain. For scenario analysis and decision-making purposes, an overall FCM for the specific problem needs to be constructed, aggregating all individual FCMs designed by the experts and/or stakeholders. The average aggregation method for weighted interconnections among concepts is the most common method in FCM modeling, which is quite simple, regardless the inherent uncertainty induced by the different experts’ or stakeholders’ opinions. The aim of this research work is two-fold:(i) to propose an alternative aggregation method based on learning Ordered Weighted Average …",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "www. sensorsportal. com ISSN 1726-5479",
            "Publication year": 2012,
            "Publication url": "https://www.sensorsportal.com/HTML/DIGEST/march_2012/SENSORCOMM/Contents_Special_14_2_Feb_2012.pdf",
            "Abstract": "Contents Page 1 Sensors & Transducers Journal Contents Volume 14-2 Special Issue March \n2012 www.sensorsportal.com ISSN 1726-5479 Research Articles Information Extraction from \nWireless Sensor Networks: System and Approaches Tariq Alsboui, Abdelrahman Abuarqoub, \nMohammad Hammoudeh, Zuhair Bandar, Andy Nisbet ... 1 Assessment of Software Modeling \nTechniques for Wireless Sensor Networks: A Survey John Khalil Jacoub, Ramiro Liscano, \nJeremy S. Bradbury ................................................................ 18 Effective Management and Energy \nEfficiency in Management of Very Large Scale Sensor Network Moran Feldman, Sharoni \nFeldman..................................................................................................... 47 Energy Efficient in-Sensor \nData Cleaning for Mining Frequent Itemsets Jacques M. Bahi, Abdallah Makhoul, Maguy \nMedlej.......................................................................... 64 IPv6 Routing Protocol for Low Power , , ..…",
            "Abstract entirety": 0,
            "Author pub id": "5uRFCLsAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Unknown"
        }
    ]
}]