[{
    "name": "Γεώργιος Παπαγιαννάκης",
    "romanize name": "Georgios Papagiannakis",
    "School-Department": "Επιστήμης Υπολογιστών",
    "University": "uoc",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 1020,
    "Scholar name": "George Papagiannakis",
    "Scholar id": "rUfyI3MAAAAJ",
    "Affiliation": "University of Crete, FORTH, University of Geneva, ORamaVR",
    "Citedby": 2079,
    "Interests": [
        "computer graphics",
        "virtual reality",
        "augmented reality",
        "geometric algebra",
        "HCI"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=rUfyI3MAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Real-time Inhabited Virtual Worlds and Interaction - interactive virtual worlds module",
            "Publication year": 2006,
            "Publication url": "https://diglib.eg.org/handle/10.2312/egt.20061065.0749-0867",
            "Abstract": "Virtual Worlds [MK94] and their concept of cyber-real space interplay invoke such interactive digital narratives that promote new patterns of understanding. However, the \"narrative\" and \"interactive\" part, which refers to a set of events happening during a certain period of time and providing aesthetic, dramaturgical and emotional elements, objects and attitudes ([NM00], [TYK01]) is still an early topic of research. Mixing such aesthetic ambiences with interactive virtual character augmentations [CMM*03] and adding dramatic tension has developed very recently these narrative patterns into an exciting new edutainment medium [LHM03]. With the interplay of a modern real-time framework for integrated interactive virtual character simulation, we can enhance the experience with full virtual character simulations.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:3bvyWxjaHKcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gamified AR/VR character rendering and animation-enabling technologies",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-49607-8_13",
            "Abstract": "In recent years, the popularity of mixed reality (MR) environments has increased as they provide attractive and immersive experiences for educational, entertainment, and training purposes. The increasing advances of Augmented Reality (AR) and Virtual Reality (VR) hardware and software technologies also constitute an interesting area of research. In this work, we present the main pipeline followed for creating virtual character-based AR experiences, specifically in cultural heritage environments. Our main goal in this chapter is to compare different software methodologies for creating VR environments and present a complete novel methodology for authoring life-sized AR virtual characters and life-sized AR crowd simulation using only modern mobile devices. One important aspect of these environments that we focus on is creating realistic and interactive virtual characters via procedurally generated body …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:rTD5ala9j4wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Presence and interaction in mixed reality environments",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-007-0113-z",
            "Abstract": "In this paper, we present a simple and robust mixed reality (MR) framework that allows for real-time interaction with virtual humans in mixed reality environments under consistent illumination. We will look at three crucial parts of this system: interaction, animation and global illumination of virtual humans for an integrated and enhanced presence. The interaction system comprises of a dialogue module, which is interfaced with a speech recognition and synthesis system. Next to speech output, the dialogue system generates face and body motions, which are in turn managed by the virtual human animation layer. Our fast animation engine can handle various types of motions, such as normal key-frame animations, or motions that are generated on-the-fly by adapting previously recorded clips. Real-time idle motions are an example of the latter category. All these different motions are generated and blended on …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Realistic natural interaction with virtual statues in X-Reality environments",
            "Publication year": 2019,
            "Publication url": "https://pdfs.semanticscholar.org/5acb/5f771bec9c5d18953036d30f7f3cb0e060b9.pdf",
            "Abstract": "Augmented, Virtual, and Mixed Reality have successfully transitioned from the laboratory environment to becoming mainstream technologies available to almost everyone, mainly due to important advancements in terms of hardware. These technologies, along with recent advancements in Artificial Intelligence, have the potential to deliver compelling experiences. In the Cultural Heritage domain, they can be used to achieve natural interaction with virtual statues, making visitors feel as if physical statues “come to life” and can engage in dialogue with them. This paper presents the fundamental technological components towards this vision and how they can be orchestrated through the description of a conceptual architecture and a use case example. Open research issues are also discussed, providing a roadmap for future research in this area.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:-DxkuPiZhfEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Effectiveness and Utility of Virtual Reality Simulation as an Educational Tool for Safe Performance of COVID-19 Diagnostics: Prospective, Randomized Pilot Trial",
            "Publication year": 2021,
            "Publication url": "https://games.jmir.org/2021/4/e29586/",
            "Abstract": "Background: Although the proper use of hygiene and personal protective equipment (PPE) is paramount for preventing the spread of diseases such as COVID-19, health care personnel have been shown to use incorrect techniques for donning/doffing of PPE and hand hygiene, leading to a large number of infections among health professionals. Education and training are difficult owing to the social distancing restrictions in place, shortages of PPE and testing material, and lack of evidence on optimal training. Virtual reality (VR) simulation can offer a multisensory, 3-D, fully immersive, and safe training opportunity that addresses these obstacles.Objective: The aim of this study is to explore the short-and long-term effectiveness of a fully immersive VR simulation versus a traditional learning method regarding a COVID-19–related skill set and media-specific variables influencing training outcomes.Methods: This was a prospective, randomized controlled pilot study on medical students (N= 29; intervention VR training, n= 15, vs control video-based instruction, n= 14) to compare the performance of hand disinfection, nasopharyngeal swab taking, and donning/doffing of PPE before and after training and 1 month later as well as variables of media use.Results: Both groups performed significantly better after training, with the effect sustained over one month. After training, the VR group performed significantly better in taking a nasopharyngeal swab, scoring a median of 14 out of 17 points (IQR 13-15) versus 12 out of 17 points (IQR 11-14) in the control group, P=. 03. With good immersion and tolerability of the VR simulation, satisfaction was significantly …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:YB4bud6kWLwC",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "Self adaptive animation based on user perspective",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-008-0233-0",
            "Abstract": "In this paper we present a new character animation technique in which the animation adapts itself based on the change in the user’s perspective, so that when the user moves and their point of viewing the animation changes, then the character animation adapts itself in response to that change. The resulting animation, generated in real-time, is a blend of key animations provided a priori by the animator. The blending is done with the help of efficient dual-quaternion transformation blending. The user’s point of view is tracked using either computer vision techniques or a simple user-controlled input modality, such as mouse-based input. This tracked point of view is then used to suitably select the blend of animations. We show a way to author and use such animations in both virtual as well as augmented reality scenarios and demonstrate that it significantly heightens the sense of presence for the users when …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Mobile Virtual Reality featuring a six degrees of freedom interaction paradigm in a virtual museum application",
            "Publication year": 2015,
            "Publication url": "https://projects.ics.forth.gr/tech-reports/2015/2015.TR462_Mobile_Virtual_Reality_Freedom_Interaction.pdf",
            "Abstract": "From the storyteller on a Greek stage to the latest in curved-screen TVs and IMAX theaters, one of the main objectives of education and entertainment has always been related to immersion: putting the audience “inside” the drama, or educational concept transporting them to another time and place and empowering them to visualize this concept from different perspectives. To date, that has been an “over there” experience, leaving a physical gap that reminds our senses that we’re not truly immersed. But that’s beginning to change, thanks to the advent of modern Virtual Reality (VR) and Augmented Reality (AR) technologies, otherwise termed together as Mixed Reality (MR). Just within the last two years, there has been a great leap forward in immersion and VR/AR techniques and h/w enabling technologies. Along the way we’ve discovered that VR/AR is not just for entertainment—gaming and movies, for example—but that it also has broad commercial applications for the likes of virtual travel and very recently smart education on both mobile and desktop devices. Mobile Virtual Reality (VR) is becoming an increasingly “hot” topic nowadays, with the development and introduction of various VR headsets by a few different vendors such as the Google-Cardboard HMD. One of their shortcomings is the absence of traditional navigation and interaction controls. In this work we employ a secondary mobile device for six degrees of freedom interaction (translation and rotation) using the screen as well as the embedded mobile sensors in a virtual museum application.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:mUJArPsKIAAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "MagiPlay: An Augmented Reality Serious Game Allowing Children to Program Intelligent Environments",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-61983-4_9",
            "Abstract": "A basic understanding of problem-solving and computational thinking is undoubtedly a benefit for all ages. At the same time, the proliferation of Intelligent Environments has raised the need for configuring their behaviors to address their users’ needs. This configuration can take the form of programming, and coupled with advances in Augmented Reality and Conversational Agents, can enable users to take control of their intelligent surroundings in an efficient and natural manner. Focusing on children, who can greatly benefit by being immersed in programming from an early age, this paper presents an authoring framework in the form of an Augmented Reality serious game, named MagiPlay, allowing children to manipulate and program their Intelligent Environment. This is achieved through a handheld device, which children can use to capture smart objects via its camera and subsequently create rules dictating their …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:D_tqNUsBuKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "\"Deep Cut\": An all-in-one Geometric Algorithm for Unconstrained Cut, Tear and Drill of Soft-bodies in Mobile VR",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:s9ia6_kGH2AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From Readership to Usership and Education, Entertainment, Consumption to Valuation: Embodiment and Aesthetic Experience in Literature-based MR Presence",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1910.10019",
            "Abstract": "This chapter will extend its preliminary scope by examining how literary transportation further amplifies presence and affects user response vis-\\'a-vis virtual heritage by focusing on embodiment and aesthetic experience. To do so, it will draw on recent findings emerging from the fields of applied psychology, neuroaesthetics and cognitive literary studies; and consider a case study advancing the use of literary travel narratives in the design of DCH applications for Antiquities - in this case the well-known ancient Greek monument of Acropolis. Subsequently, the chapter will discuss how Literary-based MR Presence shifts public reception from an education-entertainment-touristic consumption paradigm to a response predicated on valuation. It will show that this type of public engagement is more closely aligned both with MR applications' default mode of usership, and with newly emerging conceptions of a user-centered museum (e.g., the Museum 3.0), thus providing a Virtual Museum model expressly suited to cultural heritage.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:eAlLMO4JVmQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A 3D Modelling and Photorealistic Simulation Pipeline for 3D Heritage Edifices",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=1563319904061536437&hl=en&oi=scholarr",
            "Abstract": "Methods and technologies for creating photorealistic 3D models have undergone an impressive evolution with a positive impact in the cultural heritage sector. Using widely available standard tools we describe a modelling and simulation pipeline, which generally provides for most visualisation projects with an acceptable trade-off between visual consistency, accuracy and automatism.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:DyXnQzXoVgIC",
            "Publisher": "EUROPEAN RESEARCH CONSORTIUM INFORMATICS & MATHEMATICS"
        },
        {
            "Title": "Rapid Reconstruction and Simulation of Real Characters in Mixed Reality Environments",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-75826-8_22",
            "Abstract": "This paper presents a comparison of latest software and hardware methods for rapid reconstruction of real humans using as an input RGB or RGB-D images, and base on this comparison is introduced the pipeline that produces high realistic reconstructions in a reasonable amount of time, suitable for real-time Virtual Reality (VR), Augmented Reality (AR) as well as Holographic Mixed Reality (HMR). In this work, we also present and compare usage of latest VR and AR Head Mounted displays (HDMs), which are Microsoft Hololens, Oculus Rift and mobile AR. Specifically, we compare the immersion experience, interaction system, field of view and level of presence that each of these technologies provide. We demonstrate our results at Asinou church, a UNESCO Cultural Heritage monument located in Cyprus. Our reconstructed virtual narrator is the real priest of Asinou church which gives a virtual tour in the …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:CYCckWUYoCcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Life-sized Group and Crowd simulation in Mobile AR",
            "Publication year": 2016,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:ziOE8S1-AIUC",
            "Publisher": "ACM, New York, NY, USA, 79-82. DOI=http://dx.doi.org/10.1145/2915926.2915950"
        },
        {
            "Title": "Practical precomputed radiance transfer for mixed reality",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.330.6986",
            "Abstract": "Mixed Reality and its concept of virtual superimposed on real space interplay invoke such interactive experiences that promote new patterns of believability and presence for cultural heritage applications. The seamless integration of virtual cultural artifacts with ‘real lights’ or images of real scenes, is an important step towards believability and consistency in synthesized MR scenes. That synthesized world termed Augmented Reality allows seeing the real scene with virtual augmentations superimposed onto it, but often fails to produce a realtime image that as a whole is a believable integrated experience. Furthermore, often Virtual Reality cultural heritage reconstructions are not physically correct rendered in real-time. Our main research efforts are twofold: adding believable and realistically simulated real-time virtual artifacts superimposed on real video sequence images, as well as employ dynamic ‘area lights’ for real-time large scale VR site reconstructions. The main novelty of this combined effort is a new adaptation of a physically correct illumination model for virtual cultural heritage artifacts as well as large scale reconstructions based on ‘real area light ‘, captured via light probes and employed in an extended graphics hardware accelerated Precomputed Radiance Transfer algorithm. 1.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The LECTOR Podium. An Innovative Teacher Workstation for the Intelligent Classroom of the Future",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3436756.3437033",
            "Abstract": "This paper explores a new approach to a teacher's workstation in the context of the intelligent classroom of the 21st century. Nowadays, the term “intelligent” is not only associated with efforts to incorporate smart/mobile devices into the learning experience (distance learning, educational games/apps, etc.), but also to equip the physical environment of the classroom with technologically enhanced objects. These technologically augmented artefacts (Student Desk, Interactive Classroom Board and Educator's Workstation) are embedded discreetly in the classroom's environment. One of the main concerns in designing and developing such artefacts is to facilitate seamless interaction between educators and students, as well as to enable unobtrusive monitoring and supervision of the students by the educators. This paper presents LECTOR Podium, a system that liberates teachers from the confinement of a desk and …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:NxmKEeNBbOMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An interactive mixed reality framework for virtual humans",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4030841/",
            "Abstract": "In this paper, we present a simple and robust mixed reality (MR) framework that allows for real-time interaction with virtual humans in real and virtual environments under consistent illumination. We look at three crucial parts of this system: interaction, animation and global illumination of virtual humans for an integrated and enhanced presence. The interaction system comprises of a dialogue module, which is interfaced with a speech recognition and synthesis system. Next to speech output, the dialogue system generates face and body motions, which are in turn managed by the virtual human animation layer. Our fast animation engine can handle various types of motions, such as normal key-frame animations, or motions that are generated on-the-fly by adapting previously recorded clips. All these different motions are generated and blended on-line, resulting in a flexible and realistic animation. Our robust rendering …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "BricklAyeR: a platform for building rules for AmI environments in AR",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-22514-8_39",
            "Abstract": "With the proliferation of Intelligent Environments, the need for configuring their behaviors to address their users’ needs emerges. In combination with the current advances in Augmented and Virtual Reality and Conversational Agents, new opportunities arise for systems which allow people to program their environment. Whereas today this requires programming skills, soon, when most spaces will include smart objects, tools which allow their collaborative management by non-technical users will become a necessity. To that end, we present BricklAyeR, a novel collaborative platform for non-programmers, that allows to define the behavior of Intelligent Environments, through an intuitive, 3D building-block User Interface, following the Trigger-Action programming principle, in Augmented Reality, with the help of a Conversational Agent.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:ghEM2AJqZyQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Preface for Special Issue on Geometric Algebra in Computer Science and Engineering",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/George-Papagiannakis/publication/318510591_Preface_for_Special_Issue_on_Geometric_Algebra_in_Computer_Science_and_Engineering/links/5a533b490f7e9bbc10569268/Preface-for-Special-Issue-on-Geometric-Algebra-in-Computer-Science-and-Engineering.pdf",
            "Abstract": "The first workshop on Geometric Algebra in Computer Science and Engineering (GACSE 2016) was held on 28th of June 2016 as part of the 33rd Computer Graphics International conference (CGI 2016) in Heraklion, Crete, Greece. The workshop was prepared by Dietmar Hildenbrand, Eckhard Hitzer and George Papagiannakis (who also served as chair of CGI 2016). This special issue of AACA is mainly based on extended contributions to the GACSE 2016 workshop and covers topics ranging from applications of Clifford Geometric Algebra (GA) in computer graphics, computer vision and robotics to topics related to computing with and theory of GA. The applications in computer graphics and computer vision apply Conformal Geometric Algebra in the areas of binocular computer vision, object detection in point clouds, construction of Voronoi diagrams, geometric modeling, motor estimation and a code generator comparison for virtual character simulation. While the inverse kinematics of robots is also using Conformal Geometric Algebra, the six-dimensional Euclidean Geometric Algebra G6= Cl (6, 0) is used for mobility analysis and singularity analysis of mechanisms.The computing topics of this special issue cover a new co-processor design, an optimized implementation using binary trees, as well as proposals for C++ implementations of Geometric Algebra for the purpose of big data processing. An extension of Conformal Geometric Algebra to Double Conformal Geometric Algebra for treating quadrics and Dupin-and Darboux cyclides is explained in the mathematical part, together with solutions to minimum residual and quaternionic matrix …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:DrR-2ekChdkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A conformal geometric algebra framework for mixed reality and mobile display",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:w0F2JDEymm0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simulating life in ancient sites using mixed reality technology",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/3249589/336.pdf",
            "Abstract": "More and more we can see several ancient sites simulated with 3D technologies. The presented case studies will illustrate the virtual reconstruction methodology and techniques we applied for the virtual restitution of historical sites such as Pompeii in Italy, using AR, or the Great Mosque of Hagia Sophia in Istanbul (using VR). But what is more interesting today is to mix some real scenery with virtual scenery. In the case of Pompeii, we have simulated life including humans, animals and plants together with the existing remaining building. This requires filming the natural decor and augmenting it at the right place with virtual humans. For doing that, we had also to analyze the costumes and the hairstyles, the behavior and the interaction between people living at that particular time. In our presentation, we will describe our real-time virtual human’s platform that allows us to see Pompeii augmented and to walk through the theater Aspendos in Turkey, seeing in the same time people that use to live there or be at these places. We will explain the methods used to simulate real-time clothes, hair and animation of the virtual humans. We also describe the rendering method that should consider the real light and the calculated light and visual case studies are shown.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LIFEPLUS",
            "Publication year": 2002,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Never ‘Drop the Ball’in the Operating Room: An Efficient Hand-Based VR HMD Controller Interpolation Algorithm, for Collaborative, Networked Virtual Environments",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-89029-2_52",
            "Abstract": "In this work, we propose two algorithms that can be applied in the context of a networked virtual environment to efficiently handle the interpolation of displacement data for hand-based VR HMDs. Our algorithms, based on the use of dual-quaternions and multivectors respectively, impact the network consumption rate and are highly effective in scenarios involving multiple users. We illustrate convincing results in a modern game engine and a medical VR collaborative training scenario.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:KWzIFqRkAKkC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A geometric algebra animation method for mobile Augmented Reality simulations in digital heritage sites",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-13695-0_25",
            "Abstract": "To populate real, ancient cultural heritage sites with low-cost, mobile virtual augmentations has been a demand from cultural professionals established long time ago. In this work we aim to address this demand by introducing three main novelties: a) employing an open, cross-platform mobile framework for 3D virtual character rendering & animation based on open standards b) for outdoors life-size augmented reality simulations c) and enhancing the performance of these simulations by introducing a geometric algebra animation interpolation method adapted for mobile devices.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:1DsIQWDZLl8C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Mixing virtual and real scenes in the site of ancient Pompeii",
            "Publication year": 2005,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cav.53",
            "Abstract": "This paper presents an innovative 3D reconstruction of ancient fresco paintings through the real‐time revival of their fauna and flora, featuring groups of virtual animated characters with artificial‐life dramaturgical behaviours in an immersive, fully mobile augmented reality (AR) environment. The main goal is to push the limits of current AR and virtual storytelling technologies and to explore the processes of mixed narrative design of fictional spaces (e.g. fresco paintings) where visitors can experience a high degree of realistic immersion. Based on a captured/real‐time video sequence of the real scene in a video‐see‐through HMD set‐up, these scenes are enhanced by the seamless accurate real‐time registration and 3D rendering of realistic complete simulations of virtual flora and fauna (virtual humans and plants) in a real‐time storytelling scenario‐based environment. Thus the visitor of the ancient site is …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:d1gkVwhDpl0C",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Applications of Interactive Virtual Humans in Mobile Augmented Reality",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Nadia-Thalmann/publication/267789218_A_APPLICATIONS_OF_INTERACTIVE_VIRTUAL_HUMANS_IN_MOBILE_AUGMENTED_REALITY/links/54bd199d0cf27c8f28148df7/A-APPLICATIONS-OF-INTERACTIVE-VIRTUAL-HUMANS-IN-MOBILE-AUGMENTED-REALITY.pdf",
            "Abstract": "Recent advances in hardware and software for mobile computing have enabled a new breed of mobile Augmented Reality systems and applications featuring interactive virtual characters. This has resulted from the convergence of the tremendous progress in mobile computer graphics and mobile AR interfaces. In this paper, we focus on the evolution of our algorithms and their integration towards improving the presence and interactivity of virtual characters in real and virtual environments, as we realize the transition from mobile workstations to ultra-mobile PC's. We examine in detail three crucial parts of such systems: user-tracked interaction; real-time, automatic, adaptable animation of virtual characters and deformable pre-computed radiance transfer illumination for virtual characters. We examine our efforts to enhance the sense of presence for the user, while maintaining the quality of animation and interactivity as we scale and deploy our AR framework in a variety of platforms. We examine different AR virtual human enhanced scenarios under the different mobile devices that illustrate the interplay and applications of our methods.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:k_7cPK9k7w8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time recreated ceremonies in VR restituted cultural heritage sites",
            "Publication year": 2003,
            "Publication url": "https://www.cipaheritagedocumentation.org/wp-content/uploads/2018/11/Papagiannakis-e.a.-Real-time-recreated-ceremonies-in-VR-restituted-cultural-heritage-sites.pdf",
            "Abstract": "This paper presents the case study of a real-time interactive digital narrative and real-time visualisation of the Namaz Pray of a simulated Ottoman Imam in the 16th century virtually restored mosque of Cucuk Hagia Sophia (previous St. Sergius and Bacchus church) as well as in the Hagia Sophia mosque (previous cathedral of Hagia Sophia), in Istanbul, Turkey. Inspired by a hermeneutical approach, this case study illustrates that the abandonment of traditional concepts of static cultural artefacts with interactive, augmented historical character-based narrative representations, can propel virtual reconstructions of cultural heritage sites to an exciting new edutainment medium. Furthermore, as the cultural tradition is conceived as a reservoir of living forces that can be experienced only if it is freed from the petrifaction exerted during the centuries, a reconstruction and real-time immersive visualisation is presented that captures such ‘living forces’ by simulating these edifices both as churches (original form) and as mosques, fully respecting the archaeological, historical and architectural premises. Instrumental to that approach is the rapid realtime immersive 3D application prototyping, that it is feasible only due to the adoption a component-based real-time framework for VR character simulation.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real Time Animation and Illumination in Ancient Roman Sites.",
            "Publication year": 2007,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.96.7917&rep=rep1&type=pdf",
            "Abstract": "The present article discusses and details the methodological approaches and the reconstruction strategies that have been employed to realize the 3D real-time virtual simulations of the populated ancient sites of Aspendos and Pompeii, respectively visualized using a virtual and an augmented reality setup. More specifically, the two case studies to which we refer concern the VR restitution of the Roman theatre of Aspendos in Turkey, visualized as it was in the 3rd century, and the on-site AR simulation of a digitally restored Thermopolium situated at the archeological site of Pompeii in Italy. In order to enhance both simulated 3D environments, either case study presents the inclusion of real time animated virtual humans, which are re-enacting situations and activities that were typically performed in such sites during ancient times. Furthermore, the implemented modeling and real time illumination strategies of both the textured static 3D models of the sites and the simulated dynamic virtual humans are equally presented and compared.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An approach for the visualization of crafts and machine usage in virtual environments",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Evropi-Stefanidi/publication/344471408_An_Approach_for_the_Visualization_of_Crafts_and_Machine_Usage_in_Virtual_Environments/links/5f7ae3d192851c14bcaedd39/An-Approach-for-the-Visualization-of-Crafts-and-Machine-Usage-in-Virtual-Environments.pdf",
            "Abstract": "Despite the cultural, societal, economic and traditional significance and value of Heritage Crafts and Intangible Cultural Heritage, efforts towards their digital representation and presentation, and subsequently their preservation, are scattered. To that end, this paper proposes an approach for their visualization in Virtual Environments, within which the practitioner is represented by a Virtual Human, their actions through animations resulting from Motion Capture recordings, and objects through their 3D reconstructions. Our novel approach is based on a conceptual, twofold decomposition of craft processes into actions, and of the machines used into components. Thus, in the context of this paper, we have developed a pipeline that delivers a Virtual Environment, through which a wide range of users, from museum curators and exhibitors, to everyday users interested by a craft, can experience craft usage scenarios. Via our visualization pipeline, we claim that we deliver an efficient way of visualizing craft processes within Virtual Environments, thus increasing the usability and educational value of craft representation, and opening the way to a variety of new applications for craft presentation, education and thematic tourism. In the scope of this paper, we focus on the Heritage Craft of loom weaving; however, our approach is generic, for representing any craft, after its decomposition according to our technique.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:-6RzNnnwWf8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fast and robust pipeline for populating mobile AR scenes with gamified virtual characters",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2818427.2818463",
            "Abstract": "In this work we present a complete methodology for robust authoring of AR virtual characters powered from a versatile character animation framework (Smartbody), using only mobile devices. We can author, fully augment with life-size, animated, geometrically accurately registered virtual characters into any open space in less than 1 minute with only modern smartphones or tablets and then automatically revive this augmentation for subsequent activations from the same spot, in under a few seconds. Also, we handle efficiently scene authoring rotations of the AR objects using Geometric Algebra rotors in order to extract higher quality visual results. Moreover, we have implemented a mobile version of the global illumination for real-time Precomputed Radiance Transfer algorithm for diffuse shadowed characters in real-time, using High Dynamic Range (HDR) environment maps integrated in our open-source OpenGL …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:F2UWTTQJPOcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mixed Reality and Gamification for Cultural Heritage",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-49607-8.pdf",
            "Abstract": "There is tremendous interest among researchers and creative industries professionals for the development of virtual and augmented reality and gamification technologies for cultural heritage. To date, the major applications of these technologies include photogrammetric modeling, artifact-whole heritage site digitization, museum guides, and a wide range of virtual museum applications. Recently there has been a renewed rapid proliferation in virtual reality (VR) and augmented reality (AR)—together termed mixed reality (MR)—due to the renaissance in MR hardware (such as Oculus Rift, Google Cardboard, etc.) and respective intensive commitment from the ICT industrial sector (Google, Microsoft, Sony, Facebook, etc.) that propels this field dramatically by instilling “Presence”(feeling of being and doing there in the virtual or augmented world). To aid in this direction, recent advances in gamification (employment of …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:DkZNVXde3BIC",
            "Publisher": "Springer Nature, http://www.springer.com/gp/book/9783319496061"
        },
        {
            "Title": "Architectures for SLAM and Augmented Reality Computing",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9556428/",
            "Abstract": "In the next few years, new demanding applications will be supported on mobile platforms by reconciling two conflicting requirements: high performance (often with real-time limitations) and low power consumption. The objective of the vipGPU project is to develop hardware and software technology to provide efficient support for two such application scenarios, namely (a) simultaneous localization and mapping (SLAM) in mobile robotics systems, and (b) virtual reality (VR) in portable devices to simulate serious games with emphasis on simulating surgical interventions and medical training in general. In this project, we aim at developing a new heterogeneous platform consisting of hardware accelerators for low power embedded systems optimized (at the hardware and software level) for the implementation of the two applications mentioned above.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:G1UMdFYMoxkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recreating Daily Life in Pompeii",
            "Publication year": 2010,
            "Publication url": "https://riunet.upv.es/handle/10251/139672",
            "Abstract": "[EN] We propose an integrated Mixed Reality methodology for recreating ancient daily life that features realistic simulations of animated virtual human actors (clothes, body, skin, face) who augment real environments and re-enact staged storytelling dramas. We aim to go further from traditional concepts of static cultural artifacts or rigid geometrical and 2D textual augmentations and allow for 3D, interactive, augmented historical character-based event representations in a mobile and wearable setup. This is the main contribution of the described work as well as the proposed extensions to AR Enabling technologies: a VR/AR character simulation kernel framework with real-time, clothed virtual humans that are dynamically superimposed on live camera input, animated and acting based on a predefined, historically correct scenario. We demonstrate such a real-time case study on the actual site of ancient Pompeii.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:Zph67rFs4hoC",
            "Publisher": "SEAV"
        },
        {
            "Title": "Α Virtual Reality App for Physical and Cognitive Training of Older People With Mild Cognitive Impairment: Mixed Methods Feasibility Study",
            "Publication year": 2021,
            "Publication url": "https://games.jmir.org/2021/1/e24170",
            "Abstract": "Therapeutic virtual reality (VR) has emerged as an effective treatment modality for cognitive and physical training in people with mild cognitive impairment (MCI). However, to replace existing nonpharmaceutical treatment training protocols, VR platforms need significant improvement if they are to appeal to older people with symptoms of cognitive decline and meet their specific needs.This study aims to design and test the acceptability, usability, and tolerability of an immersive VR platform that allows older people with MCI symptoms to simultaneously practice physical and cognitive skills on a dual task.On the basis of interviews with 20 older people with MCI symptoms (15 females; mean age 76.25, SD 5.03 years) and inputs from their health care providers (formative study VR1), an interdisciplinary group of experts developed a VR system called VRADA (VR Exercise App for Dementia and Alzheimer’s Patients). Using an identical training protocol, the VRADA system was first tested with a group of 30 university students (16 females; mean age 20.86, SD 1.17 years) and then with 27 older people (19 females; mean age 73.22, SD 9.26 years) who had been diagnosed with MCI (feasibility studies VR2a and VR2b). Those in the latter group attended two Hellenic Association Day Care Centers for Alzheimer’s Disease and Related Disorders. Participants in both groups were asked to perform a dual task training protocol that combined physical and cognitive exercises in two different training conditions. In condition A, participants performed a cycling task in a lab …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:zwpXiJ37cpgC",
            "Publisher": "JMIR Publications Inc., Toronto, Canada"
        },
        {
            "Title": "An XR rapid prototyping framework for interoperability across the reality spectrum",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2101.01771",
            "Abstract": "Applications of the Extended Reality (XR) spectrum, a superset of Mixed, Augmented and Virtual Reality, are gaining prominence and can be employed in a variety of areas, such as virtual museums. Examples can be found in the areas of education, cultural heritage, health/treatment, entertainment, marketing, and more. The majority of computer graphics applications nowadays are used to operate only in one of the above realities. The lack of applications across the XR spectrum is a real shortcoming. There are many advantages resulting from this problem's solution. Firstly, releasing an application across the XR spectrum could contribute in discovering its most suitable reality. Moreover, an application could be more immersive within a particular reality, depending on its context. Furthermore, its availability increases to a broader range of users. For instance, if an application is released both in Virtual and Augmented Reality, it is accessible to users that may lack the possession of a VR headset, but not of a mobile AR device. The question that arises at this point, would be \"Is it possible for a full s/w application stack to be converted across XR without sacrificing UI/UX in a semi-automatic way?\". It may be quite difficult, depending on the architecture and application implementation. Most companies nowadays support only one reality, due to their lack of UI/UX software architecture or resources to support the complete XR spectrum. In this work, we present an \"automatic reality transition\" in the context of virtual museum applications. We propose a development framework, which will automatically allow this XR transition. This framework transforms any …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:c1e4I3QdEKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Historic BIM for Mobile VR/AR Applications",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=9063732866875964572&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:8dzOF9BpDQoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New Cross/Augmented Reality Experiences for the Virtual Museums of the Future",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:qwy9JoKyICEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A mobile, ar inside-out positional tracking algorithm,(mariopot), suitable for modern, affordable cardboard-style vr hmds",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48496-9_21",
            "Abstract": " Smartphone devices constitute a low-cost, mainstream and easy to use h/w for VR rendering and main component for modern, mobile VR Head-Mounted-Displays (HMDs). They support rotational tracking from on board sensors to manage orientation changes, via their Inertial Measurement Units (IMUs), but they lack positional tracking to reflect head translational movements, a key feature that modern, desktop VR HMDs nowadays provide out-of-the-box. Taking advantage of the RGB camera sensor that each modern mobile device is equipped, we describe a novel combination of inside-out AR tracking algorithms based on both marker and markerless tracking systems to provide the missing positional tracking for mobile HMDs. We employed this system as an affordable, low-cost VR visualization h/w and s/w method, for heritage professionals to employ it for VR archeological sites and Cultural Heritage …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:An6A6Jpfc1oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Real-time realistic rendering and subtle body movements for cultural heritage virtual actors",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/31902401/163.pdf",
            "Abstract": "This paper proposes two simple and robust algorithmic solutions for two frequently encountered problems in inhabited virtual heritage worlds: a) the'still-frozen'behavior of virtual actors once their predefined-scripted animation is executed and b) their real-time rendering which is mostly often based on non physically-principled local illumination models. Our described framework thus provides a) a procedural keyframe generator for realistic idle motions blended with the virtual actor's scripted behavior and b) an extension to precomputed radiance transfer for multi-segmented hierarchies for global illumination for real-time. Thus on one hand the visual discrepancy between the actor's dynamic illumination model and the environment static high dynamic range lightmaps is greatly minimized; on the other hand, once the virtual actors complete their speech, they continue realistic subtle body motions in a non-repetitive manner, waiting for their next verse instead of stopping in a specific pose. Our case study on verses of ancient Greek tragedies in the virtually restituted ancient theatre of Aspendos illustrates the above integrated algorithms and overall methodology.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:pAkWuXOU-OoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advances in Computer Graphics: 37th Computer Graphics International Conference, CGI 2020, Geneva, Switzerland, October 20-23, 2020, Proceedings",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=qJsDEAAAQBAJ&oi=fnd&pg=PR5&dq=info:nk9lkLLQ1OUJ:scholar.google.com&ots=Xler6DcjfG&sig=TFtNpErpMqTlOgErevdQ5lSdRL4",
            "Abstract": "This book constitutes the refereed proceedings of the 37th Computer Graphics International Conference, CGI 2020, held in Geneva, Switzerland, in October 2020. The conference was held virtually. The 43 full papers presented together with 3 short papers were carefully reviewed and selected from 189 submissions. The papers address topics such as: virtual reality; rendering and textures; augmented and mixed reality; video processing; image processing; fluid simulation and control; meshes and topology; visual simulation and aesthetics; human computer interaction; computer animation; geometric computing; robotics and vision; scientific visualization; and machine learning for graphics.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:ZqE1mSdD_DYC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "ENACTIVE Milestone report: First version of the Haptic-sounds experiments roadmap",
            "Publication year": 2005,
            "Publication url": "https://portal.research.lu.se/en/publications/enactive-milestone-report-first-version-of-the-haptic-sounds-expe",
            "Abstract": "ENACTIVE Milestone report: First version of the Haptic-sounds experiments roadmap — Lund \nUniversity Skip to main navigation Skip to search Skip to main content Lund University Home \nLund University Logo English Svenska Home Profiles Research output Projects Units \nInfrastructure Activities Prizes and Distinction Search by expertise, name or affiliation ENACTIVE \nMilestone report: First version of the Haptic-sounds experiments roadmap Charlotte Magnusson, \nJoakim Eriksson, Annie Luciani, Claude Cadoz, Arnaud Drazek, Damien Couroussé, \nJean-Loup Florens, Aurélie Arliaud, Nicolas Castagné, Georg Essl, Teresa Gutierrez, Roberto \nCasati, Jérôme Dokic, Nicolas Bullot, Emilio Sanchez, Iñaki Díaz, Jorge J. Gil, V. Verfaille, P. \nDepalle, MM Wanderley Show 7 more Show less Ian Summers, Alan Brady, Matthias Rath, \nNadia Magnenat-Thalmann, HyungSeok Kim, Jarlier Sophie, George Papagiannakis Certec - : …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:Hck25ST_3aIC",
            "Publisher": "[Publisher information missing]"
        },
        {
            "Title": "Mixed Reality, Gamified Presence, and Storytelling for Virtual Museums",
            "Publication year": 2018,
            "Publication url": "http://ikee.lib.auth.gr/record/307147",
            "Abstract": "Mixed reality as display technology, gamification as motivational element, and storytelling as interaction metaphor while maintaining the feeling of presence are identified as key elements for defining the next generation of virtual museums.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:UmS_249rOGwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Psychomotor Surgical Training in Virtual Reality. Master Case Series & Techniques: Adult Hip (07 2017), 827–830",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:__bU50VfleQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "iSupport: Building a Resilience Support Tool for Improving the Health Condition of the Patient During the Care Path.",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=m2OmDwAAQBAJ&oi=fnd&pg=PA253&dq=info:KQdTpKkBuaEJ:scholar.google.com&ots=yRvnZrjrJF&sig=weTr55bCmUZZpyAdVG1sBOgJ-3E",
            "Abstract": "Anxiety and stress are very common symptoms of patients facing a forthcoming surgery. However, limited time and resources within healthcare systems make the provision of stress relief interventions difficult to provide. Research has shown that provision of preoperative stress relief and educational resources can improve health outcomes and speed recovery. Information and Communication Technology (ICT) can be a valuable tool in providing stress relief and educational support to patients and family before but also after an operation, enabling better self-management and self-empowerment. To this direction, this paper reports on the design of a novel technical infrastructure for a resilience support tool for improving the health condition of patients, during the care path, using Virtual Reality (VR). The designed platform targets, among others, at improving the knowledge on the patient data, effectiveness and adherence to treatment, as well as providing for effective communication channels between patients and clinicians.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:kJDgFkosVoMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-Time Virtual Characters for VR/AR Applications",
            "Publication year": 2004,
            "Publication url": "https://infoscience.epfl.ch/record/100227",
            "Abstract": "Real-Time Virtual Characters for VR/AR Applications - Infoscience English Français login \nHome > Real-Time Virtual Characters for VR/AR Applications Infoscience Information Usage \nstatistics Files Real-Time Virtual Characters for VR/AR Applications Magnenat-Thalmann, N ; \nO' Kennedy, B ; Thalmann, D ; Papagiannakis, G ; Glardon, P ; Joslin, C ; Kim, H Published in: \nCGI 2004 Presented at: Computer Graphics International, Heraklion, Greece , 16-19 June 2004 \nYear: 2004 Laboratories: VRLAB Record appears in: Scientific production and competences > \nI&C - School of Computer and Communication Sciences > IINFCOM > VRLAB - Virtual Reality \nLaboratory Peer-reviewed publications Conference Papers Work produced at EPFL Published \nExport as: BibTeX | MARC | MARCXML | DC | EndNote | NLM | RefWorks | RIS View as: \nMARC | MARCXML | DC Add to your basket: Back to search Record created 2007-02-12…",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual Hagia Sophia: Restitution, visualization and virtual life simulation",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.8494&rep=rep1&type=pdf",
            "Abstract": "This paper presents a case study centered on the virtual restitution and virtual life simulation of a highly complex and endangered heritage edifice: the church of Hagia Sophia, in Istanbul, Turkey (added in 1996 in the annual list of endangered monuments by the World Monuments Watch). The goal of this article is to describe the techniques used in order to achieve a photo-realistic simulation of the selected space and its characters, as well as to point out the challenges and solutions that such a work implies at different stages in production. Most of these issues are mainly focused on the reconstruction of the architecture of the site, but in order to achieve an accurate simulation the social aspect must not be forgotten. The importance of a heritage site resides as well in the historical characters and the social interactions that were taking place there: this information allows a better understanding of the function and the importance of the selected site in connection with the cultural aspects of the life at a certain time. In order to strengthen the feeling of immersion in a heritage edifice virtually restituted, it is important to recreate virtual life and describe the timely evolutionary aspects of the edifice as well.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "glGA: an OpenGL Geometric Application Framework for a Modern, Shader-based Computer Graphics Curriculum",
            "Publication year": 2014,
            "Publication url": "http://diglib.eg.org/bitstream/handle/10.2312/eged.20141026.009-016/009-016.pdf?sequence=1",
            "Abstract": "This paper presents the open-source glGA (Opengl Geometric Application) framework, a lightweight, shaderbased, comprehensive and easy to understand computer graphics (CG) teaching C++ system that is used for educational purposes, with emphasis on modern graphics and GPU application programming. This framework with the accompanying examples and assignments has been employed in the last three Semesters in two different courses at the Computer Science Department of the University of Crete, Greece. It encompasses four basic Examples and six Sample Assignments for computer graphics educational purposes that support all major desktop and mobile platforms, such as Windows, Linux, MacOSX and iOS using the same code base. We argue about the extensibility of this system, referring to an outstanding postgraduate project built on top of glGA for the creation of an Augmented Reality …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:U_HPUtbDl20C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Geometric algebra rotors for skinned character animation blending",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2542355.2542369",
            "Abstract": "The main goal and contribution of this work is to show that (automatically generated) computer implementations of geometric algebra (GA) can perform at a faster level compared to standard (dual) quaternion geometry implementations for real-time character animation blending. By this we mean that if some piece of geometry (eg Quaternions) is implemented through geometric algebra, the result is as efficient in terms of visual quality and even faster (in terms of computation time and memory usage) as the traditional quaternion and dual quaternion algebra implementation. This should be so even without taking into account certain algorithmic enhancements that geometric algebra may allow in selected applications. This work describes two implementation approaches for quaternion interpolation using Euclidean GA rotors for skinned character animation blending. It also lays the foundation so that GA can be …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:r0BpntZqJG4C",
            "Publisher": "ACM"
        },
        {
            "Title": "Covid-19-VR Strikes Back: innovative medical VR training",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3450615.3464546",
            "Abstract": "In this work, we present “Covid-19 VR Strikes Back”(CVRSB), a novel Virtual Reality (VR) medical training application focusing on a faster and more efficient teaching experience for medical personnel regarding the nasopharyngeal swab and the proper Personal Protective Equipment (PPE) donning and doffing. Our platform incorporates a diversity of innovations: a) techniques to avoid the uncanny valley observed in human representation and interactivity in VR simulations, b) exploitation of Geometric Algebra interpolation engine capabilities and c) supervised machine learning analytics module for real-time recommendations. Our application is publicly available at no cost for most Head Mount Displays (HMDs) and Desktop VR. The impact and effectiveness of our application is proved by recent clinical trials.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:AzKEL7Gb_04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual worlds and augmented reality in cultural heritage applications",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=CPOGPVQHcO8C&oi=fnd&pg=PA419&dq=info:zBT5k3iyA-kJ:scholar.google.com&ots=bae3zARTFR&sig=dV_ejoly-NaH_ucUmSJEoYNOJxE",
            "Abstract": "We describe a complete methodology for real-time integrated mixed reality systems that feature realistic complete simulations of animated virtual human actors (clothes, body, skin, face) who augment real environments and re-enact staged storytelling dramas. Although initially targeted at Cultural Heritage Sites, the paradigm is by no means limited to such subjects. The abandonment of traditional concepts of static cultural artifacts or rigid geometrical and textual augmentations with interactive, augmented historical character-based event representations in a mobile and wearable setup, is the main contribution of the described work as well as the proposed extensions to AR Enabling technologies: a VR/AR character simulation kernel framework with character to object interaction, a markerless camera tracker specialized for non-invasive geometrical registration on heritage sites and an NPR mixed reality illumination model for an alternative modal reality. We demonstrate a real-time case study on the actual site of ancient Pompeii.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Taylor and Francis"
        },
        {
            "Title": "A virtual reality brainwave entrainment method for human augmentation applications",
            "Publication year": 2015,
            "Publication url": "https://sonictonic.io/wp-content/uploads/2016/10/2015.TR458_VIRTUAL_REALITY_BRAINWAVE-4.pdf",
            "Abstract": "In order to investigate the brain activity under rhythmic stimulation we developed a novel architecture for Augmented Cognition by integrating latest wearable Virtual Reality (VR) immersive Head-Mounted-Displays with wireless, mobile neuro-biofeedback systems for Real-time, Autonomous Cognitive State Detection, Manipulation and Augmentation. We integrated in our open-source VR framework both latest experimental Oculus Rift HMDs (DK1 and DK2) together with the Emotiv EPOC mobile EEG headset in an innovative, open architecture for user position, orientation and brainwave frequency tracking. We carried out a novel experiment with five groups tracking the brain frequency states of people while relaxing or performing certain sensorimotor tasks in an interactive, immersive 3D environment. The primary aim of this novel research is human cognition augmentation and improvement of task performance via a unique VR-induced entrainment methodology. In most of our experimental groups, we witnessed the transition of the beta-wave to the alpha-wave state. The brainwave entrainment at alpha frequency (10Hz) and relaxation via modern VR, using our open s/w framework, allowed us to verify for the first time enhanced task performance in a fast-learning setup. These first results empower us to plan future studies concerning clinical treatments in VR entrainment using modern wearable devices.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:-nhnvRiOwuoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Immersive visual scripting based on VR software design patterns for experiential training",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-020-01919-0",
            "Abstract": "Virtual reality (VR) has re-emerged as a low-cost, highly accessible consumer product, and training on simulators is rapidly becoming standard in many industrial sectors. However, the available systems are either focusing on gaming context, featuring limited capabilities or they support only content creation of virtual environments without any rapid prototyping and modification. In this project, we propose a code-free, visual scripting platform to replicate gamified training scenarios through rapid prototyping and VR software design patterns. We implemented and compared two authoring tools: a) visual scripting and b) VR editor for the rapid reconstruction of VR training scenarios. Our visual scripting module is capable of generating training applications utilizing a node-based scripting system, whereas the VR editor gives user/developer the ability to customize and populate new VR training scenarios directly from the …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:T_ojBgVMvoEC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "From Readership to Usership: Communicating Heritage Digitally Through Presence, Embodiment and Aesthetic Experience",
            "Publication year": 2021,
            "Publication url": "https://www.academia.edu/download/67921584/fcomm_06_676446.pdf",
            "Abstract": "The primary mission of cultural institutions, including heritage sites and museums, is to perform and perpetuate Cultural Heritage (CH) by ideally transforming audiences into stewards of that heritage. In recent years, these institutions have increasingly turned to Mixed Reality (MR) technologies to expand and democratize public access to Cultural Heritage—a trend that is called upon to accelerate with COVID-19—because these technologies provide opportunities for more remote outreach, and moreover, can make partial remains or ruins more relatable to the public. But as emerging evaluations indicate, existing MR intangible and tangible Digital Cultural Heritage (DCH) applications are largely proving inadequate to engaging audiences beyond an initial fascination with the immersive 3D visualization of heritage sites and artefacts owing in part to misguided storytelling or non-compelling narratives. They fail to effectively communicate the significance of Cultural Heritage to audiences and impress upon them its value in a lasting way due to their overreliance on an education-entertainment-touristic consumption paradigm. Building on the recent case made for Literature-based MR Presence, this article examines how the literary tradition of travel narratives can be recruited to enhance presence and embodiment, and further elicit aesthetic experiences in Digital Cultural Heritage applications by drawing on recent findings from the fields of Extended Reality (XR), cognitive literary science and new museology. The projected effects of this innovative approach are not limited to an increase in audience engagement on account of a greater sense of …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:JP7YXuLIOvAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Survey of Mobile and Wireless Technologies for Augmented Reality Systems (Preprint)",
            "Publication year": 2008,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA479853",
            "Abstract": "Recent advances in hardware and software for mobile computing have enabled a new breed of mobile AR systems and applications. A new breed of computing called augmented ubiquitous computing has resulted from the convergence of wearable computing, wireless networking and mobile AR interfaces. In this paper we provide a survey of different mobile and wireless technologies and how they have impact AR. Our goal is to place them into different categories so that it becomes easier to understand the state of art and to help identify new directions of research.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:SGW5VrABaM0C",
            "Publisher": "NAVAL POSTGRADUATE SCHOOL MONTEREY CA CENTER FOR THE STUDY OF MOBILE DEVICES AND COMMUNICATION"
        },
        {
            "Title": "Stable real-time interaction between virtual humans and real scenes",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1240281/",
            "Abstract": "We present an augmented reality system that relies on purely passive techniques to solve the real-time registration problem. It can run on a portable PC and does not require engineering of the environment, for example by adding markers. To achieve this result, we have integrated robust computer vision techniques into a powerful VR framework. The resulting AR system allows us to produce complex rendering and animation of virtual human characters, and to blend them into the real world. The system tracks the 3D camera position by means of a natural features tracker, which, given a rough CAD model, can deal with complex 3D objects. The tracking method can handle both large camera displacements and aspect changes. We will show that our system works in the cluttered environment of a real industrial facility and can, therefore, be used to enhance manufacturing and industrial processes.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:ce2CqMG-AY4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "TooltY: An approach for the combination of motion capture and 3D reconstruction to present tool usage in 3D environments",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-71002-6_10",
            "Abstract": "Visualization techniques for the usage of tools, handicrafts, and assembly operations are employed for demonstrating processes (eg, assembly instructions). Until today, most commonly used techniques include written information, sketches in manuals, video instructions, etc. The evolution of technology nowadays has generated mature methods for transforming movement to digital information that can be processed and replicated. Motion capture together with 3D reconstruction techniques can provide new ways of digitizing handicrafts. At the same time, Virtual Humans can be used to present craft processes, as well as to demonstrate the usage of tools. For this, the tools utilized in these processes need to be transferred to the digital world. In this paper, we present TooltY, a 3D authoring platform for tool usage presentation in 3D environments, to demonstrate simple operations (eg, usage of a hammer, scissors …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:H_jBuBxbQIAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "MAGES 3.0: Tying the knot of medical VR",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3388536.3407888",
            "Abstract": "In this work, we present MAGES 3.0, a novel Virtual Reality (VR)-based authoring SDK platform for accelerated surgical training and assessment. The MAGES Software Development Kit (SDK) allows code-free prototyping of any VR psychomotor simulation of medical operations by medical professionals, who urgently need a tool to solve the issue of outdated medical training. Our platform encapsulates the following novel algorithmic techniques: a) collaborative networking layer with Geometric Algebra (GA) interpolation engine b) supervised machine learning analytics module for real-time recommendations and user profiling c) GA deformable cutting and tearing algorithm d) on-the-go configurable soft body simulation for deformable surfaces.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:Wq2b2clWBLsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Gamification and Serious Games",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=17087716252214943918&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:QsaTk4IG4EwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Literary Myths in Mixed Reality",
            "Publication year": 2018,
            "Publication url": "https://internal-journal.frontiersin.org/articles/10.3389/fdigh.2018.00021/full",
            "Abstract": "It is well known that the Decadent movement in European literature (fin de siècle) depends on the narrative of the antiquity, as it is revealed from the discoveries of archaeology in the second half of the 19th century. Amid the ruins of the past authors, painters and poets re-conceptualize time and history through a modernist vision based on an imaginary reconfiguration of the antiquity. In this context, the myth of a city (Pompeii) or of a woman (Salomé) offer examples, which would illustrate in a great variety the synergy of a multi-temporal and multi-cultural memory of the myth. In this paper we identify a \"content-based\" shortcoming of modern Mixed Reality (MR) intangible and tangible digital heritage storytelling applications for digital humanities. It is an important problem as the very nature of these applications is often been identified with either misguided storytelling, or non-compelling, non-engaging narratives, except the initial captivating moments due to the immersive 3D visual simulation. We propose a new concept that forthcoming MR applications can draw from: \"Literature-based MR Presence\". Based on modern literature excerpts associated with the real heritage sites, digital narratives can achieve new depths of Presence (phenomenon of behaving and feeling as if we are in the virtual/augmented world created by computerized displays). They would evoke deeper sensations if their dramaturgical plots were based on literary texts associated with the heritage sites, from users, as similar to those often associated with cognitive presence, e.g. when someone is feeling of being transported in an alternate reality when simply reading a compelling …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:g5Ck-dwhA_QC",
            "Publisher": "https://www.frontiersin.org/article/10.3389/fdigh.2018.00021"
        },
        {
            "Title": "A Conformal Geometric Algebra Code Generator Comparison for Virtual Character Simulation in Mixed Reality",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00006-016-0689-3",
            "Abstract": "Over the last few years, recent advances in user interface and mobile computing, introduce the ability to create new experiences that enhance the way we acquire, interact and display information within the world that surrounds us with virtual characters. Virtual reality (VR) is a 3D computer simulated environment that gives to user the experience of being physically present in real or computer-generated worlds; on the other hand, augmented reality (AR) is a live direct or indirect view of a physical environment whose elements are augmented (or supplemented) by computer-generated sensory inputs. Both technologies use interactive devices to achieve the optimum adaptation of the user in the immersive world achieving enhanced presence, harnessing latest advances in computer vision, glasses or head-mounted-displays featuring embedded mobile devices. A common issue in all of them is interpolation …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:kzcSZmkxUKAC",
            "Publisher": "10.1007/s00006-016-0689-3"
        },
        {
            "Title": "Augmented Cognition via Brainwave Entrainment in Virtual Reality: An Open, Integrated Brain Augmentation in a Neuroscience System Approach",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s41133-017-0005-3.pdf",
            "Abstract": "Building on augmented cognition theory and technology, our novel contribution in this work enables accelerated, certain brain functions related to task performance as well as their enhancement. We integrated in an open-source framework, latest immersive virtual reality (VR) head-mounted displays, with the Emotiv EPOC EEG headset in an open neuro- and biofeedback system for cognitive state detection and augmentation. Our novel methodology allows to significantly accelerate content presentation in immersive VR, while lowering brain frequency at alpha level—without losing content retention by the user. In our pilot experiments, we tested our innovative VR platform by presenting to N = 25 subjects a complex 3D maze test and different learning procedures for them on how to exit it. The subjects exposed to our VR-induced entrainment learning technology performed significantly better than those …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:pS0ncopqnHgC",
            "Publisher": "Springer Nature"
        },
        {
            "Title": "A survey of mobile and wireless technologies for augmented reality systems",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cav.221",
            "Abstract": "Recent advances in hardware and software for mobile computing have enabled a new breed of mobile augmented reality (AR) systems and applications. A new breed of computing called ‘augmented ubiquitous computing’ has resulted from the convergence of wearable computing, wireless networking, and mobile AR interfaces. In this paper, we provide a survey of different mobile and wireless technologies and how they have impact AR. Our goal is to place them into different categories so that it becomes easier to understand the state of art and to help identify new directions of research. Copyright © 2008 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:2osOgNQ5qMEC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Chloe@ University: an indoor, mobile mixed reality guidance system",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1315184.1315233",
            "Abstract": "With the advent of ubiquitous and pervasive computing environments, one of promising applications is a guidance system. In this paper, we propose a mobile mixed reality guide system for indoor environments,[email protected] A mobile computing device (Sony's Ultra Mobile PC) is hidden inside a jacket and a user selects a destination inside a building through voice commands. A 3D virtual assistant then appears in the see-through HMD and guides him/her to destination. Thus, the user simply follows the virtual guide.[email protected] also suggests the most suitable virtual character (eg human guide, dog, cat, etc.) based on user preferences and profiles. Depending on user profiles, different security levels and authorizations for content are previewed. Concerning indoor location tracking, WiFi, RFID, and sensor-based methods are integrated in this system to have maximum flexibility. Moreover smart and …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:zGdJYJv2LkUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Presence and Interaction in mixed realities",
            "Publication year": 2006,
            "Publication url": "https://www.academia.edu/download/30840025/10.1.1.100.5429.pdf#page=198",
            "Abstract": "In this paper, we present a simple and robust Mixed Reality (MR) framework that allows for real-time interaction with Virtual Humans in real and virtual environments under consistent illumination. We will look at three crucial parts of this interface system: interaction, animation and global illumination of virtual humans for an integrated and enhanced presence and believability. The interaction system comprises of a dialogue module, which is interfaced with a speech recognition and synthesis system. Next to speech output, the dialogue system generates face and body motions, which are in turn managed by the virtual human animation layer. Our fast animation engine can handle various types of motions, such as normal keyframe animations, or motions that are generated on-the-fly by adapting previously recorded clips. All these different motions are generated and blended on-line, resulting in a flexible and realistic animation. Our robust rendering method operates in accordance with the previous animation layer, based on an extended for virtual humans Precomputed Radiance Transfer (PRT) illumination model (Sloan et al., 2002), resulting in a realistic display of such interactive virtual characters in mixed reality environments. Finally, we present a scenario that illustrates the interplay and application of our methods, glued under a unique framework (Papagiannakis et al., 2005) for presence and interaction in MR.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Storytelling in Virtual Reality",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:z6xuaG2dYH0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Modeling of Bodies and Clothes for Virtual Environments",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1366175/",
            "Abstract": "Although graphical human modeling has been a long sought subject in computer graphics, when it comes to dealing with real-time applications, it raises a number of unique requirements for both CG artists and researchers. For example, for a real-time performance it is highly desirable to lighten the geometry and optimize the runtime animation of characters wherever possible. An important need in such systems is to assist the CG artists in seamlessly transforming their modeling work from CG packages to the real-time application, without limiting their expressivity. In this paper we describe techniques by which dressed human characters are modeled, loaded into VR scenes, and simulated in real-time. In doing so, we point out challenging issues and solutions that such tasks imply at each phase of modeling and simulation. In particular, we turn our attention to what we consider as key technical components: body and …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:BrOSOlqYqPUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mixed reality serious games and gamification for smart education",
            "Publication year": 2016,
            "Publication url": "https://search.proquest.com/openview/8a1755d985b3545570bd0d8334cbd0e6/1?pq-origsite=gscholar&cbl=396495",
            "Abstract": "The appeal of Mixed Reality (MR) digital games arouses interest among researchers and education specialists who since their recent proliferation, they have been trying to introduce their motivating potential in learning contexts. Our main research question in this work focuses on whether MR digital games can, via novel Presence (feeling of'being and doing there'in a virtual or augmented world) and MR gamification (dynamics, mechanics, components) support and foster future learning and teaching, to address a wide variety and variation of educational contexts. To accomplish the above, a consistent computational framework that supports new types of Mixed-Reality Serious Games and Gamification (MRSGs) is established in this work that features MR gesture-based and game-based learning. The introduced term Mixed Reality Serious Games (MRSGs), refers to digital mini game-shells that allow the learners and …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:eO3_k5sD8BwC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "Style-based motion analysis for dance composition",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-017-1452-z",
            "Abstract": "Synthesizing human motions from existing motion capture data is the approach of choice in most applications requiring high- quality visual results. Usually to synthesize motion, short motion segments are concatenated into longer sequences by finding transitions at points where character poses are similar. If similarity is only a measure of posture correlation, without consideration for the stylistic variations of movement, the resulting motion might have unnatural discontinuities. Particularly prone to this problem are highly stylized motions, such as dance performances. This work presents a motion analysis framework, based on Laban Movement Analysis, that also accounts for stylistic variations of the movement. Implemented in the context of Motion Graphs, it is used to eliminate potentially problematic transitions and synthesize style-coherent animation, without requiring prior labeling of the data. The …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:Xl6nMSl579sC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "VHD++ development framework: Towards extendible, component based VR/AR simulation engine featuring advanced virtual character technologies",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1214453/",
            "Abstract": "We present the architecture of the VHD++ real-time development framework that after several years of intensive research, design, and development effort has been released and enters its validation phase. We discuss the key aspects involved in architectural structure, design and practical implementation of an efficient, flexible and extendible real-time software framework based on the modern 3D game-engine design principles. This framework supports researchers and application developers with rapid, component based development of VR/AR systems featuring advanced virtual character simulation technologies. The discussion covers motivation, main concepts, survey of related work, the main functional and design requirements, design principles and key architectural elements. It concludes with the initial validation results including overview of existing VHD++ based VR/AR virtual character simulation applications.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scenior: An Immersive Visual Scripting system of Gamified Training based on VR Software Design Patterns",
            "Publication year": 2019,
            "Publication url": "https://scholar.google.com/scholar?cluster=2774562071484849591&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:2ywjKiB__4kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cross-platform, remotely-controlled mobile avatar simulation framework for AmI environments",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2669062.2669083",
            "Abstract": "Nowadays, users are able to interact with digital content using their mobile devices almost everywhere and anytime due to the increased power, portability, and ubiquitous connectivity of mobile devices. This paper presents the design and implementation of a novel, remotely controlled for the purposes of edutainment and instructor-student interaction, three-dimensional full body avatar gamification framework. The main innovation introduced focuses on multi-presence gamified educational scenarios in multiple desktop computers and mobile devices. Thus the remotely-controlled avatar can act as a guide, assistant or information presenter for novel, cross-platform Ambient Intelligence (AmI) edutainment scenarios. In detail, the avatar's role depends on the requirements of the AmI client applications as these are propagated remotely (using remote procedure calls). Examples of remote function invocations include real …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:-95Q15plzcUC",
            "Publisher": "ACM"
        },
        {
            "Title": "8 A Stable Real-time AR Framework for Training and Planning in Industrial Environments",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ETnTBwAAQBAJ&oi=fnd&pg=PA127&dq=info:6fgmf5kl9MwJ:scholar.google.com&ots=cxSO1Qjxx6&sig=ZgXIStM0mX612C2vEWjlcHQBh5M",
            "Abstract": "Augmented reality (AR) systems can be effectively used to enhance manufacturing and industrial processes. However, not all the existing prototypes of AR systems can be used in an industrial environment due to heavy constraints such as low robustness or cumbersome equipment. Our AR system relies purely on passive techniques to solve the real-time registration problem, and it can run on a portable computer. We combined a powerful virtual reality (VR) componentbased simulation framework with computer vision techniques, turning it into an AR system. The resulting system allows us to produce complex rendering and animation of avatars, and blend them into the real world. The system tracks the 3D camera position by means of a natural features tracker, which, given a rough CAD model, can deal with complex 3D objects. The tracking method is robust and can handle large camera displacements and aspect changes. The target applications of our AR system are industrial maintenance, repair and training. The tracking robustness makes the AR system able to work in real environments, such as industrial facilities, and not only in the laboratory.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:jSAVyFp_754C",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "When Children Program Intelligent Environments: Lessons Learned from a Serious AR Game",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.04904",
            "Abstract": "While the body of research focusing on Intelligent Environments (IEs) programming by adults is steadily growing, informed insights about children as programmers of such environments are limited. Previous work already established that young children can learn programming basics. Yet, there is still a need to investigate whether this capability can be transferred in the context of IEs, since encouraging children to participate in the management of their intelligent surroundings can enhance responsibility, independence, and the spirit of cooperation. We performed a user study (N=15) with children aged 7-12, using a block-based, gamified AR spatial coding prototype allowing to manipulate smart artifacts in an Intelligent Living room. Our results validated that children understand and can indeed program IEs. Based on our findings, we contribute preliminary implications regarding the use of specific technologies and paradigms (e.g. AR, trigger-action programming) to inspire future systems that enable children to create enriching experiences in IEs.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:CNPyR2KL9-0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interactive scenario immersion: Health emergency decision training in JUST project",
            "Publication year": 2002,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.465.6991&rep=rep1&type=pdf",
            "Abstract": "The paper discusses the main requirements, constraints and challenges involved in practical realization of an immersive VR situation training system that would support simulation of interactive scenarios of various type. A special attention is paid to the demanding health emergency decision training domain. As an example an immersive JUST VR health emergency training system built in frame of EU IST JUST project is presented in more detail.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Real-time separable subsurface scattering for animated virtual characters",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-981-287-134-3_4",
            "Abstract": "In this chapter, we present our real-time, GPU-accelerated separable subsurface scattering method for interactive, skeletal-based deformable animated virtual characters. Our screen space implementation is based on state-of-the-art algorithms, and we propose specific algorithmic and implementation extensions so that these algorithms can be employed in real-time virtual characters. We have created a physically principled real-time rendering framework, which features a series of rendering effects based on widely available open-source tools such as Open Scene Graph, C++, and GLSL so that it can be easily integrated in modern rendering engines and scene graphs via commodity graphics h/w.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:uVUOdF_882EC",
            "Publisher": "Springer, Singapore"
        },
        {
            "Title": "Believability and presence in mobile mixed reality environments",
            "Publication year": 2005,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.500.6414&rep=rep1&type=pdf",
            "Abstract": "Mixed Realities (MR) and their concept of cyber-real space interplay invoke such interactive’touching’experiences that promote new patterns of believability and presence. Believability is a term used to measure the realism of interaction in the MR environments. Presence is defined as the measure that is used to convey the feeling of ‘being there’. A rich media storytelling case study is used as an example for illustrating the effects of introduction of virtual characters in mobile AR. Although presence is strengthened, believability is not keeping its pace, due to limited interaction between the real participants and the virtual characters, as part of limitations of mobile technology. In this work we are addressing the issues of creating interactive applications for mobile MR, in order to deliver ‘real’experiences. We argue that future steps in mobile MR enabling technologies should cater for enhanced social awareness of the virtual humans to the real world and new channels for interactivity between the real users and virtual actors. Only then the believability factor of virtuality structures will be enhanced and allow for compelling real experiences through mobile virtual environments.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:ufrVoPGSRksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual Reality surgical medical training in the post-Covid-19 pandemic era",
            "Publication year": 2021,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:RtRctb2lSbAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nadia Magnenat Thalmann",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Nadia-Thalmann/amp",
            "Abstract": "AIM@ SHAPE-Advanced and Innovative Models And Tools for the development of Semantic-based systems for Handling, Acquiring, and Processing knowledge Embedded in multidimensional digital objects",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:C33y2ycGS3YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Projecting our Past to the Future – Challenges and Results : The Case of Asinou church",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Vasiliki_Nikolakopoulou/project/Initial-Training-Network-on-Digital-Cultural-Heritage-ITN-DCH/attachment/5bae22193843b006753ba5fc/AS:675816631451670@1538138649673/download/Projecting+our+Past+to+the+Future+-+Challenges+and+Results.pdf?context=projectUpdateDetail",
            "Abstract": "In this paper, we present some of the novel results of the Marie Curie Initial Training Network for Digital Cultural Heritage (ITN-DCH) project, describing briefly the work done focusing on the project’s first case study: the Panagia Phorviotisa of Asinou, an UNESCO World Heritage Listed (WHL) monument in Cyprus. The paper introduces some challenges and the importance of multidisciplinary, sustainable research and development in the emerging domain of DCH in Europe. The different methodologies address these challenges through a professional network of partners including Academia, Research and Industry. The paper describes the 3D documentation of the church and how the data acquired can be used and re-used in Mixed Reality (MR) applications using also Deep Learning techniques, as well as in Education.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:HJSXoJQnj-YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An all-in-one geometric algorithm for cutting, tearing, drilling deformable models",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.07499",
            "Abstract": "Conformal Geometric Algebra (CGA) is a framework that allows the representation of objects, such as points, planes and spheres, and deformations, such as translations, rotations and dilations as uniform vectors, called multivectors. In this work, we demonstrate the merits of multivector usage with a novel, integrated rigged character simulation framework based on CGA. In such a framework, and for the first time, one may perform real-time cuts and tears as well as drill holes on a rigged 3D model. These operations can be performed before and/or after model animation, while maintaining deformation topology. Moreover, our framework permits generation of intermediate keyframes on-the-fly based on user input, apart from the frames provided in the model data. We are motivated to use CGA as it is the lowest-dimension extension of dual-quaternion algebra that amends the shortcomings of the majority of existing animation and deformation techniques. Specifically, we no longer need to maintain objects of multiple algebras and constantly transmute between them, such as matrices, quaternions and dual-quaternions, and we can effortlessly apply dilations. Using such an all-in-one geometric framework allows for better maintenance and optimization and enables easier interpolation and application of all native deformations. Furthermore, we present these three novel algorithms in a single CGA representation which enables cutting, tearing and drilling of the input rigged model, where the output model can be further re-deformed in interactive frame rates. These close to real-time cut,tear and drill algorithms can enable a new suite of applications …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:-yGd096yOn8C",
            "Publisher": "Springer"
        },
        {
            "Title": "A True AR Authoring Tool for Interactive Virtual Museums.",
            "Publication year": 2020,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3d7bDwAAQBAJ&oi=fnd&pg=PA225&dq=info:WiGp-Q92p-gJ:scholar.google.com&ots=TK5VHblCnd&sig=CkYWlv77Hrbub9jCcgLWneYCCrI",
            "Abstract": "In this work, a new and innovative way of spatial computing that appeared recently in the bibliography called True Augmented Reality (AR), is employed in cultural heritage preservation. This innovation could be adapted by the Virtual Museums of the future to enhance the quality of experience. It emphasises, the fact that a visitor will not be able to tell, at a first glance, if the artefact that he/she is looking at is real or not and it is expected to draw the visitors’ interest. True AR is not limited to artefacts but extends even to buildings or life-sized character simulations of statues. It provides the best visual quality possible so that the users will not be able to tell the real objects from the augmented ones. Such applications can be beneficial for future museums, as with True AR, 3D models of various exhibits, monuments, statues,",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:RJOyoaXV5v8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile augmented heritage: Enabling human life in ancient Pompeii",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/1478-0771.5.2.396",
            "Abstract": "We propose a new methodology for real-time mobile mixed reality systems that feature realistic simulations of animated virtual human actors (clothes, body, skin, face) who augment real environments and re-enact staged storytelling dramas. Although initially targeted at Cultural Heritage Sites, the paradigm is by no means limited to such subjects. The abandonment of traditional concepts of static cultural artifacts or rigid geometrical and 2D textual augmentations with 3D, interactive, augmented historical character-based event representations in a mobile and wearable setup, is the main contribution of the described work as well as the proposed extensions to AR Enabling technologies: a VR/AR character simulation kernel framework with character to object interaction, a markerless camera tracker specialized for non-invasive geometrical registration on heritage sites and a PRT mixed reality illumination model for …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:_FxGoFyzp5QC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Virtual Reality Rehabilitation Based on Neurologic Music Therapy: A Qualitative Preliminary Clinical Study",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-91152-6_9",
            "Abstract": "Neurological disorders, as stroke, and their consequences are a leading cause of death and disability around the world and most of the survivors experience mainly chronic motor deficits associated with reduced social and personal quality of life. Thus, there is a need to identify the best training strategy for the retraining of motor function of the UL.In this paper, we describe a novel, therapeutic VR system combining Presence Positive Technologies for Well-being and techniques of Neurologic Music Therapy (NMT), for a more efficient retraining of the motor function of the UL of a stroke suffered patients. For the adequate movements that constitute the training exercises, a team of doctors of KAT hospital in Athens, Greece, aided us in our clinical study. The main objective of the described method is to use the Virtual Environment (VE) with natural hand tracking as the main training platform, providing a …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:2v_ZtQDX9iAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Psychomotor Surgical Training in Virtual Reality",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-64177-5_41",
            "Abstract": "In this chapter, we present a novel s/w system aiming to disrupt the healthcare training industry with the first psychomotor virtual reality (VR) surgical training solution. We provide the means for performing surgical operations in VR, thereby facilitating training in a fail-safe environment that very accurately simulates reality and significantly reduces training costs, offering surgeons and the healthcare ecosystem a way to improve operation outcomes drastically.With the presented system, we focus on a completed total knee arthroplasty (TKA) virtual reality operating module, opening the way for making available a full suite of virtual reality operations. Our methodology transforms medical training to a cost-effective and easily and broadly accessible process. The latter is accomplished by employing the latest VR, gamification and tracking technologies for virtual character-based, interactive 3D medical …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:SnGPuo6Feq8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "CGI 2016 Editorial (TVCJ)",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-016-1271-7",
            "Abstract": "Welcome to the special issue of the 33rd Computer Graphics International 2016 (CGI’16) conference. Computer Graphics International is one of the oldest and truly international conferences in computer graphics and is one of the main places where people gather to share their latest achievements in computer graphics. CGI is the official conference of the Computer Graphics Society, a long-standing international computer graphics organization. CGI and CGS were initiated in Tokyo by Professor TL Kunii from the University of Tokyo in 1983. Since then, the CGI conference has been held in many different countries across the world and is one of the key conferences to discover the latest advances in computer graphics. This year, CGI’16 has been organized by the Foundation for Research and Technology—Hellas (FORTH), in Heraklion, Crete, Greece from 28th June till 1st July. The conference has been supported by …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:raTqNPD5sRQC",
            "Publisher": "http://dx.doi.org/10.1007/s00371-016-1271-7"
        },
        {
            "Title": "A Virtual Heritage Case Study: A Modern Approach to the Revival of Ancient Historical or Archeological Sites Through Application of 3D Real-Time Computer Graphics.",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.586.7013&rep=rep1&type=pdf",
            "Abstract": "This paper presents the case study of a real-time interactive digital narrative visualisation of the Namaz Pray of a simulated Ottoman Imam in the 16th century virtually restored mosque of Küçük Aya Sofya (previous St. Sergius and Bacchus church) as well as in the Hagia Sophia mosque (previous cathedral of Hagia Sophia), in Istanbul, Turkey. This case study illustrates that the abandonment of traditional concepts of static cultural artefacts with interactive, augmented historical character-based narrative representations, can propel virtual reconstructions of cultural heritage sites to an exciting new edutainment medium. Furthermore, a reconstruction and real-time immersive visualisation is presented by simulating these edifices both as churches (original form) and as mosques, fully respecting the archaeological, historical and architectural premises.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:oi2SiIJ9l4AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tools for populating cultural heritage environments with interactive virtual humans",
            "Publication year": 2008,
            "Publication url": "https://www.culturalinformatics.org.uk/sites/culturalinformatics.org.uk/files/Rome_Pro_20111012.pdf#page=25",
            "Abstract": "Modern 3D VR systems rely heavily on the interplay of heterogeneous technologies. Because of this inherently interdisciplinary character, VR domain can be viewed as a melting pot of various technologies which although complementary are non-trivial to put together. Frameworks can be used to address this challenge as they offer advantages such as reusability of components, as well as ease of replacements, extensions, and adaptations. Hence, this paper presents developments within the EPOCH project, in particular the Characterize NEWTON, to improve and release frameworks that support the incorporation of avatars in interactive real-time 3D VR systems. The purpose is to enable avatars to be interactive and to react to model metadata; thus adding realism and engaging the user’s interest. This vertical middleware offers the advantage to be based on open source generic frameworks, such as OpenSceneGraph and OpenSG as well as offering complementary functionalities.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Time-dependent illumination and animation of virtual Hagia-Sophia",
            "Publication year": 2007,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/1478-0771.5.2.284",
            "Abstract": "This paper presents a case study centered on the virtual restitution and virtual life simulation of a highly complex and endangered heritage edifice: the church of Hagia Sophia, in Istanbul, Turkey. The goal of this article is to describe the techniques used in order to achieve a real time rendering and animation of the selected space and its characters, as well as to point out the challenges and solutions that such a work implies at different stages in production. Most of these issues are focused on the reconstruction of the architecture of the site; however, in order to achieve an accurate simulation, the social aspect is not to be omitted. The importance of a heritage site resides as well in the historical characters and the social interactions that were taking place there: this information allows a better understanding of the function and the importance of the selected site in connection with the cultural aspects of the life at a …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:MXK_kJrjxJIC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "Virtual reality simulation facilitates resident training in total hip arthroplasty: a randomized controlled trial",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0883540319303341",
            "Abstract": "No study has yet assessed the efficacy of virtual reality (VR) simulation for teaching orthopedic surgery residents. In this blinded, randomized, and controlled trial, we asked if the use of VR simulation improved postgraduate year (PGY)-1 orthopedic residents’ performance in cadaver total hip arthroplasty and if the use of VR simulation had a preferentially beneficial effect on specific aspects of surgical skills or knowledge.Fourteen PGY-1 orthopedic residents completed a written pretest and a single cadaver total hip arthroplasty (THA) to establish baseline levels of knowledge and surgical ability before 7 were randomized to VR-THA simulation. All participants then completed a second cadaver THA and retook the test to assess for score improvements. The primary outcomes were improvement in test and cadaver THA scores.There was no significant difference in the improvement in test …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:YlPif8NxrbYC",
            "Publisher": "Churchill Livingstone"
        },
        {
            "Title": "An Illumination Registration Model for Dynamic Virtual Humans in Mixed Reality THÈSE",
            "Publication year": 2006,
            "Publication url": "http://george.papagiannakis.org/multimedia/papagiannakisMIRALab06web.pdf",
            "Abstract": "From the platonic notion of world of ideas and world of the senses to the computer graphics simulations across the Mixed Realities continuum the principal aim was common: invent an empirical realism that sustains its inextricably integrated strands of ideal and sensual, virtual and real, through pragmatic and structuralist narratives. This process has been exemplified through the cinematic film narratives where the composition of real and virtual dynamic elements (such as compositing virtual creatures in real video scenes) has been evolving with a constantly growing pace. Recent developments in the computer graphics hardware and algorithmic domain allow for consistent and believable compositions for the interactive equivalent of cinematic compositions, that of Augmented Reality (AR) simulations. For such interactive and real-time AR synergies to occur, the geometric and the illumination registration of the …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:TlpoogIpr_IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An inclusive Conformal Geometric Algebra GPU animation interpolation and deformation algorithm",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-016-1270-8",
            "Abstract": "In the last years, Geometric Algebra with its Euclidean, Homogeneous and Conformal models attracts the research interest in many areas of Computer Science and Engineering and particularly in Computer Graphics as it is shown that they can produce more efficient and smooth results than other algebras. In this paper, we present an all-inclusive algorithm for real-time animation interpolation and GPU-based geometric skinning of animated, deformable virtual characters using the Conformal model of Geometric Algebra (CGA). We compare our method with standard quaternions, linear algebra matrices and dual-quaternions blending and skinning algorithms and we illustrate how our CGA-GPU inclusive skinning algorithm can provide as smooth and more efficient results as state-of-the-art previous methods. Furthermore, the elements of CGA that handle transformations (CGA motors) can support translation …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:YsrPvlHIBpEC",
            "Publisher": "http://dx.doi.org/10.1007/s00371-016-1270-8"
        },
        {
            "Title": "A stable real-time AR framework for training and planning in industrial environments",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-3873-0_8",
            "Abstract": "Augmented reality (AR) systems can be effectively used to enhance manufacturing and industrial processes. However, not all the existing prototypes of AR systems can be used in an industrial environment due to heavy constraints such as low robustness or cumbersome equipment. Our AR system relies purely on passive techniques to solve the real-time registration problem, and it can run on a portable computer. We combined a powerful virtual reality (VR) component-based simulation framework with computer vision techniques, turning it into an AR system. The resulting system allows us to produce complex rendering and animation of avatars, and blend them into the real world. The system tracks the 3D camera position by means of a natural features tracker, which, given a rough CAD model, can deal with complex 3D objects. The tracking method is robust and can handle large camera displacements and …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:kWvqk_afx_IC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Immersive VR decision training: telling interactive stories featuring advanced virtual human simulation technologies",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/769953.769965",
            "Abstract": "Based on the premise of a synergy between the interactive storytelling and VR training simulation this paper treats the main issues involved in practical realization of an immersive VR decision training system supporting possibly broad spectrum of scenarios featuring interactive virtual humans. The paper describes a concrete concept of such a system and its practical realization example.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mixed-reality geometric algebra animation methods for gamified intangible heritage",
            "Publication year": 2014,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/2047-4970.3.4.683",
            "Abstract": "In this work we propose a novel, mobile, cross-platform open framework specifically for animated, skinned and life-size augmentations of real scenes with virtual characters. Already ten years ago we had demonstrated such technologies on the site of ancient Pompeii however, with a VR/AR closed-system running on a powerful mobile workstation hidden on a backpack. Nowadays we exhibit similar functionality running on modern smartphones running on an open-source, cross-platform gamification framework. Due to the openness of this framework we integrate a modern AR markerless camera tracking toolkit coupled with our novel algorithm for animation interpolation blending based on geometric algebra, which would not be otherwise easily achievable only in commercial, off-the-self toolkits. Thus our approach allows for open-standards research in virtual character simulation as well as novel AR augmentations …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:HhcuHIWmDEUC",
            "Publisher": "Multi Science Publishing"
        },
        {
            "Title": "A computational medical XR discipline",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2108.04136",
            "Abstract": "Computational medical XR (extended reality) unifies the computer science applications of intelligent reality, medical virtual reality, medical augmented reality and spatial computing for medical training, planning and navigation content creation. It builds upon clinical XR by bringing on novel low-code/no-code XR authoring platforms, suitable for medical professionals as well as XR content creators.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:mel-f30kHHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "From real to virtual rapid architectural prototyping",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34234-9_52",
            "Abstract": "Can greater visual realism of a real-time architectural virtual walkthrough achieve similar high sensory impact, or qualia, as a fabricated 3D printed scale model of an urban landscape? The aim of this project is to answer that question by allowing a real existing city heritage landscape during a large urban planning project to be 3D modeled and subsequently be studied via a dual output: a fabricated real, physical scale model based on a latest high quality color 3D printer and an equivalent 3D virtual walkthrough of enhanced real-time visual realism based on a recent game engine. Conclusions of this experiment and user study suggest that a virtual, interactive simulation based on specific latest real-time rendering algorithms can indeed convey a similar user experience and feeling of “presence” that an equivalent architectural scale model offers, regarding fast appreciation of both space and structure.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Transforming Medical Education and Training with VR using MAGES",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3283289.3283291",
            "Abstract": "In this work, we propose a novel VR s/w system aiming to disrupt the healthcare training industry with the first Psychomotor Virtual Reality (VR) Surgical Training solution. Our system generates a fail-safe, realistic environment for surgeons to master and extend their skills in an affordable and portable solution. We deliver an educational tool for orthopedic surgeries to enhance the learning procedure with gamification elements, advanced interactability and cooperative features in an immersive VR operating theater. Our methodology transforms medical training to a cost-effective, easily and broadly accessible process. We also propose a fully customizable SDK platform able to generate educational VR simulations with minimal adaptations. The latter is accomplished by prototyping the learning pipeline into structured, independent and reusable segments, which are used to generate more complex behaviors. Our …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:hSRAE-fF4OAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Virtual Restitution of Endangered Sacred Heritage Sites",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.601.1782&rep=rep1&type=pdf",
            "Abstract": "This paper presents a case study centered on the virtual restitution of a highly complex and endangered sacred heritage site: the Hagia Sophia edifice in Istanbul, Turkey (added in 1996 in the annual list of endangered monuments by the World Monuments Watch). The goal of this article is to describe a methodology to achieve a photo-realistic restitution of the selected space and its characters, as well as to point out the challenges, choices and solutions that such a work implies at different stages in production.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:KNjnJ3z-R6IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "X-Reality Museums: Unifying the Virtual and Real World Towards Realistic Virtual Museums",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/946110",
            "Abstract": "Culture is a field that is currently entering a revolutionary phase, no longer being a privilege for the few, but expanding to new audiences who are urged to not only passively consume cultural heritage content, but actually participate and assimilate it on their own. In this context, museums have already embraced new technologies as part of their exhibitions, many of them featuring augmented or virtual reality artifacts. The presented work proposes the synthesis of augmented, virtual and mixed reality technologies to provide unified X-Reality experiences in realistic virtual museums, engaging visitors in an interactive and seamless fusion of physical and virtual worlds that will feature virtual agents exhibiting naturalistic behavior. Visitors will be able to interact with the virtual agents, as they would with real world counterparts. The envisioned approach is expected to not only provide refined experiences for museum visitors, but also achieve high quality entertainment combined with more effective knowledge acquisition. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:MIg0yeAD4ggC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Real-time rendering under distant illumination with Conformal Geometric Algebra",
            "Publication year": 2017,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.4560",
            "Abstract": "Precomputed radiance transfer (PRT) methods established for handling global illumination (GI) of objects from area lights in real time and many techniques proposed for rotating the light using linear algebra rotation matrices. Rotating area lights efficiently are crucial part for computer graphics since it is one of the main components of real‐time rendering. Matrices commonly used for handling such rotations are not quite efficient and require high memory consumption; as a result, the need for proposing new more efficient rotation algorithms has been established. In this work, we use the conformal geometric algebra (CGA) as the mathematical background for “GI in real‐time” under distant Image‐based lighting (IBL) illumination, for diffuse surfaces with self‐shadowing by efficiently rotating the environment light using CGA entities. Our work is based on spherical harmonics (SH), which are used for approximating …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:69ZgNCALVd0C",
            "Publisher": "John Wiley & Sons,DOI: 10.1002/mma.4560"
        },
        {
            "Title": "Camera-based gaze control for virtual characters",
            "Publication year": 2007,
            "Publication url": "https://archive-ouverte.unige.ch/unige:120456",
            "Abstract": "Virtual characters have become crucial to many interactive 3D graphical virtual environment simulations in the context of virtual reality and computer games. One of the primary concerns of the designers of such environments is to model the interaction of the virtual characters with the users. The gaze of the virtual character forms a chief component of this interaction. When the gaze of the virtual character is directed correctly towards the users, they perceive a sense of presence inside the virtual environment, during their interactions with the virtual character. We present, in this paper, a simple idea to control the gaze of a virtual character based on the viewpoint of the user involved in the interaction, suitable both for Virtual Reality as well as Augmented Reality applications. We also place the idea in the context of methods to control gaze that already exist in literature by providing a summary of the existing works.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Association ACROE"
        },
        {
            "Title": "Deform, Cut and Tear a Skinned Model Using Conformal Geometric Algebra",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-61864-3_37",
            "Abstract": "In this work, we present a novel, integrated rigged character simulation framework in Conformal Geometric Algebra (CGA) that supports, for the first time, real-time cuts and tears, before and/or after the animation, while maintaining deformation topology. The purpose of using CGA is to lift several restrictions posed by current state-of-the-art character animation & deformation methods. Previous implementations originally required weighted matrices to perform deformations, whereas, in the current state-of-the-art, dual-quaternions handle both rotations and translations, but cannot handle dilations. CGA is a suitable extension of dual-quaternion algebra that amends these two major previous shortcomings: the need to constantly transmute between matrices and dual-quaternions as well as the inability to properly dilate a model during animation. Our CGA algorithm also provides easy interpolation and application of all …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:tHtfpZlB6tUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A comparison of gamified, immersive VR curation methods for enhanced presence and human-computer interaction in digital humanities",
            "Publication year": 2015,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1260/2047-4970.4.2.221",
            "Abstract": "Gamification of virtual reality (VR) experiences is a topic of research that has been particularly intensified with the advent or recent VR h/w, such as, low-cost, high field-of-view head-mounted displays (HMDs). The main novelty of this work lies in the investigation and comparison of different s/w human-computer interaction methodologies for real-time VR simulation of both tangible and intangible digital heritage sites and the creation of dedicated, immersive, gamified curation experiences. Important conclusions are drawn since for the first time, VR is finally becoming a mass consumer product that will be delivering more and more convincing interactive experiences with elevated feeling of Presence for Digital Humanities. Based on recent specific software 3D platforms and 3D content creation pipelines, digital heritage environments can benefit immensely from such versatile, efficient and robust prototyping VR human …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:O0nohqN1r9EC",
            "Publisher": "Multi-Science & Doppler press"
        },
        {
            "Title": "Visualizing and Tracking Virtual Humans in AR Cultural Heritage Sites",
            "Publication year": 2003,
            "Publication url": "https://infoscience.epfl.ch/record/100286",
            "Abstract": "Visualizing and Tracking Virtual Humans in AR Cultural Heritage Sites - Infoscience English \nFrançais login Home > Visualizing and Tracking Virtual Humans in AR Cultural Heritage Sites \nInfoscience Information Usage statistics Files Visualizing and Tracking Virtual Humans in AR \nCultural Heritage Sites Papagiannakis, G ; Schertenlieb, S ; Kennedy, B ; Ponder, M ; \nMagnenat-Thalmann, N ; Thalmann, D ; Stoddart, A Published in: Proc. AVIR 2003 Presented at: \nWorkshop on Augmented Virtual Reality (AVIR), 2003, Geneva, Switzerland, 18-19 September, \n2003 Year: 2003 Laboratories: VRLAB Record appears in: Scientific production and \ncompetences > I&C - School of Computer and Communication Sciences > IINFCOM > VRLAB - \nVirtual Reality Laboratory Peer-reviewed publications Conference Papers Work produced at \nEPFL Published Export as: BibTeX | MARC | MARCXML | DC | EndNote | NLM | RefWorks | RIS …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:mKu_rENv82IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A virtual 3D mobile guide in the INTERMEDIA project",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/article/10.1007/s00371-008-0264-6",
            "Abstract": "In this paper, we introduce a European research project, interactive media with personal networked devices (INTERMEDIA) in which we seek to progress beyond home and device-centric convergence toward truly user-centric convergence of multimedia. Our vision is to make the user the multimedia center: the user as the point at which multimedia services and the means for interacting with them converge. This paper proposes the main research goals in providing users with a personalized interface and content independent of physical networked devices, and space and time. As a case study, we describe an indoors, mobile mixed reality guide system: Chloe@University. With a see-through head-mounted display (HMD) connected to a small wearable computing device, Chloe@University provides users with an efficient way to guide someone in a building. A 3D virtual character in front of the user guides …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:UebtZRa9Y70C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Real-time virtual humans in AR sites",
            "Publication year": 2004,
            "Publication url": "https://infoscience.epfl.ch/record/100052/files/Papagiannakis_and_al_CVMP_05.pdf",
            "Abstract": "In this paper we present our work on the LIFEPLUS EU IST project. LIFEPLUS proposes an innovative 3D reconstruction of ancient frescos-paintings through the real-time revival of their fauna and flora, featuring groups of virtual animated characters with artificial life dramaturgical behaviors, in an immersive AR environment. The goal of this project is to push the limits of current Augmented Reality (AR) technologies, exploring the processes of narrative design of fictional spaces where users can experience a high degree of realistic interactive immersion. Based on a captured/real-time video of a real scene, the project is oriented in enhancing these scenes by allowing the possibility to render realistic 3D simulations of virtual characters in real-time. Although initially targeted at Cultural Heritage Centers and Sites, the paradigm is by no means limited to such subjects, but encompasses all types of future Location-Based Entertainments, E-visitor Attractions, e-Worker training schemes as well as on-set visualizations for the TV/movie industry. In this paper we provide an overview of the project and the technologies being employed and finally we present early results based on the ongoing research.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Real-time photo realistic simulation of complex heritage edifices",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/969674/",
            "Abstract": "We describe a new methodology for 3D photo realistic reconstruction and real-time simulation of complex heritage edifices, using widely available standard tools. The aim is to build compelling, interactive and highly realistic virtual cultural reconstructions, as their static lighting is based on premium precalculated lighting data. This data is obtained by the use of appealing photo realistic lighting models, such as the Radiosity global illumination technique. The resulting high-quality lighting information is stored in 2D textures, called light maps, which according to the multi-pass multi-texture technique, are blended in real-time with the model ordinary texture maps. The real-time experience is also accompanied with an integrated atmospheric simulation based on particle systems. The whole methodology is based on international open standard programming languages and APIs, while leaving the user to freely select and …",
            "Abstract entirety": 0,
            "Author pub id": "rUfyI3MAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A taxonomy of visualization strategies for cultural heritage applications",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1805961.1805962",
            "Abstract": "In this article we present a general classification of the different approaches that might be employed to constitute a visual representation of a cultural heritage item, including the ones featuring the use of traditional tools as the ones exhibiting the inclusion of modern 2D and 3D digital technologies. In order to establish a coherent taxonomy, specific elements characterizing such approaches will be discussed and employed to assist the definition of a general conceptual framework that will enable the classification of the possible design choices according to their specific characteristics. Finally, a selection of modeling and simulation techniques which are specifically related to the creation process underlying the virtual representation of heritage items by means of modern visualization technologies will be explored alongside the main areas of preferences linked to the major actors active in the cultural heritage field.",
            "Abstract entirety": 1,
            "Author pub id": "rUfyI3MAAAAJ:hqOjcs7Dif8C",
            "Publisher": "ACM"
        }
    ]
}]