[{
    "name": "Γεωργία Κάραλη",
    "romanize name": "Georgia Karali",
    "School-Department": "Μαθηματικών & Εφαρμοσμένων Μαθηματικών",
    "University": "uoc",
    "Rank": "Καθηγητής",
    "Apella_id": 11144,
    "Scholar name": "Georgia Karali",
    "Scholar id": "Ae5ALHUAAAAJ",
    "Affiliation": "Professor, University of Crete",
    "Citedby": 494,
    "Interests": [
        "Applied Analysis-Stochastic pde's-Non Linear Partial Differential Equations"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=Ae5ALHUAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "The sharp interface limit for the stochastic Cahn–Hilliard equation",
            "Publication year": 2018,
            "Publication url": "https://projecteuclid.org/journals/annales-de-linstitut-henri-poincare-probabilites-et-statistiques/volume-54/issue-1/The-sharp-interface-limit-for-the-stochastic-CahnHilliard-equation/10.1214/16-AIHP804.short",
            "Abstract": "We study the -dependent two and three dimensional stochastic Cahn–Hilliard equation in the sharp interface limit . The parameter  is positive and measures the width of transition layers generated during phase separation. We also couple the noise strength to this parameter. Using formal asymptotic expansions, we identify the limit. In the right scaling, our results indicate that the stochastic Cahn–Hilliard equation converge to a Hele-Shaw problem with stochastic forcing on the curvature equation. In the case when the noise is sufficiently small, we rigorously prove that the limit is a deterministic Hele-Shaw problem. Finally, we discuss which estimates are necessary in order to extend the rigorous result to larger noise strength.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Institut Henri Poincaré"
        },
        {
            "Title": "Continuum limits of particles interacting via diffusion",
            "Publication year": 2004,
            "Publication url": "https://www.hindawi.com/journals/aaa/2004/641376/",
            "Abstract": "We consider a two-phase system mainly in three dimensions and we examine the coarsening of the spatial distribution, driven by the reduction of interface energy and limited by diffusion as described by the quasistatic Stefan free boundary problem. Under the appropriate scaling we pass rigorously to the limit by taking into account the motion of the centers and the deformation of the spherical shape. We distinguish between two different cases and we derive the classical mean-field model and another continuum limit corresponding to critical density which can be related to a continuity equation obtained recently by Niethammer andOtto.  So, the theory of Lifshitz, Slyozov, and Wagner is improved by taking into account the geometry of the spatial distribution.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "The role of multiple microscopic mechanisms in cluster interface evolution",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039607000125",
            "Abstract": "In this paper we discuss mesoscopic models describing pattern formation mechanisms for a prototypical model of surface processes that involves multiple microscopic mechanisms. We focus on a mean field partial differential equation, which contains qualitatively microscopic information on particle–particle interactions and multiple particle dynamics, and we rigorously derive the macroscopic cluster evolution laws and transport structure. We show that the motion by mean curvature is given by V= μ σ κ, where k is the mean curvature, σ is the surface tension and μ is an effective mobility that depends on the presence of the multiple mechanisms and speeds up the cluster evolution. This is in contrast with the Allen–Cahn equation where V= κ.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Generation of fine transition layers and their dynamics for the stochastic Allen--Cahn equation",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1812.03804",
            "Abstract": "We study an $\\ep$-dependent stochastic Allen--Cahn equation with a mild random noise on a bounded domain in , . Here $\\ep$ is a small positive parameter that represents formally the thickness of the solution interface, while the mild noise $\\xi^\\ep(t)$ is a smooth random function of  of order $\\mathcal O(\\ep^{-\\gamma})$ with  that converges to white noise as $\\ep\\rightarrow 0^+$. We consider initial data that are independent of $\\ep$ satisfying some non-degeneracy conditions, and prove that steep transition layers---or interfaces---develop within a very short time of order $\\ep^2|\\ln\\ep|$, which we call the \"generation of interface\". Next we study the motion of those transition layers and derive a stochastic motion law for the sharp interface limit as $\\ep\\rightarrow 0^+$. Furthermore, we prove that the thickness of the interface for $\\ep$ small is indeed of order $\\mathcal O(\\ep)$ and that the solution profile near the interface remains close to that of a (squeezed) travelling wave, this means that the presence of the noise does not destroy the solution profile near the interface as long as the noise is spatially uniform. Our results on the motion of interface improve the earlier results of Funaki (1999) and Weber (2010) by considerably weakening the requirements for the initial data and establishing the robustness of the solution profile near the interface that has not been known before.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Thin-film equations with “partial wetting” energy: existence of weak solutions",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167278905002642",
            "Abstract": "The capillarity driven evolution with slip of a thin liquid film over a dry surface is considered in the regime of “partial wetting”. The focus is on the simplest model case of a constant, non-zero dynamic contact angle in the lubrication approximation. For the analytical treatment of the corresponding free boundary problem, a new strategy is proposed, based on the introduction of an ad hoc class of disjoining pressures which tend to concentrate at triple junctions. A first investigation of this approach yields the existence of weak solutions which satisfy the dissipation relation as an inequality and which are different from those with zero contact angle. A heuristic argument is also presented in order to clarify the connection between contact angle and dissipation relation: it shows that moving droplets which satisfy the dissipation relation as an equality are forced to have the prescribed contact angle.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:2osOgNQ5qMEC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Bubble interactions for the Mullins–Sekerka problem: Some case examples",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0378475409002730",
            "Abstract": "The Mullins–Sekerka free boundary problem originates from the study of solidification and liquidation of materials where material is transported by diffusion. In the present paper we explore dynamics of bubbles for the Mullins–Sekerka problem. Using a set of ordinary differential equations for the radii and the centers, we numerically simulate the relevant interactions in both “two-dimensional” and “three-dimensional” settings. Our results illustrate how larger bubbles grow at the expense of smaller ones and highlight the role of additional factors such as the initial inter-bubble distance or weak asymmetries in the bubble position in the ensuing dynamics. One novel feature in comparison with earlier works is the possibility to continue for the three-dimensional case the simulation past the points where one of the bubbles disappears.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:8k81kl-MbHgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "On the existence of solution for a Cahn-Hilliard/Allen-Cahn equation",
            "Publication year": 2014,
            "Publication url": "https://www.aimsciences.org/journals/displayArticles.jsp?paperID=8763",
            "Abstract": "In this manuscript, we consider a Cahn-Hilliard/Allen-Cahn equation is introduced in [17]. We give an existence of the solution, slightly improved from [18]. We also present a stochastic version of this equation in [3].",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:k_IJM867U9cC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Layer Dynamics for the one dimensional $\\eps $-dependent Cahn-Hilliard/Allen-Cahn Equation",
            "Publication year": 2021,
            "Publication url": "https://chesterrep.openrepository.com/handle/10034/625604",
            "Abstract": "We study the dynamics of the one-dimensional ε-dependent Cahn-Hilliard / Allen-Cahn equation within a neighborhood of an equilibrium of N transition layers, that in general does not conserve mass. Two different settings are considered which differ in that, for the second, we impose a mass-conservation constraint in place of one of the zero-mass flux boundary conditions at x = 1. Motivated by the study of Carr and Pego on the layered metastable patterns of Allen-Cahn in [10], and by this of Bates and Xun in [5] for the Cahn-Hilliard equation, we implement an N-dimensional, and a mass-conservative N−1-dimensional manifold respectively; therein, a metastable state with N transition layers is approximated. We then determine, for both cases, the essential dynamics of the layers (ode systems with the equations of motion), expressed in terms of local coordinates relative to the manifold used. In particular, we estimate the spectrum of the linearized Cahn-Hilliard / Allen-Cahn operator, and specify wide families of ε-dependent weights δ(ε), µ(ε), acting at each part of the operator, for which the dynamics are stable and rest exponentially small in ε. Our analysis enlightens the role of mass conservation in the classification of the general mixed problem into two main categories where the solution has a profile close to Allen-Cahn, or, when the mass is conserved, close to the Cahn-Hilliard solution.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Singular limit of a spatially inhomogeneous Lotka–Volterra competition–diffusion system",
            "Publication year": 2007,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03605300701382456",
            "Abstract": "We discuss the generation and the motion of internal layers for a Lotka-Volterra competition-diffusion system with spatially inhomogeneous coefficients. We assume that the corresponding ODE system has two stable equilibria (ū, 0) and (0,   ) with equal strength of attraction in the sense to be specified later. The equation involves a small parameter ϵ, which reflects the fact that the diffusion is very small compared with the reaction terms. When the parameter ϵ is very small, the solution develops a clear transition layer between the region where the u species is dominant and the one where the v species is dominant. As ϵ tends to zero, the transition layer becomes a sharp interface, whose motion is subject to a certain law of motion, which is called the “interface equation”. A formal asymptotic analysis suggests that the interface equation is the motion by mean curvature coupled with a drift term.We will establish a …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "A nonlinear partial differential equation for the volume preserving mean curvature flow",
            "Publication year": 2013,
            "Publication url": "https://www.aimsciences.org/article/exportPdf?id=307c45ca-fcb6-4cc0-b6fe-5ada7c6d90b1",
            "Abstract": "We analyze the evolution of multi-dimensional normal graphs over the unit sphere under volume preserving mean curvature flow and derive a non-linear partial differential equation in polar coordinates. Furthermore, we construct finite difference numerical schemes and present numerical results for the evolution of non-convex closed plane curves under this flow, to observe that they become convex very fast.1. Introduction. In this paper, we study the evolution of normal graphs over the unit sphere under volume preserving mean curvature flow (VPMCF). We use a proper diffeomorphism and a general parametrization of the unit sphere. Our main goal is to express evolution as an initial and boundary value problem with periodic conditions for a second order non-linear partial differential equation with non-local integral terms. In addition for the two-dimensional case, we solve the problem numerically by applying finite difference schemes. Given an initial simple and closed hypersurface S0 in Rn+ 1, we seek a family",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:KlAtU1dfN6UC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Layer dynamics for the one dimensional -dependent Cahn-Hilliard / Allen-Cahn equation",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2105.11003",
            "Abstract": "We study the dynamics of the one-dimensional -dependent Cahn-Hilliard / Allen-Cahn equation within a neighborhood of an equilibrium of  transition layers, that in general does not conserve mass. Two different settings are considered which differ in that, for the second, we impose a mass-conservation constraint in place of one of the zero-mass flux boundary conditions at . Motivated by the study of Carr and Pego on the layered metastable patterns of Allen-Cahn in [10], and by this of Bates and Xun in [5] for the Cahn-Hilliard equation, we implement an -dimensional, and a mass-conservative -dimensional manifold respectively; therein, a metastable state with  transition layers is approximated. We then determine, for both cases, the essential dynamics of the layers (ode systems with the equations of motion), expressed in terms of local coordinates relative to the manifold used. In particular, we estimate the spectrum of the linearized Cahn-Hilliard / Allen-Cahn operator, and specify wide families of -dependent weights , , acting at each part of the operator, for which the dynamics are stable and rest exponentially small in . Our analysis enlightens the role of mass conservation in the classification of the general mixed problem into two main categories where the solution has a profile close to Allen-Cahn, or, when the mass is conserved, close to the Cahn-Hilliard solution.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Existence and regularity of solution for a stochastic Cahn–Hilliard/Allen–Cahn equation with unbounded noise diffusion",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039615005410",
            "Abstract": "The Cahn–Hilliard/Allen–Cahn equation with noise is a simplified mean field model of stochastic microscopic dynamics associated with adsorption and desorption-spin flip mechanisms in the context of surface processes. For such an equation we consider a multiplicative space-time white noise with diffusion coefficient of linear growth. Applying techniques from semigroup theory, we prove local existence and uniqueness in dimensions d= 1, 2, 3. Moreover, when the diffusion coefficient satisfies a sub-linear growth condition of order α bounded by 1 3, which is the inverse of the polynomial order of the nonlinearity used, we prove for d= 1 global existence of solution. Path regularity of stochastic solution, depending on that of the initial condition, is obtained as up to the explosion time. The path regularity is identical to that proved for the stochastic Cahn–Hilliard equation in the case of bounded noise diffusion …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The ground state of a Gross–Pitaevskii energy with general potential in the Thomas–Fermi limit",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s00205-015-0844-3",
            "Abstract": "We study the ground state which minimizes a Gross–Pitaevskii energy with general non-radial trapping potential, under the unit mass constraint, in the Thomas–Fermi limit where a small parameter  tends to 0. This ground state plays an important role in the mathematical treatment of recent experiments on the phenomenon of Bose–Einstein condensation, and in the study of various types of solutions of nonhomogeneous defocusing nonlinear Schrödinger equations. Many of these applications require delicate estimates for the behavior of the ground state near the boundary of the condensate, as , in the vicinity of which the ground state has irregular behavior in the form of a steep corner layer. In particular, the role of this layer is important in order to detect the presence of vortices in the small density region of the condensate, to understand the superfluid flow around an obstacle, and it also has a leading order …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Front Motion in the One-Dimensional Stochastic Cahn--Hilliard Equation",
            "Publication year": 2012,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/120861941",
            "Abstract": "In this paper, we consider the one-dimensional Cahn--Hilliard equation perturbed by additive noise and study the dynamics of interfaces for the stochastic model. The noise is smooth in space and defined as a Fourier series with independent Brownian motions in time. Motivated by the work of Bates and Xun on slow manifolds for the integrated Cahn--Hilliard equation, our analysis reveals the significant difficulties and differences in comparison to the deterministic problem. New higher order terms that we estimate appear due to Itô calculus and stochastic integration and dominate the exponentially slow deterministic dynamics. Using a local coordinate system and defining the admissible interface positions as a multidimensional diffusion process, we derive a first order linear system of stochastic ordinary differential equations approximating the equations of front motion. Furthermore, we prove stochastic stability of …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "A Hilbert expansion method for the rigorous sharp interface limit of the generalized Cahn–Hilliard equation",
            "Publication year": 2014,
            "Publication url": "https://ems.press/journals/ifb/articles/12558",
            "Abstract": "We consider Cahn–Hilliard equations with external forcing terms. Energy decreasing and mass conservation might not hold. We show that level surfaces of the solutions of such generalized Cahn–Hilliard equations tend to the solutions of a moving boundary problem under the assumption that classical solution of the latter exists. Our strategy is to construct approximate solutions of the generalized Cahn–Hilliard equation by the Hilbert expansion method used in kinetic theory and proposed for the standard Cahn–Hilliard equation, by Carlen, Carvalho and Orlandi,[14]. The constructed approximate solutions allow to derive rigorously the sharp interface limit of the generalized Cahn–Hilliard equations and higher order corrections to the limiting motion. We then estimate the difference between the true solutions and the approximate solutions by spectral analysis, as in [1].",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Malliavin calculus for the stochastic Cahn–Hilliard/Allen–Cahn equation with unbounded noise diffusion",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039618302699",
            "Abstract": "The stochastic partial differential equation analyzed in this work, is motivated by a simplified mesoscopic physical model for phase separation. It describes pattern formation due to adsorption and desorption mechanisms involved in surface processes, in the presence of a stochastic driving force. This equation is a combination of Cahn–Hilliard and Allen–Cahn type operators with a multiplicative, white, space–time noise of unbounded diffusion. We apply Malliavin calculus, in order to investigate the existence of a density for the stochastic solution u. In dimension one, according to the regularity result in [5], u admits continuous paths a.s. Using this property, and inspired by a method proposed in [8], we construct a modified approximating sequence for u, which properly treats the new second order Allen–Cahn operator. Under a localization argument, we prove that the Malliavin derivative of u exists locally, and that the …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "On the parabolic Stefan problem for Ostwald ripening with kinetic undercooling and inhomogeneous driving force",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S002203961200040X",
            "Abstract": "Ostwald ripening is the coarsening phenomenon caused by the diffusion and solidification process which occurs in the last stage of a first-order phase transformation. The force that drives the system towards equilibrium is the gradient of the chemical potential that, according to the Gibbs–Thomson condition, on the interface, is proportional to its mean curvature. A quantitative description of Ostwald ripening has been developed by the Lifschitz–Slyozov–Wagner (LSW) theory. We extend the work of Niethammer (2000) [15] which deals with kinetic undercooling in the quasi-static case to the parabolic setting with temporally inhomogeneous driving forces on the solid–liquid interfaces. By means of a priori estimates, local and global existence results for the parabolic Stefan problem, we derive a first order approximation for the dynamical equations for the heat distribution and particle radii and then prove the …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Pulsating wave for mean curvature flow in inhomogeneous medium",
            "Publication year": 2008,
            "Publication url": "https://www.cambridge.org/core/journals/european-journal-of-applied-mathematics/article/pulsating-wave-for-mean-curvature-flow-in-inhomogeneous-medium/EEEEF08C46AD8C1E928E6D8C6352C031",
            "Abstract": "We prove the existence and uniqueness of pulsating waves for the motion by mean curvature of an n-dimensional hypersurface in an inhomogeneous medium, represented by a periodic forcing. The main difficulty is caused by the degeneracy of the equation and the fact the forcing is allowed to change sign. Under the assumption of weak inhomogeneity, we obtain uniform oscillation and gradient bounds so that the evolving surface can be written as a graph over a reference hyperplane. The existence of an effective speed of propagation is established for any normal direction. We further prove the Lipschitz continuity of the speed with respect to the normal and various stability properties of the pulsating wave. The results are related to the homogenisation of mean curvature flow with forcing.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Front motion in the one-dimensional stochastic Cahn-Hilliard equation",
            "Publication year": 2011,
            "Publication url": "https://opus.bibliothek.uni-augsburg.de/opus4/frontdoor/index/index/docId/1498",
            "Abstract": "In this paper, we consider the one-dimensional Cahn-Hilliard equation perturbed by additive noise and study the dynamics of interfaces for the new stochastic model. The noise is smooth in space and is defined as a Fourier series with independent Brownian motions in time. Motivated by the work of Bates & Xun on slow manifolds for the integrated Cahn-Hilliard equation, our analysis reveals the significant difficulties and differences in comparison with the deterministic problem. New higher order terms, that we estimate, appear due to Itô calculus and stochastic integration dominating the exponentially slow deterministic dynamics of the interfaces. We derive a first order linear system of stochastic ordinary differential equations approximating the equations of front motion. Furthermore, we prove stochastic stability for the approximate slow manifold of solutions on a very long time scale and evaluate the noise effect.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ostwald ripening in two dimensions—the rigorous derivation of the equations from the Mullins–Sekerka dynamics",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039604001998",
            "Abstract": "We consider a dilute mixture of a finite number of particles and we are interested in the coarsening of the spatial distribution in two space dimensions under Mullins–Sekerka dynamics. Under the appropriate scaling hypotheses we associate radii and centers to each particle and derive equations for the whole evolution.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "The Effect of the Geometry of the Particle Distribution in Ostwald Ripening.",
            "Publication year": 2003,
            "Publication url": "http://www.tem.uoc.gr/~gkarali/papers/paper1.pdf",
            "Abstract": "Based on [1], we derive equations for the radii and the centers that we relate to the Lifshitz-Slyozov-Wagner theory.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Stability of spheres under volume-preserving mean curvature flow",
            "Publication year": 2010,
            "Publication url": "https://www.intlpress.com/site/pub/pages/journals/items/dpde/content/vols/0007/0004/a003/",
            "Abstract": "We give a new, elementary proof of the theorem, due to J. Escher and G. Simonett, that for the initial conditions close to Eucleadian spheres the solutions of the volume-preserving mean curvature flow converge to Eucleadian spheres (which, in general, differ from the initial spheres). Our result is in the metric given by Sobolev norms. While the proof by J. Escher and G. Simonett uses extensively rather involved results from the infinite-dimensional invariant manifold theory and quasilinear parabolic differential equations, our main point is to use an orthogonal decomposition of the solutions near the manifold of Euclidean spheres and differential inequalities for the Lyapunov functionals. Apart from local well-posedness, which is proven along standard lines, our proof is completely self-contained.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:UeHWp8X0CEIC",
            "Publisher": "International Press of Boston"
        },
        {
            "Title": "Existence of solution for a generalized stochastic Cahn-Hilliard equation on convex domains",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/journals/displayArticlesnew.jsp?paperID=6157",
            "Abstract": "We consider a generalized Stochastic Cahn-Hilliard equation with multiplicative white noise posed on bounded convex domains in Rd, d= 1, 2, 3, with piece-wise smooth boundary, and introduce an additive time dependent white noise term in the chemical potential. Since the Green’s function of the problem is induced by a convolution semigroup, we present the equation in a weak stochastic integral formulation and prove existence of solution when d≤ 2 for general domains, and for d= 3 for domains with minimum eigenfunction growth, without making use of any explicit expression of the spectrum and the eigenfunctions. The analysis is based on stochastic integral calculus, Galerkin approximations and the asymptotic spectral properties of the Neumann Laplacian operator. Existence is also derived for some non-convex cases when the boundary is smooth.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:YsMSGLbcyi4C",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Crank-Nicolson finite element discretizations for a two-dimensional linear Schrödinger-type equation posed in a noncylindrical domain",
            "Publication year": 2015,
            "Publication url": "https://www.ams.org/mcom/0000-000-00/S0025-5718-2014-02900-1",
            "Abstract": "Motivated by the paraxial narrow-angle approximation of the Helmholtz equation in domains of variable topography, we consider an initial-and boundary-value problem for a general Schrödinger-type equation posed on a two space-dimensional noncylindrical domain with mixed boundary conditions. The problem is transformed into an equivalent one posed on a rectangular domain, and we approximate its solution by a Crank-Nicolson finite element method. For the proposed numerical method, we derive an optimal order error estimate in the  norm, and to support the error analysis we prove a global elliptic regularity theorem for complex elliptic boundary value problems with mixed boundary conditions. Results from numerical experiments are presented which verify the optimal order of convergence of the method.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Resonance phenomena in a singular perturbation problem in the case of exchange of stabilities",
            "Publication year": 2012,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03605302.2012.681333",
            "Abstract": "We consider the following singularly perturbed elliptic problem:                                                                              where Ω is a bounded domain in ℝ2 with smooth boundary, ϵ > 0 is a small parameter, n denotes the outward normal of ∂Ω, and a, b are smooth functions that do not depend on ϵ. We assume that the zero set of a − b is a simple closed curve Γ, contained in Ω, and ∇(a − b) ≠ 0 on Γ. We will construct solutions u ϵ that converge in the Hölder sense to max {a, b} in Ω, and their Morse index tends to infinity, as ϵ → 0, provided that ϵ stays away from certain critical numbers. Even in the case of stable solutions, whose existence is well established for all small ϵ > 0, our estimates improve previous results.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Nonlinear from linear states in two-component Bose–Einstein condensates",
            "Publication year": 2008,
            "Publication url": "https://iopscience.iop.org/article/10.1088/1751-8113/42/4/045206/meta",
            "Abstract": "In this work, we consider the extension of linear eigenmodes of the harmonic oscillator potential into nonlinear states, for the case of two-component Gross–Pitaevskii equations with a parabolic potential, motivated by the context of two interacting hyperfine states of 87 Rb in Bose–Einstein condensates. In particular, we establish that nonlinear continuations of various eigenmode combinations are possible and corroborate this analytical finding with numerical computations for the lowest few eigenmode combinations involving the ground state and the first two excited states. A multitude of nonlinear states can be constructed in this way, some of which spontaneously deform, as the interactions become stronger, into previously obtained nonlinear eigenstates. The Bogolyubov–de Gennes analysis of the excitations on top of such states illustrates that some of them may become unstable beyond a critical threshold (of the …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IOP Publishing"
        },
        {
            "Title": "Existence and asymptotics for a Cahn-Hilliard/Allen-Cahn parabolic equation (Problems in the calculus of variations and related topics)",
            "Publication year": 2009,
            "Publication url": "https://repository.kulib.kyoto-u.ac.jp/dspace/bitstream/2433/140340/1/1628-09.pdf",
            "Abstract": "We consider the existence and asymptotic behavior of solutions to a mean field partial differential equation ofCahn-Hilliard/Allen-Cahn type. This equation arises in the description of pattern formation mechanisms for a prototypical model of surface processes that involves multiple microscopic mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:kNdYIx-mwKoC",
            "Publisher": "京都大学数理解析研究所"
        },
        {
            "Title": "Phase boundaries motion preserving the volume of each connected component",
            "Publication year": 2006,
            "Publication url": "https://content.iospress.com/articles/asymptotic-analysis/asy765",
            "Abstract": "We consider a finite number of particles initially close to spherical but of varying size exhibiting the property of preserving the measure of each connected component. We show that under the assumptions (i) particle size/interparticle distance «1 and (ii) initial deviation from sphericity/particle size «1 the particles retain their almost spherical shape and the dynamics of the system is determined by the motion of the centers. This is in sharp contrast with the Mullins–Sekerka free boundary problem where the particle centers remain almost fixed and the dynamics of the system is determined by the evolution of the radii.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "The multi-dimensional Stochastic Stefan Financial Model for a portfolio of assets",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2012.13432",
            "Abstract": "The financial model proposed involves the liquidation process of a portfolio of  assets through sell or (and) buy orders with volatility. We present the rigorous mathematical formulation of this model in a financial setting resulting to an -dimensional outer parabolic Stefan problem with noise. In particular, our aim is to estimate for a short time period the areas of zero trading, and their diameter which approximates the minimum of the  spreads of the portfolio assets for orders from the  limit order books of each asset respectively. In dimensions , and for zero volatility, this problem stands as a mean field model for Ostwald ripening, and has been proposed and analyzed by Niethammer. Therein, when the initial moving boundary consists of well separated spheres, a first order approximation system of odes had been rigorously derived for the dynamics of the interfaces and the asymptotic profile of the solution. In our financial case, we propose a spherical moving boundaries approach where the zero trading area consists of a union of spherical domains centered at portfolios various prices, while each sphere may correspond to a different market; the relevant radii represent the half of the minimum spread. We apply It\\^o calculus and provide second order formal asymptotics for the stochastic version dynamics, written as a system of stochastic differential equations for the radii evolution in time. A second order approximation seems to disconnect the financial model from the large diffusion assumption for the trading density. Moreover, we solve the approximating systems numerically.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Radial and bifurcating non-radial solutions for a singular perturbation problem in the case of exchange of stabilities",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0294144911000874",
            "Abstract": "We consider the singular perturbation problem− ε 2 Δ u+(u− a (| x|))(u− b (| x|))= 0 in the unit ball of R N, N⩾ 1, under Neumann boundary conditions. The assumption that a (r)− b (r) changes sign in (0, 1), known as the case of exchange of stabilities, is the main source of difficulty. More precisely, under the assumption that a− b has one simple zero in (0, 1), we prove the existence of two radial solutions u+ and u− that converge uniformly to max {a, b}, as ε→ 0. The solution u+ is asymptotically stable, whereas u− has Morse index one, in the radial class. If N⩾ 2, we prove that the Morse index of u−, in the general class, is asymptotically given by [c+ o (1)] ε− 2 3 (N− 1) as ε→ 0, with c> 0 a certain positive constant. Furthermore, we prove the existence of a decreasing sequence of ε k> 0, with ε k→ 0 as k→+∞, such that non-radial solutions bifurcate from the unstable branch {(u−(ε), ε), ε> 0} at ε= ε k, k= 1, 2,…. Our approach …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:ufrVoPGSRksC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Motion of a Droplet for the Stochastic Mass-Conserving Allen--Cahn Equation",
            "Publication year": 2016,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/151005105",
            "Abstract": "We study the stochastic mass-conserving Allen--Cahn equation posed on a smoothly bounded domain of  with additive, spatially smooth, space-time noise. This equation  describes the stochastic motion of a small almost semicircular droplet attached to domain's boundary and moving toward a point of locally maximum curvature. We apply Itô calculus to derive the stochastic dynamics of the center of the droplet by utilizing the approximately invariant manifold introduced by Alikakos, Chen, and Fusco [Calc. Var., 11 (2000), pp. 233--305] for the deterministic problem. In the stochastic case depending on the scaling, the motion is driven by the change in the curvature of the boundary and the stochastic forcing. Moreover, under the assumption of a sufficiently small noise strength, we establish stochastic stability of a neighborhood of the manifold of boundary droplet states in the - and -norms, which means that …",
            "Abstract entirety": 0,
            "Author pub id": "Ae5ALHUAAAAJ:TQgYirikUcIC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Motion of a droplet for the mass-conserving stochastic Allen-Cahn equation",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1501.05288",
            "Abstract": "We study the stochastic mass-conserving Allen-Cahn equation posed on a bounded two-dimensional domain with additive spatially smooth space-time noise. This equation associated with a small positive parameter describes the stochastic motion of a small almost semicircular droplet attached to domain's boundary and moving towards a point of locally maximum curvature. We apply It\\^o calculus to derive the stochastic dynamics of the droplet by utilizing the approximately invariant manifold introduced by Alikakos, Chen and Fusco for the deterministic problem. In the stochastic case depending on the scaling, the motion is driven by the change in the curvature of the boundary and the stochastic forcing. Moreover, under the assumption of a sufficiently small noise strength, we establish stochastic stability of a neighborhood of the manifold of droplets in  and , which means that with overwhelming probability the solution stays close to the manifold for very long time-scales.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Asymptotics for a generalized Cahn-Hilliard equation with forcing terms",
            "Publication year": 2011,
            "Publication url": "https://www.aimsciences.org/journals/displayArticlesnew.jsp?paperID=6192",
            "Abstract": "Motivated by the physical theory of Critical Dynamics the Cahn-Hilliard equation on a bounded space domain is considered and forcing terms of general type are introduced. For such a rescaled equation the limiting interface problem is studied and the following are derived:(i) asymptotic results indicating that the forcing terms may slow down the equilibrium locally or globally,(ii) the sharp interface limit problem in the multidimensional case demonstrating a local influence in phase transitions of terms that stem from the chemical potential, while free energy independent terms act on the rest of the domain,(iii) a limiting non-homogeneous linear diffusion equation for the one-dimensional problem in the case of deterministic forcing term that follows the white noise scaling.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "On the convergence of a fourth order evolution equation to the Allen–Cahn equation",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X10000684",
            "Abstract": "We construct special sequences of solutions to a fourth order nonlinear parabolic equation of Cahn–Hilliard/Allen–Cahn type, converging to the second order Allen–Cahn equation. We consider the evolution equation without boundary, as well as the stationary case on domains with Dirichlet boundary conditions. The proofs exploit the equivalence of the fourth order equation with a system of two second order elliptic equations with “good signs”.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Gradient dynamics: Motion near a manifold of quasi-equilibria",
            "Publication year": 2018,
            "Publication url": "https://epubs.siam.org/doi/abs/10.1137/17M1144374",
            "Abstract": "In a general Banach space we consider gradient-like dynamical systems with the property that there is a manifold along which solutions move slowly compared to attraction in the transverse direction. Conditions are given on the energy (or Lyapunov functional) that ensure that solutions starting near the manifold stay near for a long time or even forever. The abstract results are then applied to a finite dimensional case and used to show the super slow motion of interfaces for the vector Allen--Cahn and Cahn--Morral systems.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:TFP_iSt0sucC",
            "Publisher": "Society for Industrial and Applied Mathematics"
        },
        {
            "Title": "Global-in-time behavior of the solution to a Gierer-Meinhardt system",
            "Publication year": 2013,
            "Publication url": "https://www.aimsciences.org/journals/displayArticles.jsp?paperID=8152",
            "Abstract": "Gierer-Meinhardt system is a mathematical model to describe biological pattern formation due to activator and inhibitor. Turing pattern is expected in the presence of local self-enhancement and long-range inhibition. The long-time behavior of the solution, however, has not yet been clarified mathematically. In this paper, we study the case when its ODE part takes periodic-in-time solutions, that is, τ= s+ 1 p− 1. Under some additional assumptions on parameters, we show that the solution exists global-in-time and absorbed into one of these ODE orbits. Thus spatial patterns eventually disappear if those parameters are in a region without local self-enhancement or long-range inhibition.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:aqlVkmm33-oC",
            "Publisher": "American Institute of Mathematical Sciences"
        },
        {
            "Title": "Motion of bubbles towards the boundary for the Cahn–Hilliard equation",
            "Publication year": 2004,
            "Publication url": "https://www.cambridge.org/core/journals/european-journal-of-applied-mathematics/article/motion-of-bubbles-towards-the-boundary-for-the-cahnhilliard-equation/6E27ABA9CD0DE38478BFBB54FC82EA10",
            "Abstract": "In this work we describe some aspects of the dynamics of the Cahn–Hilliard equation. In particular, we consider the dynamics of ‘bubble’ solutions that is spherical interfaces which move superslowly towards the boundary without changing their shape. We show for the Cahn–Hilliard that the bubble drifts towards the closest point on the boundary provided it is sufficiently small. This is contrasted with the related mass conserving Allen–Cahn equation where size is not an issue.",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:qjMakFHDy7sC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "The role of multiple microscopic mechanisms in cluster interface evolution (Variational problems and related topics)",
            "Publication year": 2008,
            "Publication url": "https://repository.kulib.kyoto-u.ac.jp/dspace/bitstream/2433/81613/1/1591-06.pdf",
            "Abstract": "In this paper we discuss mesoscopic models describing pattem formation mechanisms for a prototypical model of surface processes that involves multiple micro-scopic mechanisms. We focus on a mean field partial differential equation, which con-tains qualitatively microscopic information on particle-particle interactions and multiple particle dynamics, and we rigorously derive the macroscopic cluster evolution laws and transport structure. We show that the motion by mean curvature is given by , where  is the mean curvature,  is the surface tension and  is an effective mobility that depends on the presence of the multiple mechanisms and speeds up the cluster evolution. This is in contrast with the Allen-Cahn equation where .",
            "Abstract entirety": 1,
            "Author pub id": "Ae5ALHUAAAAJ:_FxGoFyzp5QC",
            "Publisher": "京都大学数理解析研究所"
        }
    ]
}]