[{
    "name": "Γεωργιος     Καμπουρακης ",
    "romanize name": "Georgios     Kampourakis ",
    "School-Department": "Μηχανικων  Πληροφοριακων Και Επικοινωνιακων Συστηματων",
    "University": "aegean",
    "Rank": "Καθηγητής",
    "Apella_id": 18554,
    "Scholar name": "Georgios Kambourakis",
    "Scholar id": "LJz0vqQaztcC",
    "Affiliation": "Professor, Dept. of Information and Communication Systems Eng., University of the Aegean",
    "Citedby": 5656,
    "Interests": [
        "Network Security"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=LJz0vqQaztcC&hl=en",
    "Publications": [
        {
            "Title": "A secure and efficient authentication protocol for passive RFID tags",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5285367/",
            "Abstract": "At the onset of the ubiquitous computing era, systems need to respond to a variety of challenges, in order to capitalize on the benefits of pervasiveness. One of the pivotal enablers of pervasive computing is the RFID technology which can be successfully applied in numerous applications. However, the interaction of such applications with sensitive personal data renders the need for assuring confidentiality a sine qua non. The native limitations in computing resources, i.e., computational power, memory etc, that characterize nearly all classes of RFID tags make the development of custom-tailored RFID security protocols a troublesome yet challenging task. In this paper we propose a mutual authentication protocol for low cost RFID tags and readers. We also demonstrate that our scheme is more efficient in terms of resource utilization on the backend server, and under identical conditions, more secure when compared …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Modeling Multiple Modes of Operation with Alloy",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35264-5_11",
            "Abstract": "Specification (or modeling) languages can be very handy in describing certain aspects of a system and check properties of interest about it. Also, once a model is constructed, one is able to use the associated analyzer to create examples and/or counterexamples to explore hypotheses posed about the system. In the context of cryptography this verification process is of great importance as it can contribute towards finding weaknesses and assessing system’s robustness. This paper capitalizes on the well-known Alloy language to model and analyze attacks on DES triple modes namely ECB∣ECB∣CBC− 1 and ECB∣OFB∣OFB. We model attacks described in [5] and show that they can be fruitful in the general case. This work can serve as a framework in modeling similar cryptosystems and assessing certain attacks on them.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:HoB7MX3m0LUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "On device authentication in wireless networks: present issues and future challenges",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74409-2_16",
            "Abstract": "Whilst device authentication must be considered as a cardinal security issue, complementary and of equal importance to user authentication, in today’s wireless networks, only a few papers address it patchily. This paper identifies and analyses possible major solutions towards solving the device authentication problem. We discuss key issues and future challenges that characterize each solution examining its pros and cons. We also offer a short qualitative comparative analysis for the device authentication schemes in question, examining its applicability for both infrastructure and ad-hoc deployments.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:mB3voiENLucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "High availability for SIP: Solutions and real-time measurement performance evaluation",
            "Publication year": 2010,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.606.7355&rep=rep1&type=pdf",
            "Abstract": "SIP is rapidly becoming a standard for service integration within a variety of wireless and wireline networks. In this regard high availability, reliability and redundancy are key factors for any SIP based infrastructure. In an adverse environment, especially the Internet and foreseeable 3GPP IMS, high availability solutions are of major importance for SIP network components to smoothly mitigate call increments, device failures, misconfigurations, physical disasters and throttle active attacks. This paper proposes a practical and transparent failover solution for SIP and RTP-Proxy servers. We demonstrate that both methods work properly and increase stability and availability of such systems. Furthermore, high availability solutions are enhanced through the employment of easy to implement load balancing schemes. All the proposed solutions are technically analyzed and evaluated via properly designed test-beds, showing fine performance in terms of service times.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Support of subscribers’ certificates in a hybrid WLAN-3G environment",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128605002653",
            "Abstract": "Third Generation Partnership Project (3GPP) has recently provided a cellular-WLAN interworking architecture as an add-on to 3GPP system specifications. This architecture can offer IP-based services, compatible with those obtainable by 3G packet switched domain, to a 3G subscriber who is connected via a WLAN. Following this approach, in this paper we propose extensions to current 3GPP specifications, implementing and experimenting with a hybrid WLAN-3G network architecture capable of supporting subscriber’s certificates. We focus on attribute certificates, which are of major importance for user authorization and, due to their temporary nature, entail minimum concern regarding revocation issues. We emphasise on the necessary public key infrastructure incorporation which requires minimum changes in 3G core network elements and signalling and provide a list of the potential threats, which can be …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:LkGwnXOMwfcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A fair solution to dns amplification attacks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4299371/",
            "Abstract": "Recent serious security incidents reported several attackers employing IP spoofing to massively exploit recursive name servers to amplify DDoS attacks against numerous networks. DNS amplification attack scenarios utilize DNS servers mainly for performing bandwidth consumption DoS attacks. This kind of attack takes advantage of the fact that DNS response messages may be substantially larger than DNS query messages. In this paper we present a novel, simple and practical scheme that enable administrators to distinguish between genuine and falsified DNS replies. The proposed scheme, acts proactively by monitoring in real time DNS traffic and alerting security supervisors when necessary. It also acts reactively in co-operation with the firewalls by automatically updating rules to ban bogus packets. Our analysis and the corresponding experimental results show that the proposed scheme offers an effective …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "From fuzziness to criminal investigation: An inference system for Mobile Forensics",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=12721591944588820728&hl=en&oi=scholarr",
            "Abstract": "118■ Intrusion Detection and Prevention for Mobile Ecosystems [1] was observed. Cases concerning attacks on mobile devices showed a 12% increase in comparison to the equivalent findings of 2014. Meanwhile, 32% of the attacks on corporate assets involved computers and mobile devices [2]. The aforementioned numbers correspond solely to incidents that unfolded online. If one takes into account the traditional crime scene investigation cases, which, among others, involve owners of mobile devices and their usage, then the rates grow even more.Investigators are not only responsible for managing an increased number of incidents but also for handling growing amounts of data, since contemporary mobile devices are used in data-intensive use cases. This combination of facts creates a new challenge in the field of MF in front of a new main challenge. How will the investigators’ work be facilitated in terms of …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:yB1At4FlUx8C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Optimal countermeasures selection against cyber attacks: A comprehensive survey on reaction frameworks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8169023/",
            "Abstract": "It is without doubt that today the volume and sophistication of cyber attacks keeps consistently growing, militating an endless arm race between attackers and defenders. In this context, full-fledged frameworks, methodologies, or strategies that are able to offer optimal or near-optimal reaction in terms of countermeasure selection, preferably in a fully or semiautomated way, are of high demand. This is reflected in the literature, which encompasses a significant number of major works on this topic spanning over a time period of 5 years, that is, from 2012 to 2016. The survey at hand has a dual aim, namely, first, to critically analyze all the pertinent works in this field, and second to offer an in-depth discussion and side-by-side comparison among them based on seven common criteria. Also, a quite extensive discussion is offered to highlight on the shortcomings and future research challenges and directions in this timely area.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing user privacy in adaptive web sites with client-side user profiles",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724868/",
            "Abstract": "Web personalization is an elegant and flexible process of making a web site responsive to the unique needs of each individual user. Data that reflects user preferences and likings, comprising therefore a user profile, are gathered to an adaptive web site in a non transparent manner. This situation however raises serious privacy concerns to the end user. When browsing aweb site, users are not aware of several important privacy parameters i.e., which behavior will be monitored and logged, how it will be processed, how long it will be kept, and with whom it will be shared in the long run. In this paper we propose an abstract architecture that enhances user privacy during interaction with adaptive web sites. This architecture enables users to create and update their personal privacy preferences for the adaptive web sites they visit by holding their (user) profiles in the client side instead of the server side. By doing so …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "WiF0: All Your Passphrase Are Belong to Us",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Efstratios-Chatzoglou/publication/352939119_WiF0_All_Your_Passphrase_Are_Belong_to_Us/links/60e4440892851ca944aef1d5/WiF0-All-Your-Passphrase-Are-Belong-to-Us.pdf",
            "Abstract": "No nontrivial software system can be built without regard for security. Even noncritical software systems can be used as an entry point to the critical systems to which they are connected, for example, exploiting system vulnerabilities to steal passwords for login and network access. This article describes one such attack.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:LI9QrySNdTsC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Security and privacy in wireless and mobile networks",
            "Publication year": 2018,
            "Publication url": "https://www.mdpi.com/1999-5903/10/2/18/htm",
            "Abstract": "Currently, at the dawn of 5G networks, and the era of the Internet-of-Things, wireless and mobile networking is becoming increasingly ubiquitous [...]",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:ye4kPcJQO24C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Security Education and Awareness for K-6 Going Mobile.",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/45428644/Security_Education_and_Awareness_for_K-6_Going_Mobile.pdf.pdf",
            "Abstract": "Nowadays, due to the widespread participation of elementary school children in cyberspace activities, basic cybersecurity education and awareness is deemed necessary. Within this context, knowledge acquisition in this timely and important field has greater chances to be more fruitful when the learner is properly motivated. Also, it is anticipated to be more joyful when knowledge is acquired in the form of a digital game-based activity. The paper at hand discusses the development of a novel mobile app called CyberAware, destined to cybersecurity education and awareness. At present, the game is designed for K-6 children in order to support either or both formal or informal learning. Additionally, due to its mobile characteristics, the game can be experienced as an outdoor or classroom activity. Finally, opposite to similar studies found in the literature so far, our attention is not solely drawn to game’s technological aspects but equally to the educational factor. This is achieved through the consideration and use of the ARCS motivational model already from the game’s design phase.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:D_sINldO8mEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "General Reliability and Security Framework for VoIP Infrastructures",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=14209180640468855486&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and implementation of a secure mobile wiki system",
            "Publication year": 2008,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.706.2729&rep=rep1&type=pdf",
            "Abstract": "During the last few years wikis have emerged as one of the most popular tool shells. Wikipedia has boosted their popularity, but they also keep a significant share in elearning, intranet-based applications such as defect tracking, requirements management, test-case management, and project portals. However, existing wiki systems cannot fully support mobile clients due to several incompatibilities that exist. On the top of that, an effective secure mobile wiki system must be lightweight enough to support low-end mobile devices having several limitations. In this paper we analyze the requirements for a novel multiplatform secure wiki implementation. XML Encryption and Signature specifications are employed to realize endto-end confidentiality and integrity services. Our scheme can be applied selectively and only to sensitive wiki content, thus diminishing by far computational resources needed at both ends; the server and the client. To address authentication of wiki clients a simple one-way authentication and session key agreement protocol is also introduced. The proposed solution can be easily applied to both centralized and forthcoming P2P wiki implementations.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance evaluation of public key-based authentication in future mobile communication systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1155/S1687147204403016",
            "Abstract": "While mobile hosts are evolving into full-IP enabled devices, there is a greater demand to provide a more flexible, reconfigurable, and scalable security mechanism in mobile communication systems beyond 3G (B3G). Work has already begun on such an \"all-IP\" end-to-end solution, commonly referred to as 4G systems. Fully fledged integration between heterogeneous networks, such as 2.5G, UMTS, WLAN, Bluetooth, and the Internet, demands fully compatible, time-tested, and reliable mechanisms to depend on. SSL protocol has proved its effectiveness in the wired Internet and it will probably be the most promising candidate for future wireless environments. In this paper, we discuss existing problems related to authentication and key agreement (AKA) procedures, such as compromised authentication vectors attacks, as they appear in current 2/2.5G/3G mobile communication systems, and propose how SSL …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:9yKSN-GCB0IC",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "A COMPETENT POST-AUTHENTICATION AND NON-REPUDIATION BIOMETRIC-BASED SCHEME FOR M-LEARNING",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Dimitrios-Damopoulos-2/publication/249644960_A_Competent_Post-Authentication_and_Non-Repudiation_Biometric-based_Scheme_for_M-Learning/links/0deec51e5c5161c886000000/A-Competent-Post-Authentication-and-Non-Repudiation-Biometric-based-Scheme-for-M-Learning.pdf",
            "Abstract": "As mobile learning (mLearning) gains momentum, so does the worry of the parties involved to mLearning activities regarding the security and privacy level of the underlying systems and practices. Indeed, the basically spontaneous nature of mLearning and the variety of out-of-control devices that are used for supporting its activities, makes it prone to a plethora of attacks such as masquerading and manin-the-middle. Thus, the provision of some sort of postauthentication and non-repudiation service in an effort to deter and repel ill-motivated activities may be of particular value in such realms. Compelled by this fact, in this paper, we introduce a dynamic signature-based biometric scheme to enable the offering of both of the aforementioned services in mLearning domains. We argue that our solution is both practical and lightweight. Its feasibility is also demonstrated through the use of machine learning techniques.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:3s1wT3WcHBgC",
            "Publisher": "ACTA"
        },
        {
            "Title": "DNS amplification attack revisited",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404813001405",
            "Abstract": "It is without doubt that the Domain Name System (DNS) is one of the most decisive elements of the Internet infrastructure; even a slight disruption to the normal operation of a DNS server could cause serious impairment to network services and thus hinder access to network resources. Hence, it is straightforward that DNS nameservers are constantly under the threat of Denial of Service (DoS) attacks. This paper presents a new, stealthy from the attacker's viewpoint, flavor of DNSSEC-powered amplification attack that takes advantage of the vast number of DNS forwarders out there. Specifically, for augmenting the amplification factor, the attacker utilizes only those forwarders that support DNSSEC-related resource records and advertize a large DNS size packet. The main benefits of the presented attack scenario as compared to that of the typical amplification attack are: (a) The revocation of the need of the aggressor …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:a0OBvERweLwC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "What Email Servers Can Tell to Johnny: An Empirical Study of Provider-to-Provider Email Security",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9139968/",
            "Abstract": "With hundred billions of emails sent daily, the adoption of contemporary email security standards and best practices by the respective providers are of utmost importance to everyone of us. Leaving out the user-dependent measures, say, S/MIME and PGP, this work concentrates on the current security standards adopted in practice by providers to safeguard the communications among their SMTP servers. To this end, we developed a non-intrusive tool coined MECSA, which is publicly available as a web application service to anyone who wishes to instantly assess the security status of their email provider regarding both the inbound and outbound communication channels. By capitalising on the data collected by MECSA over a period of 15 months, that is, ≈7,650 assessments, analysing a total of 3,236 unique email providers, we detail on the adoption rate of state-of-the-art email security extensions, including …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dissecting contact tracing apps in the Android platform",
            "Publication year": 2021,
            "Publication url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0251867",
            "Abstract": "Contact tracing has historically been used to retard the spread of infectious diseases, but if it is exercised by hand in large-scale, it is known to be a resource-intensive and quite deficient process. Nowadays, digital contact tracing has promptly emerged as an indispensable asset in the global fight against the coronavirus pandemic. The work at hand offers a meticulous study of all the official Android contact tracing apps deployed hitherto by European countries. Each app is closely scrutinized both statically and dynamically by means of dynamic instrumentation. Depending on the level of examination, static analysis results are grouped in two axes. The first encompasses permissions, API calls, and possible connections to external URLs, while the second concentrates on potential security weaknesses and vulnerabilities, including the use of trackers, in-depth manifest analysis, shared software analysis, and taint analysis. Dynamic analysis on the other hand collects data pertaining to Java classes and network traffic. The results demonstrate that while overall these apps are well-engineered, they are not free of weaknesses, vulnerabilities, and misconfigurations that may ultimately put the user security and privacy at risk.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:L7CI7m0gUJcC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "Screening out social bots interference: Are there any silver bullets?",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8808170/",
            "Abstract": "Social networks are a primary source of news and information that can be steered, distorted, and influenced. Recent scandals such as the one involving Cambridge Analytics proved that social media users are prone to such direct manipulation. Among the weapons available to perform these anti-democracy attacks, Social Bots are beyond question the most powerful one. These autonomous entities constitute coordinated armies that sneakily manipulate and deceive real users. Thus, our research identifies five major challenges that the research community needs to face toward tackling Social Bots activities in four individual but comparable scenarios. To address these key challenges, we propose, elaborate, and evaluate a mix of remedies in the form of a proof-of-concept platform combining the agility of artificial intelligence with the expertise of human analysts to detect and shield against Social Bots interference.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CyberAware: A mobile game-based app for cybersecurity education and awareness",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7359553.",
            "Abstract": "Nowadays, basic cybersecurity education and awareness is deemed necessary, even for children as young as elementary school-aged. If knowledge on this topic is delivered in the form of a digital game-based activity, then it has greater chances of being more joyful and efficient. The paper at hand discusses the development of a novel mobile app called Cyber-Aware, destined to cybersecurity education and awareness. At present, the game is designed for K-6 aged children and can be used to support either or both formal or informal learning. Also, due to its mobile nature, it can be experienced as an outdoor or classroom activity. Opposite to similar studies found in the literature so far, our attention is not solely drawn to game's technological aspects but equally to the educational factor.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Survey on Digital Certificates Approaches for the COVID-19 Pandemic",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9558786/",
            "Abstract": "Digital COVID-19 certificates serve as reliable proof that an individual was vaccinated, tested negative, or healed from COVID-19, facilitating health, occupational, educational, and travel activities during the pandemic. This paper contributes the first to our knowledge state-of-the-art and holistic review of this ecosystem, attempting to answer the following questions: 1) is there a harmonization among academia, organizations, and governments in terms of the certificate deployment technology?; 2) what is the proliferation of such schemes worldwide and how similar are they?; 3) are smartphone applications that accompany such schemes privacy-preserving from an end-user’s perspective? To respond to these questions, a four-tier approach is followed: (a) we scrutinize the so far academic works suggesting some type of digital certificate, highlighting common characteristics and weaknesses; (b) we constructively report …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:S16KYo8Pm5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The AWID datasets",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "TELS: A Voice-Response Internet-Based Learning System",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.464.487&rep=rep1&type=pdf",
            "Abstract": "During the last decade the academic world is continuously capitalizing on the use of Internet and web-based learning solutions, because of the simplicity and immediacy in creating, organizing and managing educational material and student data. However, the delivery of educational content to the end-user is characterized by visual presentation and the requirement of some sort of access either wired or wireless to the Internet, which blocks visually impaired individuals or people who don’t have access to the Internet in one way or another from accessing educational content. In this paper we describe the design and implementation of the Internet Telephony Learning System (TELS). Besides all other, TELS exploits mature Internet/web standards and the most popular communication mean in the world, the telephone, to provide audio interactivity between an otherwise traditional web application and the end-user. Unlike other similar applications, TELS does not need any special software or hardware to be accessed and since it is an open source traditional web application it can be custom-tailored to the individual needs of each institution. Since it is accessible to almost every communication device, we argue that it is useful for visually impaired, technologically uneducated, and underprivileged people for accessing information originally intended to be accessed visually via a Personal Computer.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:hMod-77fHWUC",
            "Publisher": "Taiwan Academic Network"
        },
        {
            "Title": "Swarm intelligence in intrusion detection: A survey",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S016740481100109X",
            "Abstract": "Intrusion Detection Systems (IDS) have nowadays become a necessary component of almost every security infrastructure. So far, many different approaches have been followed in order to increase the efficiency of IDS. Swarm Intelligence (SI), a relatively new bio-inspired family of methods, seeks inspiration in the behavior of swarms of insects or other animals. After applied in other fields with success SI started to gather the interest of researchers working in the field of intrusion detection. In this paper we explore the reasons that led to the application of SI in intrusion detection, and present SI methods that have been used for constructing IDS. A major contribution of this work is also a detailed comparison of several SI-based IDS in terms of efficiency. This gives a clear idea of which solution is more appropriate for each particular case.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:maZDTaKrznsC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "A first order logic security verification model for SIP",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5198603/",
            "Abstract": "It is well known that no security mechanism can provide full protection against a potential attack. There is always a possibility that a security incident may happen, mainly as a result of a new or modified attack that the employed countermeasures cannot handle or identify. It is therefore useful to perform a deferred analysis of logged network data, in an attempt to identify abnormal behavior/traffic that flags some type of security incident that has not been detected by the security countermeasures. Such an analysis of logged data for critical real time applications, like VoIP services, is certainly a valuable tool for enhancing the security level of the provided service. In this paper we introduce a practical tool that can be employed for the analysis of logged VoIP data and thus validate the effectiveness of the security mechanisms and the conformance with the corresponding security policy rules. For the analysis of the data we …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Android forensics: Correlation analysis",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7038797/",
            "Abstract": "With over 6 billion mobile phone subscribers, it is inevitable that such devices will be involved in criminal activities. Furthermore, the evolution of smartphones has changed the way people use their mobile phones in their everyday life. That is, a huge variety of services exist in the device that can be exploited for either perpetrating a criminal activity or being the subject of the crime. By conducting an analysis of existing forensic tools and the literature, it became evident that there is a significant lack of advanced tools that enable the correlation among the various events of forensic interest in order to facilitate an investigation and reduce the cognitive load on the analyst side. Motivated by this fact, the paper at hand proposes a novel tool that incorporates strong mechanisms to forensically analyze an Android device, aiming to reduce the workload of the investigator through advanced and intelligent correlation and …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:738O_yMBCRsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SIP Security Mechanisms: A state-of-the-art review",
            "Publication year": 2005,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=t9zOAwAAQBAJ&oi=fnd&pg=PA147&dq=info:LAXqdzr0EPsJ:scholar.google.com&ots=FdNlNEL0sg&sig=7IuJLRoLkRt_VFLQCEgAG_j5d_s",
            "Abstract": "The commercial deployment of VoIP necessitates the employment of security mechanisms that can assure availability, reliability, confidentiality and integrity. The Session Initiation Protocol (SIP) is considered as the dominant signalling protocol for calls over the Internet. SIP, like other Internet protocols, is vulnerable to known Internet attacks, while at the same time it introduces new security problems in the VoIP system. This paper lists the existing security problems in SIP and provides a brief description, followed by a critical analysis, of the security mechanisms it employs.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Security and privacy issues towards ENUM protocol",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1577144/",
            "Abstract": "Public ENUM is used until now in trials and some \"test-bed\" or \"production\" VoIP environments with small volume. Very lately, another application of the ENUM protocol has emerged namely the \"Carrier ENUM\", becoming popular among VoIP and mobile providers. In this context, a new competitive to public and carrier ENUM, peer-to-peer approach promotes itself, stating to be more reliable and secure, called DUNDi. Although considerable arguing has been generated among various ENUM forums and standardization fora on ENUM implementations, until now, several issues remain obscured and unresolved. In this paper we address security and privacy issues raised by all the aforementioned solutions, presenting implementation details, general concerns, future trends, and possible solutions",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mal-warehouse: A data collection-as-a-service of mobile malware behavioral patterns",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8560238/",
            "Abstract": "Smartphones are pervasively used in many everyday life extents, and have been both targets and victims of malware. While there are many anti-malware applications available in mobile markets, so far there are no public services that collect mobile usage data, so as to observe malware effects on mobile devices. The main contribution of this paper is the Mal-warehouse, an open-source tool performing data collectionas-a-service for Android malware behavioral patterns. During its initial development and experimentation phase, the tool extracts mobile device statistics, including CPU, memory and battery usage, process reports, and network statistics for 14 Android malware applications from a target device. It then stores them in a classified manner on a cloud database. Despite the fact that the work at hand is still in an early stage, the detection model is enhanced with a preliminary detection module. Machine …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:uc_IGeMz5qoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sharing pandemic vaccination certificates through blockchain: Case study and performance evaluation",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2101.04575",
            "Abstract": "This work proposes a scalable, blockchain-based platform for the secure sharing of COVID-19 or other disease vaccination certificates. As an indicative use case, we simulate a large-scale deployment by considering the countries of the European Union. The proposed platform is evaluated through extensive simulations in terms of computing resource usage, network response time and bandwidth. Based on the results, the proposed scheme shows satisfactory performance across all major evaluation criteria, suggesting that it can set the pace for real implementations. Vis-\\`a-vis the related work, the proposed platform is novel, especially through the prism of a large-scale, full-fledged implementation and its assessment.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:g3aElNc5_aQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Realtime ddos detection in sip ecosystems: Machine learning tools of the trade",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-46298-1_9",
            "Abstract": "Over the last decade, VoIP services and more especially the SIP-based ones, have gained much attention due to the low-cost and simple models they offer. Nevertheless, their inherently insecure design make them prone to a plethora of attacks. This work concentrates on the detection of resource consumption attacks targeting SIP ecosystems. While this topic has been addressed in the literature to a great extent, only a handful of works examine the potential of Machine Learning (ML) techniques to detect DoS and even fewer do so in realtime. Spurred by this fact, the work at hand assesses the potential of 5 different ML-driven methods in nipping SIP-powered DDoS attacks in the bud. Our experiments involving 17 realistically simulated (D)DoS scenarios of varied attack volume in terms of calls/sec and user population, suggest that some of the classifiers show promising detection accuracy even in low-rate …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:wbdj-CoPYUoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Design and implementation of a VoiceXML-driven wiki application for assistive environments on the web",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s00779-009-0274-z",
            "Abstract": "In this paper, we describe the design and implementation of an audio wiki application accessible via both the Public Switched Telephone Network and the Internet. The application exploits mature World Wide Web Consortium standards, such as VoiceXML, Speech Synthesis Markup Language, and Speech Recognition Grammar Specification toward achieving our goals. The purpose of such an application is to assist visually impaired, technologically uneducated, and underprivileged people in accessing information originally intended to be accessed visually via a personal computer (PC). Users may access wiki content via fixed or mobile phones, or via a PC using a Web Browser or a Voice over IP service. This feature promotes pervasiveness to collaboratively created content to an extremely large population, i.e., those who simply own a telephone line.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:Se3iqnhoufwC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Securing medical sensor environments: the codeblue framework case",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4159858/",
            "Abstract": "Research on wireless sensor networks targeting to medical environments has gathered a great attention. In this context, the most recent and perhaps the most promising complete scheme is the CodeBlue hardware and software combined platform, developed in the context of the self-titled Harvard's University project. CodeBlue relies on miniature wearable sensors to monitor real-time patients' vital activities and collecting data for further processing. Apart from the essential query interface for medical monitoring, CodeBlue offers protocols for hardware discovery and multihop routing. This paper contributes to the CodeBlue security, which until now is considered as pending or left out for future work by its designers. We identify and describe several security issues and attack incidents that can be directly applied on CodeBlue compromising its trustworthiness. We also discuss possible solutions for both internal and …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "TermID: a distributed swarm intelligence-based approach for wireless intrusion detection",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/article/10.1007/s10207-016-0335-z",
            "Abstract": "With the mushrooming of wireless access infrastructures, the amount of data generated, transferred and consumed by the users of such networks has taken enormous proportions. This fact further complicates the task of network intrusion detection, especially when advanced machine learning (ML) operations are involved in the process. In wireless environments, the monitored data are naturally distributed among the numerous sensor nodes of the system. Therefore, the analysis of data must either happen in a central location after first collecting it from the sensors or locally through collaboration by viewing the problem through a distributed ML perspective. In both cases, concerns are risen regarding the requirements of this demanding task in matters of required network resources and achieved security/privacy. This paper proposes TermID, a distributed network intrusion detection system that is well suited for …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:1qzjygNMrQYC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "On RSN-oriented wireless intrusion detection",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-76843-2_34",
            "Abstract": "Robust Security Network (RSN) epitomised by IEEE 802.11i substandard is promising what it stands for; robust and effective protection for mission critical Wireless Local Area Networks (WLAN). However, despite the fact that 802.11i overhauls the IEEE’s 802.11 security standard several weaknesses still remain. In this context, the complementary assistance of Wireless Intrusion Detection Systems (WIDS) to deal with existing and new threats is greatly appreciated. In this paper we focus on 802.11i intrusion detection, discuss what is missing, what the possibilities are, and experimentally explore ways to make them intertwine and co-work. Our experiments employing well known open source attack tools and custom made software reveal that most 802.11i specific attacks can be effectively recognised, either directly or indirectly. We also consider and discuss Distributed Wireless Intrusion Detection (DIDS …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Clustering oriented architectures in medical sensor environments",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4529443/",
            "Abstract": "Wireless sensor networks are expected to make a significant contribution in the healthcare sector by enabling continuous patient monitoring. Since medical services and the associated to them information are considered particularly sensitive, the employment of wireless sensors in medical environments poses many security issues and challenges. However, security services and the underlying key management mechanisms cannot be seen separately from the efficiency and scalability requirements. Network clustering used in both routing and group key management mechanisms can improve the efficiency and scalability and therefore can also be envisioned in medical environments. This paper introduces a general framework for cluster-based wireless sensor medical environments on the top of which efficient security mechanisms can rely. We describe two different scenarios for infrastructure and infrastructure …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cluster-based framework for the security of medical sensor environments",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-03748-1_6",
            "Abstract": "The adoption of Wireless Sensor Networks (WSNs) in the healthcare sector poses many security issues, mainly because medical information is considered particularly sensitive. The security mechanisms employed are expected to be more efficient in terms of energy consumption and scalability in order to cope with the constrained capabilities of WSNs and patients’ mobility. Towards this goal, cluster-based medical WSNs can substantially improve efficiency and scalability. In this context, we have proposed a general framework for cluster-based medical environments on top of which security mechanisms can rely. This framework fully covers the varying needs of both in-hospital environments and environments formed ad hoc for medical emergencies. In this paper, we further elaborate on the security of our proposed solution. We specifically focus on key establishment mechanisms and investigate the group …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Intrusion Detection and Prevention for Mobile Ecosystems",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=dEQPEAAAQBAJ&oi=fnd&pg=PP1&dq=info:XoGAgABhxmkJ:scholar.google.com&ots=-NKBW60pys&sig=AgGoFg44lJPCNf-2hchp19tI8N8",
            "Abstract": "This book presents state-of-the-art contributions from both scientists and practitioners working in intrusion detection and prevention for mobile networks, services, and devices. It covers fundamental theory, techniques, applications, as well as practical experiences concerning intrusion detection and prevention for the mobile ecosystem. It also includes surveys, simulations, practical results and case studies.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:_B80troHkn4C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Demystifying COVID-19 digital contact tracing: A survey on frameworks and mobile apps",
            "Publication year": 2020,
            "Publication url": "https://www.hindawi.com/journals/wcmc/2020/8851429/",
            "Abstract": "The coronavirus pandemic is a new reality, and it severely affects the modus vivendi of the international community. In this context, governments are rushing to devise or embrace novel surveillance mechanisms and monitoring systems to fight the outbreak. The development of digital tracing apps, which among others are aimed at automatising and globalising the prompt alerting of individuals at risk in a privacy-preserving manner, is a prominent example of this ongoing effort. Very promptly, a number of digital contact tracing architectures have been sprouted, followed by relevant app implementations adopted by governments worldwide. Bluetooth, specifically its Low Energy (BLE) power-conserving variant, has emerged as the most promising short-range wireless network technology to implement the contact tracing service. This work offers the first to our knowledge full-fledged review of the most concrete contact tracing architectures proposed so far in a global scale. This endeavour does not only embrace the diverse types of architectures and systems, namely, centralised, decentralised, or hybrid, but also equally addresses the client side, i.e., the apps that have been already deployed in Europe by each country. There is also a full-spectrum adversary model section, which does not only amalgamate the previous work in the topic but also brings new insights and angles to contemplate upon.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:EYYDruWGBe4C",
            "Publisher": "Hindawi"
        },
        {
            "Title": "From keyloggers to touchloggers: Take the rough with the smooth",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404812001654",
            "Abstract": "The proliferation of touchscreen devices brings along several interesting research challenges. One of them is whether touchstroke-based analysis (similar to keylogging) can be a reliable means of profiling the user of a mobile device. Of course, in such a setting, the coin has two sides. First, one can employ the output produced by such a system to feed machine learning classifiers and later on intrusion detection engines. Second, aggressors can install touchloggers to harvest user's private data. This malicious option has been also extensively exploited in the past by legacy keyloggers under various settings, but has been scarcely assessed for soft keyboards. Compelled by these separate but interdependent aspects, we implement the first-known native and fully operational touchlogger for ultramodern smartphones and especially for those employing the proprietary iOS platform. The results we obtained for the first …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:SeFeTyx0c_EC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "The best of both worlds: a framework for the synergistic operation of host and cloud anomaly-based IDS for smartphones",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2592791.2592797",
            "Abstract": "Smartphone ownership and usage has seen massive growth in the past years. As a result, their users have attracted unwanted attention from malicious entities and face many security challenges, including malware and privacy issues. This paper concentrates on IDS carefully designed to cater to the security needs of modern mobile platforms. Two main research issues are tackled:(a) the definition of an architecture which can be used towards implementing and deploying such a system in a dual-mode (host/cloud) manner and irrespectively of the underlying platform, and (b) the evaluation of a proof-of-concept anomaly-based IDS implementation that incorporates dissimilar detection features, with the aim to assess its performance qualities when running on state-of-the-art mobile hardware on the host device and on the cloud. This approach allows us to argue in favor of a hybrid host/cloud IDS arrangement (as it …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hands-Free one-Time and continuous authentication using glass wearable devices",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2214212618305714",
            "Abstract": "This paper investigates whether glass wearable devices can be used to authenticate end-users, both to grant access (one-time) and to maintain access (continuous), in a hands-free way. We do so by designing and implementing Gauth, a system that enables users to authenticate with a service simply by issuing a voice command, while facing the computer terminal they are going to use to access the service. To achieve this goal, we create a physical communication channel from the terminal to the glass device using machine readable visual codes, say, QR codes, and utilize the device’s network adapter to communicate directly with a service. More importantly, we continuously authenticate the user accessing the terminal, exploiting the fact that a user operating a terminal is most likely facing it most of the time. We periodically issue authentication challenges, which are displayed as a QR code on the terminal. This …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:URolC5Kub84C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A Privacy-Preserving Entropy-Driven Framework for Tracing DoS Attacks in VoIP",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6657244/",
            "Abstract": "Network audit trails, especially those composed of application layer data, can be a valuable source of information regarding the investigation of attack incidents. Nevertheless, the analysis of log files of large volume is usually both complex (slow) and privacy-neglecting. Especially, when it comes to VoIP, the literature on how audit trails can be exploited to identify attacks remains scarce. This paper provides an entropy-driven, privacy preserving, and practical framework for detecting resource consumption attacks in VoIP ecosystems. We extensively evaluate our framework under various attack scenarios involving single and multiple assailants. The results obtained show that the proposed scheme is capable of identifying malicious traffic with a false positive alarm rate up to 3.5%.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient and easily deployable method for dealing with DoS in SIP services",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036641400348X",
            "Abstract": "Voice over IP (VoIP) architecture and services consist of different software and hardware components that may be susceptible to a plethora of attacks. Among them, Denial of Service (DoS) is perhaps the most powerful one, as it aims to drain the underlying resources of a service and make it inaccessible to the legitimate users. So far, various detection and prevention schemes have been deployed to detect, deter and eliminate DoS occurrences. However, none of them seems to be complete in assessing in both realtime and offline modes if a system remains free of such types of attacks. To this end, in the context of this paper, we assert that audit trails in VoIP can be a rich source of information toward flushing out DoS incidents and evaluating the security level of a given system. Specifically, we introduce a privacy-friendly service to assess whether or not a SIP service provider suffers a DoS by examining either the …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:p2g8aNsByqUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Performance evaluation of certificate based authentication in integrated emerging 3G and Wi-Fi networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25980-0_23",
            "Abstract": "Certificate based authentication of parties provides a powerful means for verifying claimed identities, avoiding the necessity of distributing shared secrets beforehand. Whereas Wi-Fi networks present security deficiencies, they manage to highly penetrate into the wireless market in a great degree due to their low cost, easy administration, great capacity, IP-oriented nature, etc. Considering Wi-Fi networking settings, administrated by different operators, as parts of a common core 3G infrastructure, the paper proposes and evaluates the potential application of enhanced TLS-based authentication mechanisms in integrated emerging-3G and Wi-Fi networks. We propose to use EAP-TLS protocol seconded by Public Key Infrastructure entities, to provide users with robust authentication mechanisms in hybrid WLAN-3G heterogeneous environment. Our alternative solution is discussed against EAP-AKA procedures …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:KlAtU1dfN6UC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "DoS attacks exploiting signaling in UMTS and IMS",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036641000085X",
            "Abstract": "The Universal Mobile Telecommunication Standard (UMTS) is continuously evolving to meet the growing demand of modern mobile and Internet applications for high capacity and advanced features in security and quality of service. Although admittedly enhanced in terms of security when compared to 2G systems, UMTS still has weaknesses that can lead to security incidents. In this paper, we investigate the vulnerabilities of the UMTS security architecture that can be exploited by a malicious individual to mount Denial of Service (DoS) attacks. Our focus is on signaling-oriented attacks above the physical layer. We describe and analyze several novel attacks that can be triggered against both core UMTS architecture as well as hybrid UMTS/WLAN realms. An additional contribution of this paper is the presentation of an extensive survey of similar attacks in UMTS and related protocol infrastructures such as IP …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:e5wmG9Sq2KIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Privacy protection in context transfer protocol",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4457174/",
            "Abstract": "In the future 4G wireless networks will span across different administrative domains. In order to provide secure seamless handovers in such an environment the context transfer protocol is an attractive solution. However, the aforementioned protocol arises some privacy issues concerning the location and movement of users roaming between administrative domains. The purpose of this paper is to present and analyze these privacy issues and propose two privacy enhanced context transfer schemes that alleviate these problems. In the first scheme the Mobile Node (MN) is responsible for the transmission of the context to the new domain. In the second scheme the Home Domain (HD) of the user forwards the context acting as a proxy between the old and the new domain. While the second scheme is expected to be more useful towards realizing seamless handovers, the first one poses less signaling load to the HD. In …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Correction: Dissecting contact tracing apps in the Android platform",
            "Publication year": 2021,
            "Publication url": "https://journals.plos.org/plosone/article/file?id=10.1371/journal.pone.0258074&type=printable",
            "Abstract": "1. Kouliaridis V, Kambourakis G, Chatzoglou E, Geneiatakis D, Wang H (2021) Dissecting contact tracing apps in the Android platform. PLoS ONE 16 (5): e0251867. https://doi. org/10.1371/journal. pone. 0251867 pmid: 33989350",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:e_rmSamDkqQC",
            "Publisher": "Public Library of Science"
        },
        {
            "Title": "A survey on cluster-based group key agreement protocols for WSNs",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5522466/",
            "Abstract": "The scope of this survey is to examine and thoroughly evaluate the cluster-based Group Key Agreement (GKA) protocols for Wireless Sensor Networks (WSNs). Towards this goal, we have grouped the WSNs application environments into two major categories (i.e., infrastructure-based and infrastructureless) and have examined: a) which of the cluster-based Group Key Agreement (GKA) protocols that appear in the literature are applicable to each category, and b) to which degree these protocols will impact the systems' performance and energy consumption. In order to answer these questions we have calculated the complexity of each protocol and the energy cost it will add to the system. The evaluation of all discussed protocols is presented in a generalized way and can therefore serve as a reference point for future evaluations and for the design of new, improved GKA protocols.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:ZeXyd9-uunAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Complete SIP message obfuscation: PrivaSIP over Tor",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6980285/",
            "Abstract": "Anonymity on SIP signaling can be achieved either by the construction of a lower level tunnel (via the use of SSL or IPSec protocols) or by employing a custom-tailored solution. Unfortunately, the former category of solutions present significant impediments including the requirement for a PKI and the hop-by-hop fashioned protection, while the latter only concentrate on the application layer, thus neglecting sensitive information leaking from lower layers. To remediate this problem, in the context of this paper, we employ the well-known Tor anonymity system to achieve complete SIP traffic obfuscation from an attacker's standpoint. Specifically, we capitalize on Tor for preserving anonymity on network links that are considered mostly untrusted, i.e., those among SIP proxies and the one between the last proxy in the chain and the callee. We also, combine this Tor-powered solution with PrivaSIP to achieve an even greater …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for detecting malformed messages in SIP networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541543/",
            "Abstract": "Internet telephony like any other Internet service suffers from security flaws caused by various implementation errors (e.g. in end-users terminals, protocols, operating systems, hardware, etc). These implementation problems usually lead VoIP subsystems (e.g. SIP servers) to various unstable operations whenever trying to process a message not conforming to the underlying standards. As Internet telephony becomes more and more popular, attackers will attempt to exhaustively \"test\" implementations' robustness, transmitting various types of malformed messages to them. Since it is almost infeasible to avoid or predict every potential error caused during the developing process of these subsystems, it is necessary to specify an appropriate and robust, from the security point of view, framework that will facilitate the successful detection and handling of any kind of malformed messages aiming to destruct the provided …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Comprehensive Survey on Machine Learning Techniques for Android Malware Detection",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2078-2489/12/5/185",
            "Abstract": "Year after year, mobile malware attacks grow in both sophistication and diffusion. As the open source Android platform continues to dominate the market, malware writers consider it as their preferred target. Almost strictly, state-of-the-art mobile malware detection solutions in the literature capitalize on machine learning to detect pieces of malware. Nevertheless, our findings clearly indicate that the majority of existing works utilize different metrics and models and employ diverse datasets and classification features stemming from disparate analysis techniques, ie, static, dynamic, or hybrid. This complicates the cross-comparison of the various proposed detection schemes and may also raise doubts about the derived results. To address this problem, spanning a period of the last seven years, this work attempts to schematize the so far ML-powered malware detection approaches and techniques by organizing them under four axes, namely, the age of the selected dataset, the analysis type used, the employed ML techniques, and the chosen performance metrics. Moreover, based on these axes, we introduce a converging scheme which can guide future Android malware detection techniques and provide a solid baseline to machine learning practices in this field. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:MLfJN-KU85MC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "A PKI approach for deploying modern secure distributed e-learning and m-learning environments",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0360131504001745",
            "Abstract": "While public key cryptography is continuously evolving and its installed base is growing significantly, recent research works examine its potential use in e-learning or m-learning environments. Public key infrastructure (PKI) and attribute certificates (ACs) can provide the appropriate framework to effectively support authentication and authorization services, offering mutual trust to both learners and service providers. Considering PKI requirements for online distance learning networks, this paper discusses the potential application of ACs in a proposed trust model. Typical e-learning trust interactions between e-learners and providers are presented, demonstrating that robust security mechanisms and effective trust control can be obtained and implemented. The application of ACs to support m-learning is also presented and evaluated through an experimental test-bed setup, using the general packet radio service …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:Tyk-4Ss8FVUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Feature importance in Android malware detection",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9343013/",
            "Abstract": "The topic of mobile malware detection on the Android platform has attracted significant attention over the last several years. However, while much research has been conducted toward mobile malware detection techniques, little attention has been devoted to feature selection and feature importance. That is, which app feature matters more when it comes to machine learning classification. After succinctly surveying all major, dated from 2012 to 2020, datasets used by state-of-the-art malware detection works in the literature, we analyse a critical mass of apps from the most contemporary and prevailing datasets, namely Drebin, VirusShare, and AndroZoo. Next, we rank the importance of app classification features pertaining to permissions and intents using the Information Gain algorithm for all the three above-mentioned datasets.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:KUbvn5osdkgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Device authentication in wireless and pervasive environments",
            "Publication year": 2010,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/10798587.2010.10643089",
            "Abstract": "Security can only be guaranteed as long as the hardwaze and other key parameters, including software components, secret keys etc, of a device remain genuine and unrnodified. Under this context, device authentication must be considered as a key security issue, complementary and of equal importance to user authentication, in today’s wireless and forthcoming ubiquitous realms. This paper classifies and analyses possible major solutions proposed until now towazds solving the device authentication issue. We constructively argue on each solution presented examining its advantages and disadvantages. A qualitative comparative analysis for the device authentication schemes in question is also offered, probing its applicability for both infrastructure and ad-hoc deployments. Inter-domain device authentication, where applicable, and users’ privacy as aside-effect are investigated as well.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:M05iB0D1s5AC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Towards a Secure and Reliable VoIP",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=6456404414783939136&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:ns9cj8rnVeAC",
            "Publisher": "Deliverable"
        },
        {
            "Title": "Two privacy enhanced context transfer schemes",
            "Publication year": 2007,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1298239.1298272",
            "Abstract": "Foreseeable 4G environments will extensively take advantage of the concept of context transfer to provide seamless secure handovers between different administrative domains. However, the utilization of context transfer comes with a cost in the users' privacy. The purpose of this paper is to elaborate on these privacy issues and propose two privacy enhanced context transfer schemes that alleviate these problems. In the first scheme the Mobile Node (MN) is responsible for the transmission of the context to the new domain. In the second scheme the Home Domain (HD) of the user forwards the context acting as a proxy between the old and the new domain. In addition, assuming that the most appropriate form of user identity for the context is the Network Access Identifier (NAI), we show how the employment of temporary NAIs can further increase the privacy of our schemes.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Why Snoopy Loves Online Services: An Analysis of (Lack of) Privacy in Online Services.",
            "Publication year": 2017,
            "Publication url": "https://www.scitepress.org/papers/2017/62072/62072.pdf",
            "Abstract": "Over the last decade online services have penetrated the market and for many of us became an integral part of our software portfolio. On the one hand online services offer flexibility in every sector of the social web, but on the other hand these pros do not come without a cost in terms of privacy. This work focuses on online services, and in particular on the possible inherent design errors which make these services an easy target for privacy invaders. We demonstrate the previous fact using a handful of real-world cases pertaining to popular online web services. More specifically, we show that despite the progress made in raising security/privacy awareness amongst all the stakeholders (developers, admins, users) and the existence of mature security/privacy standards and practices, there still exist a plethora of poor implementations that may put user’s privacy at risk. We particularly concentrate on cases where a breach can happen even if the aggressor has limited knowledge about their target and/or the attack can be completed with limited resources. In this context, the main contribution of the paper at hand revolves around the demonstration of effortlessly exploiting privacy leaks existing in widely-known online services due to software development errors.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:eMMeJKvmdy0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A survey on mobile malware detection techniques",
            "Publication year": 2020,
            "Publication url": "https://www.jstage.jst.go.jp/article/transinf/E103.D/2/E103.D_2019INI0003/_article/-char/ja/",
            "Abstract": "Modern mobile devices are equipped with a variety of tools and services, and handle increasing amounts of sensitive information. In the same trend, the number of vulnerabilities exploiting mobile devices are also augmented on a daily basis and, undoubtedly, popular mobile platforms, such as Android and iOS, represent an alluring target for malware writers. While researchers strive to find alternative detection approaches to fight against mobile malware, recent reports exhibit an alarming increase in mobile malware exploiting victims to create revenues, climbing towards a billion-dollar industry. Current approaches to mobile malware analysis and detection cannot always keep up with future malware sophistication [2],[4]. The aim of this work is to provide a structured and comprehensive overview of the latest research on mobile malware detection techniques and pinpoint their benefits and limitations.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:ML0RJ9NH7IQC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Never say never: Authoritative TLD nameserver-powered DNS amplification",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8406224/",
            "Abstract": "DNS amplification attack is a significant and persistent threat to the Internet. Authoritative name servers (ANSes) of popular domains, especially the DNSSEC-enabled ones, give attractive leverage for attackers in distributed denial-of-service (DDoS) attacks. Particularly, the ANS list of top-level domains (TLD) is publicly accessible, including by would-be attackers, in the form of a root.zone file. In this work, we examine the potential of TLD ANSes to be exploited as unknowing agents in DNS amplification attacks. Specifically, over a period of 12 months that covers two different versions of the root.zone file, we assess the amplification factor (AF) that these servers may provide to attackers when replying to both individual and multiple queries. Also, we measure the degree of actual adoption of the recommended response rate limiting (RRL) countermeasure for the ANSes. Our major findings are that (i) 70% of the distinct …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:7T2F9Uy0os0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "iSAM: an iPhone stealth airborne malware",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21424-0_2",
            "Abstract": "Modern and powerful mobile devices comprise an attractive target for any potential intruder or malicious code. The usual goal of an attack is to acquire user’s sensitive data or compromise the device so as to use it as a stepping stone (or bot) to unleash a number of attacks to other targets. In this paper, we focus on the popular iPhone device. We create a new stealth and airborne malware namely iSAM able to wirelessly infect and self-propagate to iPhone devices. iSAM incorporates six different malware mechanisms, and is able to connect back to the iSAM bot master server to update its programming logic or to obey commands and unleash a synchronized attack. Our analysis unveils the internal mechanics of iSAM and discusses the way all iSAM components contribute towards achieving its goals. Although iSAM has been specifically designed for iPhone it can be easily modified to attack any iOS-based …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Two layer Denial of Service prevention on SIP VoIP infrastructures",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366408001655",
            "Abstract": "The emergence of Voice over IP (VoIP) has offered numerous advantages for end users and providers alike, but simultaneously has introduced security threats, vulnerabilities and attacks not previously encountered in networks with a closed architecture like the Public Switch Telephone Network (PSTN). In this paper we propose a two layer architecture to prevent Denial of Service attacks on VoIP systems based on the Session Initiation Protocol (SIP). The architecture is designed to handle different types of attacks, including request flooding, malformed message sending, and attacks on the underlying DNS system. The effectiveness of the prevention mechanisms have been tested both in the laboratory and on a real live VoIP provider network.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:UeHWp8X0CEIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "SnoopyBot: An Android spyware to bridge the mixes in Tor",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7772180/",
            "Abstract": "We present a moderately simple to implement but very effective and silent deanonymization scheme for Tor traffic. This is done by bridging the mixes in Tor, that is, we control both the traffic leaving the Onion Proxy (OP) and the traffic entering the Exit node. Specifically, from a user's viewpoint, our proposal has been implemented in the popular Android platform as a spyware, having the dual aim to manipulate user traffic before it enters the Tor overlay and explicitly instruct OP to choose an exit node that is controlled by the attacker. When the user traffic is received by the rogue exit node it is filtered, and the sender's IP details become visible. Notably, apart from deobfuscating normal http traffic, say, send via the Tor browser, the proposed scheme is able to manipulate https requests as well.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:t6usbXjVLHcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Caller identity privacy in SIP heterogeneous realms: A practical solution",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4625770/",
            "Abstract": "The growing demand for voice services and multimedia delivery over the Internet has raised SIPpsilas popularity making it a subject of extensive research. SIP is an application layer control signaling protocol, whose main purpose is to create, modify and terminate multimedia sessions. Research has shown that SIP has a number of security issues that must be solved in order to increase its trustworthiness and supersede or coexist with PSTN. In this paper our purpose is to address such a weakness, namely the caller identity privacy issue. While some solutions to this problem do exist, we will show that they are inadequate in a number of situations. Furthermore, we will propose a novel scheme for the protection of callerpsilas identity which can also support roaming between different administrative domains. Finally, we provide some performance results, which demonstrate that the proposed solution is efficient even …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:qxL8FJ1GzNcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Advances in Security and Privacy for Future Mobile Communications",
            "Publication year": 2019,
            "Publication url": "https://static.springer.com/sgw/documents/1368902/application/pdf/Special+Issue+-+Advances+in+Security+and+Privacy+for+Future+Mobile+Communications+%282%29.pdf",
            "Abstract": "Without doubt, the advances in wireless communication technologies like 3G, WiFi, WiMax and the proliferation of mobile devices have enabled the realization of pervasive and intelligent environments for users to communicate with each other, interact with information processing devices, and acquire ubiquitously a plethora of mobile services through various types of wireless access networks. Under this prism, reliable, secure, and privacy preserving communications combined with constant and universal network availability, are vital elements for the adoption of any application that utilize wireless technologies. This becomes even more apparent when considering the tight coupling of these wireless network domains to the Internet. Every day new security challenges come to the surface due to the open nature of the wireless medium, the dynamic network topology, the resource constraints of the mobile devices and …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:olpn-zPbct0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Lightweight algorithm for protecting SDN controller against DDoS attacks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8248858/",
            "Abstract": "It is without a doubt that both the controller and switch of an SDN are vulnerable to Distributed Denial of Service (DDoS) attacks. Typically, this ilk of attacks targets the flow table of the deployed network switches with the aim of producing overloading, high network delays, and consume bandwidth. Motivated by this fact, in this paper, we propose a lightweight scheme which is based on a set of rules to efficiently characterize packets send to a network switch as malicious or not. Through testbed experimentation and comparison with legacy DDoS protection schemes, we demonstrate that our solution performs significantly better when it comes to SDN ecosystem of mobile users.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Battling against DDoS in SIP: Is Machine Learning-based detection an effective weapon?",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7518050/",
            "Abstract": "This paper focuses on network anomaly-detection and especially the effectiveness of Machine Learning (ML) techniques in detecting Denial of Service (DoS) in SIP-based VoIP ecosystems. It is true that until now several works in the literature have been devoted to this topic, but only a small fraction of them have done so in an elaborate way. Even more, none of them takes into account high and low-rate Distributed DoS (DDoS) when assessing the efficacy of such techniques in SIP intrusion detection. To provide a more complete estimation of this potential, we conduct extensive experimentations involving 5 different classifiers and a plethora of realistically simulated attack scenarios representing a variety of (D)DoS incidents. Moreover, for DDoS ones, we compare our results with those produced by two other anomaly-based detection methods, namely Entropy and Hellinger Distance. Our results show that ML …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security and Privacy in m-Learning and Beyond: Challenges and State-of-the-art",
            "Publication year": 2013,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kambourakis/publication/285767902_Security_and_privacy_in_m-learning_and_beyond_Challenges_and_state-of-the-art/links/569244ca08aee91f69a6e4ce/Security-and-privacy-in-m-learning-and-beyond-Challenges-and-state-of-the-art.pdf",
            "Abstract": "Mobile learning is constantly evolving, following the shift of mobile technologies from laptops to handheld devices and smartphones. Indeed, the opportunities for innovation in this area are numerous and constantly under the focus of all the parties involved, ranging from traditional schools and universities to individual learners. However, mobile technology brings along increased threats to system and data security and privacy, given the fact that learners and educators are mobile, and in most cases, permitted to use their own mobile devices to access resources and services. After identifying the challenges, this paper provides a comprehensive review and classification of the state-of-the-art research on security and privacy in the m-learning realm and beyond. As far as we are aware of, this is the first time an exhaustive and detailed survey of this kind is attempted.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:cFHS6HbyZ2cC",
            "Publisher": "SERSC"
        },
        {
            "Title": "A Speech-Enabled Assistive Collaborative Platform for Educational Purposes with User Personalization",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4724866/",
            "Abstract": "With the proliferation of Web 2.0 applications, collaborative learning has gathered a lot of attention due its potentiality in the e-learning field. Forums, Wikis and Blogs for example are only some of the applications that exploit the collaborative nature of e-learning. However, these applications are originally designed for access from desktop systems and access to them when on the move can prove a challenging task. This paper elaborates on the design and implementation of an assistive collaborative platform for educational purposes that can be accessed by heterogeneous hardware platforms such as PCs, PDAs, mobile or traditional phones due to its capability of representing data in vocal manner. Its main purpose is to provide a platform for collaboration between university students and teachers in away that enhances students¿ access to educational resources and their overall learning experience. This is …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Client-Side Privacy Framework for Web Personalization",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28977-4_11",
            "Abstract": "Personalization of web applications is the complex process of dynamically rendering the application responsive to the unique needs of individual users. Nevertheless, the information required for achieving the personalization procedures is usually gathered and stored beyond the user’s control. This is a situation that raises serious privacy concerns to the end-users and may drive them to reject the application. For example, when browsing an adaptive e-commerce website, users are not aware which behavior will be monitored and logged, how it will be processed, how long it will be stored, and with whom it will be shared in the long run, thus they may hesitate to visit the website. In this chapter after an introduction to the state of the art in privacy preserving personalized web applications we present an abstract architecture that enables users to fine-tune their privacy level (and in result their personalization …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:70eg2SAEIzsC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Experimental analysis of an SSL-based AKA mechanism in 3G-and-beyond wireless networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:WIRE.0000047068.20203.57",
            "Abstract": "The SSL/TLS protocol is a de-facto standard that has proved its effectiveness in the wired Internet and it will probably be the most promising candidate for future heterogeneous wireless environments. In this paper, we propose potential solutions that this protocol can offer to future “all-IP” heterogeneous mobile networks with particular emphasis on the user's side. Our approach takes into consideration the necessary underlying public key infrastructure (PKI) to be incorporated in future 3G core network versions and is under investigation by 3GPP. We focus on the standard 3G+ authentication and key agreement (AKA), as well as the recently standardized extensible authentication protocol (EAP)-AKA procedures and claim that SSL-based AKA mechanisms can provide for an alternative, more robust, flexible and scalable security framework. In this 3G+ environment, we perceive authentication as a service …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:YsMSGLbcyi4C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A framework for identity privacy in SIP",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804509001052",
            "Abstract": "Secure multimedia delivery in modern and future networks is one of the most challenging problems towards the system integration of fourth generation (4G) networks. This integration means that different service and network providers will have to interoperate in order to offer their services to end users. This multidomain environment poses serious threats to the end user who has contract with, and trusts only a limited number of operators and service providers. One such threat is end users’ privacy on which we will focus in this paper. Probably the most promising protocol for multimedia session management is the Session Initiation Protocol (SIP), which is an application layer protocol and thus can operate on top of different lower layer technologies. SIP is quite popular and a lot of research has been conducted; however, it still has some security issues, one of which is related to privacy and more particularly the …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:UebtZRa9Y70C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Anonymity and closely related terms in the cyberspace: An analysis by example",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2214212614000209",
            "Abstract": "Anonymity is generally conceived to be an integral part of user's right to privacy. Without anonymity, many online activities would become prone to eavesdropping, making them potentially risky to use. This work highlights on the different aspects closely related to anonymity and argues that it is rather a multifaceted and contextual concept. To support this argumentation, the paper examines as a dual case study the ways anonymity is conceptualised in the case of two well-established but dissimilar protocols employed in the cyberspace on a wide-scale; that is, SIP and Kerberos ones. By surveying the research done for preserving anonymity (and privacy in general) in the context of the aforementioned protocols several useful observations emerge. Our aim is to contribute towards acquiring a comprehensive view of this particular research area, mainly by examining how anonymity is put to work in practice. As a result …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:NhqRSupF_l8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "SIP message tampering: The SQL code injection attack",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=17641637658760200523&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Neither Good nor Bad: A Large-Scale Empirical Analysis of HTTP Security Response Headers",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-86586-3_6",
            "Abstract": "HTTP security-focused response headers can be of great aid to web applications towards augmenting their overall security level. That is, if set at the server side, these headers define whether certain security countermeasures are in place for protecting end-users. By utilising the curated Tranco list, this work conducts a wide-scale internet measurement that provides timely answers to the following questions: (a) How the adoption of these headers is developing over time?, (b) What is the penetration ratio of each key header in the community?, (c) Are there any differences in the support of these headers between diverse major browsers and platforms?, (d) Does the version of a browser (outdated vs. new) affects the support rate per key header?, and (e) Is the status of a header (active vs. deprecated) reflected to its support rate by web servers? Setting aside the use of the more robust Tranco corpus, to our …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:oNZyr7d5Mn4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Towards effective wireless intrusion detection in IEEE 802.11 i",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4279768/",
            "Abstract": "The proliferation of wireless devices and the availability of wireless applications and services constantly raise new security concerns. Towards this direction, wireless intrusion detection systems (WIDS) can assist a great deal to proactively and reactively protect wireless networks, thus discouraging or repealing potential adversaries. In this paper we discuss the major wireless attack categories concerning IEEE 802.11 family networks and in particular the latest 802.11i security standard. We elaborate on 802.11 specific attacks and experimentally explore how these outbreaks can be effectively mitigated or thwarted by a properly designed WIDS. Among specially crafted software for both WIDS's modules as well as for attack generators, our test-bed embraces the majority of well known open source attack tools. Test results show that the proposed WIDS modules are able to effectively detect, either directly or indirectly …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exposing resource consumption attacks in internet multimedia services",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7446237/",
            "Abstract": "Attackers always find ways to elude the employed security mechanisms of a system, no matter how strong they are. Nevertheless, audit trails - which as a rule of thumb are kept by any service provider - store all the events pertaining to the service of interest. Therefore, audit trail data can be a valuable ally when it comes to the certification of the security level of a given service. This stands especially true for critical realtime services such as multimedia ones, which nowadays are on the rise. This work proposes a practical, simple to implement yet powerful solution based on the Hellinger Distance metric for conducting audit trail analysis destined to expose security incidents. Our solution relies on a set of different features existing in the app layer protocol for session handling in order to classify the analyzed traffic as intrusive or not. Taking the well-known Session Initiation Protocol (SIP) as an example, we thoroughly …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Neither Denied nor Exposed: Fixing WebRTC Privacy Leaks",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/723838",
            "Abstract": "To establish peer-to-peer connections and achieve real-time web-based communication, the Web Real-Time Communication (WebRTC) framework requires address information of the communicating peers. This means that users behind, say, Network Address Translation (NAT) or firewalls normally rely on the Interactive Connectivity Establishment (ICE) framework for the sake of negotiating information about the connection and media transferring. This typically involves Session Traversal Utilities for NAT (STUN)/Traversal using Relays around NAT (TURN) servers, which assist the peers with discovering each other’s private and public IP: port, and relay traffic if direct connection fails. Nevertheless, these IP: port pieces of data can be easily captured by anyone who controls the corresponding STUN/TURN server, and even more become readily available to the JavaScript application running on the webpage. While this is acceptable for a user that deliberately initiates a WebRTC connection, it becomes a worrisome privacy issue for those being unaware that such a connection is attempted. Furthermore, the application acquires more information about the local network architecture compared to what is exposed in usual HTTP interactions, where only the public IP is visible. Even though this problem is well-known in the related literature, no practical solution has been proposed so far. To this end, and for the sake of detecting and preventing in real time the execution of STUN/TURN clandestine, privacy-invading requests, we introduce two different kinds of solutions:(a) a browser extension, and (b) an HTTP gateway, implemented in C++ as well as in …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:BwyfMAYsbu0C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Improving Android malware detection through dimensionality reduction techniques",
            "Publication year": 2021,
            "Publication url": "https://www.researchgate.net/profile/Vasileios-Kouliaridis/publication/349753048_Improving_Android_Malware_Detection_Through_Dimensionality_Reduction_Techniques/links/60427b3e299bf1e07857a681/Improving-Android-Malware-Detection-Through-Dimensionality-Reduction-Techniques.pdf",
            "Abstract": "Mobile malware poses undoubtedly a major threat to the continuously increasing number of mobile users worldwide. While researchers have been trying vigorously to find optimal detection solutions, mobile malware is becoming more sophisticated and its writers are getting more and more skilled in hiding malicious code. In this paper, we examine the usefulness of two well-known dimensionality reduction transformations namely, Principal Component Analysis (PCA) and t-distributed stochastic neighbor embedding (t-SNE) in malware detection. Starting from a large set of base prominent classifiers, we study how they can be combined to build an accurate ensemble. We propose a simple ensemble aggregated base model of similar feature type as well as a complex ensemble that can use multiple and possibly heterogeneous base models. The experimental results in contemporary Androzoo benchmark corpora verify the suitability of ensembles for this task and clearly demonstrate the effectiveness of our method.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:tuHXwOkdijsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Two Anatomists Are Better than One—Dual-Level Android Malware Detection",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/762360",
            "Abstract": "The openness of the Android operating system and its immense penetration into the market makes it a hot target for malware writers. This work introduces Androtomist, a novel tool capable of symmetrically applying static and dynamic analysis of applications on the Android platform. Unlike similar hybrid solutions, Androtomist capitalizes on a wealth of features stemming from static analysis along with rigorous dynamic instrumentation to dissect applications and decide if they are benign or not. The focus is on anomaly detection using machine learning, but the system is able to autonomously conduct signature-based detection as well. Furthermore, Androtomist is publicly available as open source software and can be straightforwardly installed as a web application. The application itself is dual mode, that is, fully automated for the novice user and configurable for the expert one. As a proof-of-concept, we meticulously assess the detection accuracy of Androtomist against three different popular malware datasets and a handful of machine learning classifiers. We particularly concentrate on the classification performance achieved when the results of static analysis are combined with dynamic instrumentation vis-à-vis static analysis only. Our study also introduces an ensemble approach by averaging the output of all base classification models per malware instance separately, and provides a deeper insight on the most influencing features regarding the classification process. Depending on the employed dataset, for hybrid analysis, we report notably promising to excellent results in terms of the accuracy, F1, and AUC metrics. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:p__nRnzSRKYC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Key Management in 802.16e",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Leonardo-Maccari/publication/228033764_WiMAX_Network_Security/links/59e75c2e4585152d5f04e4fc/WiMAX-Network-Security.pdf#page=105",
            "Abstract": "Until now the IEEE 802.16 technologies, also known as WiMAX, may not have had the adoption rate of 802.11, but will likely be the predominant technology for Metropolitan Area Networks (MAN) deployments for the next decade. This is because WiMAX can support all-IP core network architecture, low latency, advanced Quality of Service (QoS) and sophisticated security [1]. The IEEE 802.16 working group on broadband wireless access standards, a unit of the IEEE 802 LAN/MAN standards committee (http://www/wirelessman. org/), is preparing and revising formal specifications for the global deployment of broadband Wireless MANs. The 802.16 security model was designed initially to support authentication, confidentiality and integrity services. This is in contrast to the key management model used in the original 802.11 specification. The initial 802.16-2001 version of the standards [2] employs X. 509 certificates for the authentication of devices on the network. Every subscriber device has its own certificate that identifies it uniquely to the 802.16 infrastructure. Of course, this allows providers to control which devices are authorized to use their networks. On the other hand, as in GSM networks, authentication is not mutual. Specifically, while the network can authenticate a subscriber device, the subscriber device has no way to authenticate the infrastructure. This leads to several attacks including man-in-the-middle, spoofing or replay attacks against the subscriber device. For link encryption, 802.16 uses",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:bEWYMUwI8FkC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Evaluation of digital certificates acquisition in large-scale 802.11-3GPP hybrid environments",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1541544/",
            "Abstract": "This paper evaluates the performance of a hybrid WLAN-3GPP network architecture for delivering subscribers' certificates. Two main categories of simulation scenarios are implemented and evaluated based on the underlying access network technology used; 802.11b and UMTS. Each of the scenarios is categorized further in numerous sub-cases. Results showed that AC acquisition when deployed in large scale between several heterogeneous networks is feasible within acceptable time limits",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:qUcmZB5y_30C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Introducing touchstroke: keystroke‐based authentication system for smartphones",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.1061",
            "Abstract": "Keystroke dynamics is a well‐investigated behavioural biometric based on the way and rhythm in which someone interacts with a keyboard or keypad when typing characters. This paper explores the potential of this modality but for touchscreen‐equipped smartphones. The main research question posed is whether ‘touchstroking’ can be effective in building the biometric profile of a user, in terms of typing pattern, for future authentication. To reach this goal, we implemented a touchstroke system in the Android platform and executed different scenarios under disparate methodologies to estimate its effectiveness in authenticating the end‐user. Apart from typical classification features used in legacy keystroke systems, we introduce two novel ones, namely, speed and distance. From the experiments, it can be argued that touchstroke dynamics can be quite competitive, at least when compared to similar results obtained …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:dshw04ExmUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SIP Security: Threats, Vulnerabilities and Countermeasures",
            "Publication year": 2018,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=CAJ-DwAAQBAJ&oi=fnd&pg=PT371&dq=info:acrenTf91jcJ:scholar.google.com&ots=Km-CDxCIuW&sig=dGsfRSBkMMcGcxlrtV9yBZ3KTec",
            "Abstract": "Until the early 1990s telecommunication providers were employing dedicated closed networks, like the Public Switch Telephone Network (PSTN), for transmitting voice. By this way the establishment of communication and voice transmission in PSTN was exploiting only 10–25% of the total available resources [1]. Even though significant effort has been devoted to improve resource utilization and to minimize the cost of the provided services, very little has been achieved to date. The Internet has supported the revolution in telecommunications and specifically in the provision of voice services, voice is transmitted over the Internet Protocol (VoIP) utilizing the Internet as a backbone network. Despite the fact that a plethora of novel, sophisticated, lowcost services can be offered in this way (eg, conference rooms, click to dial etc), telecommunication providers are now facing security problems that have not been previously encountered.Contrariwise to PSTN, which is based on a closed network architecture and thus it neither experiences a big variety of attacks nor a high attack frequency [2], VoIP utilizes an open network architecture and thus VoIP providers and end users should deal not only with the Internet’s native vulnerabilities and attacks but also with VoIP oriented ones. Several researchers [3–6] have identified",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:9Nmd_mFXekcC",
            "Publisher": "CRC Press"
        },
        {
            "Title": "An ontology-based policy for deploying secure SIP-based VoIP services",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404808000424",
            "Abstract": "Voice services over Internet Protocol (VoIP) are nowadays much promoted by telecommunication and Internet service providers. However, the utilization of open networks, like the Internet, raises several security issues that must be accounted for. On top of that, there are new sophisticated attacks against VoIP infrastructures that capitalize on vulnerabilities of the protocols employed for the establishment of a VoIP session (for example the Session Initiation Protocol – SIP).This paper provides a categorization of potential attacks against VoIP services, followed by specific security recommendations and guidelines for protecting the underlying infrastructure from these attacks and thus ensuring the provision of robust and secure services. In order to utilize (share) the aforementioned security guidelines and recommendations into different domains, it is necessary to have them represented in some formal way. To this end …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:roLk4NBRz8UC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Dendron: Genetic trees driven rule induction for network intrusion detection systems",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X16305465",
            "Abstract": "Intrusion detection systems (IDSs) are essential entities in a network topology aiming to safeguard the integrity and availability of sensitive assets in the protected systems. In misuse detection systems, which is the topic of the paper at hand, the detection process relies on specific attack signatures (rules) in an effort to distinguish between legitimate and malicious network traffic. Generally, three major challenges are associated with any IDS of this category: identifying patterns of new attacks with high accuracy, ameliorating the human-readability of the detection rules, and rightly designating the category these attacks belong to. To this end, we propose Dendron, a methodology for generating new detection rules which are able to classify both common and rare types of attacks. Our methodology takes advantage of both Decision Trees and Genetic Algorithms for the sake of evolving linguistically interpretable and …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:PELIpwtuRlgC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Performance Evaluation of Bluetooth Security Mechanisms for Handheld Devices",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:_Qo2XoVZTnwC",
            "Publisher": "VDE"
        },
        {
            "Title": "Evaluation of anomaly‐based IDS for mobile devices using machine learning classifiers",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.341",
            "Abstract": "Mobile devices have evolved and experienced an immense popularity over the last few years. This growth however has exposed mobile devices to an increasing number of security threats. Despite the variety of peripheral protection mechanisms described in the literature, authentication and access control cannot provide integral protection against intrusions. Thus, a need for more intelligent and sophisticated security controls such as intrusion detection systems (IDSs) is necessary. Whilst much work has been devoted to mobile device IDSs, research on anomaly‐based or behaviour‐based IDS for such devices has been limited leaving several problems unsolved. Motivated by this fact, in this paper, we focus on anomaly‐based IDS for modern mobile devices. A dataset consisting of iPhone users data logs has been created, and various classification and validation methods have been evaluated to assess their …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:M3NEmzRMIkIC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Dealing with User Privacy in Mobile Apps: Issues and Mitigation",
            "Publication year": 2016,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781315369648-13/dealing-user-privacy-mobile-apps-issues-mitigation-ricardo-neisse-dimitris-geneiatakis-gary-steri-georgios-kambourakis-igor-nai-fovino-riccardo-satta",
            "Abstract": "Contents Abstract............................................................................................ 68 4.1 Introduction................................................................................. 68 4.2 Android High-Level Architecture........................................................... 69 4.3 Privacy Flaws in Mobile World.............................................................. 71 4.4 Countermeasures............................................................................ 74",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:lmc2jWPfTJgC",
            "Publisher": "Auerbach Publications"
        },
        {
            "Title": "PrivaSIP: Ad-hoc identity privacy in SIP",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0920548910000942",
            "Abstract": "In modern and future networks that belong to different providers, multimedia protocols will have to operate through multiple domains. In such an environment security is considered a crucial parameter; this is true especially for privacy since not all domains can be considered trusted beforehand in terms of personal data protection. Probably the most promising protocol for multimedia session management is SIP. While SIP is popular and a lot of research has been conducted, it still has some security issues, one of which is related to privacy and more particularly the protection of user identities (IDs). In the general case everybody can reveal the communicating parties IDs by simply eavesdropping on the exchanged SIP messages. In this paper we analyze the lack of user ID protection in SIP and propose two solutions; in the first the ID of the caller is protected while in the second both IDs of the caller and the callee are …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:hC7cP41nSMkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Binary tree based public-key management for mobile ad hoc networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4726144/",
            "Abstract": "The establishment of a public key infrastructure (PKI) in mobile ad hoc networks (MANETs) is considered a difficult task because of the intrinsic characteristics of these networks. The absence of centralized services and the possible network partitions make traditional security solutions not straightforwardly applicable in MANETs. In this paper, we propose a public key management scheme based on a binary tree formation of the network¿s nodes. Using the binary tree structure, certificate chains are easily built between communicating nodes that are multi-hops away and the cumbersome problem of certificate chain discovery is avoided. We argue that our mechanism has several advantages over similar solutions, especially when a fair balancing between security and performance is terminus.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "At Your Service 24/7 or Not? Denial of Service on ESInet Systems",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-86586-3_3",
            "Abstract": "Emergency calling services are a cornerstone of public safety. During the last few years such systems are transitioning to VoIP and unified communications, and are continuously evolving under the umbrella of organizations, including NENA and EENA. The outcome of this effort is NG911 or NG112 services operating over the so-called Emergency Services IP network (ESInet). This work introduces and meticulously assesses the impact of an insidious and high-yield denial-of-service (DoS) attack against ESInet. Contrariwise to legacy SIP-based DoS, the introduced assault capitalizes on the SDP body of the SIP message with the sole purpose of instigating CPU-intensive transcoding operations at the ESInet side. We detail on the way such an attack can be carried out, and scrutinize on its severe, if not catastrophic, impact through different realistic scenarios involving a sufficient set of codecs. Finally …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:M7yex6snE4oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Let’s Meet! A participatory-based discovery and rendezvous mobile marketing framework",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0736585314000914",
            "Abstract": "Modern mobile devices are nowadays powerful enough and can be used toward defining a new channel of communication with potential consumers. This channel is commonly known as mobile marketing and there is already a number of mobile marketing apps, whose aim is to increase the sales of some product or service. In this context, the Let’s Meet! framework presented in this paper is essentially a mobile marketing app. The app groups two or more persons, who basically do not know each other, having as sole criterion their common interest in an offer about a product or a service. Its main objective is to bring them together, so that they can purchase and enjoy an offer, which otherwise could not afford. One of the highlights of our proposal is that all sensitive user data are transmitted in a secure manner, and thus confidentiality is preserved. Users’ privacy is also given great consideration. This means for …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:tOudhMTPpwUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Efficient certification path discovery for MANET",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/content/pdf/10.1155/2010/243985.pdf",
            "Abstract": "A Mobile Ad Hoc Network (MANET) is characterized by the lack of any infrastructure, absence of any kind of centralized administration, frequent mobility of nodes, network partitioning, and wireless connections. These properties make traditional wireline security solutions not straightforwardly applicable in MANETs, and of course, constitute the establishment of a Public Key Infrastructure (PKI) in such networks a cumbersome task. After surveying related work, we propose a novel public key management scheme using the well-known web-of-trust or trust graph model. Our scheme is based on a binary tree formation of the network's nodes. The binary tree structure is proved very effective for building certificate chains between communicating nodes that are multihops away and the cumbersome problem of certificate chain discovery is avoided. We compare our scheme with related work and show that it presents …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:kNdYIx-mwKoC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A new accounting mechanism for modern and future AAA services",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09699-5_47",
            "Abstract": "Accounting along with Authentication and Authorization comprise the concept of AAA provided by IETF (Internet Engineering Task Force). In heterogeneous environments, where different administrative domains and different wired and wireless technologies are utilized, those principles are often hard and complex to correctly implement and evaluate. Specifically, accounting which is our topic of interest, is in many cases a complicated procedure since many aspects need to be taken into consideration. In this respect, a distributed, flexible, robust, secure and generic accounting system needs to be implemented in order to provide the ability to determine which user has acquired which services and for how long at each operator domain. This work examines different scenarios applicable to such 3G/4G hybrid mobile environments and suggests a novel, generic mechanism to support accounting.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:IWHjjKOFINEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "PKI-based secure mobile access to electronic health services and data",
            "Publication year": 2005,
            "Publication url": "https://content.iospress.com/articles/technology-and-health-care/thc00388",
            "Abstract": "Recent research works examine the potential employment of public-key cryptography schemes in e-health environments. In such systems, where a Public Key Infrastructure (PKI) is established beforehand, Attribute Certificates (ACs) and public key enabled protocols like TLS, can provide the appropriate mechanisms to effectively support authentication, authorization and confidentiality services. In other words, mutual trust and secure communications between all the stakeholders, namely physicians, patients and e-health service providers, can be successfully established and maintained. Furthermore, as the recently introduced mobile devices with access to computer-based patient record systems are expanding, the need of physicians and nurses to interact increasingly with such systems arises. Considering public key infrastructure requirements for mobile online health networks, this paper discusses the potential …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:GnPB-g6toBAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Automatic detection of online recruitment frauds: Characteristics, methods, and a public dataset",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/183982",
            "Abstract": "The critical process of hiring has relatively recently been ported to the cloud. Specifically, the automated systems responsible for completing the recruitment of new employees in an online fashion, aim to make the hiring process more immediate, accurate and cost-efficient. However, the online exposure of such traditional business procedures has introduced new points of failure that may lead to privacy loss for applicants and harm the reputation of organizations. So far, the most common case of Online Recruitment Frauds (ORF), is employment scam. Unlike relevant online fraud problems, the tackling of ORF has not yet received the proper attention, remaining largely unexplored until now. Responding to this need, the work at hand defines and describes the characteristics of this severe and timely novel cyber security research topic. At the same time, it contributes and evaluates the first to our knowledge publicly available dataset of 17,880 annotated job ads, retrieved from the use of a real-life system. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:AXPGKjj_ei8C",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Attacks and Countermeasures on 802.16: Analysis and Assessment",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6170531/",
            "Abstract": "The IEEE 802.16 technology, commonly referred to as WiMAX, gains momentum as an option for broadband wireless communication access. So far, several research works focus on the security of the 802.16 family of standards. In this context, the contribution of this paper is twofold. First, it provides a comprehensive taxonomy of attacks and countermeasures on 802.16. Each attack is classified based on several factors, e.g. its type, likelihood of occurrence, impact upon the system etc. and its potential is reviewed with reference to the standard. Possible countermeasures and remedies proposed for each category of attacks are also discussed to assess their effectiveness. Second, a full-scale assessment study of indicative attacks that belong to broader attack classes is conducted in an effort to better comprehend their impact on the 802.16 realm. As far as we are aware of, this is the first time an exhaustive and …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:lSLTfruPkqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A cloud-based architecture to crowdsource mobile app privacy leaks",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2645791.2645799",
            "Abstract": "Most would agree that modern app-markets have been flooded with applications that not only threaten the security of the OS superficially, but also in their majority, trample on user's privacy through the exposure of sensitive information not necessarily needed for their operation. In this context, the current work revolves around 3 key questions: Is there a way for the end-user to easily track-the many times-hidden privacy leaks occurring due to the way mobile apps operate? Can crowdsourcing provide the end-user with a quantitative assessment per app in terms of privacy exposure level? And if yes, in which way a cloud-based crowdsourcing mechanism can detect and alert for changes in the apps' behavior? Motivated by the aforementioned questions, we design a cloud-based system that operates under a crowdsourcing logic, with the aim to provide i) a real-time privacy-flow tracking service, ii) a collaborative …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:SP6oXDckpogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Survey of secure handoff optimization schemes for multimedia services over all-IP wireless heterogeneous networks",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kambourakis/publication/220250116_Survey_of_secure_hand-off_optimization_schemes_for_multimedia_services_over_all-IP_wireless_heterogenous_networks/links/0deec520b571745d82000000/Survey-of-secure-hand-off-optimization-schemes-for-multimedia-services-over-all-IP-wireless-heterogenous-networks.pdf",
            "Abstract": "In the very near future, we shall witness the coexistence of networks with heterogeneous link layer technologies. Such networks will naturally overlap each other and mobile users will need to frequently handoff among them for a number of reasons, including the quest for higher speeds and/or lower cost. Handoffs between such hybrid networks should be fast enough to support demanding applications, like multimedia content delivery, but also secure enough since different network providers are involved. This gets even more complicated considering that network providers may not simultaneously be multimedia service providers as it is the case today. In order to support security operations in a large scale the employment of an AAA protocol is mandated; however, this adds more delay to the handoff process. This article analyses and compares the prominent methods proposed so far that optimize the secure handoff process in terms of delay and are suitable for uninterruptible secure multimedia service delivery.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:Y0pCki6q_DkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Delivering attribute certificates over GPRS",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/967900.968137",
            "Abstract": "Attribute Certificates (ACs) have been developed and standardized by the ANSI X9 committee as an alternative and better approach, to X. 509 public key certificates, for carrying authorization information. Attribute Authorities (AA) bind the characteristics of an entity (called attributes) to that entity by signing the appropriate AC. Therefore, ACs can be used for controlling access to system resources and employing role-based authorization and access controls policies accordingly. Although ACs are widely used and standardized, to the best of our knowledge, no mobile infrastructure or service currently utilizes them. In this paper, we first examine how basic Public Key Infrastructure (PKI) can be incorporated into mobile networks and especially the Universal Mobile Telecommunications System (UMTS). As a case study, we then experiment with ACs in the GPRS network, using a prototype implementation. In particular, we …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A state-of-the-art review on the security of mainstream IoT wireless PAN protocol stacks",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/683768",
            "Abstract": "Protocol stacks specifically designed for the Internet of Things (IoT) have become commonplace. At the same time, security and privacy concerns regarding IoT technologies are also attracting significant attention given the risks that are inherently associated with the respective devices and their numerous applications, ranging from healthcare, smart homes, and cities, to intelligent transportation systems and industrial automation. Considering the still heterogeneous nature of the majority of IoT protocols, a major concern is to find common references for investigating and analyzing their security and privacy threats. To this end, and on top of the current literature, this work provides a comprehensive, vis-à-vis comparison of the security aspects of the thus far most widespread IoT Wireless Personal Area Network (WPAN) protocols, namely BLE, Z-Wave, ZigBee, Thread, and EnOcean. A succinct but exhaustive review of the relevant literature from 2013 up to now is offered as a side contribution. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:4MWp96NkSFoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "New facets of mobile botnet: architecture and evaluation",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s10207-015-0310-0",
            "Abstract": "It is without a doubt that botnets pose a growing threat to the Internet, with DDoS attacks of any kind carried out by botnets to be on the rise. Nowadays, botmasters rely on advanced Command and Control (C&C) infrastructures to achieve their goals and most importantly to remain undetected. This work introduces two novel botnet architectures that consist only of mobile devices and evaluates both their impact in terms of DNS amplification and TCP flooding attacks, and their cost pertaining to the maintenance of the C&C channel. The first one puts forward the idea of using a continually changing mobile HTTP proxy in front of the botherder, while the other capitalizes on DNS protocol as a covert channel for coordinating the botnet. That is, for the latter, the messages exchanged among the bots and the herder appear as legitimate DNS transactions. Also, a third architecture is described and assessed, which is …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:5Ul4iDaHHb8C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "DDoS in the IoT: Mirai and other botnets",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7971869.",
            "Abstract": "The Mirai botnet and its variants and imitators are a wake-up call to the industry to better secure Internet of Things devices or risk exposing the Internet infrastructure to increasingly disruptive distributed denial-of-service attacks.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel Protecting Mechanism for SIP-Based Infrastructure against Malformed Message Attacks: Performance Evaluation Study",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.714.9564&rep=rep1&type=pdf",
            "Abstract": "This paper presents a novel mechanism to protect Session Initiation Protocol (SIP)-based infrastructure against malformed message attacks. The basic characteristics of this mechanism are the following: lightweight and easy to adapt to various SIP implementations. The proposed mechanism has been evaluated in terms of overhead processing. It is demonstrated that the employment of appropriate IDS against malformed impose minimum overhead in terms of events’ processing",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:vDijr-p_gm4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Empirical Evaluation of Attacks Against IEEE 802.11 Enterprise Networks: The AWID3 Dataset",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9360747/",
            "Abstract": "This work serves two key objectives. First, it markedly supplements and extends the well-known AWID corpus by capturing and studying traces of a wide variety of attacks hurled in the IEEE 802.1X Extensible Authentication Protocol (EAP) environment. Second, given that all the 802.11-oriented attacks have been carried out when the defenses introduced by Protected Management Frames (PMF) were operative, it offers the first to our knowledge full-fledged empirical study regarding the robustness of the IEEE 802.11w amendment, which is mandatory for WPA3 certified devices. Under both the aforementioned settings, the dataset, and study at hand are novel and are anticipated to be of significant aid towards designing and evaluating intrusion detection systems. Moreover, in an effort to deliver a well-rounded dataset of greater lifespan, and under the prism of an attacker escalating their assault from the wireless …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Developments in Security and Privacy-Preserving Mechanisms for Future Mobile Communication Networks",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s11036-013-0487-2",
            "Abstract": "The advances in wireless communication technologies toward 4G networks and the wide use of mobile devices have enabled users to communicate with each other and receive a wide range of mobile wireless services through various types of access networks and systems everywhere and anytime. However, the always-connected mobile device usage model brings to the foreground new security and privacy issues for both the end-user and network/service provider. In this respect, secure, reliable, and privacy-preserving communications combined with constant network availability are essential factors for the adoption of any service or application that utilize wireless technologies. Also, the tight-coupling of these wireless network domains to the Internet makes them more susceptible to attacks. New security challenges emerge constantly due to the open nature of the wireless medium, the dynamic network topology …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:pyW8ca7W8N0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Introducing deep learning self-adaptive misuse network intrusion detection systems",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8620986/",
            "Abstract": "The intrusion detection systems (IDSs) are essential elements when it comes to the protection of an ICT infrastructure. A misuse IDS is a stable method that can achieve high attack detection rates (ADR) while keeping false alarm rates under acceptable levels. However, the misuse IDSs suffer from the lack of agility, as they are unqualified to adapt to new and “unknown” environments. That is, such an IDS puts the security administrator into an intensive engineering task for keeping the IDS up-to-date every time it faces efficiency drops. Considering the extended size of modern networks and the complexity of big network traffic data, the problem exceeds the substantial limits of human managing capabilities. In this regard, we propose a novel methodology which combines the benefits of self-taught learning and MAPE-K frameworks to deliver a scalable, self-adaptive, and autonomous misuse IDS. Our methodology …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A critical review of 13 years of mobile game-based learning",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/article/10.1007/s11423-017-9552-z",
            "Abstract": " With the increasing popularity of smartphones and tablets, game-based learning (GBL) is undergoing a rapid shift to mobile platforms. This transformation is driven by mobility, wireless interfaces, and built-in sensors that these smart devices offer in order to enable blended and context-sensitive mobile learning (m-Learning) activities. Thus, m-Learning is becoming more independent and ubiquitous (u-Learning). In order to identify and analyze the main trends and the future challenging issues involved in designing mGBL learning strategies, as well as to bring to the foreground important issues pertaining to mobile and context-aware ubiquitous GBL, the work at hand conducts a comprehensive survey of this particular area. Specifically, it introduces and applies a six-dimensional framework consisted of Spatio-temporal, Collaboration/Social, Session, Personalization, Data security & privacy, and Pedagogy …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:SdhP9T11ey4C",
            "Publisher": "Springer US"
        },
        {
            "Title": "MILC: A secure and privacy-preserving mobile instant locator with chatting",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s10796-010-9254-0",
            "Abstract": "The key issue for any mobile application or service is the way it is delivered and experienced by users, who eventually may decide to keep it on their software portfolio or not. Without doubt, security and privacy have both a crucial role to play towards this goal. Very recently, Gartner has identified the top ten of consumer mobile applications that are expected to dominate the market in the near future. Among them one can earmark location-based services in number 2 and mobile instant messaging in number 9. This paper presents a novel application namely MILC that blends both features. That is, MILC offers users the ability to chat, interchange geographic co-ordinates and make Splashes in real-time. At present, several implementations provide these services separately or jointly, but none of them offers real security and preserves the privacy of the end-users at the same time. On the contrary, MILC provides …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:4DMP91E08xMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "MODELING LEARNERS’PERCEPTIONS TOWARD EDUCATIONAL PORTALS AND COLLABORATIVE LEARNING TOOLS USAGE: THE HELLENIC OPEN UNIVERSITY CASE",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:4JMBOYKVnBMC",
            "Publisher": "Propompos publications"
        },
        {
            "Title": "Signaling-oriented DoS attacks in UMTS networks",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02617-1_29",
            "Abstract": "The Universal Mobile Telecommunication Standard (UMTS) is the Third Generation (3G) mobile technology with the widest public acceptance. Although, enhanced in matters of security, comparing to its predecessor i.e., the GSM, it still has vulnerabilities that can lead to security breach. In this paper we investigate the vulnerabilities of the UMTS architecture that can be exploited by a malicious entity to launch Denial of Service (DoS) attacks. We examine the methodologies that an attacker would possibly follow, as well as the possible outcome of such class of attacks. We also give some suggestions that would provide greater tolerance to the system against DoS attacks.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:ULOm3_A8WrAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "PrivaKERB: A user privacy framework for Kerberos",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404811000617",
            "Abstract": "Kerberos is one of the most well-respected and widely used authentication protocols in open and insecure networks. It is envisaged that its impact will increase as it comprises a reliable and scalable solution to support authentication and secure service acquisition in the Next Generation Networks (NGN) era. This means however that security and privacy issues related to the protocol itself must be carefully considered. This paper proposes a novel two-level privacy framework, namely PrivaKERB, to address user privacy in Kerberos. Our solution offers two privacy levels to cope with user anonymity and service access untraceability. We detail how these modes operate in preserving user privacy in both single-realm and cross-realm scenarios. By using the extensibility mechanisms already available in Kerberos, PrivaKERB does not change the semantics of messages and enables future implementations to maintain …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:k_IJM867U9cC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Survey of security vulnerabilities in session initiation protocol.",
            "Publication year": 2006,
            "Publication url": "https://www.researchgate.net/profile/Dorgham-Sisalem/publication/3454645_Survey_of_security_vulnerabilities_in_Session_Initiation_Protocol/links/00463517ebc044386c000000/Survey-of-security-vulnerabilities-in-Session-Initiation-Protocol.pdf",
            "Abstract": "The open architecture of the Internet and the use of open standards like Session Initiation Protocol (SIP) constitute the provisioning of services (eg, Internet telephony, instant messaging, presence, etc.) vulnerable to known Internet attacks, while at the same time introducing new security problems based on these standards that cannot been tackled with current security mechanisms. This article identifies and describes security problems in the SIP protocol that may lead to denial of service. Such security problems include flooding attacks, security vulnerabilities in parser implementations, and attacks exploiting vulnerabilities at the signaling-application level. A qualitative analysis of these security flaws and their impacts on SIP systems is presented.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Botnet command and control architectures revisited: Tor hidden services and fluxing",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-68786-5_41",
            "Abstract": "Botnet armies constitute a major and continuous threat to the Internet. Their number, diversity, and power grows with each passing day, and the last years we are witnessing their rapid expansion to mobile and even IoT devices. The work at hand focuses on botnets which comprise mobile devices (e.g. smartphones), and aims to raise the alarm on a couple of advanced Command and Control (C&C) architectures that capitalize on Tor’s hidden services (HS) and DNS protocol. Via the use of such architectures, the goal of the perpetrator is dual; first to further obfuscate their identity and minimize the botnet’s forensic signal, and second to augment the resilience of their army. The novelty of the introduced architectures is that it does not rely on static C&C servers, but on rotating ones, which can be reached by other botnet members through their (varied) onion address. Also, we propose a scheme called “Tor fluxing …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:JoZmwDi-zQgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Vulnerabilities and Attacks Against Industrial Control Systems and Critical Infrastructures",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.03945",
            "Abstract": "Critical infrastructures (CI) and industrial organizations aggressively move towards integrating elements of modern Information Technology (IT) into their monolithic Operational Technology (OT) architectures. Yet, as OT systems progressively become more and more interconnected, they silently have turned into alluring targets for diverse groups of adversaries. Meanwhile, the inherent complexity of these systems, along with their advanced-in-age nature, prevents defenders from fully applying contemporary security controls in a timely manner. Forsooth, the combination of these hindering factors has led to some of the most severe cybersecurity incidents of the past years. This work contributes a full-fledged and up-to-date survey of the most prominent threats against Industrial Control Systems (ICS) along with the communication protocols and devices adopted in these environments. Our study highlights that threats against CI follow an upward spiral due to the mushrooming of commodity tools and techniques that can facilitate either the early or late stages of attacks. Furthermore, our survey exposes that existing vulnerabilities in the design and implementation of several of the OT-specific network protocols may easily grant adversaries the ability to decisively impact physical processes. We provide a categorization of such threats and the corresponding vulnerabilities based on various criteria. As far as we are aware, this is the first time an exhaustive and detailed survey of this kind is attempted.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:WZBGuue-350C",
            "Publisher": "Unknown"
        },
        {
            "Title": "User privacy and modern mobile services: are they on the same path?",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00779-012-0579-1.pdf",
            "Abstract": "Perhaps, the most important parameter for any mobile application or service is the way it is delivered and experienced by the end-users, who usually, in due course, decide to keep it on their software portfolio or not. Most would agree that security and privacy have both a crucial role to play toward this goal. In this context, the current paper revolves around a key question: Do modern mobile applications respect the privacy of the end-user? The focus is on the iPhone platform security and especially on user’s data privacy. By the implementation of a DNS poisoning malware and two real attack scenarios on the popular Siri and Tethering services, we demonstrate that the privacy of the end-user is at stake.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:35N4QoGY0k4C",
            "Publisher": "Springer London"
        },
        {
            "Title": "Dealing with User Privacy in Mobile Apps",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=lOeVDQAAQBAJ&oi=fnd&pg=PA67&dq=info:ZyPVFzXsLZ8J:scholar.google.com&ots=H212z3f4Bs&sig=pn_4YR0WoNFQJ6SAZFn4MbT2hnE",
            "Abstract": "Mobile platforms, such as Android, iOS, and Windows, are gaining more and more relevance within end users’ applications, thanks to their usability, flexibility, and low cost. As a result, mobile Internet traffic is about to overwhelm landline traffic. Mobile platforms do not only provide end users with services similar to legacy computers but also extend their experiences exploiting the additional hardware features (eg, sensors) incorporated in the mobile device, without the need of supplementary devices. Moreover, mobile devices are becoming the sources and repositories of sensitive information, from running performances to positioning data, from travel information to friendship preferences, from personal photos to financial data, and so on. Data loss, modification, or exposure that a mobile device might face, on one hand, could directly impact end users’ safety and privacy, but, on the other hand, they could seriously damage the trust in the rising mobile economy. A typical example of these threats could be the case in which a mobile application that monitors some end user’s body parameters is exploited by an adversary to gain access to sensitive data and infer the end user’s health status. The possible damages caused by this data breach can impact both the psychological and physical spheres of an end user. Although these problems and flaws already existed in the traditional information and communication technologies (ICT) systems, their magnitude increased exponentially in the case of mobile devices due to their stronger link with the owner. Indeed, as already mentioned, mobile devices embed several sensors and functionalities capable of …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:JQOojiI6XY0C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Online recruitment services: another playground for fraudsters",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1361372316300252",
            "Abstract": "It is increasingly common for someone actively seeking a job online to come across appealing but fake ads offering high wages, flexible hours, teleworking and career growth opportunities. Usually, job ads with such favourable conditions are examples of Online Recruitment Fraud (ORF) which attempt to collect unsuspecting candidates’ personal information. ORF is a relatively new field of variable severity that can escalate quickly to extensive scams.Corporate hiring has recently been ported to the cloud. However, this has fuelled a new type of online scam that jeopardises job seekers’ privacy and harms the reputation of organisations.Employment scams share common characteristics with others, such as email spam and phishing, but also have their own peculiarities. Sokratis Vidros and Georgios Kambourakis of the University of the Aegean, Greece and Constantinos Kolias of George Mason University, US …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:VOx2b1Wkg3QC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Hidden in plain sight. sdp-based covert channel for botnet communication",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-22906-5_4",
            "Abstract": "Covert channels pose a significant threat for networking systems. In this paper, we examine the exploitation of Session Description Protocol (SDP) information residing in Session Initiation Protocol (SIP) requests with the aim to hide data in plain sight. While a significant mass of works in the literature cope with covert communication channels, only a very limited number of them rely on SIP to realize its goals. Also, none of them concentrates on SDP data contained in SIP messages to implement and evaluate such a hidden communication channel. Motivated by this fact, the work at hand proposes and demonstrates the feasibility of a simple but very effective in terms of stealthiness and simplicity SIP-based covert channel for botnet Command and Control (C&C). As a side contribution, we assess the soundness and the impact of such a deployment at the victim’s side via the use of two different types of flooding …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:tS2w5q8j5-wC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Privacy Preserving Context Transfer in All-IP Networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73986-9_33",
            "Abstract": "In an all-IP environment, the concept of context transfer is used to provide seamless secure handovers between different administrative domains. However, the utilization of context transfer arises some privacy issues concerning the location and movement of users roaming between domains. In this paper we elaborate on these privacy issues and propose an alternative context transfer protocol that protects user’ location privacy as well. In addition, assuming that the context carries a user identity in the form of a Network Access Identifier (NAI), we show how the employment of temporary NAIs can further increase the privacy of our scheme.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:QIV2ME_5wuYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Inter/intra core network security with PKI for 3G-and-beyond systems",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_2",
            "Abstract": "With a large number of different heterogeneous network technologies (e.g. UMTS, WLAN, HIPERLAN) and operators expected in the future mobile communications environment, that should frequently and seamlessly interwork with each other and a constantly increasing population of communication parties, capturing the full benefits of open channel key transfers and scaling public key methods requires Public Key Infrastructure (PKI). In this paper, we discuss and investigate different ways to take advantage of a proposed PKI system. Focusing on UMTS Release 6 IP multimedia subsystem, we analyze the ongoing 3GPP specifications and its limitations and examine how PKI can provide robust security solutions to both 3G-and-beyond inter/intra core network and the mobile user. Public key security mechanisms to protect operator’s core networks seem to gain ground and protocols like IPsec and SSL …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Privacy-enhanced fast re-authentication for EAP-based next generation network",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366410000964",
            "Abstract": "In next generation networks one of the most challenging issues is the definition of seamless and secure handoffs in order to assure service continuity. In general, researchers agree on the use of EAP as an authentication framework independent of the underlying technology. To date, efforts have focused on optimizing the authentication process itself, leaving out other relevant but sometimes important aspects like privacy. In this paper we present a solution that provides a lightweight authentication process while preserving user anonymity at the same time. The goal is to define a multi-layered pseudonym architecture that does not affect the fast re-authentication procedure and that allows a user to be untraceable. Taking as reference our previous work in fast re-authentication, we describe the extensions required to support identity privacy. Moreover, results collected from an implemented prototype, reveal that the …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Exposing mobile malware from the inside (or what is your mobile app really doing?)",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/article/10.1007/s12083-012-0179-x",
            "Abstract": "It is without a doubt that malware especially designed for modern mobile platforms is rapidly becoming a serious threat. The problem is further multiplexed by the growing convergence of wired, wireless and cellular networks, since virus writers can now develop sophisticated malicious software that is able to migrate across network domains. This is done in an effort to exploit vulnerabilities and services specific to each network. So far, research in dealing with this risk has concentrated on the Android platform and mainly considered static solutions rather than dynamic ones. Compelled by this fact, in this paper, we contribute a fully-fledged tool able to dynamically analyze any iOS software in terms of method invocation (i.e., which API methods the application invokes and under what order), and produce exploitable results that can be used to manually or automatically trace software’s behavior to decide if it …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:ZHo1McVdvXMC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards a secure and reliable VoIP infrastructure",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=13026214788635154989&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A mechanism for ensuring the validity and accuracy of the billing services in IP telephony",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-85735-8_7",
            "Abstract": "The current penetration, but also the huge potential, of Voice over IP (VoIP) telephony services in the market, boosts the competition among telecommunication service providers who promote new services through many different types of offers. However, this transition from the closed Public Switched Telephone Network (PSTN) architecture to the internet based VoIP services, has resulted in the introduction of several threats both intrinsic i.e. VoIP specific, and Internet oriented. In the framework of this paper, we are considering threats that may affect the accuracy and validity of the records of the billing system that the service provider is using for charging the users. We are proposing a simple, practical and effective mechanism for protecting telecommunication service providers and end users from malicious activities originated from the end users and telecommunication service providers respectively. In both …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:3fE2CSJIrl8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Evaluating Security Mechanisms in Different Protocol Layers for Bluetooth Connections",
            "Publication year": 2008,
            "Publication url": "https://www.igi-global.com/chapter/handbook-research-wireless-security/22076",
            "Abstract": "Security is always an important factor in wireless connections. As with all other existing radio technologies, the Bluetooth standard is often cited to suffer from various vulnerabilities and security inefficiencies while attempting to optimize the trade-off between performance and complementary services including security. On the other hand, security protocols like IP secure (IPsec) and secure shell (SSH) provide strong, flexible, low cost, and easy to implement solutions for exchanging data over insecure communication links. However, the employment of such robust security mechanisms in wireless realms enjoins additional research efforts due to several limitations of the radio-based connections, for example, link bandwidth and unreliability. This chapter will evaluate several Bluetooth personal area network (PAN) parameters, including absolute transfer times, link capacity, throughput, and goodput. Experiments shall …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:g5m5HwL7SMYC",
            "Publisher": "IGI-Global"
        },
        {
            "Title": "The devil is in the detail: SDP-driven malformed message attacks and mitigation in SIP ecosystems",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8575131/",
            "Abstract": "VoIP services, in general, and session initiation protocol (SIP) ones, in particular, continue to grow at a fast pace and have already become a key component of next-generation networks. Despite this proliferation, SIP-based services expose a large attack surface for perpetrators, especially those who seek to cause denial of service (DoS). While so far, a plethora of works in the literature have been devoted to the detection of DoS attacks in SIP ecosystems, the focus is on those which exploit SIP headers neglecting the message body. In an effort to fill this gap, this paper concentrates on the detection of DoS attacks, which, instead, capitalize on the session description protocol (SDP) part of SIP requests. To this end, we not only scrutinize this ilk of attacks and demonstrate their effect against the end-user but also develop an open-source extensible SDP parser module capable of detecting intentionally or unintentionally …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:ipzZ9siozwsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The mirai botnet and the iot zombie armies",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8170867/",
            "Abstract": "The rapidly growing presence of Internet of Things (IoT) devices is becoming a continuously alluring playground for malicious actors who try to harness their vast numbers and diverse locations. One of their primary goals is to assemble botnets that can serve their nefarious purposes, ranging from Denial of Service (DoS) to spam and advertisement fraud. The most recent example that highlights the severity of the problem is the Mirai family of malware, which is accountable for a plethora of massive DDoS attacks of unprecedented volume and diversity. The aim of this paper is to offer a comprehensive state-of-the-art review of the IoT botnet landscape and the underlying reasons of its success with a particular focus on Mirai and major similar worms. To this end, we provide extensive details on the internal workings of IoT malware, examine their interrelationships, and elaborate on the possible strategies for defending …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:PR6Y55bgFSsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An extrinsic random-based ensemble approach for android malware detection",
            "Publication year": 2020,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/09540091.2020.1853056",
            "Abstract": "Malware detection is a fundamental task and associated with significant applications in humanities, cybersecurity, and social media analytics. In some of the relevant studies, there is substantial evidence that heterogeneous ensembles can provide very reliable solutions, better than any individual verification model. However, so far, there is no systematic study of examining the application of ensemble methods in this task. This paper introduces a sophisticated Extrinsic Random-based Ensemble (ERBE) method where in a predetermined set of repetitions, a subset of external instances (either malware or benign) as well as classification features are randomly selected, and an aggregation function is adopted to combine the output of all base models for each test case separately. By utilising static analysis only, we demonstrate that the proposed method is capable of taking advantage of the availability of multiple …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:hMsQuOkrut0C",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "A comprehensive cybersecurity learning platform for elementary education",
            "Publication year": 2019,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/19393555.2019.1657527",
            "Abstract": "For elementary students, security and privacy education is anticipated to be more joyful when the knowledge is delivered in the form of a digital game-based learning activity. This paper details on the development of a novel learning platform that comprises a web-based Learning Content Management Systems (LCMS) and a mobile client application (app) for educating and raising young learners’ awareness on basic cybersecurity and privacy issues. The app, which comprises a suite of quick games, can be played either in standalone or in client/server mode and it is especially destined to elementary students. Further, due to the anytime and anywhere characteristics of the app, it can be experienced as a classroom or an outdoor learning activity. Contrary to analogous studies found in the literature so far, during the design phase of the app, our focus was not solely on its technological aspects, but we uniformly paid …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:Z5m8FVwuT1cC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "A Multi-Tier Security Analysis of Official Car Management Apps for Android",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1999-5903/13/3/58",
            "Abstract": "Using automotive smartphone applications (apps) provided by car manufacturers may offer numerous advantages to the vehicle owner, including improved safety, fuel efficiency, anytime monitoring of vehicle data, and timely over-the-air delivery of software updates. On the other hand, the continuous tracking of the vehicle data by such apps may also pose a risk to the car owner, if, say, sensitive pieces of information are leaked to third parties or the app is vulnerable to attacks. This work contributes the first to our knowledge full-fledged security assessment of all the official single-vehicle management apps offered by major car manufacturers who operate in Europe. The apps are scrutinised statically with the purpose of not only identifying surfeits, say, in terms of the permissions requested, but also from a vulnerability assessment viewpoint. On top of that, we run each app to identify possible weak security practices in the owner-to-app registration process. The results reveal a multitude of issues, ranging from an over-claim of sensitive permissions and the use of possibly privacy-invasive API calls, to numerous potentially exploitable CWE and CVE-identified weaknesses and vulnerabilities, the, in some cases, excessive employment of third-party trackers, and a number of other flaws related to the use of third-party software libraries, unsanitised input, and weak user password policies, to mention just a few.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:gsN89kCJA0AC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Advanced SSL/TLS-based authentication for secure WLAN-3G interworking",
            "Publication year": 2004,
            "Publication url": "https://digital-library.theiet.org/content/journals/10.1049/ip-com_20040835",
            "Abstract": "Motivated by the fact that the SSL protocol has proved its effectiveness in wired IP networks, recent research work has examined the potential use of this protocol in various wireless technologies. Although Wi-Fi networks present security deficiencies, they manage to penetrate the wireless market to a great degree due to their low cost, easy administration, great capacity, IP-oriented nature, etc. Considering Wi-Fi networking settings, administrated by different operators, as parts of a common core 3G infrastructure, the author propose the potential application of enhanced SSL-based authentication mechanisms in integrated emerging-3G and Wi-Fi networks. Existing problems related to authentication and key agreement (AKA) procedures and the extensible authentication protocol (EAP)-AKA, as they appear in the latest 3G and integrated 3G/Wi-Fi specifications, are discussed. It is proposed how EAP-TLS, combined …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:YFjsv_pBGBYC",
            "Publisher": "IET Digital Library"
        },
        {
            "Title": "DNSSEC vs. DNSCurve: A side-by-side comparison",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/62383",
            "Abstract": "Without a doubt, Domain Name System (DNS) security is a complicated topic of growing concern. In fact, it can be argued that the whole Internet infrastructure depends on the smooth operation of the DNS service. Despite this fact, the original DNS design concentrated on availability, not security, and thus included no authentication. Nowadays, this security gap has been addressed by two cryptographic mechanisms: DNSSEC and DNSCurve. They both utilize public key cryptography and extend the core DNS protocol. Although the second mechanism is still in its infancy while the first is well-standardized, they are both promising and are quite likely to compete with each other in the near future to gain acceptance. This work aims to provide a comprehensive and constructive comparison between the aforementioned security mechanisms. Towards this direction, the authors theoretically cross-evaluate and assess the …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:TFP_iSt0sucC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Pandora: An SMS-oriented m-informational system for educational realms",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1084804508000672",
            "Abstract": "e-Informational systems based on the Internet infrastructure and services like e-mail, WWW, etc., are a de-facto option for various educational realms, in order to enhance the quality and diversity of services offered to their educators and students. On the other hand, despite the fact that pure mobile services like short message service (SMS) or multimedia message service (MMS) have managed to highly penetrate the wireless market to a great degree and gain users’ wide acceptance, are rarely employed to support or offer informational services in the context of education. In this paper, we describe in detail a fully functional SMS-oriented mobile-informational (m-informational) system named Pandora that was designed and developed from the onset to specifically support a plethora of services obtainable mainly by the students of our university. The analysis and our contribution are two-fold starting from the theoretical …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:0EnyYjriUFMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "KAMU: providing advanced user privacy in Kerberos multi-domain scenarios",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10207-013-0201-1.pdf",
            "Abstract": "In Next Generation Networks, Kerberos is becoming a key component to support authentication and key distribution for Internet application services. However, for this purpose, Kerberos needs to rectify certain deficiencies, especially in the area of privacy, which allow an eavesdropper to obtain information of the services users are accessing. This paper presents a comprehensive privacy framework that guarantees user anonymity, service access unlinkability and message exchange unlinkability in Kerberos both in single-domain and multi-domain scenarios. This proposal is based on different extensibility mechanisms already defined for Kerberos, which facilitate its adoption in already deployed systems. Apart from evaluating our proposal in terms of performance to prove its lightweight nature, we demonstrate its capability to work in perfect harmony with a widely used anonymous communication system like …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:rO6llkc54NcC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Vulnerabilities and Attacks Against Industrial Control Systems and Critical Infrastructures",
            "Publication year": 2021,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2021arXiv210903945M/abstract",
            "Abstract": "Critical infrastructures (CI) and industrial organizations aggressively move towards integrating elements of modern Information Technology (IT) into their monolithic Operational Technology (OT) architectures. Yet, as OT systems progressively become more and more interconnected, they silently have turned into alluring targets for diverse groups of adversaries. Meanwhile, the inherent complexity of these systems, along with their advanced-in-age nature, prevents defenders from fully applying contemporary security controls in a timely manner. Forsooth, the combination of these hindering factors has led to some of the most severe cybersecurity incidents of the past years. This work contributes a full-fledged and up-to-date survey of the most prominent threats against Industrial Control Systems (ICS) along with the communication protocols and devices adopted in these environments. Our study highlights that threats …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:-FonjvnnhkoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cryptographic key management in delay tolerant networks: A survey",
            "Publication year": 2017,
            "Publication url": "https://www.mdpi.com/205488",
            "Abstract": "Since their appearance at the dawn of the second millennium, Delay or Disruption Tolerant Networks (DTNs) have gradually evolved, spurring the development of a variety of methods and protocols for making them more secure and resilient. In this context, perhaps, the most challenging problem to deal with is that of cryptographic key management. To the best of our knowledge, the work at hand is the first to survey the relevant literature and classify the various so far proposed key management approaches in such a restricted and harsh environment. Towards this goal, we have grouped the surveyed key management methods into three major categories depending on whether the particular method copes with (a) security initialization,(b) key establishment, and (c) key revocation. We have attempted to provide a concise but fairly complete evaluation of the proposed up-to-date methods in a generalized way with the aim of offering a central reference point for future research. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:Y5dfb0dijaUC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Android Forensic Data Analyzer (AFDA): An Opensource Tool to Automatize Event Correlation Analysis on Android Devices",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.704.863",
            "Abstract": "Forensic analysis on mobile devices in general and smartphones in particular is on the rise. Naturally, this is because these devices are more than ever used by criminals of all kinds to perform a variety of offensive actions. The mushrooming of mobile services and the way people use their smartphones in their daily activities results in a plethora of valuable and private data stored in the device, which of course can be extremely helpful towards resolving a criminal case. The automatic or semi-automatic correlation of end-user events as recorded in the mobile device can be of great value to the investigator in their struggle to resolve a case. Unfortunately, existing forensic tools targeted to Android lack of such a functionality. To fill this gap, we propose the Android Forensic Data Analyzer (AFDA), a tool that is able to gather end-user’s data stored in critical system areas and then inter-correlate them in terms of a time and location-based series of events. We argue that this type of analysis not only saves time and effort from an investigator’s viewpoint but also can reveal the interrelationship between artifacts providing a more robust and comprehensive approach. 1.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intrusion detection in 802.11 networks: empirical evaluation of threats and a public dataset",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7041170/",
            "Abstract": "Wi-Fi has become the de facto wireless technology for achieving short- to medium-range device connectivity. While early attempts to secure this technology have been proved inadequate in several respects, the current more robust security amendments will inevitably get outperformed in the future, too. In any case, several security vulnerabilities have been spotted in virtually any version of the protocol rendering the integration of external protection mechanisms a necessity. In this context, the contribution of this paper is multifold. First, it gathers, categorizes, thoroughly evaluates the most popular attacks on 802.11 and analyzes their signatures. Second, it offers a publicly available dataset containing a rich blend of normal and attack traffic against 802.11 networks. A quite extensive first-hand evaluation of this dataset using several machine learning algorithms and data features is also provided. Given that to the best …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Privacy preserving context transfer schemes for 4G networks",
            "Publication year": 2011,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/wcm.1019",
            "Abstract": "In the near future, wireless heterogeneous networks are expected to interconnect in an all‐IP architecture. An open issue towards this direction is the uninterrupted continuation of the received services during handover between networks employing different access technologies. In this context, Mobile IP (MIP) is a protocol that allows fast and secure handovers. However, MIP per se cannot handle all the issues that surface during handovers in certain services, and more specifically, when the information of the current state of a service requires re‐establishment on the new subnet without having to repeat the entire protocol exchange with the mobile host from the outset. A number of methods have been proposed to solve the aforementioned problem, commonly referred to as secure context transfer. However, while such methods do succeed in minimising the disruption caused by security‐related delays, it seems that …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:mVmsd5A6BfQC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Security and privacy in unified communications: Challenges and solutions",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=9398636944897041688&hl=en&oi=scholarr",
            "Abstract": "前瞻性雲端安全動態防護, 應用, 與風險評估---子計畫二: 高效率安全可靠雲端資料完整性檢測與授權使用---以醫療資料為例/曾文貴; TZENG WEN-GUEY",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mobile application security",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6838873/",
            "Abstract": "With a multitude of mobile apps available in the market, most users are unaware of the security risks they bring. Strategies for coping with the diversity of these threats deserve a closer look.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Novel Protecting Mechanism for SIP-Based Infrastructure against Malformed Message Attacks: Performance Evaluation Study",
            "Publication year": 2006,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.714.9564&rep=rep1&type=pdf",
            "Abstract": "This paper presents a novel mechanism to protect Session Initiation Protocol (SIP)-based infrastructure against malformed message attacks. The basic characteristics of this mechanism are the following: lightweight and easy to adapt to various SIP implementations. The proposed mechanism has been evaluated in terms of overhead processing. It is demonstrated that the employment of appropriate IDS against malformed impose minimum overhead in terms of events’ processing",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:2P1L_qKh6hAC",
            "Publisher": "CSNDSP"
        },
        {
            "Title": "Revisiting WiMAX MBS security",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0898122110000052",
            "Abstract": "IEEE 802.16 technology also well known as WiMax is poised to deliver the next step in the wireless evolution. This is further fostered by the 802.16e specification which, amongst other things, introduces support for mobility. The Multicast/Broadcast Service (MBS) is also an integral part of 802.16e destined to deliver next generation services to subscribers. In this paper we concentrate on the Multicast and Broadcast Rekeying Algorithm (MBRA) of 802.16e. This algorithm has been recently criticized for various vulnerabilities and security inefficiencies, as its designers are trying to balance wisely between performance and security. After surveying related work, we extensively discuss MBRA security issues and propose the use of a novel asymmetric group key agreement protocol based on the work in Wu et al. (2009) [3]. Our scheme guarantees secure delivery of keys to all the members of a given group and mandates …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:HDshCWvjkbEC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Enabling the provision of secure web based m‐health services utilizing XML based security models",
            "Publication year": 2008,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.46",
            "Abstract": "It has been generally agreed that the security of electronic patient records and generally e‐health applications must meet or exceed the standard security that should be applied to paper medical records, yet the absence of clarity on the proper goals of protection has led to confusion. The primary purpose of this study was to investigate appropriate security mechanisms, which will help clinical professionals and patients discharge their ethical and legal responsibilities by selecting suitable systems and operating them safely and in short order. Thus, in this paper we propose a security model based on XML with the intention of developing a fast security policy mostly intended for mobile healthcare information systems. The proposed schema consists of a set of principles based on XML security models through the use of partial encryption, signature and integrity services and it was implemented by means of a web …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:RGFaLdJalmkC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Introducing PKI to enhance security in future mobile networks",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35691-4_10",
            "Abstract": "Current wireless network standards perform user authentication, signaling and data encryption, as well as message integrity protection, by utilizing only symmetric key methods. However, as mobile networks are evolving into full-IP and the communication is envisaged to change from second generation (2G) person-to-person model to fourth generation (4G) machine-to-machine model, there is greater demand to provide more flexible, reconfigurahle and scalable security mechanisms that can advance in a many-to-many trust relationship model. Employing public key methods in many-to-many schemes drops the requirement for a secure channel to transfer keys between two communication parties, thus providing the appropriate scalability to the whole system. With a large number of different network technologies and operators, expected in the future mobile communications environment, that should …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:WF5omc3nYNoC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "SIPA: generic and secure accounting for SIP",
            "Publication year": 2012,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sec.387",
            "Abstract": "Authentication, authorization, and accounting services provide the framework on top of which a reliable, secure, and robust accounting system can be built. In a previous work of ours, we have presented a flexible and, most importantly, generic accounting scheme for next generation networks. In this paper, we substantially improve our previous work by providing the required Diameter application namely SIP‐Accounting (SIPA) that enables the use of our accounting scheme for Session Initiation Protocol (SIP) services. Additionally, in an effort to protect the service providers and the end users against accounting frauds, we implement an add‐on mechanism referred to as SIPA+ to combat attacks targeting the core accounting functions and the integrity of the respective accounting messages. Using the implemented SIPA and SIPA+ prototypes, we conducted a complete set of experiments testing several configurations …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:RHpTSmoSYBkC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Detecting DNS amplification attacks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-89173-4_16",
            "Abstract": "DNS amplification attacks massively exploit open recursive DNS servers mainly for performing bandwidth consumption DDoS attacks. The amplification effect lies in the fact that DNS response messages may be substantially larger than DNS query messages. In this paper, we present and evaluate a novel and practical method that is able to distinguish between authentic and bogus DNS replies. The proposed scheme can effectively protect local DNS servers acting both proactively and reactively. Our analysis and the corresponding real-usage experimental results demonstrate that the proposed scheme offers a flexible, robust and effective solution.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A generic accounting scheme for next generation networks",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912860900156X",
            "Abstract": "Accounting is generally considered as one of the most challenging issues in modern and future mobile networks. As multi-domain complex heterogeneous environments are becoming a common terrain, accounting procedures performed by network and service providers have turned into a key aspect. However, in order for these networks to reliably deliver modern real-time services, they should, among other things, provide accurate accounting services, particularly billing. This work elaborates on the accounting process, proposing a novel and robust accounting system. The requirements of the proposed mechanism are defined and all the accounting scenarios that the system should cope with are examined. All the proposed accounting extensions are implemented by means of Diameter AVPs and commands. Our mechanism is generic and capitalizes on the existing AAA infrastructure, thus providing secure means …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:4TOpqqG69KYC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AISGA: Multi-objective parameters optimization for countermeasures selection through genetic algorithm",
            "Publication year": 2021,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3465481.3470074",
            "Abstract": "Cyberattacks targeting modern network infrastructures are increasing in number and impact. This growing phenomenon emphasizes the central role of cybersecurity and, in particular, the reaction against ongoing threats targeting assets within the protected system. Such centrality is reflected in the literature, where several works have been presented to propose full-fledged reaction methodologies to tackle offensive incidents’ consequences. In this direction, the work in [18] developed an immuno-based response approach based on the application of the Artificial Immune System (AIS) methodology. That is, the AIS-powered reaction is able to calculate the optimal set of atomic countermeasure to enforce on the asset within the monitored system, minimizing the risk to which those are exposed in a more than adequate time. To further contribute to this line, the paper at hand presents AISGA, a multi-objective approach …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cybertrust in the iot age",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8423128/",
            "Abstract": "Will our smart devices betray us? Can we trust our smart beds, pet feeders, and watches to maintain the level of privacy we want and expect? As the numbers of devices coming online reach staggering levels, serious questions must be raised about the level of cybertrust we can reasonably expect to have in our modern lifestyle.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:t7zJ5fGR-2UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special issue on Security, Privacy and Trust in network-based Big Data",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.ins.2015.05.040",
            "Abstract": "Special issue on Security, Privacy and Trust in network-based Big Data | Information Sciences: \nan International Journal ACM Digital Library home ACM home Google, Inc. (search) Advanced \nSearch Browse About Sign in Register Advanced Search Journals Magazines Proceedings \nBooks SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced \nSearch Information Sciences: an International Journal Periodical Home Latest Issue Archive \nAuthors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsInformation Sciences: \nan International JournalVol. , No. CSpecial issue on Security, Privacy and Trust in network-based \nBig Data research-article Special issue on Security, Privacy and Trust in network-based Big \nData Share on Authors: Hua Wang profile image Hua Wang Centre for Applied Informatics, \nCollege of Engineering and Science, Victoria University, Australia Centre for , of , …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:08ZZubdj9fEC",
            "Publisher": "Elsevier Science Inc."
        },
        {
            "Title": "Botnets: Architectures, Countermeasures, and Challenges",
            "Publication year": 2019,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=rcO2DwAAQBAJ&oi=fnd&pg=PP1&dq=info:rPXzpOy7oNcJ:scholar.google.com&ots=E4RDXu_0Pj&sig=KVF5e8KF-iXLnADTZUnP3c1oExU",
            "Abstract": "This book provides solid, state-of-the-art contributions from both scientists and practitioners working on botnet detection and analysis, including botnet economics. It presents original theoretical and empirical chapters dealing with both offensive and defensive aspects in this field. Chapters address fundamental theory, current trends and techniques for evading detection, as well as practical experiences concerning detection and defensive strategies for the botnet ecosystem, and include surveys, simulations, practical results, and case studies.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:AvfA0Oy_GE0C",
            "Publisher": "CRC Press"
        },
        {
            "Title": "Introducing attribute certificates to secure distributed E-learning or M-learning services",
            "Publication year": 2004,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kambourakis/publication/228713176_Introducing_attribute_certificates_to_secure_distributed_E-learning_or_M-learning_services/links/0deec520b57166cbd8000000/Introducing-attribute-certificates-to-secure-distributed-E-learning-or-M-learning-services.pdf",
            "Abstract": "Motivating by the fact that public key cryptography is continuously evolving and its installed base is growing singniffically, very recent research works examine the potential use of it in eLearning or mLearning services. Attribute or temporary Certificates (ACs) seconded by Public Key Infrastructure (PKI) can provide the appropriate framework to secure distributed interactive eLearning applications, offering mutual “trust” to both learners and service providers. Considering PKI requirements for eLearning networks, the paper discusses the potential application of ACs in a proposed trust model. In the concept of that model, typical eLearning trusts interactions between eLearners and providers are presented, which demonstrate that robust security mechanisms and effective trust control can be obtained and implemented. The application of ACs to support mLearning are also presented and evaluated through an experimental test bed setup.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "OnionSIP: Preserving Privacy in SIP with Onion Routing.",
            "Publication year": 2017,
            "Publication url": "http://jucs.org/jucs_23_10/onion_sip_preserving_privacy/jucs_23_10_0969_0991_fakis.pdf",
            "Abstract": "While more and more users turn to IP-based communication technologies, privacy and anonymity remain largely open issues. One of the most prominent VoIP protocols for multimedia session management is SIP which, despite its popularity, suffers from security and privacy flaws. As SIP messages are sent in plain text, user data are exposed to intermediate proxies and eavesdroppers. As a result, information about users participating in a call can leak from header data, which cannot be omitted since they are needed for the correct routing of SIP messages to their final destination. Even more, traffic analysis attacks can be mounted with data stemming from lower layers. To redress this kind of problems, privacy can be achieved either by the construction of a lower level tunnel (via the use of SSL or IPsec protocols) or by employing a customtailored solution. However, SSL and IPsec are known for leading to undesirable …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:LjlpjdlvIbIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure mobility in future communication systems under standardization",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.csi.2013.12.002",
            "Abstract": "Editorial: Secure mobility in future communication systems under standardization: Computer \nStandards & Interfaces: Vol 36, No 3 ACM Digital Library home ACM home Google, Inc. (search) \nAdvanced Search Browse About Sign in Register Advanced Search Journals Magazines \nProceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch \nAdvanced Search Computer Standards & Interfaces Periodical Home Latest Issue Archive \nAuthors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsComputer Standards \n& InterfacesVol. , No. Editorial: Secure mobility in future communication systems under \nstandardization article Editorial: Secure mobility in future communication systems under \nstandardization Share on Authors: Georgios Kambourakis profile image Georgios Kambourakis \nDept. of Information and Communication Systems Engineering, University of the Aegean, Dept(…",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:EUQCXRtRnyEC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Special issue on advances in security and privacy for future mobile communications",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10660-015-9179-2",
            "Abstract": "Recent advances in wireless communication technologies along with a proliferation of mobile devices have enabled a new, and expanded level of ubiquitous access to data and communications. Reliable, secure, and private communications are as essential in these product offerings as network availability, especially as the Internet presents enhanced opportunities for network breaches. Every day new security challenges surface, often a consequence of weak encryption and inherently open access to networks and in some cases lack of a pre-deployed infrastructure. This special issue advances the state-of-the-art research in the area of security, privacy, cryptography, and its applications to future mobile communications. Our special issue emphasizes potential contributions to security and privacy preserving applications and services in the mobile ecosystem. It contains seven papers, in print and online release …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:uWQEDVKXjbEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Towards Effective SIP load balancing: the SNOCER approach",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=2145756397250906857&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using SSL/TLS in authentication and key agreement procedures of future mobile networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1045713/",
            "Abstract": "Existing security schemes in 2G and 3G systems are inadequate, as there is a greater demand to provide a more flexible, reconfigurable and scalable security mechanism that can advance as fast as mobile hosts are evolving into full-IP enabled devices. Work has already begun on such an \"all-IP\" end-to-end solution, commonly referred to as 4G systems. Fully-fledged integration between mobile networks and the Internet demands fully compatible, time-tested and reliable mechanisms to depend on. SSL/TLS protocol has proved its effectiveness in wired Internet and it will probably be the most promising candidate for future wireless environments. We discuss existing problems related to authentication and key agreement procedures (AKA), such as compromised authentication vectors attacks, as they appear in 2G and 3G systems, and propose how SSL/TLS can be used to overcome these inefficiencies. Further on …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A pervasive Wiki application based on VoiceXML",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1389586.1389656",
            "Abstract": "In this paper, we describe the design and implementation of an audio wiki application accessible via the Public Switched Telephone Network (PSTN) and the Internet for educational purposes. The application exploits mature World Wide Web Consortium standards such as VoiceXML, Speech Synthesis Markup Language (SSML) and Speech Recognition Grammar Specification (SRGS). The purpose of such an application is to assist visually impaired, technologically uneducated, and underprivileged people in accessing information originally intended to be accessed visually via a Personal Computer. Users may access wiki content via wired or mobile phones, or via a Personal Computer using a Web Browser or a Voice over IP service. This feature promotes pervasiveness to educational material to an extremely large population, ie those who simply own a telephone line.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A framework for protecting a SIP-based infrastructure against malformed message attacks",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128606003458",
            "Abstract": "This paper presents a framework that can be utilized for the protection of session initiation protocol (SIP)-based infrastructures from malformed message attacks. Its main characteristic is that it is lightweight and that it can be easily adapted to heterogeneous SIP implementations. The paper analyzes several real-life attacks on VoIP services and proposes a novel detection and protection mechanism that is validated through an experimental test-bed under different test scenarios. Furthermore, it is demonstrated that the employment of such a mechanism for the detection of malformed messages imposes negligible overheads in terms of the overall SIP system performance.",
            "Abstract entirety": 1,
            "Author pub id": "LJz0vqQaztcC:epqYDVWIO7EC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Security, privacy, and trust on internet of things",
            "Publication year": 2019,
            "Publication url": "https://www.hindawi.com/journals/wcmc/2019/6452157/",
            "Abstract": "The ability of smart objects to stay connected to the Internet for purposes of transmitting and receiving data is referred to as the Internet of Things (IoT). As per recent estimates, the number of IoT devices will surpass 50 billion by 2020. Unsurprisingly, this mushrooming of IoT devices has drawn the attention of attackers who seek to exploit them for their own benefit, with the Mirai botnet being perhaps the most prominent example of IoT specific malware [1, 2]. Basically, IoT brings along a plethora of potential security and privacy risks to the end-users, including the unsanctioned access and abuse of private information, the enabling and strengthening of assaults against other systems, and the breeding of risks pertaining to personal safeness [3]. Especially, IoT facilitates the creation of an assortment of privacy risks to the consumer associated with the collection of personal and sensitive information, like their preferences, locations, habits, and so on. In the mid-or long-run these pieces of data can be used to, say, profile or impersonate the user or group of interest. On the other hand, such risks to security, privacy, and trust may significantly diminish end-user’s confidence in IoT and therefore impede its full realization. The feature topic at hand intends to promote the dissemination of the latest methodologies, solutions, and case studies pertaining to IoT security, privacy, and trust issues. Its objective is to publish high-quality articles presenting security algorithms, protocols, policies, frameworks, and solutions for the IoT ecosystem. The goal of this special issue was to attract high-quality contributions from researchers working in the broad area of security …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:zLWjf1WUPmwC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "A critical review of 7 years of Mobile Device Forensics",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1742287613001096",
            "Abstract": "Mobile Device Forensics (MF) is an interdisciplinary field consisting of techniques applied to a wide range of computing devices, including smartphones and satellite navigation systems. Over the last few years, a significant amount of research has been conducted, concerning various mobile device platforms, data acquisition schemes, and information extraction methods. This work provides a comprehensive overview of the field, by presenting a detailed assessment of the actions and methodologies taken throughout the last seven years. A multilevel chronological categorization of the most significant studies is given in order to provide a quick but complete way of observing the trends within the field. This categorization chart also serves as an analytic progress report, with regards to the evolution of MF. Moreover, since standardization efforts in this area are still in their infancy, this synopsis of research helps set the …",
            "Abstract entirety": 0,
            "Author pub id": "LJz0vqQaztcC:D03iK_w7-QYC",
            "Publisher": "Elsevier"
        }
    ]
}]