[{
    "name": "Γεώργιος Παλιούρας",
    "romanize name": "Georgios Paliouras",
    "School-Department": "Ιντστιτούτο Πληροφορικής και Τηλεπικοινωνιών",
    "University": "demokritos",
    "Rank": "Διευθυντής Ερευνών",
    "Apella_id": 17659,
    "Scholar name": "Georgios Paliouras",
    "Scholar id": "-pec7wIAAAAJ",
    "Affiliation": "National Center for Scientific Research \"Demokritos\", Athens, Greece",
    "Citedby": 8594,
    "Interests": [
        "Artificial Intelligence",
        "Machine Learning",
        "Data Mining",
        "Knowledge Discovery",
        "Information Retrieval"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=-pec7wIAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Tensor factorization with label information for fake news detection",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1908.03957",
            "Abstract": "The buzz over the so-called \"fake news\" has created concerns about a degenerated media environment and led to the need for technological solutions. As the detection of fake news is increasingly considered a technological problem, it has attracted considerable research. Most of these studies primarily focus on utilizing information extracted from textual news content. In contrast, we focus on detecting fake news solely based on structural information of social networks. We suggest that the underlying network connections of users that share fake news are discriminative enough to support the detection of fake news. Thereupon, we model each post as a network of friendship interactions and represent a collection of posts as a multidimensional tensor. Taking into account the available labeled data, we propose a tensor factorization method which associates the class labels of data samples with their latent representations. Specifically, we combine a classification error term with the standard factorization in a unified optimization process. Results on real-world datasets demonstrate that our proposed method is competitive against state-of-the-art methods by implementing an arguably simpler approach.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:tH6gc1N1XXoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Complex Event Forecasting with Prediction Suffix Trees: Extended Technical Report",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2109.00287",
            "Abstract": "Complex Event Recognition (CER) systems have become popular in the past two decades due to their ability to \"instantly\" detect patterns on real-time streams of events. However, there is a lack of methods for forecasting when a pattern might occur before such an occurrence is actually detected by a CER engine. We present a formal framework that attempts to address the issue of Complex Event Forecasting (CEF). Our framework combines two formalisms: a) symbolic automata which are used to encode complex event patterns; and b) prediction suffix trees which can provide a succinct probabilistic description of an automaton's behavior. We compare our proposed approach against state-of-the-art methods and show its advantage in terms of accuracy and efficiency. In particular, prediction suffix trees, being variable-order Markov models, have the ability to capture long-term dependencies in a stream by remembering only those past sequences that are informative enough. Our experimental results demonstrate the benefits, in terms of accuracy, of being able to capture such long-term dependencies. This is achieved by increasing the order of our model beyond what is possible with full-order Markov models that need to perform an exhaustive enumeration of all possible past sequences of a given order. We also discuss extensively how CEF solutions should be best evaluated on the quality of their forecasts.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:owLR8QvbtFgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Combining Information Extraction Systems Using Voting and Stacked Generalization.",
            "Publication year": 2005,
            "Publication url": "https://www.jmlr.org/papers/volume6/sigletos05a/sigletos05a.pdf",
            "Abstract": "This article investigates the effectiveness of voting and stacked generalization-also known as stacking-in the context of information extraction (IE). A new stacking framework is proposed that accommodates well-known approaches for IE. The key idea is to perform cross-validation on the base-level data set, which consists of text documents annotated with relevant information, in order to create a meta-level data set that consists of feature vectors. A classifier is then trained using the new vectors. Therefore, base-level IE systems are combined with a common classifier at the metalevel. Various voting schemes are presented for comparing against stacking in various IE domains. Well known IE systems are employed at the base-level, together with a variety of classifiers at the meta-level. Results show that both voting and stacking work better when relying on probabilistic estimates by the base-level systems. Voting proved to be effective in most domains in the experiments. Stacking, on the other hand, proved to be consistently effective over all domains, doing comparably or better than voting and always better than the best base-level systems. Particular emphasis is also given to explaining the results obtained by voting and stacking at the meta-level, with respect to the varying degree of similarity in the output of the base-level systems.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:aqlVkmm33-oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "LangAware: A robust ML based platform for the quick and accurate assessment of neurodegenerative diseases",
            "Publication year": 2020,
            "Publication url": "https://alz.confex.com/alz/20amsterdam/meetingapp.cgi/Paper/45099",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:buQ7SEKw-1sC",
            "Publisher": "ALZ"
        },
        {
            "Title": "Towards human activity reasoning with computational logic and deep learning",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201051",
            "Abstract": "We approach the problem of human action recognition in videos by distinguishing between simple and complex actions. To recognize simple actions, we take advantage of the latest advances with 3D convolutional networks, which are able to offer a generic video snippet descriptor. For the complex ones, which involve interaction between more than one individual, we use the recognized simple human actions of the previous step to generate Event Calculus theories. This way, we aim to achieve a high-level human action understanding, combining the opaque effectiveness of deep learning and the transparent reasoning of computational logic. Our experimental results on a benchmark activity recognition dataset encourage further research towards this direction.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:fFSKOagxvKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Similarity-based user identification across social networks",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24261-3_14",
            "Abstract": "In this paper we study the identifiability of users across social networks, with a trainable combination of different similarity metrics. This application is becoming particularly interesting as the number and variety of social networks increase and the presence of individuals in multiple networks is becoming commonplace. Motivated by the need to verify information that appears in social networks, as addressed by the research project REVEAL, the presence of individuals in different networks provides an interesting opportunity: we can use information from one network to verify information that appears in another. In order to achieve this, we need to identify users across networks. We approach this problem by a combination of similarity measures that take into account the users’ affiliation, location, professional interests and past experience, as stated in the different networks. We experimented with a variety of …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:kuK5TVdYjLIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Demonstration of a Prototype for Credit Card Fraud Management",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3093742.3095096",
            "Abstract": "Credit card fraud management is accomplished most of the times through an automated process. However, there are occasions when machines cannot evaluate the outcome of a given case with enough confidence, and therefore, human domain expertise must be used to settle those transactions. This demo paper presents the two dashboards developed for the European project SPEEDD, which have the goal to provide a better detection tool for fraud analysts, focusing mostly on fraud flagging reasons, visual display of the information, and usage of context and correlation between transactions, to help successfully closing fraud cases.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:4hFrxpcac9AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling web navigation using grammatical inference",
            "Publication year": 2008,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/08839510701853267",
            "Abstract": "In this article, a method that models user navigation on the web, as opposed to a single website, is presented, aiming to assist the user by recommending pages. User modeling is done through data mining of web usage logs, resulting in aggregate, rather than personal models. The proposed approach extends grammatical inference methods by introducing an extra merging criterion, which examines the semantic similarity of automaton states. The experimental results showed that the method does indeed facilitate the modeling of web navigation, which was not possible with the existing web usage mining methods. However, a content-based recommendation model is shown to still outperform the proposed method, which suggests that the knowledge of the navigation sequence does not contribute to the recommendation process. This is due to the thematic cohesion of navigation sessions, in comparison to the large …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "An exploratory analysis of news trends on twitter",
            "Publication year": 2016,
            "Publication url": "https://users.iit.demokritos.gr/~ggianna/Publications/NLPMJ-2016_paper_17.pdf",
            "Abstract": "Analyzing social media data can be a rich supplement to the traditional reporting tools of interviews and observation. In this work we proposed a framework for analyzing and exploring twitter streams, by fusing information about the influence of the users, the topics of discussion, the relations and cooccurrences of the named entities. The framework offers expressive visualization tools, enabling users to draw useful conclusions about the data.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:OTTXONDVkokC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning to Filter Unsolicited CommercialE-Mail. NCSR «Demokritos»",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=9300787929343537742&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "Tech. Report"
        },
        {
            "Title": "Overview of BioASQ 2021: The Ninth BioASQ Challenge on Large-Scale Biomedical Semantic Indexing and Question Answering",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-85251-1_18",
            "Abstract": "Advancing the state-of-the-art in large-scale biomedical semantic indexing and question answering is the main focus of the BioASQ challenge. BioASQ organizes respective tasks where different teams develop systems that are evaluated on the same benchmark datasets that represent the real information needs of experts in the biomedical domain. This paper presents an overview of the ninth edition of the BioASQ challenge in the context of the Conference and Labs of the Evaluation Forum (CLEF) 2021. In this year, a new question answering task, named Synergy, is introduced to support researchers studying the COVID-19 disease and measure the ability of the participating teams to discern information while the problem is still developing. In total, 42 teams with more than 170 systems were registered to participate in the four tasks of the challenge. The evaluation results, similarly to previous years, show …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:ALROH1vI_8AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "User Modeling 2007: 11th International Conference, UM 2007, Corfu, Greece, July 25-29, 2007. Proceedings",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=10834780230652712425&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:S16KYo8Pm5AC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "Splice site recognition using transfer learning",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_27",
            "Abstract": "In this work, we consider a transfer learning approach based on K-means for splice site recognition. We use different representations for the sequences, based on n-gram graphs. In addition, a novel representation based on the secondary structure of the sequences is proposed. We evaluate our approach on genomic sequence data from model organisms of varying evolutionary distance. The first obtained results indicate that the proposed representations are promising for the problem of splice site recognition.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Incremental event calculus for run-time reasoning",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3328905.3329504",
            "Abstract": "We present a system for online, incremental composite event recognition. In streaming environments, the usual case is for data to arrive with a (variable) delay from, and to be retracted/revised by the underlying sources. We propose RTECinc, an incremental version of RTEC, a composite event recognition engine with a formal, declarative semantics, that has been shown to scale to several real-world data streams. RTEC deals with delayed arrival and retraction of events by computing at each query time composite event intervals from scratch. This often results to redundant computations. Instead, RTECinc deals with delays and retractions in a more efficient way, by updating only the affected events. We evaluate RTECinc theoretically, presenting a complexity analysis, and show the conditions in which it outperforms RTEC. Moreover, we compare RTECinc and RTEC experimentally using two real-world datasets. The …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:u-coK7KVo8oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodology for enriching a multi-lingual domain ontology using machine learning",
            "Publication year": 2003,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/ICGL2003.pdf",
            "Abstract": "Ontologies accumulate and organize knowledge in a machine-processable and human-readable way providing a common understanding basis. Enriching a multilingual ontology is crucial for the success of many knowledge-based systems. We present an iterative ontology-driven methodology that enriches a multi-lingual domain ontology with new instances, exploiting machine learning techniques. The methodology is user-centered and aims to ease the task of ontology maintenance. Our first experiments show the strong dependency between the size of the initial ontology and the performance of the machine learning-based method.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:lSLTfruPkqcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparison of computational learning methods on a diagnostic cytological application",
            "Publication year": 2001,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/EUNITE2001.pdf",
            "Abstract": "In this paper we perform a comparative evaluation of four different computational learning methods on a problem of diagnostic cytology and more specifically on the classification of gastric cells. The methods considered are: Decision Tree Induction, Boosted Decision Trees, Naive Bayesian Classifier, and Radial Basis Function Neural Networks. The performance of each method was assessed on unseen data. Our aim was not to evaluate the quality of the algorithms as such, but to examine which of them are suitable for the specific medical diagnosis task, in order to provide a reliable diagnostic tool to the doctors involved in the area. We compare the performance of the four methods and discuss the results taking into account the characteristics of the methods and the task examined. The dataset that was used in this paper is publicly available, facilitating reproducibility of the results and providing a basis of comparison for future work.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event recognition for assisted independent living",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2504335.2504361",
            "Abstract": "We present the application of a recently proposed probabilistic logical formalism, on the task of sensor data fusion in the USEFIL project. USEFIL seeks to extract valuable knowledge concerning the well-being of elderly people by combining information coming from low-cost, unobtrusive monitoring devices. The approach we adopt to device its data fusion component is based on the Event Calculus and the stochastic logic programming language ProbLog and aims towards constructing a semantic representation of the received data, usable by a Decision Support System that will assist elderly people in their every day activities and will provide to doctors, relatives and carers insights on the user's behaviour and health.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:-_dYPAW6P2MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning decision trees for named-entity recognition and classification",
            "Publication year": 2000,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.381.4460&rep=rep1&type=pdf",
            "Abstract": "1 We propose the use of decision tree induction as a solution to the problem of customising a named-entity recognition and classification (NERC) system to a specific domain. A NERC system assigns semantic tags to phrases that correspond to named entities, eg persons, locations and organisations. Typically, such a system makes use of two language resources: a recognition grammar and a lexicon of known names, classified by the corresponding named-entity types. NERC systems have been shown to achieve good results when the domain of application is very specific. However, the construction of the grammar and the lexicon for a new domain is a hard and time-consuming process. We propose the use of decision trees as NERC “grammars” and the construction of these trees using machine learning. In order to validate our approach, we tested C4. 5 on the identification of person and organisation names involved in management succession events, using data from the sixth Message Understanding Conference. The results of the evaluation are very encouraging showing that the induced tree can outperform a grammar that was constructed manually.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Results of the BioASQ tasks of the Question Answering Lab at CLEF 2015",
            "Publication year": 2015,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-01240400/",
            "Abstract": "The goal of the BioASQ challenge is to push research towards highly precise biomedical information access systems. We aim to promote systems and approaches that are able to deal with the whole diversity of the Web, especially for, but not restricted to, the context of bio-medicine. The third challenge consisted of two tasks: semantic indexing and question answering. 59 systems by 18 different teams participated in the semantic indexing task (Task 3a). The question answering task was further subdivided into two phases. 24 systems from 9 different teams participates in the annotation phase (Task 3b-phase A), while 26 systems of 10 different teams participated in the answer generation phase (Task 3b-phase B). Overall, the best systems were able to outperform the strong baselines provided by the organizers. In this paper, we present the data used during the challenge as well as the technologies which were used by the participants.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "BioASQ at CLEF2020: Large-scale biomedical semantic indexing and question answering",
            "Publication year": 2020,
            "Publication url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7148078/",
            "Abstract": "This paper describes the eighth edition of the BioASQ Challenge, which will run as an evaluation Lab in the context of CLEF2020. The aim of BioASQ is the promotion of systems and methods for highly precise biomedical information access. This is done through the organization of a series of challenges (shared tasks) on large-scale biomedical semantic indexing and question answering, where different teams develop systems that compete on the same demanding benchmark datasets that represent the real information needs of biomedical experts. In order to facilitate this information finding process, the BioASQ challenge introduced two complementary tasks:(a) the automated indexing of large volumes of unlabelled data, primarily scientific articles, with biomedical concepts,(b) the processing of biomedical questions and the generation of comprehensible answers. Rewarding the most competitive systems that …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:QD3KBmkZPeQC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "E-grids: Computationally efficient grammatical inference from positive examples",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.132.5901&rep=rep1&type=pdf",
            "Abstract": "In this paper we present a new computationally efficient algorithm for inducing context-free grammars that is able to learn from positive sample sentences. This new algorithm uses simplicity as a criterion for directing inference, and the search process of the new algorithm has been optimised by utilising the results of a theoretical analysis regarding the behaviour and complexity of the search operators. Evaluation results are presented on artificially generated data, while the scalability of the algorithm is tested on a large textual corpus. These results show that the new algorithm performs well and can infer grammars from large data sets in a reasonable amount of time.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event Processing for Intelligent Resource Management",
            "Publication year": 2012,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/7112",
            "Abstract": "The need for intelligent resource management (IRM) spans across a multitude of applications. To address this requirement, we present EP-IRM, an event processing system recognising composite events given multiple sources of information in order to support IRM. EP-IRM has been deployed in two real-world applications. Moreover, with a small effort it may be used in a wide range of applications requiring IRM. We present an evaluation of the system, and discuss the lessons learnt during its development and deployment.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:AXPGKjj_ei8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ELS: a word-level method for entity-level sentiment analysis",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1988688.1988703",
            "Abstract": "We introduce ELS, a new method for entity-level sentiment classification using sequence modeling by Conditional Random Fields (CRF). The CRF is trained to identify the sentiment of each word in a document, which is then used to determine the sentiment for the entity, based on where it appears in the text. Due to its sequential nature, the CRF classifier performs better than the common bag-of-words approaches, especially when we target the local sentiment in small parts of a larger document. Identifying the sentiment about a specific entity, mentioned in a blog post or a larger product review, is a special case of such local sentiment classification. Furthermore, the proposed approach performs well even in short pieces of text, where bag-of-words approaches usually fail, due to the sparseness of the resulting feature vector. We have implemented and tested the proposed method on a publicly available benchmark …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:eQOLeE2rZwMC",
            "Publisher": "ACM"
        },
        {
            "Title": "Semi-automated ontology learning: the BOEMIE approach",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Probabilistic complex event recognition: A survey",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3117809",
            "Abstract": "Complex event recognition (CER) applications exhibit various types of uncertainty, ranging from incomplete and erroneous data streams to imperfect complex event patterns. We review CER techniques that handle, to some extent, uncertainty. We examine techniques based on automata, probabilistic graphical models, and first-order logic, which are the most common ones, and approaches based on Petri nets and grammars, which are less frequently used. Several limitations are identified with respect to the employed languages, their probabilistic models, and their performance, as compared to the purely deterministic cases. Based on those limitations, we highlight promising directions for future work.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:GtLg2Ama23sC",
            "Publisher": "ACM"
        },
        {
            "Title": "Personalizing web directories with the aid of web usage data",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5184842/",
            "Abstract": "This paper presents a knowledge discovery framework for the construction of Community Web Directories, a concept that we introduced in our recent work, applying personalization to Web directories. In this context, the Web directory is viewed as a thematic hierarchy and personalization is realized by constructing user community models on the basis of usage data. In contrast to most of the work on Web usage mining, the usage data that are analyzed here correspond to user navigation throughout the Web, rather than a particular Web site, exhibiting as a result a high degree of thematic diversity. For modeling the user communities, we introduce a novel methodology that combines the users' browsing behavior with thematic information from the Web directories. Following this methodology, we enhance the clustering and probabilistic approaches presented in previous work and also present a new algorithm that …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "LANGaware: Introducing the Right solution for the Early Detection of Neurodegenerative diseases and Psychiatric Diseases",
            "Publication year": 2021,
            "Publication url": "https://alz.confex.com/alz/2021/meetingapp.cgi/Paper/52941",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:prdVHNxh-e8C",
            "Publisher": "ALZ"
        },
        {
            "Title": "Predicting the evolution of communities with online inductive logic programming",
            "Publication year": 2018,
            "Publication url": "https://drops.dagstuhl.de/opus/volltexte/2018/9769/",
            "Abstract": "In the recent years research on dynamic social network has increased, which is also due to the availability of data sets from streaming media. Modeling a network's dynamic behaviour can be performed at the level of communities, which represent their mesoscale structure. Communities arise as a result of user to user interaction. In the current work we aim to predict the evolution of communities, ie to predict their future form. While this problem has been studied in the past as a supervised learning problem with a variety of classifiers, the problem is that the\" knowledge\" of a classifier is opaque and consequently incomprehensible to a human. Thus we have employed first order logic, and in particular the event calculus to represent the communities and their evolution. We addressed the problem of predicting the evolution as an online Inductive Logic Programming problem (ILP), where the issue is to learn first order logical clauses that associate evolutionary events, and particular Growth, Shrinkage, Continuation and Dissolution to lower level events. The lower level events are features that represent the structural and temporal characteristics of communities. Experiments have been performed on a real life data set form the Mathematics StackExchange forum, with the OLED framework for ILP. In doing so we have produced clauses that model both short term and long term correlations.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:HeT0ZceujKMC",
            "Publisher": "Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik"
        },
        {
            "Title": "Learning Ontologies of Appropriate Size",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_29",
            "Abstract": "Determining the size of an ontology that is automatically learned from text corpora is an open issue. In this paper, we study the similarity between ontology concepts at different levels of a taxonomy, quantifying in a natural manner the quality of the ontology attained. Our approach is integrated in a recently proposed method for language-neutral learning of ontologies of thematic topics from text corpora. Evaluation results over the Genia and the Lonely Planet corpora demonstrate the significance of our approach.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A data-driven approach for analyzing healthcare services extracted from clinical records",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9183213/",
            "Abstract": "Cancer remains one of the major public health challenges worldwide. After cardiovascular diseases, cancer is one of the first causes of death and morbidity in Europe, with more than 4 million new cases and 1.9 million deaths per year. The suboptimal management of cancer patients during treatment and subsequent follows up are major obstacles in achieving better outcomes of the patients and especially regarding cost and quality of life In this paper, we present an initial data-driven approach to analyze the resources and services that are used more frequently by lung-cancer patients with the aim of identifying where the care process can be improved by paying a special attention on services before diagnosis to being able to identify possible lung-cancer patients before they are diagnosed and by reducing the length of stay in the hospital. Our approach has been built by analyzing the clinical notes of those …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:48xauSegjOkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Splice Site Prediction: Transferring Knowledge Across Organisms.",
            "Publication year": 2017,
            "Publication url": "https://www.scitepress.org/papers/2017/61644/61644.pdf",
            "Abstract": "As more genomes are sequenced, there is an increasing need for automated gene prediction. One of the subproblems of the gene prediction, is the splice sites recognition. In eukaryotic genes, splice sites mark the boundaries between exons and introns. Even though, there are organisms which are well studied and their splice sites are known, there are plenty others which have not been studied well enough. In this work, we propose two transfer learning approaches for the splice site recognition problem, which take into account the knowledge we have from the well-studied organisms. We use different representations for the sequences such as the n-gram graph representation and a representation based on biological motifs. Furthermore, we study the case where more than one organisms are available for training and we incorporate information from the phylogenetic analysis between organisms. An extensive evaluation has taken place. The results indicate that the proposed representations and approaches are very promising.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Bg7qf7VwUHIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting probabilistic latent information for the construction of community web directories",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11527886_13",
            "Abstract": "This paper improves a recently-presented approach to Web Personalization, named Community Web Directories, which applies personalization techniques to Web Directories. The Web directory is viewed as a concept hierarchy and personalization is realized by constructing user community models on the basis of usage data collected by the proxy servers of an Internet Service Provider. The user communities are modeled using Probabilistic Latent Semantic Analysis (PLSA), which provides a number of advantages such as overlapping communities, as well as a good rationale for the associations that exist in the data. The data that are analyzed present challenging peculiarities such as their large volume and semantic diversity. Initial results presented in this paper illustrate the effectiveness of the new method.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Reactive reasoning with the event calculus",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1505.05364",
            "Abstract": "Systems for symbolic event recognition accept as input a stream of time-stamped events from sensors and other computational devices, and seek to identify high-level composite events, collections of events that satisfy some pattern. RTEC is an Event Calculus dialect with novel implementation and 'windowing' techniques that allow for efficient event recognition, scalable to large data streams. RTEC can deal with applications where event data arrive with a (variable) delay from, and are revised by, the underlying sources. RTEC can update already recognised events and recognise new events when data arrive with a delay or following data revision. Our evaluation shows that RTEC can support real-time event recognition and is capable of meeting the performance requirements identified in a recent survey of event processing use cases.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:uWiczbcajpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Expert Team",
            "Publication year": 2013,
            "Publication url": "http://bioasq.org/sites/default/files/PublicDocuments/BioASQ_D3.1-ExpertTeam_final.pdf",
            "Abstract": "This deliverable presents the expert team of BioASQ project, as formulated during the first 2 months of the project. The short CVs of the members of the biomedical expert team are presented, along with the agreement signed by them.The biomedical expert team consists of people of various backgrounds (medical, biological and bioinformatics) and is expected to contribute to the project by composing benchmark datasets of questions & answers, participating in the manual assessment of samples of the results of the competitions and some of them are going to be involved in the composition of the BioASQ roadmap at the end of the project.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:43bX7VzcjpAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Data mining in economics, finance, and marketing",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44673-7_18",
            "Abstract": "Data Mining has become a buzzword in industry in recent years. It is something that everyone is talking about but few seem to understand. There are two reasons for this lack of understanding: First is the fact that Data Mining researchers have very diverse backgrounds such as machine learning, psychology and statistics. This means that the research is often based on different methodologies and communication links e.g. notation is often unique to a particular research area which hampers the exchange of ideas and the dissemination to the wider public. The second reason for the lack of understanding is that the main ideas behind Data Mining are often completely opposite to mainstream statistics and as many companies interested in Data Mining already employ statisticians, such a change of view can create opposition.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Grammatical Inference: Algorithms and Applications: 7th International Colloquium, ICGI 2004, Athens, Greece, October 11-13, 2004. Proceedings",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=17106064336290532841&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Ehil0879vHcC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "Construction of Web Community Directories by Mining Usage Data",
            "Publication year": 2003,
            "Publication url": "https://www.researchgate.net/profile/Christos-Papatheodorou-2/publication/228710926_Construction_of_Web_Community_Directories_by_Mining_Usage_Data/links/09e41507ecc73a3eef000000/Construction-of-Web-Community-Directories-by-Mining-Usage-Data.pdf",
            "Abstract": "This paper introduces the concept of Web Community Directories, as a means of personalizing services on the Web, and presents a novel methodology for the construction of these directories by usage mining methods. The community models are extracted with the use of the Community Directory Miner, a simple cluster mining algorithm which has been extended to ascend a concept hierarchy, such as a Web directory, and specialize it to the needs of user communities. The construction of the communities is based on usage data collected by the proxy servers of an Internet Service Provider, which is also a task that has not been addressed in the literature. The examined data present a number of peculiarities such as their large volume and their semantic diversity. Initial results presented in the paper illustrate the use of the methodology and provide an indication of the behavior of the new usage mining method.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:abG-DnoFyZgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic adaptation of Proper Noun Dictionaries through cooperation of machine learning and probabilistic methods",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/345508.345563",
            "Abstract": "The recognition of Proper Nouns (PNs) is considered an important task in the area of Information Retrieval and Extraction. However the high performance of most existing PN classifiers heavily depends upon the availability of large dictionaries of domain-specific Proper Nouns, and a certain amount of manual work for rule writing or manual tagging. Though it is not a heavy requirement to rely on some existing PN dictionary (often these resources are available on the web), its coverage of a domain corpus may be rather low, in absence of manual updating. In this paper we propose a technique for the automatic updating of an PN Dictionary through the cooperation of an inductive and a probabilistic classifier. In our experiments we show that, whenever an existing PN Dictionary allows the identification of 50% of the proper nouns within a corpus, our technique allows, without additional manual effort, the successful …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:4DMP91E08xMC",
            "Publisher": "ACM"
        },
        {
            "Title": "A probabilistic interval-based event calculus for activity recognition",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10472-019-09664-4",
            "Abstract": "Activity recognition refers to the detection of temporal combinations of ‘low-level’ or ‘short-term’ activities on sensor data. Various types of uncertainty exist in activity recognition systems and this often leads to erroneous detection. Typically, the frameworks aiming to handle uncertainty compute the probability of the occurrence of activities at each time-point. We extend this approach by defining the probability of a maximal interval and the credibility rate for such intervals. We then propose a linear-time algorithm for computing all probabilistic temporal intervals of a given dataset. We evaluate the proposed approach using a benchmark activity recognition dataset, and outline the conditions in which our approach outperforms time-point-based recognition.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:gKiMpY-AVTkC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Proceedings of the Fourth BioASQ workshop",
            "Publication year": 2016,
            "Publication url": "https://www.aclweb.org/anthology/W16-3100.pdf",
            "Abstract": "The fourth BioASQ workshop on biomedical semantic indexing and question answering took place in Berlin, Germany on August 13th, 2016 and was hosted by the Humboldt University. The workshop was supported by the BioASQ project1, which organizes the corresponding annual challenge. The goals of the workshop were to present the results of the fourth BioASQ challenge and further the interaction with the wider community of biomedical semantic indexing and question answering. The presenters represented research teams from different parts of the globe and with different viewpoints to the problem. This contributed to a very lively and interesting discussion among the participants of the workshop. Six papers were presented during the workshop. All were selected by peer review for presentation. This volume includes 7 papers and one abstract: The first paper gives an overview of the challenge, including especially the datasets that were used throughout the challenges and the overall results achieved by the participants.The remaining six papers are those presented at the workshop. The first of these papers is a new extension of the MTI system. In particular, Learning to Rank methodology is used as a boosting component of the MTI system. The second paper present a system which includes several multi-label classifiers (MLC) that are combined in ensembles. Elastic-Search for indexing is the object of discourse of the third workshop paper. The fourth paper presents a system which uses TmTool in addition to MetaMap, to identify possible biomedical named entities, especially out-of-vocabulary concepts. They also introduced a unified …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:IRz6iEL74y4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Determining influential users with supervised random walks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2740908.2742472",
            "Abstract": "The emergence of social media and the enormous growth of social networks have initiated a great amount of research in social influence analysis. In this regard, many approaches take into account only structural information while a few have also incorporated content. In this study we propose a new method to rank users according to their topic-sensitive influence which utilizes a priori information by employing supervised random walks. We explore the use of supervision in a PageRank-like random walk while also exploiting textual information from the available content. We perform a set of experiments on Twitter datasets and evaluate our findings.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:g3aElNc5_aQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A name-matching algorithm for supporting ontology enrichment",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_40",
            "Abstract": "Ontologies are widely used for capturing and organizing knowledge of a particular domain of interest. This knowledge is usually evolvable and therefore an ontology maintenance process is required. In the context of ontology maintenance we tackle the problem that arises when an instance/individual is written differently (grammatically, orthographically, lexicographically), while representing the same entity/ concept. This type of knowledge is captured into a semantic relationship and constitutes valuable information for many intelligent methods and systems. We enrich a domain ontology with instances that participate in this type of relationship, using a novel name matching method based on machine learning. We also show how the proposed method can support the discovery of new entities/concepts to be added to the ontology. Finally, we present experimental results for the enrichment of an ontology used …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "User Modeling 2007",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-540-73078-1.pdf",
            "Abstract": "As the variety and complexity of interactive systems increase, understanding how a system can dynamically capture relevant user needs and traits, and automatically adapting its interaction to this information, has become critical for devising effective advanced services and interfaces. The International User Modeling Conference represents the central forum for presenting the advances in the research and development of personalized, user-adaptive systems. Bi-annual scientific meetings of the user modeling community started in 1986 as a small invitational workshop held in Maria Laach, Germany, with 24 participants. The workshops continued with an open format, and grew into an international conference with 74 submissions in 1994. While maintaining its feel as a highly engaged and intimate community, the conference has continued to grow, reaching the record number of 169 submissions (153 full papers and …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event definition for the application of event processing to intelligent resource management",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Alexander-Artikis/publication/264841234_Event_Definition_for_the_Application_of_Event_Processing_to_Intelligent_Resource_Management/links/542bac980cf27e39fa918d93/Event-Definition-for-the-Application-of-Event-Processing-to-Intelligent-Resource-Management.pdf",
            "Abstract": "The application of event processing methods and systems carries high potential for the domain of crisis management and emergency response for different use cases and architectural aspects. This hypothesis is based on the general event based characteristics of the domain as well as former research approaches. Resource management represents a complex task for decision makers; therefore it is taken as a basic use case for this work. It builds up on foundations of resource management (use case and demand side) and event processing (technology and supply side). Methods and results are presented for the identification, definition and validation of events that happen in reality and corresponding event objects which are processed by information systems.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Analysis and classification of constrained DNA elements with n-gram graphs and genomic signatures",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07953-0_18",
            "Abstract": "Most common methods for inquiring genomic sequence composition, are based on the bag-of-words approach and thus largely ignore the original sequence structure or the relative positioning of its constituent oligonucleotides. We here present a novel methodology that takes into account both word representation and relative positioning at various lengths scales in the form of n-gram graphs (NGG). We implemented the NGG approach on short vertebrate and invertebrate constrained genomic sequences of various origins and predicted functionalities and were able to efficiently distinguish DNA sequences belonging to the same species (intra-species classification). As an alternative method, we also applied the Genomic Signatures (GS) approach to the same sequences. To our knowledge, this is the first time that GS are applied on short sequences, rather than whole genomes. Together, the presented …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:6yz0xqPARnAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Semantic integration of disease-specific knowledge",
            "Publication year": 2019,
            "Publication url": "https://onikle.com/articles/48712",
            "Abstract": "Biomedical researchers working on a specific disease need up-to-date and unified access to knowledge relevant to the disease of their interest. Knowledge is continuously accumulated in scientific literature and other resources such as biomedical ontologies. Identifying the specific information needed is a challenging task and computational tools can be valuable. In this study, we propose a pipeline to automatically retrieve and integrate relevant knowledge based on a semantic graph representation, the iASiS Open Data Graph. Results: The disease-specific semantic graph can provide easy access to resources relevant to specific concepts and individual aspects of these concepts, in the form of concept relations and attributes. The proposed approach is applied to three different case studies: Two prevalent diseases, Lung Cancer and Dementia, for which a lot of knowledge is available, and one rare disease …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:2tRrZ1ZAMYUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Results of the fifth edition of the bioasq challenge",
            "Publication year": 2017,
            "Publication url": "https://www.aclweb.org/anthology/W17-2306.pdf",
            "Abstract": "The goal of the BioASQ challenge is to engage researchers into creating cuttingedge biomedical information systems. Specifically, it aims at the promotion of systems and methodologies that are able to deal with a plethora of different tasks in the biomedical domain. This is achieved through the organization of challenges. The fifth challenge consisted of three tasks: semantic indexing, question answering and a new task on information extraction. In total, 29 teams with more than 95 systems participated in the challenge. Overall, as in previous years, the best systems were able to outperform the strong baselines. This suggests that state-of-the art systems are continuously improving, pushing the frontier of research.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:_5tno0g5mFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The ECIR 2010 large scale hierarchical classification workshop",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1842890.1842894",
            "Abstract": "This paper reports on the Large Scale Hierarchical Classification workshop (http://kmi.open.ac.uk/events/ecir2010/workshops-tutorials), held in conjunction with the European Conference on Information Retrieval (ECIR) 2010. The workshop was associated with the PASCAL 2 Large-Scale Hierarchical Text Classification Challenge (http://lshtc.iit.demokritos.gr), which took place in 2009. We first provide information about the challenge, presenting the data used, the tasks and the evaluation measures and then we provide an overview of the approaches proposed by the participants of the workshop, together with a summary of the results of the challenge.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:NMxIlDl6LWMC",
            "Publisher": "ACM"
        },
        {
            "Title": "OurDMOZ: A System for Personalizing the Web.",
            "Publication year": 2012,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/PersDB2012.pdf",
            "Abstract": "Community Web Directories constitute a form of personalization performed on Web directories, such as the Open Directory Project (ODP). They correspond to “segments” of the directory hierarchy, representing the interests and preferences of user communities and thus provide a personalized view of the Web. In this paper, we present OurDMOZ, a system that builds and maintains community Web directories by employing a Web usage mining framework. OurDMOZ, the prototype presented here, exploits Web directories to extend personalization to a larger part of the Web, outside the scope of a single Web site. OurDMOZ offers a variety of personalization functionalities including adaptive interfaces and Web page recommendations. An initial user evaluation of the system indicates the potential value of the enhanced personalized Web experience provided by OurDMOZ.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "VeWra: Improving content-based wrapper verification with a penalty system",
            "Publication year": 2009,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Report on the sigir 2016 workshop on medical information retrieval (medir)",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3053408.3053422",
            "Abstract": "The workshop on Medical Information Retrieval took place at SIGIR 2016 in Pisa, Italy on July 21. The workshop programme included seven oral presentations of refereed papers, four posters and an invited keynote presentation. This allowed time for lively discussions among the 27 participants. These made clear the significant and diverse challenges in the area of medical information retrieval and the significant interest in developing mechanisms to go about tackling them. Successfully addressing them will give added value to the wide variety of users that can profit from medical information search, including patients, general health professionals and specialist groups such as radiologists who mainly search for images and image-related information.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:sNmaIFBj_lkC",
            "Publisher": "ACM"
        },
        {
            "Title": "What is all this new MeSH about?",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00799-021-00304-z",
            "Abstract": "The Medical Subject Headings (MeSH) thesaurus is a controlled vocabulary widely used in biomedical knowledge systems, particularly for semantic indexing of scientific literature. As the MeSH hierarchy evolves through annual version updates, some new descriptors are introduced that were not previously available. This paper explores the conceptual provenance of these new descriptors. In particular, we investigate whether such new descriptors have been previously covered by older descriptors and what is their current relation to them. To this end, we propose a framework to categorize new descriptors based on their current relation to older descriptors. Based on the proposed classification scheme, we quantify, analyze, and present the different types of new descriptors introduced in MeSH during the last fifteen years. The results show that only about 25% of new MeSH descriptors correspond to new …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:7wO8s98CvbsC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "MyCites: An Intelligent Information System for Maintaining Citations",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87881-0_35",
            "Abstract": "The evaluation of their research work and its effect has always been one of scholars’ greatest concerns. The use of citations for that purpose, as proposed by Eugene Garfield, is nowadays widely accepted as the most reliable method. However, gathering a scholar’s citations constitutes a particularly laborious task, even in the current Internet era, as one needs to correctly combine information from miscellaneous sources. There exists therefore a need for automating this process. Numerous academic search engines try to cover this need, but none of them addresses successfully all related problems. In this paper we present an approach that facilitates to a great extent citation analysis by taking advantage of new algorithms to deal with these problems.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Class-aware tensor factorization for multi-relational classification",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306457318310033",
            "Abstract": "In this paper, we propose a tensor factorization method, called CLASS-RESCAL, which associates the class labels of data samples with their latent representations. Specifically, we extend RESCAL to produce a semi-supervised factorization method that combines a classification error term with the standard factor optimization process. CLASS-RESCAL assimilates information from all the relations of the tensor, while also taking into account classification performance. This procedure forces the data samples within the same class to have similar latent representations. Experimental results on several real-world social network data indicate this is a promising approach for multi-relational classification tasks.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:fbc8zXXH2BUC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "The Complex Event Recognition Group",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3299887.3299899",
            "Abstract": "The Complex Event Recognition (CER) group is a research team, affiliated with the National Centre of Scientific Research \"Demokritos\" in Greece. The CER group works towards advanced and efficient methods for the recognition of complex events in a multitude of large, heterogeneous and interdependent data streams. Its research covers multiple aspects of complex event recognition, from efficient detection of patterns on event streams to handling uncertainty and noise in streams, and machine learning techniques for inferring interesting patterns. Lately, it has expanded to methods for forecasting the occurrence of events. It was founded in 2009 and currently hosts eight senior and junior researchers, working regularly with under-graduate students.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:HIFyuExEbWQC",
            "Publisher": "ACM"
        },
        {
            "Title": "iASiS Open Data Graph: Automated Semantic Integration of Disease-Specific Knowledge",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9183291/",
            "Abstract": "In biomedical research, unified access to up-to-date domain-specific knowledge is crucial, as such knowledge is continuously accumulated in scientific literature and structured resources. Identifying and extracting specific information is a challenging task and computational analysis of knowledge bases can be valuable in this direction. However, for disease-specific analyses researchers often need to compile their own datasets, integrating knowledge from different resources, or reuse existing datasets, that can be out-of-date. In this study, we propose a framework to automatically retrieve and integrate disease-specific knowledge into an up-to-date semantic graph, the iASiS Open Data Graph. This disease-specific semantic graph provides access to knowledge relevant to specific concepts and their individual aspects, in the form of concept relations and attributes. The proposed approach is implemented as an open …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:CaZNVDsoPx4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Machine Learning and Its Applications: Advanced Lectures",
            "Publication year": 2001,
            "Publication url": "https://lib.hpu.edu.vn/handle/123456789/32069",
            "Abstract": "In recent years machine learning has made its way from artificial intelligence into areas of administration, commerce, and industry. Data mining is perhaps the most widely known demonstration of this migration, complemented by less publicized applications of machine learning like adaptive systems in industry, financial prediction, medical diagnosis and the construction of user profiles for Web browsers. This book presents the capabilities of machine learning methods and ideas on how these methods could be used to solve real-world problems. The first ten chapters assess the current state of the art of machine learning, from symbolic concept learning and conceptual clustering to case-based reasoning, neural networks, and genetic algorithms. The second part introduces the reader to innovative applications of ML techniques in fields such as data mining, knowledge discovery, human language technology, user modeling, data analysis, discovery science, agent technology, finance, etc.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:kVjdVfd2voEC",
            "Publisher": "Springer-Verlag Berlin Heidelberg"
        },
        {
            "Title": "Discovery of complex user communities",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-23835-7_1",
            "Abstract": "This chapter serves as an introduction to the book on User Community Discovery, setting the scene for the presentation in the rest of the book of various methods for the discovery of user communities in the social Web. In this context, the current chapter introduces the various types of user community, as they appeared in the early days of the Web, and how they converged to the common concept of active user community in the social Web. In this manner, the chapter aims to clarify the use of terminology in the various research areas that study user communities. Additionally, the main approaches to discovering user communities are briefly introduced and a number of new challenges for community discovery in the social Web are highlighted. In particular we emphasize the complexity of the networks that are constructed among users and other entities in the social Web. Social networks are typically multi-modal …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:MLfJN-KU85MC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Online Learning Probabilistic Event Calculus Theories in Answer Set Programming",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2104.00158",
            "Abstract": "Complex Event Recognition (CER) systems detect event occurrences in streaming time-stamped input using predefined event patterns. Logic-based approaches are of special interest in CER, since, via Statistical Relational AI, they combine uncertainty-resilient reasoning with time and change, with machine learning, thus alleviating the cost of manual event pattern authoring. We present a system based on Answer Set Programming (ASP), capable of probabilistic reasoning with complex event patterns in the form of weighted rules in the Event Calculus, whose structure and weights are learnt online. We compare our ASP-based implementation with a Markov Logic-based one and with a number of state-of-the-art batch learning algorithms on CER datasets for activity recognition, maritime surveillance and fleet management. Our results demonstrate the superiority of our novel approach, both in terms of efficiency and predictive performance. This paper is under consideration for publication in Theory and Practice of Logic Programming (TPLP).",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:7BrZ7Jt4UNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-GRIDS: Computationally Efficient Gramatical Inference from Positive Examples",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=17501801211124920013&hl=en&oi=scholarr",
            "Abstract": "In this paper we present a new computationally efficient algorithm for inducing context-free grammars that is able to learn from positive sample sentences. This new algorithm uses simplicity as a criterion for directing inference, and the search process of the new algorithm has been optimised by utilising the results of a theoretical analysis regarding the behaviour and complexity of the search operators. Evaluation results are presented on artificially generated data, while the scalability of the algorithm is tested on a large textual corpus. These results show that the new algorithm performs well and can infer grammars from large data sets in a reasonable amount of time.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Interactive 2D-3D digital maps for the support of emergency forces during rescue operations",
            "Publication year": 2005,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic web rating: Filtering obscene content on the web",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45268-0_50",
            "Abstract": "We present a method to detect automatically pornographic content on the Web. Our method combines techniques from language engineering and image analysis within a machine-learning framework. Experimental results show that it achieves nearly perfect performance on a set of hard cases.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Biomedical semantic indexing using dense word vectors in bioasq",
            "Publication year": 2015,
            "Publication url": "http://www2.aueb.gr/users/ion/docs/bioasq_dense_vectors.pdf",
            "Abstract": "Background: Biomedical curators are often required to semantically index large numbers of biomedical articles, using hierarchically related labels (eg, MeSH headings). Large scale hierarchical classification, a branch of machine learning, can facilitate this procedure, but the resulting automatic classifiers are often inefficient because of the very large dimensionality of the dominant bag-of-words representation of texts. Feature selection quickly harms the accuracy of the classifiers in this particular task, and dimensionality reduction transformations (eg, PCA-based) usually cannot be efficiently applied to very large corpora. Methods:We examine the use of dense word vectors, also known as word embeddings, as an efficient method of dimensionality reduction that makes hierarchical text classification algorithms more scalable in biomedical semantic indexing, without being less effective than the usual bag-of-words representation. We consider several approaches for the transition from dense word vectors to dense vectors that represent entire texts, proposing the approach that we believe fits better this domain. We experiment with flat and hierarchically expanded K-nearest neighbor classifiers that employ dense vector representations of article abstracts, examining the effect of various parameters. We also present a high precision system that can be combined with the Medical Text Indexer (MTI) system of the US National Library of Medicine (NLM) to improve its performance. Results:",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Semi-Supervised Tensor Factorization for Node Classification in Complex Social Networks",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1907.10416",
            "Abstract": "This paper proposes a method to guide tensor factorization, using class labels. Furthermore, it shows the advantages of using the proposed method in identifying nodes that play a special role in multi-relational networks, e.g. spammers. Most complex systems involve multiple types of relationships and interactions among entities. Combining information from different relationships may be crucial for various prediction tasks. Instead of creating distinct prediction models for each type of relationship, in this paper we present a tensor factorization approach based on RESCAL, which collectively exploits all existing relations. We extend RESCAL to produce a semi-supervised factorization method that combines a classification error term with the standard factor optimization process. The coupled optimization approach, models the tensorial data assimilating observed information from all the relations, while also taking into account classification performance. Our evaluation on real-world social network data shows that incorporating supervision, when available, leads to models that are more accurate.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:lvd772isFD0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "eg-GRIDS: context-free grammatical inference from positive examples using genetic search",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30195-0_20",
            "Abstract": "In this paper we present eg-GRIDS, an algorithm for inducing context-free grammars that is able to learn from positive sample sentences. The presented algorithm, similar to its GRIDS predecessors, uses simplicity as a criterion for directing inference, and a set of operators for exploring the search space. In addition to the basic beam search strategy of GRIDS, eg-GRIDS incorporates an evolutionary grammar selection process, aiming to explore a larger part of the search space. Evaluation results are presented on artificially generated data, comparing the performance of beam search and genetic search. These results show that genetic search performs better than beam search while being significantly more efficient computationally.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Ellogon: A new text engineering platform",
            "Publication year": 2002,
            "Publication url": "https://arxiv.org/abs/cs/0205017",
            "Abstract": "This paper presents Ellogon, a multi-lingual, cross-platform, general-purpose text engineering environment. Ellogon was designed in order to aid both researchers in natural language processing, as well as companies that produce language engineering systems for the end-user. Ellogon provides a powerful TIPSTER-based infrastructure for managing, storing and exchanging textual data, embedding and managing text processing components as well as visualising textual data and their associated linguistic information. Among its key features are full Unicode support, an extensive multi-lingual graphical user interface, its modular architecture and the reduced hardware requirements.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Machine Learning and Neural Networks",
            "Publication year": 2013,
            "Publication url": "https://www.eetn.gr/index.php/about-eetn/eetn-publications/ai-research-in-greece/machine-learning-and-neural-networks?showall=1",
            "Abstract": "Machine Learning is a subfield of Artificial Intelligence that is concerned with algorithms and techniques that allow computer systems to “learn from experience” to successfully solve artificial intelligence problems. Experience is usually provided in the form of problem-specific “examples”(organized in “datasets”) that allow the learning system to discover new knowledge and improve its performance on a particular task. If the training examples are not available at the beginning of the learning process, but they are collected during training we have the case of “on-line” or incremental learning. If the system is already provided some knowledge about the domain and/or the task, we have the case of knowledge refinement or analytical learning.Machine Learning problems are generally distinguished into three main categories depending on the nature of the datasets: In supervised learning, we are given a set of labeled examples and the aim is to discover the knowledge required for labeling new examples. Typical tasks that fall within the paradigm of supervised learning are classification where a class label is predicted for each input example and regression, where a numerical value is predicted for each input example. In unsupervised learning we are given a set of unlabeled examples and the aim is to identify the underlying structure of the data and extract it in the form of actionable knowledge. Typical unsupervised learning tasks are clustering, where the goal is to identify commonalities among the examples and form interesting clusters, and model estimation, where the knowledge model that generated the data is being sought, eg in the form of …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:35r97b3x0nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tutorial: Formal Methods for Event Processing.",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.672.2124&rep=rep1&type=pdf",
            "Abstract": "Organisations require techniques for automated transformation of the Big Data they collect into operational knowledge. This requirement may be addressed by employing event processing systems that detect activities/events of special significance within an organisation, given streams of low-level information that are difficult to be utilised by humans [4]. Systems for event processing and in particular event recognition (‘event pattern matching’) accept as input a stream of time-stamped, simple or low-level events. A low-level event is the result of applying a computational derivation process to some other event, such as an event coming from a sensor. Using low-level events as input, event processing systems identify composite or high-level events of interest—collections of events that satisfy some pattern. Consider, for example, the recognition of attacks on nodes of a computer network given the TCP/IP messages, the recognition of suspicious trader behaviour given the transactions in a financial market, and the recognition of whale songs given a symbolic representation of whale sounds. Numerous event processing systems have been proposed in the literature [3]. Systems with a logic-based representation of event structures, for example, have been attracting considerable attention. They exhibit a formal, declarative semantics, allowing for verification and a code maintenance, they have proven to be efficient and scalable, and they are supported by machine learning tools, minimising human effort in the system development. In this tutorial, we review formal event processing systems. High-level event ‘definitions’ impose temporal and, possibly …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Medical Information Search Workshop (MEDIR)",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/2911451.2917761",
            "Abstract": "Medical information search refers to methodologies and technologies that seek to improve access to medical information archives via a process of information retrieval (IR). Such information is now potentially accessible from many sources including the general web, social media, journal articles, and hospital records. Health-related content is one of the most searched-for topics on the internet, and as such this is an important domain for research in information retrieval. Medical information is of interest to a wide variety of users, including patients and their families, researchers, general practitioners and clinicians, and clinicians with specific expertise such as radiologists. There are several dedicated services that seek to make this information more easily accessible, such as Health on the Net’s medical search systems for the general public and medical practitioners1. Despite the popularity of the medical domain for …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:ClCfbGk0d_YC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bootstrapping ontology evolution with multimedia information extraction",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20795-2_1",
            "Abstract": "This chapter summarises the approach and main achievements of the research project BOEMIE (Bootstrapping Ontology Evolution with Multimedia Information Extraction). BOEMIE introduced a new approach towards the automation of knowledge acquisition from multimedia content. In particular, it developed and demonstrated the notion of evolving multimedia ontologies, which is used for the extraction, fusion and interpretation of information from content of various media types (audio, video, images and text). BOEMIE adopted a synergistic approach that combines multimedia extraction and ontology evolution in a bootstrapping process. This process involves, on the one hand, the continuous extraction of semantic information from multimedia content in order to populate and enrich the ontologies and, on the other hand, the deployment of these ontologies to enhance the robustness of the extraction system …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Online learning of event definitions",
            "Publication year": 2016,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/online-learning-of-event-definitions/B1244B019AF03F6172DC92B57896544D",
            "Abstract": "Systems for symbolic event recognition infer occurrences of events in time using a set of event definitions in the form of first-order rules. The Event Calculus is a temporal logic that has been used as a basis in event recognition applications, providing among others, direct connections to machine learning, via Inductive Logic Programming (ILP). We present an ILP system for online learning of Event Calculus theories. To allow for a single-pass learning strategy, we use the Hoeffding bound for evaluating clauses on a subset of the input stream. We employ a decoupling scheme of the Event Calculus axioms during the learning process, that allows to learn each clause in isolation. Moreover, we use abductive-inductive logic programming techniques to handle unobserved target predicates. We evaluate our approach on an activity recognition application and compare it to a number of batch learning techniques. We obtain …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Event forecasting with pattern markov chains",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3093742.3093920",
            "Abstract": "We present a system for online probabilistic event forecasting. We assume that a user is interested in detecting and forecasting event patterns, given in the form of regular expressions. Our system can consume streams of events and forecast when the pattern is expected to be fully matched. As more events are consumed, the system revises its forecasts to reflect possible changes in the state of the pattern. The framework of Pattern Markov Chains is used in order to learn a probabilistic model for the pattern, with which forecasts with guaranteed precision may be produced, in the form of intervals within which a full match is expected. Experimental results from real-world datasets are shown and the quality of the produced forecasts is explored, using both precision scores and two other metrics: spread, which refers to the\" focusing resolution\" of a forecast (interval length), and distance, which captures how early a …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:HtEfBTGE9r8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Behaviour recognition from video content: a logic programming approach",
            "Publication year": 2010,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S021821301000011X",
            "Abstract": "We present a system for recognising human behaviour given a symbolic representation of surveillance videos. The input of our system is a set of time-stamped short-term behaviours, that is, behaviours taking place in a short period of time — walking, running, standing still, etc — detected on video frames. The output of our system is a set of recognised long-term behaviours — fighting, meeting, leaving an object, collapsing, walking, etc — which are pre-defined temporal combinations of short-term behaviours. The definition of a long-term behaviour, including the temporal constraints on the short-term behaviours that, if satisfied, lead to the recognition of the long-term behaviour, is expressed in the Event Calculus. We present experimental results concerning videos with several humans and objects, temporally overlapping and repetitive behaviours. Moreover, we present how machine learning techniques may be …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PNS: A personalized news aggregator on the web",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-77471-6_10",
            "Abstract": "This paper presents a system that aggregates news from various electronic news publishers and distributors. The system collects news from HTML and RSS Web documents by using source-specific information extraction programs (wrappers) and parsers, organizes them according to pre-defined news categories and constructs personalized views via a Web-based interface. Adaptive personalization is performed, based on the individual user interaction, user similarities and statistical analysis of aggregate usage data by machine learning algorithms. In addition to the presentation of the basic system, we present here the results of a user study, indicating the merits of the system, as well as ways to improve it further.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Spam filtering with naive bayes-which naive bayes?",
            "Publication year": 2006,
            "Publication url": "https://nes.aueb.gr/ipl/nlp/pubs/ceas2006_paper.pdf",
            "Abstract": "Naive Bayes is very popular in commercial and open-source anti-spam e-mail filters. There are, however, several forms of Naive Bayes, something the anti-spam literature does not always acknowledge. We discuss five different versions of Naive Bayes, and compare them on six new, non-encoded datasets, that contain ham messages of particular Enron users and fresh spam messages. The new datasets, which we make publicly available, are more realistic than previous comparable benchmarks, because they maintain the temporal order of the messages in the two categories, and they emulate the varying proportion of spam and ham messages that users receive over time. We adopt an experimental procedure that emulates the incremental training of personalized spam filters, and we plot roc curves that allow us to compare the different versions of nb over the entire tradeoff between true positives and true negatives.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SKEL’s Research on Machine Learning for Information Integration on the Web",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.100.875&rep=rep1&type=pdf",
            "Abstract": "This short paper highlights the research activity of the Software and Knowledge Engineering Laboratory (SKEL) on machine learning methods to support information Integration on the Web. SKEL belongs in the Institute of Informatics and Telecommunications of the National Centre for Scientific Research “Demokritos”, and has recently coordinated the European research project CROSSMARC, which produced a complete prototype for information integration, employing state-of-the-art techniques for information gathering, information extraction, ontology maintenance and personalization. Following a brief description of the CROSSMARC architecture, this paper presents recent research activity in SKEL towards the automation of information extraction and ontology maintenance. For this purpose, novel machine learning methods have been developed in the areas of grammatical inference, stacked generalization and compression-based clustering.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Logic-Based Approach to Activity Recognition",
            "Publication year": 2012,
            "Publication url": "https://www.igi-global.com/chapter/content/75283",
            "Abstract": "The authors have been developing a system for recognising human activities given a symbolic representation of video content. The input of the system is a stream of time-stamped short-term activities detected on video frames. The output of the system is a set of recognised long-term activities, which are pre-defined spatio-temporal combinations of short-term activities. The constraints on the short-term activities that, if satisfied, lead to the recognition of a long-term activity, are expressed using a dialect of the Event Calculus. The authors illustrate the expressiveness of the dialect by showing the representation of several typical complex activities. Furthermore, they present a detailed evaluation of the system through experimentation on a benchmark dataset of surveillance videos.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A parallel algorithm for tracking dynamic communities based on apache flink",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3200947.3201039",
            "Abstract": "Real world social networks are highly dynamic environments consisting of numerous users and communities, rendering the tracking of their evolution a challenging problem. In this work, we propose a parallel algorithm for tracking dynamic communities between consecutive timeframes of the social network, where communities are represented as undirected graphs. Our method compares the communities based on the widely adopted Jaccard similarity measure and is implemented on top of Apache Flink, a novel framework for parallel and distributed data processing. We evaluate the benefits, in terms of execution time, that parallel processing brings to community tracking on datasets carrying different quantitative characteristics, derived from two popular social media platforms; Twitter and Mathematics Stack Exchange Q&A. Experiments show that our parallel method has the ability to calculate the similarity of …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:3htObqc8RwsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Beyond MeSH: Fine-grained semantic indexing of biomedical literature based on weak supervision",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306457319312415",
            "Abstract": "In this work, we propose a method for the automated refinement of subject annotations in biomedical literature at the level of concepts. Semantic indexing and search of biomedical articles in MEDLINE/PubMed are based on semantic subject annotations with MeSH descriptors that may correspond to several related but distinct biomedical concepts. Such semantic annotations do not adhere to the level of detail available in the domain knowledge and may not be sufficient to fulfil the information needs of experts in the domain. To this end, we propose a new method that uses weak supervision to train a concept annotator on the literature available for a particular disease. We test this method on the MeSH descriptors for two diseases: Alzheimer’s Disease and Duchenne Muscular Dystrophy. The results indicate that concept-occurrence is a strong heuristic for automated subject annotation refinement and its use as weak …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:5icHVeHT4IsC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Harvesting the Public MeSH Note field",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2106.00302",
            "Abstract": "In this document, we report an analysis of the Public MeSH Note field of the new descriptors introduced in the MeSH thesaurus between 2006 and 2020. The aim of this analysis was to extract information about the previous status of these new descriptors as Supplementary Concept Records. The Public MeSH Note field contains information in semi-structured text, meant to be read by humans. Therefore, we adopted a semi-automated approach, based on regular expressions, to extract information from it. In the large majority of cases, we managed to minimize the required manual effort for extracting the previous state of a new descriptor as a Supplementary Concept Record. The source code for this analysis is openly available on GitHub.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:IaI1MmNe2tcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the need to bootstrap ontology learning with extraction grammar learning",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11524564_8",
            "Abstract": "The main claim of this paper is that machine learning can help integrate the construction of ontologies and extraction grammars and lead us closer to the Semantic Web vision. The proposed approach is a bootstrapping process that combines ontology and grammar learning, in order to semi-automate the knowledge acquisition process. After providing a survey of the most relevant work towards this goal, recent research of the Software and Knowledge Engineering Laboratory (SKEL) of NCSR “Demokritos” in the areas of Web information integration, information extraction, grammar induction and ontology enrichment is presented. The paper concludes with a number of interesting issues that need to be addressed in order to realize the advocated bootstrapping process.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Guiding Graph Embeddings using Path-Ranking Methods for Error Detection innoisy Knowledge Graphs",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2002.08762",
            "Abstract": "Nowadays Knowledge Graphs constitute a mainstream approach for the representation of relational information on big heterogeneous data, however, they may contain a big amount of imputed noise when constructed automatically. To address this problem, different error detection methodologies have been proposed, mainly focusing on path ranking and representation learning. This work presents various mainstream approaches and proposes a hybrid and modular methodology for the task. We compare different methods on two benchmarks and one real-world biomedical publications dataset, showcasing the potential of our approach and providing insights on graph embeddings when dealing with noisy Knowledge Graphs.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:U4n9YNQMCAIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering user communities on the Internet using unsupervised machine learning techniques",
            "Publication year": 2002,
            "Publication url": "https://academic.oup.com/iwc/article-abstract/14/6/761/873360",
            "Abstract": "Interest in the analysis of user behaviour on the Internet has been increasing rapidly, especially since the advent of electronic commerce. In this context, we argue here for the usefulness of constructing communities of users with common behaviour, making use of machine learning techniques. In particular, we assume that the users of any service on the Internet constitute a large community and we aim to construct smaller communities of users with common characteristics. The paper presents the results of three case studies for three different types of Internet service: a digital library, an information broker and a Web site. Particular attention is paid on the different types of information access involved in the three case studies: query-based information retrieval, profile-based information filtering and Web-site navigation. Each type of access imposes different constraints on the representation of the learning task. Two …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Generation architecture and description of first M-PIRO prototype",
            "Publication year": 2001,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:tOudhMTPpwUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web community directories: A new approach to web personalization",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30123-3_7",
            "Abstract": "This paper introduces a new approach to Web Personalization, named Web Community Directories that aims to tackle the problem of information overload on the WWW. This is realized by applying personalization techniques to the well-known concept of Web Directories. The Web directory is viewed as a concept hierarchy which is generated by a content-based document clustering method. Personalization is realized by constructing community models on the basis of usage data collected by the proxy servers of an Internet Service Provider. For the construction of the community models, a new data mining algorithm, called Community Directory Miner, is used. This is a simple cluster mining algorithm which has been extended to ascend a concept hierarchy, and specialize it to the needs of user communities. The data that are mined present a number of peculiarities such as their large volume and semantic …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Second Version of Event Recognition and Forecasting Technology–Part II",
            "Publication year": 2015,
            "Publication url": "http://speedd-project.eu/sites/default/files/D3.2_-_Second_version_of_event_recognition_and_forecasting_technology_-_Part_2_final.pdf",
            "Abstract": "This document presents the advancements made in event recognition and forecasting technology of the SPEEDD project, in order to reason about events and learn event definitions over large amounts of data, as well as under situations of uncertainty.SPEEDD develops a system for proactive event-driven decision-making. Decisions are triggered by forecasting events—whether they correspond to problems or opportunities—instead of reacting to them once they happen. The decisions are made in real-time and require on-the-fly processing of Big Data, ie, extremely large amounts of noisy data storming from different geographical locations, as well as historical data. The effectiveness of the SPEEDD project will be evaluated in two use cases. First, proactive traffic management, aiming to forecast traffic congestions and thus to attenuate them. Second, proactive credit card fraud management, aiming to significantly improve fraud detection accuracy, without compromising efficiency, and forecast various types of fraudulent activity. SPEEDD implements event recognition methods (also known as event pattern matching or event pattern detection systems), in order to extract useful information, in the form of events, by processing time-evolving data that comes from various sources (eg, various types of sensor, network activity logs, ATMs, transactions, etc.). The extracted information—recognized and/or forecasted events—can be exploited by other systems or human experts, in order to monitor an environment and respond to the occurrence of significant events. Event recognition methods employ rich representation that can naturally and compactly …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:PVgj2kMGcgYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An overview of the BIOASQ large-scale biomedical semantic indexing and question answering competition",
            "Publication year": 2015,
            "Publication url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/s12859-015-0564-6",
            "Abstract": "This article provides an overview of the first BioASQ challenge, a competition on large-scale biomedical semantic indexing and question answering (QA), which took place between March and September 2013. BioASQ assesses the ability of systems to semantically index very large numbers of biomedical scientific articles, and to return concise and user-understandable answers to given natural language questions by combining information from biomedical articles and ontologies. The 2013 BioASQ competition comprised two tasks, Task 1a and Task 1b. In Task 1a participants were asked to automatically annotate new PubMed documents with MeSH headings. Twelve teams participated in Task 1a, with a total of 46 system runs submitted, and one of the teams performing consistently better than the MTI indexer used by NLM to suggest MeSH headings to curators. Task 1b used benchmark datasets containing 29 development and 282 test English questions, along with gold standard (reference) answers, prepared by a team of biomedical experts from around Europe and participants had to automatically produce answers. Three teams participated in Task 1b, with 11 system runs. The BioASQ infrastructure, including benchmark datasets, evaluation mechanisms, and the results of the participants and baseline methods, is publicly available. A publicly available evaluation infrastructure for biomedical semantic indexing and QA has been developed, which includes benchmark datasets, and can be used to evaluate systems that: assign MeSH headings to published articles or to English questions; retrieve relevant RDF triples from ontologies, relevant …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:EYYDruWGBe4C",
            "Publisher": "BioMed Central"
        },
        {
            "Title": "BioASQ at CLEF2021: Large-Scale Biomedical Semantic Indexing and Question Answering",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-72240-1_73",
            "Abstract": "This paper describes the ninth edition of the BioASQ Challenge, which will run as an evaluation Lab in the context of CLEF2021. The aim of BioASQ is the promotion of systems and methods for highly precise biomedical information access. This is done through the organization of a series of challenges (shared tasks) on large-scale biomedical semantic indexing and question answering, where different teams develop systems that compete on the same demanding benchmark datasets that represent the real information needs of biomedical experts. In order to facilitate this information finding process, the BioASQ challenge introduced two complementary tasks:(a) the automated indexing of large volumes of unlabelled data, primarily scientific articles, with biomedical concepts,(b) the processing of biomedical questions and the generation of comprehensible answers. Rewarding the most competitive systems that …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:WC23djZS0W4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "BioASQ: a challenge on large-scale biomedical semantic indexing and question answering",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24471-6_3",
            "Abstract": " BioASQ is a series of challenges that aims to assess the performance of information systems in supporting two tasks that are central to the biomedical question answering process: (a) the indexing of large volumes of unlabelled data, primarily scientific articles, with biomedical concepts, (b) the processing of biomedical questions and the generation of answers and supporting material. In this paper, the main results of the first two BioASQ challenges are presented.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:LI9QrySNdTsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": ": Online Structure Learning Using Background Knowledge Axiomatization",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-46128-1_15",
            "Abstract": "We present —an online structure learner for Markov Logic Networks (MLNs) that exploits background knowledge axiomatization in order to constrain the space of possible structures. Many domains of interest are characterized by uncertainty and complex relational structure. MLNs is a state-of-the-art Statistical Relational Learning framework that can naturally be applied to domains governed by these characteristics. Learning MLNs from data is challenging, as their relational structure increases the complexity of the learning process. In addition, due to the dynamic nature of many real-world applications, it is desirable to incrementally learn or revise the model’s structure and parameters. Experimental results are presented in activity recognition using a probabilistic variant of the Event Calculus () as background knowledge and a benchmark dataset for video surveillance.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:PVjk1bu6vJQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "ER designer toolkit: a graphical event definition authoring tool",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-013-0300-9",
            "Abstract": "Modern assistive environments have the ability to collect data from various distributed sources and need to react swiftly to changes. As information flows, in the form of simple, source events, it becomes more and more difficult to quickly analyze the collected data in an automated way and transform them into operational knowledge. Event recognition (ER) addresses this problem. Several tools exist for defining ER rules, but only a few of them offer graphical design environments. Each such tool supports a single ER language, either query-based or rule-based. Also, many of these systems do not support the addition of user-defined operators, thus limiting the flexibility in rule design. This paper presents the Event Recognition Designer Toolkit (ERDT), a graphical authoring tool, with which a domain expert can design event recognition rules and produce standalone ER. The goal was to develop a user-friendly …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:bnK-pcrLprsC",
            "Publisher": "ACM"
        },
        {
            "Title": "Web usage mining as a tool for personalization: A survey",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1026238916441",
            "Abstract": "This paper is a survey of recent work in the field of web usage mining for the benefitof research on the personalization of Web-based information services. The essence of personalization is the adaptability of information systems to the needs of their users. This issue is becoming increasingly important on the Web, as non-expert users are overwhelmed by the quantity of information available online, while commercial Web sites strive to add value to their services in order to create loyal relationships with their visitors-customers. This article views Web personalization through the prism of personalization policies adopted by Web sites and implementing a variety of functions. In this context, the area of Web usage mining is a valuable source of ideas and methods for the implementation of personalization functionality. We therefore present a survey of the most recent work in the field of Web usage mining, focusing …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Using machine learning techniques for Part-of-Speech tagging in the Greek language",
            "Publication year": 2000,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812793928_0024",
            "Abstract": "This article investigates the use of Transformation-Based Error-Driven learning for part-of-speech tagging in the Greek language. The aim is not only to study the performance, but also to examine its dependence on different thematic domains. Results are presented here for two different test cases: a corpus on “management succession events” and a general-theme corpus. The two experiments show that the performance of this method does not depend on the thematic domain of the corpus, and its accuracy for the Greek language is around 95%.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "World Scientific Pub Co Inc"
        },
        {
            "Title": "A prototype for credit card fraud management: Industry paper",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3093742.3093912",
            "Abstract": "To prevent problems and capitalise on opportunities before they even occur, the research project SPEEDD proposed a methodology, and developed a prototype for proactive event-driven decisionmaking. We present the application of this methodology to credit card fraud management. The machine learning component of the SPEEDD prototype supports the online construction of fraud patterns, allowing it to efficiently adapt to the continuously changing fraud types. Moreover, the user interface of the prototype enables fraud analysts to make the most out of the results of automation (complex event processing) and thus reach informed decisions. Unlike most academic research on credit card fraud management, the assessment of the prototype (components) is based on representative transaction datasets, allowing for a realistic evaluation.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:a9-T7VOCCH8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event Recognition and Forecasting Tech-nology (Part 2)",
            "Publication year": 2014,
            "Publication url": "http://speedd-project.eu/sites/default/files/D3.1%20-%20First%20version%20of%20event%20recognition%20and%20forecasting%20technology%20v1%20-%20PART%202.pdf",
            "Abstract": "This document is the second part of the Deliverable 3.1 and presents the advancements made in event recognition and forecasting technology of the SPEEDD project, in order to reason about events and learn event definitions over large amounts of data, as well as under situations of uncertainty. SPEEDD develops a system for proactive event-driven decision-making. Decisions are triggered by forecasting events—whether they correspond to problems or opportunities—instead of reacting to them once they happen. The decisions are made in real-time and require on-the-fly processing of Big Data, ie, extremely large amounts of noisy data streaming from different geographical locations, as well as historical data. The effectiveness of the SPEEDD project will be evaluated in two use cases. First, proactive traffic management, aiming to forecast traffic congestions and thus to attenuate them. Second, proactive credit card fraud management, aiming to significantly improve fraud detection accuracy, without compromising efficiency, and forecast various types of fraudulent activity. SPEEDD implements event recognition methods (also known as event pattern matching or event pattern detection systems), in order to extract useful information, in the form of events, by processing time-evolving data that comes from various sources (eg, various types of sensor, network activity logs, ATMs, transactions, etc.). The extracted information—recognised and/or forecasted events—can be exploited by other systems or human experts, in order to monitor an environment and respond to the occurrence of significant events. Event recognition methods employ rich …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning subsumption hierarchies of ontology concepts from texts",
            "Publication year": 2010,
            "Publication url": "https://content.iospress.com/articles/web-intelligence-and-agent-systems-an-international-journal/wia178",
            "Abstract": "This paper proposes a method for learning ontologies given a corpus of text documents. The method identifies concepts in documents and organizes them into a subsumption hierarchy, without presupposing the existence of a seed ontology. The method uncovers latent topics for generating document text. The discovered topics form the concepts of the new ontology. Concept discovery is done in a language neutral way, using probabilistic space reduction techniques over the original term space of the corpus. Furthermore, the proposed method constructs a subsumption hierarchy of the concepts by performing conditional independence tests among pairs of latent topics, given a third one. The paper provides experimental results on the Genia and the Lonely Planet corpora from the domains of molecular biology and tourism respectively.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Logic-Based Event Recognition",
            "Publication year": 2012,
            "Publication url": "https://www.cambridge.org/core/journals/knowledge-engineering-review/article/logicbased-event-recognition/1F8D778FDFE07B8ABD10CD32BF217962",
            "Abstract": "Today's organizations require techniques for automated transformation of their large data volumes into operational knowledge. This requirement may be addressed by using event recognition systems that detect events/activities of special significance within an organization, given streams of ‘low-level’ information that is very difficult to be utilized by humans. Consider, for example, the recognition of attacks on nodes of a computer network given the Transmission Control Protocol/Internet Protocol messages, the recognition of suspicious trader behaviour given the transactions in a financial market and the recognition of whale songs given a symbolic representation of whale sounds. Various event recognition systems have been proposed in the literature. Recognition systems with a logic-based representation of event structures, in particular, have been attracting considerable attention, because, among others, they …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incremental reasoning for fleet management",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3328905.3332521",
            "Abstract": "We propose RTECinc, an incremental version of RTEC, a composite event recognition engine with formal, declarative semantics, that has been shown to scale to several real-world data streams. RTEC deals with delayed arrival of events by computing at each query time everything from scratch. This is often not efficient since it results to redundant computations. Instead, RTECinc deals with delays in a more efficient way, by updating only the affected events. We compare RTECinc and RTEC experimentally using a real-world dataset with position signals of vehicles.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Aul-kAQHnToC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive spam filtering using only naive bayes text classifiers",
            "Publication year": 2008,
            "Publication url": "https://nes.aueb.gr/ipl/nlp/pubs/ceas2008_paper.pdf",
            "Abstract": "In the past few years, machine learning and in particular simple Naive Bayes classifiers have proven their value in filtering spam emails. We hereby put Naive Bayes filters to the test, against potentially more elaborate spam filters that will participate in the ceas 2008 challenge. For this purpose, we use the variants of Naive Bayes that have proven more effective in our earlier studies. Furthermore, we propose a simple active learning method for adapting the filter, under partial online supervision.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:-f6ydRqryjwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of BioASQ 8a and 8b: Results of the Eighth Edition of the BioASQ Tasks a and b.",
            "Publication year": 2020,
            "Publication url": "http://ceur-ws.org/Vol-2696/paper_164.pdf",
            "Abstract": "In this paper, we present an overview of the eighth edition of the tasks a and b of the BioASQ challenge, which ran as a lab in the Conference and Labs of the Evaluation Forum (CLEF) 2020. BioASQ aims at promoting methodologies and systems for large-scale biomedical semantic indexing and question answering through the organization of yearly challenges since 2012. These shared tasks offer to teams around the world the opportunity to develop and compare their methods on the same benchmark datasets that represent the demanding information needs of biomedical experts. This year, apart from introduction of a new task on medical semantic indexing in Spanish (MESINESP8), the eighth versions of the two established BioASQ tasks on semantic indexing (8a) and question answering (8b) in English were also offered. In total, 34 teams with more than 100 systems participated in the three tasks of the challenge, with seven of them focusing on task 8a and 23 on task 8b. As in previous versions of the tasks, the evaluation of system responses reveals some participating systems managed to outperform the strong baselines, indicating that continuous advancements in state-of-the-art systems keep pushing the frontier of research leading to performance improvements.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ubry08Y2EpUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovering subsumption hierarchies of ontology concepts from text corpora",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4427123/",
            "Abstract": "This paper proposes a method for learning ontologies given a corpus of text documents. The method identifies concepts in documents and organizes them into a subsumption hierarchy, without presupposing the existence of a seed ontology. The method uncovers latent topics in terms of which document text is being generated. These topics form the concepts of the new ontology. This is done in a language neutral way, using probabilistic space reduction techniques over the original term space of the corpus. Given multiple sets of concepts (latent topics) being discovered, the proposed method constructs a subsumption hierarchy by performing conditional independence tests among pairs of latent topics, given a third one. The paper provides experimental results over the GENIA corpus from the domain of biomedicine.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "PNS: Personalized multi-source news delivery",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11893004_146",
            "Abstract": "This paper presents a system that integrates news from multiple sources on the Web and delivers in a personalized fashion to the reader. The presented service integrates automatic information extraction from various news sources and presentation of information according to the user’s interests. The system consists of source-specific information extraction programs (wrappers) that extract highlights of news items from the various sources, organize them according to pre-defined news categories and present them to the user through a personal Web-based interface. Dynamic personalization is used based on the user’s reading history, as well as the preferences of other similar users. User models are maintained by statistical analysis and machine learning algorithms. Results of an initial user study have confirmed the value of the service and indicated ways in which it should be improved.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:mB3voiENLucC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A probabilistic logic programming event calculus",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=6794029286978459041&hl=en&oi=scholarr",
            "Abstract": "We present a system for recognising human activity given a symbolic representation of video content. The input of our system is a set of time-stamped short-term activities (STA) detected on video frames. The output is a set of recognised long-term activities (LTA), which are pre-defined temporal combinations of STA. The constraints on the STA that, if satisfied, lead to the recognition of a LTA, have been expressed using a dialect of the Event Calculus. In order to handle the uncertainty that naturally occurs in human activity recognition, we adapted this dialect to a state-of-the-art probabilistic logic programming framework. We present a detailed evaluation and comparison of the crisp and probabilistic approaches through experimentation on a benchmark dataset of human surveillance videos.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic detection of linguistic indicators as a means of early prediction of Alzheimer’s and of related dementias: A crosslinguistics analysis",
            "Publication year": 2018,
            "Publication url": "https://www.researchgate.net/profile/Katerina-Fragkopoulou-3/publication/328421818_AUTOMATIC_DETECTION_OF_LINGUISTIC_INDICATORS_AS_A_MEANS_OF_EARLY_PREDICTION_OF_ALZHEIMER'S_AND_OF_RELATED_DEMENTIAS_A_CROSS-LINGUISTICS_ANALYSIS/links/5f438dec458515b729499805/AUTOMATIC-DETECTION-OF-LINGUISTIC-INDICATORS-AS-A-MEANS-OF-EARLY-PREDICTION-OF-ALZHEIMERS-AND-OF-RELATED-DEMENTIAS-A-CROSS-LINGUISTICS-ANALYSIS.pdf",
            "Abstract": "Conclusions• Alzheimer’s Disease (AD) and other types of dementia are associated with changes in spoken language",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:yqoGN6RLRZoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A bootstrapping approach to knowledge acquisition from multimedia content with ontology evolution",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.335.2054&rep=rep1&type=pdf",
            "Abstract": "We propose a bootstrapping approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to automate the ontology evolution process. This paper presents the basic components of the proposed approach and discusses the open research issues focusing on the synergy of extraction and evolution that will enable the development of scalable and precise knowledge acquisition technology.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Grammatical inference: algorithms and applications, Lecture Notes in Artificial Intelligence",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Springer"
        },
        {
            "Title": "Online Probabilistic Interval-Based Event Calculus",
            "Publication year": 2020,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/55194",
            "Abstract": "Activity recognition systems detect temporal combinations of ‘low-level’or ‘short-term’activities on sensor data. These systems exhibit various types of uncertainty, often leading to erroneous detection. We present an extension of an interval-based activity recognition system which operates on top of a probabilistic Event Calculus implementation. Our proposed system performs online recognition, as opposed to batch processing, thus supporting data streams. The empirical analysis demonstrates the efficacy of our system, comparing it to interval-based batch recognition, point-based recognition, as well as structure and weight learning models.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:0CzhzZyukY4C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "KOINOTITES: A web usage mining tool for personalization",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=5758807393639283170&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:PaBasH6fAo0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Classifying Users and Identifying User Interests in Folksonomies",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/George-Vouros/publication/268266686_Classifying_Users_and_Identifying_User_Interests_in_Folksonomies/links/54f6e2510cf21d8b8a5e4487/Classifying-Users-and-Identifying-User-Interests-in-Folksonomies.pdf",
            "Abstract": "This paper presents a probabilistic method for classifying folksonomy users to folksonomy sub-domains and identifying their particular interests. In particular, we propose a method for mining topic hierarchies that may reveal either the collective or the user-specific conceptualization of those domains, as these are reflected by users’ tags. We then propose two alternatives for identifying users’ interests in the domains: The first exploits users’ tags directly, and the second exploits users’ specific conceptualizations of each domain. Both approaches use the collective domain conceptualizations as “reference”, to which users’ tags and conceptualizations are compared. The proposed statistical method is parametric-less and does not require any prior knowledge or external resources. We apply the proposed method on the Del. icio. us online bookmarking system and we provide experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:q3oQSFYPqjQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Results of the 4th edition of BioASQ Challenge",
            "Publication year": 2016,
            "Publication url": "https://www.aclweb.org/anthology/W16-3101.pdf",
            "Abstract": "The goal of this task is to push the research frontier towards hybrid information systems. We aim to promote systems and approaches that are able to deal with the whole diversity of the Web, especially for, but not restricted to, the context of biomedicine. This goal is pursued by the organization of challenges. The fourth challenge, as the previous challenges, consisted of two tasks: semantic indexing and question answering. 16 systems participated by 7 different participating teams for the semantic indexing task. The question answering task was tackled by 37 different systems, developed by 11 different teams. 25 of the systems participated in the phase A of the task, while 12 participated in phase B. 3 of the teams participated in both phases of the question answering task. Overall, as in previous years, the best systems were able to outperform the strong baselines. This suggests that advances over the state of the art were achieved through the BIOASQ challenge but also that the benchmark in itself is very challenging. In this paper, we present the data used during the challenge as well as the technologies which were at the core of the participants’ frameworks.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:hCrLmN-GePgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Identifying the Presence and Severity of Dementia by Applying Interpretable Machine Learning Techniques on Structured Clinical Records",
            "Publication year": 2021,
            "Publication url": "https://www.researchsquare.com/article/rs-336921/latest.pdf",
            "Abstract": "Background: Dementia occurs through declining of cognitive abilities, and its early detection stands essential for effective preventive measures. However, mainstream diagnostic tests and screening tools, such as Cambridge Cognition Examination (CAMCOG) and Mini-Mental State Examination (MMSE), often fail to detect dementia accurately. Various graph-based or feature-dependent prediction and progression models have been proposed. Whenever these models exploit information in the patients’ electronic medical records, they represent promising options to identify the presence and severity of dementia more precisely. Methods: The methods presented in this paper aim to address two problems related to dementia:(a) Basic diagnosis: identifying the presence of dementia in individuals, and (b) Severity diagnosis: predicting the presence of dementia, as well as the severity of the disease. We formulate these two tasks as classification problems and address them using machine learning models based on random forests, analysing structured clinical data from an elderly population cohort. We perform a hybrid data curation method where a dementia expert is in the loop to ensure meaningful curation decisions. We then employ the machine learning algorithms that classify individual episodes into a specific dementia class. Decision trees are also used for enhancing the explainability of decisions made by prediction models, allowing medical experts to identify the most crucial patient features and their threshold values for the detection of dementia. Results: Our experiment results prove that clinical record features (such as age or comorbidities …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:MpfHP-DdYjUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Annotating Web pages for the needs of Web Information Extraction applications",
            "Publication year": 2002,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/WWW2003.pdf",
            "Abstract": "This paper outlines our approach to the creation of annotated corpora for the purposes of Web Information Extraction, and presents the Web Annotation tool. This tool enables the annotation of Web pages from different domains and for different information extraction tasks providing a user-friendly interface to human annotators. Annotated information is stored in a representation format that can easily be exploited.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:HDshCWvjkbEC",
            "Publisher": "\" Demokritos\" National Centre for Scientific Research"
        },
        {
            "Title": "A memory-based approach to anti-spam filtering for mailing lists",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/article/10.1023/A:1022948414856",
            "Abstract": "This paper presents an extensive empirical evaluation of memory-based learning in the context of anti-spam filtering, a novel cost-sensitive application of text categorization that attempts to identify automatically unsolicited commercial messages that flood mailboxes. Focusing on anti-spam filtering for mailing lists, a thorough investigation of the effectiveness of a memory-based anti-spam filter is performed using a publicly available corpus. The investigation includes different attribute and distance-weighting schemes, and studies on the effect of the neighborhood size, the size of the attribute set, and the size of the training corpus. Three different cost scenarios are identified, and suitable cost-sensitive evaluation functions are employed. We conclude that memory-based anti-spam filtering for mailing lists is practically feasible, especially when combined with additional safety nets. Compared to a previously …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:0EnyYjriUFMC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Complex event recognition under uncertainty: A short survey",
            "Publication year": 2015,
            "Publication url": "http://cer.iit.demokritos.gr/publications/papers/2015/elias15.pdf",
            "Abstract": "Complex Event Recognition (CER) applications exhibit various types of uncertainty, ranging from incomplete and erroneous data streams to imperfect complex event patterns. We review CER techniques that handle, to some extent, uncertainty. We examine both automata-based techniques, which are the most often, and logic-based ones, which are less frequently used. A number of limitations are identified with respect to the employed languages, their probabilistic models and their performance, as compared to the purely deterministic cases.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of the CLEF Question Answering Track 2015",
            "Publication year": 2015,
            "Publication url": "https://pub.uni-bielefeld.de/record/2909285",
            "Abstract": "Overview of the CLEF Question Answering Track 2015 Universität Bielefeld Universität Bielefeld \n× Title Click a name to choose. Click to show more. PUB - Publikationen an der Universität \nBielefeld Overview of the CLEF Question Answering Track 2015 Anselmo Peñas A, Unger C, \nPaliouras G, Kakadiaris I (2015) In: Experimental IR Meets Multilinguality, Multimodality, and \nInteraction: 6th International Conference of the CLEF Association, CLEF'15, Toulouse, France, \nSeptember 8-11, 2015, Proceedings. Mothe J, Savoy J, Kamps J, Pinel-Sauvagnat K, Jones \nGJF, SanJuan E, Cappellato L, Ferro N (Eds); Cham: Springer International Publishing: \n539--544. Sammelwerksbeitrag | Englisch Download Es wurde kein Volltext hochgeladen. Nur \nPublikationsnachweis! DOI 10.1007/978-3-319-24027-5_50 Details Zitieren Export / Suche \nPUB EnglishEN Autor*in Anselmo Peñas, Anselmo; Unger, Christina UniBi ; Paliouras, ; , *-…",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:0izLItjtcgwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel Model Exploration for Tumor Treatment Simulations",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2103.14132",
            "Abstract": "Computational systems and methods are being applied to solve biological problems for many years. Incorporating methods of this kind in the research for cancer treatment and related drug discovery in particular, is shown to be challenging due to the complexity and the dynamic nature of the related factors. Usually, there are two objectives in such settings; first to calibrate the simulators so as to reproduce real-world cases, and second, to search for specific values of the parameter space concerning effective drug treatments. We combine a multi-scale simulator for tumor cell growth and a Genetic Algorithm (GA) as a heuristic search method for finding good parameter configurations in reasonable time. The two modules are integrated into a single workflow that can be executed in a parallel manner on high performance computing infrastructures, since large-scale computational and storage capabilities are necessary in this domain. After using the GA for calibration, our goal is to explore different drug delivery schemes. Among these schemes, we aim to find those that minimize tumor cell size and the probability of emergence of drug resistant cells in the future. Results from experiments on high performance computing infrastructure illustrate the effectiveness and timeliness of the approach.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:nRpfm8aw39MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Large-scale mining of usage data on web sites",
            "Publication year": 2000,
            "Publication url": "https://www.aaai.org/Papers/Symposia/Spring/2000/SS-00-01/SS00-01-020.pdf",
            "Abstract": "In this paper we present an approach to the discovery of trends in the usage of large Web-based information systems. This approach is based on the empirical analysis of the users′ interaction with the system and the construction of user groups with common interests (user communities). The empirical analysis is achieved with the use of cluster mining, a technique that process data collected from the users’ interaction with the Web site. Our main concern is the construction of meaningful communities, which can be used for improving the structure of the site as well as for making suggestions to the users at a personal level. Our case study on a site providing information for researchers in Chemistry shows that the proposed method provides effective mining of large usage databases.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:dhFuZR0502QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Special Issue of the Machine Learning Journal on Grammatical Inference",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=11735032187296500582&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Springer"
        },
        {
            "Title": "Automatic detection of linguistic indicators as a means of early detection of Alzheimer's disease and of related dementias: A computational linguistics analysis",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8268212/",
            "Abstract": "In the present study, we analyzed written samples obtained from Greek native speakers diagnosed with Alzheimer's in mild and moderate stages and from age-matched cognitively normal controls (NC). We adopted a computational approach for the comparison of morpho-syntactic complexity and lexical variety in the samples. We used text classification approaches to assign the samples to one of the two groups. The classifiers were tested using various features: morpho-syntactic and lexical characteristics. The proposed method excels in discerning AD patients in mild and moderate stages from NC leading to the in-depth understanding of language deficits.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:mNrWkgRL2YcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lshtc: A benchmark for large-scale text classification",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1503.08581",
            "Abstract": "LSHTC is a series of challenges which aims to assess the performance of classification systems in large-scale classification in a a large number of classes (up to hundreds of thousands). This paper describes the dataset that have been released along the LSHTC series. The paper details the construction of the datsets and the design of the tracks as well as the evaluation measures that we implemented and a quick overview of the results. All of these datasets are available online and runs may still be submitted on the online server of the challenges.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:vbGhcppDl1QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation infrastructure software for future oracle use",
            "Publication year": 2014,
            "Publication url": "http://www.bioasq.org/sites/default/files/PublicDocuments/BioASQ_D4.9-Evaluation%20infrastructure%20software%20for%20future%20oracle%20use_final-revised.pdf",
            "Abstract": "Number of pages 19 Author (s) Georgios Balikas, Ioannis Partalas, Nicolas Baskiotis, Thierry Artieres, Eric Gaussier, Patrick Gallinari, Ioannis Vetsikas, George Paliouras and Aris Kosmopoulos Internal Reviewers Prodromos Malakasiotis Status & version Final-revised",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:BwyfMAYsbu0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "P4‐151: IASIS: BIG DATA FOR PRECISION MEDICINE",
            "Publication year": 2018,
            "Publication url": "https://alz-journals.onlinelibrary.wiley.com/doi/abs/10.1016/j.jalz.2018.06.2556",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:LhH-TYMQEocC",
            "Publisher": "Unknown"
        },
        {
            "Title": "User-Oriented Evaluation of Event-Based Decision Support Systems",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6495042/",
            "Abstract": "Artificial Intelligence-based event recognition systems carry high potential for organisations to utilise their structured and unstructured data. The application of these systems as a backbone of decision support systems allows for effective and efficient information management. To sufficiently evaluate such kind of integrated systems recognising events for the benefit of decision makers, a holistic methodology is necessary. We propose a new methodology which complements existing approaches for technology-oriented verification and validation by user-oriented evaluation (user experience analysis). We illustrate the proposed methodology by evaluating EP-IRM, an event processing system for intelligent resource management. This case study shows that our methodology offers invaluable information about the performance and acceptance of an event based decision support system.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Management of large spatial ontology bases",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75474-9_7",
            "Abstract": "In this paper we propose a method for efficient management of large spatial ontologies. Current spatial ontologies are usually represented using an ontology language, such as OWL and stored as OWL files. However, we have observed some shortcomings using this approach especially in the efficiency of spatial query processing. This fact motivated the development of a hybrid approach that uses an R-tree as a spatial index structure. In this way we are able to support efficient query processing over large spatial ontologies, maintaining the benefits of ontological reasoning. We present a case study for emergency teams during Search and Rescue (SaR) operations showing how an Ontology Data Service (SHARE-ODS) can benefit from a spatial index. Performance evaluation shows the superiority of our proposed technique compared to the original approach. To the best of our knowledge, this is the first …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "BioASQ: A Challenge on Large-Scale Biomedical Semantic Indexing and Question Answering",
            "Publication year": 2012,
            "Publication url": "https://www.aaai.org/ocs/index.php/FSS/FSS12/paper/viewPaper/5600",
            "Abstract": "This article provides an overview of BioASQ, a new competition on biomedical semantic indexing and question answering (QA). BioASQ aims to push towards systems that will allow biomedical workers to express their information needs in natural language and that will return concise and user-understandable answers by combining information from multiple sources of different kinds, including biomedical articles, databases, and ontologies. BioASQ encourages participants to adopt semantic indexing as a means to combine multiple information sources and to facilitate the matching of questions to answers. It also adopts a broad semantic indexing and QA architecture that subsumes current relevant approaches, even though no current system instantiates all of its components. Hence, the architecture can also be seen as our view of how relevant work from fields such as information retrieval, hierarchical classification, question answering, ontologies, and linked data can be combined, extended, and applied to biomedical question answering. BioASQ will develop publicly available benchmarks and it will adopt and possibly refine existing evaluation measures. The evaluation infrastructure of the competition will remain publicly available beyond the end of BioASQ.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable semantic annotation of text using lexical and web resources",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12842-4_32",
            "Abstract": "In this paper we are dealing with the task of adding domain-specific semantic tags to a document, based solely on the domain ontology and generic lexical and Web resources. In this manner, we avoid the need for trained domain-specific lexical resources, which hinder the scalability of semantic annotation. More specifically, the proposed method maps the content of the document to concepts of the ontology, using the WordNet lexicon and Wikipedia. The method comprises a novel combination of measures of semantic relatedness and word sense disambiguation techniques to identify the most related ontology concepts for the document. We test the method on two case studies: (a) a set of summaries, accompanying environmental news videos, (b) a set of medical abstracts. The results in both cases show that the proposed method achieves reasonable performance, thus pointing to a promising path for …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Determining automatically the size of learned ontologies",
            "Publication year": 2008,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/4494",
            "Abstract": "Determining the size of an ontology that is automatically learned from texts is an open issue. In this paper, we study the similarity between ontology concepts at different levels of a taxonomy, quantifying in a natural manner the quality of the ontology attained. Our approach is integrated in a method for language-neutral learning of ontologies from texts, which relies on conditional independence tests over thematic topics that are discovered using LDA.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ns9cj8rnVeAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "40_ AI Ethics in Predictive Policing: From Models of Threat to an Ethics of Care",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8733935/",
            "Abstract": "Table of Contents Page 1 2 IEEE TECHNOLOGY AND SOCIETY MAGAZINE ∕ JUNE 2019 \nDigital Object Identifier 10.1109/MTS.2019.2913063 Date of publication: 30 May 2019 ON THE \nCOVER: WHATEVER THE PROMISE OF AUTOMATION AND ARTIFICIAL INTELLIGENCE, \nFUTURE TRANSPORTATION WILL REQUIRE AN INTEGRATED AND TRANSPARENT \nAPPROACH. SEE PP. 22–38 OF THIS ISSUE FOR MORE. IMAGE: ISTOCK/OWNGARDEN. \nVolume 38, Number 2, June 2019 www.technologyandsociety.org *Refereed articles. Fe a tu re \ns 40_ AI Ethics in Predictive Policing: From Models of Threat to an Ethics of Care Peter M. Asaro \n54_ Interactive Extreme-Scale Analytics: Towards Battling Cancer* Nikos Giatrakos, Nikos \nKatzouris, Antonios Deligiannakis, Alexander Artikis, Minos Garofalakis, George Paliouras, \nHolger Arndt, Raffaele Grasso, Ralf Klinkenberg, Miguel Ponce De León, Gian Gaetano , , : ’…",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:cK4Rrx0J3m0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Drug-Drug Interaction Prediction on a Biomedical Literature Knowledge Graph",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-59137-3_12",
            "Abstract": "Knowledge Graphs provide insights from data extracted in various domains. In this paper, we present an approach discovering probable drug-to-drug interactions, through the generation of a Knowledge Graph from disease-specific literature. The Graph is generated using natural language processing and semantic indexing of biomedical publications and open resources. The semantic paths connecting different drugs in the Graph are extracted and aggregated into feature vectors representing drug pairs. A classifier is trained on known interactions, extracted from a manually curated drug database used as a golden standard, and discovers new possible interacting pairs. We evaluate this approach on two use cases, Alzheimer’s Disease and Lung Cancer. Our system is shown to outperform competing graph embedding approaches, while also identifying new drug-drug interactions that are validated retrospectively.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:1lhNe0rCu4AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Interactive Extreme-Scale Analytics: Towards Battling Cancer",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8733936/",
            "Abstract": "A synergetic understanding of cancer evolution and the effect of combination drug therapies on the disease is the cornerstone for developing effective personalized treatments, which can radically improve patients' well-being and their quality of (work and social) life. By extension, improving the treatment of patients indirectly enhances the quality of life for families, friends, and careers. Moreover, personalizing effective therapeutic approaches reduces treatment duration, cutting down healthcare monetary costs, which can be redirected to other health and social services. Given that three out of four U.S. families will at some point experience a family member suffering from cancer (http://natamcancer.org/NAP_Native_American_Priorities.pdf), the potential impact of improved cancer treatment is of considerable socio-economic and organizational significance.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:_OXeSy2IsFwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analyzing the DNA composition of ultraconserved sequences with N-gram Graphs",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:hkOj_22Ku90C",
            "Publisher": "Unknown"
        },
        {
            "Title": "BOEMIE: Bootstrapping ontology evolution with multimedia information extraction",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1576045/",
            "Abstract": "The BOEMIE project proposes a bootstrapping approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to automate the ontology evolution process.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ZHo1McVdvXMC",
            "Publisher": "IET"
        },
        {
            "Title": "Identifying Word Senses in Greek Text: A comparison of machine learning methods",
            "Publication year": 2001,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/IFDICON2001.pdf",
            "Abstract": "In this paper we perform a comparative evaluation of machine learning methods on the task of identifying the correct sense of a word, based on the context in which it appears. This task is known as word sense disambiguation (WSD) and is one of the hardest and most interesting issues in language engineering. Research on the use of machine learning techniques for WSD has so far focused almost exclusively on English words, due to the scarcity of the required linguistic resources for other languages. The work presented here is the first attempt to apply machine learning methods to Greek words. We have constructed a semantically tagged corpus for two Greek words: a noun with clearly distinguishable senses and a verb with overlapping senses. This corpus is used to evaluate four different machine learning methods and three different representations of the context of the ambiguous word. Our results show that the simple naïve Bayesian classifier and a method using Support Vector Machines outperform decision tree induction, even with the use of boosting. Furthermore, the use of a distance-based weighting function for the context of the ambiguous word does not seem to have a substantial effect on the performance of the methods.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What is all this new MeSH about? Exploring the semantic provenance of new descriptors in the MeSH thesaurus",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2101.08293",
            "Abstract": "The Medical Subject Headings (MeSH) thesaurus is a controlled vocabulary widely used in biomedical knowledge systems, particularly for semantic indexing of scientific literature. As the MeSH hierarchy evolves through annual version updates, some new descriptors are introduced that were not previously available. This paper explores the conceptual provenance of these new descriptors. In particular, we investigate whether such new descriptors have been previously covered by older descriptors and what is their current relation to them. To this end, we propose a framework to categorize new descriptors based on their current relation to older descriptors. Based on the proposed classification scheme, we quantify, analyse and present the different types of new descriptors introduced in MeSH during the last fifteen years. The results show that only about 25% of new MeSH descriptors correspond to new emerging concepts, whereas the rest were previously covered by one or more existing descriptors, either implicitly or explicitly. Most of them were covered by a single existing descriptor and they usually end up as descendants of it in the current hierarchy, gradually leading towards a more fine-grained MeSH vocabulary. These insights about the dynamics of the thesaurus are useful for the retrospective study of scientific articles annotated with MeSH, but could also be used to inform the policy of updating the thesaurus in the future.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:LdasjJ6CEcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graph vs. bag representation models for the topic classification of web documents",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11280-015-0365-x",
            "Abstract": "Text classification constitutes a popular task in Web research with various applications that range from spam filtering to sentiment analysis. In this paper, we argue that its performance depends on the quality of Web documents, which varies significantly. For example, the curated content of news articles involves different challenges than the user-generated content of blog posts and Social Media messages. We experimentally verify our claim, quantifying the main factors that affect the performance of text classification. We also argue that the established bag-of-words representation models are inadequate for handling all document types, as they merely extract frequent, yet distinguishing terms from the textual content of the training set. Thus, they suffer from low robustness in the context of noisy or unseen content, unless they are enriched with contextual, application-specific information. In their place, we …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:gsN89kCJA0AC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Role identification from free text using hidden Markov models",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_16",
            "Abstract": "In this paper we explore the use of hidden Markov models on the task of role identification from free text. Role identification is an important stage of the information extraction process, assigning roles to particular types of entities with respect to a particular event. Hidden Markov models (HMMs) have been shown to achieve good performance when applied to information extraction tasks in both semistructured and free text. The main contribution of this work is the analysis of whether and how linguistic processing of textual data can improve the extraction performance of HMMs. The emphasis is on the minimal use of computationally expensive linguistic analysis. The overall conclusion is that the performance of HMMs is still worse than an equivalent manually constructed system. However, clear paths for improvement of the method are shown, aiming at a method, which is easily adaptable to new domains.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:RGFaLdJalmkC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Domain-specific Web site identification: the CROSSMARC focused Web crawler",
            "Publication year": 2003,
            "Publication url": "https://www.pure.ed.ac.uk/ws/files/24779255/02bfe50d1e332a7229000000.pdf",
            "Abstract": "This paper presents techniques for identifying domain specific web sites that have been implemented as part of the EC-funded R&D project, CROSSMARC. The project aims to develop technology for extracting interesting information from domain-specific web pages. It is therefore important for CROSSMARC to identify web sites in which interesting domain specific pages reside (focused web crawling). This is the role of the CROSSMARC web crawler.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An event calculus for event recognition",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6895142/",
            "Abstract": "Systems for symbolic event recognition accept as input a stream of time-stamped events from sensors and other computational devices, and seek to identify high-level composite events, collections of events that satisfy some pattern. RTEC is an Event Calculus dialect with novel implementation and `windowing' techniques that allow for efficient event recognition, scalable to large data streams. RTEC supports the expression of rather complex events, such as `two people are fighting', using simple primitives. It can operate in the absence of filtering modules, as it is only slightly affected by data that are irrelevant to the events we want to recognise. Furthermore, RTEC can deal with applications where event data arrive with a (variable) delay from, and are revised by, the underlying sources. RTEC can update already recognised events and recognise new events when data arrive with a delay or following data revision …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:URolC5Kub84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Focused crawling using temporal difference-learning",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24674-9_16",
            "Abstract": "This paper deals with the problem of constructing an intelligent Focused Crawler, i.e. a system that is able to retrieve documents of a specific topic from the Web. The crawler must contain a component which assigns visiting priorities to the links, by estimating the probability of leading to a relevant page in the future. Reinforcement Learning was chosen as a method that fits this task nicely, as it provides a method for rewarding intermediate states to the goal. Initial results show that a crawler trained with Reinforcement Learning is able to retrieve relevant documents after a small number of steps.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:isC4tDSrTZIC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A challenge on large-scale biomedical semantic indexing and question answering",
            "Publication year": 2014,
            "Publication url": "https://pdfs.semanticscholar.org/574a/a45e8868844e31e047c8a9227a2cea706ed6.pdf",
            "Abstract": "BioASQ Page 1 BioASQ A challenge on large-scale biomedical semantic indexing and question \nanswering George Paliouras and Anastasia Krithara NCSR “D” 27th September 2013 BioASQ \nWorkshop, Valencia Intelligent Information Management Targeted Competition Framework \nICT-2011.4.4(d) George Paliouras and Anastasia Krithara. BioASQ, 27th September 2013 1 / \n28 Page 2 Outline Introduction Presentation of the challenge Task 1A Task 1B Conclusions \nand Perspectives Social Network Stay Tuned! Panel Discussion George Paliouras and \nAnastasia Krithara. BioASQ, 27th September 2013 2 / 28 Page 3 Introduction What is BioASQ \nA competition funded by the European Union (FP7) ► BioASQ initiates a series of challenges \non biomedical semantic indexing and question answering (QA). ► Participants are required \nto index semantically content form large-scale biomedical resources (eg MEDLINE) and/to …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:uDGL6kOW6j0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Graph representation learning for structural proteomics",
            "Publication year": 2021,
            "Publication url": "https://portlandpress.com/emergtoplifesci/article-abstract/doi/10.1042/ETLS20210225/229961",
            "Abstract": "The field of structural proteomics, which is focused on studying the structure–function relationship of proteins and protein complexes, is experiencing rapid growth. Since the early 2000s, structural databases such as the Protein Data Bank are storing increasing amounts of protein structural data, in addition to modeled structures becoming increasingly available. This, combined with the recent advances in graph-based machine-learning models, enables the use of protein structural data in predictive models, with the goal of creating tools that will advance our understanding of protein function. Similar to using graph learning tools to molecular graphs, which currently undergo rapid development, there is also an increasing trend in using graph learning approaches on protein structures. In this short review paper, we survey studies that use graph learning techniques on proteins, and examine their successes and …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:L1USKYWJimsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation measures for hierarchical classification: a unified view and novel approaches",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10618-014-0382-x",
            "Abstract": "Hierarchical classification addresses the problem of classifying items into a hierarchy of classes. An important issue in hierarchical classification is the evaluation of different classification algorithms, an issue which is complicated by the hierarchical relations among the classes. Several evaluation measures have been proposed for hierarchical classification using the hierarchy in different ways without however providing a unified view of the problem. This paper studies the problem of evaluation in hierarchical classification by analysing and abstracting the key components of the existing performance measures. It also proposes two alternative generic views of hierarchical evaluation and introduces two corresponding novel measures. The proposed measures, along with the state-of-the-art ones, are empirically tested on three large datasets from the domain of text classification. The empirical results illustrate …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Springer US"
        },
        {
            "Title": "TPN 2: Using positive-only learning to deal with the heterogeneity of labeled and unlabeled data",
            "Publication year": 2006,
            "Publication url": "http://ecmlpkdd2006.org/discovery_challenge_proceedings.pdf#page=67",
            "Abstract": "This paper introduces TPN2, the runner up method in both tasks of the ECML-PKDD Discovery Challenge 2006 on personalized spam filtering. TPN2 is a classifier training method that bootstraps positive-only learning with fully-supervised learning, in order to make the most of labeled and unlabeled data, under the assumption that the two are drawn from significantly different distributions. Furthermore, the unlabeled data themselves are separated into subsets that are assumed to be drawn from multiple distributions. For that reason, TPN2 trains a different classifier for each subset, making use of all unlabeled data each time.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SaR resource management based on Description Logics",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-75668-2_7",
            "Abstract": "The management of resources is a great challenge for commanders in Search and Rescue operations and has a strong impact on all areas of operation control, as command-and-communication structure, geo-referenced information, and operational tasks are inter-connected with complex relations. During an operation these are subject to dynamic changes. For an efficient operation control commanders need access to up-to-date information in their mobile working environment. This paper presents a new approach to manage resources and their relations in an operation. It is based on ontologies to build a model of an operation and Description Logic reasoning to provide enhanced decision support.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:maZDTaKrznsC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Wayeb: a tool for complex event forecasting",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1901.01826",
            "Abstract": "Complex Event Processing (CEP) systems have appeared in abundance during the last two decades. Their purpose is to detect in real-time interesting patterns upon a stream of events and to inform an analyst for the occurrence of such patterns in a timely manner. However, there is a lack of methods for forecasting when a pattern might occur before such an occurrence is actually detected by a CEP engine. We present Wayeb, a tool that attempts to address the issue of Complex Event Forecasting. Wayeb employs symbolic automata as a computational model for pattern detection and Markov chains for deriving a probabilistic description of a symbolic automaton.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:OP4eGU-M3BUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting the evolution of communities in social networks",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2797115.2797119",
            "Abstract": "We studied the predictability of community evolution in on-line social networks as a supervised learning task with sequential and non-sequential classifiers. Communities that are formed in on-line social networks as a result of user interaction evolve over time. Structural, content and contextual features as well as the previous states of a community are considered as the features that are involved in the task of community evolution. The evolution phenomena we try to predict are the continuation, shrinking, growth and dissolution. The evolution labels stem from a community tracker that provided the background truth. We have obtained interesting results on a set from Twitter.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Predicting the evolution of communities in social networks using structural and temporal features",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8022665/",
            "Abstract": "During the last years, there is increasing interest in analyzing social networks and modeling their dynamics at different scales. This work focuses on predicting the future form of communities, which represent the mesoscale structure of networks, while the communities arise as a result of user interaction. We employ several structural and temporal features to represent communities, along with their past form, that are used to formulate a supervised learning task to predict whether a community will continue as currently is, shrink, grow or completely disappear. To test our methodology, we created a real-life social network dataset consisting of an excerpt of posts from the Mathematics Stack Exchange Q&A site. In the experiments, special care is taken in handling the class imbalance in the dataset and in investigating how the past evolutions of a community affect predictions.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:6ZxmRoH8BuwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Ontology population and enrichment: State of the art",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-20795-2_6",
            "Abstract": "Ontology learning is the process of acquiring (constructing or integrating) an ontology (semi-) automatically. Being a knowledge acquisition task, it is a complex activity, which becomes even more complex in the context of the BOEMIE project, due to the management of multimedia resources and the multi-modal semantic interpretation that they require. The purpose of this chapter is to present a survey of the most relevant methods, techniques and tools used for the task of ontology learning. Adopting a practical perspective, an overview of the main activities involved in ontology learning is presented. This breakdown of the learning process is used as a basis for the comparative analysis of existing tools and approaches. The comparison is done along dimensions that emphasize the particular interests of the BOEMIE project. In this context, ontology learning in BOEMIE is treated and compared to the state of the …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Error detection in Knowledge Graphs: Path Ranking, Embeddings or both",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Konstantinos-Bougiatiotis/publication/339398812_Error_detection_in_Knowledge_Graphs_Path_Ranking_Embeddings_or_both/links/5ef372aaa6fdcceb7b1f94fb/Error-detection-in-Knowledge-Graphs-Path-Ranking-Embeddings-or-both.pdf",
            "Abstract": "This paper attempts to compare and combine different approaches for detecting errors in Knowledge Graphs. Knowledge Graphs constitute a mainstream approach for the representation of relational information on big heterogeneous data, however, they may contain a big amount of imputed noise when constructed automatically. To address this problem, different error detection methodologies have been proposed, mainly focusing on path ranking and representation learning. This work presents various mainstream approaches and proposes a novel hybrid and modular methodology for the task. We compare these methods on two benchmarks and one realworld biomedical publications dataset, showcasing the potential of our approach and drawing insights regarding the state-of-art in error detection in Knowledge Graphs.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:4xDN1ZYqzskC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Results of the seventh edition of the BioASQ challenge",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-43887-6_51",
            "Abstract": " The results of the seventh edition of the BioASQ challenge are presented in this paper. The aim of the BioASQ challenge is the promotion of systems and methodologies through the organization of a challenge on the tasks of large-scale biomedical semantic indexing and question answering. In total, 30 teams with more than 100 systems participated in the challenge this year. As in previous years, the best systems were able to outperform the strong baselines. This suggests that state-of-the-art systems are continuously improving, pushing the frontier of research. ",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:jL-93Qbq4QoC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Learning rules for large-vocabulary word sense disambiguation: A comparison of various classifiers",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45154-4_35",
            "Abstract": "In this article we compare the performance of various machine learning algorithms on the task of constructing word-sense disambiguation rules from data. The distinguishing characteristic of our work from most of the related work in the field is that we aim at the disambiguation of all content words in the text, rather than focussing on a small number of words. In an earlier study we have shown that a decision tree induction algorithm performs well on this task. This study compares decision tree induction with other popular learning methods and discusses their advantages and disadvantages. Our results confirm the good performance of decision tree induction, which outperforms the other algorithms, due to its ability to order the features used for disambiguation, according to their contribution in assigning the correct sense.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Big data for supporting precision medicine in lung cancer patients.",
            "Publication year": 2018,
            "Publication url": "https://ascopubs.org/doi/abs/10.1200/JCO.2018.36.15_suppl.e20546",
            "Abstract": "e20546Background: Lung cancer is a heterogeneous disease, with characteristics that differ between patients and even among regions of the same tumor. One of the main challenges of precision medicine is the integration and analysis of clinical data. Electronic Health Records (EHR) are comprised of clinical notes and medical reports written in free text containing information from each patient that remains stored in the EHR system unused. Our aim is to exploit and integrate this information to improve lung cancer management using Big Data technologies. Methods: Clinical data from 706 patients diagnosed with lung cancer from 2012 to 2017 and treated at the Medical Oncology Department at Puerta de Hierro University Hospital was obtained. A total of 7,146 clinical reports and 171,878 clinical notes were analyzed, post-anonymization. Our method is based on the execution of a framework built on top of Apache …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:gVv57TyPmFsC",
            "Publisher": "American Society of Clinical Oncology"
        },
        {
            "Title": "Data Mining for Personalization and Cross-Recommendation-Exploiting Probabilistic Latent Information for the Construction of Community Web Directories",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=13781869200746054738&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:XvxMoLDsR5gC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Run-time composite event recognition",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2335484.2335492",
            "Abstract": "Events are particularly important pieces of knowledge, as they represent activities of special significance within an organisation: the automated recognition of events is of utmost importance. We present RTEC, an Event Calculus dialect for run-time event recognition and its Prolog implementation. RTEC includes a number of novel techniques allowing for efficient run-time recognition, scalable to large data streams. It can be used in applications where data might arrive with a delay from, or might be revised by, the underlying event sources. We evaluate RTEC using a real-world application.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ER Designer Toolkit: A Graphical Event Definition Authoring Tool",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Pythagoras-Karampiperis-2/publication/264051437_ER_Designer_Toolkit_A_Graphical_Event_Definition_Authoring_Tool/links/0f31753ccc0fc66ca9000000/ER-Designer-Toolkit-A-Graphical-Event-Definition-Authoring-Tool.pdf",
            "Abstract": "Currently there exist several tools for Complex Event Recognition, varying from design platforms for business process modeling (BPM) to advanced Complex Event Processing (CEP) engines. Several efforts have been reported in literature aiming to support domain experts in the process of defining event recognition (ER) rules. However, few of them offer graphical design environments for the definition of such rules, limiting the broad adoption of ER systems. In this paper, we present a graphical Event Definition Authoring Tool, referred to as the Event Recognition Designer Toolkit (ERDT) with which, a domain expert can easily design event recognition rules on temporal data and produce standalone Event Recognizers.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:08ZZubdj9fEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A distributional approach to evaluating ontology learning methods using a gold standard",
            "Publication year": 2008,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/OLP3_ECAI08.pdf",
            "Abstract": "This paper presents a method for the evaluation of learned ontologies against gold standards. The proposed method transforms the ontology concepts to a vector space representation to avoid the common string matching of concepts at the lexical layer. We propose a set of evaluation measures that exploit the concepts’ representations and calculate the similarity of the two hierarchies. Experiments show that these measures scale gradually in the closed interval of [0, 1] as learned ontologies deviate increasingly from the gold standard. The proposed method is tested using the Genia and the Lonely Planet gold standard ontologies.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:r0BpntZqJG4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Allen's Hourglass: Probabilistic Treatment of Interval Relations",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601881/",
            "Abstract": "The paper is motivated by the need to handle robustly the uncertainty of temporal intervals, e.g. as it occurs in automated event detection in video streams. The paper introduces a two-dimensional mapping of Allen's relations, based on orthogonal characteristics of interval relations, namely relative position and relative size. The hourglass-shaped mapping also represents limit cases that correspond to durationless intervals. Based on this mapping, we define two sets of primitive interval relations in terms of the relative positioning and relative size of intervals. These primitives are then used to derive a probabilistic set of Allen's relations. A number of example cases are presented to illustrate how the proposed approach can improve the robustness of interval relations.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Tiz5es2fbqcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using Machine Learning to Maintain Rule-based Named-Entity Recognition and Classification Systems",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=2007073007943572655&hl=en&oi=scholarr",
            "Abstract": "This paper presents a method that as-sists in maintaining ar ule-based named-entity recognition and classification system. The underlying idea is to use a separate system, constructed with the use of machine learning, to monitor the performance of the rule-based sys-tem. The training data for the second system is generated with the use of the rule-based system, thus avoiding the need for manual tagging. The dis-agreement of the two systems acts as a signal for updating the rule-based sys-tem. The generality of the approach is illustrated by applying it to large corpora in two different languages: Greek and French. The results are very en-couraging, showing that this alternative use of machine learning can assist sig-nificantly in the maintenance of rule-based systems. into the construction of generic tools that can quickly adapt to a particular thematic domain. The adaptation of these tools mainly involves the adaptation of domain-specific semantic lexi-cal resources.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:kw52XkFRtyQC",
            "Publisher": "Morgan Kaufmann"
        },
        {
            "Title": "Technology Overview Report 2",
            "Publication year": 2014,
            "Publication url": "http://bioasq.org/sites/default/files/PublicDocuments/BioASQ_D5.3-Technology_Overview_Report_2_final.pdf",
            "Abstract": "This deliverable reviews the systems that participated during the second B ASQ challenge and performs an analysis of the results. More specifically, in the deliverable a short description of each system is given providing also the key technologies that have been used. The objective of this deliverable is to identify the most promising approaches and to point out the progress made with the state-of-the-art. The challenge comprised two tasks: a) large-scale online biomedical indexing (Task 2a) and b) biomedical semantic QA (Task 2b). Both tasks run in five consecutive batches. In Task 2a 18 teams participated using 61 registered systems. The systems were evaluated in several performance measures and compared against two baseline systems. Most of them were able to cope with the large scale of the problem while three of them achieved to systematically outperform the state-of-the-art baseline (Medical Text Indexer). A variety of methods have been used like machine learning approaches or search-based ones and hierarchical or flat ones. Specifically, the best systems achieved to enlarge the margin of performance with the MTI system which also this year improved its performance. In Task 2b 8 teams participated in both phases of the task with a total of 15 systems. In both phases the systems were able to achieve good performances and in most cases to achieve better results than the baselines.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:OR75R8vi5nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Mining web sites using wrapper induction, named entities, and post-processing",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30123-3_6",
            "Abstract": "This paper presents a new framework for extracting information from collections of Web pages across different sites. In the proposed framework, a standard wrapper induction algorithm is used that exploits named entity information that has been previously identified. The idea of post-processing the extraction results is introduced for resolving ambiguous fields and improving the overall extraction performance. Post-processing involves the exploitation of two additional sources of information: field transition probabilities, based on a trained bigram model, and confidence scores, estimated for each field by the wrapper induction system. A multiplicative model that is based on the product of those two probabilities is also considered for post-processing. Experiments were conducted on pages describing laptop products, collected from many different sites and in four different languages. The results highlight the …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Machine learning methods applied to genotyping data capture interactions between single nucleotide variants in late onset Alzheimer's disease",
            "Publication year": 2021,
            "Publication url": "https://www.medrxiv.org/content/10.1101/2021.08.30.21262815.abstract",
            "Abstract": "INTRODUCTION  Genome-wide association studies (GWAS) in late onset Alzheimer9s disease (LOAD) provide lists of individual genetic determinants. However, GWAS are not good at capturing the synergistic effects among multiple genetic variants and lack good specificity.    METHODS    We applied tree-based machine learning algorithms (MLs) to discriminate LOAD (> 700 individuals) and age-matched unaffected subjects using single nucleotide variants (SNVs) from AD studies, obtaining specific genomic profiles with the prioritized SNVs.   RESULTS   The MLs prioritized a set of SNVs located in close proximity genes PVRL2, TOMM40, APOE and APOC1. The captured genomic profiles in this region showed a clear interaction between rs405509 and rs1160985. Additionally, rs405509 located in APOE promoter interacts with rs429358 among others, seemingly neutralizing their predisposing effect. Interactions are characterized by their association with specific comorbidities and the presence of eQTL and sQTLs.  DISCUSSION  Our approach efficiently discriminates LOAD from controls, capturing genomic profiles defined by interactions among SNVs in a hot-spot region.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:XUvXOeBm_78C",
            "Publisher": "Cold Spring Harbor Laboratory Press"
        },
        {
            "Title": "Automatically annotating the ODP Web taxonomy",
            "Publication year": 2007,
            "Publication url": "http://linc.ucy.ac.cy/assets/files/publications/pdfs/2007-PCI.pdf",
            "Abstract": "In this paper we present the ideas and algorithms developed around our KeyGen Web Taxonomy Annotation engine. KeyGen annotates the Open Directory Project, also known as Dmoz, with meaningful and previously unknown keywords by utilizing domain knowledge extracted from the WWW. We present two algorithms: i) The PageParse Algorithm, which efficiently extracts keywords from Web Taxonomies using a combination of local and global scores, and ii) the Support Algorithm, an I/O optimized algorithm for coalescing hierarchies of keywords. We then present the results: i) from constructing a richly annotated ODP Web taxonomy and ii) from evaluating the correctness of this structure by performing an automated classification of Web-pages.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:UHK10RUVsp4C",
            "Publisher": "New Technologies Publications"
        },
        {
            "Title": "Scalable proactive event-driven decision making",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901314/",
            "Abstract": "This paper proposes a methodology for proactive event-driven decision making. Proper decisions are made by forecasting events prior to their occurrence. Motivation for proactive decision making stems from social and economic factors, and is based on the fact that prevention is often more effective than the cure. The decisions are made in real time and require swift and immediate processing of Big Data, that is, extremely large amounts of noisy data flooding in from various locations, as well as historical data. The methodology will recognize and forecast opportunities and threats, making the decision to capitalize on the opportunities and mitigate the threats. This will be explained through user-interaction and the decisions of human operators, in order to ultimately facilitate proactive decision making.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:zLWjf1WUPmwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Online structure learning for traffic management",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-63342-8_3",
            "Abstract": "Most event recognition approaches in sensor environments are based on manually constructed patterns for detecting events, and lack the ability to learn relational structures in the presence of uncertainty. We describe the application of , an online structure learner for Markov Logic Networks that exploits Event Calculus axiomatizations, to event recognition for traffic management. Our empirical evaluation is based on large volumes of real sensor data, as well as synthetic data generated by a professional traffic micro-simulator. The experimental results demonstrate that  can effectively learn traffic congestion definitions and, in some cases, outperform rules constructed by human experts.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:rmuvC79q63oC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Online learning of weighted relational rules for complex event recognition",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-10928-8_24",
            "Abstract": "Systems for symbolic complex event recognition detect occurrences of events in time using a set of event definitions in the form of logical rules. The Event Calculus is a temporal logic that has been used as a basis in event recognition applications, providing among others, connections to techniques for learning such rules from data. We advance the state-of-the-art by combining an existing online algorithm for learning crisp relational structure with an online method for weight learning in Markov Logic Networks (MLN). The result is an algorithm that learns complex event patterns in the form of Event Calculus theories in the MLN semantics. We evaluate our approach on a challenging real-world application for activity recognition and show that it outperforms both its crisp predecessor and competing online MLN learners in terms of predictive performance, at the price of a small increase in training time. Code …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:KbBQZpvPDL4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Symbolic Register Automata for Complex Event Recognition and Forecasting",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2110.04032",
            "Abstract": "We propose an automaton model which is a combination of symbolic and register automata, i.e., we enrich symbolic automata with memory. We call such automata Symbolic Register Automata (SRA). SRA extend the expressive power of symbolic automata, by allowing Boolean formulas to be applied not only to the last element read from the input string, but to multiple elements, stored in their registers. SRA also extend register automata, by allowing arbitrary Boolean formulas, besides equality predicates. We study the closure properties of SRA under union, intersection, concatenation, Kleene closure, complement and determinization and show that SRA, contrary to symbolic automata, are not in general closed under complement and they are not determinizable. However, they are closed under these operations when a window operator, quintessential in Complex Event Recognition, is used. We show how SRA can be used in Complex Event Recognition in order to detect patterns upon streams of events, using our framework that provides declarative and compositional semantics, and that allows for a systematic treatment of such automata. We also show how the behavior of SRA, as they consume streams of events, can be given a probabilistic description with the help of prediction suffix trees. This allows us to go one step beyond Complex Event Recognition to Complex Event Forecasting, where, besides detecting complex patterns, we can also efficiently forecast their occurrence.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:jU7OWUQzBzMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic and Neural Learning of Named-Entity Recognition and Classification Systems in Two Languages",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-94-010-0324-7_14",
            "Abstract": "This work compares two alternative approaches to the problem of acquiring named-entity recognition and classification systems from training corpora, in two different languages. The process of named-entity recognition and classification is an important subtask in most language engineering applications, in particular information extraction, where different types of named entity are associated with specific roles in events. The manual construction of rules for the recognition of named entities is a tedious and time-consuming task. For this reason, effective methods to acquire such systems automatically from data are very desirable. In this paper we compare two popular learning methods on this task: a decision-tree induction method and a multi-layered feed-forward neural network. Particular emphasis is paid on the selection of the appropriate data representation for each method and the extraction of training …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodology for semantically annotating a corpus using a domain ontology and machine learning",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1.6751&rep=rep1&type=pdf",
            "Abstract": "In this paper we present a methodology for the semantic annotation of domain-specific corpora. This method relies on a domain ontology used initially for identifying and annotating domainspecific instances within the corpus. A machine learning-based information extraction system is then trained on the annotated corpus. The final result of this process is a model which is used to annotate new corpora in the specific domain. We applied the proposed methodology to a Web corpus examining different ontology size using hidden Markov models. The paper presents the proposed methodology together with some first experimental results.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic Automata with Memory: a Computational Model for Complex Event Processing",
            "Publication year": 2018,
            "Publication url": "https://arxiv.org/abs/1804.09999",
            "Abstract": "We propose an automaton model which is a combination of symbolic and register automata, i.e., we enrich symbolic automata with memory. We call such automata Register Match Automata (RMA). RMA extend the expressive power of symbolic automata, by allowing formulas to be applied not only to the last element read from the input string, but to multiple elements, stored in their registers. RMA also extend register automata, by allowing arbitrary formulas, besides equality predicates. We study the closure properties of RMA under union, concatenation, Kleene+, complement and determinization and show that RMA, contrary to symbolic automata, are not determinizable when viewed as recognizers, without taking the output of transitions into account. However, when a window operator, a quintessential feature in Complex Event Processing, is used, RMA are indeed determinizable even when viewed as recognizers. We present detailed algorithms for constructing deterministic RMA from regular expressions extended with -ary constraints. We show how RMA can be used in Complex Event Processing in order to detect patterns upon streams of events, using a framework that provides denotational and compositional semantics, and that allows for a systematic treatment of such automata.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:DJbcl8HfkQkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Fine-Tuned Compressed Representations of Vessel Trajectories",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3340531.3412706",
            "Abstract": "In the maritime domain, vessels typically maintain straight, predictable routes at open sea, except in the rare cases of adverse weather conditions, accidents and traffic restrictions. Consequently, large amounts of streaming positional updates from vessels can hardly contribute additional knowledge about their actual motion patterns. We have been developing a system for vessel trajectory compression discarding a significant part of the original positional updates, with minimal trajectory reconstruction error. In this work, we present an extension of this system, that allows the user to fine-tune trajectory compression according to the requirements of a given application. The extended system avoids the issues of hyper-parameter tuning, supports incremental optimization and facilitates composite maritime event recognition. Finally, we report empirical results from a comprehensive empirical evaluation against two real …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:otzGkya1bYkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Symbolic and neural learning for named-entity recognition",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.98.9669&rep=rep1&type=pdf",
            "Abstract": "Named-entity recognition involves the identification and classification of named entities in text. This is an important subtask in most language engineering applications, in particular information extraction, where different types of named entity are associated with specific roles in events. The manual construction of rules for the recognition of named entities is a tedious and time-consuming task. For this reason, we present in this paper two approaches to learning named-entity recognition rules from text. The first approach is a decision-tree induction method and the second a multi-layered feed-forward neural network. Particular emphasis is paid on the selection of the appropriate feature set for each method and the extraction of training examples from unstructured textual data. We compare the performance of the two methods on a large corpus of English text and present the results.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:rO6llkc54NcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Representation Models for Text Classification: a comparative analysis over three Web document types",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2254129.2254148",
            "Abstract": "Text classification constitutes a popular task in Web research with various applications that range from spam filtering to sentiment analysis. To address it, patterns of co-occurring words or characters are typically extracted from the textual content of Web documents. However, not all documents are of the same quality; for example, the curated content of news articles usually entails lower levels of noise than the user-generated content of the blog posts and the other Social Media.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:XiVPGOgt02cC",
            "Publisher": "ACM"
        },
        {
            "Title": "Gold standard evaluation of ontology learning methods through ontology transformation and alignment",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5601723/",
            "Abstract": "This paper presents a method along with a set of measures for evaluating learned ontologies against gold ontologies. The proposed method transforms the ontology concepts and their properties into a vector space representation to avoid the common string matching of concepts and properties at the lexical layer. The proposed evaluation measures exploit the vector space representation and calculate the similarity of the two ontologies (learned and gold) at the lexical and relational levels. Extensive evaluation experiments are provided, which show that these measures capture accurately the deviations from the gold ontology. The proposed method is tested using the Genia and the Lonely Planet gold ontologies, as well as the ontologies in the benchmark series of the Ontology Alignment Evaluation Initiative.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A personalized global filter to predict retweets",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3079628.3079655",
            "Abstract": "Information shared on Twitter is ever increasing and users-recipients are overwhelmed by the number of tweets they receive, many of which of no interest. Filters that estimate the interest of each incoming post can alleviate this problem, for example by allowing users to sort incoming posts by predicted interest (eg,\" top stories\" vs.\" most recent\" in Facebook). Global and personal filters have been used to detect interesting posts in social networks. Global filters are trained on large collections of posts and reactions to posts (eg, retweets), aiming to predict how interesting a post is for a broad audience. In contrast, personal filters are trained on posts received by a particular user and the reactions of the particular user. Personal filters can provide recommendations tailored to a particular user's interests, which may not coincide with the interests of the majority of users that global filters are trained to predict. On the other …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:DUooU5lO8OsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A probabilistic logic programming event calculus",
            "Publication year": 2015,
            "Publication url": "https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/probabilistic-logic-programming-event-calculus/E7486F289AD54D2FE36BA1F7ED8242D5",
            "Abstract": "We present a system for recognising human activity given a symbolic representation of video content. The input of our system is a set of time-stamped short-term activities (STA) detected on video frames. The output is a set of recognised long-term activities (LTA), which are pre-defined temporal combinations of STA. The constraints on the STA that, if satisfied, lead to the recognition of an LTA, have been expressed using a dialect of the Event Calculus. In order to handle the uncertainty that naturally occurs in human activity recognition, we adapted this dialect to a state-of-the-art probabilistic logic programming framework. We present a detailed evaluation and comparison of the crisp and probabilistic approaches through experimentation on a benchmark dataset of human surveillance videos.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Overview of the CLEF question answering track 2015",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-24027-5_50",
            "Abstract": "This paper describes the CLEF QA Track 2015. Following the scenario stated last year for the CLEF QA Track, the starting point for accessing information is always a Natural Language question. However, answering some questions may need to query Linked Data (especially if aggregations or logical inferences are required), some questions may need textual inferences and querying free-text, and finally, answering some queries may require both sources of information. In this edition, the Track was divided into four tasks: (i) QALD: focused on translating natural language questions into SPARQL; (ii) Entrance Exams: focused on answering questions to assess machine reading capabilities; (iii) BioASQ1 focused on large-scale semantic indexing and (iv) BioASQ2 for Question Answering in the biomedical domain.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:kh2fBNsKQNwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "SHARE-ODS: an ontology data service for search and rescue operations",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_60",
            "Abstract": "This paper describes an ontology data service (ODS) for supporting Search and Rescue (SaR) operations. The ontological model represents various aspects of the command, communication, and organisational structure of the SaR forces and the deployment and progress of a SaR operation. Furthermore, the ontology supports the semantic indexing of multimedia documents in the context of SaR processes and activities. This ODS supports a semantically-enhanced information and communication system for SaR forces. Modelling the spatio-temporal aspects of an operation in alignment with possibly-unreliable information automatically extracted from multimedia objects, introduces a number of challenges for the field of knowledge representation and reasoning.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:blknAaTinKkC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Semi-supervised online structure learning for composite event recognition",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/article/10.1007/s10994-019-05794-2",
            "Abstract": "Online structure learning approaches, such as those stemming from statistical relational learning, enable the discovery of complex relations in noisy data streams. However, these methods assume the existence of fully-labelled training data, which is unrealistic for most real-world applications. We present a novel approach for completing the supervision of a semi-supervised structure learning task. We incorporate graph-cut minimisation, a technique that derives labels for unlabelled data, based on their distance to their labelled counterparts. In order to adapt graph-cut minimisation to first order logic, we employ a suitable structural distance for measuring the distance between sets of logical atoms. The labelling process is achieved online (single-pass) by means of a caching mechanism and the Hoeffding bound, a statistical tool to approximate globally-optimal decisions from locally-optimal ones. We evaluate …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:4vMrXwiscB8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Learning context-free grammars to extract relations from text",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=3Wsn3SwEBScC&oi=fnd&pg=PA303&dq=info:0a9jPA1L3SsJ:scholar.google.com&ots=a2qvjG8ysP&sig=a79Kh9Q3krrOZ3Ry-h9GKG87fxg",
            "Abstract": "1 In this paper we propose a novel relation extraction method, based on grammatical inference. Following a semisupervised learning approach, the text that connects named entities in an annotated corpus is used to infer a context free grammar. The grammar learning algorithm is able to infer grammars from positive examples only, controlling overgeneralisation through minimum description length. Evaluation results show that the proposed approach performs comparable to the state of the art, while exhibiting a bias towards precision, which is a sign of conservative generalisation.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:TFP_iSt0sucC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Identifying User Interests in Folksonomies",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.306.7618&rep=rep1&type=pdf",
            "Abstract": "This paper proposes a probabilistic method for classifying folksonomy users to specific domains and for identifying their specific interests to these domains. The proposed method uses a hierarchical probabilistic topic modeling approach that exploits tags to induce hierarchies of latent topics. These hierarchies represent domain conceptualizations of specific domains that are either collective or user-specific. We propose two alternative methods that exploit the induced hierarchies for classifying and identifying users’ interests to specific domains and provide preliminary evaluation results.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Learning to filter unsolicited commercial e-mail",
            "Publication year": 2004,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/TR_2004_updated_2006.pdf",
            "Abstract": "We present a thorough investigation on using machine learning to construct effective personalized anti-spam filters. The investigation includes four learning algorithms, Naive Bayes, Flexible Bayes, LogitBoost, and Support Vector Machines, and four datasets, constructed from the mailboxes of different users. We discuss the model and search biases of the learning algorithms, along with worst-case computational complexity figures, and observe how the latter relate to experimental measurements. We study how classification accuracy is affected when using attributes that represent sequences of tokens, as opposed to single tokens, and explore the effect of the size of the attribute and training set, all within a cost-sensitive framework. Furthermore, we describe the architecture of a fully implemented learning-based anti-spam filter, and present an analysis of its behavior in real use over a period of seven months. Information is also provided on other available learning-based anti-spam filters, and alternative filtering approaches.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:MXK_kJrjxJIC",
            "Publisher": "\" DEMOKRITOS\", National Center for Scientific Research"
        },
        {
            "Title": "Spam filtering: an active learning approach using incremental clustering",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2611040.2611059",
            "Abstract": "This paper introduces a method that deals with unwanted mail messages by combining active learning with incremental clustering. The proposed approach is motivated by the fact that the user cannot provide the correct category for all received messages. The email messages are divided into chronological batches (eg one per day). The user is asked to give the correct categories (labels) for the messages of the first batch and from then on the proposed algorithm decides when to ask for a new label, based on a clustering of the messages that is incrementally updated. We test different variants of the algorithm on a number of different datasets and show that it achieves very good results with only 2% of all email messages labelled by the user.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Evaluation of Naive Bayesian Anti-Spam Filtering",
            "Publication year": 2000,
            "Publication url": "https://arxiv.org/abs/cs/0006013",
            "Abstract": "It has recently been argued that a Naive Bayesian classifier can be used to filter unsolicited bulk e-mail (\"spam\"). We conduct a thorough evaluation of this proposal on a corpus that we make publicly available, contributing towards standard benchmarks. At the same time we investigate the effect of attribute-set size, training-corpus size, lemmatization, and stop-lists on the filter's performance, issues that had not been previously explored. After introducing appropriate cost-sensitive evaluation measures, we reach the conclusion that additional safety nets are needed for the Naive Bayesian anti-spam filter to be viable in practice.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Expert based prediction of user preferences",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5706852/",
            "Abstract": "Two influential strands in Recommender systems (RS) are the collaborative filtering and content based filtering that by taking into account user communities or interaction history suggest to the active user interesting items. However, the aforementioned approaches do not work well when confronted with new users with few interactions; or with the addition of new items. In such cases, the guidance of an expert could help the active user. In this paper we provide a definition of expert users that can be reduced into two components the expertise and the contribution. The former is related to the content of items evaluated by an expert and the latter refers to the influence of the expert to the users of a RS. In particular, contribution is learnt with the aid of a perceptron. Experts users are defined for values of the features of the items. Furthermore, we have studied the temporal evolution of the experts, as new users, new items …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Stacked generalization for information extraction",
            "Publication year": 2004,
            "Publication url": "http://cgi.di.uoa.gr/~sigletos/papers/ECAI2004.pdf",
            "Abstract": "1 This paper defines a new stacked generalization framework in the context of information extraction (IE) from online sources. The proposed setting removes the constraint of applying classifiers at the base-level. A set of IE systems are trained instead to identify relevant fragments within text documents, which differs significantly from the task of classifying candidate text fragments as relevant or not. The templates filled by the base-level IE systems are stacked, forming a set of feature vectors for training a metalevel classifier. Thus, base-level IE systems are combined with a common classifier at meta-level. The proposed framework was evaluated on three Web domains, using well known IE approaches at base-level and a variety of classifiers at meta-level. Results demonstrate the added value obtained by combining the base-level IE systems in the new framework.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Stacking classifiers for anti-spam filtering of e-mail",
            "Publication year": 2001,
            "Publication url": "https://arxiv.org/abs/cs/0106040",
            "Abstract": "We evaluate empirically a scheme for combining classifiers, known as stacked generalization, in the context of anti-spam filtering, a novel cost-sensitive application of text categorization. Unsolicited commercial e-mail, or \"spam\", floods mailboxes, causing frustration, wasting bandwidth, and exposing minors to unsuitable content. Using a public corpus, we show that stacking can improve the efficiency of automatically induced anti-spam filters, and that such filters can be used in real-life applications.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:5nxA0vEk-isC",
            "Publisher": "Unknown"
        },
        {
            "Title": "User modeling 2007: 11th international conference, Lecture Notes in Artificial Intelligence",
            "Publication year": 2007,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "Timerank: A random walk approach for community discovery in dynamic networks",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-05411-3_28",
            "Abstract": "In this work we consider the problem of discovering communities in time evolving social networks. We propose TimeRank, an algorithm for dynamic networks, which uses random walks on a tensor representation to detect time-evolving communities. The proposed algorithm is based on an earlier work on community detection in multi-relational networks. Detection of dynamic communities can be be done in two steps (segmentation of the network into time frames, detection of communities per time frame and tracking of communities across time frames). Alternatively it can be done in one step. TimeRank is a one step approach. We compared TimeRank with Non-Negative Tensor Factorisation and Group Evolution Discovery method on synthetic and real world data sets from Reddit.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:a3BOlSfXSfwC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Calibrating Mini-Mental State Examination Scores to Predict Misdiagnosed Dementia Patients",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2076-3417/11/17/8055",
            "Abstract": "Mini-Mental State Examination (MMSE) is used as a diagnostic test for dementia to screen a patient’s cognitive assessment and disease severity. However, these examinations are often inaccurate and unreliable either due to human error or due to patients’ physical disability to correctly interpret the questions as well as motor deficit. Erroneous data may lead to a wrong assessment of a specific patient. Therefore, other clinical factors (e.g., gender and comorbidities) existing in electronic health records, can also play a significant role, while reporting her examination results. This work considers various clinical attributes of dementia patients to accurately determine their cognitive status in terms of the Mini-Mental State Examination (MMSE) Score. We employ machine learning models to calibrate MMSE score and classify the correctness of diagnosis among patients, in order to assist clinicians in a better understanding of the progression of cognitive impairment and subsequent treatment. For this purpose, we utilize a curated real-world ageing study data. A random forest prediction model is employed to estimate the Mini-Mental State Examination score, related to the diagnostic classification of patients.This model uses various clinical attributes to provide accurate MMSE predictions, succeeding in correcting an important percentage of cases that contain previously identified miscalculated scores in our dataset. Furthermore, we provide an effective classification mechanism for automatically identifying patient episodes with inaccurate MMSE values with high confidence. These tools can be combined to assist clinicians in automatically finding episodes …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:PYBJJbyH-FwC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Complex event forecasting with prediction suffix trees",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s00778-021-00698-x",
            "Abstract": "Complex event recognition (CER) systems have become popular in the past two decades due to their ability to “instantly” detect patterns on real-time streams of events. However, there is a lack of methods for forecasting when a pattern might occur before such an occurrence is actually detected by a CER engine. We present a formal framework that attempts to address the issue of complex event forecasting (CEF). Our framework combines two formalisms: (a) symbolic automata which are used to encode complex event patterns and (b) prediction suffix trees which can provide a succinct probabilistic description of an automaton’s behavior. We compare our proposed approach against state-of-the-art methods and show its advantage in terms of accuracy and efficiency. In particular, prediction suffix trees, being variable-order Markov models, have the ability to capture long-term dependencies in a stream by …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:CB2v5VPnA5kC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Event recognition and forecasting technology",
            "Publication year": 2016,
            "Publication url": "http://speedd-project.eu/sites/default/files/D3.2_-_Second_version_of_event_recognition_and_forecasting_technology_-_Part_2_final_0.pdf",
            "Abstract": "This document presents the advancements made in event recognition and forecasting technology of the SPEEDD project, in order to reason about events and learn event definitions over large amounts of data, as well as under situations of uncertainty.SPEEDD implements event recognition methods (also known as event pattern matching or event pattern detection systems), in order to extract useful information, in the form of events, by processing time-evolving data that comes from various sources (eg, various types of sensor, network activity logs, ATMs, transactions, etc.). The extracted information—recognized and/or forecasted events—can be exploited by other systems or human experts, in order to monitor an environment and respond to the occurrence of significant events. Event recognition methods employ rich representation that can naturally and compactly represent events with complex relational structure, eg, events that are related to other input/derived events with spatio-temporal constraints. Unfortunately, uncertainty is an unavoidable aspect of real-world event recognition applications and it appears to be a consequence of several factors. Consider for example, noisy or incomplete observations from road sensors, as well as imperfect definitions fraudulent activity. Under situations of uncertainty, the performance of an event recognition system may be seriously compromised. Another important characteristic of the SPEEDD project, is that machine learning algorithms must deal with large amounts of data that continuously evolves. As a result, the current base of event definitions may need to be refined or new events may appear …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:SpbeaW3--B0C",
            "Publisher": "Technical Report"
        },
        {
            "Title": "of Deliverable: Contributor modelling requirements and baseline approaches",
            "Publication year": 2014,
            "Publication url": "https://revealproject.eu/wp-content/uploads/D2.1-Contributor-Modelling-Requirements-and-Baseline-Approaches-Update.pdf",
            "Abstract": "This deliverable describes the effort that has been undertaken by WP2 partners regarding the contributor profiles in social networks. In particular it describes the form of the profiles, modalities, data sources, elements of gamification, the architecture of WP2, its interaction with the REVEAL platform as well as any kind of research that has been undertaken in the above domains, at this stage of development. The research has resulted in creation of several software models.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Knowledge Acquisition from Multimedia Content using an Evolution Framework",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-34224-9_65",
            "Abstract": "We propose an approach to knowledge acquisition, which uses multimedia ontologies for fused extraction of semantics from multiple modalities, and feeds back the extracted information, aiming to evolve knowledge representation. This paper presents the basic components of the proposed approach and discusses the open research issues focusing on the fused information extraction that will enable the development of scalable and precise knowledge acquisition technology.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "Using the Ellogon Natural Language Engineering Infrastructure",
            "Publication year": 2003,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.414.3508&rep=rep1&type=pdf",
            "Abstract": "Ellogon is a multi-lingual, cross-operating system, general-purpose natural language engineering infrastructure. Ellogon has been used extensively in various NLP applications. It is currently provided for free for research use to research and academic organisations. In this paper, we outline its architecture and data model, present Ellogon features as used by different types of users and discuss its functionalities against other infrastructures for language engineering.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of MESINESP8, a Spanish Medical Semantic Indexing Task within BioASQ 2020",
            "Publication year": 2020,
            "Publication url": "http://www.dei.unipd.it/~ferro/CLEF-WN-Drafts/CLEF2020/paper_269.pdf",
            "Abstract": "In this paper, we present an overview of the novel MESINESP Task on medical semantic indexing in Spanish within the eighth edition of the BioASQ challenge, which ran as a lab in the Conference and Labs of the Evaluation Forum (CLEF) 2020. BioASQ is a series of challenges aiming at the promotion of systems and methodologies for large-scale biomedical semantic indexing and question answering. MESINESP represents the first attempt to generate resources for the development and evaluation semantic indexing strategies specialized on health-related content in Spanish. We have generate several publicly accessible Gold Standard collections of manually indexed content covering medical literature, clinical trials and health project descriptions associated to controlled terminologies in the form of the hierarchical DeCS vocabulary. Manual indexing of MESINESP documents was carried out by professional medical literature indexers. They used an indexing web interface particularly adapted for this task. The results obtained by participating teams was promising, showing that training data of semantically indexed medical literature can also serve to implement automatic indexing systems that assist manual indexing of other types of documents like clinical trials. MESINESP corpus: https://zenodo. org/record/3746596. Xo9WTI zaF A",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:jgBuDB5drN8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incremental learning of event definitions with inductive logic programming",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/article/10.1007/s10994-015-5512-1",
            "Abstract": "Event recognition systems rely on knowledge bases of event definitions to infer occurrences of events in time. Using a logical framework for representing and reasoning about events offers direct connections to machine learning, via Inductive Logic Programming (ILP), thus allowing to avoid the tedious and error-prone task of manual knowledge construction. However, learning temporal logical formalisms, which are typically utilized by logic-based event recognition systems is a challenging task, which most ILP systems cannot fully undertake. In addition, event-based data is usually massive and collected at different times and under various circumstances. Ideally, systems that learn from temporal data should be able to operate in an incremental mode, that is, revise prior constructed knowledge in the face of new evidence. In this work we present an incremental method for learning and revising event-based …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Parallel online event calculus learning for complex event recognition",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167739X17320216",
            "Abstract": "Logic-based event recognition systems infer occurrences of events in time using a set of event definitions in the form of first-order rules. The Event Calculus is a temporal logic that has been used as a basis in event recognition applications, providing, among others, direct connections to machine learning, via Inductive Logic Programming (ILP). OLED is a recently proposed ILP system that learns event definitions in the form of Event Calculus theories, in a single pass over a data stream. We present two strategies for parallel online learning with OLED. We evaluate our proposed approaches on three datasets from the domains of activity recognition and maritime surveillance and show that they can significantly reduce training times, while they are capable of achieving super-linear speed-ups under certain circumstances.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:F9fV5C73w3QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Proceedings of the 6th BioASQ Workshop A challenge on large-scale biomedical semantic indexing and question answering",
            "Publication year": 2018,
            "Publication url": "https://www.aclweb.org/anthology/W18-5300.pdf",
            "Abstract": "The sixth BioASQ workshop on biomedical semantic indexing and question answering took place in Brussels, Belgium on November 1st, 2018 as part of the EMNLP 2018 conference and was hosted by the SQUARE Brussels meeting centre. The workshop was supported by the BioASQ project1, which organizes the corresponding annual challenge. The goals of the workshop were to present the results of the sixth BioASQ challenge and further the interaction with the wider community of biomedical semantic indexing and question answering. The presenters represented research teams from different parts of the globe and with different viewpoints to the problem. This contributed to a very lively and interesting discussion among the participants of the workshop.Ten papers were presented during the workshop. All were selected by peer review for presentation. This volume includes all ten papers. The first paper gives an overview of the challenge, including especially the datasets that were used throughout the challenges and the overall results achieved by the participants.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:r_AWSJRzSzQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Expert and community based style advice",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0957417412004411",
            "Abstract": "We propose a knowledge framework for garment recommendations, which is based on two pillars. The first pillar incorporates knowledge about aspects of fashion, such as materials, garments, colours, body types, facial features, social occasion etc., as well as their interrelations, with the purpose of providing personalised recommendations. The said knowledge is encoded in the form of an owl ontology, the origin of which is attributed to fashion experts. Moreover, in commercial fashion sites, customers purchase garments of various types. Because of that, interesting patterns in their purchase behaviour can be sought, and thus groups of garments that tend to be purchased together can be discovered. This forms the second pillar, that can be used to enhance the first pillar with community based garment recommendations. This paper is the description and integration of the aforementioned pillars in a knowledge …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:HE397vMXCloC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Probabilistic cascading for large scale hierarchical classification",
            "Publication year": 2015,
            "Publication url": "https://arxiv.org/abs/1505.02251",
            "Abstract": "Hierarchies are frequently used for the organization of objects. Given a hierarchy of classes, two main approaches are used, to automatically classify new instances: flat classification and cascade classification. Flat classification ignores the hierarchy, while cascade classification greedily traverses the hierarchy from the root to the predicted leaf. In this paper we propose a new approach, which extends cascade classification to predict the right leaf by estimating the probability of each root-to-leaf path. We provide experimental results which indicate that, using the same classification algorithm, one can achieve better results with our approach, compared to the traditional flat and cascade classifications.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ILKRHgRFtOwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automatic adaptation of proper noun dictionaries through cooperation of machine learning and probabilistic methods",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=5958169305967655042&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:L7CI7m0gUJcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Parallel online learning of event definitions",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-78090-0_6",
            "Abstract": "Logic-based event recognition systems infer occurrences of events in time using a set of event definitions in the form of first-order rules. The Event Calculus is a temporal logic that has been used as a basis in event recognition applications, providing among others, direct connections to machine learning, via Inductive Logic Programming (ILP). OLED is a recently proposed ILP system that learns event definitions in the form of Event Calculus theories, in a single pass over a data stream. In this work we present a version of OLED that allows for parallel, online learning. We evaluate our approach on a benchmark activity recognition dataset and show that we can reduce training times, while achieving super-linear speed-ups on some occasions.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:cWzG1nlazyYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Reinforcement learning with classifier selection for focused crawling",
            "Publication year": 2008,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/4486",
            "Abstract": "Focused crawlers are programs that wander in the Web, using its graph structure, and gather pages that belong to a specific topic. The most critical task in Focused Crawling is the scoring of the URLs as it designates the path that the crawler will follow, and thus its effectiveness. In this paper we propose a novel scheme for assigning scores to the URLs, based on the Reinforcement Learning (RL) framework. The proposed approach learns to select the best classifier for ordering the URLs. This formulation reduces the size of the search space for the RL method and makes the problem tractable. We evaluate the proposed approach on-line on a number of topics, which offers a realistic view of its performance, comparing it also with a RL method and a simple but effective classifier-based crawler. The results demonstrate the strength of the proposed approach.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Learning to filter spam e-mail: A comparison of a naive bayesian and a memory-based approach",
            "Publication year": 2000,
            "Publication url": "https://arxiv.org/abs/cs/0009009",
            "Abstract": "We investigate the performance of two machine learning algorithms in the context of anti-spam filtering. The increasing volume of unsolicited bulk e-mail (spam) has generated a need for reliable anti-spam filters. Filters of this type have so far been based mostly on keyword patterns that are constructed by hand and perform poorly. The Naive Bayesian classifier has recently been suggested as an effective method to construct automatically anti-spam filters with superior performance. We investigate thoroughly the performance of the Naive Bayesian filter on a publicly available corpus, contributing towards standard benchmarks. At the same time, we compare the performance of the Naive Bayesian filter to an alternative memory-based learning approach, after introducing suitable cost-sensitive evaluation measures. Both methods achieve very accurate spam filtering, outperforming clearly the keyword-based filter of a widely used e-mail reader.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:UebtZRa9Y70C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Non-parametric estimation of topic hierarchies from texts with hierarchical Dirichlet processes.",
            "Publication year": 2011,
            "Publication url": "https://www.jmlr.org/papers/volume12/zavitsanos11a/zavitsanos11a.pdf",
            "Abstract": "This paper presents hHDP, a hierarchical algorithm for representing a document collection as a hierarchy of latent topics, based on Dirichlet process priors. The hierarchical nature of the algorithm refers to the Bayesian hierarchy that it comprises, as well as to the hierarchy of the latent topics. hHDP relies on nonparametric Bayesian priors and it is able to infer a hierarchy of topics, without making any assumption about the depth of the learned hierarchy and the branching factor at each level. We evaluate the proposed method on real-world data sets in document modeling, as well as in ontology learning, and provide qualitative and quantitative evaluation results, showing that the model is robust, it models accurately the training data set and is able to generalize on held-out data.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Filtron: A learning-based anti-spam filter",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.61.8015",
            "Abstract": "We present Filtron, a prototype anti-spam filter that integrates the main empirical conclusions of our comprehensive analysis on using machine learning to construct e# ective personalized anti-spam filters. Filtron is based on the experimental results over several design parameters on four publicly available benchmark corpora. After describing Filtron's architecture, we assess its behavior in real use over a period of seven months. The results are deemed satisfactory, though they can be improved with more elaborate preprocessing and regular re-training.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:Zph67rFs4hoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Event recognition for unobtrusive assisted living",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07064-3_41",
            "Abstract": "Developing intelligent systems towards automated clinical monitoring and assistance for the elderly is attracting growing attention. USEFIL is an FP7 project aiming to provide health-care assistance in a smart-home setting. We present the data fusion component of USEFIL which is based on a complex event recognition methodology. In particular, we present our knowledge-driven approach to the detection of Activities of Daily Living (ADL) and functional ability, based on a probabilistic version of the Event Calculus. To investigate the feasibility of our approach, we present an empirical evaluation on synthetic data.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ipzZ9siozwsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Using machine learning to maintain rule-based named-entity recognition and classification systems",
            "Publication year": 2001,
            "Publication url": "https://www.aclweb.org/anthology/P01-1055.pdf",
            "Abstract": "This paper presents a method that assists in maintaining a rule-based named-entity recognition and classification system. The underlying idea is to use a separate system, constructed with the use of machine learning, to monitor the performance of the rule-based system. The training data for the second system is generated with the use of the rule-based system, thus avoiding the need for manual tagging. The disagreement of the two systems acts as a signal for updating the rule-based system. The generality of the approach is illustrated by applying it to large corpora in two different languages: Greek and French. The results are very encouraging, showing that this alternative use of machine learning can assist significantly in the maintenance of rulebased systems.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:IWHjjKOFINEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "KDTA: automated knowledge-driven text annotation",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15939-8_45",
            "Abstract": "In this paper we demonstrate a system that automatically annotates text documents with a given domain ontology’s concepts. The annotation process utilizes lexical and Web resources to analyze the semantic similarity of text components with any of the ontology concepts, and outputs a list with the proposed annotations, accompanied with appropriate confidence values. The demonstrated system is available online and free to use, and it constitutes one of the main components of the KDTA (Knowledge-Driven Text Analysis) module of the CASAM European research project.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:dshw04ExmUIC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A logic programming approach to activity recognition",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1877937.1877941",
            "Abstract": "We have been developing a system for recognising human activity given a symbolic representation of video content. The input of our system is a set of time-stamped short-term activities detected on video frames. The output of our system is a set of recognised long-term activities, which are pre-defined temporal combinations of short-term activities. The constraints on the short-term activities that, if satisfied, lead to the recognition of a long-term activity, are expressed using a dialect of the Event Calculus. We illustrate the expressiveness of the dialect by showing the representation of several typical complex activities. Furthermore, we present a detailed evaluation of the system through experimentation on a benchmark dataset of surveillance videos.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:R3hNpaxXUhUC",
            "Publisher": "ACM"
        },
        {
            "Title": "Navigation pattern discovery using grammatical inference",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30195-0_17",
            "Abstract": "We present a method for modeling user navigation on a web site using grammatical inference of stochastic regular grammars. With this method we achieve better models than the previously used first order Markov chains, in terms of predictive accuracy and utility of recommendations. In order to obtain comparable results, we apply the same grammatical inference algorithms on Markov chains, modeled as probabilistic automata. The automata induced in this way perform better than the original Markov chains, as models for user navigation, but they are considerably inferior to the automata induced by the traditional grammatical inference methods. The evaluation of our method was based on two web usage data sets from two very dissimilar web sites. It consisted in producing, for each user, a personalized list of recommendations and then measuring its recall and expected utility.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A distributed event calculus for event recognition",
            "Publication year": 2016,
            "Publication url": "http://2nd-ai-iot2016.iit.demokritos.gr/sites/default/files/papers/2nd_AI_IoT_2016_Paper%204.pdf",
            "Abstract": "Events provide a fundamental abstraction for representing time-evolving information. Complex event recognition focuses on tracking and analysing streams of events, in order to detect patterns of special significance. The event streams may originate from various types of sensor, such as cameras and GPS sensors. Furthermore, the stream velocity and volume pose significant challenges to event processing systems. We propose dRTEC, an event recognition system that employs the Event Calculus formalism and operates in multiple processing threads. We evaluate dRTEC using two real-world applications and show that it is capable of real-time and scalable event recognition.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:86PQX7AUzd4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Overview of BioASQ Tasks 9a, 9b and Synergy in CLEF2021",
            "Publication year": 2021,
            "Publication url": "http://ceur-ws.org/Vol-2936/paper-10.pdf",
            "Abstract": "In this paper, we present an overview of the tasks a and b of the ninth edition of BioASQ challenge, together with a newly introduced task on question answering for developing problems called Synergy. All these tasks ran as part of the BioASQ challenge lab in the Conference and Labs of the Evaluation Forum (CLEF) 2021. The main focus of BioASQ is to promote methodologies and systems for large-scale biomedical semantic indexing and question answering. This is achieved through the organization of yearly challenges which enable the participation of teams around the world in developing and comparing their methods on the same benchmark datasets. This year, 42 teams with more than 170 systems participated in the four tasks of the challenge, with six of them focusing on task 9a, 24 on task 9b and 15 on task Synergy. Correspondingly to the previous years, the participation has increased, indicating the established presence of BioASQ challenge in the field.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:wKETBy42zhYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest editorial to the special issue on grammatical inference",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/52452277/Guest_editorial_to_the_special_issue_on_20170403-16773-r7k7r1.pdf",
            "Abstract": "Grammars are a powerful representation of sequential patterns of various types, ranging from speech and other audio signals, to biological sequences and user navigation on the Web. The long study of grammars, especially in natural languages, has resulted in a rich repertoire of grammar variants and flavors that provide different representation power and consequently different complexity of analysis. Beyond the issues of representation complexity, most of the work on grammars has focused on their use by parsing programs that analyze strings of a given “language”, in order to prove their grammaticalness and/or identify interesting elements of the language.The use of grammars by parsers, especially the more expressive and complex grammars, remains a challenging and interesting research issue on its own. However, grammatical inference goes a step further to study methods that learn grammars from data. Grammatical inference is an established research field in Artificial Intelligence, dating back to the 60s and has been extensively addressed by researchers in automata theory, language acquisition, computational linguistics, machine learning, pattern recognition, computational learning theory and neural networks. From a theoretical perspective, the main aim of this work is to study the learnability of different types of grammars from different types of data and propose efficient algorithms for learning. In parallel, a significant amount of work focuses on innovative applications of grammatical inference algorithms to various knowledge discovery tasks. The main forum for presenting this type of work in the past 15 years has been the International …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:XiSMed-E-HIC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Multilingual system for early detection of neurodegenerative and psychiatric disorders",
            "Publication year": 2021,
            "Publication url": "https://patents.google.com/patent/US11114113B2/en",
            "Abstract": "The present disclosure provides a system for predicting a disease state based on speech occurrences. A feature extraction module extracts a plurality of lingual features from a speech record of the speech occurrence. The lingual features are chosen based on a correlation between the lingual features and the disease state in at least a first language and a second language. The lingual features are consistent for transcripts in at least the first language and the second language. A prediction module including a trained classification model generates a prediction of the disease state for speech occurrences in at least the first language and the second language using the lingual features extracted from the speech records.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:j7_hQOaDUrUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontology Learning and Evaluation: A survey",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=14809460629609458570&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:5MTHONV0fEkC",
            "Publisher": "Technical report, DEMO-(2006-3), NCSR Demokritos, Athens, Greece"
        },
        {
            "Title": "Meta-learning beyond classification: A framework for information extraction from the Web",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.464.8508&rep=rep1&type=pdf#page=60",
            "Abstract": "This paper proposes a meta-learning framework in the context of information extraction from the Web. The proposed framework relies on learning a meta-level classifier, based on the output of base-level information extraction systems. Such systems are typically trained to recognize relevant information within documents, ie, streams of lexical units, which differs significantly from the task of classifying feature vectors that is commonly assumed for metalearning. The proposed framework was evaluated experimentally on the challenging task of training an information extraction system for multiple Web sites. Three well-known methods for training extraction systems were employed at the base level. A variety of classifiers were comparatively evaluated at the meta level. The extraction accuracy that was obtained demonstrated the effectiveness of the proposed framework of collaboration between base-level extraction systems and common classifiers at meta-level.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Web-scale classification: web classification in the big data era",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2556195.2556208",
            "Abstract": "This paper provides an overview of the workshop Web-Scale Classification: Web Classification in the Big Data Era which was held in New York City, on February 28th as a workshop of the seventh International Conference on Web Search and Data Mining. The goal of the workshop was to discuss and assess recent research focusing on classification and mining in Web-scale category systems. The workshop brought together members of several communities such web mining, machine learning, text classification and social media mining.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Clustering the users of large web sites into communities",
            "Publication year": 2000,
            "Publication url": "https://users.iit.demokritos.gr/~paliourg/old/papers/ICML2000.pdf",
            "Abstract": "In this paper we analyze the performance of clustering methods on the task of constructing community models for the users of large Web sites. Community models represent patterns of usage of the Web site, which can be associated with different types of user. Knowledge of this type is clearly valuable for commercial sites, where each user is a potential customer. We argue that it is equally valuable for non-commercial sites, because it can assist greatly in the improvement of the site. We evaluate three clustering methods on usage data from a large site that covers on-line resources in Chemistry. The size of the site and its high hit rate impose a serious constraint on the scalability of the methods. We also examine two ways of encoding usage data, which give complementary information about the behavior of the users. Finally, the emphasis is on the construction of meaningful community models, by identifying the descriptive characteristics of communities, at a post-processing stage.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:3fE2CSJIrl8C",
            "Publisher": "Morgan Kaufmann Publishers Inc."
        },
        {
            "Title": "METHOD FOR PROBABILISTIC INFORMATION FUSION TO FILTER MULTI-LINGUAL, SEMI-STRUCTURED AND MULTIMEDIA ELECTRONIC CONTENT",
            "Publication year": 2008,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discovery of Web user communities and their role in personalization",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/article/10.1007/s11257-011-9111-y",
            "Abstract": "One of the major innovations in personalization in the last 20 years was the injection of social knowledge into the model of the user. The user is not considered an isolated individual any more, but a member of one or more communities. User communities have been facilitated by the striking advancements of electronic communications and in particular the penetration of the Web into people’s everyday routine. Communities arise in a number of different ways. Social networking tools typically allow users to proactively connect to each other. Alternatively, data mining tools discover communities of connected Web sites or communities of Web users. In this article, we focus on the latter type of community, which is commonly mined from logs of users’ activity on the Web. We recall how this process has been used to model the users’ interests and personalize Web applications. Collaborative filtering and …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:olpn-zPbct0C",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Logic-based representation, reasoning and machine learning for event recognition",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1827418.1827471",
            "Abstract": "Today's organisations require techniques for automated transformation of the large data volumes they collect during their operations into operational knowledge. This requirement may be addressed by employing event recognition systems that detect activities/events of special significance within an organisation, given streams of'low-level'information that is very difficult to be utilised by humans. Numerous event recognition systems have been proposed in the literature. Recognition systems with a logic-based representation of event structures, in particular, have been attracting considerable attention because, among others, they exhibit a formal, declarative semantics, they haven proven to be efficient and scalable, and they are supported by machine learning tools automating the construction and refinement of event structures. In this paper we review representative approaches of logic-based event recognition, and …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:M3NEmzRMIkIC",
            "Publisher": "ACM"
        },
        {
            "Title": "Behaviour recognition using the event calculus",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-0221-4_55",
            "Abstract": "We present a system for recognising human behaviour given a symbolic representation of surveillance videos. The input of our system is a set of timestamped short-term behaviours, that is, behaviours taking place in a short period of time — walking, running, standing still, etc — detected on video frames. The output of our system is a set of recognised long-term behaviours — fighting, meeting, leaving an object, collapsing, walking, etc — which are pre-defined temporal combinations of short-term behaviours. The definition of a long-term behaviour, including the temporal constraints on the short-term behaviours that, if satisfied, lead to the recognition of the long-term behaviour, is expressed in the Event Calculus. We present experimental results concerning videos with several humans and objects, temporally overlapping and repetitive behaviours.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "Interval-based Activity Recognition.",
            "Publication year": 2018,
            "Publication url": "http://ceur-ws.org/Vol-2219/paper4.pdf",
            "Abstract": "Activity recognition refers to the detection of temporal combinations of ‘low-level’or ‘short-term’activities on sensor data. Various types of uncertainty exist in activity recognition systems and this often leads to erroneous detection. Typically, the frameworks aiming to handle uncertainty compute the probability of the occurrence of activities at each time-point. We extend this approach by defining the probability of a maximal interval and the credibility rate for such intervals.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:yMeIxYmEMEAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing ontological knowledge through ontology population and enrichment",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30202-5_10",
            "Abstract": "Ontologies are widely used for capturing and organizing knowledge of a particular domain of interest. This knowledge is usually evolvable and therefore an ontology maintenance process is required to keep the ontological knowledge up-to-date. We proposed an incremental ontology maintenance methodology which exploits ontology population and enrichment methods to enhance the knowledge captured by the instances of the ontology and their various lexicalizations. Furthermore, we employ ontology learning techniques to alleviate as much as possible the intervention of human into the proposed methodology. We conducted experiments using the CROSSMARC ontology as a case study evaluating the methodology and its partial methods. The methodology performed well enhancing the ontological knowledge to 96.5% from only 50%.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "LangAware: A robust ML‐based platform for the quick and accurate assessment of neurodegenerative diseases: Neuropsychology/computerized neuropsychological assessment",
            "Publication year": 2020,
            "Publication url": "https://alz-journals.onlinelibrary.wiley.com/doi/abs/10.1002/alz.045099",
            "Abstract": "Although Alzheimer's disease (AD) is associated with changes in spoken language, these have seldom been subjected to systematic analysis on a large scale. We evaluated the effectiveness of LangAware to detect the language indicators that are coupled with early AD, thus assisting with diagnosis. We evaluated LangAware using recordings of speech samples obtained from AD patients and matched healthy controls (NC) derived from various elicitation tasks in two languages, English and Greek*.English and Greek datasets were analyzed employing feature selection techniques to choose the most prominent multi‐level linguistic analysis features differentiating the AD from the NC group in both languages. The platform’s diagnostic performance was evaluated on its ability to classify \"unseen\" audio recordings employing these salient features.Evaluation results indicated that …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:BzfGm06jWhQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "iasis: Towards heterogeneous big data analysis for personalized medicine",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8787467/",
            "Abstract": "The vision of IASIS project is to turn the wave of big biomedical data heading our way into actionable knowledge for decision makers. This is achieved by integrating data from disparate sources, including genomics, electronic health records and bibliography, and applying advanced analytics methods to discover useful patterns. The goal is to turn large amounts of available data into actionable information to authorities for planning public health activities and policies. The integration and analysis of these heterogeneous sources of information will enable the best decisions to be made, allowing for diagnosis and treatment to be personalised to each individual. The project offers a common representation schema for the heterogeneous data sources. The iASiS infrastructure is able to convert clinical notes into usable data, combine them with genomic data, related bibliography, image data and more, and create a global …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:nVrZBo8bIpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Probabilistic event calculus for event recognition",
            "Publication year": 2015,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2699916",
            "Abstract": "Symbolic event recognition systems have been successfully applied to a variety of application domains, extracting useful information in the form of events, allowing experts or other systems to monitor and respond when significant events are recognised. In a typical event recognition application, however, these systems often have to deal with a significant amount of uncertainty. In this article, we address the issue of uncertainty in logic-based event recognition by extending the Event Calculus with probabilistic reasoning. Markov logic networks are a natural candidate for our logic-based formalism. However, the temporal semantics of the Event Calculus introduce a number of challenges for the proposed model. We show how and under what assumptions we can overcome these problems. Additionally, we study how probabilistic modelling changes the behaviour of the formalism, affecting its key property—the inertia of …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:eMMeJKvmdy0C",
            "Publisher": "ACM"
        },
        {
            "Title": "USING MACHINE LEARNING TECHNIQUES FOR PART-OF-SPEECH",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=EWLVCgAAQBAJ&oi=fnd&pg=PA273&dq=info:W0mn1sgmpx0J:scholar.google.com&ots=XueE_d7lnq&sig=_cXqqEfT6EUZxF-z0wfwHxnmziM",
            "Abstract": "This article investigates the use of Transformation-Based Error-Driven learning for part-ofspeech tagging in the Greek language. The aim is not only to study the performance, but also to examine its dependence on different thematic domains. Results are presented here for two different test cases: a corpus on “management succession events” and a general-theme corpus. The two experiments show that the performance of this method does not depend on the thematic domain of the corpus, and its accuracy for the Greek language is around 95%.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "World Scientific"
        },
        {
            "Title": "Machine learning and its applications: advanced lectures",
            "Publication year": 2001,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=pm5rCQAAQBAJ&oi=fnd&pg=PR3&dq=info:8OMX1xeMSxYJ:scholar.google.com&ots=szyQ-AxXDl&sig=nfniFuO-hZ1CACGdMG0ZsnZZrDM",
            "Abstract": "In recent years machine learning has made its way from artificial intelligence into areas of administration, commerce, and industry. Data mining is perhaps the most widely known demonstration of this migration, complemented by less publicized applications of machine learning like adaptive systems in industry, financial prediction, medical diagnosis and the construction of user profiles for Web browsers. This book presents the capabilities of machine learning methods and ideas on how these methods could be used to solve real-world problems. The first ten chapters assess the current state of the art of machine learning, from symbolic concept learning and conceptual clustering to case-based reasoning, neural networks, and genetic algorithms. The second part introduces the reader to innovative applications of ML techniques in fields such as data mining, knowledge discovery, human language technology, user modeling, data analysis, discovery science, agent technology, finance, etc.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer-Verlag New York Inc"
        },
        {
            "Title": "Towards Open Domain Event Extraction from Twitter: REVEALing Entity Relations.",
            "Publication year": 2015,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1068.5132&rep=rep1&type=pdf",
            "Abstract": "In the past years social media services received content contributions from millions of users, making them a fruitful source for data analysis. In this paper we present a novel approach for mining Twitter data in order to extract factual information concerning trending events. Our approach is based on relation extraction between named entities, such as people, organizations and locations. The experiments and the obtained results suggest that relation extraction can help in extracting events in social media, when combined with pre and post-processing steps.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:hMsQuOkrut0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "The effect of dimensionality reduction on large scale hierarchical classification",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-11382-1_16",
            "Abstract": "Many classification problems are related to a hierarchy of classes, that can be exploited in order to perform hierarchical classification of test objects. The most basic way of hierarchical classification is that of cascade classification, which greedily traverses the hierarchy from root to the predicted leaf. In order to perform cascade classification, a classifier must be trained for each node of the hierarchy. In large scale problems, the number of features can be prohibitively large for the classifiers in the upper levels of the hierarchy. It is therefore desirable to reduce the dimensionality of the feature space at these levels. In this paper we examine the computational feasibility of the most common dimensionality reduction method (Principal Component Analysis) for this problem, as well as the computational benefits that it provides for cascade classification and its effect on classification accuracy. Our experiments on two …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:epqYDVWIO7EC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Probabilistic Event Calculus Based on Markov Logic Networks",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-24908-2_19",
            "Abstract": "In this paper, we address the issue of uncertainty in event recognition by extending the Event Calculus with probabilistic reasoning. Markov Logic Networks are a natural candidate for our logic-based formalism. However, the temporal semantics of Event Calculus introduce a number of challenges for the proposed model. We show how and under what assumptions we can overcome these problems. Additionally, we demonstrate the advantages of the probabilistic Event Calculus through examples and experiments in the domain of activity recognition, using a publicly available dataset of video surveillance.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:WF5omc3nYNoC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "4.1 Methodology and Archtecture for Multimedia Ontology Evolution",
            "Publication year": 2006,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.439.7772&rep=rep1&type=pdf",
            "Abstract": "(for dissemination): Ontology evolution is generally defined as the timely adaptation of an ontology to changing requirements and the consistent propagation of changes to dependent artifacts. In BOEMIE, a novel, pattern-driven methodology for multimedia ontology evolution is defined to control the bootstrapping process. The methodology uses the information extracted from the multimedia content in order to populate, enrich and coordinate the domain ontology and to provide the necessary semantic information back to the information extraction modules. This document describes the methodology for ontology evolution adopted in BOEMIE together with the associated open architecture.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distributed online learning of event definitions",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1705.02175",
            "Abstract": "Logic-based event recognition systems infer occurrences of events in time using a set of event definitions in the form of first-order rules. The Event Calculus is a temporal logic that has been used as a basis in event recognition applications, providing among others, direct connections to machine learning, via Inductive Logic Programming (ILP). OLED is a recently proposed ILP system that learns event definitions in the form of Event Calculus theories, in a single pass over a data stream. In this work we present a version of OLED that allows for distributed, online learning. We evaluate our approach on a benchmark activity recognition dataset and show that we can significantly reduce training times, exchanging minimal information between processing nodes.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:LO7wyVUgiFcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Construction of Web community directories using document clustering and Web usage mining",
            "Publication year": 2003,
            "Publication url": "https://www.kde.cs.uni-kassel.de/wp-content/uploads/ws/ewmf03/papers/ewmf_all.pdf#page=31",
            "Abstract": "This paper presents the concept of Web Community Directories, as a means of personalizing services on the Web, together with a novel methodology for the construction of these directories by document clustering and usage mining methods. The community models are extracted with the use of the Community Directory Miner, a simple cluster mining algorithm which has been extended to ascend a concept hierarchy, and specialize it to the needs of user communities. The initial concept hierarchy is generated by a content-based document clustering method. Communities are constructed on the basis of usage data collected by the proxy servers of an Internet Service Provider. These data present a number of peculiarities such as their large volume and semantic diversity. Initial results presented in the paper illustrate the use of the methodology and provide an indication of the behavior of the new mining method.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:35N4QoGY0k4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "TL-PLSA: Transfer learning between domains with different classes",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6729526/",
            "Abstract": "A new transfer learning method is presented in this paper, addressing a particularly hard transfer learning problem: the case where the target domain shares only a subset of its classes with the source domain and only unlabeled data are provided for the target domain. This is a situation that occurs frequently in real-world applications, such as the multiclass document classification problems that motivated our work. The proposed approach is a transfer learning variant of the Probabilistic Latent Semantic Analysis (PLSA) model that we name TL-PLSA. Unlike most approaches in the literature, TL-PLSA captures both the difference of the domains and the commonalities of the class sets, given no labelled data from the target domain. We perform experiments over three different datasets and show the difficulty of the task, as well as the promising results that we obtained with the new method.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Overview of BioASQ 2021-MESINESP track. Evaluation of advance hierarchical classification techniques for scientific literature, patents and clinical trials",
            "Publication year": 2021,
            "Publication url": "https://repisalud.isciii.es/handle/20.500.12105/13311",
            "Abstract": "There is a pressing need to exploit recent advances in natural language processing technologies, in particular language models and deep learning approaches, to enable improved retrieval, classification and ultimately access to information contained in multiple, heterogeneous types of documents. This is particularly true for the field of biomedicine and clinical research, where medical experts and scientists need to carry out complex search queries against a variety of document collections, including literature, patents, clinical trials or other kind of content like EHRs. Indexing documents with structured controlled vocabularies used for semantic search engines and query expansion purposes is a critical task for enabling sophisticated user queries and even cross-language retrieval. Due to the complexity of the medical domain and the use of very large hierarchical indexing terminologies, implementing efficient automatic systems to aid manual indexing is extremely difficult. This paper provides a summary of the MESINESP task results on medical semantic indexing in Spanish (BioASQ/ CLEF 2021 Challenge). MESINESP was carried out in direct collaboration with literature content databases and medical indexing experts using the DeCS vocabulary, a similar resource as MeSH terms. Seven participating teams used advanced technologies including extreme multilabel classification and deep language models to solve this challenge which can be viewed as a multi-label classification problem. MESINESP resources, we have released a Gold Standard collection of 243,000 documents with a total of 2179 manual annotations divided in train …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:7H_MAutzIkAC",
            "Publisher": "CEUR Workshop Proceedings"
        },
        {
            "Title": "Automatic adaptation of Proper Noun Dictionaries through cooperation of machine",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=17803445594172713619&hl=en&oi=scholarr",
            "Abstract": "The recognition of Proper Nouns (PNs) is considered an important task in the area of Information Retrieval and Extraction. However the high performance of most existing PN classifiers heavily depends upon the avail-ability of large dictionaries of domain-specific Proper Nouns, and a certain amount of manual work for rule writing or manual tagging. Though it is not a heavy requirement to rely on some existing PN dictionary (of-ten these resources are available on the web), its coverage of a domain corpus may be rather low, in absence of manual updating. In this paper we propose a technique for the automatic updating of a PN Diction-ary through the cooperation of an inductive and a probabilistic classifier. In our experiments we show that, whenever an existing PN Dictionary allows the identification of 50% of the proper nouns within a corpus, our technique allows, without additional manual effort, the successful recognition of about 90% of the remaining 50%1 Proper Noun Classification Information Extraction (IE) is the task of automatically extracting information of interest from unconstrained text and creating a structured representation of this information. In IE we are mainly interested in extracting events. Every event involves a number of named entities, which belong in different semantic classes (eg persons, organisations, locations, dates), and some relationships that hold among these named entities (eg per-sonnel joining and leaving companies in management succes-sion events). As a result, an IE task involves two main subtasks: the recognition of the named entities involved in an event and the recognition of the relationships holding …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:MhiOAD_qIWkC",
            "Publisher": "ACM Press"
        },
        {
            "Title": "Splice site prediction across different organisms: A transfer learning approach",
            "Publication year": 2020,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3411408.3411458",
            "Abstract": "The fast emergence and the great success of Next Generation Sequencing (NGS) technology has marked a new era in genetics, giving the scientific community the ability to sequence complete genomes in just a few hours. However, it has also brought challenges in ab initio genome annotation, considering the disproportion of the huge amount of data generated and the already annotated data, rendering new computational methods, that can facilitate the annotation process crucial. An essential task in gene annotation is splice site definition, that is the identification of the boundaries (splice donor and acceptor) between the exons and the introns of a gene. Herein, we face the problem of acceptor splice site recognition using transfer learning methods. More specifically, we use transfer learning in order to benefit from the knowledge obtained from the annotation of Caenorhabditis Elegans, which is a model organism …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:lgwcVrK6X84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Ontology-Based Rescue Operation Management",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-00440-7_11",
            "Abstract": "The focus of this paper is ontology-based knowledge management in the framework of a mobile communication and information system for rescue operation management. We present a novel ontology data service, combining prior domain knowledge about large-scale rescue operations with dynamic information about a developing operation. We also discuss the integration of such a data service into a service-oriented application framework to reach high performance and accessibility, and offer examples of SHARE applications to demonstrate the practical benefits of the approach chosen.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "User Community Discovery",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-319-23835-7.pdf",
            "Abstract": "This book aims to introduce the reader to concepts and methods of user community discovery on the social Web. It does so by presenting the evolution of online user communities from the early days of the Web to the complex online social networks that we have formed today. On this basis it explains how state-of-the-art methods for web community discovery can be adapted to address new challenges. It also presents opportunities for research in the new setting and provides examples of new methods that have appeared in the literature. The basis for current research on community discovery methods is the early work on Web community discovery. Since the wide adoption of Internet-based services and applications, the users’ digital traces on Web sites allowed the segmentation of users into communities of “like-minded” individuals. Such communities supported the provision of personalized services to Web users …",
            "Abstract entirety": 0,
            "Author pub id": "-pec7wIAAAAJ:tuHXwOkdijsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Knowledge-driven multimedia information extraction and ontology evolution: bridging the semantic gap (Lecture Notes in Artificial Intelligence)",
            "Publication year": 2011,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "An integrated and scalable platform for proactive event-driven traffic management",
            "Publication year": 2017,
            "Publication url": "https://arxiv.org/abs/1703.02810",
            "Abstract": "Traffic on freeways can be managed by means of ramp meters from Road Traffic Control rooms. Human operators cannot efficiently manage a network of ramp meters. To support them, we present an intelligent platform for traffic management which includes a new ramp metering coordination scheme in the decision making module, an efficient dashboard for interacting with human operators, machine learning tools for learning event definitions and Complex Event Processing tools able to deal with uncertainties inherent to the traffic use case. Unlike the usual approach, the devised event-driven platform is able to predict a congestion up to 4 minutes before it really happens. Proactive decision making can then be established leading to significant improvement of traffic conditions.",
            "Abstract entirety": 1,
            "Author pub id": "-pec7wIAAAAJ:FAceZFleit8C",
            "Publisher": "Unknown"
        }
    ]
}]