[{
    "name": "Γεώργιος Μακρής",
    "romanize name": "Georgios Makris",
    "School-Department": "Electrical Engineering",
    "University": "University of Texas at Dallas",
    "Rank": "Καθηγητής",
    "Apella_id": 9069,
    "Scholar name": "Yiorgos Makris",
    "Scholar id": "dUO4lKwAAAAJ",
    "Affiliation": "The University of Texas at Dallas",
    "Citedby": 5398,
    "Scholar url": "https://scholar.google.com/citations?user=dUO4lKwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "AVF analysis acceleration via hierarchical fault pruning",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5957928/",
            "Abstract": "The notion of Architectural Vulnerability Factor (AVF) has been extensively used by designers to evaluate various aspects of design robustness. While AVF is a very accurate way of assessing element resiliency, its calculation requires rigorous and extremely time-consuming experiments. In response, designers have introduced various methodologies that allow AVF calculation within reasonable time, at the cost of some loss of accuracy. In this paper, we present a method for calculating the AVF of design elements-using Statistical Fault Injection (SFI)-with equal accuracy but several orders of magnitude faster than traditional SFI techniques. Our method partitions the design into various hierarchical levels and systematically performs incremental fault injections to generate the AVF numbers. The presented method has been applied on an Intel microprocessor, where experimental results corroborate its ability to …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction-level impact analysis of low-level faults in a modern microprocessor controller",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5432157/",
            "Abstract": "We investigate the correlation between low-level faults in the control logic of a modern microprocessor and their instruction-level impact on the execution of typical workload. Such information can prove immensely useful in accurately assessing and prioritizing faults with regards to their criticality, as well as commensurately allocating resources to enhance online testability and error/fault resilience through concurrent error detection/correction methods. To this end, we developed an extensive fault simulation infrastructure which allows injection of stuck-at faults and transient errors of arbitrary starting time and duration, as well as cost-effective simulation and classification of their repercussions into various instruction-level error types. As a test vehicle for our study, we employ a superscalar, dynamically-scheduled, out-of-order, Alpha-like microprocessor, on which we execute SPEC2000 integer benchmarks. Extensive …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing simulation accuracy through advanced hazard detection in asynchronous circuits",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4599573/",
            "Abstract": "A fast and accurate simulator with elaborate hazard detection capabilities is vital for asynchronous circuits, not only for the purpose of design validation through logic simulation, but even more importantly for the purpose of test validation through fault simulation. Towards this end, we developed SPIN-SIM, a logic and fault simulator built around Eichelbergerpsilas classical hazard detection method, yet extended in various ways in order to overcome its limitations. More specifically, in order to improve simulation accuracy and hazard detection, SPIN-SIM i) employs a 13-valued algebra for which it adapts Eichelbergerpsilas method, ii) maintains partial orders of causal signal transitions through relative time-stamps, and iii) unfolds time-frames judiciously to distinguish between hazards and actual transitions. Experimental results demonstrate that, at the cost of a negligible increase in computational time over …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:TQgYirikUcIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPIN-TEST: Automatic test pattern generation for speed-independent circuits",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1382703/",
            "Abstract": "SPIN-TEST is a simulation-based gate-level ATPG system for speed-independent circuits. Its core engine is an A* search algorithm which employs an accurate fault simulator and an efficient cost function to guide a deterministic test pattern generation phase. A random test pattern generation phase is also available in order to improve run time. The key ATPG challenge in speed-independent circuits is the generation of patterns that are valid independently of the relative timing and the order of arrival of signals. SPIN-TEST addresses this challenge by guaranteeing fault sensitization with hazard/race-free patterns and response observation that is not affected by oscillations or non-deterministic circuit states. Experimental results on benchmark circuits demonstrate the efficiency of SPIN-TEST in terms of both high fault coverage and low test generation time.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Concurrent hardware Trojan detection in wireless cryptographic ICs",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7342386/",
            "Abstract": "We introduce a Concurrent Hardware Trojan Detection (CHTD) methodology for wireless cryptographic integrated circuits (ICs), based on continuous extraction of a side-channel fingerprint and evaluation by a trained on-chip neural classifier. While similar statistical side-channel fingerprinting methods have been extensively studied in the past, they operate either before an IC is deployed or, periodically, during idle times, after an IC is deployed. Therefore, they can be easily evaded by a hardware Trojan which remains dormant at all times except during normal operation. In contrast, the proposed methodology operates concurrently with the normal functionality of the IC and is, therefore, much harder to evade. The proposed methodology is demonstrated using a hybrid experimentation platform consisting of (i) a custom-designed wireless cryptographic IC, infested with hardware Trojans that are controllable to be …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:tzM49s52ZIMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Parametric counterfeit IC detection via support vector machines",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6378191/",
            "Abstract": "We present a method to detect a common type of counterfeit Integrated Circuits (ICs), namely used ones, from their brand new counterparts using Support Vector Machines (SVMs). In particular, we demonstrate that we can train a one-class SVM classifier using only a distribution of process variation-affected brand new devices, but without prior information regarding the impact of transistor aging on the IC behavior, to accurately distinguish between these two classes based on simple parametric measurements. We demonstrate effectiveness of the proposed method using a set of actual fabricated devices which have been subjected to burn-in test, in order to mimic the impact of aging degradation over time, and we discuss the limitations and the potential extensions of this approach.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:tOudhMTPpwUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-overhead testing of delay faults in high-speed asynchronous pipelines",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1595687/",
            "Abstract": "We propose a low-overhead method for delay fault testing in high-speed asynchronous pipelines. The key features of our work are: (i) testing strategies can be administered using low-speed testing equipment; (ii) testing is minimally-intrusive, i.e. very little testing hardware needs to be added; (iii) testing methods are extended to pipelines with forks and joins, which is an important first step to testing pipelines with arbitrary topologies; (iv) test pattern generation takes into account the likely event that one delay fault causes several bits of data to become corrupted; and (v) test generation can leverage existing stuck-at ATPG tools. In describing our testing strategy, we use examples of faults from three very different high-speed pipeline styles: MOUSETRAP, GasP, and high-capacity (HC) pipelines. In addition, we give an in-depth example - including test pattern generation - for both linear and non-linear MOUSETRAP …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "ATTEST: Application-Agnostic Testing of a Novel Transistor-Level Programmable Fabric",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9107561/",
            "Abstract": "A recently introduced TRAnsistor-level Programmable fabric (TRAP) has demonstrated great promise towards seamless unification of high-density reconfigurable logic with Application-Specific Integrated Circuits (ASICs). However, practical deployment of TRAP relies on the development of a comprehensive mechanism for detecting manufacturing defects. Unfortunately, the state-of-the-art test schemes are developed either for ASICs or for Field-Programmable Gate Arrays (FPGAs) and do not support this new transistor-level architecture. To address this limitation, we present a novel application-agnostic test methodology specifically tailored to the TRAP fabric. We first introduce a multi-phase, cascadable scheme to efficiently test the programmable transistors in TRAP's Logic Elements (LEs). Then, we define the required test patterns for verifying the correct functionality of the built-in D flip-flop, full-adder, and …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:4hFrxpcac9AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Security and trust in the analog/mixed-signal/RF domain: A survey and a perspective",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7968235/",
            "Abstract": "We summarize and present the available body of knowledge in trusted and secure design of analog/mixed-signal/ radio frequency (RF) integrated circuits (ICs) and intellectual properties (IPs), covering both known vulnerabilities and available remedies. Furthermore, we discuss the limitations of the current state-of-the-art in this topic, highlight the concomitant risks, and suggest research directions and steps to be taken towards designing, fabricating and deploying trusted and secure analog/mixed-signal/RF circuits. More specifically, a comprehensive survey of the relevant literature is provided, organized around three themes: (i) hardware Trojans and Trojan states in analog/mixed-signal/RF ICs along with existing detection/prevention methods, (ii) analog/mixed-signal/RF IC/IP reverse engineering and counterfeiting, as well as techniques for proving authenticity and ownership, and (iii) limitations of existing …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A machine learning approach to fab-of-origin attestation",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2966986.2966992",
            "Abstract": "We introduce a machine learning approach for distinguishing between integrated circuits fabricated in a ratified facility and circuits originating from an unknown or undesired source based on parametric measurements. Unlike earlier approaches, which seek to achieve the same objective in a general, design-independent manner, the proposed method leverages the interaction between the idiosyncrasies of the fabrication facility and a specific design, in order to create a customized fab-of-origin membership test for the circuit in question. Effectiveness of the proposed method is demonstrated using two large industrial datasets from a 65nm Texas Instruments RF transceiver manufactured in two different fabrication facilities.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:nrtMV_XWKgEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design for hardware trust",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-8080-9_16",
            "Abstract": "Toward further enhancing the effectiveness of postfabrication hardware Trojan detection solutions and alleviating their limitations, as discussed in previous chapters, several methods which rely on modifying the current IC design flow have been developed by the hardware security and trust community. Collectively termed design for hardware trust [1], these Trojan prevention methods aim to prevent insertion and facilitate simple detection of hardware Trojans. In contrast to Trojan detection methods which passively test chips anticipating that the inserted Trojans will be identified based on their abnormal behavior, Trojan prevention methods take a proactive step by changing the circuit structure itself in order to prevent the insertion of Trojans. In order to achieve this goal, the entire IC supply chain needs to be revisited. The resulting modified IC supply chain emphasizes design security to counter Trojan threats …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "On-chip intelligence: A pathway to self-testable, tunable, and trusted analog/RF ICs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6908605/",
            "Abstract": "This paper discusses the design of an experimentation platform intended for prototyping low-cost neural networks for on-chip integration, towards supporting built-in self-test, post-production self-calibration, and trust evaluation capabilities. Particular emphasis is given to cost-efficient implementation reflected in stringent area and power constraints of circuits dedicated to neural networks, which, however, should not compromise their learning ability and correct functionality throughout their lifecycle. Our chip consists of a reconfigurable array of synapses and neurons operating below threshold and featuring sub-μW power consumption. The synapse circuits employ dual-mode weight storage: (1) a dynamic mode, for fast bidirectional weight updates during training and (2) a non-volatile mode, for permanent storage of learned functionality. The chip architecture supports two learning models: a multilayer perceptron and …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:9vf0nzSNQJEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improved static hand gesture classification on deep convolutional neural networks using novel sterile training technique",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9321398/",
            "Abstract": "In this paper, we investigate novel data collection and training techniques towards improving classification accuracy of non-moving (static) hand gestures using a convolutional neural network (CNN) and frequency-modulated-continuous-wave (FMCW) millimeter-wave (mmWave) radars. Recently, non-contact hand pose and static gesture recognition have received considerable attention in many applications ranging from human-computer interaction (HCI), augmented/virtual reality (AR/VR), and even therapeutic range of motion for medical applications. While most current solutions rely on optical or depth cameras, these methods require ideal lighting and temperature conditions. mmWave radar devices have recently emerged as a promising alternative offering low-cost system-on-chip sensors whose output signals contain precise spatial information even in non-ideal imaging conditions. Additionally, deep …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:OR75R8vi5nAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Counterfeit integrated circuits: A rising threat in the global semiconductor supply chain",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6856206/",
            "Abstract": "As the electronic component supply chain grows more complex due to globalization, with parts coming from a diverse set of suppliers, counterfeit electronics have become a major challenge that calls for immediate solutions. Currently, there are a few standards and programs available that address the testing for such counterfeit parts. However, not enough research has yet addressed the detection and avoidance of all counterfeit parts-recycled, remarked, overproduced, cloned, out-of-spec/defective, and forged documentation-currently infiltrating the electronic component supply chain. Even if they work initially, all these parts may have reduced lifetime and pose reliability risks. In this tutorial, we will provide a review of some of the existing counterfeit detection and avoidance methods. We will also discuss the challenges ahead for implementing these methods, as well as the development of new detection and …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Process monitoring through wafer-level spatial variation decomposition",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6651901/",
            "Abstract": "Monitoring the semiconductor manufacturing process and understanding the various sources of variation and their repercussions is a crucial capability. Indeed, identifying the root-cause of device failures, enhancing yield of future production through improvement of the manufacturing environment, and providing feedback to the designer toward development of design techniques that minimize failure rate rely on such a capability. To this end, we introduce a spatial decomposition method for breaking down the variation of a wafer to its spatial constituents, based on a small number of measurements sampled across the wafer. We demonstrate that by leveraging domain-specific knowledge and by using as constituents dynamically learned, interpretable basis functions, the ability of the proposed method to accurately identify the sources of variation is drastically improved, as compared to existing approaches. We then …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:olpn-zPbct0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Knob non-idealities in learning-based post-production tuning of analog/RF ICs: Impact & remedies",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7928952/",
            "Abstract": "As CMOS technology continues to scale down, the effect of process variations on yield and performance of analog/RF ICs is becoming more prominent. To counteract this effect, learning-based post-production tuning has been proposed, wherein regression functions are trained and used to adjust tunable knobs based on low-cost alternate tests, thereby improving the performances of a circuit and, by extension, increasing yield. Of course, tunable knobs are also subject to process variations; yet this is not an issue when the knobs are part of the procedure that generates the data with which the regression models are trained, as this data reflects the impact of process variations on both the tunable circuit and the knobs. In various cases, however, such as in heterogeneous integrated systems, 3D ICs, or multi-chip modules, the knob circuitry may not be integrated on the same die, thereby limiting our ability to obtain a …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:vbGhcppDl1QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware Dithering: A Run-Time Method for Trojan Neutralization in Wireless Cryptographic ICs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8624705/",
            "Abstract": "We introduce a hardware dithering methodology for neutralizing Trojans in integrated circuits (ICs). The proposed approach seeks to make the operating point of an IC an unpredictable moving target during run time. Thereby, the ability of a Trojan to exploit the process variation margins, wherein hardware Trojans typically find breathing room to operate while remaining concealed, is significantly restricted. To demonstrate this hardware dithering concept, we leverage tuning knobs operating on the power and frequency characteristics of the transmission of a wireless cryptographic IC. These knobs are driven by a random number generator, thus forcing the circuit into a random walk in the space of its parametric performances while in normal operating mode. In essence, while the circuit remains within its operating specifications during this random walk, its exact operating point varies, thus muddying the waters for the …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:-FonjvnnhkoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compaction-based concurrent error detection for digital circuits",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0026269205002107",
            "Abstract": "We present a non-intrusive concurrent error detection (CED) method for combinational and sequential digital circuits. We analyze the optimal solution model and point out the limitations that prevent logic synthesis from yielding a minimal-cost monolithic CED implementation. We then propose a compaction-based alternative approach for restricted error models. The proposed method alleviates these limitations by decomposing the CED functionality into: compaction of the circuit outputs, prediction of the compacted responses, and comparison. We model the fault-free and erroneous responses as connected vertices in a graph and perform graph coloring in order to derive the compacted responses. The proposed method is first discussed within the context of combinational circuits, with zero detection latency, and subsequently extended to Finite State Machines (FSMs), with a constant detection latency of one clock …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:maZDTaKrznsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "VIPER: A Versatile and Intuitive Pattern GenERator for Early Design Space Exploration",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9000169/",
            "Abstract": "Contemporary technology nodes exhibit high defectivity due to complex interactions between the process and certain layout topologies/patterns. Foundries identify such patterns during diagnosis, Scanning Electron Microscope (SEM) inspections, Failure Analysis (FA), etc., and create a database to restrict their presence in future designs. However, such a database can be generated only after fabricating a few products, hence making this process reactive. Ideally, foundries would prefer to have a proactive approach, where such sensitive patterns are available up-front during technology development. Thereby, they can build accurate Hotspot Detection models and offer a robust Product Design Kit (PDK) to even the earliest of customers, either by ensuring that the process is immune to such patterns or by including them in the Design For Manufacturability Guidelines (DFMGs). To enable this, Early Design Space …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:8d8msizDQcsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fault tolerant design of combinational and sequential logic based on a parity check code",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1250156/",
            "Abstract": "We describe a method for designing fault tolerant circuits based on an extension of a concurrent error detection (CED) technique. The proposed extension combines parity check codes and duplication in order to not only perform error detection but also provide diagnosis and correction capabilities. Informed selection among the outputs of the original synthesized circuit and the outputs of a constrained-sharing resynthesized duplicate with parity check codes renders a low-cost fault tolerant design. Experimental results confirm the efficacy of the proposed method as a general solution for designing fault tolerant circuits.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Session 7C: TTTC 2009 Best Doctoral Thesis Contest",
            "Publication year": 2009,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/vts/2009/05116639/12OmNyO8tQD",
            "Abstract": "Summary form only given, as follows. This session is the final round of the TTTC 2009 Best Doctoral Thesis Contest. This contest is organized by the TTTC Student Activities Committee for the fifth consecutive year and aims to promote and strengthen the interaction between graduate students and the industrial community, as well as to serve as a process by which student work is exposed to and tested under real-life industrial needs. This is achieved by offering students the chance to present their work in a conference environment to academic and industrial test experts, who will evaluate and comment in terms of novelty and advancement of industrial practice. In the preliminary round of this contest, doctoral students who are expected to graduate in 2009 were invited to submit a one page abstract of their thesis, where they defined the problem and its relevance to industry, described existing industrial practices for …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:a0OBvERweLwC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Amplitude-modulating Analog/RF hardware trojans in wireless networks: Risks and remedies",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9079514/",
            "Abstract": "We investigate the risk posed by amplitude-modulating analog/RF hardware Trojans in wireless networks and propose a defense mechanism to mitigate the threat. First, we introduce the operating principles of amplitude-modulating analog/RF hardware Trojan circuits and we theoretically analyze their performance characteristics. Subject to channel conditions and hardware Trojan design restrictions, this analysis seeks to determine the impact of these malicious circuits on the legitimate communication and to understand the capabilities of the covert channel that they establish in practical wireless networks, by characterizing its error probability. Next, we present the implementation of two hardware Trojan examples on a Wireless Open-Access Research Platform (WARP)-based experimental setup. These examples reside in the analog and the RF circuitry of an 802.11a/g transmitter, respectively, where they …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:HtEfBTGE9r8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Experiences in hardware Trojan design and implementation",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5224971/",
            "Abstract": "We report our experiences in designing and implementing several hardware Trojans within the framework of the Embedded System Challenge competition that was held as part of the Cyber Security Awareness Week (CSAW) at the Polytechnic Institute of New York University in October 2008. Due to the globalization of the Integrated Circuit (IC) manufacturing industry, hardware Trojans constitute an increasingly probable threat to both commercial and military applications. With traditional testing methods falling short in the quest of finding hardware Trojans, several specialized detection methods have surfaced. To facilitate research in this area, a better understanding of what Hardware Trojans would look like and what impact they would incur to an IC is required. To this end, we present eight distinct attack techniques employing Register Transfer Level (RTL) hardware Trojans to compromise the security of an Alpha …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:qjMakFHDy7sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Duplication-based concurrent error detection in asynchronous circuits: shortcomings and remedies",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1173531/",
            "Abstract": "Concurrent error detection (CED) methods are typically employed to provide an indication of the operational health of synchronous circuits during normal functionality. Existing CED techniques, however, require modification in order to be successfully adapted to asynchronous designs. We discuss the limitations of duplication, the simplest CED method, when applied to asynchronous circuits. We demonstrate that such limitations arise mainly due to comparison synchronization issues and inadequate detection of performance-related errors. We propose a circuit that alleviates the difficulties associated with comparison synchronization and we introduce a methodology that enables detection of errors that do not result in logic discrepancies and, thus, may not be detected through comparison. The proposed techniques are illustrated on example circuits, revealing their ability to render concurrently testable asynchronous …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Extending the Lifetime of Coarse-Grained Runtime Reconfigurable FPGAs by Balancing Processing Element Usage",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8977912/",
            "Abstract": "Contemporary coarse-grained runtime reconfigurable architectures (CGRRAs) are increasingly sensitive to aging effects such as Negative Bias Temperature Instability (NBTI). To address this, we propose a reliability-aware floorplanner for CGRRAs based on a mixed Linear Programming (LP) and Integer Linear Programming (ILP) method that extends the Mean Time to Failure (MTTF) of CGRRAs by balancing processing element (PE) usage. We use this as the basis of a design space explorer that generates a variety of configurations, trading off PE displacement vs. MTTF. On average, a 2.4× improvement in MTTF was obtained for an average critical path delay increase of under 2 percent (although most benchmarks had no delay increase) compared to the default lifetime unaware floorplan.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:GtLg2Ama23sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exponent monitoring for low-cost concurrent error detection in FPU control logic",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5783727/",
            "Abstract": "We present a non-intrusive concurrent error detection (CED) method for protecting the control logic of a contemporary floating point unit (FPU). The proposed method is based on the observation that control logic errors lead to extensive datapath corruption and affect, with high probability, the exponent part of the IEEE 754 floating point representation. Thus, exponent monitoring can be utilized to detect errors in the control logic of the FPU. Predicting the exponent involves relatively simple operations, therefore our method incurs significantly lower overhead than the classical approach of duplicating the control logic of the FPU. Indeed, experimental results on the openSPARC T1 processor show that, as compared to control logic duplication, which incurs an area overhead of 17.9% of the FPU size, our method incurs an area overhead of only 5.8% yet still achieves detection of over 95% of transient errors in the FPU …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "DFTT: Design for Trojan test",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5724725/",
            "Abstract": "Due to the globalization of the Integrated Circuit (IC) manufacturing industry, hardware Trojans constitute an increasingly probable threat to both commercial and military applications. As traditional testing methods fall short in finding hardware Trojans, several specialized detection methods have surfaced. To facilitate research in this area and embed internal barriers to prevent Trojan attacks both at the design level and at the manufacturing level, we propose a Design-for-Trojan-Test (DFTT) methodology. DFTT is based on one key principle: increase the complexity for hardware Trojan attackers, thereby making successful hardware Trojan-based attacks extremely difficult to accomplish. A DFTT tool is also developed to automate the hardening process. The effectiveness of our Trojan prevention method is demonstrated on the Trivium encryption core.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Workload characterization and prediction: A pathway to reliable multi-core systems",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7229843/",
            "Abstract": "As a result of technology scaling, power density of multi-core chips increases and leads to temperature hot-spots which accelerate device aging and chip failure. Moreover, intense efforts to reduce power consumption by employing low-power techniques decrease the reliability of new design generations. Traditionally, reactive thermal/power management techniques have been used to take appropriate action when the temperature reaches a threshold. However, these approaches do not always balance temperature and, as a result, may degrade system reliability. Therefore, to distribute temperature evenly across all cores, a proactive mechanism is needed to forecast future workload characteristics and the corresponding temperature, in order to make decisions before hot spots occur. Such proactive methods rely on an engine to precisely predict future workload characteristics. In this work, we first discuss the state …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:kzcrU_BdoSEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fault simulation and random test generation for speed-independent circuits",
            "Publication year": 2004,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/988952.988984",
            "Abstract": "We develop a fault simulator for input stuck-at faults in Speed-Independent circuits by extending Eichelberger's method. In order to achieve higher accuracy, a 13-valued algebra is adopted, the relative order of causal signal transitions is maintained, and time frames are unfolded in a careful manner. Based on this simulator, we propose a random test generation algorithm which reduces the probability that the circuit finds itself in non-deterministic states and helps it recover when this happens. Experimental results show that the combination of the two techniques achieves an average improvement of 18% in fault coverage.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Statistical Approach to Characterizing and Testing Functionalized Nanowires",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4511734/",
            "Abstract": "Unlike the top-down photolithographic CMOS VLSI process, cost-effective bulk fabrication of nanodevices calls for a bottom-up approach, generally called self-assembly. Self- assembly, however, inherently lends itself to innate disparities in the structure of nominally identical nanodevices and, consequently, wide inter-device variance in their functionality. As a result, nanodevice characterization and testing calls for a slow and tedious procedure involving a large number of measurements. In this work, we discuss a statistical approach which learns measurement correlations from a small set of fully characterized nanodevices and utilizes the extracted knowledge to simplify the process for the rest of the nanodevices. More specifically, we employ various machine-learning methods which rely on a small subset of measurements to (i) predict the performances of a fabricated nanodevice, (ii) decide whether a nanodevice …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:dfsIfKJdRG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient MILP-based aging-aware floorplanner for multi-context coarse-grained runtime reconfigurable FPGAs",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9116537/",
            "Abstract": "Shrinking transistor sizes are jeopardizing the reliability of runtime reconfigurable Field Programmable Gate Arrays (FPGAs), making them increasingly sensitive to aging effects such as Negative Bias Temperature Instability (NBTI). This paper introduces a reliability-aware floorplanner which is tailored to multi-context, coarse-grained, runtime reconfigurable architectures (CGRRAs) and seeks to extend their Mean Time to Failure (MTTF) by balancing the usage of processing elements (PEs). The proposed method is based on a Mixed Integer Linear Programming (MILP) formulation, the solution to which produces appropriately-balanced mappings of workload to PEs on the reconfigurable fabric, thereby mitigating aging-induced lifetime degradation. Results demonstrate that, as compared to the default reliability-unaware floorplanning solutions, the proposed method achieves an average MTTF increase of 2.5× without …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:umqufdRvDiIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A field programmable transistor array featuring single-cycle partial/full dynamic reconfiguration",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7927200/",
            "Abstract": "We introduce a CMOS computational fabric consisting of carefully arranged regular rows and columns of transistors which can be individually configured and appropriately interconnected in order to implement a target digital circuit. Termed Field Programmable Transistor Array (FPTA), this novel reconfigurable architecture enables several highly-desirable features including (i) simultaneous storage of three configurations along with the ability to dynamically switch between them in a fraction of a single cycle, while retaining the fabric's computational state, (ii) rapid or full modification of a stored configuration in a time proportional to the number of modified configuration bits through the use of hierarchically arranged, high throughput, asynchronously pipelined memory buffers, and (iii) support for libraries containing cells of the same height and variable width, just as in a typical standard cell circuit, thereby simplifying …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware Trojan detection through golden chip-free statistical side-channel fingerprinting",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2593069.2593147",
            "Abstract": "Statistical side channel fingerprinting is a popular hardware Trojan detection method, wherein a parametric signature of a chip is collected and compared to a trusted region in a multi-dimensional space. This trusted region is statistically established so that, despite the uncertainty incurred by process variations, the fingerprint of Trojan-free chips is expected to fall within this region while the fingerprint of Trojan-infested chips is expected to fall outside. Learning this trusted region, however, assumes availability of a small set of trusted (ie\" golden\") chips. Herein, we rescind this assumption and we demonstrate that an almost equally effective trusted region can be learned through a combination of a trusted simulation model, measurements from process control monitors (PCMs) which are typically present either on die or on wafer kerf, and advanced statistical tail modeling techniques. Effectiveness of this method is …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:_B80troHkn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Silicon demonstration of hardware Trojan design and detection in wireless cryptographic ICs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7792718/",
            "Abstract": "Using silicon measurements from 40 chips fabricated in Taiwan Semiconductor Manufacturing Company's (TSMC's) 0.35-μm technology, we demonstrate the operation of two hardware Trojans, which leak the secret key of a wireless cryptographic integrated circuit (IC) consisting of an Advanced Encryption Standard (AES) core and an ultrawideband (UWB) transmitter (TX). With their impact carefully hidden in the transmission specification margins allowed for process variations, these hardware Trojans cannot be detected by production testing methods of either the digital or the analog part of the IC and do not violate the transmission protocol or any system-level specifications. Nevertheless, the informed adversary, who knows what to look for in the transmission power waveform, is capable of retrieving the 128-bit AES key, which is leaked with every 128-bit ciphertext block sent by the UWB TX. Moreover, through …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:EkHepimYqZsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Investigating the limits of AVF analysis in the presence of multiple bit errors",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6604050/",
            "Abstract": "We investigate the complexity and utility of performing Multiple Bit Upset (MBU) vulnerability analysis in modern microprocessors. While the Single Bit Flip (SBF) model constitutes the prevailing mechanism for capturing the effect of Single Event Upsets (SEUs) due to alpha particle or neutron strikes in semiconductors, recent radiation studies in 90nm and 65nm technology nodes demonstrate that up to 55% of such strikes result in Multiple Bit Upsets (MBUs). Consequently, the accuracy of popular vulnerability analysis methods, such as the Architecural Vulnerability Factor (AVF) and Failures In Time (FIT) rate estimates based on the SBF assumption comes into question, especially in modern microprocessors which contain a significant amount of memory elements. Towards alleviating this concern, we present an extensive infrastructure which enables MBU vulnerability analysis in modern microprocessors. Using this …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Global signal vulnerability (GSV) analysis for selective state element hardening in modern microprocessors",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6280561/",
            "Abstract": "Global Signal Vulnerability (GSV) analysis is a novel method for assessing the susceptibility of modern microprocessor state elements to failures in the field of operation. In order to effectively allocate design for reliability resources, GSV analysis takes into account the high degree of architectural masking exhibited in modern microprocessors and ranks state elements accordingly. The novelty of this method lies in the way this ranking is computed. GSV analysis operates either at the Register Transfer (RT-) or at the Gate-Level, offering increased accuracy in contrast to methods which compute the architectural vulnerability of registers through high-level simulations on performance models. Moreover, it does not rely on extensive Statistical Fault Injection (SFI) campaigns and lengthy executions of workloads to completion in RT- or Gate-Level designs, which would make such analysis prohibitive. Instead, it monitors the …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Acknowledgment of Guest Editors",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6953159/",
            "Abstract": "Acknowledgment of Guest Editors - IEEE Journals & Magazine IEEE.org IEEE Xplore IEEE-SA \nIEEE Spectrum More Sites Create Account Personal Sign In Personal Sign In For IEEE to \ncontinue sending you helpful information on our products and services, please consent to our \nupdated Privacy Policy. I have read and accepted the IEEE Privacy Policy. Accept & Sign In \nEmail Address Password Sign In Forgot Password? Acknowledgment of Guest Editors Abstract: \nThe publication offers a note of thanks and lists its reviewers. Published in: IEEE Transactions \non Computer-Aided Design of Integrated Circuits and Systems ( Volume: 33 , Issue: 12 , Dec. \n2014 ) Article #: Page(s): 1757 - 1757 Date of Publication: 20 November 2014 ISSN \nInformation: Print ISSN: 0278-0070 Electronic ISSN: 1937-4151 INSPEC Accession Number: \nPersistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=43 More » Publisher: by/…",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:5awf1xo2G04C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Post-deployment trust evaluation in wireless cryptographic ICs",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6176636/",
            "Abstract": "The use of side-channel parametric measurements along with statistical analysis methods for detecting hardware Trojans in fabricated integrated circuits has been studied extensively in recent years, initially for digital designs but recently also for their analog/RF counterparts. Such post-fabrication trust evaluation methods, however, are unable to detect dormant hardware Trojans which are activated after a circuit is deployed in its field of operation. For the latter, an on-chip trust evaluation method is required. To this end, we present a general architecture for post-deployment trust evaluation based on on-chip classifiers. Specifically, we discuss the design of an on-chip analog neural network which can be trained to distinguish trusted from untrusted circuit functionality based on simple measurements obtained via on-chip measurement acquisition sensors. The proposed method is demonstrated using a Trojan-free and …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:UxriW0iASnsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On Improving Hotspot Detection Through Synthetic Pattern-Based Database Enhancement",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9313011/",
            "Abstract": "Design hotspots are layout patterns which may cause defects due to complex design and process interactions. Several machine learning and pattern matching-based methods have been proposed to identify and correct them early during design stages. However, almost all of them suffer from high false-alarm rates, mainly because they are oblivious to the root causes of hotspots. In this work, we seek to address this limitation by using a novel database enhancement approach through synthetic pattern generation based on carefully crafted design of experiments. We evaluate the effectiveness of the proposed method using industry-standard tools and designs and demonstrate more than 3X reduction in classification error in comparison to the state-of-the-art.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:DUooU5lO8OsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cost-effective graceful degradation in speculative processor subsystems: The branch prediction case",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1240894/",
            "Abstract": "We analyze the effect of errors in branch predictors, a representative example of speculative processor subsystems, to motivate the necessity for fault tolerance in such subsystems. We also describe the design of fault tolerant branch predictors using general fault tolerance techniques. We then propose a fault-tolerant implementation that utilizes the finite state machine (FSM) structure of the pattern history table (PHT) and the set of potential faulty states to predict the branch direction, yet without strictly identifying the correct state. The proposed solution provides virtually the same prediction accuracy as general fault tolerant techniques, while significantly reducing the incurred hardware overhead.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:Zph67rFs4hoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware-based attacks to compromise the cryptographic security of an election system",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7753274/",
            "Abstract": "We present our experiences in implementing hardware-based attacks to subvert the results of an election system. The election system was outlined by the Cyber Security Awareness Week (CSAW) Embedded Security Challenge (ESC) competition in 2015, held at the New York University (NYU). The system had multiple layers of security and primarily used homomorphic encryption. The competition presented a challenge to hack the election system such that a preferred candidate wins the election. We cryptanalyzed the given election system to evaluate the effectiveness of various theoretical and practical attacks, and used a custom designed embedded system to demonstrate our attacks. The embedded system was implemented on a Nexys 4 DDR Artix-7 FPGA board. Our work, which earned the first place in the competition, demonstrates that low-cost hardware-based attacks can indeed lead to catastrophic …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:0KyAp5RtaNEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware-based real-time workload forensics via frame-level tlb profiling",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8758626/",
            "Abstract": "We propose a hardware-based solution for performing real-time workload forensics that enables identification of a process while it is being executed. More specifically, we divide execution flow of a process into consecutive frames and we extract descriptive features related to the Translation Lookaside Buffer (TLB) utilization profile for each such frame. These features are then processed through trained machine learning models to analyze program behavior and identify workload at the granularity of a process. Unlike previous research on workload forensics that performs ex post facto analysis based on the complete process execution profile, this method continuously analyzes the segmented workload execution flow; thus, it does not require knowledge of process creation, switch, and termination timestamps. Furthermore, as compared with software-based workload forensics solutions, whose data logging …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:ruyezt5ZtCIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Constructive derivation of analog specification test criteria",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1443455/",
            "Abstract": "We discuss the design of a neural system that learns to separate nominal from faulty instances of an analog circuit in a low dimensional measurement space. The key novelty of the proposed system is that it successively establishes a separation hypersurface of order that adapts to the intrinsic complexity of the problem. Thus, it performs excellent classification even in the presence of complex distributions. The test criterion for classifying a circuit is simply the location of its measurement pattern with respect to the separation hypersurface. Despite its simplicity, this criterion is, by construction, strongly correlated to the performance parameters of the circuit and does not rely on fault models.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Testing delay faults in asynchronous handshake circuits",
            "Publication year": 2006,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1233501.1233540",
            "Abstract": "As a class of asynchronous circuits, handshake circuits are designed to tolerate variation of gate delays. However, certain timing constraints, such as the bundled data assumption, are exploited in the single-rail implementation of these circuits in order to simplify them. Therefore, any delay fault in the circuit may cause one of two problems, namely performance degradation or logic errors. To address the challenges incurred by the autonomous behavior of handshake circuits during at-speed test, we propose test methods for both types of delay faults based on a DFT strategy which greatly simplifies the complexity of test generation. The efficiency of the proposed methodology is demonstrated through experimental results on several handshake circuits.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hardware Trojans in Wireless Networks",
            "Publication year": 2018,
            "Publication url": "http://www.hostsymposium.org/host2018/hwdemo/HOST_2017_hwdemo_22.pdf",
            "Abstract": "Wireless networks are now prevalent in most electronic systems, due to the rapid growth of telecommunications, sensor applications, and the Internet of Things. Though wireless devices use some form of encryption, the underlying hardware is still vulnerable to malicious modificiations (aka hardware Trojans). Therefore, in this research work, we (i) theoretically analyze the risks posed by hardware Trojans in wireless networks,(ii) experimentally validate those risks and (iii) develop defense mechanisms to prevent such attacks. Wireless devices inherently possess unused space, ie a gap, between their operating point and the physical limits of communication (Figure 1). A well crafted hardware Trojan, therefore, can be hidden within this gap and can be used to carryout malicious operations. Along this line, we have extensively studied the risks posed by two hardware Trojans in an IEEE 802.11 a/g wireless network. The first Trojan attack is staged in the baseband part of the wireless device, more specifically in the Forward Error Correction Encoder. The second attack is staged in the RF front-end of the wireless device, namely at the power amplifier. After thorough experimental analysis to study the Trojan characteristics, we have implemented these malicious circuits on two experimental platforms, namely the Universal Software Radio Peripheral (USRP) and Wireless Open Access Research Platform (WARP). Using these two setups, we demonstrate the hardware Trojan attacks, as well as the ability of the rogue receiver to retrieve the leaked information, while an unsuspecting legitimate receiver continues to accurately recover the original message …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:M7yex6snE4oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hardware Trojan detection using path delay fingerprint",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4559049/",
            "Abstract": "Trusted IC design is a recently emerged topic since fabrication factories are moving worldwide in order to reduce cost. In order to get a low-cost but effective hardware trojan detection method to complement traditional testing methods, a new behavior-oriented category method is proposed to divide trojans into two categories: explicit payload trojan and implicit payload trojan. This categorization method makes it possible to construct trojan models and then lower the cost of testing. Path delays of nominal chips are collected to construct a series of fingerprints, each one representing one aspect of the total characteristics of a genuine design. Chips are validated by comparing their delay parameters to the fingerprints. The comparison of path delays makes small trojan circuits significant from a delay point of view. The experimentpsilas results show that the detection rate on explicit payload trojans is 100%, while this …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hardware-based architecture-neutral framework for real-time iot workload forensics",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9109733/",
            "Abstract": "Beneath the potential benefits of the rapidly growing Internet of Things (IoT) technology lurk security risks. In this article, we propose a hardware-based generic framework for IoT workload forensics, an infrastructural technique to securely monitor and ensure delivered IoT services in accordance with specifications and regulatory compliance. In particular, this technique identifies digital workloads being executed in real time through dynamic program behavior modeling based on architecture-level data, fulfilled by dedicated machine learning hardware, without the intervention of high-level software, e.g., the OS and/or the hypervisor. In contrast to the conventional software-based solutions, whose effectiveness may be undermined by software attacks, and which introduce significant runtime overhead, a hardware-based framework enables a secure, prompt and non-intrusive solution. The proposed framework was …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:sNmaIFBj_lkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RF specification test compaction using learning machines",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5169847/",
            "Abstract": "We present a machine learning approach to the problem of RF specification test compaction. The proposed compaction flow relies on a multi-objective genetic algorithm, which searches in the power-set of specification tests to select appropriate subsets, and a classifier, which makes pass/fail decisions based solely on these subsets. The method is demonstrated on production test data from an RF device fabricated by IBM. The results indicate that machine learning can identify intricate correlations between specification tests, which allows us to infer the outcome of all tests from a subset of tests. Thereby, the number of tests that need to be explicitly carried out and the corresponding cost are reduced significantly without adversely impacting test accuracy.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:BqipwSGYUEgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Subtle Anomaly Detection of Microscopic Probes using Deep learning based Image Completion",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9000126/",
            "Abstract": "Automated defect inspection in manufacturing of microscopic probes is an important task and often requires machine learning driven solutions. A supervised only approach can be challenging, because production manufacturing process typically have few defects, thus large amounts of labeled training data are generally not available. In this work, we instead employed multiple models in a multi-step process to achieve the end goal of identifying defect and non-defect probe tips.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:FAceZFleit8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-intrusive design of concurrently self-testable FSMs",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1181681/",
            "Abstract": "We propose a methodology for the non-intrusive design of concurrently self-testable FSMs. The proposed method is similar to duplication, wherein a replica of the original FSM acts as a predictor that immediately detects potential faults by comparison to the original FSM. However, instead of duplicating the complete FSM, the proposed method replicates only a minimal portion adequate to detect all possible faults, yet at the cost of introducing potential fault detection latency. Furthermore, in contrast to concurrent error detection approaches, which presume the ability to re-synthesize the FSM and exploit parity-based state encoding, the proposed method is non-intrusive and does not interfere with the encoding and implementation of the original FSM. Experimental results on FSMs of various sizes and densities indicate that the proposed method detects 100% of the faults with very low average fault detection latency …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Improving analog and RF device yield through performance calibration",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5639022/",
            "Abstract": "As the semiconductor industry continues scaling devices toward smaller process nodes, maintaining acceptable yields despite process variations has become increasingly challenging. Analog and RF circuits are particularly sensitive to process variations. This article discusses the challenges of cost-effective postfabrication performance calibration in such analog and RF devices and introduces a single-test, single-tuning-step method to constrain cost and complexity while reaping the benefits of a tunable design.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Is single trojan detection scheme enough?",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=16023576763953193207&hl=en&oi=scholarr",
            "Abstract": "In this report, we proposed a new type of circuit attacking method which is not targeting the circuit itself but trying to mute the internal hardening technique. By implementing this attacking scheme, we argue that most of the currently proposed hardware Trojan prevention methods are far from security if we assume that attackers are patient and smart. As part of our work in the CSAW Embedded System Challenge hosted by NYU-Poly this year, we demonstrated that attackers can easily construct testing patterns by “reverse engineering” the hardened RTL code. A simple look up table can invalidate the sophisticated RO-based Trojan prevention method. We believe that any single Trojan prevention scheme is not enough to keep hardware Trojan out of the door and only the combination of several methods is a possible solution.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:mvPsJ3kp5DgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Yield forecasting in Fab-to-Fab production migration based on Bayesian model fusion",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7372543/",
            "Abstract": "Yield estimation is an indispensable piece of information at the onset of high-volume production of a device. It can be used to refine the process/design in time so as to guarantee high production yield. In the case of migration of production of a specific device from a source fab to a target fab, yield estimation in the target fab can be accelerated by employing information from the source fab, assuming that the process parameter distributions in the two fabs are similar, but not necessarily the same. In this paper, we employ the Bayesian Model Fusion (BMF) technique for efficient yield prediction of a device in the target fab. BMF adopts prior knowledge from the source fab and combines it intelligently with information from a limited number of early silicon wafers from the target fab. Thus, BMF allows us to obtain quick and accurate yield estimates at the onset of production in the target fab. The proposed methodology is …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-RF to RF test correlation using learning machines: A case study",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4209884/",
            "Abstract": "The authors present a case study that employs production test data from an RF device to assess the effectiveness of four different methods in predicting the pass/fail labels of fabricated devices based on a subset of performances and, thereby, in decreasing test cost. The device employed is a zero-IF down-converter for cell-phone applications and the four methods range from a sample maximum-cover algorithm to an advanced ontogenic neural network. The results indicate that a subset of non-RF performances suffice to predict correctly the pass/fail label for the vast majority of the devices and that the addition of a few select RF performances holds great potential for reducing misprediction to industrially acceptable levels. Based on these results, the authors then discuss enhancements and experiments that will further corroborate the utility of these methods within the cost realities of analog/RF production testing.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Concurrent error detection for combinational and sequential logic via output compaction",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1283716/",
            "Abstract": "We discuss the problem of non-intrusive concurrent error detection (CED) for random logic. We analyze the optimal solution model and we point out the limitations that prevent logic synthesis from yielding a minimal cost implementation. We explain how duplication-based CED exploits decomposition to alleviate these limitations for the unrestricted error model. We then examine a compaction-based CED method, which employs a similar decomposition principle to alleviate synthesis limitations for restricted error models. We demonstrate the cost reduction achieved by the decomposed method through experimental results and we discuss the points where optimality is lost, possible remedies, and extension to finite state machines (FSMs).",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analog performance locking through neural network-based biasing",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8758657/",
            "Abstract": "We introduce a method for protecting analog Integrated Circuits (ICs) against unauthorized use by obfuscating their operating point using an analog neural network. With the model of the trained analog neural network acting as a lock and its inputs as the key, only the correct key combination will unlock the analog IC, by providing it with the required bias conditions to operate within its specification limits. By defining the key combinations in the continuous analog space and by using floating gate transistors to realize the neural network, the proposed method defends itself against efforts to guess the correct key through model approximation attacks. Moreover, by inhibiting retraining of the analog neural network, the proposed solution enables customization of the lock and key combination to each IC. The proposed solution has been implemented in silicon through a proof-of-concept experimental setup comprising a …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:XoXfffV-tXoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An experimentation platform for on-chip integration of analog neural networks: A pathway to trusted and robust analog/RF ICs",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901256/",
            "Abstract": "We discuss the design of an experimentation platform intended for prototyping low-cost analog neural networks for on-chip integration with analog/RF circuits. The objective of such integration is to support various tasks, such as self-test, self-tuning, and trust/aging monitoring, which require classification of analog measurements obtained from on-chip sensors. Particular emphasis is given to cost-efficient implementation reflected in: 1) low energy and area budgets of circuits dedicated to neural networks; 2) robust learning in presence of analog inaccuracies; and 3) long-term retention of learned functionality. Our chip consists of a reconfigurable array of synapses and neurons operating below threshold and featuring sub-μW power consumption. The synapse circuits employ dual-mode weight storage: 1) a dynamic mode, for fast bidirectional weight updates during training and 2) a nonvolatile mode, for permanent …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Data secrecy protection through information flow tracking in proof-carrying hardware ip—part ii: Framework automation",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7933003/",
            "Abstract": "Part II of this paper series focuses on automation of the extended proof-carrying hardware intellectual property (PCHIP) framework for data secrecy protection in third-party IPs, which was presented in part I. Specifically, we introduce: 1) VeriCoq-IFT, an automated PCHIP framework for information flow policies and 2) VeriCoq-H, a hierarchy-preserving Verilog-to-Coq converter. VeriCoq-IFT aims to: 1) automate the process of converting designs from an HDL to the Coq formal language; 2) generate security property theorems ensuring compliance with information flow policies; 3) construct proofs for such theorems; and 4) check their validity in a design, with minimal user intervention. VeriCoq-H, on the other hand, seeks to convert the entire functionality of a Verilog design to its Coq representation while preserving design hierarchy. It facilitates the development of hierarchical proofs and enables the construction of …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:L7CI7m0gUJcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wafer-level process variation-driven probe-test flow selection for test cost reduction in analog/RF ICs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7477263/",
            "Abstract": "We introduce a methodology for dynamically selecting whether to subject a wafer to a complete or a reduced probe-test flow, while ensuring that the concomitant test cost savings do not compromise test quality. The granularity of this decision is at the wafer-level and is made before the wafer reaches the probe station, based on an e-test signature which reflects how process variations have affected this particular wafer. While the proposed method may offer less flexibility than approaches that dynamically adapt the test flow on a per-die basis, its implementation is simpler and more compatible with most commonly used Automatic Test Equipment. Furthermore, unlike static test elimination approaches, whose agility is limited by the relative importance of the dropped tests, the proposed method is capable of exploring test cost reduction solutions which maintain very low test escape rates. Decisions are made by an …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analog checker with dynamically adjustable error threshold for fully differential circuits",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1197653/",
            "Abstract": "We present a novel analog checker that adjusts dynamically the error threshold to the magnitude of its input signals. We demonstrate that this property is crucial for accurate concurrent error detection in analog circuits. Dynamic error threshold adjustment is achieved by regulating the bias point of the output stage inverters of the checker, which provide a digital indication of potential errors in the circuit under test. We discuss the theoretical foundation and we present simulations that validate the underlying principle of the design. As compared to previous solutions, the proposed checker reduces the incurred overhead, while significantly enhancing the quality of concurrent error detection.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:roLk4NBRz8UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Jerzy Dabrowski DK Das Shamik Das Pallab Dasgupta",
            "Publication year": 2014,
            "Publication url": "https://search.proquest.com/openview/125b8ecec72778567d0692325ecf57a7/1?pq-origsite=gscholar&cbl=54186",
            "Abstract": "2013 Reviewers Page 1 2013 Reviewers Published online: 7 February 2014 © Springer \nScience+Business Media New York 2014 Abdellatif Abu-Issa Miguel Angel Aguirre Waleed \nAl-Assadi Yousra Alkabani Himyanshu Anand Lorena Anghel Daniel Arumi Nicholas Axelos \nFlorence Azais Jose Rodrigo Azambuja Luz Balado Lars Bauer Jayanta Bhadra Sanjukta Bhanja \nSwarup Bhunia Shawn Blanton Christophe Bobda Cristiana Bolchini Alberto Bosio Alex Brodsky \nLuigi Carro Amlan Chakrabarti Rajat Chakraborty Santanu Chattopadhyay Jwu-E Chen Min \nChen Mingsong Chen Mingjing Chen Minsu Choi Lukasz Chruszczyk Bruce Cockburn Edmond \nCooley Enrico Costenaro Erika Cota Jerzy Dabrowski DK Das Shamik Das Pallab Dasgupta \nStefano Di Carlo Luigi Dilillo Michael Dimopoulos Jennifer Dworak Stephan Eggersglues \nOsman Ekekon Luis Entrena Yaniv Fais Hongxia Fang Bernhard Fechner Shaun Fey -…",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spatial estimation of wafer measurement parameters using gaussian process models",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6401545/",
            "Abstract": "In the course of semiconductor manufacturing, various e-test measurements (also known as inline or kerf measurements) are collected to monitor the health-of-line and to make wafer scrap decisions preceding final test. These measurements are typically sampled spatially across the surface of the wafer from between-die scribe line sites, and include a variety of measurements that characterize the wafer's position in the process distribution. However, these measurements are often only used for wafer-level characterization by process and test teams, as the sampling can be quite sparse across the surface of the wafer. In this work, we introduce a novel methodology for extrapolating sparsely sampled e-test measurements to every die location on a wafer using Gaussian process models. Moreover, we introduce radial variation modeling to address variation along the wafer center-to-edge radius. The proposed …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On combining alternate test with spatial correlation modeling in analog/RF ICs",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6569358/",
            "Abstract": "Statistical intra-die correlation has been extensively studied as a means for reducing test cost in analog/RF ICs. Generally known as alternate test, this approach seeks to predict the performances of an analog/RF chip based on low-cost measurements on the same chip and statistical models learned from a training set of chips. Recently, an orthogonal direction for leveraging statistical correlation towards reducing test cost of analog/RF ICs has also gained traction. Specifically, inter-die spatial correlation models learned from specification tests on a sparse subset of die on a wafer are used to predict performances on the unobserved die. In this work, we investigate the potential of combining these two statistical approaches, anticipating that the performance prediction accuracy of the joint correlation model will surpass the accuracy of its constituents. Experimental results on industrial semiconductor manufacturing data …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:BrmTIyaxlBUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a fully stand-alone analog/RF BIST: A cost-effective implementation of a neural classifier",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6231081/",
            "Abstract": "A recently proposed Built-In Self-Test (BIST) method for analog/RF circuits requires stimuli generator, measurement acquisition, and decision making circuits to be integrated on-chip along with the Device Under Test (DUT). Practical implementation of this approach hinges on the ability to meet strict area and power constraints of the circuits dedicated to test. In this work, we investigate a cost-efficient implementation of a neural classifier, which is the central component of this BIST method. We present the design of a reconfigurable analog neural network (ANN) experimentation platform and address the key questions concerning its cost-efficiency: a fully analog implementation with strict area and power budgets, a learning ability of the proposed architecture, fast dynamic programming of the weight memory during training, and high precision non-volatile storage of weight coefficients during operation or standby. Using …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:WbkHhVStYXYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proof-Carrying Hardware-Based Information Flow Tracking in Analog/Mixed-Signal Designs",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9410589/",
            "Abstract": "Information flow tracking (IFT) is a widely used methodology for ensuring data confidentiality and/or integrity in electronic systems and many such methods have been developed at various software or hardware description levels. Among them, Proof-Carrying Hardware Intellectual Property (PCHIP) introduced an IFT methodology for digital hardware designs described in hardware description languages (HDLs). However, it is not only the digital domain that suffers from the risk of inadvertent information leakage. Indeed, analog signals originating from sources of sensitive information such as biometric sensors, as well as analog circuit outputs could also carry confidential information. Moreover, analog circuits are equally susceptible as their digital counterparts to malicious modifications, known as hardware Trojans, which could introduce covert channels for leaking such confidential information. Furthermore, in analog …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:9c2xU6iGI7YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware-based workload forensics and malware detection in microprocessors",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7880822/",
            "Abstract": "We investigate the possibility of performing workload forensics and/or malware detection in microprocessors through exclusively hardware-based methodologies. Specifically, we first introduce a general architecture which a hardware-based forensics or malware detection method would need to follow, as well as the various processor-level information which could potentially be harnessed to ensure system security and/or integrity. In contrast to traditional forensics and/or malware detection methods implemented at the operating system (OS) and/or the hypervisor level, whose data logging and monitoring systems are vulnerable to spoofing attacks at the same level, moving implementation to hardware ensures immunity to such attacks. This work focuses on two recent incarnations of this general concept, illustrating the effectiveness of hardware-based forensics and/or malware detection. Several other recent methods …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Revisiting Capacitor-Based Trojan Design",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8988771/",
            "Abstract": "Among the various strategies for hiding malicious capabilities in integrated circuits (ICs), analog circuit design techniques have recently drawn increased attention due their lower area, power and delay footprints, which make their detection significantly more challenging. Specifically, switched capacitors have been used for creating stealthy trigger circuits based on toggling activity on a victim wire. Various methodologies for detecting such culprits have been investigated; however, recent literature in this area contains several misconceptions or inaccuracies regarding the topologies of these trigger circuits and the effectiveness of previously proposed detection methods. Therefore, in this paper, we first revisit the design of switched capacitor-based trigger circuits and we present several design configurations which are not encompassed by previously demonstrated models, but which can also serve the same …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Concurrent error detection in asynchronous burst-mode controllers",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1395768/",
            "Abstract": "We discuss the problem of concurrent error detection (CED) in a popular class of asynchronous controllers, namely burst-mode machines. We first outline the particularities of these clock-less circuits, including the use of redundancy to ensure hazard-free operation, and we explain how they limit the applicability and effectiveness of traditional CED methods, such as duplication. We then demonstrate how duplication can be enhanced to resolve these limitations through additional hardware for comparison synchronization and detection of error-induced hazards, which jeopardize the interaction of the circuit with its environment. Finally, we propose a transition-triggered CED method which employs a transition prediction junction to eliminate the need for hazard detection circuitry and hazard-free implementation of the duplicate. As indicated by experimental results, the proposed method reduces significantly the cost of …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Error moderation in low-cost machine-learning-based analog/RF testing",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4358314/",
            "Abstract": "Machine-learning-based test methods for analog/RF devices have been the subject of intense investigation over the last decade. However, despite the significant cost benefits that these methods promise, they have seen a limited success in replacing the traditional specification testing, mainly due to the incurred test error which, albeit small, cannot meet industrial standards. To address this problem, we introduce a neural system that is trained not only to predict the pass/fail labels of devices based on a set of low-cost measurements, as aimed by the previous machine-learning-based test methods, but also to assess the confidence in this prediction. Devices for which this confidence is insufficient are then retested through the more expensive specification testing in order to reach an accurate test decision. Thus, this two-tier test approach sustains the high accuracy of specification testing while leveraging the low cost of …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bridging the accuracy of functional and machine-learning-based mixed-signal testing",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1617625/",
            "Abstract": "Numerous machine-learning-based test methodologies have been proposed in recent years as a fast alternative to the standard functional testing of mixed-signal/RF integrated circuits. While the test error probability of these methods is rather low, it is still considered prohibitive for accurate production testing. In this paper, we demonstrate how to minimize this test error probability and, thus, how to bridge the accuracy of functional and machine-learning-based test methods. The underlying idea is to measure the confidence of the machine-learning-based test decision and retest the small fraction of circuits for which this confidence is low via standard functional test. Through this approach, the majority of circuits are tested using fast machine-learning-based tests, which, nevertheless, are equivalent to the standard functional ones with regards to test error probability. By varying the acceptable confidence level, the …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:QIV2ME_5wuYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Machine learning-based BIST in analog/RFICs",
            "Publication year": 2018,
            "Publication url": "https://scholar.google.com/scholar?cluster=10961029875114513533&hl=en&oi=scholarr",
            "Abstract": "The seemingly ever-increasing data rates and complexity of modern analog and RF integrated circuits (ICs) intensify the test effort that must be spent",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hardware-Based Detection of Spectre Attacks: A Machine Learning Approach",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9358255/",
            "Abstract": "The Spectre vulnerability, which has been found in a variety of processors, enables attackers to take advantage of speculative execution in modern computer architectures to access unauthorized memory content through temporal side channels. Herein, we propose a hardware-based defense mechanism that can detect Spectre attacks by utilizing the profile of a small fraction of malicious program execution. More specifically, we focus on malicious attempts to read data from theoretically inaccessible memory space. The corresponding instruction sequence is divided into consecutive windows, from which a performance counter-based tracker extracts descriptive features. These features are, then, processed by a trained machine learning model to analyze program behaviors and identify suspicious ones. Our experiment shows that Spectre attacks on thirteen vulnerable purpose-built victim code patterns can be …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:IUKN3-7HHlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enrichment of limited training sets in machine-learning-based analog/RF test",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5090931/",
            "Abstract": "This paper discusses the generation of information-rich, arbitrarily-large synthetic data sets which can be used to (a) efficiently learn tests that correlate a set of low-cost measurements to a set of device performances and (b) grade such tests with parts per million (PPM) accuracy. This is achieved by sampling a non-parametric estimate of the joint probability density function of measurements and performances. Our case study is an ultra-high frequency receiver front-end and the focus of the paper is to learn the mapping between a low-cost test measurement pattern and a single pass/fail test decision which reflects compliance to all performances. The small fraction of devices for which such a test decision is prone to error are identified and retested through standard specification-based test. The mapping can be set to explore thoroughly the tradeoff between test escapes, yield loss, and percentage of retested devices.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wafer-Level Adaptive Vₘᵢₙ Calibration Seed Forecasting",
            "Publication year": 2019,
            "Publication url": "https://utd-ir.tdl.org/handle/10735.1/7778",
            "Abstract": "To combat the effects of process variation in modern, high-performance integrated Circuits (ICs), various post-manufacturing calibrations are typically performed. These calibrations aim to bring each device within its specification limits and ensure that it abides by current technology standards. Moreover, with the increasing popularity of mobile devices that usually depend on finite energy sources, power consumption has been introduced as an additional constraint. As a result, post-silicon calibration is often performed to identify the optimal operating voltage (Vₘᵢₙ) of a given Integrated Circuit. This calibration is time-consuming, as it requires the device to be tested in a wide range of voltage inputs across a large number of tests. In this work, we propose a machine learning-based methodology for reducing the cost of performing the Vₘᵢₙ calibration search, by identifying the optimal wafer-level search parameters. The effectiveness of the proposed methodology is demonstrated on an industrial dataset. © 2019 EDAA.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:mNrWkgRL2YcC",
            "Publisher": "Institute of Electrical and Electronics Engineers Inc."
        },
        {
            "Title": "Fast hierarchical test path construction for circuits with DFT-free controller-datapath interface",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1013723905896",
            "Abstract": "Hierarchical approaches address the complexity of test generation through symbolic reachability paths that provide access to the I/Os of each module in a design. However, while transparency behavior suitable for symbolic design traversal can be utilized for constructing reachability paths for datapath modules, control modules do not exhibit transparency. Therefore, incorporating such modules in reachability path construction requires exhaustive search algorithms or expensive DFT hardware. In this paper, we discuss a fast hierarchical test path construction method for circuits with DFT-free controller-datapath interface. A transparency-based RT-Level hierarchical test generation scheme is devised for the datapath, wherein locally generated vectors are translated into global design test. Additionally, the controller is examined through the introduced concept of influence tables, which are used to generate …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:dhFuZR0502QC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "PSCML: Pseudo-Static Current Mode Logic",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6122209/",
            "Abstract": "We introduce a new logic style called Pseudo-Static Current Mode Logic (PSCML), which aims to alleviate the power consumption and delay overhead concerns that have thwarted the wide-spread acceptance of a previously proposed Dynamic Current Mode Logic (DyCML) style. Different from DyCML, the proposed new logic style may be viewed by its environment as static, hence any PSCML-based gate/module can be readily embedded into static CMOS designs to construct CMOS/PSCML hybrid circuits. Simulation results show that, at the cost of some area increase, PSCML is faster and consumes less power than DyCML for most applications.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Post-production performance calibration in analog/RF devices",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5699225/",
            "Abstract": "In semiconductor device fabrication, continual demand for high performance, high yield devices has caused designers to look to post-production tunable circuits as the next logical step in analog/RF design and test development. These approaches have not yet achieved the maturity necessary for industrial adoption, primarily due to complexity and cost. In this work, we develop a general model which systematically outlines several key observations constraining the complexity of performance calibration in analog/RF devices. Moreover, we develop a detailed cost model permitting direct comparison of performance calibration methods to industry standard specification testing. Our analysis is demonstrated on a tunable RF LNA device simulated in 0.18μm RFCMOS.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:_xSYboBqXhAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest editorial special section on hardware security and trust",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7110714/",
            "Abstract": "Creating backdoors in integrated circuits (ICs), stealing hardware intellectual property, counterfeiting electronic components, reverse engineering ICs, and injecting malware in ICs are no longer nation state acts requiring specialized, expensive, and unlimited resources. Democratization of IC design has created numerous opportunities for rogues throughout the IC supply chain to inflict these attacks with aplomb and for a variety of reasons: personal gain, economic harm, economic gain, bringing disrepute, and sheer fun among others.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:hkOj_22Ku90C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Concurrent error detection methods for asynchronous burst-mode machines",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4167789/",
            "Abstract": "Asynchronous controllers exhibit various characteristics that limit the effectiveness and applicability of the concurrent error detection (CED) methods developed for their synchronous counterparts. Asynchronous burst-mode machines (ABMMs), for example, do not have a global clock to synchronize the ABMM with the additional circuitry that is typically used by synchronous CED methods (for example, duplication). Therefore, performing effective CED in ABMMs requires a synchronization method that will appropriately enable the checker (for example, comparator) in order to avoid false alarms. Also, ABMMs contain redundant logic, which guarantees the hazard-free operation required for correct interaction between the circuit and its environment. Redundant logic, however,' allows some single event transients to manifest themselves only as hazards but not as logic discrepancies. Therefore, performing effective CED …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analog checker with input-relative tolerance for duplicate signals",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:JETT.0000042512.77744.d5",
            "Abstract": "We discuss the design of a novel analog checker that monitors two duplicate signals and provides a digital error indication when their absolute difference is unacceptably large. The key feature of the proposed checker is that it establishes a test criterion that is dynamically adapted to the magnitude of its input signals, thus enhancing the accuracy of assessing their relative discrepancy. Consequently, when this checker is utilized in concurrent error detection, it diminishes the probability of both false negatives and false positives. Likewise, when employed for off-line test purposes, the checker supports both high yield and high fault coverage. In contrast, checkers implementing a static test criterion may only be tuned to achieve efficiently one of the aforementioned objectives.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Revisiting vulnerability analysis in modern microprocessors",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6967809/",
            "Abstract": "The notion of Architectural Vulnerability Factor (AVF) has been extensively used to evaluate various aspects of design robustness. While AVF has been a very popular way of assessing element resiliency, its calculation requires rigorous and extremely time-consuming experiments. Furthermore, recent radiation studies in 90 nm and 65 nm technology nodes demonstrate that up to 55 percent of Single Event Upsets (SEUs) result in Multiple Bit Upsets (MBUs), and thus the Single Bit Flip (SBF) model employed in computing AVF needs to be reassessed. In this paper, we present a method for calculating the vulnerability of modern microprocessors -using Statistical Fault Injection (SFI)- several orders of magnitude faster than traditional SFI techniques, while also using more realistic fault models which reflect the existence of MBUs. Our method partitions the design into various hierarchical levels and systematically …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:LjlpjdlvIbIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "INFECT: INconspicuous FEC-based Trojan: A hardware attack on an 802.11 a/g wireless network",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7951804/",
            "Abstract": "We discuss the threat that hardware Trojans (HTs) impose on wireless networks, along with possible remedies for mitigating the risk. We first present an HT attack on an 802.11a/g transmitter (TX), which exploits Forward Error Correction (FEC) encoding. While FEC seeks to protect the transmitted signal against channel noise, it often offers more protection than needed by the actual channel. This margin is precisely where our HT finds room to stage an attack. We, then, introduce a Trojan-agnostic method which can be applied at the receiver (RX) to detect such attacks. This method monitors the noise distribution, to identify systematic inconsistencies which may be caused by an HT. Lastly, we describe a Wireless open-Access Research Platform (WARP) based experimental setup to investigate the feasibility and effectiveness of the proposed attack and defense. More specifically, we evaluate (i) the ability of a rogue …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:ILKRHgRFtOwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware trojans in wireless cryptographic integrated circuits",
            "Publication year": 2016,
            "Publication url": "https://www.computer.org/csdl/magazine/dt/5555/01/05342391/13rRUxNmPMQ",
            "Abstract": "We study the problem of hardware Trojans in wireless cryptographic integrated circuits, wherein the objective is to leak secret information (ie the encryption key) through the wireless channel. Using a mixed-signal system-on-chip, consisting of a DES encryption core and a UWB transmitter, we demonstrate the following three key findings of this study: i) Simple malicious modifications to the digital part of a wireless cryptographic chip suffice to leak information without changing the more sensitive analog part. We demonstrate two hardware Trojan examples, which leak the encryption key by manipulating the transmission amplitude or frequency. ii) Such hardware Trojans do not change the functionality of the digital part or the performances of the analog part and their impact on the wireless transmission parameters can be hidden within the fabrication process variations. Hence, neither traditional manufacturing testing …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:IRz6iEL74y4C",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "AVF-driven parity optimization for MBU protection of in-core memory arrays",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6513747/",
            "Abstract": "We propose an AVF-driven parity selection method for protecting modern microprocessor in-core memory arrays against MBUs. As MBUs constitute more than 50% of the upsets in latest technologies, error correcting codes or physical interleaving are typically employed to effectively protect out-of-core memory structures, such as caches. However, such methods are not applicable to high-performance in-core arrays, due to computational complexity, high delay and area overhead. To this end, we revisit parity as an effective mechanism to detect errors and we resort to pipeline flushing and checkpointing for correction. We demonstrate that optimal parity tree construction for MBU detection is a computationally complex problem, which we then formulate as an integer-linear-program (ILP). Experimental results on Alpha 21264 and Intel P6 in-core memory arrays demonstrate that optimal parity tree selection can achieve …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware Trojans in wireless cryptographic ICs: Silicon demonstration & detection method evaluation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6691149/",
            "Abstract": "We present a silicon implementation of a hardware Trojan, which is capable of leaking the secret key of a wireless cryptographic integrated circuit (IC) consisting of an Advanced Encryption Standard (AES) core and an Ultra-Wide-Band (UWB) transmitter. With its impact carefully hidden in the transmission specification margins allowed for process variations, this hardware Trojan cannot be detected by production testing methods of either the digital or the analog part of the IC and does not violate the transmission protocol or any system-level specifications. Nevertheless, the informed adversary, who knows what to look for in the transmission power waveform, is capable of retrieving the 128-bit AES key, which is leaked with every 128-bit ciphertext block sent by the UWB transmitter. Using silicon measurements from 40 chips fabricated in TSMC's 0.35μm technology, we also assess the effectiveness of a side channel …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Machine learning-based hotspot detection: Fallacies, pitfalls and marching orders",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8942128/",
            "Abstract": "Extensive technology scaling has not only increased the complexity of Integrated Circuit (IC) fabrication but also multiplied the challenges in the Design For Manufacturability (DFM) space. Among these challenges, detection of design weak-points, popularly known as `Lithographic Hotspots', has attracted substantial attention. Hotspots are certain patterns which exhibit a higher probability of causing defects due to complex design-process interactions. Identifying such patterns and fixing them in the design stage itself is imperative towards ensuring high yield. In the early days of hotspot detection, Pattern Matching (PM) based methods were proposed. While effective in identifying previously known patterns, these methods failed to identify Never-Seen-Before (NSB) hotspots. To address this drawback, Machine Learning (ML) based solutions were introduced. Over the last decade, we have witnessed a plethora of ML …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:86PQX7AUzd4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Checkers for Online Self-Testing of Analog Circuits",
            "Publication year": 2012,
            "Publication url": "https://hal.ird.fr/INPG/hal-00750164",
            "Abstract": "This chapter contains sections titled:Introduction,Time-Invariant Linear Circuits, Fully Differential Circuits, Conclusions,References",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:u9iWguZQMMsC",
            "Publisher": "Wiley, Chichester, UK"
        },
        {
            "Title": "Harnessing fabrication process signature for predicting yield across designs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7527386/",
            "Abstract": "Yield estimation is an indispensable piece of information at the onset of high-volume manufacturing (HVM) of a device. The increasing demand for faster time-to-market and for designs with growing quality requirements and complexity, requires a quick and successful yield estimation prior to HVM. Prior to commencing HVM, a few early silicon wafers are typically produced and subjected to thorough characterization. One of the objectives of such characterization is yield estimation with better accuracy than what pre-silicon Monte Carlo simulation may offer. In this work, we propose predicting yield of a device using information from a similar previous-generation device, which is manufactured in the same technology node and in the same fabrication facility. For this purpose, we rely on the Bayesian Model Fusion (BMF) technique. The effectiveness of the proposed methodology is evaluated using sizable industrial data …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:z_wVstp3MssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low cost convolutional code based concurrent error detection in FSMs",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1250130/",
            "Abstract": "We discuss the use of convolutional codes to perform concurrent error detection (CED) in finite state machines (FSMs). We examine a previously proposed methodology, we identify its limitations, and we outline two improvements that reduce its cost and enhance its effectiveness. More specifically, we demonstrate how the existing FSM hardware can be reused for computing the convolutional code keys and we formulate the optimization problem of maximizing hardware reusability. Additionally we extend the proposed methodology to detect errors that only affect the output logic but not the next state of the FSM, and which are not detected by the previously proposed methodology.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:4TOpqqG69KYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spatial correlation modeling for probe test cost reduction in RF devices",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6386584/",
            "Abstract": "Test cost reduction for RF devices has been an ongoing topic of interest to the semiconductor manufacturing industry. Automated test equipment designed to collect parametric measurements, particularly at high frequencies, can be very costly. Together with lengthy set up and test times for certain measurements, these cause amortized test cost to comprise a high percentage of the total cost of manufacturing semiconductor devices. In this work, we investigate a spatial correlation modeling approach using Gaussian process models to enable extrapolation of performances via sparse sampling of probe test data. The proposed method performs an order of magnitude better than existing spatial sampling methods, while requiring an order of magnitude less time to construct the prediction models. The proposed methodology is validated on manufacturing data using 57 probe test measurements across more than 3,000 …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Soft error mitigation through selective addition of functionally redundant wires",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4454143/",
            "Abstract": "We introduce a logic-level soft error mitigation methodology for combinational circuits. The proposed method exploits the existence of logic implications in a design, and is based on selective addition of pertinent functionally redundant wires to the circuit. We demonstrate that the addition of functionally redundant wires reduces the probability that a single-event transient (SET) error will reach a primary output, and, by extension, the soft error rate (SER) of the circuit. We discuss three methods for identifying candidate functionally redundant wires, and we outline the necessary conditions for adding them to the circuit. We then present an algorithm that assesses the SET sensitization probability reduction achieved by candidate functionally redundant wires, and selects an appropriate subset that, when added to the design, minimizes its SER. Experimental results on ISCAS'89 benchmark circuits demonstrate that the …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TPE: a Hardware-based TLB Profiling Expert for Workload Reconstruction",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9422779/",
            "Abstract": "We propose TPE, a hardware-based framework to perform workload execution forensics in microprocessors. Specifically, TPE leverages custom hardware instrumentation to capture the operational profile of the Translation Lookaside Buffer (TLB), as well as process these information offline through multiple machine learning and/or deep learning approaches, in order to identify the executed processes and reconstruct the workload. Unlike software-based forensics methods implemented at the operating system (OS) or hypervisor level, whose data logging and monitoring mechanisms may be compromised through software attacks, TPE is implemented directly in hardware and, therefore, provides innate immunity to software tampering. A prototype of TPE is demonstrated in Linux on two representative architectures, i.e., 32-bit x86 and 64-bit RISC-V, implemented in the Simics and Spike simulation environment …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:dBIO0h50nwkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPIN-PAC: Test compaction for speed-independent circuits",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1120725.1120746",
            "Abstract": "SPIN-PAC is a static test compaction method for Speed-Independent circuits. We demonstrate how the test sets can be compacted by combining multiple consecutive test vectors within a test sequence into a vector pair of higher Hamming distance, and by eliminating or pruning independent test sequences. We discuss the exponential nature of optimally solving this problem, we propose an efficient algorithm to approximate it, and we evaluate its performance through experiments.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Automated die inking through on-line machine learning",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8854373/",
            "Abstract": "Ensuring high reliability in modern integrated circuits (ICs) requires the employment of several die screening methodologies. One such technique, commonly referred to as die inking, aims to discard devices that are likely to fail, based on their proximity to known failed devices on the wafer. Die inking is traditionally performed manually by visually inspecting each manufactured wafer and thus it is very time-consuming. Recently, machine learning has been used to automate and speed-up the inking process. In this work, we employ on-line machine learning to address the practicability limitations of the current state-of the-art automated inking approach. Effectiveness is demonstrated on an industrial dataset of manually inked wafers.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:ClCfbGk0d_YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A transistor-level test strategy for C/sup 2/MOS MOUSETRAP asynchronous pipelines",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1595688/",
            "Abstract": "We discuss a transistor-level test methodology for C 2 MOS asynchronous pipelines. Unlike their static CMOS counterparts, wherein testing for stuck-at faults and compliance to a few timing constraints typically suffices, dynamic asynchronous pipelines present new challenges which require more elaborate test solutions. More specifically, many gate-level input/output stuck-at faults of a static pipeline style translate into transistor-level stuck-open/stuck-short faults in the dynamic C 2 MOS version. Therefore, test methods for transistor-level faults are required for dynamic asynchronous pipelines. To this end, we propose a methodology for testing both gate-level stuck-at faults and transistor-level stuck-open/stuck-short faults in C 2 MOS pipelines. The proposed method does not employ additional hardware and is capable of detecting both gate-level and transistor-level faults, as we demonstrate on the C 2 MOS version …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:pqnbT2bcN3wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Towards a cross-layer framework for accurate power modeling of microprocessor designs",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8464153/",
            "Abstract": "While state-of-the-art system-level simulators can deliver swift estimation of power dissipation for microprocessor designs, they do so at the expense of reduced accuracy. On the other hand, RTL simulators are typically cycle-accurate but overwhelmingly time consuming for real-life workloads. Consequently, the design community often has to make a compromise between accuracy and speed. In this work, we propose a novel cross-layer approach that can enable accurate power estimation by carefully integrating components from system-level and RTL simulation of the target design. We first leverage the concept of simulation points to transform the workload application and isolate its most critical segments. We then profile the highest weighted simulation point (HWSP) with a RTL simulator (AnyCore) for maximum accuracy, while the rest are simulated with a system-level simulator (gem5) for ensuring fast evaluation …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bias Busters: Robustifying DL-based Lithographic Hotspot Detectors Against Backdooring Attacks",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9239298/",
            "Abstract": "Deep learning (DL) offers potential improvements throughout the CAD tool-flow, one promising application being lithographic hotspot detection. However, DL techniques have been shown to be especially vulnerable to inference and training time adversarial attacks. Recent work has demonstrated that a small fraction of malicious physical designers can stealthily “backdoor\" a DL-based hotspot detector during its training phase such that it accurately classifies regular layout clips but predicts hotspots containing a specially crafted trigger shape as non-hotspots. We propose a novel training data augmentation strategy as a powerful defense against such backdooring attacks. The defense works by eliminating the intentional biases introduced in the training data but does not require knowledge of which training samples are poisoned or the nature of the backdoor trigger. Our results show that the defense can drastically …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:NXb4pA-qfm4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware-assisted rootkit detection via on-line statistical fingerprinting of process execution",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8342267/",
            "Abstract": "Kernel rootkits generally attempt to maliciously tamper kernel objects and surreptitiously distort program execution flow. Herein, we introduce a hardware-assisted hierarchical on-line system which detects such kernel rootkits by identifying deviation of dynamic intra-process execution profiles based on architecture-level semantics captured directly in hardware. The underlying key insight is that, in order to take effect, malicious manipulation of kernel objects must distort the execution flow of benign processes, thereby leaving abnormal traces in architecture-level semantics. While traditional detection methods rely on software modules to collect such traces, their implementations are susceptible to being compromised through software attacks. In contrast, our detection system maintains immunity to software attacks by resorting to hardware for trace collection. The proposed method is demonstrated on a Linux-based …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:lmc2jWPfTJgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On boosting the accuracy of non-RF to RF correlation-based specification test compaction",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-009-5113-7",
            "Abstract": "Several existing methodologies have leveraged the correlation between the non-RF and the RF performances of a circuit in order to predict the latter from the former and, thus, reduce test cost. While this form of specification test compaction eliminates the need for expensive RF measurements, it also comes at the cost of reduced test accuracy, since the retained non-RF measurements and pertinent correlation models do not always suffice for adequately predicting the omitted RF measurements. To alleviate this problem, we explore several methodologies that estimate the confidence in the obtained test outcome. Subsequently, devices for which this confidence is insufficient are retested through the complete specification test suite. As we demonstrate on production test data from a zero-IF down-converter fabricated at IBM, the proposed methodologies overcome the inability of standard specification test …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Test requirement analysis for low cost hierarchical test path construction",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1181700/",
            "Abstract": "We propose a methodology that examines design modules and identifies appropriate vector justification and response propagation requirements for reducing the cost of hierarchical test path construction. Test requirements are defined as a set of fine-grained input and output bit clusters and pertinent symbolic values. They are independent of actual test sets and are adjusted to the inherent module connectivity and regularity. As a result, they combine the generality required for fast hierarchical test path construction with the precision necessary for minimizing the incurred cost, thus fostering cost-effective hierarchical test.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:L8Ckcad2t8MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "PPM-accuracy error estimates for low-cost analog test: A case study",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6132735/",
            "Abstract": "Over the past decade, interest has increased in leveraging low-cost \"alternate\" test methods as a drop-in replacement for testing analog and RF devices. The current practice for testing such devices, known as specification test, can be very expensive by comparison. By substituting less-costly alternate tests for specification test, substantial test cost reduction can be achieved. Despite this promised cost reduction, the testing community has been reluctant to adopt such alternate test methods in industrial settings, as the error incurred by alternate test can be quite difficult to capture. Estimating the expected test error metrics early in the fabrication process is, therefore, extremely desirable. In this work, we present a case study in which we investigate the reliability of kernel density estimation as a means of providing such early estimates of alternate test error. We also introduce the novel application of Laplacian score …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Yield prognosis for Fab-to-Fab product migration",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7116261/",
            "Abstract": "We investigate the utility of correlations between e-test and probe test measurements in predicting yield. Specifically, we first examine whether statistical methods can accurately predict parametric probe test yield as a function of e-test measurements within the same fab. Then, we investigate whether the e-test profile of a destination fab, in conjunction with the e-test and probe test profiles of a source fab, suffice for accurate yield prognosis during fab-to-fab product migration. Results using an industrial dataset of ~3.5M devices from a 65nm Texas Instruments RF transceiver design fabricated in two different fabs reveal that (i) within-fab yield prediction error is in the range of a few tenths of a percentile point, and (ii) fab-to-fab yield prediction error is in the range of half a percentile point.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:UHK10RUVsp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analog neural network design for RF built-in self-test",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5699272/",
            "Abstract": "A stand-alone built-in self-test architecture mainly consists of three components: a stimulus generator, measurement acquisition sensors, and a measurement processing mechanism to draw out a straightforward Go/No-Go test decision. In this paper, we discuss the design of a neural network circuit to perform the measurement processing step. In essence, the neural network implements a non-linear classifier which can be trained to map directly sensor-based measurements to the Go/No-Go test decision. The neural network is fabricated as a single chip and is put to the test to recognize faulty from functional RF LNA instances. Its decision is based on the readings of two amplitude detectors that are connected to the input and output ports of the RF LNA. We discuss the learning strategy and the generation of information-rich training sets. It is shown that the hardware neural network has comparable learning …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Compiler-based frame formation for static optimization",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1347963/",
            "Abstract": "We selectively generate and optimize the frames constructed by the rePLay architecture statically. Since static analysis provides a global view of the interaction between the basic blocks and a bigger aggressive optimization space, we propose a method to construct the frames using profiling and static analysis. Frame selection and optimization are analyzed in the criteria to produce well-optimized, frequently executed frames with minimum recovery penalty. In addition, hardware support is reduced to only perform mis-speculation recovery. Empirical results show the frame-optimized code outperforming baseline code on the SPEC integer benchmarks.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multiple-bit upset protection in microprocessor memory arrays using vulnerability-based parity optimization and interleaving",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6953332/",
            "Abstract": "We propose a technology-independent vulnerability-driven parity selection method for protecting modern microprocessor in-core memory arrays against multiple-bit upsets (MBUs). As MBUs constitute over 50% of the upsets in recent technologies, error correcting codes or physical interleaving are typically employed to effectively protect out-of-core memory structures, such as caches. Such methods, however, are not applicable to high performance in-core arrays, due to computational complexity, high delay, and area overhead. Therefore, we investigate vulnerability-based parity forest formation as an effective mechanism for detecting errors. Checkpointing and pipeline flushing can subsequently be used for correction. As the optimal parity tree construction for MBU detection is a computationally complex problem, an integer linear program formulation is introduced. In addition, vulnerability-based interleaving (VBI) is …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ACE: Adaptive channel estimation for detecting analog/RF trojans in WLAN transceivers",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8203848/",
            "Abstract": "We propose a defense method capable of detecting hardware Trojans (HTs) in the analog/RF circuitry of wireless local area network (WLAN) transceivers. The proposed method, which is implemented on the receiver (RX) side and cannot be tampered with by the attacker, leverages the channel estimation capabilities present in Orthogonal Frequency Division Multiplexing (OFDM) systems. Specifically, it employs an adaptive approach to robustly isolate possible HT activity from channel and device noise, thereby exposing the Trojan's presence. The adaptive channel estimation (ACE) defense mechanism is put to the test using a HT which is implemented on a printed circuit board (PCB) and mounted on the Wireless Open-Access Research Platform (WARP). This HT, which is introduced through minute modifications in the power amplifier (PA), manipulates the transmission power characteristics of an 802.11a/g …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the identification of modular test requirements for low cost hierarchical test path construction",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926006000241",
            "Abstract": "We discuss a novel method for identifying test requirements of modules in a hierarchical design in order to facilitate the construction of cost-effective hierarchical test paths. Unlike current practices, which construct very general paths capable of justifying all vectors and propagating all responses to and from each module in the design, test requirements in our method are defined as a set of fine-grained input and output bit clusters and pertinent symbolic values. These test requirements reflect the inherent connectivity and regularity of each module and, when supported by corresponding hierarchical test paths, they guarantee complete testability of the module. Their key advantage is that they are not fully specified test vectors and, therefore, they do not require a computationally expensive search algorithm to satisfy from the primary inputs and outputs of the circuit. At the same time, they are also not arbitrarily general …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Hardware-based workload forensics: Process reconstruction via TLB monitoring",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7495577/",
            "Abstract": "We introduce a hardware-based methodology for performing workload execution forensics in microprocessors. More specifically, we discuss the on-chip instrumentation required for capturing the operational profile of the Translation Lookaside Buffer (TLB), as well as an off-line machine learning approach which uses this information to identify the executed processes and reconstruct the workload. Unlike workload forensics methods implemented at the operating system (OS) and/or hypervisor level, whose data logging and monitoring mechanisms may be compromised through software attacks, this approach is implemented directly in hardware and is, therefore, immune to such attacks. The proposed method is demonstrated on an experimentation platform which consists of a 32-bit x86 architecture running Linux operating system, implemented in the Simics simulation environment. Experimental results using the …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:VLnqNzywnoUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Cycle-accurate information assurance by proof-carrying based signal sensitivity tracing",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6581573/",
            "Abstract": "We propose a new information assurance model which can dynamically track the information flow in circuit designs and hence protect sensitive data from malicious leakage. Relying on the Coq proof assistant platform, the new model maps register transfer level (RTL) codes written in hardware description languages (HDLs) into structural Coq representatives by assigning all input, output, and internal signal sensitivity levels. The signal sensitivity levels can be dynamically adjusted after each clock cycle based on proposed signal sensitivity transition rules. The development of data secrecy properties and theorem generation functions makes the translation process from security properties to Coq theorems independent of target circuits and, for the first time, makes it possible to construct a property library, facilitating (semi) automation of the proof. The proposed cycle accurate information assurance scheme is …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:V3AGJWp-ZtQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proof-carrying hardware intellectual property: A pathway to trusted module acquisition",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5930362/",
            "Abstract": "We present a novel framework for facilitating the acquisition of provably trustworthy hardware intellectual property (IP). The proposed framework draws upon research in the field of proof-carrying code (PCC) to allow for formal yet computationally straightforward validation of security-related properties by the IP consumer. These security-related properties, agreed upon a priori by the IP vendor and consumer and codified in a temporal logic, outline the boundaries of trusted operation, without necessarily specifying the exact IP functionality. A formal proof of these properties is then crafted by the vendor and presented to the consumer alongside the hardware IP. The consumer, in turn, can easily and automatically check the correctness of the proof and, thereby, validate compliance of the hardware IP with the agreed-upon properties. We implement the proposed framework using a synthesizable subset of Verilog and a …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the impact of performance faults in modern microprocessors",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/article/10.1007/s10836-013-5360-5",
            "Abstract": "Modern microprocessors incorporate a variety of architectural features, such as branch prediction and speculative execution, which are not critical to the correctness of their operation yet are essential towards improving performance. Accordingly, while faults in the corresponding hardware may not necessarily affect functional correctness, they may, nevertheless, adversely impact performance. In this paper, we investigate quantitatively the performance impact of such faults using a superscalar, dynamically-scheduled, out-of-order, Alpha-like microprocessor, on which we execute SPEC2000 integer benchmarks. We provide extensive fault simulation-based experimental results that elucidate the various aspects of performance faults and we discuss how this information may guide the inclusion of additional hardware for performance loss recovery and yield enhancement.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Design obfuscation through selective post-fabrication transistor-level programming",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8714856/",
            "Abstract": "Widespread adoption of the fabless business model and utilization of third-party foundries have increased the exposure of sensitive designs to security threats such as intellectual property (IP) theft and integrated circuit (IC) counterfeiting. As a result, concerted interest in various design obfuscation schemes for deterring reverse engineering and/or unauthorized reproduction and usage of ICs has surfaced. To this end, in this paper we present a novel mechanism for structurally obfuscating sensitive parts of a design through post-fabrication TRAnsistor-level Programming (TRAP). We introduce a transistor-level programmable fabric and we discuss its unique advantages towards design obfuscation, as well as a customized CAD framework for seamlessly integrating this fabric in an ASIC design flow. We theoretically analyze the complexity of attacking TRAP-obfuscated designs through both brute-force and intelligent …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:foquWX3nUaYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exposing vulnerabilities of untrusted computing platforms",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6378629/",
            "Abstract": "This work seeks to expose the vulnerability of un-trusted computing platforms used in critical systems to hardware Trojans and combined hardware/software attacks. As part of our entry in the Cyber Security Awareness Week (CSAW) Embedded System Challenge hosted by NYU-Poly in 2011, we developed and presented 10 such processor-level hardware Trojans. These are split in five categories with various impacts, such as altering instruction memory, modifying the communication channel, stealing user information, changing interrupt handler location and RC-5 encryption algorithm checking of a medium complexity micro-processor (8051). Our work serves as a good starting point for researchers to develop Trojan detection and prevention methodologies on modern processor and to ensure trustworthiness of computing platforms.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "− 197dBc/Hz FOM 4.3-GHz VCO Using an addressable array of minimum-sized nmos cross-coupled transistor pairs in 65-nm CMOS",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7573540/",
            "Abstract": "A 4.3-GHz voltage controlled oscillator (VCO) using an addressable array of cross-coupled minimum size NMOS transistor pairs for post fabrication selection is demonstrated in 65-nm CMOS. An algorithm based on Hamming distance using the phase noise measurements of ~1,500 array combinations was used to identify combinations that have record phase noise of -130dBc/Hz at 1-MHz offset from a 4.3-GHz carrier, while consuming 5.2 mW from a 1-V supply. The operating frequency of circuits using post fabrication selection in its high frequency path is increased to 5 GHz.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:9Nmd_mFXekcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the correlation between controller faults and instruction-level errors in modern microprocessors",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4700613/",
            "Abstract": "We investigate the correlation between register transfer-level faults in the control logic of a modern microprocessor and their instruction-level impact on the execution flow of typical programs. Such information can prove immensely useful in accurately assessing and prioritizing faults with regards to their criticality, as well as commensurately allocating resources to enhance testability, diagnosability, manufacturability and reliability. To this end, we developed an extensive infrastructure which allows injection of stuck-at faults and transient errors of arbitrary starting point and duration, as well as cost-effective simulation and classification of their repercussions into various instruction-level error types. As a test vehicle for our study, we employ a superscalar, dynamically-scheduled, out-of-order, Alpha-like microprocessor, on which we execute SPEC2000 integer benchmarks. Extensive experimentation with faults injected …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "CAPE: A cross-layer framework for accurate microprocessor power estimation",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167926018305376",
            "Abstract": "State-of-the-art system-level simulators can deliver fast power estimates for microprocessor designs, but often at the expense of reduced accuracy. The inaccuracies mainly stem from incorrect or over-simplified modeling of the target architecture. On the other hand, modern register-transfer level (RTL) simulators are cycle-accurate but overwhelmingly time consuming for most real-life workloads. Consequently, the design community often has to make a compromise between accuracy and speed. In this work, we propose a novel cross-layer power estimation (CAPE) technique that carefully integrates system-level and RTL profiling data for the target design in order to attain better accuracy. Our proposed methodology first leverages the SimPoint tool to transform a workload into weighted simulation points. We, then, present two different strategies to represent the critical segment of an application - either with a workload …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Trim Time Reduction in Analog/RF ICs Based on Inter-Trim Correlation",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9441034/",
            "Abstract": "Post-fabrication performance calibration, a.k.a. trimming, is an essential part of analog/RF IC manufacturing and testing. Its objective is to counteract the impact of process variations by individually fine-tuning the performance parameters of every fabricated chip so that they meet the design specifications and, thereby, to ensure both high yield and high performance. The prevalent trimming process currently employed in industry involves a search algorithm which consists of repeated digital trim-code selection and measurement in order to optimize the trimmed performance. With hundreds of trims commonly performed on contemporary analog/RF chips, this process becomes overly expensive. In this work, we discuss a machine learning-based approach that ameliorates this problem by leveraging inter-trim correlation. Specifically, our method relies on effectively trained regression models which use the measurements …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:HIFyuExEbWQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generating decision regions in analog measurement spaces",
            "Publication year": 2005,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1057661.1057684",
            "Abstract": "We develop a neural network that learns to separate the nominal from the faulty instances of a circuit in a measurement space. We demonstrate that the required separation boundaries are, in general, non-linear. Unlike previous solutions which draw hyperplanes, our network is capable of drawing the necessary non-linear hypersurfaces. The hypersurfaces translate to test criteria that are strongly correlated to functional tests. A feature selection algorithm interacts with the network to identify a discriminative low-dimensional measurement space.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Session Abstract",
            "Publication year": 2006,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/vts/2006/25140290/12OmNviZldf",
            "Abstract": "The aim of the TTTC Doctoral Thesis Award is to promote and strengthen the interaction between doctoral students who are about to graduate and the industrial community. It also serves as a process that allows their work to be exposed to and tested under real life industrial needs by experts in the field. This is achieved with student presentations in a dedicated VTS session in front of an industrial panel that evaluates, comments and contributes to their work in terms of novelty and advance of industrial practice and this of theoretical methodology.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Special session on machine learning: How will machine learning transform test?",
            "Publication year": 2018,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/vts/2018/08368667/12OmNqI04Rl",
            "Abstract": "This special session will discuss how machine learning can transform test. The first talk will review the key challenges and will argue whether contemporary tools, such as deep learning, could offer any advantages over traditional methods. The second talk will focus on extracting useful information from big test data. The third talk will view adaptive test as running machine learning algorithms in real time on big data.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Towards provably-secure performance locking",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8342269/",
            "Abstract": "Locking the functionality of an integrated circuit (IC) thwarts attacks such as intellectual property (IP) piracy, hardware Trojans, overbuilding, and counterfeiting. Although functional locking has been extensively investigated, locking the performance of an IC has been little explored. In this paper, we develop provably-secure performance locking, where only on applying the correct key the IC shows superior performance; for an incorrect key, the performance of the IC degrades significantly. This leads to a new business model, where the companies can design a single IC capable of different performances for different users. We develop mathematical definitions of security and theoretically, and experimentally prove the security against the state-of-the-art-attacks. We implemented performance locking on a FabScalar microprocessor, achieving a degradation in instructions per clock cycle (IPC) of up to 77% on applying …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated die inking",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9096556/",
            "Abstract": "Ensuring high reliability in modern integrated circuits (ICs) requires the employment of several die screening methodologies. One such technique, commonly referred to as die inking, aims to discard devices that are likely to fail, based on their proximity to known failed devices on the wafer. Die inking is traditionally performed manually by visually inspecting each manufactured wafer and thus it is very time-consuming. Towards reducing this cost, we introduce a novel machine learning-based methodology to learn and automatically generate the inking pat-terns from the failure maps, thus eliminating the need for human intervention. Effectiveness is demonstrated on an industrial set of manually inked wafers.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:a9-T7VOCCH8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient transparency extraction and utilization in hierarchical test",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/923446/",
            "Abstract": "We introduce a methodology for identifying transparency behavior appropriate for hierarchical test, based on the theoretical principles of transparency composition. Unlike high level approaches that identify limited, coarse transparency behavior, the proposed methodology is capable of extracting a wide class of fine grained transparency functions for arbitrary sub-word bit clusters. The functions in this class can furthermore be rapidly extracted on the fly and efficiently utilized for hierarchical test translation, thus alleviating the exponential extraction time and storage space requirements of exhaustive approaches. The twin benefits of rapid, automated extraction coupled with the expansion of utilizable transparency scope deliver reduced DFT while enabling cost-effective hierarchical test of high quality.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:4DMP91E08xMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Is single-scheme Trojan prevention sufficient?",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6081415/",
            "Abstract": "We discuss a new type of a structural hardware Trojan, which does not attack the target circuit itself but tries to mute the internal hardening scheme instead. By implementing this type of hardware Trojan, we argue that most of the currently proposed hardware Trojan prevention methods are far from adequate, assuming that attackers are patient, smart and have basic knowledge of the hardening structure. As demonstrated through our work for the CSAW Embedded System Challenge hosted by NYU-Poly in 2010, attackers can easily construct test patterns to “reverse-engineer” the hardening scheme from the Register Transfer Level (RTL) description. A simple look-up table can then invalidate the hardening scheme, even if it is as sophisticated as the Ring Oscillator (RO)-based Trojan prevention method used in this competition. Hence, our conjecture is that any single-scheme Trojan prevention method is insufficient …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:abG-DnoFyZgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Soft-error tolerance and mitigation in asynchronous burst-mode circuits",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5067005/",
            "Abstract": "We discuss the problem of soft errors in asynchronous burst-mode machines (ABMMs), and we propose two solutions. The first solution is an error tolerance approach, which leverages the inherent functionality of Muller C-elements, along with a variant of duplication, to suppress all transient errors. The proposed method is more robust and less expensive than the typical triple modular redundancy error tolerance method and often even less expensive than previously proposed concurrent error detection methods, which only provide detection but no correction. The second solution is an error mitigation approach, which leverages a newly devised soft-error susceptibility assessment method for ABMMs, along with partial duplication, to suppress a carefully chosen subset of transient errors. Three progressively more powerful options for partial duplication select among individual gates, complete state/output logic cones …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fault Simulation and Random Test Generation for Speed-Independent Circuits",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=16081696067258920510&hl=en&oi=scholarr",
            "Abstract": "We develop a fault simulator for input stuck-at faults in Speed-Independent circuits by extending Eichelberger's method. In order to achieve higher accuracy, a 13-valued algebra is adopted, the relative order of causal signal transitions is maintained, and time frames are unfolded in a careful manner. Based on this simulator, we propose a random test generation algorithm which reduces the probability that the circuit finds itself in non-deterministic states and helps it recover when this happens. Experimental results show that the combination of the two techniques achieves an average im-provement of 18% in fault coverage.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:OTTXONDVkokC",
            "Publisher": "ACM Press"
        },
        {
            "Title": "Silicon demonstration of statistical post-production tuning",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7309643/",
            "Abstract": "Towards meeting the continued demand for higher performance in analog/RF ICs, the semiconductor industry has resorted to aggressive design styles. In conjunction with the increased variation of modern processes, aggressive design jeopardizes yield and, by extension, profitability of the design. In an effort to facilitate aggressive high-performance design without compromising production yield, modern designs incorporate tuning knobs which are used after manufacturing to individually calibrate the performances of each chip, as well as some type of non-volatile memory to store the selected knob settings. In this work, we discuss a statistical post-production tuning method, which rapidly selects the appropriate knob positions using low-cost measurements, and we demonstrate it on a tunable Low Noise Amplifier which we designed and fabricated in IBM's 130nm RF CMOS process.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:W5xh706n7nkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Workload-driven selective hardening of control state elements in modern microprocessors",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5469589/",
            "Abstract": "We present a method for selective hardening of control state elements against soft errors in modern microprocessors. In order to effectively allocate resources, our method seeks to rank the control state elements based on their susceptibility, taking into account the high degree of architectural masking inherent in modern microprocessors. The novelty of our method lies in the way this ranking is computed. Unlike methods that compute the architectural vulnerability of registers based on high-level simulations on performance models, our method operates at the Register Transfer (RT-) Level and is, therefore, more accurate. In contrast to previous RT-Level methods, however, it does not rely on extensive transient fault injection campaigns and lengthy executions of workloads to completion, which may make such analysis prohibitive. Instead, it monitors the behavior of key global microprocessor signals in response to a …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-cost analog/RF IC testing through combined intra-and inter-die correlation models",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6917034/",
            "Abstract": "This paper presents statistical methods to identify and take advantage of correlations in the test methods and wafer-level spatial correlations among devices. The result, shown for industrial designs, is a far more optimized test suite.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:SdhP9T11ey4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Seamless integration of SER in rewiring-based design space exploration",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4079360/",
            "Abstract": "Rewiring has been used extensively for optimizing the area, the power consumption, the delay, and the testability of a circuit. In this work, we demonstrate how rewiring can also be used for reducing the soft error rate (SER). We employ an ATPG-based rewiring method to generate functionally-equivalent yet structurally-different implementations of a logic circuit based on simple transformation rules. This rewiring capability, along with an off-the-shelf method for assessing the SER of a circuit, enable the integration of the SER in a unified search algorithm that iteratively evolves the design in order to satisfy a given set of objectives. Experimental results on ISCAS'89 and ITC'99 benchmark circuits verify that rewiring can indeed be successfully used to reduce the SER of a circuit and, thus, it facilitates a design-space exploration framework for trading off area, power consumption, delay, testability, and SER",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Counterfeit electronics: A rising threat in the semiconductor manufacturing industry",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6651880/",
            "Abstract": "As the supply chain of electronic circuits grows more complex, with parts coming from different suppliers scattered across the globe, counterfeit integrated circuits (ICs) are becoming a serious challenge which calls for immediate solutions. Counterfeiting includes re-labeling legitimate chips or illegitimately replicating chips and deceptively selling them as made by the legitimate manufacturer, or simply selling fake chips. Counterfeiting also includes providing defective parts or simply previously used parts recycled from scrapped assemblies. Obviously, there is a multitude of legal and financial implications involved in such activities and even if these devices initially work, they may have reduced lifetime and may pose reliability risks. In this tutorial, we provide a comprehensive review of existing techniques which seek to prevent and/or detect counterfeit integrated circuits. Various approaches are discussed and an …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Non-intrusive concurrent error detection in FSMs through State/Output compaction and monitoring via parity trees",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1253783/",
            "Abstract": "We discuss a non-intrusive methodology for concurrent error detection in FSMs. The proposed method is based on compaction and monitoring of the state/output bits of an FSM via parity trees. While errors may affect more than one state/output bit, not all combinations of state/output bits constitute potential erroneous cases for a given fault model. Therefore, it is possible to compact them without loss of error information. Thus, concurrent error detection is performed through hardware that predicts the values of the compacted state/output bits and compares them to the actual values of the FSM. In order to minimize the incurred hardware overhead, a randomized algorithm is proposed for selecting the minimum number of required parity functions.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:-f6ydRqryjwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On-die learning-based self-calibration of analog/RF ICs",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7477297/",
            "Abstract": "We discuss a methodology and the corresponding hardware architecture for performing self-calibration of analog/RF ICs through the use of on-die learning. More specifically, we introduce the design of an on-chip analog neural network which can be trained to implement a non-linear regression function. This regression function is, then, used to approximate a Figure-of-Merit (FoM) reflecting the performances of an analog/RF IC. As an input to this regression function, we use the readings of low-cost on-chip sensors in response to simple on-chip generated stimuli. The FoM is predicted for all possible settings of the knobs provided for calibrating the chip performances and the best option is retained. The proposed methodology is demonstrated on a tunable Low-Noise Amplifier (LNA) which was designed and fabricated in IBM's 130nm RF CMOS process. Experimental results show that the proposed self-calibration …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:j8SEvjWlNXcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A post-deployment IC trust evaluation architecture",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6604083/",
            "Abstract": "The use of side-channel parametric measurements along with statistical analysis methods for detecting hardware Trojans in fabricated integrated circuits has been studied extensively in recent years, initially for digital designs but recently also for their analog/RF counterparts. Such post-fabrication trust evaluation methods, however, are unable to detect dormant hardware Trojans which are activated after a circuit is deployed in its field of operation. For the latter, an on-chip trust evaluation method is required. To this end, we present a general architecture for post-deployment trust evaluation based on on-chip classifiers. Specifically, we discuss the design of an on-chip analog neural network which can be trained to distinguish trusted from untrusted circuit functionality based on simple measurements obtained via on-chip measurement acquisition sensors. The proposed method is demonstrated using a Trojan-free and …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:wbdj-CoPYUoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhancing security via provably trustworthy hardware intellectual property",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5954988/",
            "Abstract": "We introduce a novel hardware intellectual property acquisition protocol, show how it can support the transfer of provably trustworthy modules between hardware IP producers and consumers, and discuss what it might mean for a device to be considered “secure.” Specifically, we demonstrate the applicability of previous work in the software field of Proof-Carrying Code (PCC) to the problem of hardware trust and use it to combat the threat of hardware IP-level Trojans. We outline a semantic model representing the constructs permissible in a Verilog hardware description language (HDL) and show how this model can be used to reason about the trustworthiness of circuits represented at the register-transfer level (RTL). A discussion of “security-related properties” reveals how rules for trustworthy operation might be established for a particular design without necessarily specifying exact functionality. We then examine a …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Low-cost concurrent error detection for floating-point unit (FPU) controllers",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6178236/",
            "Abstract": "We present a nonintrusive concurrent error detection (CED) method for protecting the control logic of a contemporary floating-point unit (FPU). The proposed method is based on the observation that control logic errors lead to extensive data path corruption and affect, with high probability, the exponent part of the IEEE-754 floating-point representation. Thus, exponent monitoring can be utilized to detect errors in the control logic of the FPU. Predicting the exponent involves relatively simple operations; therefore, our method incurs significantly lower overhead than the classical approach of duplicating the control logic of the FPU. Indeed, experimental results on the openSPARC T1 processor using SPEC2006FP benchmarks show that as compared to control logic duplication, which incurs an area overhead of 17.9 percent of the FPU size, our method incurs an area overhead of only 5.8 percent yet still achieves …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Functional obfuscation of hardware accelerators through selective partial design extraction onto an embedded fpga",
            "Publication year": 2019,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3299874.3317992",
            "Abstract": "The protection of Intellectual Property (IP) has emerged as one of the most serious areas of concern in the semiconductor industry. To address this issue, we present a method and architecture to map selective portions of a design, given as a behavioral description for High-Level Synthesis (HLS) to a high-security embedded Field-Programmable Gate Array (eFPGA). In this manner, only the end-user has access to the full functionality of the chip. Using six benchmark circuits, we show that our approach is effective. In all cases, the Time-To-Break (TTB) is so long (at least 8 million hours) that for all practical purposes the designs are secure while incurring area overheads of around 5%. Further, latencies were only slightly increased, while the computation times are under one minute.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:q3CdL3IzO_QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Hardware-based on-line intrusion detection via system call routine fingerprinting",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7927236/",
            "Abstract": "We introduce a hardware-based methodology for performing on-line intrusion detection in microprocessors. The proposed method extracts fingerprints from the basic blocks of the routine executed in response to a system call and examines their validity using a Bloom filter. Implementation in hardware renders spoofing attacks, to which operating system or hypervisor-level intrusion detection methods are vulnerable, ineffective. The proposed method is evaluated using kernel rootkits which covertly modify the system call service routines of a Linux operating system running on a 32-bit x86 architecture, implemented in the Simics simulation environment, while hardware overhead is evaluated using a predictive 45nm PDK.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:4MWp96NkSFoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Recycled IC detection based on statistical methods",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7055850/",
            "Abstract": "We introduce two statistical methods for identifying recycled integrated circuits (ICs) through the use of one-class classifiers and degradation curve sensitivity analysis. Both methods rely on statistically learning the parametric behavior of known new devices and using it as a reference point to determine whether a device under authentication has previously been used. The proposed methods are evaluated using actual measurements and simulation data from digital and analog devices, with experimental results confirming their effectiveness in distinguishing between new and aged ICs and their superiority over previously proposed methods.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:1yQoGdGgb4wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Confidence estimation in non-RF to RF correlation-based specification test compaction",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4556025/",
            "Abstract": "Several existing methodologies have leveraged the correlation between the non-RF and the RF performances of a circuit in order to predict the latter from the former and, thus, reduce test cost. While this form of specification test compaction eliminates the need for expensive RF measurements, it also comes at the cost of reduced test accuracy, since the retained non-RF measurements and pertinent correlation models do not always suffice for adequately predicting the omitted RF measurements. To alleviate this problem, we develop a methodology that estimates the confidence in the obtained test outcome. Subsequently, devices for which this confidence is insufficient are retested through the complete specification test suite. As we demonstrate on production test data from a zero-IF down-converter fabricated at IBM, the proposed method outperforms previous defect filtering and guard banding methods and enables …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Cross-Layer Framework For Cost-Effective Intellectual Property (IP) Protection",
            "Publication year": 2021,
            "Publication url": "https://apps.dtic.mil/sti/citations/AD1122333",
            "Abstract": "This report summarizes the progress on the Efficient Cross-Layered IP Protection Scheme ECLIPSE project. In addition to developing security metrics and proofs, we apply the proposed stripped-functionality logic locking SFLL technique and demonstrate it on a field-programmable gate array FPGA platform. The report also highlights our efforts towards protecting multiple outputs of circuit, unlocking circuits using machine learning, and developing a logic tool that implements different variants of logic locking. The report also summarizes the latest benchmarking and red-teaming efforts on our defense as part of Cybersecurity Awareness Worldwide 2019 competition, which was the first logic locking contest.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:QYdC8u9Cj1oC",
            "Publisher": "University of California, San DiegoUniversity of Texas at DallasNew York University"
        },
        {
            "Title": "Machine Learning-based Noise Classification and Decomposition in RF Transceivers",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8758674/",
            "Abstract": "We propose a machine learning-based solution for noise classification and decomposition in RF transceivers. Wireless transmitters are affected by various noise sources, each of which has a distinct impact on the signal constellation points. The proposed approach takes advantage of the characteristic dispersion of points in the constellation by extracting key statistical and geometric features that are used to train a machine learning model. The trained model is, then, capable of identifying the noise source fingerprint, comprised by single or multiple noise sources, for each affected device. Effectiveness of the model has been verified using constellation measurements from a combined set of simulated and actual silicon devices.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:Ug5p-4gJ2f0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Enhanced hotspot detection through synthetic pattern generation and design of experiments",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8368646/",
            "Abstract": "Continuous technology scaling and the introduction of advanced technology nodes in Integrated Circuit (IC) fabrication is constantly exposing new manufacturability issues. Design hotspots are one of such problems, which are a result of complex design and process interactions. These hotspots are known to vary from design to design and foundries expect such hotspots to be predicted early and corrected in the design stage itself, as opposed to a process fix for every hotspot, which would be intractable. Various efforts have been made in the past to address this issue by using a known database of hotspots as a source of information. Most of those works use either Machine Learning (ML) or Pattern Matching (PM) techniques to identify and predict hotspots in new incoming designs. Almost all of those methods suffer from high false-alarm rates, mainly because (i) they are oblivious to the root causes of hotspots, and (ii …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:k8Z6L05lTy4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Berger code-based concurrent error detection in asynchronous burst-mode machines",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1656848/",
            "Abstract": "We discuss the use of the Berger code for concurrent error detection (CED) in asynchronous burst-mode machines (ABMMs). We present a state encoding method which guarantees the existence of the two key components for Berger-encoding an ABMM, namely an inverter-free ABMM implementation of the circuit and an ABMM implementation of the corresponding Berger code generator. We also propose improved solutions to two inherent problems of CED in ABMMs, namely checking synchronization and detection of error-induced hazards. Experimental results demonstrate that Berger code-based CED reduces significantly the cost of previous CED methods for ABMMs",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "What to lock? Functional and parametric locking",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3060403.3060492",
            "Abstract": "Logic locking is an intellectual property (IP) protection technique that prevents IP piracy, reverse engineering and overbuilding attacks by the untrusted foundry or end-users. Existing logic locking techniques are all based on locking the functionality; the design/chip is nonfunctional unless the secret key has been loaded. Existing techniques are vulnerable to various attacks, such as sensitization, key-pruning, and signal skew analysis enabled removal attacks. In this paper, we propose a tenacious and traceless logic locking technique, TTlock, that locks functionality and provably withstands all known attacks, such as SAT-based, sensitization, removal, etc. TTLock protects a secret input pattern; the output of a logic cone is flipped for that pattern, where this flip is restored only when the correct key is applied. Experimental results confirm our theoretical expectations that the computational complexity of attacks launched …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:p__nRnzSRKYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enhancing reliability of RTL controller-datapath circuits via invariant-based concurrent test",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1308673/",
            "Abstract": "We present a low-cost concurrent test methodology for enhancing the reliability of RTL controller-datapath circuits, based on the notion of path invariance. The fundamental observation supporting the proposed methodology is that the inherent transparency behavior of RTL components, typically utilized for hierarchical off-line test, renders rich sources of invariance within a circuit. Furthermore, additional sources of invariance are obtained by examining the algorithmic interaction between the controller, and the datapath of the circuit. A judicious selection & combination of modular transparency functions, based on the algorithm implemented by the controller-datapath pair, yields a powerful set of invariant paths in a design. Compliance to the invariant behavior is checked whenever the latter is activated. Thus, such paths enable a simple, yet very efficient concurrent test capability, achieving fault security in excess of 90 …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware-based real-time workload forensics",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8963896/",
            "Abstract": "Workload forensics is a key component of software security that collects and analyzes information to identify suspicious behavior. Researchers from UT Dallas explore a hardware alternative since it is immune from software attacks and does not rely on data collected from the OS or software applications.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:9pM33mqn1YgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Invariance-based on-line test for RTL controller-datapath circuits",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/843879/",
            "Abstract": "We present a low-cost on-line test methodology for RTL controller-datapath pairs, based on the notion of path invariance. The fundamental observation supporting the proposed methodology is that the transparency behavior inherent in RTL components renders rich sources of invariance in a design. Furthermore, the algorithmic controller-datapath interaction provides additional sources of invariance. A judicious selection and combination of modular transparency, based on the algorithm implemented by the controller-datapath pair, yields a powerful set of invariant paths. Such paths enable a simple, yet very efficient on-line test capability, achieving fault security in excess of 90% while keeping the hardware overhead below 40% on complicated, difficult to test, benchmarks.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Guest Editors' Introduction: Special Section on Chips and Architectures for Emerging Technologies and Applications",
            "Publication year": 2011,
            "Publication url": "https://www.researchgate.net/profile/Alfredo-Benso/publication/220332364_Guest_Editors'_Introduction_Special_Section_on_Chips_and_Architectures_for_Emerging_Technologies_and_Applications/links/5440f87c0cf2a6a049a3417b/Guest-Editors-Introduction-Special-Section-on-Chips-and-Architectures-for-Emerging-Technologies-and-Applications.pdf",
            "Abstract": "IT is with great pleasure that we introduce this special section on Chips and Architectures for Emerging Technologies and Applications to the audience of the IEEE Transactions on Computers. We are currently witnessing a technology advancement which is making the gap between the present and future much narrower than it has ever been. The purpose of this special section is to showcase highly innovative, creative, and futuristic chip architectures and functionalities that can range from new paradigms in reconfigurable systems architectures, to adaptive, organic, ubiquitous, and biologically inspired computing, to new classes of chip implants, or any other highly innovative human-to-computer interface. This special section includes two papers, which we hope will offer an interesting perspective on the challenges involved in designing integrated circuits and architectures that leverage the capabilities of emerging technologies in novel applications.The first paper,‘‘Exploring the Potential of Threshold Logic for Cryptography-Related Operations,’’by Alessandro Cilardo, investigates the application of a non-Boolean computational paradigm to cryptographic applications. More specifically, the author demonstrates the power of linear Threshold Logic functions, which are enabled by new technologies such as Resonant Tunneling Diodes (RTDs), Single-Electron Tunneling (SET), Quantum Cellular Automata (QCA), and Tunneling Phase Logic (TPL), towards performing fundamental cryptographic operations. An architecture for implementing such operations, namely a Montgomery modular reduction and multiplication, is also introduced and its intrinsic …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Impact analysis of performance faults in modern microprocessors",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5413171/",
            "Abstract": "Towards improving performance, modern microprocessors incorporate a variety of architectural features, such as branch prediction and speculative execution, which are not critical to the correctness of their operation. While faults in the corresponding hardware may not necessarily affect functional correctness, they may, nevertheless, adversely impact performance. In this paper, we investigate quantitatively the performance impact of such faults using a superscalar, dynamically-scheduled, out-of-order, Alpha-like microprocessor, on which we execute SPEC2000 integer benchmarks. We provide extensive fault simulation-based experimental results and we discuss how this information may guide the inclusion of additional hardware for performance loss recovery and yield enhancement.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Independent test sequence compaction through integer programming",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1240924/",
            "Abstract": "We discuss the compaction of independent test sequences for sequential circuits. Our first contribution is the formulation of this problem as an integer program, which we then solve through a well-known method employing linear programming relaxation and randomized rounding. The key contribution of this approach is that it yields the first polynomial time approximation algorithm for this problem. More specifically, it provides a provably good approximation guarantee while running in time polynomial with respect to the number of vectors in the original test sequences and the number of faults. Another virtue of our approach is that it provides a lower bound for the compacted set of test sequences and, therefore, a quality measure for the test compaction algorithm. Experimental results on benchmark circuits demonstrate that the proposed solution efficiently identifies nearly optimal sets of compacted test sequences.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Entropy-driven parity-tree selection for low-overhead concurrent error detection in finite state machines",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1637743/",
            "Abstract": "This paper presents discuss the problem of parity-tree selection for performing concurrent error detection (CED) with low overhead in finite state machines (FSMs). We first develop a nonintrusive CED method based on compaction of the state/output bits of an FSM via parity trees and comparison to the correct responses, which are generated through additional on-chip parity prediction hardware. Similar to off-line test-response-compaction practices, this method minimizes the number of parity trees required for performing lossless compaction. However, while a few parity trees are typically sufficient, the area and the power consumption of the corresponding parity predictor is not always in proportion with the number of implemented functions. Therefore, parity-tree-selection methods that minimize the overhead of the parity predictor, rather than the number of parity trees, are required. Towards this end, we then extend …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trusted module acquisition through proof-carrying hardware intellectual property",
            "Publication year": 2015,
            "Publication url": "https://apps.dtic.mil/sti/citations/ADA625124",
            "Abstract": "By borrowing ideas from the proof carrying code PCC in software domain, in this project we introduced the proof carrying hardware intellectual property PCHIP framework, which aims to ensure the trustworthiness of third-party hardware IPs utilizing formal methods. We were able to build the fundamental PCHIP framework, enhance its capabilities to be usable for various hardware types with different requirements, eg microprocessor IPs or cryptographic cores, and automate parts or all of the extra duties imposed by the PCHIP on hardware IP developers. PCHIP involves these three additional tasks development of security properties for the design as formal theorems, conversion of the HDL code to the formal representation, and construction of formal proofs for those security theorems. We established a set of security properties which ensure the trustworthiness of microprocessor IPs and developed VeriCoq, which automates the conversion of hardware IPs in Verilog to their equivalent Coq representation. We also built a special PCHIP framework for cryptographic cores, capable of tracking sensitive information through the design and ensure their secureness. Finally, we developed VeriCoq-IFT, which automates all of PCHIPs tasks for this special framework, including conversion of HDL code to formal representation and generation of security theorems and their proofs.Descriptors:",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:35r97b3x0nAC",
            "Publisher": "TEXAS UNIV AT DALLAS RICHARDSON DEPT OF ELECTRICAL ENGINEERING"
        },
        {
            "Title": "IC laser trimming speed-up through wafer-level spatial correlation modeling",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7035329/",
            "Abstract": "Laser trimming is used extensively to ensure accurate values of on-chip precision resistors in the presence of process variations. Such laser resistor trimming is slow and expensive, typically performed in a closed-loop, where the laser is iteratively fired and some circuit parameter (i.e. current) is monitored until a target condition is satisfied. Toward reducing this cost, we introduce a novel methodology for predicting the laser trim length, thereby eliminating the closed-loop control and speeding up the process. Predictions are obtained from waferlevel spatial correlation models, learned from a sparse sample of die on which traditional trimming is performed. Effectiveness is demonstrated on an actual wafer of laser-trimmed ICs.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:ZuybSZzF8UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analog VLSI multilayer perceptron and its application towards built-in self-test in analog circuits",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5560230/",
            "Abstract": "A proof-of-concept hardware neural network for the purpose of analog built-in self-test is presented. The network is reconfigurable into any one-hidden-layer topology within the constraints of the number of inputs and neurons. Analog operation domain of synapses and neurons in conjunction with the digital weight storage allow fast computational time, low power consumption and fast training cycle. The network is trained in the chip-in-the-loop fashion with the simulated annealing-based parallel weight perturbation training algorithm. Its effectiveness in learning how to separate nominal from faulty circuits is investigated on two case studies: a Butterworth filter and an operational amplifier. The results are compared to those of the software neural networks of equivalent topologies and limitations concerning the practical applicability are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware Trojan detection in analog/RF integrated circuits",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-14971-4_7",
            "Abstract": "Globalization of semiconductor manufacturing has brought about increasing concerns regarding possible infiltration of the Integrated Circuit (IC) supply chain by skilled and resourceful adversaries, with the intention of introducing malicious modifications (a.k.a hardware Trojans) which can be exploited to cause incorrect results, steal sensitive data, or even incapacitate a chip. While numerous prevention and detection solutions have been introduced in the recent, past, the vast majority of these efforts target digital circuits. Analog/RF ICs, however, are equally vulnerable and potentially even more attractive as attack targets, due to their wireless communication capabilities. Accordingly, in this chapter, we review existing research efforts in hardware Trojan detection in Analog/RF ICs. Specifically, using a wireless cryptographic IC as an experimentation platform, we demonstrate the effectiveness of side-channel …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:NJ774b8OgUMC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Innovative practices session 7C: Self-calibration & trimming",
            "Publication year": 2013,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/vts/2013/06548919/12OmNrJRPol",
            "Abstract": "Critical Path Monitors (CPM) are a way of modeling the frequency response of a microprocessor to voltage, environment, workload, and other operating point changes. When coupled with a frequency controller, the CPM gives the microprocessor the ability to adjust its frequency to match the current operating environment. This allows for more efficient designs since voltage and frequency margins required to compensate for voltage droops, di/dt events, temperature changes, and other noise events are no longer needed. Calibration is key to functional Critical Path Monitors. Calibration compensates for process variation and pulls the CPM in-line with the hardware it is controlling. In this talk the CPM, frequency control loop, and calibration methodology of the Power7+ microprocessor is described. The CPM models frequency response well enough, after calibration, to allow for a 22% margin reduction. Our …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:S16KYo8Pm5AC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "Concurrent error detection in linear analog circuits using state estimation",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.122.8674&rep=rep1&type=pdf",
            "Abstract": "We present a novel methodology for concurrent error detection in linear analog circuits. We develop a rigorous theory that yields an error detection circuit of size that is, in general, much smaller than a duplicate of the circuit under test. The error detection circuit monitors the input and some judiciously selected observable internal nodes of the examined circuit to produce an estimate of its output. In error-free operation, this estimate converges to the actual output value in a time interval that can be controlled to be sufficiently small. From then onwards, it follows exactly the output. The estimate is constructed such that it does not converge in the presence of errors and, thus, concurrent error detection is performed by comparing the two signals through an analog checker. The derived theory is validated through representative simulations on two filter examples.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE Computer Society"
        },
        {
            "Title": "A proof-carrying based framework for trusted microprocessor IP",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6691208/",
            "Abstract": "We introduce a proof-carrying based framework for assessing the trustworthiness of third-party hardware Intellectual Property (IP), particularly geared toward microprocessor cores. This framework enables definition of and formal reasoning on security properties, which, in turn, are used to certify the genuineness and trustworthiness of the instruction set and, by extension, are used to prevent insertion of malicious functionality in the Hardware Description Language (HDL) code of an acquired microprocessor core. Security properties and trustworthiness proofs are derived based on a new formal hardware description language (formal-HDL), which is developed as part of the framework along with conversion rules to/from other HDLs to enable general applicability to IP cores independent of coding language. The proposed framework, along with the ability of a sample set of pertinent security properties to detect …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:Mojj43d5GZwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "VeriCoq: A Verilog-to-Coq converter for proof-carrying hardware automation",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7168562/",
            "Abstract": "Proof carrying hardware intellectual property (PCHIP) introduces a new framework in which a hardware (semiconductor) Intellectual Property (IP) is accompanied by formal proofs of certain security-related properties, ensuring that the acquired IP is trustworthy and free from hardware Trojans. In the PCHIP framework, conversion of the design from a hardware description language (HDL) to a formal representation is an essential step. Towards automating this process, herein we introduce VeriCoq, a converter of designs described in Register Transfer Level (RTL) Verilog to their corresponding representation in the Coq theorem proving language, based on the rules defined in the PCHIP framework. VeriCoq supports most of the synthesizable Verilog constructs and is the first step towards automating the entire framework, in order to simplify adoption of PCHIP by hardware IP developers and consumers and, thereby …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:_Ybze24A_UAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Automated die inking: A pattern recognition-based approach",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8242040/",
            "Abstract": "Manual wafer-level die inking is a common procedure for excluding die locations that are likely to be defective. Although this is a more cost-effective process, as compared to the expensive burn-in tests, it remains a labor-intensive step during IC testing. For each manufactured wafer, test engineers have to visually inspect every failure map in order to identify any regions where additional die need to be marked and discarded. Towards reducing this cost, we introduce a novel pattern recognition methodology to learn and automatically generate the inking patterns from the failure maps, thus eliminating the need for human intervention. Effectiveness is demonstrated on an industrial set of manually inked wafers.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:b1wdh0AR-JQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Demonstrating and mitigating the risk of an FEC-based hardware Trojan in wireless networks",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8649684/",
            "Abstract": "We discuss the threat that malicious circuitry (a.k.a. hardware Trojan) poses in wireless communications and propose a remedy for mitigating the risk. First, we present and theoretically analyze a stealthy hardware Trojan embedded in the forward error correction (FEC) block of an 802.11a/g transceiver. FEC seeks to shield the transmitted signal against noise and other imperfections. This capability, however, may be exploited by a hardware Trojan to establish a covert communication channel with a knowledgeable rogue receiver. At the same time, the unsuspecting legitimate receiver continues to correctly recover the original message, despite experiencing a slight reduction in signal-to-noise ratio (SNR) and, therefore, remains oblivious to the attack. Next, we implement this hardware Trojan on an experimental setup based on the Wireless Open Access Research Platform (WARP) and we demonstrate (i) attack …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:SpbeaW3--B0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wafer-Level Adaptive Vmin Calibration Seed Forecasting",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8715082/",
            "Abstract": "To combat the effects of process variation in modern, high-performance integrated Circuits (ICs), various post-manufacturing calibrations are typically performed. These calibrations aim to bring each device within its specification limits and ensure that it abides by current technology standards. Moreover, with the increasing popularity of mobile devices that usually depend on finite energy sources, power consumption has been introduced as an additional constraint. As a result, post-silicon calibration is often performed to identify the optimal operating voltage (V min ) of a given Integrated Circuit. This calibration is time-consuming, as it requires the device to be tested in a wide range of voltage inputs across a large number of tests. In this work, we propose a machine learning-based methodology for reducing the cost of performing the V min  calibration search, by identifying the optimal wafer-level search parameters …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:HbR8gkJAVGIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and evaluation of a timestamp-based concurrent error detection method (CED) in a modern microprocessor controller",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4641203/",
            "Abstract": "This paper presents a concurrent error detection technique for the control logic of a modern microprocessor. Our method is based on execution time prediction for each instruction executing in the processor. To evaluate the proposed method, we use a superscalar, dynamically-scheduled, out-of-order, Alpha-like microprocessor, on which we execute SPEC2000 integer benchmarks and we consider the coverage and the detection latency for faults in the scheduler module of the microprocessor controller. Experimental results show that through this method, a large percentage of control logic faults can be detected with low latency during normal operation of the processor.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Correlating inline data with final test outcomes in analog/RF devices",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5763138/",
            "Abstract": "In semiconductor manufacturing, a wealth of wafer-level measurements, generally termed inline data, are collected from various on-die and between-die (kerf) test structures and are used to provide characterization engineers with information on the health of the process. While it is generally believed that these measurements also contain valuable information regarding die performances, the vast amount of inline data collected often thwarts efficient and informative correlation with final test outcomes. In this work, we develop a data mining approach to automatically identify and explore correlations between inline measurements and final test outcomes in analog/RF devices. Significantly, we do not depend on statistical methods in isolation, but incorporate domain expert feedback into our algorithm to identify and remove spurious autocorrelations which are frequently present in semiconductor manufacturing data. We …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:D03iK_w7-QYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vulnerability-based Interleaving for Multi-Bit Upset (MBU) protection in modern microprocessors",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6401594/",
            "Abstract": "We present a novel methodology for protecting incore microprocessor memory arrays from Multiple Bit Upsets (MBUs). Recent radiation studies in modern SRAMs demonstrate that up to 55% of Single Event Upsets (SEUs) due to alpha particle or neutron strikes result in MBUs. Towards suppressing these MBUs, methods such as physical interleaving or periodic scrubbing have been successfully applied to caches. However, these methods are not applicable to in-core, high-performance Content-Addressable Memories (CAM) arrays, due to computational complexity, high delay and area overhead, and lack of information redundancy. To this end, we propose a cost-effective method for enhancing in-core memory array resiliency, called Vulnerability-based Interleaving (VBI). VBI physically disperses bit-lines based on their vulnerability factor and applies selective parity to these lines. Thereby, VBI aims to ensure that …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:XiSMed-E-HIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Provenance Attestation of Human Cells Using Physical Unclonable Functions",
            "Publication year": 2021,
            "Publication url": "https://www.biorxiv.org/content/10.1101/2021.06.11.448108v1.abstract",
            "Abstract": "We introduce a novel methodology, namely CRISPR-Engineered Attestation of Mammalian Cells using Physical Unclonable Functions (CREAM-PUFs), which can serve as the cornerstone for formally verifying transactions in human cell line distribution networks. A PUF is a physical entity which provides a measurable output that can be used as a unique and irreproducible identifier for the artifact wherein it is embedded. Popularized by the electronics industry, silicon PUFs leverage the inherent physical variations of semiconductor manufacturing to establish intrinsic security primitives for attesting integrated circuits. Owing to the stochastic nature of these variations and the multitude of steps involved, photo-lithographically manufactured silicon PUFs are impossible to reproduce (thus unclonable). Inspired by the success of silicon PUFs, we sought to exploit a combination of sequence-restricted barcodes and the inherent stochasticity of CRISPR-induced non-homologous end joining DNA error repair to create the first generation of genetic physical unclonable functions in three distinct human cells (HEK293, HCT116, and HeLa). We demonstrate that these CREAM-PUFs are robust (i.e., they repeatedly produce the same output), unique (i.e., they do not coincide with any other identically produced PUF), and unclonable (i.e., they are virtually impossible to replicate). Accordingly, CREAM-PUFs can serve as a foundational principle for establishing provenance attestation protocols for protecting intellectual property and confirming authenticity of engineered cell lines.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:4vMrXwiscB8C",
            "Publisher": "Cold Spring Harbor Laboratory"
        },
        {
            "Title": "SPIN-SIM: Logic and fault simulation for speed-independent circuits",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1386997/",
            "Abstract": "We present SPIN-SIM, a logic and fault simulator for speed-independent circuits, that extends the classical Eichelberger's method and overcomes its limitations. In order to improve simulation accuracy. SPIN-SIM adopts a 13-valued algebra, maintains the relative order of causal signal transitions, and unfolds time frames judiciously. In addition, complex gates are handled through replacement by pseudo-gate equivalents with regards to functionality, timing and faulty behavior. Experimental results show that SPIN-SIM incurs a negligible increase in computational time over Eichelberger's method, yet is much more accurate and achieves a significant improvement in fault coverage.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Entropy-Driven Parity-Tree Selection for Low-Overhead Concurrent Error Detection in Finite State Machines",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=11463567297057694341&hl=en&oi=scholarr",
            "Abstract": "This paper presents discuss the problem of parity-tree selection for performing concurrent error detection (CED) with low overhead in finite state machines (FSMs). We first develop a nonintrusive CED method based on compaction of the state/output bits of an FSM via parity trees and comparison to the correct responses, which are generated through additional on-chip parity prediction hardware. Similar to off-line test-response-compaction practices, this method minimizes the number of parity trees required for performing lossless compaction. However, while a few parity trees are typically sufficient, the area and the power consumption of the corresponding parity predictor is not always in proportion with the number of implemented functions. Therefore, parity-tree-selection methods that minimize the overhead of the parity predictor, rather than the number of parity trees, are required. Towards this end, we then extend …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:i2xiXl-TujoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trusted analog/mixed-signal/RF ICs: A survey and a perspective",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7983448/",
            "Abstract": "The trustworthiness of integrated circuits is now an essential technical and business challenge for the semiconductor industry. In the digital domain, there has been extensive activity in understanding and counteracting the threats of hardware Trojans, piracy and counterfeiting. However, this research area is largely nascent and understudied for analog/mixed-signal (AMS) and radio frequency (RF) circuits, which are widely used in contemporary systems. This survey summarizes the state-of-art for trusted hardware design in AMS/RF IC’s, and highlights directions towards advancing the field. – Steven Nowick, Columbia University",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:g3aElNc5_aQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hardware Trojans in analog, mixed-signal, and RF ICs",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-68511-3_5",
            "Abstract": "In this chapter we summarize and present the existing, albeit limited work on known vulnerabilities and proposed remedies for AMS/RF ICs, emphasizing on hardware Trojans.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:gsN89kCJA0AC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Hunting Security Bugs in SoC Designs: Lessons Learned",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9154739/",
            "Abstract": "This article presents a methodology for finding hardware security bugs, using Lint tools that use static analysis techniques, along with best practices for code reviews and developing test cases.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:_5tno0g5mFcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast hierarchical test path construction for DFT-free controller-datapath circuits",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/893623/",
            "Abstract": "We discuss a hierarchical test generation method for DFT-free controller-datapath pairs. A transparency based scheme is devised for the datapath, wherein locally generated vectors are translated into global design test. The controller is examined through influence tables, used to generate valid control state sequences for testing each module through hierarchical test paths. Fault coverage levels and vector counts thus attained match closely, those of traditional test generation methodologies, while sharply reducing the corresponding computational cost.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPECIAL SECTION ON CHIPS AND ARCHITECTURES FOR EMERGING TECHNOLOGIES AND APPLICATIONS-Guest Editors' Introduction: Special Section on Chips and Architectures for Emerging Technologies and Applications",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=16656542806278990473&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:ye4kPcJQO24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Concurrent fault detection in random combinational logic",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1194770/",
            "Abstract": "We discuss a non-intrusive methodology for concurrent fault detection in random combinational logic. The proposed method is similar to duplication, wherein a replica of the circuit acts as a predictor that immediately detects potential faults by comparison to the original circuit. However, instead of duplicating the circuit, the proposed method selects a small number of prediction logic functions which only partially replicate it. Selection is guided by the objective of minimizing the incurred hardware overhead at the cost of introducing fault detection latency. To achieve this, the proposed method replicates only a reduced width output function for every input combination, yet without compromising the ability to detect all faults. In contrast to concurrent error detection schemes which presume the ability to re-synthesize the circuit, the proposed method does not interfere with the implementation of the original design. As …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Instruction-level impact comparison of RT-vs. gate-level faults in a modern microprocessor controller",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5116602/",
            "Abstract": "We discuss the results of an extensive fault simulation study involving the control logic of a modern alpha-like microprocessor. In this comparative study, faults are injected in both the RT- and the Gate-Level description of the design and are simulated under actual workload of the microprocessor, which is executing SPEC2000 benchmarks. The objective of this study is to analyze and contrast the impact of RT- and gate-level faults on the instruction execution flow of the microprocessor. The key observation is a pronounced consistency in the type and frequency of instruction level errors (ILEs) arising due to RT- vs. gate-level faults. The motivation for this work stems from the need to understand the relative importance of low-level faults based on their instruction-level impact, in order to appropriately allocate error detection and/or correction resources. Hence, the consistency revealed through this study implies that such …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:bEWYMUwI8FkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An analog non-volatile neural network platform for prototyping RF BIST solutions",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6800582/",
            "Abstract": "We introduce an analog non-volatile neural network chip which serves as an experimentation platform for prototyping custom classifiers for on-chip integration towards fully standalone built-in self-test (BIST) solutions for RF circuits. Our chip consists of a reconfigurable array of synapses and neurons operating below threshold and featuring sub-μW power consumption. The synapse circuits employ dynamic weight storage for fast bidirectional weight updates during training. The learned weights are then copied onto analog floating gate (FG) memory for permanent storage. The chip architecture supports two learning models: a multilayer perceptron and an ontogenic neural network. A benchmark XOR task is first employed to evaluate the overall learning capability of our chip. The BIST-related effectiveness is then evaluated on two case studies: the detection of parametric and catastrophic faults in an LNA and an RF …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:tkaPQYYpVKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Workload-cognizant concurrent error detection in the scheduler of a modern microprocessor",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5669287/",
            "Abstract": "We present a Concurrent Error Detection (CED) scheme for the Scheduler of a modern microprocessor. The proposed CED scheme is based on monitoring a set of invariances imposed through added hardware, violation of which signifies the occurrence of an error. The novelty of our solution stems from the workload-cognizant way in which these invariances are selected so that they leverage the application-level error masking inherent in program execution. Specifically, in order to ensure cost-effectiveness of the hardware employed to construct these invariances, we make use of information regarding the type and frequency of errors affecting the typical workload of the microprocessor. Thereby, we identify the most susceptible aspects of instruction execution and we accordingly distribute CED resources to protect them. Our approach is demonstrated on the Scheduler of an Alpha-like superscalar microprocessor …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:isC4tDSrTZIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An adaptive checker for the fully differential analog code",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1637606/",
            "Abstract": "This paper discusses the design of an adaptive checker for concurrent error detection in fully differential analog circuits. The checker monitors the fully differential analog code, which states that, in nominal operation, the common mode signal of any symmetric node pair remains within a narrow band around the quiescent DC bias. The checker measures the common mode voltage and reports an error whenever the measured value exceeds a threshold. Its key feature is that this comparison threshold is dynamically adjusted in order to lower the probability of false alarms. The design was fabricated in a 0.5-/spl mu/m CMOS technology. The chip test results prove the feasibility of the adaptive thresholding concept.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Acknowledgment of Guest Editors",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7331567/",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Toward silicon-based cognitive neuromorphic ICs—a survey",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7438769/",
            "Abstract": "This Tutorial describes the building blocks of neuromorphic VLSI systems and the way they are engineered. From learning mechanisms through the gap between reactive and cognitive systems, all major aspects are covered.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:fEOibwPWpKIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reconciling the Dichotomy Between Test and Security",
            "Publication year": 2013,
            "Publication url": "https://nyuscholars.nyu.edu/en/publications/reconciling-the-dichotomy-between-test-and-security",
            "Abstract": "Reconciling the Dichotomy Between Test and Security — NYU Scholars Skip to main navigation \nSkip to search Skip to main content NYU Scholars Logo Help & FAQ Home Profiles Research \nUnits Research Output Search by expertise, name or affiliation Reconciling the Dichotomy \nBetween Test and Security Ozgur Sinanoglu, Yiorgos Makris, Ramesh Karri Center for Cyber \nSecurity Computer Engineering Electrical Engineering Electrical and Computer Engineering \nResearch output: Contribution to conference › Paper › peer-review Overview Original language \nEnglish (US) State Published - 2013 Event 2013 18th IEEE European Test Symposium, \nETS 2013 - Avignon, France Duration: May 27 2013 → May 30 2013 Other Other 2013 18th \nIEEE European Test Symposium, ETS 2013 Country France City Avignon Period 5/27/13 → \n5/30/13 Cite this APA Standard Harvard Vancouver Author BIBTEX RIS Sinanoglu, O., , Y., '…",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:5qfkUJPXOUwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Reconciling the IC test and security dichotomy",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6569368/",
            "Abstract": "Many of the design companies cannot afford owning and acquiring expensive foundries and hence, go fabless and outsource their design fabrication to foundries that are potentially untrustwrothy. This globalization of Integrated Circuit (IC) design flow has introduced security vulnerabilities. If a design is fabricated in a foundry that is outside the direct control of the (fabless) design house, reverse engineering, malicious circuit modification, and Intellectual Property (IP) piracy are possible. In this tutorial, we elaborate on these and similar hardware security threats by making connections to VLSI testing. We cover design-for-trust techniques, such as logic encryption, aging acceleration attacks, and statistical methods that help identify Trojan'ed and counterfeit ICs.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:eflP2zaiRacC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Yield forecasting across semiconductor fabrication plants and design generations",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7857741/",
            "Abstract": "Yield estimation is an indispensable piece of information at the onset of high-volume production of a device, as it can inform timely process and design refinements in order to achieve high yield, rapid ramp-up, and fast time-to-market. To date, yield estimation is generally performed through simulation-based methods. However, such methods are not only very time-consuming for certain circuit classes, but also limited by the accuracy of the statistical models provided in the process design kits (PDKs). In contrast, herein we introduce yield estimation solutions which rely exclusively on silicon measurements and we apply them toward predicting yield during: 1) production migration from one fabrication facility to another and 2) transition from one design generation to the next. These solutions are applicable to any circuit, regardless of PDK accuracy and transistor-level simulation complexity, and range from rather …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:BUYA1_V_uYcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Gaussian Process-Based Wafer-Level Correlation Modeling and Its Applications",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-04666-8_5",
            "Abstract": "Semiconductor fabrication is one of the most intricate, multistep, human-made processes, taking place every day, producing trillions of transistors every second. The complexity of this manufacturing process naturally introduces variations with every stage affecting the produced devices differently. These variations can be observed at different granularity levels, within every die, across die at wafer level, across lots, and holistically for the entire production. Understanding and addressing such variations is the primary objective for many engineering roles, ranging from designers, to process engineers, and to test engineers. In this chapter, we focus on understanding and modeling wafer-level spatial and spatiotemporal variations through the use of Gaussian processes and we present various real-life applications of such modeling in test cost reduction, quality improvement, and yield learning.",
            "Abstract entirety": 1,
            "Author pub id": "dUO4lKwAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Coping with soft errors in asynchronous burst-mode machines",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4557007/",
            "Abstract": "We discuss the problem of soft errors in asynchronous burst mode machines (ABMMs) and we propose two solutions. The first solution is an error tolerance approach, which leverages the inherent functionality of Muller C-elements, along with a variant of duplication, to suppress all transient errors. The proposed method is more robust and less expensive than the typical Triple Modular Redundancy (TMR) error tolerance method and often even less expensive than previously proposed concurrent error detection (CED) methods, which only provide detection but no correction. The second solution is an error mitigation approach, which leverages a newly devised soft error susceptibility assessment method for ABMMs, along with partial duplication, to suppress a carefully chosen subset of transient errors. Three progressively more powerful options for partial duplication select among individual gates, complete state …",
            "Abstract entirety": 0,
            "Author pub id": "dUO4lKwAAAAJ:7PzlFSSx8tAC",
            "Publisher": "IEEE"
        }
    ]
}]