[{
    "name": "Γεώργιος Κουρουπέτρογλου ",
    "romanize name": "Georgios Kouroupetroglou ",
    "School-Department": "Πληροφορικής και Τηλεπικοινωνιών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 18734,
    "Scholar name": "Georgios Kouroupetroglou",
    "Scholar id": "utmrHCoAAAAJ",
    "Affiliation": "Professor, National and Kapodistrian University of Athens",
    "Citedby": 1665,
    "Interests": [
        "Human Computer Interaction",
        "Voice Interfaces",
        "Digital Accessibility",
        "Speech Processing"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=utmrHCoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Physical Modeling of the Ancient Greek Wind Musical Instrument Aulos: A Double-Reed Exciter Linked to an Acoustic Resonator",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9477590/",
            "Abstract": "We present a simulation method for the auralization of the ancient Greek double-reed wind instrument Aulos. The implementation is based on Digital Signal Processing and physical modeling techniques for the instrument’s two parts: the excitation mechanism and the acoustic resonator with toneholes. Single-reeded instruments are in-depth studied firstly because their excitation mechanism is the one used in a great amount of modern wind-reed instruments and secondly because the physics governing the phenomena is less complicated than the double-reeded instruments. We here provide a detailed model of a system comprised of a double-reed linked to an acoustic resonator with toneholes to sonify Aulos. We validate our results by comparing our method’s synthesized signal with recordings from a replica of Aulos of Poseidonia built in our lab. The comparison showed that the fundamental frequencies and the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:q3CdL3IzO_QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Reverberation and dereverberation effect on Byzantine chants",
            "Publication year": 2013,
            "Publication url": "https://www.aes.org/e-lib/browse.cfm?conv=135&papernum=8977",
            "Abstract": "Byzantine music is typically monophonic and is characterized by (i) prolonged music phrases and (ii) Byzantine scales that often contain intervals smaller than the Western semitone. As happens with most religious music genres, reverberation is a key element of Byzantine music. Byzantine churches/cathedrals are usually characterized by particularly diffuse fields and very long Reverberation Time (RT) values. In the first part of this work, the perceptual effect of long reverberation on Byzantine music excerpts is investigated. Then, a case where Byzantine music is recorded in non-ideal acoustic conditions is considered. In such scenarios, a sound engineer might require to add artificial reverb on the recordings. Here it is suggested that the step of adding extra reverberation can be preceded by a dereverberation processing to suppress the originally recorded non ideal reverberation. Therefore, in the second part of the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:UxriW0iASnsC",
            "Publisher": "Audio Engineering Society"
        },
        {
            "Title": "Special Section on Corpus-Based Speech Technologies-Speech Synthesis and Prosody-Modeling Improved Prosody Generation from High-Level Linguistically Annotated Corpora",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=8228573495661848030&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ldfaerwXgEUC",
            "Publisher": "Tokyo, Japan: Institute of Electronics, Information and Communication Engineers, c1992-"
        },
        {
            "Title": "A framework for language-independent analysis and prosodic feature annotation of text corpora",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87391-4_66",
            "Abstract": "Concept-to-Speech systems include Natural Language Generators that produce linguistically enriched text descriptions which can lead to significantly improved quality of speech synthesis. There are cases, however, where either the generator modules produce pieces of non-analyzed, non-annotated plain text, or such modules are not available at all. Moreover, the language analysis is restricted by the usually limited domain coverage of the generator due to its embedded grammar. This work reports on a language-independent framework basis, linguistic resources and language analysis procedures (word/sentence identification, part-of-speech, prosodic feature annotation) for text annotation/processing for plain or enriched text corpora. It aims to produce an automated XML- annotated enriched prosodic markup for English and Greek texts, for improved synthetic speech. The markup includes information …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Regression modeling of reader’s emotions induced by font based text signals",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39191-0_48",
            "Abstract": "In this work we presented a mathematical model for the readers’ emotional state responses triggered by font style, type and color. It is based on multiple regression analysis of the repeated measures from 45 students and for 35 textual stimuli using the Self-Assessment Manikin test. Based on the dimensional theory of emotions, we propose a model on how emotional dimensions Pleasure, Arousal, and Dominance vary according to the typographic text signals: font style, font type and font/background color combinations. We observe that “Pleasure” dimension is affected negatively by font type (“Arial” and “Times New Roman”) and positively by color brightness difference of font/background color combinations. “Arousal” and “Dominance” are affected only by color brightness difference (negative correlation). According to the proposed model, font type “Arial” elicits more pleasant emotional state than “Times …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Gesture and Sign Language in Human-Computer Interaction and Embodied Communication: 9th International Gesture Workshop, GW 2011, Athens, Greece, May 25-27, 2011, Revised Selected Papers",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=T866BQAAQBAJ&oi=fnd&pg=PP2&dq=info:O_N7npy8DggJ:scholar.google.com&ots=Q1QqQBacjq&sig=f4gOCMZo47fG12W66CgaJH_lkKg",
            "Abstract": "This book constitutes revised selected papers from the 9th International Gesture Workshop, GW 2011, held in Athens, Greece, in May 2011. The 24 papers presented were carefully reviewed and selected from 35 submissions. They are ordered in five sections named: human computer interaction; cognitive processes; notation systems and animation; gestures and signs: linguistic analysis and tools; and gestures and speech.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:GnPB-g6toBAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Language Resources and Evaluation for the Support of the Greek Language in the MARY Text-to-Speech",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-10816-2_63",
            "Abstract": "The paper outlines the process of creating a new voice in the MARY Text-to-Speech Platform, evaluating and proposing extensions on the existing tools and methodology. It particularly focuses on the development of the phoneme set, the Grapheme to Phone (GtP) conversion module and the subsequent process for generating a corpus for building the new voice. The work presented in this paper was carried out as part of the process for the support of the Greek Language in the MARY TtS system, however the outlined methodology should be applicable for other languages as well.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Real-Time Control of Greek Chant Synthesis",
            "Publication year": 2006,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-03013690/",
            "Abstract": "This paper we report on an interdisciplinary project for modeling Greek chant with real-time vocal synthesis. Building on previous research, we employ a hybrid musical instrument: Phonodeon (Georgaki et al. 2005), consisting of a MIDI-accordeon coupled to a real-time algorithmic interaction and vocal synthesis engine. The synthesis is based on data provided by the AOIDOS program developed in the Department of the Computer science of the University of Athens, investigating Greek liturgical chant compared to bel canto singing. Phonodeon controls expressive vocal synthesis models based on formant synthesis and concatenated filtered samples. Its bellows serve as hardware control device that is physically analogous to the human breathing mechanism [georgaki, 1998a], while the buttons of the right hand can serve multiple functions. On the level of pitch structure, this paper focuses on a particular aspect of control, namely that of playing in the traditional non-tempered and flexible interval structure of Greek modes (ήχοι: echoi) while using the 12-semitone piano-type keyboard of the left hand. This enables the musical exploration of the relationship between the spectral structure of the vocal timbre of Greek chant and characteristic intervals occuring in the modal structure of the chant. To implement that, we developed techniques for superimposing interval patterns of the modes on the keyboard of the phonodeon. The work is the first comprehensive interactive model of antique, medieval and modern near-eastern tunings. The techniques developed can be combined with techniques for other control aspects, such as timbre and vocal expression …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:blknAaTinKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "EAR-math: evaluation of audio rendered mathematics",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07440-5_11",
            "Abstract": "Audio rendering of mathematical expressions has accessibility benefits for people with visual impairment. Seeking a systematic way to measure participants’ perception of the rendered formulae with audio cues, we investigate the design of performance metrics to capture the distance between reference and perceived math expressions. We propose EAR-Math, a methodological approach for user-based evaluation of math rendering against a baseline. EAR-Math measures systems’ performance using three fine-grained error rates based on the structural elements, arithmetic operators, numbers and identifiers in a formula. The proposed methodology and metrics were successfully applied in a pilot study, where 5 sighted and 2 blind participants evaluated 39 stimuli rendered by MathPlayer in Greek. In the obtained results, we observed that structural elements had the highest mean and variance of errors …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:WbkHhVStYXYC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Art Karshmer Lectures in Access to Mathematics, Science and Engineering",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-94277-3_87",
            "Abstract": "Access to mathematical expressions have always been a particular problem for blind and partially sighted people, and more widely persons with a print disability, including those with dyscalculi, dyslexia, dyspraxia and other perception or processing disorders. This has a distinct negative effect in terms of careers possibilities for print disabled people, since it excludes them not only from mathematical studies, but from all fields that require mathematical knowledge, including all scientific areas as well as areas using statistics. Since a couple of decades many researches have been carried out to provide assistive tools that help visually impaired people to overcome this challenge. This session, created 16 years ago by Art Karshmer, includes in ICCHP 2018 eight full and four short interesting and novel relative papers.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ipzZ9siozwsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Auditory discriminations of typographic attributes of documents by students with blindness",
            "Publication year": 2009,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0264619609106360",
            "Abstract": "The general purpose of the present study was to test the effectiveness of various psycho-acoustic manipulations for the understanding of specific information (typographic attributes such as bold and italic) which was included in texts by individuals with and without blindness. Thirty blind and thirty sighted students participated and were asked to distinguish a number of controlled conditions of auditory components, as well as to express their preferences and opinions on the prosody of the selected acoustic features (pitch, volume and speed of the synthetic speech). Findings indicated that there were significant interactions between groups and experimental conditions across variables. The outcomes of the present study provided a rough assessment of the auditory means that may be conducive to the understanding of the specific typographic attributes. Based on these findings Text-to-Speech systems can deliver such …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:dhFuZR0502QC",
            "Publisher": "Sage Publications"
        },
        {
            "Title": "Tactile identification of embossed lines and square areas in diverse dot heights by blind individuals",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-020-00729-4",
            "Abstract": "Most of the braille embossers incorporate a mode for the creation of braille embossed graphics (BEG). Some of them can produce dots in different elevations, but also various dot densities. Dot elevation and dot density constitute the main variables that dominate the identification and conceptualization by blind users of tactile elements, such as lines and areas, in BEG. Nevertheless, there are not enough published research data in this domain. We present the results of a study with 30 congenitally blind participants to examine their detection performance in tactile identification of context-free embossed lines and square areas in eight dot elevations H1 to H8 (from 0.03 to 0.47 mm) and two dot densities (10 and 20 dpi). The detection accuracy and response time of the matching task were examined for each type of test stimuli. The results of correct and misclassified stimuli are presented in confusion matrixes, along with …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:tYavs44e6CUC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Design and developing methodology for 8-dot braille code systems",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39194-1_39",
            "Abstract": "Braille code, employing six embossed dots evenly arranged in rectangular letter spaces or cells, constitutes the dominant touch reading or typing system for the blind. Limited to 63 possible dot combinations per cell, there are a number of application examples, such as mathematics and sciences, and assistive technologies, such as braille displays, in which the 6-dot cell braille is extended to 8-dot. This work proposes a language-independent methodology for the systematic development of an 8-dot braille code. Moreover, a set of design principles is introduced that focuses on: achieving an abbreviated representation of the supported symbols, retaining connectivity with the 6-dot representation, preserving similarity on the transition rules applied in other languages, removing ambiguities, and considering future extensions. The proposed methodology was successfully applied in the development of an 8-dot …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Using the CORDIS-ANIMA Formalism for the Physical Modeling of the Greek Zournas Shawn",
            "Publication year": 2008,
            "Publication url": "https://hal.archives-ouvertes.fr/hal-00437867/",
            "Abstract": "We propose a numerical simulation for the physical model of the zournas, a Greek traditional double-reed woodwind musical instrument, following the mass-interaction CORDIS-ANIMA formalism. The functional components of the instrument are implemented using original CORDIS-ANIMA modules, while special attention has been given to the flow characteristics of the reed.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ns9cj8rnVeAC",
            "Publisher": "MPublishing"
        },
        {
            "Title": "Brain computer interface cursor measures for motion-impaired and able-bodied users",
            "Publication year": 2003,
            "Publication url": "http://speech.di.uoa.gr/sppages/spppdf/Final%20BCI%20HCII2003%20_web_.pdf",
            "Abstract": "This paper presents the results of experimental studies that aim to measure the effectiveness of a Brain Computer Interface (BCI) against a mouse on “point and click” tasks performed by ablebodied and upper-limp motion-impaired users. Our methodology is based on the ISO 9241-9 guidelines. We examine how Fitts’ law fits the tested input devices, and we use gross and detailed trajectory measures in order to quantify cursor movement and evaluate performance. We conclude that Fitts’ law can only describe able-bodied users’ performance when selecting targets with the mouse. On the other hand, the performance of both user groups with the BCI, and of motionimpaired users with the mouse does not conform to Fitts’ law. Tables and charts of results are given, showing that the BCI cannot currently compete with the mouse in terms of usability, but can be used as an alternative for motion actuated devices when no other solution is possible.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:qjMakFHDy7sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Including Students with Disabilities in Distance Education",
            "Publication year": 2020,
            "Publication url": "https://www.researchgate.net/profile/Vanessa-Heitplatz/publication/344348353_Implementing_New_Technological_Devices_in_Social_Services_Introducing_the_miTAS_Project/links/5f6ad9f1458515b7cf46ef3d/Implementing-New-Technological-Devices-in-Social-Services-Introducing-the-miTAS-Project.pdf#page=161",
            "Abstract": "The aim of the project InSIDE is to develop accessible distance education (DE) programmes for individuals with disabilities (visual, hearing, or mobility/physical impairments). The overall objectives of the project are to: a) develop new and innovative, accessible and inclusive DE programmes improving the quality of Higher Education (HE) for individuals with disabilities and offering flexible learning and virtual mobility, b) build capacity and professional development in administrative and teaching staff in developing and carrying out accessible and inclusive DE programmes, and operating the accessibility offices, and c) involve individuals with disabilities in a user-center design so that accessibility and usability are achieved in conjunction, and the links between education and society are strengthened.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:tuHXwOkdijsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Principles of Electronic Speech Processing with Applications for People with Disabilities",
            "Publication year": 2008,
            "Publication url": "https://content.iospress.com/articles/technology-and-disability/tad00249",
            "Abstract": "In the first part of this paper the principles and the state of the art of speech processing, and especially speech synthesis and recognition, are explained. Then, a speech-based human-computer dialogue system is discussed. The next section gives a brief overview of the available recommendations, guidelines and standards that are directly related with the application of speech technologies. The last part of the paper is dedicated to applications of speech technology for the disabled. The main focus is on blind and partially sighted people and those with hearing loss. Concerning the blind, many multilingual text-to-speech synthesis systems exist, and some polyglot ones, that can convert printed and electronic documents to audio, but further research is needed for structured text, tables and above all graphics to be efficiently transformed into speech. For the deaf persons, there are still big challenges in the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:kuK5TVdYjLIC",
            "Publisher": "IOS press"
        },
        {
            "Title": "Prosodic mapping of text font based on the dimensional theory of emotions: a case study on style and size",
            "Publication year": 2016,
            "Publication url": "https://asmp-eurasipjournals.springeropen.com/articles/10.1186/s13636-016-0087-8",
            "Abstract": "Current text-to-speech systems do not support the effective provision of the semantics and the cognitive aspects of the documents’ typographic cues (e.g., font type, style, and size). A novel approach is introduced for the acoustic rendition of text font based on the emotional analogy between the visual (text font cues) and the acoustic (speech prosody) modalities. The methodology is based on: a) modeling reader’s emotional state response (“Pleasure”, “Arousal” and “Dominance”) induced by the document’s font cues and b) the acoustic mapping of the emotional state using expressive speech synthesis. A case study was conducted for the proposed methodology by calculating the prosodic values on specific font cues (several font styles and font sizes) and by examining listeners’ preferences on the acoustic rendition of bold, italics, bold-italics, and various font sizes. The experimental results after the user evaluation indicate that the acoustic rendition of font size variations as well as bold and italics is recognized successfully, but bold-italics are confused with bold, due to the similarities of their prosodic variations.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:5awf1xo2G04C",
            "Publisher": "SpringerOpen"
        },
        {
            "Title": "Artificial neural network modeling of relative humidity and air temperature spatial and temporal distributions over complex terrains",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-12610-4_11",
            "Abstract": "In this work we present a methodological approach of applying Artificial Neural Networks (ANN) for modeling of both the air temperature (AT) and relative humidity (RH) spatial and temporal distributions over complex terrains. A number of implementation issues are discussed, along with their relative advantages and limitations. Moreover, after the introduction of a set of metrics, the accuracy of the evaluation of ANN based spatial and time series AT and RH modeling in the case of a specific region is examined, by applying a number of alternative feed forward ANN topologies. The Levenberg-Marquardt back propagation algorithm was used for the ANNs training in the temporal forecasting of AT and RH, with the optimum architecture being the one that minimizes the Mean Absolute Error on the validation set. The Radial Basis Function and the Multilayer Perceptrons non-linear Feed Forward ANNs schemes …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Usability methodologies for spoken dialogue Web interfaces",
            "Publication year": 2010,
            "Publication url": "https://www.igi-global.com/chapter/usability-methodologies-spoken-dialogue-web/40497",
            "Abstract": "This chapter presents the state-of-the-art in usability issues and methodologies for spoken dialogue web interfaces along with the appropriate designer-needs analysis. It is planned to unfold a theoretical perspective to the usability methodology and provide a framework description for creating and testing usable content and applications for conversational interfaces. Main concerns include the problem identification of design issues for usability design and evaluation, the use of customer experience for the design of voice-web interfaces and dialogue, and the problems that arise from real-life deployment. Moreover, it discusses the hands-on approaches for applying usability methodologies in a spoken dialogue web application environment, including methodological and design issues, resource management, implementation using existing technologies for usability evaluation in several stages of the design and …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:pyW8ca7W8N0C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Gestures in Embodied Communication and Human–",
            "Publication year": 2011,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.221.1232&rep=rep1&type=pdf",
            "Abstract": "We present two studies to comparatively evaluate the performance of gesture-based 2D and 3D pointing tasks. In both of them, a Wiimote controller and a standard mouse were used by six participants. For the 3D experiments we introduce a configuration analogous to the ISO 9241-9 standard methodology. We examine the pointing devices’ conformance to Fitts’ law, and we measure some extra parameters that describe more accurately the cursor movement trajectory.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:g5m5HwL7SMYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Prosodically Enriched Text Annotation for High Quality Speech Synthesis",
            "Publication year": 2005,
            "Publication url": "https://www.ellogon.org/petasis/bibliography/SPECOM2005/Specom-2005_submitted_2005_06_27.pdf",
            "Abstract": "Linguistically enriched text generated from natural language modules contributes significantly on the quality of speech synthesis. For all cases where such modules are not available, such enriched input needs to be produced from plain text in order to maintain quality. This work reports on a framework of several combined language resources and procedures (word/sentence identification, syntactic analysis, prosodic feature annotation) for text annotation/processing from plain text. Using that, the implementation of an automatic XML formatted output generation module produces the prosodically enriched markup.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:JV2RwH3_ST0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the Identification and Annotation of Emotional Properties of Verbs",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41033-8_75",
            "Abstract": "Adequate and reliable lexical resources are essential for effective sentiment analysis and opinion mining. This paper proposes a methodology for the emotional assessment and annotation of words. The process is based on the Self Assessment Manikin test, and is coupled with two psychometric measurements for identifying possible bias due to the annotator’s psychological condition and personality: the EPQ scale and the SCL-90-R scale. A web based tool was developed to support the process. The methodology was validated through a pilot study in which 10 participants were asked to assess the emotional state elicited by each of 75 verbs that were used as stimuli. Results are compared with SentiWordNet’s emotional scoring on respective verbs, and primarily show logical continuity and consistency.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A new generation of communication aids under the ULYSSES component-based framework",
            "Publication year": 2002,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/638249.638289",
            "Abstract": "In this paper, we introduce a new generation of computer-based communication aids, designed and developed using state of the art software engineering models and architectures. The communicators we present are based on a component-based framework called ULYSSES that aims to simplify the integration of multi-vendor components into low cost products and maximizes modularity and reusability. Following the ULYSSES approach, one can build up powerful and reliable applications, adaptable to various user needs and requirements. For developers of AAC components, ULYSSES provides an engineering-for-reuse environment with guidelines and tools to build software modules, which can operate effectively and interact with each other transparently, without even being aware of each other's existence. Furthermore, ULYSSES grants a process of engineering-with-reuse for AAC system integrators for the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:4DMP91E08xMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Enabling Access for Persons with Visual Impairment",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/273521929_Enabling_Access_for_Persons_with_Visual_Impairment/links/550544330cf24cee3a040618/Enabling-Access-for-Persons-with-Visual-Impairment.pdf",
            "Abstract": "Enabling Access for Persons with Visual Impairment Georgios Kouroupetroglou (Ed.) \nEnabling Access for Persons with Visual Impairment Proceedings of the International \nConference ICEAPVI Athens, Greece, February 12-14, 2015 National and Kapodistrian \nUniversity of Athens Department of Informatics and Telecommunications Speech and \nAccessibility Laboratory International Council for Education and Rehabilitation of People \nwith Visual Impairment-Europe Region Page 2 Page 3 Georgios Kouroupetroglou (Ed.) \nEnabling Access for Persons with Visual Impairment Proceedings of the International \nConference ICEAPVI February 12-14, 2015, Athens, Greece http://access. uoa. gr/ICEAPVI-2015/ \nOrganized by: National and Kapodistrian University of Athens Department of Informatics \nand Telecommunications Speech and Accessibility Laboratory Co-orginized by: \nInternational Council for Education and of People -4 :…",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:yB1At4FlUx8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing accessible user interfaces of multi-vendor components under the ULYSSES framework for interpersonal communication applications",
            "Publication year": 2001,
            "Publication url": "https://www.academia.edu/download/30918782/hci-2001.pdf",
            "Abstract": "In this paper we present a novel approach, under the ULYSSES framework, to cope with accessible user interface management issues that arouse during the design, installation and maintenance of independently developed prefabricated software parts derived from multiple vendors and each one having its own GUI. ULYSSES constitutes a software engineering framework that facilitates Component Based Development for the domain of Computer Mediated Interpersonal Communication systems. Technical guidelines are provided for both component developers and system integrators.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:Se3iqnhoufwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DAMASKINOS: The prototype corpus of Greek Orthodox ecclesiastical chant voices",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/39772002/DAMASKINOS_The_Prototype_Corpus_of_Greek20151107-23475-17wua1p.pdf",
            "Abstract": "This work describes the design and implementation of the DAMASKINOS chanting voices corpus that includes a representative number of Greek Orthodox Ecclesiastical Music (GOEM) styles. The essential characteristic of DAMASKINOS is the fact that it is not based on preexisting chanting performances or on recordings under nonidentical conditions. What makes this collection unique is that DAMASKINOS relies on rigorous design requirements and strict implementation specifications. Following specific criteria, twenty famous professional psaltes (chanters) from different parts of Greece were selected. They were invited to chant the same set of selected Byzantine troparia (hymns) of papadikon, sticherarikon and eirmologikon melodic forms in all the eight modes of GOEM. Their voices were digitally recorded under the same well-controlled conditions. Both the sound-pressure (microphonic) and the synchronized ElectroGlottoGraphic (EGG) signals were captures and digitized. Moreover, the recordings include: a) chanting of exercises in GOEM scales in each Byzantine mode and b) reading-aloud the texts of chanted hymns (ie a type of ecclesiastical speech). In some cases the recordings include aerophone measurements in order to collect additional information, such as subglottic pressure and glottal airflow. By applying a semi-automatic methodology, the recorded signals of the DAMASKINOS corpus were synchronized with additional tagging meta-data in five levels: a) musical syllable boundaries, b) characters of musical notation, c) notation-based (expected) pitch, d) real (performed) pitch and e) transcription of chanted voice. In the paper we …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A score-to-singing voice synthesis system for the greek language",
            "Publication year": 2007,
            "Publication url": "https://www.academia.edu/download/61942578/ICMC07.pdf",
            "Abstract": "In this paper, we examine the possibility of generating Greek singing voice with the MBROLA synthesizer, by making use of an already existing diphone database. Our goal is to implement a score-to-singing synthesis system, where the score is written in a score editor and saved in the midi format. However, MBROLA accepts phonetic files as input rather than midi ones and because of this, we construct a midi-file to phonetic-file converter, which applies irrespective of the underlying language. The evaluation of the Greek singing voice synthesis system is achieved through a psycho acoustic experiment. The thirty participants are given two samples and are asked to evaluate them according to vocalness, naturalness, intelligibility and expressivity, in a 1-5 scale MOS test. The results are encouraging, with naturalness and expressivity being ranked above 2.5 in average. Thereafter, we create a new diphone database …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:wbdj-CoPYUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Optimal Acoustic Reverberation Evaluation of Byzantine Chants in Churches",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/sppages/spppdf/Kouroupetroglou%20et%20al%20-%20Optimal%20Acoustic%20Reverberation%20Evaluation%20of%20Byzantine%20Chants%20in%20Churches.pdf",
            "Abstract": "Η Βυζαντινή ψαλτική είναι τυπικά μονοφωνική φωνητική μουσική που χαρακτηρίζεται αφενός από μουσικές φράσεις μακράς διάρκειας και αφετέρου από κλίμακες, οι οποίες συχνά περιέχουν διαστήματα μικρότερα από το ημιτόνιο που εμφανίζεται στη δυτική μουσική. Οι Βυζαντινοί ναοί χαρακτηρίζονται συνήθως από ιδιαιτέρως διάχυτα πεδίο και εξαιρετικά μεγάλες τιμές του χρόνου αντήχησης. Έτσι, η ακουστική αντήχηση του ναού αποτελεί αδιάσπαστο στοιχείο του ακουστικού χαρακτήρα των Βυζαντινών ψαλμών. Σε αυτή την εργασία, διερευνάται η αντιληπτική προτίμηση των χαρακτηριστικών της αντήχησης σε Βυζαντινά ψαλτικά αποσπάσματα. Εξομοιώνονται καταστάσεις αντήχησης σε τυπικούς ναούς με διαφορετικό εσωτερικό όγκο, χρόνο αντήχησης και απόσταση πηγής (ψάλτη)/δέκτη (ακροατή), χρησιμοποιώντας τη συλλογή «Δαμασκηνός». Τα αποτελέσματα προέκυψαν από πειράματα 7ακρόασης με χρήση της στατιστικής μεθόδου αξιολόγησης της προτίμησης σε ομάδα από 15 ακροατές. Τα αποτελέσματα αναδεικνύουν την προτίμηση αποδοχής των ακροατών σε σχέση με την καταλληλότητα διαφόρων παραμέτρων ή και συνδυασμών παραμέτρων της αντήχησης, όπως π. χ. η τιμή του χρόνου αντήχησης σε σχέση με τις διαστάσεις ή και τη θέση ακρόασης μέσα στο ναό.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:J-pR_7NvFogC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Synthetic and natural speech intelligibility in individuals with visual impairments: Effects of experience and presentation rate",
            "Publication year": 2013,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-304-9-695",
            "Abstract": "The present study aims to compare the intelligibility of words produced in natural and synthetic speech both with normal and fast speaking rate. The effect of several individual parameters on the intelligibility of synthetic speech was also investigated. Thirty adults with visual impairment took part in the research. The experimental design consisted of two parts: a structured interview and a psychoacoustic test. The interviews were focused on the participants' demographic data experience in using synthetic speech. The results indicated that participants performed more accurately in recognizing words presented in normal speaking rate than in a fast rate. Moreover, the results indicated that the differences between synthetic and natural speech were statistically significant.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:SP6oXDckpogC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A comparative accessibility evaluation of the 100 best worldwide higher education Computer Science Departments' web sites",
            "Publication year": 2018,
            "Publication url": "https://dialnet.unirioja.es/servlet/articulo?codigo=7363751",
            "Abstract": "A comparative accessibility evaluation of the 100 best worldwide higher education Computer \nScience Departments' web sites - Dialnet Ayuda ¿En qué podemos ayudarle? × Buscar en la \nayuda Buscar Consultar la ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar \nConsultar la ayuda Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda A \ncomparative accessibility evaluation of the 100 best worldwide higher education Computer \nScience Departments' web sites Autores: Georgios Kouroupetroglou, P. Riga, C. Oikonomidis, E. \nPanagiotopoulou, P. Yannakopoulos Localización: Edulearn 18. 10th International Conference \non Education and New Learning Technology: (Palma, 2nd-4th of July, 2018). Conference \nproceedings / Luis Gómez Chova ( ed. lit. ), A. López Martínez ( ed. lit. ), I. Candel Torres ( ed. \nlit. ), 2018, ISBN 978-84-09-02709-5, págs. 3112-3120 Idioma: inglés Enlaces Texto Libro ¿I…",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:ILKRHgRFtOwC",
            "Publisher": "IATED Academy"
        },
        {
            "Title": "Resource Evaluation for Usable Speech Interfaces: Utilizing Human-Human Dialogue.",
            "Publication year": 2012,
            "Publication url": "https://www.academia.edu/download/31044537/977_Paper.pdf",
            "Abstract": "Human-human spoken dialogues are considered an important tool for effective speech interface design and are often used for stochastic model training in speech based applications. However, the less restricted nature of human-human interaction compared to human-system interaction may undermine the usefulness of such corpora for creating effective and usable interfaces. In this respect, this work examines the differences between corpora collected from human-human interaction and corpora collected from actual system use, in order to formally assess the appropriateness of the former for both the design and implementation of spoken dialogue systems. Comparison results show that there are significant differences with respect to vocabulary, sentence structure and speech recognition success rate among others. Nevertheless, compared to other available tools and techniques, human-human dialogues may still be used as a temporary at least solution for building more effective working systems. Accordingly, ways to better utilize such resources are presented.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Environmental information for inclusion in orientation and mobility maps, identified by travelers with blindness: The cases of city centers and neighborhoods/residential areas",
            "Publication year": 2020,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0264619620913895",
            "Abstract": "The aim of this study is to investigate the user requirements of individuals with blindness regarding the information to be mapped on audio-tactile maps of city centers and neighborhoods/residential areas. Beyond that specific scope, this study aims at covering a wider research gap. That is, the investigation of the usefulness that individuals with blindness attribute to different spatial information (items) of differentiated environments: city centers and neighborhoods/residential areas. A total of 115 adults with blindness took part in the research. Participants came from four countries: Greece, Cyprus, Turkey, and Germany. The researchers listed 222 pieces of information concerning city centers and 226 pieces concerning neighborhoods/residential areas and address them in survey by conducting two respective questionnaires. Participants were asked to evaluate the information regarding the usefulness of the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:vbGhcppDl1QC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "The mATHENA inventory for free mobile assistive technology applications",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-26138-6_56",
            "Abstract": "The entry of smartphones and tablets in the market yields new opportunities in the domain of Assistive Technology (AT) for persons with disabilities. The search process for mobile AT applications that fulfill specific user needs is not an easy task for the end-users, their facilitators as well as the professionals in the area of rehabilitation. Even, when they finally find what they are looking for, a number of questions are raised relative to the reliability, stability, compatibility and functionality of the AT applications. These questions can be answered safely only by a team of AT experts. In this work we present the methodological approach for the design and development of the mATHENA web-based inventory, which aims to make the search and selection of free mobile AT applications simple and sound. This methodology is based on the consistent and well-documented presentation of the information for each mobile …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:PELIpwtuRlgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Modeling prosodic structures in linguistically enriched environments",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-30120-2_66",
            "Abstract": "A significant challenge in Text-to-Speech (TtS) synthesis is the formulation of the prosodic structures (phrase breaks, pitch accents, phrase accents and boundary tones) of utterances. The prediction of these elements robustly relies on the accuracy and the quality of error-prone linguistic procedures, such as the identification of the part-of-speech and the syntactic tree. Additional linguistic factors, such as rhetorical relations, improve the naturalness of the prosody, but are hard to extract from plain texts. In this work, we are proposing a method to generate enhanced prosodic events for TtS by utilizing accurate, error-free and high-level linguistic information. We are also presenting an appropriate XML annotation scheme to encode syntax, grammar, new or given information, phrase subject/object information, as well as rhetorical elements. These linguistically enriched has have been utilized to build realistic …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An open machine translation system for augmentative and alternative communication",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/30918784/LNCS2002.pdf",
            "Abstract": "In this paper we describe the characteristics of an open system we designed and implemented that adds Machine Translation (MT) capabilities into Augmentative and Alternative Communication (AAC) applications. In particular, we present the basis for an open MT framework that can easily integrate with component-based developments especially regarding interpersonal communication and information presentation, either in standalone or web-based applications. We concentrate on the system’s core, an expandable database of multimedia elements, which offers uniform management of multiple representations of concepts in both natural languages and symbolic communication systems, allowing concept-by-concept omnidirectional translation. Applications of the system are also presented, along with brief pointers on current work for possible extensions and improvements.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:xtoqd-5pKcoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "8-dot braille code for complex Nemeth symbols",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/273521776_8-dot_Braille_Code_for_Complex_Nemeth_Symbols/links/550545810cf24cee3a040974/8-dot-Braille-Code-for-Complex-Nemeth-Symbols.pdf",
            "Abstract": "The aim of the present study was to specify transition rules from the 6-dot to the 8-dot braille code regarding advanced mathematical and scientific notation as they are determined in the Nemeth braille code. A generic design methodology was used to transform 6-dot braille scientific characters into 8-dot braille code for a specific set of scientific symbols. In total, 24 rules were developed and used to transcribe the “modifiers” as they are described in the Nemeth code (ie symbols that appear directly over or directly under another symbol, such as the small arrow sometimes used above a letter that represents a vector). The results indicated that the specific method has the potential to claim generalization in terms of validity and reliability by implementing stages of modification, debugging, coherence and consistency.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:NJ774b8OgUMC",
            "Publisher": "Athens"
        },
        {
            "Title": "Patterns of blind users’ hand movements",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-08596-8_12",
            "Abstract": "The main focus of the present study lies on patterns and characteristics of hand movements when participants with blindness receive typographic meta-data (bold and italic) by touch through a braille display. Patterns and characteristics were investigated by the use of six-dot braille and eight-dot braille code in conjunction with types of reading errors. The results depicted that the participants’ reading errors (phonological type) were similar in both braille codes. In addition, the participants performed more fluid hand movements when they used the six-dot braille code, whereas they spent less time when they were reading through eight-dot braille. The focus of the discussion was placed on the importance of the development of a suitable design of tactile rendition of typographic signals through six or eight-dot braille code in favor of better perception and comprehension.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:08ZZubdj9fEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Experimental evaluation of tree-based algorithms for intonational breaks representation",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11551874_43",
            "Abstract": "The prosodic specification of an utterance to be spoken by a Text-to-Speech synthesis system can be devised in break indices, pitch accents and boundary tones. In particular, the identification of break indices formulates the intonational phrase breaks that affect all the forthcoming prosody-related procedures. In the present paper we use tree-structured predictors, and specifically the commonly used in similar tasks CART and the introduced C4.5 one, to cope with the task of break placement in the presence of shallow textual features. We have utilized two 500-utterance prosodic corpora offered by two Greek universities in order to compare the machine learning approaches and to argue on the robustness they offer for Greek break modeling. The evaluation of the resulted models revealed that both approaches were positively compared with similar works published for other languages, while the C4.5 method …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:IWHjjKOFINEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Musical Instrument Recognition and Classification Using Time Encoded Signal Processing and",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=7366543830606108186&hl=en&oi=scholarr",
            "Abstract": "Traditionally, musical instrument recognition is mainly based on fre-quency domain analysis (sinusoidal analysis, cepstral coefficients) and shape analysis to extract a set of various features. Instruments are usually classified using k-NN classifiers, HMM, Kohonen SOM and Neural Networks. In this work, we describe a system for the recognition of musical instruments from iso-lated notes. We are introducing the use of a Time Encoded Signal Processing method to produce simple matrices from complex sound waveforms, for in-strument note encoding and recognition. These matrices are presented to a Fast Artificial Neural Network (FANN) to perform instrument recognition with promising results in organ classification and reduced computational cost. The evaluation material consists of 470 tones from 19 musical instruments synthe-sized with 5 wide used synthesizers (Microsoft Synth, Creative SB Live! Synth, Yamaha VL-70m Tone Generator, Edirol Soft-Synth, Kontakt Player) and 84 isolated notes from 20 western orchestral instruments (Iowa University",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ruyezt5ZtCIC",
            "Publisher": "Springer"
        },
        {
            "Title": "UDLnet: A framework for addressing learner variability",
            "Publication year": 2014,
            "Publication url": "http://www.uld-conference.org/files_of_downloads/2014/ULD2014_Proceedings.pdf#page=83",
            "Abstract": "[1] Ellinogermaniki Agogi, Athens, Greece [2] Speech and Accessibility Lab., Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Greece [3] Universal Learning Systems, Dublin, Ireland✉ kriviou@ ea. gr, koupe@ di. uoa. gr, abruce@ ulsystems. com",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:8AbLer7MMksC",
            "Publisher": "Unknown"
        },
        {
            "Title": "DocEmoX: a system for the typography-derived emotional annotation of documents",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02713-0_58",
            "Abstract": "This work presents the design and implementation of the DocEmoX system for the automated typography-derived emotional extraction and annotation of printed and electronic documents. The DocEmoX system targets the Design-for-All based multimodal accessibility of documents. The methodology is based on the results derived from a number of readers’ emotional state response experiments that model the mapping of any combination of typographic elements into specific analogous variations of the three emotional dimensions (Valence/Pleasure, Arousal and Potency/ Dominance) using a set of Emotional Rules. DocEmoX implements these Emotional Rules in XSL format and produces the annotated output document following the ODF standard and the W3C EmotionML recommendations.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Hand dexterity assessment based on mouse pointer trajectory measurements in children with learning disabilities",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-020-00718-7",
            "Abstract": "We present an investigation of the systematic differences in upper limb motor skills between children with learning disabilities (LDs) and children without LDs. The study comprised point-and-click experiments, one-dimensional (1D), and two-dimensional (2D), conducted with mouse and joystick. Eighty (80) children with LDs and forty-six (46) children without LDs participated in the experiments. We utilized our input device evaluation application (IDEA) system to track the mouse pointer and calculate ten trajectory parameters: movement time, index of difficulty, throughput, movement variability, missed clicks, movement direction change, target re-entry, movement offset, task axis crossing, and movement error. The statistical analysis of the mouse pointer trajectory parameters using the hierarchical logistic regression model detected the children with LDs with a 70% success rate in the 2D experiment with the mouse.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:EYYDruWGBe4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Modelling emphatic events from non-speech aware documents in speech based user interfaces",
            "Publication year": 2003,
            "Publication url": "https://spiliotopoulos.org/publications/Xydas%20et%20al.%20-%202003%20-%20Modelling%20Emphatic%20Events%20from%20Non-Speech%20Aware%20Documents%20in%20Speech%20Based%20User%20Interfaces.pdf",
            "Abstract": "Most of the every day documents we come across have been composed without any information of how to be rendered in a speech-based user interface. As a result, visual formations that might imply emphasis are being ignored by Text-to-Speech systems or text-adapting applications (screen readers) and furthermore, complex structures, such as tables, are usually being vocalized in a rough linearized form, which leads to a confusing provision of information. In this work we accommodate both cases, by altering segments of emphasis in the content text, leaving a prosodic space for the vocalization of meta-information as well. We present a model for locating emphatic events and assigning to them a custom prosodic behaviour. Events are being divided in implicit and explicit ones. We concluded that the latter requires insertions of text to the linear form of structures in order to be properly realized. A script-based framework (e-TSA Composer) that supports the manipulation of prosodic elements in response of specific meta-information has been used. Finally, a model of table vocalization using our approach shows the significant improvement of the information provision compared to commercial applications.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Bayesian network approach to semantic labelling of text formatting in XML corpora of documents",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73283-9_34",
            "Abstract": "The wide-spread applications of document digitization have lead to the use of structured digital representation methods such as the XML language. Extraction methodologies for the formatting metadata can be used on such structured documents for enhancing their accessibility, including augmented audio representation of documents. To the best of our knowledge, an effort has yet to be made to produce an automatic extraction system of semantic information of the document formatting, solely from document layout, without the use of natural language processing. In this study a corpus of XML representations of several issues of a Greek newspaper is used in order to create and evaluate a semantic classifier of text formatting, based on Bayesian Networks.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Multimodal accessibility of documents",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=gCShDwAAQBAJ&oi=fnd&pg=PA451&dq=info:UXPpgz7cV2sJ:scholar.google.com&ots=Z8399EqJzu&sig=Ejg4XORBzq8O5-s6q468F6heaNE",
            "Abstract": "Traditionally a “document” was considered as a textual record. Schamber (1996) defined document as a unit “consisting of dynamic, flexible, nonlinear content, represented as a set of linked information items, stored in one or more physical media or networked sited; created and used by one or more individuals in the facilitation of some process or project”. Buckland (1997) tries to answer the question “what is a document?” through a discussion on how far the meaning of “document” can be pushed and which are the limits of “documentation”. The evolution of Computer Science and Information Technology created a new perspective for the word “document”. The concept “electronic documents” can be differentiated from the “printed documents” having specific characteristics (Schamber, 1996): easily manipulabable, internally and externally linkable, readily transformable, inherently searchable, instantly transportable and infinitely replicable. The term document used in this chapter refers to all kind of printed or electronic documentation the content of which is most text, like newspapers, books, journals, magazines, educational material, letters, brochures, leaflets, etc. A document contains elements that arrange content in the page or even in the document itself. For example, the title of a chapter can be recognized by placing it on the top of the page and in larger font size than the body of text. Also, page indexing at the end of a document links the reader to specific part of the document. The document functionality can be distinguished into browsing, searching, navigation and reading (Doermann et al., 1998). Additional concepts related to document’s …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:aqlVkmm33-oC",
            "Publisher": "I-Tech Education and Publishing"
        },
        {
            "Title": "ITHACA: An open source framework for building component-based augmentative and alternative communication applications",
            "Publication year": 2010,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1786774.1786775",
            "Abstract": "As an answer to the disabled community’s odyssey to gain access to adaptable, modular, multilingual, cheap and sustainable Augmentative and Alternative Communication (AAC) products, we propose the use of the ITHACA framework. It is a software environment for building component-based AAC applications, grounded on the Design for All principles and a hybrid---community and commercial---Open Source development model. ITHACA addresses the developers, the vendors, as well as the people who use AAC. We introduce a new viewpoint on the AAC product design-develop-distribute lifecycle, and a novel way to search-select-modify-maintain the AAC aid. ITHACA provides programmers with a set of tools and reusable Open Source code for building AAC software components. It also facilitates AAC product vendors to put together sophisticated applications using the available on the Web, independently …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "ACM"
        },
        {
            "Title": "Integrating Usability Engineering for Designing the Web Experience: Methodologies and Principles",
            "Publication year": 2010,
            "Publication url": "https://tasos-spiliotopoulos.com/publications_assets/Preface-IntegratingUsabilityBook-10-TS.pdf",
            "Abstract": "System usability is defined as the extent to which a product can be used by specified users to achieve specified goals with effectiveness, efficiency and satisfaction in a specified context of use. Usability is regarded as one of the aspects of software quality, and as such it can be described alternatively as “quality in use”. Since usability is only defined within a certain context of use, we can deduce that it cannot be considered as an inherent attribute of a product, but it has to be studied by studying the users themselves.Ease of use has long been a major concern within software development and the industry has realized that in order to achieve such a quality, a user-centered approach is needed. However, User-Centered Design (UCD) constitutes a considerable paradigm shift in the development process and this has hindered the adoption of UCD methods. Thus, it is fairly recently that more systematic approaches have been considered and efforts have been made to integrate such methods in the software development process. Moreover, the proliferation of the World Wide Web has increased the need for developing usable systems, since the designers have to cater for a much more diversified user base. In addition, the Internet has lead to an increase in the number of people that develop software and has shrunk the amount of time from the inception of an idea to its development as an application and its deployment to the market. Advances in ICT have complicated modern applications and their interfaces, making them harder to use. As a consequence of all the above, a considerable lack of usability can be observed in the Web today, despite the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:evX43VCCuoAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tactile Identification of embossed raised lines and raised squares with variable dot elevation by persons who are blind",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41267-2_11",
            "Abstract": "We present a study on the identification accuracy of embossed tactile lines and squares in eight dot elevations and two dot densities. The results of correct and misclassified matched stimuli by ten congenitally blind participants are presented in confusion matrixes for the raised-dot lines and squares test stimuli. Moreover, the overall mean response time of the identification task is provided. Participants identify better the lower three dot elevations for both lines and squares on 20 or 10 dpi, with an exception for 20 dpi squares where the highest dot elevation is third in the order of recognition. The application of a multilevel model fitting to the data indicated significant effects for the role of the DOTs (raised dot lines versus raised dot squares) with the raised dot squares being associated with significantly elevated correct responding. ",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:UHK10RUVsp4C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "User perception knowledge for socially-aware web document accessibility",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39191-0_76",
            "Abstract": "Social Media provide a vast amount of information identifying stories, events, entities that play the crucial role of shaping the community in an everyday heavy user involvement. This work involves the study of social media information in terms of type (multimodal: text, video, sound, picture) and role players (agents, users, opinion leaders) and the potential of using that information for the design of accessible, usable preservation strategies. The challenge was to analyze the social web and present ways of preserving the web documents with social content in such way as to make them accessible for the future. The web documents should preserve accessible data and stored in such way as to enable intelligent retrieval.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Communication Applications",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=7264659748557743999&hl=en&oi=scholarr",
            "Abstract": "In this paper the ULYSSES framework for designing and developing Interpersonal Communication Aids is presented. It consists of a component-based architecture that aims to simplify the integration of multi-vendor components in low cost applications. For component developers ULYSSES provides an engineering-for-reuse environment with guidelines and tools to build software components, which can operate effectively and interact with each other transparently, without even being aware of each other's existence. Components with different functionality, developed by independent manufacturers can be deployed using various programming languages. Furthermore, ULYSSES grants a process of engineering-with-reuse for system integrators to take advantage of the reusable assets produced during engineering-for-reuse. Thus, selection and assembly of components on demand for building user-specific robust products out of pre-fabricated software parts is becoming an easy task for system integrators.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:PoWvk5oyLR8C",
            "Publisher": "Ios PressInc"
        },
        {
            "Title": "Performance evaluation of gesture-based 2D and 3D pointing tasks",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/8645021/gw2011_04.pdf",
            "Abstract": "We present two studies to comparatively evaluate the performance of gesture-based 2D and 3D pointing tasks. In both of them, a Wiimote controller and a standard mouse were used by six participants. For the 3D experiments we introduce a configuration analogous to the ISO 9241-9 standard methodology. We examine the pointing devices’ conformance to Fitts’ law, and we measure some extra parameters that describe more accurately the cursor movement trajectory.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:BqipwSGYUEgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A component-based framework for the development of virtual musical instruments based on physical modeling",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/228575836_A_component-based_framework_for_the_development_of_virtual_musical_instruments_based_on_physical_modeling/links/0fcfd505729eeb65a4000000/A-component-based-framework-for-the-development-of-virtual-musical-instruments-based-on-physical-modeling.pdf",
            "Abstract": "We propose a framework for the design and development of component-based woodwind virtual instruments. Each functional part of the instrument is represented with an independent component, and can be created with different approaches, by unfamiliar constructors. Using the aforementioned framework, Virtual Zournas is implemented. The user can experiment with the instrument, changing its physical properties. Instrument control is performed via MIDI files or external MIDI devices.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Indoor Navigation and Location-Based Services for Persons with Motor Limitations",
            "Publication year": 2014,
            "Publication url": "https://www.igi-global.com/chapter/indoor-navigation-and-location-based-services-for-persons-with-motor-limitations/78639",
            "Abstract": "Persons with motor limitations constitute a group-challenge when building indoor navigation and Location-Based Services (LBS). The authors present here the systematic approach they have developed that has to be taken into account in the user needs analysis of persons with motor disabilities when an advanced system for indoor navigation and LBS is designed. In the first part the authors present a step-by-step and detailed methodology about the extraction of the user requirements’ knowledge in order to develop an indoor navigation and LBS system that provides adequate and usable output to persons with motor limitations. In the second part, after an overview of the existing indoor LBS, the authors present the development of the MNISIKLIS system giving emphasis on the User Interface designed after following the knowledge derived from the first part.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Design and development methodology for the emotional state estimation of verbs",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39062-3_1",
            "Abstract": "The use of words and particularly the verbs in Human-Human Interaction reveals significant aspects of both human’s social and mental state. This work presents a novel methodology towards the emotional assessment of verbs by users. Essentially we would like to study whether the emotions that user experience are comparable with the corresponding results obtained through a mixture of natural language and statistical classifiers in SentiWordNet. Following the paper and pencil guidelines of the International Affective Picture System (IAPS) we have developed a web-based unsupervised version of the Self Assessment Manikin (SAM) test, designed for the emotional assessment of verbs in English and Greek language. Thirty five men and seventeen women participated in an internet survey version of the experiment. In the first part of the process, the participants had to assess their induced emotional state …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Voice User Interfaces for Service Robots: Design Principles and Methodology",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-49282-3_35",
            "Abstract": "This work presents the concerns, prerequisites, and methods for building interaction interfaces for service robots. It mainly deals with Voice User Interfaces - VUI (also called Spoken Dialogue Interfaces - SDIs) but also includes issues on multimodal interfaces, involving speech and other modalities. Human-machine interaction in the area of robotics raises certain challenges that respective interface design for other domains ignores. Robots, and more importantly, service robots, execute actual tasks based on plans and scenarios that, in effect, layout their usage. The completion requirements, as well as the workflow needed for those tasks, form a very significant set of rules that affect and sometimes govern the interaction between the user and the machine. Those rules are embedded to the design of the interaction system and, together with the communicated context, provide the sets and constraints that the system is …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:TIZ-Mc8IlK0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Modern Greek dialect lexicography: an online lexical database for Cypriot Greek",
            "Publication year": 2012,
            "Publication url": "https://mgdlt.library.upatras.gr/index.php/mgdlt/article/viewFile/2593/2830",
            "Abstract": "‘Syntychies’ is the first online lexical database for Cypriot Greek dialect, with enhanced sorting and searching functionalities and a text-to-speech feature for listening to the pronunciation of the words. The research goal of the project focuses on the study of Cypriot Greek vocabulary and its written representation. Three main principles guide the structure of the website: accessibility, efficiency, and user friendliness.‘Syntychies’ is a lexicographic research project for the production of linguistic resources focusing on the study of Cypriot Greek (henceforth CG) vocabulary, its pronunciation and its orthographic representation. This project was undertaken at the University of Cyprus during 2006-2010. An online web service website has been created in order to allow access to the ‘Syntychies’ lexical database (http://lexcy. library. ucy. ac. cy/). Three main principles guide the structure and the form of the website: the accessibility, the efficiency and the user friendliness. In this article the graphical user interface will be presented, with a short description of the data shown on screen; a presentation of the sorting and searching capabilities follows and then the text to speech features are described. The Graphical User Interface is shown in Figure 1.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodological approach for designing and developing web-based inventories of mobile Assistive Technology applications",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11042-016-3822-3.pdf",
            "Abstract": "Mobile technologies provide radical opportunities in the domain of Assistive Technologies (AT) for persons with disabilities and the elderly by facilitating them to access multimedia content and improve their social interaction. The search for mobile AT applications that meet specific user needs is not an easy task for the disabled users, their facilitators, and rehabilitation professionals, as the mobile app stores do not include a category for AT or a classification by disability. In this work, we first provide an analysis of the disabled users’ needs along with the required mobile software adaptations in order to fulfill them. Then, we introduce a methodological approach for the design and development of web-based inventories which make the search and selection of AT apps simpler and efficient. This methodology has to main parts, first it is based on experts in an AT lab thoroughly testing each application, and …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:JQOojiI6XY0C",
            "Publisher": "Springer US"
        },
        {
            "Title": "Text signals and accessibility of educational documents",
            "Publication year": 2015,
            "Publication url": "http://www.wseas.us/e-library/conferences/2015/Dubai/EDUTE/EDUTE-05.pdf",
            "Abstract": "This paper presents our recent efforts towards advanced document accessibility by supporting not only the accessibility of the text content of a document, but also the accessibility of the text signals, ie the writing devices that emphasizes aspects of a text’s content or structure. After the introduction of an appropriate document’s architecture, we present the main principles and technological topics of document accessibility, including accessibility of Mathematics and graphics. Then, the emerging technological approach of Documentto-Audio (DtA) we have developed is presented. DtA is based on the principles of Design for All. DtA essentially constitutes the next generation of Text-to-Speech systems and is capable to provide much better accessibility to documents. Finally, we introduce the emotional-based mapping methodology for rendering typographic signals to the auditory modality.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:XiVPGOgt02cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Οι τεχνολογίες πληροφορικής στην ενταξιακή εκπαίδευση των τυφλών μαθητών",
            "Publication year": 2004,
            "Publication url": "https://speech.di.uoa.gr/sppages/spppdf/EllinikaGrammata2004.pdf",
            "Abstract": "Στα άτοµα που παρουσιάζουν δυσλειτουργία του αισθητηρίου της όρασης περιλαµβάνονται οι τυφλοί (0, 1% του πληθυσµού) και εκείνοι µε χαµηλή όραση ή χρωµατικές δυσλειτουργίες (1, 5% του πληθυσµού). Στην πραγµατικότητα στα άτοµα αυτά µπορούµε να διακρίνουµε διαφορετικούς βαθµούς αναπηρίας σε µια κλίµακα ικανοτήτων όρασης. Σύµφωνα µε τον πρόσφατο (2002) ορισµό του Παγκόσµιου Οργανισµού Υγείας (International Classification of Functional Disability and Health–ICF) η αναπηρία και η λειτουργία ή η δυσλειτουργία θεωρούνται αποτελέσµατα της αλληλεπίδρασης µεταξύ καταστάσεων υγείας και συναφών (contextual) παραγόντων. Επίσης, η αναπηρία περιέχει δυσλειτουργία σε ένα ή περισσότερα από τα (ίσης σηµασίας) επίπεδα:(i) βλάβες,(ii) εµπόδια δραστηριοτήτων και (iii) περιορισµοί συµµετοχής. Οι συναφείς παράγοντες µπορεί να είναι:• εξωτερικοί-περιβαλλοντικοί, στους οποίους συγκαταλέγονται …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:kz9GbA2Ns4gC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Natural Language Processing-Transforming Spontaneous Telegraphic Language to Well-Formed Greek Sentences for Alternative and Augmentative Communication",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=13685579203116841462&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "The universal design for learning good practices inventory",
            "Publication year": 2015,
            "Publication url": "https://speech.di.uoa.gr/sppages/spppdf/2015_UDL_Inventory_Kouroupetroglou_et_al.pdf",
            "Abstract": "This paper presents the design principles and the development results of the UDLnet Inventory for Good Practices that follow the Universal Design for Learning (UDL) framework. It aims to bridge the gap between theory and practice in applying UDL. Good Practices included in this Inventory incorporate methods, techniques, approaches or lessons, which apply the UDL principles and guidelines. The basic selection criteria for an UDLnet Good Practice were: transferable, adaptable, flexible and effective. Media Resources complement the UDL Good Practices and relate to the pedagogical approach applied by the educationalist and the instructional material used. Collections provide the facility to gather, link, and organize different UDL Good Practices and Media Resources together. The UDLnet Inventory is not static. It is a growing and dynamic space whose main purpose is to stimulate new reasoning and practices and challenge existing ones.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:uLbwQdceFCQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance metrics and their extraction methods for audio rendered mathematics",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-08596-8_95",
            "Abstract": "We introduce and compare three approaches to calculate structure- and content-based performance metrics for user-based evaluation of math audio rendering systems: Syntax Tree alignment, Baseline Structure Tree alignment, and MathML Tree Edit Distance. While the first two require “manual” tree transformation and alignment of the mathematical expressions, the third obtains the metrics without human intervention using the minimum edit distance algorithm on the corresponding MathML representations. Our metrics are demonstrated in a pilot user study evaluating the Greek audio rendering rules of MathPlayer with 7 participants and 39 stimuli. We observed that the obtained results for the metrics are significantly correlated between all three approaches.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Tree-based prediction of prosodic phrase breaks on top of shallow textual features.",
            "Publication year": 2005,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.478.8462&rep=rep1&type=pdf",
            "Abstract": "This paper reports on the evaluation of automatic prosodic phrase break assignment. We utilize two tree-structured predictors, the commonly used CART and a C4. 5, to predict break placement from sequences of easy to extract shallow textual features. We are experimenting with two 500-utterance sized prosodic corpora developed by two Greek universities that originate from different domains in order to focus on the differences in prediction between generic and limited domain datasets. The evaluation shows that while the limited dataset achieves better accuracy than the generic one in the CART case, this difference is lowered with the introduction of C4. 5. Minor breaks proved to be the most difficult class to predict in CART case, while we achieved a 50% of improvement with C4. 5.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Experimentation on spoken format of tables in auditory user interfaces",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/8644937/10.1.1.79.5800.pdf",
            "Abstract": "The acoustic representation of complex visual structures involves both synthesized speech and non-speech audio signals. Though progress in speech synthesis allows the consistent control of an abundance of parameters, like prosody through appropriate mark-up, there is not enough experimentally proven specification input data to drive a Voice Browser for such purposes. This paper reports on the results from a series of psychoacoustic experiments aiming to provide natural speech prosodic specification for the task of vocalizing tables. Blind and sighted listeners were asked to reconstruct simple and complex data tables from naturally spoken descriptions. From the listeners’ feedback it was deducted that consistent prosodic rendering can model the underlying semantic structure of tables.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Towards the 8-dot Nemeth braille code",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-08596-8_83",
            "Abstract": "In this work, a language-independent design methodology for the systematic development of an 8-dot braille code, has been applied to the Nemeth code. First, we set the design principles: compression, intra-similarity, inter-similarity, unambiguity, consistency and foresight. Then, we follow the Nemeth principles: non enclosure, just in time information, be true to the print, good mnemonics and continuous notation. Finally, we introduce 24 transition rules from 6- to 8-dot Nemeth code. Indicative results of the methodology are also presented.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A design-for-all approach towards multimodal accessibility of mathematics",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=dBbvAgAAQBAJ&oi=fnd&pg=PA393&dq=info:QjDy5LVc4jMJ:scholar.google.com&ots=xUJJS7Z1Bo&sig=9-egA446-NlmUAxVmkhg9vcEq7o",
            "Abstract": "In this paper we present a novel approach for the multimodal accessibility of mathematical expressions in inclusive learning. This methodology combines the capabilities and functionalities of MathML and a real-time XML-based architecture that supports audio, tactile and visual accessibility of mathematics on the board and the presentations in the classroom. This language and content independent system accepts also science expressions from books, or other educational material, either in printed or in electronic format. The multimodal rendering of typographic elements and mathematical notation is based on the semantic extraction.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Audio Enhancement of Physical Models of Musical Instruments Using Optimal Correction Factors: The Recorder Case",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/2076-3417/11/14/6426",
            "Abstract": "A simulation of a musical instrument is considered to be a successful one when there is a good resemblance between the model’s synthesized sound and the real instrument’s sound. In this work, we propose the integration of physical modeling (PM) methods with an optimization process to regulate a generated digital signal. Its goal is to find a new set of values of the PM’s parameters’ that would lead to a synthesized signal matching as much as possible to reference signals corresponding to the physical musical instrument. The reference signals can be: (a) described by their acoustic characteristics (e.g., fundamental frequencies, inharmonicity, etc.) and/or (b) the signals themselves (e.g., impedances, recordings, etc.). We put this method into practice for a commercial recorder, simulated using the digital waveguides’ PM technique. The reference signals, in our case, are the recorded signals of the physical instrument. The degree of similarity between the synthesized (PM) and the recorded signal (musical instrument) is calculated by the signals’ linear cross-correlation. Our results show that the adoption of the optimization process resulted in more realistic synthesized signals by (a) enhancing the degree of similarity between the synthesized and the recorded signal (the average absolute Pearson Correlation Coefficient increased from 0.13 to 0.67), (b) resolving mistuning issues (the average absolute deviation of the synthesized from the recorded signals’ pitches reduced from 40 cents to the non-noticeable level of 2 cents) and (c) similar sound color characteristics and matched overtones (the average absolute deviation of the synthesized from …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:XoXfffV-tXoC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Prosody Prediction from Linguistically Enriched Documents Based on a Machine Learning Algorithm",
            "Publication year": 2003,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.5.1253",
            "Abstract": "this paper has been partially supported by the HERACLITUS project of the Operational Programme for Education and Initial Vocational Training (EPEAEK) of the Greek Ministry of Education under the 3rd European Community Support Framework for Greece",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:9vf0nzSNQJEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A methodology for the extraction of reader's emotional state triggered from text typography",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.212.3224&rep=rep1&type=pdf",
            "Abstract": "Writing is employed by humans in order to communicate, exchange ideas or store facts and descriptions. A well known Latin phrase is “verba volant, scripta manent” ie “spoken words fly away, written words remain”. Humans in prehistoric years, used figurations to describe several events and express their fear or their admiration, the ancient Egyptians used papyrus to write down their ideas and the Chinese, in 11th Century, went beyond handwriting using typography with moveable type to create multiple copies of their documents. Through centuries typography has evolved and nowadays is one of the major manners to exchange ideas and information.Using computers, typography and the way we write has changed radically. We have a plethora of software tools, eg for writing a plain text (like NotePad in MS Windows), word processors (eg Open Office) for text editing as well as for more elegant visual appearance of the documents and professional tools for the creation of posters, advertisements etc (eg Adobe’s Tools and Editors). Utilising these tools, computer users have the ability not only to write a plain text, but also to format the text and arrange it in the page. In newspapers, for example, the page designer distinguishes the title from the body of text at the top of the page or the article, with larger font size. Also, when an editor wishes to emphasize a specific word or phrase he uses bold or italics typesetting. A writer can convey a message, a felling or an idea not only by the meaning of the content but also by the way the text is visually presented to the reader. Page layout affects the way a newspaper is read (Holmqvist & Wartenberg, 2005 …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:8k81kl-MbHgC",
            "Publisher": "INTECH Open Access Publisher"
        },
        {
            "Title": "An open source/freeware assistive technology software inventory",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-14097-6_29",
            "Abstract": "Assistive Technology (AT) software market is expensive, and related products are hard to find, especially for non-English speaking users. Open Source and free AT software partially solve the cost problem, and online inventories facilitate the search for the appropriate product. Even so, users don’t have all the information gathered and systematically organized in one place. Furthermore, free software often needs to be tested and reviewed by computer and AT experts in order to detect and point out reliability, installation, and compatibility issues. We propose a methodology for creating web-based free AT software inventories, which will make the search and selection of such products straightforward. The methodology is based on the systematic organization and consistency of the information available for each product, and its effective presentation; the goal for the users is to be able to quickly find, compare …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "HERMOPHILOS: a web-based information system for the workflow management and delivery of accessible eTextbooks",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41264-1_56",
            "Abstract": "In this work we present the functional specifications, architecture and implementation of the HERMOPHILOS web-based system developed to auto-mate and accelerate the accessible eTextbooks’ production, workflow management, and delivery in an a higher education environment. We describe the redesign of the relative manual procedures and we show how HERMOPHILOS makes things easier and faster for the print-disabled students, as well as for the personnel involved. The web services of HERMOPHILOS include user sign up, user authentication, user rights management, students’ accessible textbooks re-quests, digital textbook requests to publishers, requests’ progress monitoring, original digital textbook copy submission, scanning, OCR, version and archive management, copyright protection, distribution, and digital content usage statistics. Implementation specifications included support for all …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:dQ2og3OwTAUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Auditory accessibility of metadata in books: A design for all approach",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73283-9_49",
            "Abstract": "There are two issues that are challenging in the life-cycle of Digital Talking Books (DTB): the automatic labeling of text formatting meta-data in documents and the multimodal representation of the text formatting semantics. We propose an augmented design-for-all approach for both the production and the reading processes of DAISY compliant DTBs. This approach incorporates a methodology for the real-time extraction and the semantic labeling of text formatting meta-data. Furthermore, it includes a unified approach for the multimodal rendering of text formatting, structure and layout meta-data by utilizing a Document-to-Audio platform to render the acoustic modality.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Using kinect for 2D and 3D pointing tasks: performance evaluation",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39330-3_38",
            "Abstract": "We present a study to comparatively evaluate the performance of computer-based 2D and 3D pointing tasks. In our experiments, based on the ISO 9241-9 standard methodology, a Microsoft Kinect device and a mouse were used by seven participants. For the 3D experiments we introduced a novel experiment layout, supplementing the ISO. We examine the pointing devices’ conformance to Fitts’ law and we measure a number of extra parameters that describe more accurately the cursor movement trajectories. Throughput, measured in bits per second is the most important performance measure. For the 2D tasks using Microsoft Kinect, Throughput is almost 39% lower than using the mouse, Target Re-Entry is 10 times up and Missed Clicks count is almost 50% higher. However, for the 3D tasks the mouse has a 9% lower Throughput than the Kinect, while Target Re-Entry and Missed Clicks are almost …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Usability Methodologies for",
            "Publication year": 2010,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/220156017_Usability_Methodologies_for_Real-Life_Voice_User_Interfaces/links/5798b07c08aeb0ffcd08b312/Usability-Methodologies-for-Real-Life-Voice-User-Interfaces.pdf",
            "Abstract": "I his article studies the usability methodologies for spoken dialogue web interfaces along iith the appropriate designer-needs analysis. The work unfolds a theoretical perspective to the methods that are extensively used and provides a framework description for creating and testing usable content and applications for conversa-tional interfaces. The main concerns include the design issues for usability testing and evaluation during the development lifecycle, the basic customer experience metrics and the problems that arise after the deployment o/real-life systems. Through the discussion of the evaluation and testing methods, this article argues on the importance and the potential of irizard-based fiunctional assessment and usability testing for deployed systems, presenting an appropriate environment as part of an integrated development framework.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:Fu2w8maKXqMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Usability design and testing of an interface for search and retrieval of social web data",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-39253-5_64",
            "Abstract": "The vast amount of data on the web has been extensively harvested for many years for the purpose of digital archiving. In the recent years, however, the social networks contain the sources of most of the debating between the people. Recent approaches include social web information to the archived content for various reasons. This work reports on the usability design and evaluation of a search and retrieval user interface that was designed to retrieve web objects along with semantic information analyzed for the social web. The main task of the interface was to combine the social information with the standard archived content in meaningful and usable ways.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design and Implementation of a Mutlimedia Learning Environment for Spelling",
            "Publication year": 2001,
            "Publication url": "https://www.learntechlib.org/p/8633/",
            "Abstract": "According to the dual coding theory, we perceive and store words and visual images in two systems: one verbal and the other perceptual. We present in this paper the design and implementation of a multimedia spelling-book based on the above theory. The book presents the story of the\" beautiful Helen\" as Homer records it. The review of the current conventional spelling books for pupils combined with the characteristics of the Homer Epics and the different ways of using images, led us to the formation of a set of parameters, assumptions and aims for the interactive learning environment. The methodology we followed to end up with the design and development of the multimedia spelling-book is given in detail along with implementation issues and the description of the application. The system is expandable (more scenes) and transferable (other stories). The application is currently undergoing user trials in real life …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:a0OBvERweLwC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Low cost force-feedback interaction with haptic digital audio effects",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34182-3_5",
            "Abstract": "We present the results of an experimental study of Haptic Digital Audio Effects with and without force feedback. Participants experienced through a low cost Falcon haptic device two new real-time physical audio effect models we have developed under the CORDIS-ANIMA formalism. The results indicate that the haptic modality changed the user’s experience significantly.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Tactile detection by blind people of embossed lines and squares with selected dot elevation",
            "Publication year": 2017,
            "Publication url": "https://scholarworks.calstate.edu/downloads/1r66j4644#page=293",
            "Abstract": "Dot elevation and dot density are two main variables that dominate the recognition and conceptualization of tactile embossed graphics by blind individuals. Nevertheless, few studies have investigated tactile sensitivity to the elevation (third dimension) of tactile graphics. In a pilot experiment we conducted recently using 8 dot elevations of embossed lines and squares, in 20 or 10 dpi, produced by a Tiger VP200 braille embosser, we observed that participants can detect only two highs with accuracy above 50%. We present here the results of an experimental study with 30 congenitally blind participants to investigate the detection accuracy of embossed tactile lines and squares in four selected dot elevations among the eight possible dot heights that can be produced by the VP200 embosser. A total of 1,920 responses were recorded. The detection accuracy and response time of the matching task were examined for each type of test stimuli. The results of correct and misclassified stimuli are presented in confusion matrixes for the raised-dot lines and squares stimuli. Moreover, the overall mean response time of the detection task is provided. We observed that in all cases, only the stimuli with the lower two heights H-1 and H-3 provide detection accuracy above 70%.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:tzM49s52ZIMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HOMER: A Design for the Development of Acoustical-Haptic Representations of Document Meta-Data for Use by Persons with Vision Loss",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=648463941455463005&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Incorporating typographic, logical and layout knowledge of documents into text-to-speech",
            "Publication year": 2013,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-61499-304-9-708",
            "Abstract": "Although Text-to-Speech (TtS) is considered a mature technology capable to produce synthetic speech of very high quality, current TtS systems do not include effective acoustic provision of the semantics and the cognitive aspects of the visual (such as the typographic cues) and non-visual (such as the logical structure) knowledge embedded in the rich text documents. In this paper, after the introduction of an appropriate document architecture, we analyze the semantics of the document signals. Then, by following a Design-for-All methodology, we present the Document-to-Audio approach we have developed for the automatics rendering document signals from the typographic, logical and the layout layers to the auditory modality.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:dshw04ExmUIC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Στάσεις Εφήβων Μαθητών με και χωρίς Ειδικές Μαθησιακές Δυσκολίες απέναντι στην Παραγωγή Γραπτού Λόγου και τη χρήση των Τεχνολογιών της Πληροφορίας και της Επικοινωνίας",
            "Publication year": 2020,
            "Publication url": "https://eproceedings.epublishing.ekt.gr/index.php/edusc/article/view/2657",
            "Abstract": "Σκοπός της έρευνας ήταν να εξετάσει το υπόβαθρο των εφήβων μαθητών και τη συμπεριφορά τους όσον αφορά την παραγωγή γραπτού λόγου, τις ικανότητες, όπως τις αντιλαμβάνονται οι ίδιοι και τέλος τις στάσεις τους απέναντι σε αυτή την ακαδημαϊκή δεξιότητα. Για την καταγραφή της στάσης των μαθητών δευτεροβάθμιας εκπαίδευσης με και χωρίς Ειδικές Μαθησιακές Δυσκολίες (ΕΜΔ) απέναντι στο γράψιμο, χρησιμοποιήθηκε το ερωτηματολόγιο στάσεων των νέων απέναντι στην παραγωγή γραπτού λόγου “Young people’s attitude towards writing” του βρετανικού ιδρύματος National Literacy Trust το οποίο μεταφράστηκε και προσαρμόστηκε στην ελληνική πραγματικότητα με σκοπό να αξιολογηθούν: α) πόσο απολαμβάνουν το γράψιμο οι νέοι, β) με ποιες μορφές παραγωγής γραπτού καταπιάνονται και πόσο συχνά, γ) πόσο καλοί «συγγραφείς» νομίζουν ότι είναι και τι πιστεύουν για το γράψιμο και δ) ποιος είναι ο ρόλος της τεχνολογίας στην παραγωγή γραπτού λόγου των νέων. Στη διαδικασία συμμετείχαν 40 μαθητές γυμνασίων και λυκείων του νομού Αττικής με επίσημη διάγνωση ΕΜΔ και 20 χωρίς διάγνωση. Τα αποτελέσματα του ερωτηματολογίου συγκρίθηκαν με τα αντίστοιχα των μαθητών στην αντίστοιχη έρευνα του National Literacy Trust στην Αγγλία και εμφανίστηκαν ομοιότητες στις προτιμήσεις των μαθητών και από τις δύο χώρες κυρίως ως προς α) τις μορφές γραπτού που προτιμούν οι έφηβοι περισσότερο, β) τις μορφές γραπτού που αποφεύγουν οι έφηβοι περισσότερο, γ) γιατί θεωρούν ότι είναι «καλοί» στο γράψιμο δ) πόσο σημαντικό είναι το γράψιμο για τη ζωή κ. α.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:M7yex6snE4oC",
            "Publisher": "Unknown"
        },
        {
            "Title": "New and recent publications",
            "Publication year": 2012,
            "Publication url": "https://www.jbe-platform.com/content/journals/10.1075/gest.12.3.05pub",
            "Abstract": "Please send suggestions for additions to this list to Marianne Gullberg (Marianne. Gullberg@ ling. lu. se). Anyone interested in writing a review of one of the books listed not already reviewed, or for which a review has been promised (these books are indicated with an asterisk) should contact the Editor (adamk@ dca. net) and arrangements will be made to have a review copy sent from the publisher.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "What are the Differences? A Comparison of the Regular and Mobile Websites of Online Social Networks",
            "Publication year": 2015,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/273521929_Enabling_Access_for_Persons_with_Visual_Impairment/links/550544330cf24cee3a040618/Enabling-Access-for-Persons-with-Visual-Impairment.pdf#page=89",
            "Abstract": "This study explores differences in structure and functionality of the regular and mobile websites of four different Online Social Networks (OSN) with regard to blind users. OSN help connecting people from various ages, cultures and social backgrounds worldwide. But since the regular websites of OSN are very complex, blind users rely on the mobile website which has a simpler, clearer and more straightforward structure and thus is much more suitable for screen readers. Besides, there are more and more sighted mobile-only users who also access their OSN via the mobile website. Due to the nature of the mobile website–to conform to the requirements of mobile devices–there will be structural differences. Therefore, this study’s main goal is to figure out whether mobile-only users might miss important functions. The results of the study show that there are reduced and omitted functions that limit the user, especially for privacy issues, so that the regular website of OSN is indispensable for certain settings. As the results also show structural differences that are not only due to the requirements of mobile devices, switching back and forth between the mobile and regular website, eg for those certain settings, raises difficulties.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:2KloaMYe4IUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of corpus based tone prediction in mismatched environments for Greek TtS synthesis",
            "Publication year": 2004,
            "Publication url": "https://www.isca-speech.org/archive_v0/archive_papers/interspeech_2004/i04_0761.pdf",
            "Abstract": "One of the main aspects in Text-to-Speech (TtS) synthesis is the successful prediction of tonal events. In this work we deal with the evaluation of corpus-based models in operational environments other than the training ones. Two pitch accent frameworks derived by linguistically enriched speech data from a generic domain and a limited domain were initially evaluated by applying the 10-fold cross validation method. As a second step, we utilized the cross domains data validation. Due to the heterogeneity of the data, we further employed three machine learning approaches, CART, Naive Bayes and Bayesian networks. The results demonstrate that the limited domain models achieve in average 10% improved accuracy in self-domain evaluation, while the generic models preserve a their performance regardless the domain of application.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The DEMOSTHeNES speech composer",
            "Publication year": 2001,
            "Publication url": "https://www.isca-speech.org/archive_open/ssw4/ssw4_206.html",
            "Abstract": "In this paper we present the design and development of a modular and scalable speech composer named DEMOSTHeNES. It has been designed for converting plain or formatted text (eg HMTL) to a combination of speech and audio signals. DEMOSTHeNES'architecture constitutes an extension to current Text-to-Speech systems’ structure that enables an open set of module-defined functions to interact with the under processing text at any stage of the text-tospeech conversion. Details on its implementation are given here. Furthermore, we present some techniques for text handling and prosody generation using DEMOSTHeNES.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "An experimental approach in conceptualizing typographic signals of documents by eight-dot and six-dot braille code",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07440-5_8",
            "Abstract": "The main research aim of the present study focuses on issues of reading comprehension, when users with blindness receive typographic meta-data by touch through a braille display. Levels of reading comprehension are investigated by the use of 6-dot and 8-dot braille code in matched texts for the cases of bold and italic meta-data. The results indicated a slight superiority of the 8-dot braille code in reading time and scorings. The discussion considered the practical implications of the findings such as issues regarding education as well as the development of suitable design of tactile rendition of typographic signals through 6-dot or 8-dot braille code in favor of better perception and comprehension.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:Tiz5es2fbqcC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "The development of knowledge about the earth and the day/night cycle in blind and sighted children using acoustical rendition of documents’ visual elements",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S187705091502949X",
            "Abstract": "During this study we planned an alternative teaching process, designed and based on inclusion, for tutoring the basic concepts of Observational Astronomy (OA) in an elementary school, taking into consideration the difficulties faced by both congenitally blind and sighted students. Following basic design-for-all principles, during a forty-five minutes teaching process, in which ten congenitally blind and ten sighted students participated, the educational material was presented in both visual and acoustic modalities, using an interactive whiteboard. An interview was then followed with each student in order to investigate their understanding of the scientific concepts of OA. The results of this study showed that congenitally blind and sighted students, after this alternative teaching process, experienced less difficulty in understanding the concepts of OA.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:_B80troHkn4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A targetselection method for generating F0 contours in short messaging applications",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/39771997/A_Target-Selection_Method_for_Generating20151107-2093-1o1ffzo.pdf",
            "Abstract": "Though the evolution of hand-held devices has been recently followed by the porting of Text-to-Speech (TtS) systems with high segmental quality, the lack of rich linguistic features due to the hardware limitations of the runtime environments heavily affects the prosody aspect of small-footprint TtS synthesis. In this work, we introduce a corpus based F0 model to improve the naturalness over rule-based approaches in such embedded platforms. A target selection method is proposed that picks out and copies pitch targets over syllables. To cope with the poor feature availability, prosodic structures are organized in an onset/mid/offset segmentation of phrases produced by a shallow parser. The proposed method focuses on the fine pitch target representation of the onset and offset sections, which perceptually are of greatest importance. The results indicate that this approach fits well with the specification of short …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:N5tVd3kTz84C",
            "Publisher": "Unknown"
        },
        {
            "Title": "e-AAC: Making internet-based interpersonal communication and WWW content accessible for AAC symbol users",
            "Publication year": 2003,
            "Publication url": "http://speech.di.uoa.gr/sppages/spppdf/hcii2003c.pdf",
            "Abstract": "In this paper we present the dynamics of making both the internet-based interpersonal communication and the content of the World Wide Web (WWW) accessible by the languageimpaired persons or Alternative and Augmentative Communication (AAC) users. To cope with this problem we introduce e-AAC, an infrastructure of multimedia concept representations for database-aware services and applications. We present the main features of e-AAC in terms of design and implementation characteristics, along with usage properties and applications.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:mB3voiENLucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An experimental approach in recognizing synthesized auditory components in a non-visual interaction with documents",
            "Publication year": 2005,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/235972450_An_experimental_approach_in_recognizing_synthesized_auditory_components_in_a_non-visual_interaction_with_documents/links/0deec51509ef6adcde000000/An-experimental-approach-in-recognizing-synthesized-auditory-components-in-a-non-visual-interaction-with-documents.pdf",
            "Abstract": "The auditory formation of visual-oriented documents is a process that enables the delivery of a more representative acoustic image of documents via speech interfaces. We have set up an experimental environment for conducting a series of complex psycho-acoustic experiments to evaluate users’ performance in recognizing synthesized auditory components that represent visual structures. For our purposes, we exploit an open, XML-based platform that drives a Voice Browser and transforms documents’ visual meta-information to speech synthesis markup formalism. A user-friendly graphical interface allows the investigator to build acoustic variants of documents. First, a source de-compilation method builds a logical layer that abstractly classifies visual meta-information. Then, the investigator can define distinctive sound fonts in a free way by assigning combined prosodic parameters and non-speech audio sounds to the logical elements. Four blind and four sighted student subjects were asked about their distinctive ability in response to several controlled versions of auditory components, as well as their opinion on the quality of the selected features. The results provided evidence to discuss the general hypothesis that the mean scores for blind and sighted students in recognizing differentiated auditory components are equal. Also, we extracted some preliminary data for the evaluation of the appropriateness of several sound fonts in the auditory representation of visual components in cases of WWW documents.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "How blind and sighted individuals perceive the typographic text-signals of a document",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-40250-5_8",
            "Abstract": "Typographic, layout and logical elements constitute visual text-signals of a document that carry semantic information over and above its content. Although they are important to the reader, most of the current Text-to-Speech (TtS) systems do not support them. As there is a lack of studies on how blind perceive them and aiming to incorporate them efficiently in advanced TtS systems, we investigate in a systematic way the perception of the main typographic text-signals by 73 blind and sighted students. The results show that both groups of the participants perceive that font-styles are used largely to better locate, recognize or distinguish the topics or specific information in a document. Almost half of the sighted argue that they are useful for the comprehension of the content, but only 4 % of the blind students perceive the same. Most of the sighted participants (68 %) consider that bold is used to indicate an …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:PR6Y55bgFSsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Accessibility driven design for policy argumentation modelling",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07509-9_10",
            "Abstract": "This paper discusses the design of a web interface for policy argumentation modeling. Given the complexity of the interface the WAI-ARIA descriptions were used to ensure that the data were accessible and the visual-heavy presentation was simplified. Conclusions were drawn as to the usefulness of the WAI-ARIA guidelines to an elaborate design of user interaction with highly dynamic content.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:XiSMed-E-HIC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "User requirements regarding information included in audio-tactile maps for individuals with blindness",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41267-2_23",
            "Abstract": "The aim of this study is to investigate the user requirements of young adults with blindness regarding the information to be included/ mapped in two different types of audio-tactile mobility maps: (a) audio-tactile maps of indoors, and (b) audio-tactile maps of campuses. Forty young adults (aged from 18 years to 30 years) with blindness took part in the research. Participants came from four countries: 14 from Greece, 2 from Cyprus, 18 from Turkey, and 6 from Germany. The researchers developed two lists of information to be included in the two types of audio-tactile maps (indoor and campus) respectively. Participants were asked to evaluate the information, regarding: (a) the significance of the information in regard to safety, location of services, way finding and orientation during movement, and (b) the frequency the participants meet the information (within their surrounding and the environment they move in …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:VL0QpB8kHFEC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Auditory universal accessibility of data tables using naturally derived prosody specification",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s10209-009-0165-0",
            "Abstract": "Text documents usually embody visually oriented meta-information in the form of complex visual structures, such as tables. The semantics involved in such objects result in poor and ambiguous text-to-speech synthesis. Although most speech synthesis frameworks allow the consistent control of an abundance of parameters, such as prosodic cues, through appropriate markup, there is no actual prosodic specification to speech-enable visual elements. This paper presents a method for the acoustic specification modelling of simple and complex data tables, derived from the human paradigm. A series of psychoacoustic experiments were set up for providing speech properties obtained from prosodic analysis of natural spoken descriptions of data tables. Thirty blind and 30 sighted listeners selected the most prominent natural rendition. The derived prosodic phrase accent and pause break placement vectors …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:4TOpqqG69KYC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Text-to-speech scripting interface for appropriate vocalisation of e-texts",
            "Publication year": 2001,
            "Publication url": "https://speech.di.uoa.gr/aac/pdf/eurospeech2001.pdf",
            "Abstract": "Electronic texts carry important meta-information (such as tags in HTML) that most of the current Text-to-Speech (TtS) systems ignore during the production of the speech. We propose an approach to exploit this meta-information in order to achieve a detailed auditory representation of an e-text. The e-Text to Speech and Audio (e-TSA) Composer has been designed and developed as an XML based scripting framework that can be adopted by existing TtS, with minor or major modifications. It provides a mechanism to create scripts using combined elements from e-texts and TtS systems. The e-TSA Composer can manipulate the behaviour of a TtS (eg the applied prosody) in order to define a finest vocalisation in response to specific e-texts.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Δείκτης Ορθογραφικής Ορθότητας Εφήβων Μαθητών με και χωρίς Ειδικές Μαθησιακές Δυσκολίες κατά την Παραγωγή Γραπτού Λόγου στο χέρι και στον ηλεκτρονικό υπολογιστή",
            "Publication year": 2020,
            "Publication url": "https://eproceedings.epublishing.ekt.gr/index.php/edusc/article/view/2656",
            "Abstract": "Σκοπός της έρευνας ήταν η καταγραφή των επιδόσεων και οι πιθανές βελτιώσεις στην ορθογραφία και συγκεκριμένα του Δείκτη Ορθογραφικής Ικανότητας εφήβων μαθητών με και χωρίς Ειδικές Μαθησιακές Δυσκολίες (ΕΜΔ) κατά την παραγωγή γραπτού λόγου με τον παραδοσιακό τρόπο, δηλαδή με τη γραφή στο χέρι, σε σχέση με τη γραφή στον υπολογιστή. Στην έρευνα συμμετείχαν 40 μαθητές γυμνασίου και λυκείου με επίσημη διάγνωση Ειδικών Μαθησιακών Δυσκολιών και 20 μαθητές χωρίς διάγνωση οι οποίοι κλήθηκαν να γράψουν από δύο εκθέσεις, μία με τον κάθε ένα από τους δύο παραπάνω τρόπους. Για την ποσοτικοποίηση των δεδομένων και τις διαφορές που θα προέκυπταν στα κείμενα σε επίπεδο ορθογραφίας επιλέχθηκε το «Εργαλείο Διαγνωστικής Διερεύνησης Δυσκολιών στο Γραπτό Λόγο των Μαθητών Γ΄-Στ΄ Δημοτικού», από το οποίο όμως χρησιμοποιήθηκε μόνο ο Δείκτης Ορθογραφικής Ορθότητας. Από τον παραπάνω τύπο (αριθμός σωστών λέξεων/συνολικός αριθμός λέξεων επί εκατό) προέκυψε ότι η μέγιστη δυνατή επίδοση στην ορθογραφία ήταν ο αριθμός εκατό. Οι μαθητές με ΕΜΔ είχαν μέσο όρο 69, 9 στην ορθογραφία τους στο γραπτό στο χέρι, ενώ βελτιώθηκαν στο 93, 7 στο γραπτό στον υπολογιστή. Οι μαθητές χωρίς ΕΜΔ είχαν μέσο όρο 96, 9 στο χέρι και 98, 4 στον υπολογιστή. Βελτιώθηκαν λοιπόν και αυτοί, όχι ωστόσο στην ίδια κλίμακα με αυτή των μαθητών με ΕΜΔ.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:k8Z6L05lTy4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Universal Access in Public Terminals.",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=5618590370793635021&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:WqliGbK-hY8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "New and recent publications",
            "Publication year": 2013,
            "Publication url": "https://www.jbe-platform.com/content/journals/10.1075/gest.13.1.05new",
            "Abstract": "Please send suggestions for additions to this list to Marianne Gullberg (Marianne. Gullberg@ ling. lu. se). Anyone interested in writing a review of one of the books listed not already reviewed, or for which a review has been promised (these books are indicated with an asterisk) should contact the Editor (adamk@ dca. net) and arrangements will be made to have a review copy sent from the publisher.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:SdhP9T11ey4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "ENTROTUNER: A computational method adopting the musician’s interaction with the instrument to estimate its tuning",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9036900/",
            "Abstract": "Archeomusicologists commonly use methods based on the physical properties and the relative tuning system of a musical instrument in order to estimate its tones. However, because the musician often alters the tones' frequency, for example, while playing in wind instruments by means of embouchure or by stressing the string in string instruments, the current methods that neglect the musician's interaction with the instrument cannot provide solid results. In this work, we introduce ENTROTUNER, a computational method, based on mathematical optimization, to more accurately estimate the generated tones by considering: the instrument as a sound production mechanism, the relevant musical scale(s), and the musician's interaction with the instrument. We simulate this interaction as a system that, by following tuning rules, aims to maximize the partials' overlap (harmonicity), coded as entropy's minimization of the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:p__nRnzSRKYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Assistive technologies and computer access for motor disabilities",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=m96WBQAAQBAJ&oi=fnd&pg=PP1&dq=info:tyPpBdTR5wgJ:scholar.google.com&ots=qlPvseS7ih&sig=Sxj8kIlnnCzDLxylfCjG9pIWrVE",
            "Abstract": "Individuals with disabilities that impede their range of motion often have difficulty accessing technologies. With the use of computer-based assistive technology; devices, tools, and services can be used to maintain and improve the functional capabilities of motor disabilities. Assistive Technologies and Computer Access for Motor Disabilities investigates solutions to the difficulties of impaired technology access by highlighting the principles, methods, and advanced technological solutions for those with motor impairments. This reference source is beneficial to academia, industry, and various professionals in disciplines such as rehabilitation science, occupational therapy, human-computer interface development, ergonomics, and teaching in inclusive and special education. This publication is integrated with its pair book Disability Informatics and Web Accessibility for Motor Limitations.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:AXPGKjj_ei8C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "The Edinburgh speech tools library The Edinburgh speech tools library, 1998",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10015374722/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です（11/11(水\n)-12/23(水)） <no title> TAYLOR P. 被引用文献: 1件 著者 TAYLOR P. 収録刊行物 The Edinburgh \nspeech tools library The Edinburgh speech tools library, 1998 The Centre for Speech \nTechnology Research, University of Edinburgh 被引用文献: 1件中 1-1件を 表示 1 Modeling \nImproved Prosody Generation from High-Level Linguistically Annotated Corpora XYDAS \nGerasimos , SPILIOTOPOULOS Dimitris , KOUROUPETROGLOU Georgios IEICE transactions \non information and systems 88(3), 510-518, 2005-03-01 参考文献26件 CiNii利用者アンケート NII/…",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:uc_IGeMz5qoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "SMC'07: 4th Sound and Music Computing Conference, 11-13 July 2007, Lefkada, Greece: Proceedings",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=5854271669515186726&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ML0RJ9NH7IQC",
            "Publisher": "National and Kapodistrian University of Athens"
        },
        {
            "Title": "Modeling improved prosody generation from high-level linguistically annotated corpora",
            "Publication year": 2005,
            "Publication url": "https://search.ieice.org/bin/summary.php?id=e88-d_3_510",
            "Abstract": "Synthetic speech usually suffers from bad F0 contour surface. The prediction of the underlying pitch targets robustly relies on the quality of the predicted prosodic structures, i.e. the corresponding sequences of tones and breaks. In the present work, we have utilized a linguistically enriched annotated corpus to build data-driven models for predicting prosodic structures with increased accuracy. We have then used a linear regression approach for the F0 modeling. An appropriate XML annotation scheme has been introduced to encode syntax, grammar, new or already given information, phrase subject/object information, as well as rhetorical elements in the corpus, by exploiting a Natural Language Generator (NLG) system. To prove the benefits from the introduction of the enriched input meta-information, we first show that while tone and break CART predictors have high accuracy when standing alone (92.35% for …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "The Institute of Electronics, Information and Communication Engineers"
        },
        {
            "Title": "Accessibility of documents",
            "Publication year": 2015,
            "Publication url": "https://www.igi-global.com/chapter/accessibility-of-documents/112888",
            "Abstract": "BackgroundAccording to the communication theorist Marshall McLuhan, a document is the “medium” in which a “message”(information) is communicated (McLuhan & Fiore, 2005). The content of the printed or electronic documents includes mainly the text and the images (ie figures, drawings, graphs, pictures, charts, diagrams, maps, photos, etc.). Furthermore it may include mathematical or in general scientific symbols and formulas. The term text-document refers to the textual content only of a document.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Discrimination and comprehension of synthetic speech by students with visual impairments: The case of similar acoustic patterns",
            "Publication year": 2008,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0145482X0810200705",
            "Abstract": "This study examined the perceptions held by sighted students and students with visual impairments of the intelligibility and comprehensibility of similar acoustic patterns produced by synthetic speech. It determined the types of errors the students made and compared the performance of the two groups on auditory discrimination and comprehension.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:Zph67rFs4hoC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "MNISIKLIS: Indoor location based services for all",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-87393-8_16",
            "Abstract": "MNISIKLIS is an integrated system aiming to provide universal, indoor locationbased services focusing on navigation. This paper presents the overall MNISIKLIS architecture and certain implementation details. In the context of the Design for All approach, the system targets to the support of several types of users, including persons with disabilities as well as elderly, by exploiting multimodal interaction. Moreover, the system implements effi cient path fi nding algorithms and provides advanced user experience through highly personalized services. MNISIKLIS adopts Semantic Web technologies (e.g., ontologies and reasoning methods) for representing an d managing application models. Furthermore, MNISIKLIS exploits modern positioning techniques in order to achieve high quality positioning. The paper discusses the algorithms and the models that accommodate the services provided by the system …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Specification of Symbols used in Audio-tactile maps for individuals with Blindness",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41267-2_22",
            "Abstract": " The implementation of multisensory environments in the field of map construction for individuals with visual impairments can be a challenging area for both users and designers of orientation and mobility aids. Audio-tactile maps can utilize a large amount of spatial information represented by audio symbols, tactile symbols, audio-tactile symbols (combined) and Braille labels. In regard to audio-tactile maps an important clarification needs to be elaborated and in particular what needs to be carefully examined is the basic query of which information should be presented in haptic mode and which information should be presented in audio or audio-haptic mode. In practice this means that a reasoned process of defining the appropriate symbols for audio-tactile maps should be implemented. The fundamental aim of project “ATMAPS” - Specification of symbols used on Audio-Tactile Maps for individuals with …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:ZuybSZzF8UAC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A Methodology for Reader's Emotional State Extraction to Augment Expressions in Speech Synthesis",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4410383/",
            "Abstract": "This paper presents a methodology for the real-time extraction of readers' emotional state from documents as well as the representation of emotionally annotated documents into acoustic modality. Using the Self Assessment Manikin Test we performed preliminary experiments on the extraction of Pleasure - Arousal - Dominance (P.A.D.) annotation rules that the documents evoke to the readers. The rules are used in an automated procedure that assigns text's formatting and structure of documents (meta-data) to emotional state values. During the vocalization of documents, these values, and consequently the documents' meta-data, are carried by different expressions of speech using text-to-speech synthesis. The proposed system architecture is language independent and content-free.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Building Prosodic Structures in a Concept-to-Speech System",
            "Publication year": 2003,
            "Publication url": "http://cgi.di.uoa.gr/~gxydas/publications/xydas_bciw2003.pdf",
            "Abstract": "The prosodic structure of utterances in terms of breaks and tones is a significant problem in speech synthesis. In this work we present the results from models used to predict accurate and realistic prosodic structures within the context of a Concept-to-Speech system for a virtual museum guide. We have used a Natural Language Generator system for providing error-free enriched linguistic information, such as syntax and Part-of-Speech, to a Speech Synthesizer. An XML annotation has been used as a means for this transfer of linguistic data. The annotated data was used to build classification trees for the prediction of prosodic phrase breaks, pitch accents and endtones (phrase accents and boundary tones). The annotation of utterances included segmental information, ToBI marks, syntax, grammar and some domain specific features such as new/given and phrase subject/object information. The linguistic nature of …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Speech-enabled e-Commerce for disabled and elderly persons",
            "Publication year": 2000,
            "Publication url": "https://www.academia.edu/download/8644978/cost219koupemitso.pdf",
            "Abstract": "The term e-commerce, as used in this paper, implies a wide context of procedures performed electronically including:",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:_kc_bZDykSQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Simple cases of low cost forcefeedback interaction with haptic digital audio effects",
            "Publication year": 2011,
            "Publication url": "https://www.academia.edu/download/8645020/gw2011_37.pdf",
            "Abstract": "We present the results of an experimental study of Haptic Digital Audio Effects with and without force feedback. Participants experienced through a low cost Falcon haptic device two new real-time physical audio effect models we have developed under the CORDIS-ANIMA formalism. The results indicate that the haptic modality changed the user’s experience significantly",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Disability informatics and web accessibility for motor limitations",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=wN6WBQAAQBAJ&oi=fnd&pg=PP1&dq=info:kleFRUn-BdMJ:scholar.google.com&ots=ZMjqXbRzmJ&sig=5S4_7Hgru_hEvfBgePFIlAGT3_I",
            "Abstract": "As technology becomes an increasingly vital aspect of modern social interaction, the field of disability informatics and web accessibility has made significant progress in consolidating theoretical approaches and exploring new application domains for those with motor and cognitive disabilities. Disability Informatics and Web Accessibility for Motor Limitations explores the principles, methods, and advanced technological solutions in the use of assistive technologies to enable users with motor limitations. This book is essential for academia, industry, and various professionals in fields such as web application designers, rehabilitation scientists, ergonomists, and teachers in inclusive and special education. This publication is integrated with its pair book Assistive Technologies and Computer Access for Motor Disabilities.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:LPZeul_q3PIC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Vibrato analysis in byzantine music",
            "Publication year": 2013,
            "Publication url": "https://speech.di.uoa.gr/sppages/spppdf/SMC2013_Proceedings_Vibrato.pdf",
            "Abstract": "In this work we study the vibrato rate, extent and intonation in Byzantine Music. Two methods of analysis have been applied: the first based on the analytical signal and the second on the crests and troughs of the waveform of the vibrato signal. Tones-samples were extracted from ascending and descending music scales, chanted by five famous singers for all the Greek vowels. The two analysis methods produced identical results in the level of significance, a= 0.05, concerning the mean extent, the mean standard deviation of the rate and the mean intonation, while they differed in the rate (1.9-6.6%), the mean standard deviation of the extent (4-6 cents) and the standard deviation of intonation (0.46-1.20 Hz). Typical values of the average rate within a tone were found to be 5.35 Hz (SD: 0.96 Hz) and 5.13 Hz (SD: 0.95 Hz), while the most frequent values were 4.8 Hz and 4.5 Hz, for the first and second method, respectively. The average extent within a tone was 50 cents (SD: 18 cents). Moreover, the dependence of the vibrato parameters on pitch and sound intensity has been studied; there was no systematic relationship between them.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Upper limb motor skills evaluation in patients with early multiple sclerosis using the IDEA system",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7376809/",
            "Abstract": "Upper limb functionality is an integral part of everyday interaction with the environment right from the very first minutes of human life. ϵhis paper investigates the experimental application of the IDEA (Input Device Evaluation Application) system on patients with multiple sclerosis at an early stage and without clinically overt motor deficits, in order to assess their upper limbs' motor skills. The objective of the current study is to test the sensitivity and reliability of the IDEA system regarding the evaluation of multiple kinetic parameters of upper limbs. 29 patients who were hospitalized in the Demyelinating Diseases Section of Eginition Hospital's Neurological Clinic and 25 healthy participated in the experiments. Data derived from the experiment are complemented with demographics. The acquired results analysis reveals that the IDEA system sensitivity is high enough to predict the presence of early upper limb multiple …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:eq2jaN3J8jMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Acoustical analysis of woodwind musical instruments for virtual instrument implementation by physical modeling",
            "Publication year": 2004,
            "Publication url": "https://speech.di.uoa.gr/sppages/spppdf/acoustica2004_physicalmodeling.pdf",
            "Abstract": "In the present paper, we present the development of a framework of methodologies, which allow the creation of acoustic analysis, by woodwind musical instrument recordings corpora, as well as the implementation of virtual instruments, by physical modeling. We emphasize on traditional instruments, starting with the zournas. By analysis, acoustical aspects of the instrument are derived (attack-release time, spectral harmonic distribution, pitch and intensity contours et. c.). Moreover, in conjunction with measurements by a laryngograph, features of the player’s performance style are recovered. The parameters extracted are necessary for developing virtual instruments by physical modeling. To be more precise, digital waveguide models will be used to simulate the sound wave propagation in the instrument.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:hFOr9nPyWt4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Modeling reader's emotional state response on document's typographic elements",
            "Publication year": 2011,
            "Publication url": "https://dl.acm.org/doi/abs/10.1155/2011/206983",
            "Abstract": "We present the results of an experimental study towards modeling the reader's emotional state variations induced by the typographic elements in electronic documents. Based on the dimensional theory of emotions we investigate how typographic elements, like font style (bold, italics, bold-italics) and font (type, size, color and background color), affect the reader's emotional states, namely, Pleasure, Arousal, and Dominance (PAD). An experimental procedure was implemented conforming to International Affective Picture System guidelines and incorporating the Self-Assessment Manikin test. Thirty students participated in the experiment. The stimulus was a short paragraph of text for which any content, emotion, and/or domain dependent information was excluded. The Analysis of Variance revealed the dependency of (a) all the three emotional dimensions on font size and font/background color combinations and (b …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Hindawi"
        },
        {
            "Title": "Emotional prosodic model evaluation for greek expressive text-to-speech synthesis",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07440-5_16",
            "Abstract": "In this study we introduce a novel experimental approach towards the evaluation of emotional prosodic models in Expressive Speech Synthesis. It is based on the dimensional emotion expressivity and adopts the Self-Assessment Manikin Test. We applied this experimental approach to evaluate an emotional prosodic model for Greek expressive Text-to-Speech synthesis. We used two pseudo-sentences for each of the Greek and English HMM-based synthetic voices, implemented in the MARY TtS platform. Fifteen native Greek participants were asked to assess eleven emotional states for each sentence. The results show that the “Arousal” dimension is perceived as intended, followed by the “Pleasure” and “Dominance” dimensions’ ratings. These preliminary findings are consistent with the results in previous studies.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:738O_yMBCRsC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Spoken dialogue interfaces: integrating usability",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-10308-7_36",
            "Abstract": "Usability is a fundamental requirement for natural language interfaces. Usability evaluation reflects the impact of the interface and the acceptance from the users. This work examines the potential of usability evaluation in terms of issues and methodologies for spoken dialogue interfaces along with the appropriate designer-needs analysis. It unfolds the perspective to the usability integration in the spoken language interface design lifecycle and provides a framework description for creating and testing usable content and applications for conversational interfaces. Main concerns include the problem identification of design issues for usability design and evaluation, the use of customer experience for the design of voice interfaces and dialogue, and the problems that arise from real-life deployment. Moreover it presents a real-life paradigm of a hands-on approach for applying usability methodologies in a spoken …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "An artificial neural network approach for the forecast of ambient air temperature",
            "Publication year": 2014,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2014EGUGA..1611446P/abstract",
            "Abstract": "Ambient air temperature forecasting is one of the most significant aspects of environmental and climate research. Accurate temperature forecasts are important in the energy and tourism industry, in agriculture for estimating potential hazards, and within an urban context, in studies for assessing the risk of adverse health effects in the general population. The scope of this study is to propose an Artificial Neural Network (ANN) approach for the one-day ahead maximum (Tmax) and minimum (Tmin) air temperature forecasting. The ANNs are signal processing systems consisted by an assembly of simple interconnected processing elements (neurons) and in geosciences are mainly used in pattern recognition problems. In this study the feed-forward ANN models are selected, which are theoretically capable of estimating a measurable input-output function to any desired degree of accuracy. The method is implemented at …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:vRqMK49ujn8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "FONASKEIN: An Interactive Software Application for the Practice of the Singing Voice",
            "Publication year": 2016,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/308031033_FONASKEIN_An_interactive_application_software_for_the_practice_of_the_singing_voice/links/57d79fb208ae6399a395b2d9/FONASKEIN-An-interactive-application-software-for-the-practice-of-the-singing-voice.pdf",
            "Abstract": "A number of software applications for the practice of the singing voice have been introduced in the last decades, but all of them are limited to equal tempered scales. In this work, we present the design and development of FONASKEIN, a novel modular interactive software application for the practice of singing voice in real time and with visual feedback for both equal and non-equal tempered scales. Details of the Graphical User Interface of FONASKEIN are given, along with its architecture. The evaluation results of FONASKEIN in a pilot experiment with eight participants and four songs in various musical scales showed its positive effect in practice of the singing voice in all cases.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:W5xh706n7nkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Augmented auditory representation of e-texts for text-to-speech systems",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-44805-5_17",
            "Abstract": "Emerging electronic text formats include hierarchical structure and visualization related information that current Text-to-Speech (TtS) systems ignore. In this paper we present a novel approach for composing detailed auditory representation of e-texts using speech and audio. Furthermore, we provide a scripting language (CAD scripts) for defining specific customizations on the operation of a TtS. CAD scripts can be assigned as well to specific text meta-data to enable their discrete auditory representation. This approach can form a mean for a detailed exchange of functionality across different TtS implementations. Moreover, it can be hosted to current TtS systems with minor (or major) modifications. Finally, we briefly present the implementation of DEMOSTHeNES Composer for augmented auditory generation of meta-text using the above methodology.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Integrating Usability Engineering for Designing the Web Experience: Methodologies and Principles: Methodologies and Principles",
            "Publication year": 2010,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zDFn9c2RVHAC&oi=fnd&pg=PR1&dq=info:UK_3cP9i00sJ:scholar.google.com&ots=iKe1DrRrgV&sig=19L6uHzZY-Pq8-YJwSOEwfyr5cg",
            "Abstract": "As methods that enable or facilitate the development of usable systems for the Web can provide complementary results in enhancing the Web experience, it is important to examine the ways that these methods can be combined and integrated in the development process. Integrating Usability Engineering for Designing the Web Experience: Methodologies and Principles provides a link between theoretical research and Web engineering, presenting a more holistic approach to Internet serviceability. Containing analysis from leading international experts, this publication offers new insights on applications that enable or facilitate the development of usable Web systems.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Speech technologies for blind and low vision persons",
            "Publication year": 2008,
            "Publication url": "https://content.iospress.com/articles/technology-and-disability/tad00250",
            "Abstract": "In this work a review of speech technologies and their applications that provide or augment access to the printed or electronic information, the daily or social activities, as well as the private or public facilities for blind or low vision persons is presented. Speech technologies are currently considered to be essential for providing general purpose interfacing besides providing accessibility for the people who are visually impaired. Speech-enabled devices, reading machines, accessible computers, software applications, World Wide Web (WWW) content and structured environments constitute the main areas addressed throughout this paper with reference to the background technologies, architectures, formats, on-going research activities and projects. In the state-of-the art of the accessibility field, the speech communication channel is considered by the authors as one of the most important modality to benefit the blind and …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "InSIDE: Including Students with Impairments in Distance Education",
            "Publication year": 2020,
            "Publication url": "http://www.inside-project.org/wp-content/uploads/2020/09/WP7-DIS7.5-Electronic-1st-2nd-Newsletters.pdf",
            "Abstract": "Aims and Objectives• Develop and pilot new and innovative, accessible, and inclusive DE programs aiming to improve the quality in Higher Education for individuals with Visual, Hearing and Mobility (ViHeMo) impairments and offering flexible learning and virtual mobility.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:lmc2jWPfTJgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Iterative Design and Evaluation Approach for a Socially-aware Search and Retrieval Application for Digital Archiving",
            "Publication year": 2013,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.386.6211&rep=rep1&type=pdf",
            "Abstract": "Designing user interfaces involves several iterations for usability design and evaluation as well as incremental functionality integration and testing. This paper reports on the methodological approach for the design and implementation of an application that is used for search and retrieval of sociallyaware digital content. It presents the archivist view of professional media organizations and the specific requirements for successful retrieval of content. The content derived from the social media analysis is enormous and appropriate actions need to be taken to avoid irrelevant and/or repeated social information in the displayed results as well as overinformation. The archivist feedback reveals the way humans address the social information as presented in the form of metadata along with the archived raw content and how this drives the design of a dedicated search and retrieval application.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:_xSYboBqXhAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intonation and its uses: Melody in grammar and discourse Intonation and its uses: Melody in grammar and discourse, 1989",
            "Publication year": 2005,
            "Publication url": "https://ci.nii.ac.jp/naid/10015374715/",
            "Abstract": "CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす \n大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり \nすべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考\n文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です（11/11(水\n)-12/23(水)） <no title> BOLINGER D. 被引用文献: 1件 著者 BOLINGER D. 収録刊行物 Intonation \nand its uses : Melody in grammar and discourse Intonation and its uses : Melody in grammar \nand discourse, 1989 Edward Arnold 被引用文献: 1件中 1-1件を 表示 1 Modeling Improved \nProsody Generation from High-Level Linguistically Annotated Corpora XYDAS Gerasimos , \nSPILIOTOPOULOS Dimitris , KOUROUPETROGLOU Georgios IEICE transactions on \ninformation and systems 88(3), 510-518, 2005-03-01 参考文献26件 CiNii利用者アンケート 各種(/…",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Diction based prosody modeling in table-to-speech synthesis",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11551874_38",
            "Abstract": "Transferring a structure from the visual modality to the aural one presents a difficult challenge. In this work we are experimenting with prosody modeling for the synthesized speech representation of tabulated structures. This is achieved by analyzing naturally spoken descriptions of data tables and a following feedback by blind and sighted users. The derived prosodic phrase accent and pause break placement and values are examined in terms of successfully conveying semantically important visual information through prosody control in Table-to-Speech synthesis. Finally, the quality of the information provision of synthesized tables when utilizing the proposed prosody specification is studied against plain synthesis.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Environmental information required by individuals with visual impairments who use orientation and mobility aids to navigate campuses",
            "Publication year": 2020,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0145482X20941312",
            "Abstract": "This study investigated the user requirements of individuals with visual impairments regarding the information to be included in orientation and mobility (O&M) aids in order for optimally useful audio-tactile maps of campuses to be developed. In addition, this study aimed at investigating the importance (usefulness) that individuals with visual impairments attribute to environmental information of campuses.The researchers listed 213 pieces of environmental information concerning campuses and address them in survey by conducting a respective questionnaire. Participants were asked to evaluate the information, regarding the importance or usefulness of the information in regard to safety, location of services, and orientation and wayfinding during movement. Through convenience sampling 115 adults (aged from 18 to 64 years) with visual impairments from four countries (Greece, Cyprus, Turkey …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:gsN89kCJA0AC",
            "Publisher": "SAGE Publications"
        },
        {
            "Title": "SMC’07",
            "Publication year": 2007,
            "Publication url": "https://www.researchgate.net/profile/Anastasia-Georgaki/publication/230735474_S_M_C_'_0_7_4th_Sound_and_Music_Computing_Conference/links/09e41503b900f9fc9a000000/S-M-C-0-7-4th-Sound-and-Music-Computing-Conference.pdf",
            "Abstract": "SMC’07 Page 1 SMC’07 4th Sound and Music Computing Conference 11-13 July 2007, \nLefkada, Greece PROCEEDINGS Edited by: Charalampos Spyridis, Anastasia Georgaki, \nGeorgios Kouroupetroglou and Christina Anagnostopoulou Organised by: National and \nKapodistrian University of Athens Laboratory of Music Technology & Acoustics, Department \nof Music Studies Signal Processing Laboratory, Department of Informatics and \nTelecommunications in collaboration with the: Ionian University Department of Music \nStudies Page 2 II PROCEEDINGS 4th Sound and Music Computing Conference Title: \nProceedings of the 4th Sound and Music Computing Conference Editors: C. Spyridis, A. \nGeorgaki, G. Kouroupetroglou, C. Anagnostopoulou Edited at: Laboratory of Music \nTechnology & Acoustics, Department of Music Studies Signal Processing Laboratory, \nDepartment of Informatics and Telecommunications National …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:9Nmd_mFXekcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Designing an educational scenario using the principles of universal design for learning",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6901590/",
            "Abstract": "Grounded on new research in neuroscience Universal Design for Learning (UDL) constitutes an educational approach that promotes access, participation and progress in the general curriculum for all. UDL recognises the need to create opportunities for the inclusion of diverse learners by providing curricula and instructional activities that allow for multiple means of representation, expression, and engagement. In the first decade of its development, the emphasis in the domain of UDL was on the use of technology to inclusive education and accessibility for the disabled. Although UDL has great potential it has been hard to implement on a large scale. UDL requires collaborative planning amongst teachers with different curriculum knowledge and skills. Complaints that are often raised include lack of time to co-plan and lack of resources to teach a differentiated curriculum. Open Discovery Space is a portal to browse …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:geHnlv5EZngC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Acoustic analysis of musical intervals in modern Byzantine Chant scales",
            "Publication year": 2008,
            "Publication url": "https://asa.scitation.org/doi/abs/10.1121/1.2968299",
            "Abstract": "The goal of this work is to investigate experimentally the music intervals in modern Byzantine Chant performance and to compare the obtained results with the equal temperament scales introduced by the Patriarchal Music Committee (PMC). Current measurements resulted from pressure and electroglottographic recordings of 13 famous chanters singing scales of all the music genera. The scales’ microintervals were derived after pitch detection based on autocorrelation, cepstrum, and harmonic product spectrum analysis. The microintervallic differences between the experimental values and the PMC’s ones were statistically analyzed indicating large deviation of the mean values and the standard deviations. Significant interaction effects were identified among some genera and between ascending and descending scale directions.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Acoustical Society of America"
        },
        {
            "Title": "Προσβασιμότητα ΑμεΑ στο Διαδίκτυο",
            "Publication year": 2016,
            "Publication url": "https://edulll.ekt.gr/edulll/bitstream/10795/1878/2/1878_%CE%9A%CE%9F%CE%A5%CE%A1%CE%9F%CE%A5%CE%A0%CE%95%CE%A4%CE%A1%CE%9F%CE%93%CE%9B%CE%9F%CE%A5.pdf",
            "Abstract": "24.5: Τα Συμβαλλόμενα Κράτη διασφαλίζουν ότι τα άτομα με αναπηρίες είναι σε θέση να έχουν πρόσβαση στη γενική τριτοβάθμια εκπαίδευση, στην επαγγελματική κατάρτιση, στην εκπαίδευση ενηλίκων και στη δια βίου μάθηση, χωρίς διακρίσεις και σε ίση βάση με τους άλλους. Για το λόγο αυτό, τα Συμβαλλόμενα Κράτη διασφαλίζουν ότι παρέχεται εύλογη προσαρμογή στα άτομα με αναπηρίες.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:oNZyr7d5Mn4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Discrimination and perception of the acoustic rendition of texts by blind people",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73283-9_24",
            "Abstract": "This paper reports on the results from a series of psychoacoustic experiments in the field of the auditory representation of texts via synthetic speech which comprise similar acoustic patterns so called “paronyms”. The errors which occur when listening to paronyms are classified as errors of phonological type. Thirty blind and thirty sighted students participated in psychoacoustic experiments. The results from the experiments depicted the types of the subjects’ errors and addressed comparisons between the performances of blind and sighted students on their auditory distinctions towards the chosen scripts (paronym words and sentences with paronyms). The discussion considered the practical implications of the findings such as issues regarding education as well as the development of suitable design of acoustic rendition of texts in favor of better perception and comprehension.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Transforming spontaneous telegraphic language to well-formed greek sentences for alternative and augmentative communication",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-46014-4_15",
            "Abstract": "The domain of Augmentative and Alternative Communication (AAC) studies appropriate techniques and systems that enhance or accomplish the retaining or non-existing abilities for interpersonal communication. Some AAC users apply telegraphic language, as they attempt to speed up the interactive communication or because they are language impaired. In many AAC aids, a “sentence” is formulated by combining symbols of an icon-based communication system. To be accepted by the communication partner, the output should be a correct oral sentence of a natural language. In this paper we present our effort to develop a novel technique for expanding spontaneous telegraphic input to well-formed Greek sentences, by adopting a feature-based surface realization for Natural Language generation. We first describe the general architecture of the system that accepts compressed, incomplete, grammatically …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Web Enabled Teaching Aid for Non-orthographic Languages",
            "Publication year": 2000,
            "Publication url": "https://www.learntechlib.org/p/15915/",
            "Abstract": "In conjunction with the technological advancements of Telecommunications and Information Technology and the outbreak of the World Wide Web (WWW), the production of educational software is undergoing a shift towards the shared resource paradigm. Recognizing the need expressed by people with special needs and special education teachers in enabling students to access such resources, this paper describes the design and the implementation of a Web-based, open system for the effective support of the teaching process of non-orthographic languages for people with special needs. There will be a discussion on user requirements, system specifications and characteristics as well as the system's architecture. Features that enable learner centered education and fulfill teachers' needs to prepare, organize and update the training material in a cost-effective manner and focus on content specification and other …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "VoiceWeb: Spoken dialogue interfaces and usability",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/voiceweb-spoken-dialogue-interfaces-usability/53068",
            "Abstract": "This chapter presents the state-of-the-art in usability issues and methodologies for VoiceWeb interfaces. It undertakes a theoretical perspective to the usability methodology and provides a framework description for creating and testing usable content and applications for conversational interfaces. The methodologies and their uses are discussed as well as certain technical issues that are of specific importance for each type of system. Moreover, it discusses the hands-on approaches for applying usability methodologies in a spoken dialogue web application environment, including methodological and design issues, resource management, implementation using existing technologies for usability evaluation in several stages of the design and deployment. Finally, the challenging usability issues and parameters of the emerging advanced speech-enabled web interfaces are presented.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:lSLTfruPkqcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Formant tuning in Byzantine chant",
            "Publication year": 2013,
            "Publication url": "http://speech.di.uoa.gr/sppages/spppdf/SMC2013_Proceedings_formant%20tuning.pdf",
            "Abstract": "We present an investigation of formant tuning in the context of the Byzantine Ecclesiastic chant voice. The recordings selected for the analysis are part of the DAMASKINOS prototype acoustic corpus of Byzantine Ecclesiastic voice. More specifically, we analyzed recordings from 10 different chanters in ascending musical scales of the diatonic genre, for the/a/vowel. The method of analysis included a semi-automatic segmentation of the audio material, extraction of the measurements in PRAAT and the final post-processing in MATLAB. Results show clear evidence of formant tuning in at least six of the chanters, proving that the technique is in use by the modern Byzantine music performers.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An Open Platform for Conducting Psycho-Acoustic Experiments in the Auditory Representation of Web Documents",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/50818441/xydas_acoustic2004-final.pdf",
            "Abstract": "This work presents an open, XML-based, graphical environment, for conducting complex experiments in the field of the auditory representation of visual format of documents like the ones that are published in the World Wide Web. We allow the user to (a) de-compile the source structure of Web documents generating a logical layer that abstractly represents of the visual meta-information the document carry and (b) to create distinctive sound fonts in an arbitrary way that map of the metainformation to prosodic parameters and non-speech audio elements. Using this platform, we performed a set of psycho-acoustic experiments with blind and sighted students for the evaluation of the appropriateness and performance of several sound fonts in the auditory representation of visual components in cases of HTML",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using Wiimote for 2D and 3D pointing tasks: gesture performance evaluation",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-34182-3_2",
            "Abstract": "We present two studies to comparatively evaluate the performance of gesture-based 2D and 3D pointing tasks. In both of them, a Wiimote controller and a standard mouse were used by six participants. For the 3D experiments we introduce a novel configuration analogous to the ISO 9241-9 standard methodology. We examine the pointing devices’ conformance to Fitts’ law and we measure eight extra parameters that describe more accurately the cursor movement trajectory. For the 2D tasks using Wiimote, Throughput is 41,2% lower than using the mouse, target re-entry is almost the same, and missed clicks count is three times higher. For the 3D tasks using Wiimote, Throughput is 56,1% lower than using the mouse, target re-entry is increased by almost 50%, and missed clicks count is sixteen times higher.Fitts’ law, 3D pointing, Gesture User Interface, Wiimote",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Reading comprehension issues and individuals with visual impairments: the effects of using 8-dot and 6-dot braille code through a braille display",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-20681-3_7",
            "Abstract": "The purpose of the present study was to evaluate the effects of 6-dot and 8-dot braille code on the reading comprehension ability of individuals with severe visual impairments and/or blindness when the latter receive typographic meta-data (bold and italic) by touch through a braille display. Also, patterns of hand movements were investigated and related to issues of comprehension. The most important finding related to the superiority of the 8-dot braille code in predicting reading comprehension in individuals with severe visual impairments. It was also found that reading comprehension was particularly predicted from the negative relationship between participants’ fluency and comprehension. It was conjectured that all comparisons between conditions were significant suggesting that the present findings were likely robust and not reflective of idiosyncrasies in the sample. The focus of the discussion was …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Artificial neural network based methodologies for the estimation of wind speed",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4471-5143-2_12",
            "Abstract": "Recent advances in artificial neural networks (ANN) propose an alternative promising methodological approach to the problem of time series assessment as well as point spatial interpolation of irregularly and gridded data. In the field of wind power sustainable energy systems ANNs can be used as function approximators to estimate both the time and spatial wind speed distributions based on observational data. The first part of this work reviews the theoretical background, the mathematical formulation, the relative advantages, and limitations of ANN methodologies applicable to the field of wind speed time series and spatial modeling. The second part focuses on implementation issues and on evaluating the accuracy of the aforementioned methodologies using a set of metrics in the case of a specific region with complex terrain. A number of alternative feedforward ANN topologies have been applied in order …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Springer, London"
        },
        {
            "Title": "Vibrato detection in byzantine chant music",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6877955/",
            "Abstract": "Vibrato's existence has been recently presented in the context of Byzantine Chant Music (BMC); but further studies on the phenomenon require a robust method for the detection of vibrato segments inside large acoustic corpora. In this work we present a digital signal processing approach for vibrato detection in (BCM) recordings and report the accuracy of the results. The two main tasks of the process are: onset-offset detection and vibrato identification and extraction. For the first task sound level and frequency level of the acoustical signal are used to determine all possible points for such transitions. The second task was based on fundamental frequency analysis using the YIN algorithm. Extra smoothing was applied to resolve issues from high frequency noise. Evaluation was performed by conducting a psychoacoustic experiment. Results show that the detection process proved to be accurate enough for processing …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:tS2w5q8j5-wC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Usability methodologies for real-life voice user interfaces",
            "Publication year": 2009,
            "Publication url": "https://www.igi-global.com/article/usability-methodologies-real-life-voice/40345",
            "Abstract": "This paper studies the usability methodologies for spoken dialogue web interfaces along with the appropriate designer-needs analysis. The work unfolds a theoretical perspective to the methods that are extensively used and provides a framework description for creating and testing usable content and applications for conversational interfaces. The main concerns include the design issues for usability testing and evaluation during the development lifecycle, the basic customer experience metrics and the problems that arise after the deployment of real-life systems. Through the discussion of the evaluation and testing methods, this paper argues on the importance and the potential of wizard-based functional assessment and usability testing for deployed systems, presenting an appropriate environment as part of an integrated development framework.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:J_g5lzvAfSwC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Deriving accessible science books for the blind students of physics",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3322361",
            "Abstract": "We present a novel integrated methodology for the development and production of accessible physics and science books from the elementary up to tertiary educational levels. This language independent approach adopts the Design‐for‐All principles, the available international standards for alternative formats and the Universal Design for Learning (UDL) Guidelines. Moreover it supports both static (embossed and refreshable tactile) and dynamic (based on synthetic speech and other sounds) accessibility. It can produce Tactile Books (Embossed Braille and Tactile Graphics), Digital Talking Books (or Digital Audio Books), Large Print Books as well as Acoustic‐Tactile Books for the blind and visually impaired students as well as but for the print‐disabled. This methodology has been successfully applied in the case of blind students of the Physics, Mathematics and Informatics Departments in the University of Athens.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:k_IJM867U9cC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Upper limb motor skills performance evaluation based on point-and-click cursor trajectory analysis: application in early multiple sclerosis detection",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8653817/",
            "Abstract": "We present an enhanced version of the input device evaluation application (IDEA) system as an objective method for evaluating upper limb motor skills performance. By introducing three new metrics for mouse cursor trajectory analysis, along with the application of the two-dimensional (2D) experiment in the case of multiple sclerosis (MS), we examine the sensitivity of the IDEA system for differentiating patients with early-stage MS and healthy participants. The IDEA system calculates multiple kinematic metrics for point-and-click tasks: movement time, index of difficulty, effective target width, effective index of difficulty, throughput, missed clicks, target re-entry, task axis crossing, movement direction change, orthogonal direction change, movement variability, movement error, movement offset, mean velocity, velocity peaks, and maximum/mean velocity ratio. The results reveal that the IDEA system sensitivity has been …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:uWiczbcajpAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance comparison of self-organizing maps and k-means clustering techniques for atmospheric circulation classification",
            "Publication year": 2014,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/269279035_Performance_Comparison_of_Self-Organizing_Maps_and_k-means_Clustering_Techniques_for_Atmospheric_Circulation_Classification/links/548617ed0cf2ef34478bf456/Performance-Comparison-of-Self-Organizing-Maps-and-k-means-Clustering-Techniques-for-Atmospheric-Circulation-Classification.pdf",
            "Abstract": "We present a comparative performance analysis between the patterns resulting from the Kohohen’s Self-Organizing Maps (SOM) and the k-means clustering approaches in the domain of atmospheric circulation type classification. The study utilizes mean daily sea level pressure (MSLP) data for the spring months of a 62-year period (1948 to 2009) on a grid with 2.5ox2. 5o in the area of southeastern Europe. Both schemes provide realistic classifications, differentiating in the number of the resulting circulation patterns. The two methods are compared by examining the distribution of each SOM circulation type members (days) to every k-means type and by investigating the pressure field correspondence along with their monthly and cumulative frequencies of occurrence. High similarity is observed, especially for the patterns where atmospheric circulation is controlled from high-pressure barometric systems. The SOM method is found to be superior, due to its ability to generate a non-linear classification and produce a map where closely related atmospheric modes are described by neighboring neurons and positioned in adjacent locations.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ULYSSES: A framework for incorporating multi-vendor components in interpersonal communication applications",
            "Publication year": 2001,
            "Publication url": "https://www.researchgate.net/profile/Alexandros-Pino/publication/233748465_ULYSSES_A_Framework_for_Incorporating_Multi-vendor_Components_in_Interpersonal_Communication_Applications/links/0912f50b13c46ea283000000/ULYSSES-A-Framework-for-Incorporating-Multi-vendor-Components-in-Interpersonal-Communication-Applications.pdf",
            "Abstract": "In this paper the ULYSSES framework for designing and developing Interpersonal Communication Aids is presented. It consists of a component-based architecture that aims to simplify the integration of multi-vendor components in low cost applications. For component developers ULYSSES provides an engineering-forreuse environment with guidelines and tools to build software components, which can operate effectively and interact with each other transparently, without even being aware of each other’s existence. Components with different functionality, developed by independent manufacturers can be deployed using various programming languages. Furthermore, ULYSSES grants a process of engineering-with-reuse for system integrators to take advantage of the reusable assets produced during engineering-for-reuse. Thus, selection and assembly of components on demand for building user-specific robust …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An evaluation methodology of math-to-speech in non-English DAISY digital talking books",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-41264-1_4",
            "Abstract": "The DAISY 3 MathML Modular Extension allows all of the features of a Digital Talking Book to work for math, just as they do for literary text. But this extension does not specify details about advanced MathML players on the localization (i.e. support of a specific native language), support of multilingual mathematical or textual content, cultural differences or user preferences. In this work we present the methodology, we have developed to evaluate in a systematic way the correctness of the Math-to-Speech rendering by investigating specific steps during the production and rendering phases for non-English DAISY Digital Talking Math Books. We define four types of errors in the math expressions: deletions (D), insertions (I), substitutions (S) and translations (T). More-over, we propose an appropriate corpus of mathematical expressions that facilitates the evaluation of the proposed methodology. Then, we have …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:hkOj_22Ku90C",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Multilingual personalized information objects",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/1-4020-3051-7_9.pdf",
            "Abstract": "In a world of burgeoning information resources we need evermore responsive and intelligent ways of locating and delivering them. The M-PIRO project (Multilingual Personalized Information Objects) aims at bringing together leading research work on natural language generation (NLG) and speech synthesis, with multimedia database, information management and virtual reality technologies developed for public access to museum and gallery resources. M-PIRO targets the concept of personalized information objects ņ that is, entities capable of responding to requests for information by taking into account what the requester already knows, what they are most interested in, and how the related information is to be made available.The chosen context is cultural heritage: the project works closely with museums, galleries, and other “memory institutions” to develop technology responsive to their special needs. Museum …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Dordrecht"
        },
        {
            "Title": "Designing user interfaces for social media driven digital preservation and information retrieval",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-31522-0_87",
            "Abstract": "Social Media provide a vast amount of information identifying stories, events, entities that play the crucial role of shaping the community in an everyday heavy user involvement. This work involves the study of social media information in terms of type (multimodal: text, video, sound, picture) and role players (agents, users, opinion leaders) and the potential of designing accessible, usable interfaces that integrate that information. This case examines the design of a user interface that uses an underlying engine for modality components (plain text, sound, image, video) analysis, social media crawling, contextual search fusion and semantic analysis. The interface is the only point of user interaction to the world of knowledge. This work reports on the usability and accessibility methods and concerns for the user requirements phase and the design control and testing. The findings of the pilot user testing and …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:TQgYirikUcIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Musical instrument recognition and classification using time encoded signal processing and fast artificial neural networks",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11752912_26",
            "Abstract": "Traditionally, musical instrument recognition is mainly based on frequency domain analysis (sinusoidal analysis, cepstral coefficients) and shape analysis to extract a set of various features. Instruments are usually classified using k-NN classifiers, HMM, Kohonen SOM and Neural Networks. In this work, we describe a system for the recognition of musical instruments from isolated notes. We are introducing the use of a Time Encoded Signal Processing method to produce simple matrices from complex sound waveforms, for instrument note encoding and recognition. These matrices are presented to a Fast Artificial Neural Network (FANN) to perform instrument recognition with promising results in organ classification and reduced computational cost. The evaluation material consists of 470 tones from 19 musical instruments synthesized with 5 wide used synthesizers (Microsoft Synth, Creative SB Live! Synth …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Experimental Evaluation of Tree-Based Algorithms",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=7811114284107686189&hl=en&oi=scholarr",
            "Abstract": "The prosodic specification of an utterance to be spoken by a Text-to-Speech synthesis system can be devised in break indices, pitch accents and boundary tones. In particular, the identification of break indices formulates the intonational phrase breaks that affect all the forthcoming prosody-related proce-dures. In the present paper we use tree-structured predictors, and specifically the commonly used in similar tasks CART and the introduced C4. 5 one, to cope with the task of break placement in the presence of shallow textual features. We have utilized two 500-utterance prosodic corpora offered by two Greek universities in order to compare the machine learning approaches and to argue on the robust-ness they offer for Greek break modeling. The evaluation of the resulted models revealed that both approaches were positively compared with similar works published for other languages, while the C4. 5 method accuracy scaled from 1% to 2, 7% better than CART.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:e_rmSamDkqQC",
            "Publisher": "Springer,."
        },
        {
            "Title": "An assessment of self-organizing maps and k-means clustering approaches for atmospheric circulation classification",
            "Publication year": 2014,
            "Publication url": "http://universitypress.org.uk/library/2014/venice/ENVIR.pdf#page=17",
            "Abstract": "This study presents an analysis and comparison between the application of self-organizing maps (SOM) and the kmeans clustering approaches in the field of atmospheric circulation classification, focusing in the area of southeastern Europe. Circulation type classification is a significant aspect of climate research in terms of examining the large-scale atmospheric variability and its relationship with local climate parameters. The study utilizes mean daily sea level pressure (MSLP) data for the spring months of a 62-year period (1948 to 2009) on a grid with 2.5ox2. 5o resolution. Both schemes provide realistic classifications, differentiating in the number of the resulting circulation patterns. The two methods are compared by examining the distribution of each SOM circulation type members (days) to every k-means type and by investigating the pressure field correspondence along with their frequencies of occurrence. High similarity is observed, especially for the patterns where atmospheric circulation is controlled from high-pressure barometric systems. The SOM method is found to be superior, due to its ability to generate a non-linear classification and produce a map where closely related atmospheric modes are described by neighboring neurons and positioned in adjacent locations.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Accessibility of board and presentations in the classroom: a design-for-all approach",
            "Publication year": 2008,
            "Publication url": "https://www.researchgate.net/profile/Georgios-Kouroupetroglou/publication/233415536_Accessibility_of_board_and_presentations_in_the_classroom_A_design-for-all_approach/links/0fcfd50add91380461000000/Accessibility-of-board-and-presentations-in-the-classroom-A-design-for-all-approach.pdf",
            "Abstract": "This paper presents a real-time XML-based architecture that supports multimodal accessibility of the board and the presentations in the classroom. This system can support content from books, or other educational material, either in printed or in electronic format. It is language and content independent. This approach includes, as an intermediate step, the production of DTBs compliant documents. Two different methodologies for the multimodal rendering of documents’ text formatting, structure and layout meta-data are used, the first based on semantic extraction and the second on the reader’s emotional state extraction. Implementation details are also provided.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design and Development of an Automated Voice Agent: Theory and Practice Brought Together",
            "Publication year": 2011,
            "Publication url": "https://www.igi-global.com/chapter/design-development-automated-voice-agent/54645",
            "Abstract": "Sophisticated, commercially deployed spoken dialogue systems capable of engaging in more natural human-machine conversation have increased in number over the past years. Besides employing advanced interpretation and dialogue management technologies, the success of such systems greatly depends on effective design and development methodology. There is, actually, a widely acknowledged, fundamentally reciprocal relationship between technologies used and design choices. In this line of thought, this chapter constitutes a more practical approach to spoken dialogue system development, comparing design methods and implementation tools highly suited for industry oriented spoken dialogue systems, and commenting on their interdependencies, in order to facilitate the developer’s choice of the optimal tools and methodologies. The latter are presented and assessed in the light of AVA, a real-life …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "A semi-automated tagging methodology for Orthodox Ecclesiastic Chant Acoustic corpora",
            "Publication year": 2007,
            "Publication url": "http://smc07.uoa.gr/SMC07%20Proceedings/SMC07%20Paper%2020.pdf",
            "Abstract": "This paper addresses the problem of using a semi automated process for tagging lyrics, notation and musical interval metadata of an Orthodox Ecclesiastic Chant (OEC) voice corpus. The recordings are post processed and segmented using the PRAAT software tool. Boundaries are placed, thus creating intervals where all tagging metadata will be embedded. The metadata are encoded and then inserted as labels in the segmented file. The methodology and processes involved in this tagging process are described along with its evaluation with the DAMASKINOS prototype Acoustic Corpus of Byzantine Ecclesiastic Chant Voices.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Perspective-Taking in Blindness: An Event-Related Brain Potentials Study With the Continuous Wavelet Transform",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9076624/",
            "Abstract": "This study presents brain electrophysiological characteristics of perspective-taking for blind individuals ver. sighted ones, aiming to extend our knowledge on social concept formation with visual sensory modality loss. A blind and a sighted group instructed to consider the moral dilemmas therein from a neutral (observer), a morally positive or a negative stance, after the auditory presentation of Aesop's fables. We recorded the basic emotions evoked by every stance in each fable, and the late positive potentials (LPP) component of Event-Related Potential detected with Continuous Wavelet Transform, believed to reflect the sustained attention and stimuli encoding processes. Blind participants demonstrated: i) significantly attenuated LPP amplitudes at distributed brain areas, particularly at leads T3, P4, O2, T6, Cz, Pz, CPz and CP4 (p values 0.026-0.003), ii) prolonged LPP latencies at parietal areas, at leads CP4 (p=0 …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:L7CI7m0gUJcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A model of accessibility services provision for students with disabilities in higher education",
            "Publication year": 2011,
            "Publication url": "http://access.uoa.gr/Unit%20Publicity%20Files/Kouroupetroglou_Brno_2011.pdf",
            "Abstract": "National and Kapodistrian University of Athens, Accessibility Unit for Students with Disabilities, Panepistimiopolis, Ilissia, GR-15784, Athens, Greece E-mail:{koupe, pino, c. katsori}@ di. uoa. gr",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computers Helping People with Special Needs: 11th International Conference, ICCHP 2008, Linz, Austria, July 9-11, 2008, Proceedings",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=hjtuCQAAQBAJ&oi=fnd&pg=PR2&dq=info:kwD5Fl4E_lcJ:scholar.google.com&ots=-yBJxdH4rN&sig=ea_TKXc7dZEBS5T3aW8mI4Ey3zw",
            "Abstract": "Welcome to the proceedings of ICCHP 2008. We were proud to welcome participants from more than 40 countries from all con-nents to ICCHP. The International Programme Committee, encompassing 102 experts form all over the world, selected 150 full and 40 short papers out of 360 abstracts submitted to ICCHP. Our acceptance rate of about half of the submissions, demonstrates the scientific quality of the programme and in particular the proceedings you have in your hands. An impressive group of experts agreed to organize “Special Thematic Sessions”(STS) for ICCHP 2008. The existence of these STS sessions helped to bring the me-ing into sharper focus in several key areas of assistive technology. In turn, this deeper level of focus helped to bring together the state-of-the-art and mainstream technical, social, cultural and political developments. Our keynote speaker, Jim Fruchterman from BeneTech, USA highlighted the-portance of giving access to ICT and AT at a global level. In another keynote by H-old Thimbleby, Swansea University, UK, the role of user-centred design and usability engineering in assistive technology and accessibility was addressed. And finally, a combination keynote and panel discussion was reserved for WAI/WCAG2. 0, which we expect to be the new reference point for Web accessibility from the summer of 2008 and beyond.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Springer"
        },
        {
            "Title": "An open machine translation system for augmentative and alternative communication",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45491-8_135",
            "Abstract": "In this paper we describe the characteristics of an open system we designed and implemented that adds Machine Translation (MT) capabilities into Augmentative and Alternative Communication (AAC) applications. In particular, we present the basis for an open MT framework that can easily integrate with component-based developments especially regarding interpersonal communication and information presentation, either in standalone or web-based applications. We concentrate on the system’s core, an expandable database of multimedia elements, which offers uniform management of multiple representations of concepts in both natural languages and symbolic communication systems, allowing concept-by-concept omnidirectional translation. Applications of the system are also presented, along with brief pointers on current work for possible extensions and improvements.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Artificial neural network based methodologies for the spatial and temporal estimation of air temperature",
            "Publication year": 2013,
            "Publication url": "https://www.scitepress.org/Papers/2013/43739/43739.pdf",
            "Abstract": "Artificial Neural Networks (ANN) propose an alternative promising methodological approach to the problem of time series assessment as well as point spatial interpolation of irregularly and gridded data. ANNs can be used as function approximators to estimate both the time and spatial air temperature distributions based on observational data. After reviewing the theoretical background as well as the relative advantages and limitations of ANN methodologies applicable to the field of air temperature time series and spatial modelling, this work focuses on implementation issues and on evaluating the accuracy of the AAN methodologies using a set of metrics in the case of a specific region with complex terrain. A number of alternative feed forward ANN topologies have been applied in order to assess the spatial and time series air temperature prediction capabilities in different horizons. For the temporal forecasting of air temperature ANNs were trained using the Levenberg-Marquardt back propagation algorithm with the optimum architecture being the one that minimizes the Mean Absolute Error on the validation set. For the spatial estimation of air temperature the Radial Basis Function and Multilayer Perceptrons non-linear Feed Forward AANs schemes are compared. The underlying air temperature temporal and spatial variability is found to be modeled efficiently by the ANNs.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:f2IySw72cVMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A network of peers and practices for addressing Learner Variability: UDLnet.",
            "Publication year": 2015,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=arppCgAAQBAJ&oi=fnd&pg=PA32&dq=info:wbKGMSdFgGUJ:scholar.google.com&ots=gLO4kWm6S7&sig=v6htZABp1pJ3dBMUtJ36MWeCn4Q",
            "Abstract": "Grounded on new research in neuroscience and the Design for All principles, Universal Design for Learning (UDL) constitutes an educational approach that promotes access, participation and progress in the general curriculum for all learners. The difficulty is in all cases translating the UDL principles and guidelines into practice. Though the UDL policy context supports a shift to inclusion, professionals need more support to develop their practice. In order to bridge the gap between policies and practice the UDLnet network aspires to address this necessity collecting and creating good practices under the framework of Universal Design for Learning. This paper presents the UDLnet project, its aims, the methodological framework, as well as the envisaged themes. UDLnet is a European network that aims to contribute to the improvement of teachers’ practice in all areas of their work, combining ICT skills with UDL-based innovations in pedagogy, curriculum, and institutional organization.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:Y5dfb0dijaUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Eliminating the distance between intelligent and not intelligent systems",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/890632/",
            "Abstract": "The intelligent learning system (ITS) is addressed to the individuality of the learner and is adapted to the student's model. It contains operations or modules like the knowledge engineer, the scenarios for didactic and learning strategies, the student model, the problem solving mechanism, quantity to quality and vice-versa transformation processes, etc. Every module or operation is a separate object for research and investigation. This is derived from the specification and the functioning of the ideal model of an intelligent system for educational purposes. The opposite of the intelligent system is a courseware (COR) on a specific topic, for a given educational level, containing only a student record and guidelines for the teacher. The article presents some approaches to eliminate the distance between an ITS and a COR, given that the implemented intelligent tools are very few and the available technology (multimedia …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Integrating contrast in a framework for predicting prosody",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-12116-6_63",
            "Abstract": "Information Structure (IS) is known to bear a significant effect on Prosody, making the identification of this effect crucial for improving the quality of synthetic speech. Recent theories identify contrast as a central IS element affecting accentuation. This paper presents the results of two experiments aiming to investigate the function of the different levels of contrast within the topic and focus of the utterance, and their effect on the prosody of Greek. Analysis showed that distinguishing between at least two contrast types is important for determining the appropriate accent type, and, therefore, such a distinction should be included in a description of the IS – Prosody interaction. For this description to be useful for practical applications, a framework is required that makes this information accessible to the speech synthesizer. This work reports on such a language-independent framework integration of all identified …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A Recursive Mapping System for Motion and Sound in a Robot between Human Interaction Design.",
            "Publication year": 2014,
            "Publication url": "https://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/1649.pdf",
            "Abstract": "We present in this article an artistic human-robot interaction form, which allows us to engage and evolve new experiences through to use of artificial animate behavior, kinesis and generated sound in a feedback communication medium. This meta system, which could be regarded also as one total composed instrument, is a recursive interaction process between its agents; a robot arm, human body and a sound space being rendered artificially. The computational modeling of this embodied approach is explained and a proto-type of the experiment is shown as a real tool to test empirically this artistic concept.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:EkHepimYqZsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acoustic rendering of data tables using earcons and prosody for document accessibility",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-02713-0_62",
            "Abstract": "Earlier works show that using a prosody specification that is derived from natural human spoken rendition, increases the naturalness and overall acceptance of speech synthesised complex visual structures by conveying to audio certain semantic information hidden in the visual structure. However, prosody alone, although exhibits significant improvement, cannot perform adequately in the cases of very large complex data tables browsed in a linear manner. This work reports on the use of earcons and spearcons combined with prosodically enriched aural rendition of simple and complex tables. Three spoken combinations earcons+prosody, spearcons+prosody, and prosody were evaluated in order to examine how the resulting acoustic output would improve the document-to-audio semantic correlation throughput from the visual modality. The results show that the use of non-speech sounds can further …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optimal acoustic reverberation evaluation of Byzantine chanting in churches",
            "Publication year": 2014,
            "Publication url": "http://speech.di.uoa.gr/ICMC-SMC-2014/images/VOL_2/0941.pdf",
            "Abstract": "Byzantine chants constitute a form of monophonic vocal music characterized by lengthy phrases and by musical scales with intervals smaller than the western music semitones. Byzantine churches have extremely long Reverberation Time and their acoustics is dominated by the contributions of the diffuse sound field. Thus, the sound character of Byzantine chanting is closely linked to the acoustic reverberation. In this work we examine the perceived preference for the various features of reverberation imposed on excerpts of Byzantine psalms. This is achieved by simulations of typical churches with varying internal volume, reverberation time and source/receiver distance, utilizing chants from the DAMASKINOS corpus. The simulation (auralization) results were evaluated via statistical preference method using a group of 15 listeners. The results of such controlled experiments illustrate the listener preferences and acceptability of various parameters or combinations of parameters related to reverberation, eg of the Reverberation Time value in relation to church dimensions and listener position inside the church.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An intonation model for embedded devices based on natural F0 samples",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=17636156700851624593&hl=en&oi=scholarr",
            "Abstract": "The evolution of hand-held devices has made possible the porting of high quality Text-to-Speech systems to embedded platforms. However, linguistic resources required to build natural-sounding prosody models still need to be scaled down, to meet the hardware specifications of the devices. In this work, we present a compact intonation model that brings together the naturalness of corpus based prosody modeling with the limited nature of the embedded TtS applications. A sampling process of 3 points per syllable over a small set of appropriately set up utterances is used as the tonal unit database. The sampled points are applied at synthesis time over an onset/offset syllabic structuring of phrases. The model requires less than 1KB of storage for modeling each prosodic phrase class. The application to the Greek language is being demonstrated utilizing only lexical stress information.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Acoustic mapping of visual text signals through advanced text-to-speech: the case of font size",
            "Publication year": 2015,
            "Publication url": "http://www.wseas.us/journal/pdf/computers/2015/b105805-098.pdf",
            "Abstract": "Current Text-to-Speech systems, commonly used for document accessibility, do not include an effective and standard acoustic provision of the visual typographic cues embedded in them. In this work, we first introduce the text signals (ie the writing devices that emphasize aspects of a text’s content or structure) along with an appropriate architecture for the structure of documents as well as the main principles and technological topics of document accessibility. Then, the emerging technological approach of Document-to-Audio (DtA) we have developed is presented. DtA essentially constitutes the next generation of Text-to-Speech systems that supports the acoustic mapping of visual text-signals and thus provides much better accessibility to documents. Finally, for the case of the font size in the typographic layer, we present the results of two quantitative approaches (direct mapping and emotional-based mapping) for the rendering of text signals through DtA.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:z_wVstp3MssC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tone-Group F0 selection for modeling focus prominence in small-footprint speech synthesis",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167639306000136",
            "Abstract": "This work targets to improve the naturalness of synthetic intonational contours in Text-to-Speech synthesis through the provision of prominence, which is a major expression of human speech. Focusing on the tonal dimension of emphasis, we present a robust unit-selection methodology for generating realistic F0 curves in cases where focus prominence is required. The proposed approach is based on selecting Tone-Group units from commonly used prosodic corpora that are automatically transcribed as patterns of syllables. In contrast to related approaches, patterns represent only the most perceivable sections of the sampled curves and are encoded to serve morphologically different sequence of syllables. This results in a minimization of the required amount of units so as to achieve sufficient coverage within the database. Nevertheless, this optimization enables the application of high-quality F0 generation to small …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Acoustic modeling of dialogue elements for document accessibility",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21657-2_19",
            "Abstract": "Document-to-Audio accessibility assumes that all meaningful presentaion elements in the document, such as bold, italics, tables or bullets, should be properly processed and acoustically modeled, in order to convey the intended meaning to the listeners in a complete and adequate manner. Similarly, several types of documents may contain reported speech and dialogue content signaled through punctuation and other visual elements that require further processing before being rendered to speech. This paper explores such dialogue elements in documents, examines their actual indicators and their use, and investigates the most prominent methods for their acoustic modeling, namely the use of prosody manipulation and voice alternation. It further reports on a pilot experiment on the appropriateness of voice alternation as means for the effective spoken rendition of dialogue elements in documents. Results …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Principles of electronic speech processing with applications for people with disabilities",
            "Publication year": 2008,
            "Publication url": "https://content.iospress.com/articles/technology-and-disability/tad00249",
            "Abstract": "In the first part of this paper the principles and the state of the art of speech processing, and especially speech synthesis and recognition, are explained. Then, a speech-based human-computer dialogue system is discussed. The next section gives a brief overview of the available recommendations, guidelines and standards that are directly related with the application of speech technologies. The last part of the paper is dedicated to applications of speech technology for the disabled. The main focus is on blind and partially sighted people and those with hearing loss. Concerning the blind, many multilingual text-to-speech synthesis systems exist, and some polyglot ones, that can convert printed and electronic documents to audio, but further research is needed for structured text, tables and above all graphics to be efficiently transformed into speech. For the deaf persons, there are still big challenges in the …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:b1wdh0AR-JQC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "HERON: a zournas digital virtual musical instrument",
            "Publication year": 2008,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1413634.1413698",
            "Abstract": "The Virtual Zournas, a digital Virtual Musical Instrument (VMI) developed under the project HERON, following a physical modeling approach, is presented, along with a classification scheme of real double-reed woodwind zournas and their characteristic acoustic analysis. Use-case scenarios of VMI zournas are also given regarding different user groups, including composers, performers, music teachers and musical instrument craftsmen. Aesthetical issues, limitations of the current version and thoughts on the anthropological and technological character of such tools are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:yD5IFk8b50cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Principles Of Cognitive Evaluation For An Educational CD-ROM For History",
            "Publication year": 2000,
            "Publication url": "https://www.learntechlib.org/p/16571/",
            "Abstract": "The evaluation of CD-ROMs and multimedia products used in educational environments, is a major topic. One of the erasing problems is the formation of a set of pedagogical principles or concepts and their technological implementation. We present the formation of a set of cognitive principles. Those are included in the set of evaluation, concerning a CD-ROM developed by us. The topic was a history lesson about the Homer period. We have selected two types of principles which, together with the ones for software development, should form the set for the formative evaluation. The one sub-set included the pedagogical requirements for the lesson of history. The other sub-set included the principles delivered by the cognitive scientists. These last ones were developed for the specific topic. They mainly refer to the nature and processes of learning and instruction. The set of the cognitive requirements were added …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:maZDTaKrznsC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "Formant tuning in Byzantine chanting",
            "Publication year": 2014,
            "Publication url": "http://speech.di.uoa.gr/IMC2014/pdffull/303-314.pdf",
            "Abstract": "Το φαινόμενο της προσαρμογής της φωνητικής οδού κατά τρόπο τέτοιο ώστε να ευθυγραμμίζονται οι φωνοσυντονισμοί, δηλαδή οι συχνότητες συντονισμού της φωνητικής οδού με τις αρμονικές συχνότητες του σήματος πηγής της φωνής, είναι γνωστό ως εναρμόνιση φωνοσυντονισμών (formant tuning). Η διαισθητική αυτή λειτουργία, η οποία σε μεγάλο βαθμό εξαρτάται από την κατακόρυφη κίνηση του λάρυγγα, χρησιμοποιείται από επαγγελματίες τραγουδιστές, εκτελεστές και ψάλτες από παλιά, ειδικώς σε περιπτώσεις όπου το φωνητικό σήμα πρέπει να ακουστεί μέσα σε μεγάλους χώρους (όπερες, ναούς κλπ.) ιδίως σε συνδυασμό με άλλες ηχητικές πηγές (ορχήστρες, χορωδίες κλπ.). Η εναρμόνιση φωνοσυντονισμών θεωρείται μία μέθοδος φωνητικής στρατηγικής που χρησιμοποιείται από εκπαιδευμένους φωνητικούς εκτελεστές όταν προσπαθούν να επιτύχουν ένα ιδανικό αισθητικό αποτέλεσμα ενώ ταυτόχρονα να εξοικονομήσουν ενέργεια ελέγχοντας την φωνητική προσπάθεια που καταβάλλουν. Παρόλο του η σχετική βιβλιογραφία συνεχώς εμπλουτίζεται με δουλειές που αφορούν φωνητικά είδη που συναντώνται σε διάφορες μουσικές παραδόσεις ανά τον κόσμο, το φαινόμενο δεν έχει μελετηθεί επαρκώς στο πλαίσιο της ψαλτικής τέχνης. Η παρούσα εργασία προσπαθεί να καλύψει ένα μέρος αυτού του κενού, επιχειρώντας μία πρώτη προσέγγιση και παρουσιάζει τα αποτελέσματα. Οι ηχογραφήσεις που χρησιμοποιήθηκαν για τις αναλύσεις αποτελούν μέρους του πρότυπου σώματος ηχογραφήσεων Βυζαντινής Εκκλησιαστική Φωνής «Δαμασκηνός». Συγκεκριμένα, αναλύθηκαν ηχογραφήσεις από 10 διαφορετικούς ψάλτες σε ανιούσες και κατιούσες μουσικές κλίμακες …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:1qzjygNMrQYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "HIPPODAMUS: A WWW Based Expanded Learning Environment",
            "Publication year": 2000,
            "Publication url": "https://www.learntechlib.org/p/15448/",
            "Abstract": "This paper discusses the theoretical model, the design, and the implementation of a learning web entitled HIPPODAMUS, namely a cluster of interactive networks of persons and technological networks which harmonically collaborate with the aim to perform effective learning. The technological networks include the equipment for supporting the studies of the students (eg specific measuring instruments or networks of sensors) as well as the technology for supporting the learning process (such as computer systems and networks and especially the Internet). HIPPODAMUS constitutes an expanded learning environment that incorporates extensive use of the Internet and its services, effectively promoting the active participation of all the partners involved in the educational process, namely of students, teachers, academic/research community and the administration of the education. This web is based upon the use of …",
            "Abstract entirety": 0,
            "Author pub id": "utmrHCoAAAAJ:fPk4N6BV_jEC",
            "Publisher": "Association for the Advancement of Computing in Education (AACE)"
        },
        {
            "Title": "VoiceWeb",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=16757439944535987100&hl=en&oi=scholarr",
            "Abstract": "This chapter presents the state-of-the-art in usability issues and methodologies for VoiceWeb interfaces. It undertakes a theoretical perspective to the usability methodology and provides a framework description for creating and testing usable content and applications for conversational interfaces. The methodologies and their uses are discussed as well as certain technical issues that are of specific importance for each type of system. Moreover, it discusses the hands-on approaches for applying usability methodologies in a spoken dialogue web application environment, including methodological and design issues, resource management, implementation using existing technologies for usability evaluation in several stages of the design and deployment. Finally, the challenging usability issues and parameters of the emerging advanced speech-enabled web interfaces are presented.",
            "Abstract entirety": 1,
            "Author pub id": "utmrHCoAAAAJ:vDijr-p_gm4C",
            "Publisher": "Unknown"
        }
    ]
}]