[{
    "name": "Γεράσιμος Μπαρμπάτης",
    "romanize name": "Gerasimos Barmpatis",
    "School-Department": "Μαθηματικών",
    "University": "uoa",
    "Rank": "Καθηγητής",
    "Apella_id": 6742,
    "Scholar name": "Gerassimos Barbatis",
    "Scholar id": "RPgXKw8AAAAJ",
    "Affiliation": "Professor, Department of Mathematics, National and Kapodistrian University of Athens",
    "Citedby": 843,
    "Interests": [
        "Partial Differential Equations"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=RPgXKw8AAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Shape sensitivity analysis of the Hardy constant",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0362546X14000881",
            "Abstract": "We consider the Hardy constant associated with a domain in the n-dimensional Euclidean space and we study its variation upon perturbation of the domain. We prove a Fréchet differentiability result and establish a Hadamard-type formula for the corresponding derivatives. We also prove a stability result for the minimizers of the Hardy quotient. Finally, we prove stability estimates in terms of the Lebesgue measure of the symmetric difference of domains.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:4TOpqqG69KYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Best constants for higher-order Rellich inequalities in L^p(Ω)",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s00209-006-0056-5",
            "Abstract": "We obtain a series improvement to higher-order L  p -Rellich inequalities on a Riemannian manifold M. The improvement is shown to be sharp as each new term of the series is added.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "On a class of Rellich inequalities",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377042705004097",
            "Abstract": "We prove the Rellich and the improved Rellich inequalities that involve the distance function from a hypersurface of codimension k, under a certain geometric assumption. In case, the distance is taken from the boundary, that assumption is the convexity of the domain. We also discuss the best constant of these inequalities.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:Y0pCki6q_DkC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Best Sobolev constants in the presence of sharp Hardy terms in Euclidean and hyperbolic space",
            "Publication year": 2019,
            "Publication url": "https://arxiv.org/abs/1909.10212",
            "Abstract": "In this article we compute the best Sobolev constants for various Hardy-Sobolev inequalities with sharp Hardy term. This is carried out in three different environments: interior point singularity in Euclidean space, interior point singularity in hyperbolic space and boundary point singularity in Euclidean domains.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Homogenization of Maxwell's equations in linear dispersive bianisotropic media",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=GoLSQN2jlFwC&oi=fnd&pg=PA196&dq=info:IjA5XqNGPTEJ:scholar.google.com&ots=CkBnXVoU4W&sig=x9o2URKIzBATUPn-qNRdVjD2fD4",
            "Abstract": "The functions n'(x), 5*(x), &*(x), 4 (x) as well as the functions må (x, t), Si (x, t), Ei (x, t), Hi (x, t) are periodic in x of period ey, where Y CR3 is a parallelepiped which is fixed throughout this paper. Equivalently, the susceptibility (block) matrices A'(x) and KⓇ(x, t) have the form",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:UebtZRa9Y70C",
            "Publisher": "World Scientific"
        },
        {
            "Title": "On the Hardy constant of non-convex planar domains: the case of the quadrilateral",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022123613003066",
            "Abstract": "The Hardy constant of a simply connected domain Ω⊂ R 2 is the best constant for the inequality∫ Ω|∇ u| 2 d x⩾ c∫ Ω u 2 dist (x,∂ Ω) 2 d x, u∈ C c∞(Ω). After the work of Ancona where the universal lower bound 1/16 was obtained, there has been a substantial interest on computing or estimating the Hardy constant of planar domains. In this work we determine the Hardy constant of an arbitrary quadrilateral in the plane. In particular we show that the Hardy constant is the same as that of a certain infinite sectorial region which has been studied by EB Davies.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:_kc_bZDykSQC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Homogenization of random elliptic systems with an application to Maxwell's equations",
            "Publication year": 2015,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218202515500359",
            "Abstract": "We study the homogenization of elliptic systems of equations in divergence form where the coefficients are compositions of periodic functions with a random diffeomorphism with stationary gradient. This is done in the spirit of scalar stochastic homogenization by Blanc, Le Bris and Lions. An application of the abstract result is given for Maxwell's equations in random dissipative bianisotropic media.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:aqlVkmm33-oC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "On the heat kernel of a class of fourth order operators in two dimensions: sharp Gaussian estimates and short time asymptotics",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022039618303620",
            "Abstract": "We consider a class of fourth order uniformly elliptic operators in planar Euclidean domains and study the associated heat kernel. For operators with L∞ coefficients we obtain Gaussian estimates with best constants, while for operators with constant coefficients we obtain short time asymptotic estimates. The novelty of this work is that we do not assume that the associated symbol is strongly convex. The short time asymptotics reveal a behavior which is qualitatively different from that of the strongly convex case.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:mB3voiENLucC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "On the Hardy constant of some non-convex planar domains",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-02666-4_2",
            "Abstract": "The Hardy constant of a simply connected domain    is the best constant for the inequality  $$\\displaystyle{\\int _{\\varOmega }\\vert \\nabla u\\vert ^{2}dx \\geq c\\int _{\\varOmega } \\frac{u^{2}} {\\mathrm{dist}(x,\\partial \\varOmega )^{2}}\\,dx\\;,\\;\\;\\quad u \\in C_{c}^{\\infty }(\\varOmega ).}$$  After the work of Ancona where the universal lower bound 1/16 was obtained, there has been a substantial interest on computing or estimating the Hardy constant of planar domains. In Barbatis and Tertikas (J Funct Anal 266:3701–3725, 2014) we have determined the Hardy constant of an arbitrary quadrilateral in the plane. In this work we continue our investigation and we compute the Hardy constant for other non-convex planar domains. In all cases the Hardy constant is related to that of a certain infinite sectorial region which has been studied by E.B. Davies.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "Heat kernel estimates for fourth order non-uniformly elliptic operators with non strongly convex symbols",
            "Publication year": 2020,
            "Publication url": "https://arxiv.org/abs/2012.03615",
            "Abstract": "We obtain heat kernel estimates for a class of fourth order non-uniformly elliptic operators in two dimensions. Contrary to existing results, the operators considered have symbols that are not strongly convex. This rises certain difficulties as it is known that, as opposed to the strongly convex case, there is no absolute exponential constant. Our estimates involve sharp constants and Finsler-type distances that are induced by the operator symbol. The main result is based on two general hypotheses, a weighted Sobolev inequalitry and an interpolation inequality, which are related to the singularity or degeneracy of the coefficients.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Homogenization of Maxwell's equations in dissipative bianisotropic media",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.420",
            "Abstract": "We study the periodic homogenization of Maxwell's equations for dissipative bianisotropic media in the time domain, both in R3 and in a bounded domain with the perfect conductor boundary condition. We consider both local with respect to time (optical response region) and non‐local in time (allowing dispersive effects) constitutive laws; in the non‐local case the explicit description of the homogenized coefficients is given in terms of the Laplace transform. The principal result of this work is the description of the asymptotic behaviour of the solutions of the considered problems as the period of the electromagnetic parameters tends to zero. Copyright © 2003 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:9yKSN-GCB0IC",
            "Publisher": "John Wiley & Sons, Ltd."
        },
        {
            "Title": "Homogenization in chiral elasticity",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812773197_0010",
            "Abstract": "We study the perodic homogenization problem for the elasticity theory of linear chiral materials. We establish the weak convergence of the solutions u∊ corresponding to the material of period  to a limit u0 which we identify as the solution corresponding to an analogous 'limit' homogeneous problem. We describe explicitly the coefficients of chiral elasticity of the limit problem in terms of an auxiliary cell problem.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sharp heat-kernel estimates for higher-order operators with singular coefficients",
            "Publication year": 2004,
            "Publication url": "https://www.cambridge.org/core/journals/proceedings-of-the-edinburgh-mathematical-society/article/sharp-heatkernel-estimates-for-higherorder-operators-with-singular-coefficients/CBC6033210624A19AA26F31DAABFCDC1",
            "Abstract": "We obtain heat-kernel estimates for higher-order operators with measurable coefficients that can be singular or degenerate. Precise constants are given, which are sharp for small times.AMS 2000 Mathematics subject classification: Primary 35K30; 47D06. Secondary 35K25; 35K35",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:YsMSGLbcyi4C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Stability estimates for resolvents, eigenvalues, and eigenfunctions of elliptic operators on variable domains",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4419-1343-2_2",
            "Abstract": "We consider general second order uniformly elliptic operators subject to homogeneous boundary conditions on open sets ø(Ω) parametrized by Lipschitz homeomorphisms ø defined on a fixed reference domain Ω. For two open sets ø(Ω) and eø(Ω) we estimate the variation of resolvents, eigenvalues, and eigenfunctions via the Sobolev norm  for finite values of p, under natural summability conditions on eigenfunctions and their gradients. We prove that such conditions are satisfied for a wide class of operators and open sets, including open sets with Lipschitz continuous boundaries. We apply these estimates to control the variation of the eigenvalues and eigen-functions via the measure of the symmetric difference of the open sets. We also discuss an application to the stability of solutions to the Poisson problem.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:UeHWp8X0CEIC",
            "Publisher": "Springer, New York, NY"
        },
        {
            "Title": "Improved Rellich inequalities for the polyharmonic operator",
            "Publication year": 2006,
            "Publication url": "https://www.jstor.org/stable/24902419",
            "Abstract": "We prove two improved versions of the Hardy-Rellich inequality for the polyharmonic operator (–Δ)m involving the distance to the boundary. The first involves an infinite series improvement using logarithmic functions, while the second contains L2 norms and involves as a coefficient the volume of the domain. We find explicit constants for these inequalities, and we prove their optimality in the first case.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:_FxGoFyzp5QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Series expansion for L^p Hardy inequalities",
            "Publication year": 2003,
            "Publication url": "https://www.jstor.org/stable/24902885",
            "Abstract": "We consider a general class of sharp Lp Hardy inequalities in ℝN involving distance from a surface of general codimension 1 ≤ k ≤ N. We show that we can successively improve them by adding to the right hand side a lower order term with optimal weight and best constant. This leads to an infinite series improvement of Lp Hardy inequalities.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:u-x6o8ySG0sC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Finsler-Rellich inequalities involving the distance to the boundary",
            "Publication year": 2021,
            "Publication url": "https://arxiv.org/abs/2102.08309",
            "Abstract": "We study Rellich inequalities associated to higher-order elliptic operators in the Euclidean space. The inequalities are expressed in terms of an associated Finsler metric. In the case of half-spaces we obtain the sharp constant while for a general convex domains we obtain estimates that are better than those obtained by comparison with the polyharmonic operator.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:4JMBOYKVnBMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bethe–Sommerfeld conjecture for pseudodifferential perturbation",
            "Publication year": 2009,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/03605300902769006",
            "Abstract": "We consider a periodic pseudodifferential operator H = (− Δ) l  + A (l > 0) in R  d  which satisfies the following conditions: (i) the symbol of H is smooth in x, and (ii) the perturbation A has order smaller than 2l − 1. Under these assumptions, we prove that the spectrum of H contains a half-line.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:LkGwnXOMwfcC",
            "Publisher": "Taylor & Francis Group"
        },
        {
            "Title": "Spectral stability estimates for elliptic operators subject to domain transformations with non-uniformly bounded gradients",
            "Publication year": 2012,
            "Publication url": "https://www.cambridge.org/core/journals/mathematika/article/spectral-stability-estimates-for-elliptic-operators-subject-to-domain-transformations-with-nonuniformly-bounded-gradients/B01F4D1D3AE40E03FCD35E2BAD6B778D",
            "Abstract": "We consider uniformly elliptic operators with Dirichlet or Neumann homogeneous boundary conditions on a domain Ω in ℝN. We consider deformations ϕ(Ω) of Ω obtained by means of a locally Lipschitz homeomorphism ϕ and we estimate the variation of the eigenfunctions and eigenvalues upon variation of ϕ. We prove general stability estimates without assuming uniform upper bounds for the gradients of the maps ϕ. As an application, we obtain estimates on the rate of convergence for eigenvalues and eigenfunctions when a domain with an outward cusp is approximated by a sequence of Lipschitz domains.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:3fE2CSJIrl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Sharp Hardy and Hardy–Sobolev inequalities with point singularities on the boundary",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0021782418300746",
            "Abstract": "We study the Hardy inequality when the singularity is placed on the boundary of a bounded domain in R n that satisfies both an interior and exterior ball condition at the singularity. We obtain the sharp Hardy constant n 2/4 in case the exterior ball is large enough and show the necessity of the large exterior ball condition. We improve Hardy inequality with the best constant by adding a sharp Sobolev term. We next produce criteria that lead to characterizing maximal potentials that improve Hardy inequality. Breaking the criteria one produces successive improvements with sharp constants. Our approach goes through in less regular domains, like cones. In the case of a cone, contrary to the smooth case, the Sobolev constant does depend on the opening of the cone.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:-f6ydRqryjwC",
            "Publisher": "Elsevier Masson"
        },
        {
            "Title": "Higher order linear parabolic equations",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zawxAAAAQBAJ&oi=fnd&pg=PA77&dq=info:RML5z-OtOMEJ:scholar.google.com&ots=9P45okRVAW&sig=KP6F_8CilDWor33mmlGxGLNRkow",
            "Abstract": "We first highlight the main differences between second order and higher order linear parabolic equations. Then we survey existing results for the latter, in particular by analyzing the behavior of the convolution kernels. We illustrate the updated state of art and we suggest several open problems.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:0EnyYjriUFMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A unified approach to improved L^p Hardy inequalities with best constants",
            "Publication year": 2004,
            "Publication url": "https://www.ams.org/tran/2004-356-06/S0002-9947-03-03389-0/",
            "Abstract": "We present a unified approach to improved  Hardy inequalities in . We consider Hardy potentials that involve either the distance from a point, or the distance from the boundary, or even the intermediate case where the distance is taken from a surface of codimension . In our main result, we add to the right hand side of the classical Hardy inequality a weighted  norm with optimal weight and best constant. We also prove nonhomogeneous improved Hardy inequalities, where the right hand side involves weighted  norms, .",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:u5HHmVD_uO8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Refined geometric L^p Hardy inequalities",
            "Publication year": 2003,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0219199703001166",
            "Abstract": "For a bounded convex domain Ω in RN we prove refined Hardy inequalities that involve the Hardy potential corresponding to the distance to the boundary of Ω, the volume of Ω, as well as a finite number of sharp logarithmic corrections. We also discuss the best constant of these inequalities.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:IjCSPb-OGe4C",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Monotonicity, continuity and differentiability results for the L p Hardy constant",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/article/10.1007/s11856-016-1400-z",
            "Abstract": "We consider the L  p  Hardy inequality involving the distance to the boundary for a domain in the n-dimensional Euclidean space. We study the dependence on p of the corresponding best constant and we prove monotonicity, continuity and differentiability results. The focus is on non-convex domains in which case such a constant is in general not explicitly known.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:HDshCWvjkbEC",
            "Publisher": "The Hebrew University Magnes Press"
        },
        {
            "Title": "Stability estimates in H^1_0 for solutions of elliptic equations in varying domains",
            "Publication year": 2014,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mma.2948",
            "Abstract": "We consider second‐order uniformly elliptic operators subject to Dirichlet boundary conditions. Such operators are considered on a bounded domain Ω and on the domain ϕ(Ω) resulting from Ω by means of a bi‐Lipschitz map ϕ. We consider the solutions u and  of the corresponding elliptic equations with the same right‐hand side f ∈ L2(Ω ∪ ϕ(Ω)). Under certain assumptions, we estimate the difference  in terms of certain measure of vicinity of ϕ to the identity map. For domains within a certain class, this provides estimates in terms of the Lebesgue measure of the symmetric difference of ϕ(Ω) and Ω, that is, | ϕ(Ω) △ Ω | . We provide an example that shows that the estimates obtained are in a certain sense sharp. Copyright © 2013 John Wiley & Sons, Ltd.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:8k81kl-MbHgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Boundary decay estimates for solutions of fourth-order elliptic equations",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/article/10.1007/s11512-007-0048-7",
            "Abstract": "We obtain integral boundary decay estimates for solutions of fourth-order elliptic equations on a bounded domain with regular boundary. We apply these estimates to obtain stability bounds for the corresponding eigenvalues under small perturbations of the boundary. ",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:roLk4NBRz8UC",
            "Publisher": "Springer Netherlands"
        },
        {
            "Title": "Gaussian estimates with best constants for higher-order Schrödinger operators with Kato potentials",
            "Publication year": 2017,
            "Publication url": "https://www.ams.org/proc/2017-145-01/S0002-9939-2016-13185-7/",
            "Abstract": "We establish Gaussian estimates on the heat kernel of a higher-order uniformly elliptic Schrödinger operator with variable highest order coefficients and with a Kato class potential. The estimates involve the sharp constant in the Gaussian exponent.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:qUcmZB5y_30C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trace estimates and invariance of the essential spectrum",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s00013-006-1716-8.pdf",
            "Abstract": "We provide sufficient conditions under which the difference of the resolvents of two higher-order operators acting in  belongs to trace classes . We provide explicit estimates on the norm of the resolvent difference in terms of L p  norms of the difference of the coefficients. Such inequalities are useful in estimating the effect of localized perturbations of the coefficients.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:5nxA0vEk-isC",
            "Publisher": "Birkhäuser-Verlag"
        },
        {
            "Title": "Explicit estimates on the fundamental solution of higher-order parabolic equations with measurable coefficients",
            "Publication year": 2001,
            "Publication url": "https://core.ac.uk/download/pdf/82024456.pdf",
            "Abstract": "Let H be a self-adjoint uniformly elliptic differential operator of order 2m defined on a domain 0/RN and let K (t, x, y) be the fundamental solution of the associated parabolic equation u t",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:2osOgNQ5qMEC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Critical heat kernel estimates for Schrödinger operators via Hardy–Sobolev inequalities",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0022123603003549",
            "Abstract": "We obtain Sobolev inequalities for the Shcrödinger operator −Δ−V, where V has critical behaviour V(x)=((N−2)/2)2|x|−2 near the origin. We apply these inequalities to obtain point-wise estimates on the associated heat kernel, improving upon earlier results.",
            "Abstract entirety": 1,
            "Author pub id": "RPgXKw8AAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Academic Press"
        }
    ]
}]