[{
    "name": "Γεώργιος Ρούσκας",
    "romanize name": "Georgios Rouskas",
    "School-Department": "Computer Science",
    "University": "North Carolina State University ",
    "Rank": "Καθηγητής",
    "Apella_id": 516,
    "Scholar name": "George N. Rouskas",
    "Scholar id": "tmuBOhwAAAAJ",
    "Affiliation": "Alumni Distinguished Graduate Professor of Computer Science, North Carolina State University",
    "Citedby": 9344,
    "Interests": [
        "Network Architecture",
        "Network Design",
        "Optical Networks",
        "Optical Networking",
        "Performance Evaluation"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=tmuBOhwAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "On optimal traffic grooming in WDM rings",
            "Publication year": 2001,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/384268.378779",
            "Abstract": "We consider the problem of designing a virtual topology to minimize electronic routing, that is, grooming traffic, in wavelength routed optical rings. We present a new framework consisting of a sequence of bounds, both upper and lower, in which each successive bound is at least as strong as the previous one. The successive bounds take larger amounts of computation to evaluate, and the number of bounds to be evaluated for a given problem instance is only limited by the computational power available. The bounds are based on decomposing the ring into sets of nodes arranged in a path, and adopting the locally optimal topology within each set. Our approach can be applied to many virtual topology problems on rings. The upper bounds we obtain also provide a useful series of heuristic solutions.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:IWHjjKOFINEC",
            "Publisher": "ACM"
        },
        {
            "Title": "A new framework for GLIF Interdomain Resource Reservation Architecture (GIRRA)",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s12243-010-0186-y",
            "Abstract": "Many existing and emerging Scientific high-end applications (E-science) require end-to-end circuits interconnecting Grid resources for large data transfers. A few advanced networks, mainly National Research and Education Networks (NRENs), such as Surfnet, National Lambda Rail and Internet 2, now provide mechanisms for end-users to reserve and provision lightpaths via middleware referred to as Network Resource Mangers (NRMs). Although, some progress has been made in automated intra-domain lightpath services, inter-domain lightpath provisioning still requires manual intervention and presents several key challenges such as scalability of topology information exchanged, consistency and scalability of information model, security of access to the resources, hybrid networking and multi-layer lightpaths, and accounting and billing. In this paper, we describe a new architectural framework called …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:JoZmwDi-zQgC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Hybrid FRR/p-cycle design for link and node protection in MPLS networks",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1434841112002749",
            "Abstract": "Survivable MPLS technologies are crucial in ensuring reliable communication services. The fast reroute (FRR) mechanism has been standardized to achieve fast local repair of label switched paths (LSPs) in the event of link or node failures. We present a suite of hybrid protection schemes for MPLS networks that combine the well-known p-cycle method with FRR technology. Whereas with pure FRR backup paths are planned by each node individually, the hybrid schemes employ a set of p-cycles that may be selected using techniques that take a holistic view of the network so as to share protection bandwidth effectively. The hybrid FRR/p-cycle methods are fully RFC 4090-compliant, yet allow network operators to leverage a large existing body of p-cycle design techniques. Numerical results on realistic network topologies indicate that the hybrid approach is successful in combining the advantages of p-cycle design …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Mojj43d5GZwC",
            "Publisher": "Urban & Fischer"
        },
        {
            "Title": "Efficient resource management using advance reservations for heterogeneous grids",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4536228/",
            "Abstract": "Support for advance reservations of resources plays a key role in Grid resource management as it enables the system to meet user expectations with respect to time requirements and temporal dependence of applications, increases predictability of the system and enables co- allocation of resources. Despite these attractive features, adoption of advance reservations is limited mainly due to the fact that related algorithms are typically complex and fail to scale to large and loaded systems. In this work we consider two aspects of advance reservations. First, we investigate the impact of heterogeneity on Grid resource management when advance reservations are supported. Second, we employ techniques from computational geometry to develop an efficient heterogeneity-aware scheduling algorithm. Our main finding is that Grids may benefit from high levels of resource heterogeneity, independently of the total system …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:EUQCXRtRnyEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Network virtualization: A tutorial",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/viewmedia.cfm?uri=OFC-2012-OW1A.1&seq=0",
            "Abstract": "Network Virtualization Historical Perspective Virtual Service Networks Active and Programmable Networks Motivation (1) Motivation (3)",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:zLWjf1WUPmwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Special issue on advances in availability and survivability in optical networks",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.osn.2015.09.002",
            "Abstract": "Special issue on advances in availability and survivability in optical networks | Optical Switching \nand Networking ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books \nSIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search \nOptical Switching and Networking Periodical Home Latest Issue Archive Authors Affiliations \nAward Winners More HomeBrowse by TitlePeriodicalsOptical Switching and NetworkingVol. \n, No. P2Special issue on advances in availability and survivability in optical networks \nresearch-article Special issue on advances in availability and survivability in optical networks \nShare on Authors: George N Rouskas profile image George Rouskas View Profile , Pin-Han \nHo profile image Pin-Han Ho View Profile , János Tapolcai profile image Janos Tapolcai , & : …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:H2XcuePHLsAC",
            "Publisher": "Elsevier Science Publishers BV"
        },
        {
            "Title": "Crosstalk-Aware Shared Backup Path Protection in Multi-Core Fiber Elastic Optical Networks",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9373898/",
            "Abstract": "Elastic optical networks employing multi-core fibers (MCF-EON) have the potential to expand significantly the transmission capacity of optical transport. However, wide deployment of such networks depends on addressing effectively two critical challenges: inter-core crosstalk, which may cause serious signal performance degradation in an MCF link, and survivability against network failures that may cause enormous data loss. In this article, we consider the design of MCF-EONs with shared-backup path protection (SBPP), one of the most efficient techniques for protecting network traffic. Specifically, we tackle the crosstalk-aware routing, core, and spectrum assignment (CA-RCSA) problem with the objective of jointly minimizing the network spectrum resources used and the total inter-core crosstalk. We formulate the problem as an integer linear programming (ILP) model subject to strict inter-core crosstalk limits for …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:bcT4vkklUMwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optical packet switching",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-22584-6_5",
            "Abstract": "The concept of optical packet switching (OPS) is emerging as an alternative to coarser-grained switching in the optical domain. Despite the significant technological challenges it faces, OPS holds the promise of a highly reconfigurable, bandwidth-efficient, and flexible optical layer. In this chapter we study some of the architectural and design issues for OPS networks, we examine a number of enabling technologies, and we discuss some of the ongoing research and experimental efforts.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Traffic grooming: balancing choice and service in optical networks",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=PS-2014-PM4C.1",
            "Abstract": "We articulate how the traditional optical networking research area of traffic grooming may be combined with recent advances in Internet architecture, specifically the proposed ChoiceNet Future Internet architecture, to create an agile system capable of reflecting both provider and customer interests on an ongoing basis as network conditions change.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:w2Gke83ceDMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A study of path protection in large-scale optical networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/article/10.1023/B:PNET.0000026891.50610.48",
            "Abstract": "We consider the problem of designing a network of optical cross-connects (OXCs) which provides end-to-end lightpath services to large numbers of client nodes, under the requirement that the network will survive any single-link failure. Our main objective is to quantify the additional resource requirements of implementing path protection schemes over a network with no survivability properties. To this end, we present heuristic routing and wavelength assignment algorithms for dedicated path protection and two variants of shared path protection, and integrate them into the physical and logical topology design framework we developed in an earlier study. We apply our heuristics to networks with up to 1000 client nodes, with a number of lightpaths that is an order of magnitude greater than the number of clients, and for a wide range of values for system parameters such as the number of wavelengths per fiber …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Edge-reconfigurable optical networks (ERONs): rationale, network design, and evaluation",
            "Publication year": 2009,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-27-12-1837",
            "Abstract": "To bridge the gap between the current practice of setting up expensive, dedicated, lightpath connections (i.e., static topologies), and the distant future vision of inexpensive access to dynamically switched end-to-end lightpaths, we propose a medium term solution in the form of edge-reconfigurable optical networks (ERONs). An ERON is an overlay-control network created by installing readily available MEMS optical switches, and implementing a GMPLS control plane at sites interconnected by static lightpaths. The switches and control software are deployed at the edge of the network and operated by the organization-user (i.e., outside the network provider's control), hence the term “edge-reconfigurable”. By providing dynamic, automated control of end-to-end lightpaths, ERONs enable the sharing of expensive network resources among multiple users and applications that require sporadic access to these resources …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:NhqRSupF_l8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Design and Implementation of an Economy Plane for the Internet",
            "Publication year": 2015,
            "Publication url": "https://scholarworks.umass.edu/dissertations_2/487/",
            "Abstract": "The Internet has been very successful in supporting many network applications. As the diversity of uses for the Internet has increased, many protocols and services have been developed by the industry and the research community. However, many of them failed to get deployed in the Internet. One challenge of deploying these novel ideas in operational network is that the network providers need to be involved in the process.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:WYleWgRJor0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Guest editorial protocols and architectures for next generation optical WDM networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/887903/",
            "Abstract": "OPTICAL wavelength division multiplexed networking, offering potential capacity in the multiterabits-per-second range, is poised to be a critical component of the next-generation Internet network infrastructure. There is significant research and commercial interest in making this a reality. WDM line systems already cover the globe, and attention is now turning toward addressing the practical issues of WDM-based local and metropolitan area networks, and the implications of using WDM on the next generation Internet backbone. At present, we are moving toward rapidly achieving the physical devices necessary to build commercially viable WDM networks. There are several fundamental research questions to be answered on a variety of topics, including switch and router architectures, protection and survivability mechanisms, quality of service support and scheduling algorithms, efficient routing and wavelength …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:vDijr-p_gm4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A machine learning approach to mitigating fragmentation and crosstalk in space division multiplexing elastic optical networks",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1068520018307028",
            "Abstract": "As network traffic is expected to continue to grow at high rates for the foreseeable future, it becomes imperative to introduce space division multiplexing elastic optical networks (SDM-EONs) into the optical transport network. However, spectrum fragmentation and crosstalk present significant challenges that may negatively impact the performance of SDM-EONs. In this paper, we leverage machine learning techniques to enhance the transmission performance of SDM-EONs, and make two contributions. Specifically, we use an Elman neural network to forecast traffic demands, and use a two-dimensional rectangular packing model to allocate spectrum so as to decrease unnecessary spectrum fragmentation (and, in turn, increase resource utilization). We also present a novel spectrum partition scheme to reduce crosstalk. Our evaluation study confirms that the proposed strategy is effective in improving spectrum …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:N0GlzNNR4l8C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Lightpath management in SDN-based elastic optical networks with power consumption considerations",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8231131/",
            "Abstract": "Elastic optical networks (EONs) are increasingly used to interconnect data centers. As interdatacenter traffic is expected to continue to grow at high rates for the foreseeable future, it becomes imperative to address the respective growth in power consumption within EONs. In this paper, we take the first steps toward enhancing the energy efficiency of interdatacenter EONs. Specifically, we use traffic prediction techniques for centralized lightpath management that leverages the capabilities of software defined networking (SDN) technology. Our objective is to eliminate unnecessary lightpath termination and re-establishment operations, and in turn decrease switching power consumption within the network. Our evaluation study confirms that the proposed algorithm is effective in achieving substantial savings in power consumption while maintaining a bandwidth blocking ratio at levels comparable to those of earlier …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:b2v3RnpdjZkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Edge Reconfigurable Optical Network (ERON): Enabling dynamic sharing of static lightpaths",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4769097/",
            "Abstract": "In this paper, we propose an edge reconfigurable optical network as an intermediate step toward fully dynamic optical core network. ERON is an overlay-control network created by installing GMPLS-enabled MEMs optical switches at the edge of a core optical network composed of static lightpaths. We propose a network design algorithm that takes as input the key resource locations dispersed globally and a realistic traffic matrix from end-users and outputs a virtual topology comprised of the minimum required static lightpaths interconnected via ERON switches. This paper describes the key concepts involved in the design of an efficient ERON network combined with routing and reservation algorithms to assure low blocking probabilities. We also describe the management and control architecture and protocols required to provide end-user/application control of the dynamic lightpaths.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:XiVPGOgt02cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tiered Service Bundling Under Budget Constraints",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_9",
            "Abstract": "The term product/service bundle refers to combining several products or services together and selling them as a single package. In Chapter 6, we used concepts from location theory to determine optimal tiering structures for service bundles by formulating the problem as a directional p-median problem in multiple dimensions. Product bundling is also widely used as a marketing strategy [17]. Bundles are often priced at a discount to the total price that their constituent products or services would fetch if they were sold separately. Bundling can be beneficial to both consumers and sellers. The former, in addition to the lower overall price, may appreciate the lower transaction costs and simplified decision process compared with shopping for individual products or services, and may experience a better overall performance due to complementarities among the bundle components. For sellers, bundling has the potential to …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:LHWLPdAD5FMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Traffic Quantization in Packet-Switched Networks",
            "Publication year": 2004,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.3.4925&rep=rep1&type=pdf",
            "Abstract": "We present traffic quantization as a new method for supporting per-flow functionality in packet-switched networks in an efficient and scalable manner. A quantized network offers a small set of service levels (tiers), and each flow is mapped to one of the service levels so as to guarantee a QoS at least as good as that requested by the flow. Traffic quantization trades off a small amount of system resources for simplicity in core network functions, including packet scheduling, traffic policing, etc. Our focus in this paper is on determining the service levels so as to minimize the amount of additional resources required by a quantized network. We develop a framework for addressing the traffic quantization problem by formulating it as a variant of the в-median problem under a new distance measure, the directional rectilinear distance. We present an efficient optimal algorithm for the directional в-median problem on the real line, and a robust heuristic for the same problem in multiple dimensions; these two problems correspond to quantization of a single and multiple traffic parameters, respectively. Our main finding is that, by appropriately selecting the set of service levels, the benefits of quantization can be achieved with only a small sacrifice in network resources.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:t7zJ5fGR-2UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Adaptive path selection in OBS networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1667820/",
            "Abstract": "In this paper, the authors investigate the concept of adaptive path selection in optical burst-switched networks and its potential to reducing the overall burst drop probability. Specifically, the authors assume that each source maintains a (short) list of alternate paths to each destination and uses information regarding the recent congestion status of the network links to rank the paths; it then transmits bursts along the least congested path. The authors present a suite of path selection strategies, each utilizing a different type of information regarding the link congestion status, and evaluate them using simulation. The results demonstrate that, in general, adaptive path selection outperforms shortest path routing, and, depending on the path strategy involved, the network topology, and the traffic pattern, this improvement can be significant. A new framework for the development of hybrid (or meta) path selection strategies …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:_kc_bZDykSQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On routing algorithms for open marketplaces of path services",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7511582/",
            "Abstract": "Open marketplaces of path services are the next step towards realizing “routing-as-a-service.” Such marketplaces will enable users to select from a set of path services offered by multiple competing network providers so as to construct customized end-to-end paths for their applications. This is analogous to online travel marketplaces that allow users to explore travel options and book their travel. We review the requirements for path planners to assist users in stitching together available path services. We define the problem of finding multi-criteria time-constrained paths in this context, and present a dynamic programming algorithm that constructs Pareto-optimal paths.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Es-9c2L5hKwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computing blocking probabilities in multiclass wavelength-routing networks with multicast calls",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/974664/",
            "Abstract": "We present an approximate analytical method to compute efficiently the call-blocking probabilities in wavelength-routing networks with multiple classes of both unicast and multicast calls. Our approach involves the following steps. We start with an approximate solution to a linear single-class unicast network which we developed earlier. Next, all classes of calls on a particular route are aggregated to give an equivalent single-class model. We then extend the path decomposition algorithms that we have developed for single-class networks to handle mesh networks with multiple classes of calls. We show how to use these path decomposition algorithms to decompose large networks with multicast paths into smaller subsystems with only linear paths, which, in turn, are solved by the product-form approximation algorithm. We also consider a state-dependent Poisson arrival process for multicast calls which is more …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On optimal tiered structures for network service bundles",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6133598/",
            "Abstract": "Network operators offer a variety of tiered services in which users may select only from a small set of tiers which offer progressively higher levels of service. Service bundling, whereby several services are combined together and sold as a single package, is also common in the telecommunications market. We consider the problem of determining optimal tiering structures for service bundles using tools from economics and utility theory. Our work provides insight into the selection and pricing of Internet tiered services.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:eJXPG6dFmWUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generalized wavelength sharing policies for absolute QoS guarantees in OBS networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4202542/",
            "Abstract": "We consider the problem of supporting absolute QoS guarantees in terms of the end-to-end burst loss in OBS networks. We present a parameterized model for wavelength sharing which provides for isolation among different traffic classes while also making efficient use of wavelength capacity through statistical multiplexing. We develop a heuristic to optimize the policy parameters for a single link of an OBS network. We also develop a methodology for translating the end-to-end QoS requirements into appropriate per-link parameters so as to provide network-wide guarantees. Our approach is easy to implement, it can support a wide variety of traffic classes, and is effective in meeting the QoS requirements and keeping the loss rate of best-effort and overall traffic low",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computing call-blocking probabilities in LEO satellite constellations",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1200253/",
            "Abstract": "We present an analytical model for computing call-blocking probabilities in a low Earth orbit (LEO) satellite network that carries voice calls. Both satellite-fixed and Earth-fixed constellations with interorbit links and handoffs are considered. We assume a single beam per satellite. Also, we assume that call arrivals are Poisson with a fixed arrival rate that is independent of the geographic area. The model is analyzed approximately by decomposing it into subsystems. Each subsystem is solved in isolation exactly using a Markov process and the individual results are combined together through an iterative method. Numerical results demonstrate that our method is accurate for a wide range of traffic patterns. We also derive an upper and lower bound for the link-blocking probabilities that can be computed efficiently. These bounds can be used for constellations of realistic size where each satellite has multiple beams.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:j3f4tGmQtD8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance analysis of LEO satellite networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47906-6_64",
            "Abstract": "We present an analytical model for computing call blocking probabilities in a LEO satellite network that carries voice calls. Both satellite-fixed and earth-fixed constellations with inter-orbit links and hand-offs are considered. The model is analyzed approximately by decomposing it into sub-systems. Each sub-system is solved in isolation exactly using a Markov process, and the individual results are combined together through an iterative method. Numerical results demonstrate that our method is accurate for a wide range of traffic patterns.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:abG-DnoFyZgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Peer review is a fundamental aspect of maintaining high editorial standards for journals. Our reviewers provide helpful comments to authors of all manuscripts, and their critical assessment is invaluable for the editors when selecting the papers for publication in Optical Switching and Networking. The members of the Editorial Board express their appreciation to the following individuals who have generously volunteered their time to review manuscripts during 2009. Our apologies and thanks to any reviewer whose name may",
            "Publication year": 2010,
            "Publication url": "https://scholar.google.com/scholar?cluster=1645443669715345778&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:OR75R8vi5nAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Bounds on traffic grooming in star and tree networks",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.18.3966&rep=rep1&type=pdf",
            "Abstract": "We consider the problem of grooming traffic in WDM star and tree networks to minimize equipment cost. We prove an important result regarding wavelength assignment in both topologies. We present a series of lower and upper bounds on the optimal solutions for both star and tree networks. The bounds allow us to evaluate a set of heuristics we also develop.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:pqnbT2bcN3wC",
            "Publisher": "The University; 1998"
        },
        {
            "Title": "Scalable optimal traffic grooming in WDM rings incorporating fast RWA formulation",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655177/",
            "Abstract": "We present a scalable formulation for the traffic grooming problem in WDM ring networks. Specifically, we modify the ILP formulation to replace the constraints related to routing and wavelength assignment (RWA), typically based on a link approach, with a new set of constraints based on the maximal independent set decomposition (MISD) that we recently developed to solve optimally the RWA problem in ring networks. Our experimental study indicates that the new formulation results in an improvement of up to two orders of magnitude in running time. Consequently, it is now possible to solve the traffic grooming problem to optimality for 16-node rings in a few seconds using commodity hardware.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A framework for hierarchical traffic grooming in WDM networks of general topology",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1589611/",
            "Abstract": "We present a framework for hierarchical traffic grooming in mesh networks with the objective of minimizing the total number of electronic ports. At the first level of hierarchy, we decompose the network into clusters and designate one node in each cluster as the hub for grooming traffic. At the second level, the hubs form another cluster for grooming inter-cluster traffic. We view each (first- or second-level) cluster as a virtual star, and we present an efficient near-optimal algorithm for determining the logical topology of lightpaths to carry the traffic within each cluster. Routing and wavelength assignment is then performed directly on the underlying physical topology. Our approach scales to large network sizes, and facilitates the control and management of multigranular networks. Comparisons to lower bounds indicate that it is also efficient in its use of the network resources of interest, namely, electronic ports and …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:hFOr9nPyWt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid FRR/p-cycle link pair design for MPLS-TP node protection",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=acpc-2012-AF4A.48",
            "Abstract": "We present a link pair design scheme for MPLS-TP node protection, which combines p-cycle method with fast reroute (FRR) technology. Numerical results indicate that this approach is successful in combining advantages of p-cycle and FRR.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:9pM33mqn1YgC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Design of a protocol to enable economic transactions for network services",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249175/",
            "Abstract": "Deployment of innovative new networking services requires support by network providers. Since economic motivation plays an important role for network providers, it is critical that a network architecture intrinsically considers economic relationships. We present the design of a protocol that associates access to network services with economic contracts. We show how this protocol can be realized in fundamentally different ways, using out-of-band signaling and in-band signaling, based on two different prototype implementations. We present results that show the effectiveness of the proposed protocol and thus demonstrate a first step toward realizing an economy plane for the Internet.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:eCFM_hdDfssC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A hierarchical model for multigranular optical networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4769124/",
            "Abstract": "We present a hierarchical algorithm for grooming lightpaths into wavebands, and routing wavebands over a network of multigranular switching nodes. This algorithm focuses on lowering the number of wavelengths W and ports over the network while being conceptually simple, scalable, and consistent with the way networks are operated and controlled in practice. Our experiments indicate that this algorithm easily scales across different waveband and network sizes.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:u_35RYKgDlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A large-scale nesting ring multi-chip architecture for manycore processor systems",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427718301097",
            "Abstract": "The optical network on chip (ONoC) paradigm has emerged as a promising solution to multi-core/many-core processor systems for offering enormous bandwidth and low power consumption. As chip multiprocessors (CMPs) scale to unprecedented numbers of cores, the performance of next-generation CMPs will be bounded by the process yield and power density of single chip. In earlier work we proposed a multi-chip ONoC architecture that scales to large numbers of CMPs and delivers high performance in terms of delay and throughout. Building on that work, in this paper we propose an optimized architecture for integrating a large number of cores into chips with a novel control strategy, including a contention resolution scheme and a resource reservation scheme. The proposed control strategy is crucial to large scale ONoCs, because the resource reservation scheme ensures efficient wavelength allocation for …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:q2HS4OCVtYIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Service Tiering As A Market Segmentation Strategy",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_8",
            "Abstract": "In the previous chapter we considered a market scenario in which all users receive the same value from the service offered by the network operator, or equivalently, all users are characterized by the same utility function U(x). A market in which all users value a service (or product) similarly is said to be inelastic [20]. Certain essential goods (e.g., gasoline or milk) and services that everyone needs tend to be inelastic, at least in the short term. Markets for most other products and services tend to be elastic, in that the value of the product or service may be perceived quite differently across the population of consumers. Hence, in elastic markets, consumer behavior with respect to pricing may vary widely depending on the underlying utility curve that characterizes the value that the specific consumer places on the product or service in question.In this chapter we consider broadband Internet access as an elastic …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Cd1N8iHLSCsC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Inception to Application: A GENI based prototype of an Open Marketplace for Network Services",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7562244/",
            "Abstract": "Choice-based network architecture enables users the power to choose services from a set of network service offerings from multiple providers within a marketplace. To facilitate marketplace alternatives and enable fine-grain service composition, a common service specification should represent a general-extensible design for describing a service. This allows users to discover, negotiate, and purchase network services from service providers using service advertisements in the marketplace. We have successfully developed a ChoiceNet prototype which rectifies some of the shortcomings of the earlier prototypes and demonstrates a contractual agreement between multiple network service providers to realize multiple end-to-end application scenarios using the common service specification within the GENI environment. Our implementation showcases the integration of two contrasting payment models for the …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:r5yabEp13iMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scheduling combined unicast and multicast traffic in broadcast WDM networks",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1010084306132",
            "Abstract": "This paper studies the performance of various strategies for scheduling a combined load of unicast and multicast traffic in a broadcast WDM network. The performance measure of interest is schedule length, which directly affects both aggregate network throughput and average packet delay. Three different scheduling strategies are presented, namely: separate scheduling of unicast and multicast traffic, treating multicast traffic as a number of unicast messages, and treating unicast traffic as multicasts of size one. A lower bound on the schedule length for each strategy is first obtained. Subsequently, the strategies are compared against each other using extensive simulation experiments in order to establish the regions of operation, in terms of a number of relevant system parameters, for which each strategy performs best. Our main conclusions are as follows. Multicast traffic can be treated as unicast traffic, by …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:k_IJM867U9cC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Scalable Recursive First Fit: An Optimal Solution to the Spectrum Allocation Problem",
            "Publication year": 2021,
            "Publication url": "https://rouskas.csc.ncsu.edu/Publications/Conferences/ONDM-RecFF-2021.pdf",
            "Abstract": "We revisit the classical spectrum allocation (SA) problem, a fundamental subproblem in optical network design, and make three contributions. First, we show how some SA problem instances may be decomposed into smaller instances that may be solved independently without loss of optimality. Second, we prove an optimality property of the well-known first-fit (FF) heuristic. Finally, we leverage this property to develop a recursive algorithm that applies the FF heuristic to find an optimal solution efficiently. This recursive first-fit (Rec-FF) algorithm complements our recent algorithm that recursively searches the routing space, and may be combined with it to solve large routing and spectrum allocation (RSA) problem instances to optimality.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:SrsqWtBqNIQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On distance-adaptive routing and spectrum assignment in mesh elastic optical networks",
            "Publication year": 2017,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOCN-9-5-456",
            "Abstract": "The routing and spectrum assignment (RSA) problem has emerged as the key design and control problem in elastic optical networks. Distance-adaptive spectrum allocation exploits the tradeoff between spectrum width and reach to improve resource utilization by tailoring the modulation format to the level of impairments along the path. In this paper, we consider the distance-adaptive RSA (DA-RSA) problem with fixed alternate routing. We first show that the DA-RSA problem in networks of general topology is a special case of a well-studied multiprocessor scheduling problem. We then leverage insights from the scheduling theory to 1) present new results regarding the complexity of the DA-RSA problem and 2) build upon the list of scheduling concepts to develop a computationally efficient solution approach that is effective in utilizing the available spectrum resources.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Y20HiHuZk70C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Traffic grooming in WDM ring networks with the min-max objective",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-24693-0_15",
            "Abstract": "We consider the problem of traffic grooming in WDM ring networks. Previous studies have focused on minimizing aggregate representations of the network cost. In this work, we consider a Min-Max objective, in which it is desirable to minimize the cost at the node where this cost is maximum. Such an objective is of practical value when dimensioning a network for unknown future traffic demands and/or for dynamic traffic scenarios. We prove that traffic grooming with the Min-Max objective is NP-Complete even when wavelength assignment is not an issue. We also present a new polynomial-time algorithm for Min-Max traffic grooming. Experiments with a wide range of problem instances demonstrate that our algorithm produces solutions which are always close to the optimal and/or the lower bound, and which scale well to large network sizes, large number of wavelengths, and high loads.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:qUcmZB5y_30C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Optical layer multicast: rationale, building blocks, and challenges",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1174179/",
            "Abstract": "Optical layer multicast refers to the support of point-to-multipoint connections directly at the physical layer by employing passive devices capable of splitting the power of an input signal among several outputs. Optical multicast technology enables a broad set of applications and opens new directions to network design. We examine the underlying principles and essential components for a practical optical multicast service. We also present a set of key research challenges along with a survey of the literature.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical Traﬃc Grooming",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=yMVa4Qv2AA4C&oi=fnd&pg=PA73&dq=info:Tfkqi163s6wJ:scholar.google.com&ots=9L1uxZQRFU&sig=GIK_DcaG94PaRxwIeJdfK5DuH8k",
            "Abstract": "Traﬃc grooming is the ﬁeld of study that is concerned with the development of algorithms and protocols for the design, operation, and control of networks with multigranular bandwidth demands [1]. As the number of logical entities (including sub-wavelength channels, wavelengths, wavebands, and ﬁbers) that need to be controlled in a multigranular network increases rapidly with the network size, wavelength capacity, and load, a scalable framework for managing these entities becomes a sine qua non for future wide area WDM networks. Several variants of the traﬃc grooming problem have been studied in the literature under a range of assumptions regarding the network topology, the nature of traﬃc, and the optical and electronic switching model [2, 3, 4, 5, 6, 7, 8, 9, 10]. Typically, an integer linear programming (ILP) formulation serves as the basis for reasoning about and tackling the problem. Unfortunately, solving the ILP directly does not scale to instances with more than a handful of nodes, and cannot be applied to networks of practical size covering a national or international geographical area. Consequently, either the ILP is tackled using standard relaxation techniques, or the problem is decomposed into subproblems which are solved using heuristics. Most of the above studies regard the network as a ﬂat entity for the purposes of lightpath routing, wavelength assignment, and traﬃc grooming. It is well known, however, that in existing networks resources are typically managed and controlled in a hierarchical manner. The levels of the hierarchy either reﬂect the underlying organizational structure of the network or are designed in order to …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:cAX_JoMERPUC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Choicenet: Network innovation through choice",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6524925/",
            "Abstract": "Computer networks, in particular the Internet, represent essential infrastructure for business, government, military, and personal communication. Several recent trends in technology and network use have pushed the capabilities required of the Internet beyond what can be provided by the currently deployed infrastructure. To address these limitations, the network community has developed a variety of technologies to adapt the functionality of network protocols and services. A critical question that remains unanswered is how to integrate these technologies into an ecosystem that involves users, service providers, and developers in such a way that new ideas can be deployed and used in practice. In this work, we discuss how to design a network architecture where choices at different layers of the protocol stack are explicitly exposed to users. Our ChoiceNet system is based on three tightly coupled principles in that it …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Power efficient traffic grooming in optical WDM networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5425886/",
            "Abstract": "Power-awareness in networking attracts more attention as the trends in the energy consumption of the Internet raise growing concerns about the environmental impacts and sustainability of the network expansion. Building energy efficient equipment is definitely an integral part of the solution. However, such a strategy should be complemented with appropriate network protocols and routing methods to achieve maximum performance. In this paper, total power consumption of an optical WDM network is modeled in terms of the power consumed by individual lightpaths. The proposed model is then used to develop an ILP (Integer Linear Programming) formulation of the grooming problem. The exact solution of the formulation on a small network indicates that significant energy savings can be achieved with power efficient grooming.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:YOwf2qJgpHMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Grid networking",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=jzZ0GbYwVeMC&oi=fnd&pg=PA88&dq=info:VOoFPanmhL0J:scholar.google.com&ots=28Mk492Ezb&sig=MHikSYaV4oDf-wDJ7gmD-fzzru8",
            "Abstract": "Research in Grid Computing has become popular with the growth in network technologies and high-performance computing. Grid Computing demands the transfer of large amounts of data in a timely manner. In this chapter, we discuss Grid Computing and networking. We begin with an introduction to Grid Computing and discuss its architecture. We provide some information on Grid networks and continue with various current applications of Grid networking. The remainder of the chapter is devoted to research in Grid networks. We discuss the techniques developed by various researchers with respect to resource scheduling in Grid networks.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:rr29yNp9FasC",
            "Publisher": "Cambridge University"
        },
        {
            "Title": "Optimal wavelength sharing policies in OBS networks subject to QoS constraints",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4395246/",
            "Abstract": "We consider the general problem of optimizing the performance of OBS networks with multiple traffic classes subject to strict (absolute) QoS constraints in terms of the end-to-end burst loss rate of each guaranteed class of traffic. We employ Markov decision process (MDP) theory to obtain optimal wavelength sharing policies for two performance objectives, namely, maximization of weighted network throughput and minimization of the loss rate of best-effort traffic, while meeting the QoS guarantees. The randomized threshold policies we obtain are simple to implement and operate, and make effective use of statistical multiplexing. In particular, the threshold randomization feature enables the policies to allocate bandwidth at arbitrarily fine sub-wavelength granularity, hence making effective use of the available network capacity.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:b0M2c_1WBrUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Performance evaluation of multithreaded SIP servers",
            "Publication year": 2015,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.643.742&rep=rep1&type=pdf",
            "Abstract": "Multi-threading is a widely used program execution model, where each thread executes independently, while sharing some of the process resources. Multi-threaded processes are used for a range of network application servers including web-servers, mail-servers and SIP Proxy servers (SPS) for Voice over IP (VoIP). In this work, we investigate the performance of OpenSIPS, an open source SIP proxy server. We have collected a large set of experimental data, in a methodical fashion to characterize the performance of SPS as a function of number of server threads and call arrival rates. We model the SIP proxy server as an M/G/c/K queue. Our model includes two parameters that capture two aspects of the computing environment that affect the SPS performance: the overhead due to interrupts that we introduced in earlier study of a single-thread server, and the contention among multiple threads. Using these parameters, the queuing model accurately predicts the call arrival rate at which the drop probability exceeds 1%, for a given number of server threads. To the best of our knowledge, this is the first parametrized queuing model for a SIP proxy server. Our measurement and modeling methodology may be extended to allow network operators to predict the performance capabilities of a range of network application servers.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:8xutWZnSdmoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Access protocols for optical burst-switched ring networks",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020025502002475",
            "Abstract": "In this paper, we consider a WDM metro ring architecture with optical burst switching. Several access protocols are proposed and their performance is analyzed by simulation.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:hMod-77fHWUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A framework for absolute QoS guarantees in optical burst switched networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4374363/",
            "Abstract": "We consider the problem of supporting absolute QoS guarantees in terms of the end-to-end burst loss in OBS networks. We present a parameterized model for wavelength sharing which provides for isolation among different traffic classes while also making efficient use of wavelength capacity through statistical multiplexing. We develop a heuristic to optimize the policy parameters for a single link of an OBS network. We also develop a methodology for translating the end-to-end QoS requirements into appropriate per-link parameters so as to provide network-wide guarantees. Our approach is easy to implement, it can support a wide variety of traffic classes, and is effective in meeting the QoS requirements and keeping the loss rate of best-effort and overall traffic low.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:YFjsv_pBGBYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A simulation study of access protocols for optical burst-switched ring networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/3-540-47906-6_70.pdf",
            "Abstract": "In this paper, we consider a WDM metro ring architecture with optical burst switching. Several access protocols are proposed and their performance is analyzed by simulation.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:-f6ydRqryjwC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Spectrum assignment in mesh elastic optical networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7288470/",
            "Abstract": "Spectrum assignment has emerged as the key design and control problem in elastic optical networks. We have shown that spectrum assignment in networks of general topology is a special case of scheduling multiprocessor tasks on dedicated processors. Based on this insight, we develop and evaluate efficient and effective algorithms for mesh and chain networks that build upon list scheduling concepts.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:ysWPWRY3VgcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the design of MPLambdas networks",
            "Publication year": 2001,
            "Publication url": "https://repository.lib.ncsu.edu/bitstream/handle/1840.4/791/TR-2001-07.pdf?sequence=1",
            "Abstract": "Я гвз ж и джг а б г з в в в ХШ Ы в илгж г гди а жгззЙ гвв из ДЧ зЕ иг ви ж гвЙ в и к в вйб ж г а а зл и жгйи жз ДФЫЪзЕК Я дж з ви з и г йж зи а гж и бз иг ж зз и гб в джг а б г д нз а игдгаг н з в Д К КИ и жб в и вйб ж г Ч з ж ей ж в и Ќ ж а в з бгв и бЕ в аг а игдгаг н з в Д К КИ и жб в и жгйи в в л к а в и зз вЙ б ви гж и а ид и з бгв и ФЫЪзЕК Эва дж к гйз зий з л л ж а б и иг зб аа игдгаг з л и в йа г вг зИ гйж йж зи а гж и бз в дда ж иан иг в илгж з л и йв ж з гж и гйз в з г ФЫЪз в в гббг и вйб ж г а ид и з и и з в гж ж г б в ий а ж ж и в и вйб ж г ФЫЪзК Я дж з ви вйб ж а ж зйаиз гж л ж в г знзи б д ж б и жз зй з и вйб ж г л к а в и з д ж Ќ жИ и вйб ж г иж вз к жз д ж ФЫЪИ в и вйб ж г дгжиз д ж Ч И л джгк в л вз и виг и з в г ХШ Ы в илгж зК",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:cFHS6HbyZ2cC",
            "Publisher": "North Carolina State University. Dept. of Computer Science"
        },
        {
            "Title": "Online algorithms for advance resource reservations",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0743731511000153",
            "Abstract": "We consider the problem of providing QoS guarantees to Grid users through advance reservation of resources. Advance reservation mechanisms provide the ability to allocate resources to users based on agreed-upon QoS requirements and increase the predictability of a Grid system, yet incorporating such mechanisms into current Grid environments has proven to be a challenging task due to the resulting resource fragmentation. We use concepts from computational geometry to present a framework for tackling the resource fragmentation, and for formulating a suite of scheduling strategies. We also develop efficient implementations of the scheduling algorithms that scale to large Grids. We conduct a comprehensive performance evaluation study using simulation, and we present numerical results to demonstrate that our strategies perform well across several metrics that reflect both user- and system-specific goals …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:5ugPr518TE4C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Scheduling algorithms for unicast, multicast, and broadcast",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-47021-7_8",
            "Abstract": "In this chapter we present a survey of algorithms for scheduling packet traffic in broadcast optical WDM networks. We first describe the context and motivations of the scheduling problem. We then review the current literature in the field with an emphasis on scheduling techniques for providing best-effort service as well as guaranteed service for both unicast and multi-destination traffic. We provide alternative formulations of the problem, and we compare the formulations and theoretical results, as well as algorithms and heuristics.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:xtRiw3GOFMkC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "A new internet architecture to enable software defined optics and evolving optical switching models",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4769046/",
            "Abstract": "The design of the SILO network architecture of fine-grain services was based on three fundamental principles. First, SILO generalizes the concept of layering and decouples layers from services, making it possible to introduce easily new functionality and innovations into the architecture. Second, cross-layer interactions are explicitly supported by extending the definition of a service to include control interfaces that can be tuned externally so as to modify the behavior of the service. The third principle is ldquodesign for change:ldquo the architecture does not dictate the services to be implemented, but provides mechanisms to introduce new services and compose them to perform specific communication tasks. In this paper, we provide an update on the current status of the architecture and the prototype software implementation. We also introduce the concept of ldquosoftware defined opticsrdquo (SDO) to refer to the …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:PELIpwtuRlgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical traffic grooming formulations",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6831420/",
            "Abstract": "Hierarchical traffic grooming facilitates the control and management of multigranular WDM networks. We define the hierarchical virtual topology and traffic routing (H-VTTR) problem, the grooming-specific subproblem of traffic grooming, and we present a suite of ILP formulations to solve it. The formulations represent various tradeoffs between solution quality and running time.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:IUKN3-7HHlwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the application of k-center algorithms to hierarchical traffic grooming",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1589748/",
            "Abstract": "In this paper, we study a clustering technique for the hierarchical traffic grooming approach in WDM mesh networks. The objective is to minimize the cost of electronic ports, as well as the wavelength requirement of the solution. In the hierarchical grooming approach we have presented in previous work, the first phase is to partition a large mesh network into clusters of nodes. The clustering phase is very important for the final grooming result. Various clustering approaches have been considered in literature; however, not all are suitable for traffic grooming application because they do not take grooming goals into account. In this work, we select a suitable existing clustering algorithm, developed for the K-center problem, and study its performance as a clustering algorithm for hierarchical grooming. We then improve the algorithm, adapting it specifically for the traffic grooming problem. Experimental results show that the …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Peer review is a fundamental aspect of maintaining high editorial standards for journals. Our reviewers provide helpful comments to authors of all manuscripts, and their critical assessment is invaluable for the editors when selecting the papers for publication in Optical Switching and Networking. The members of the Editorial Board express their appreciation to the following individuals who have generously volunteered their time to review manuscripts during 2008. Our apologies and thanks to any reviewer whose name may",
            "Publication year": 2009,
            "Publication url": "https://scholar.google.com/scholar?cluster=2571935968755534581&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:OcBU2YAGkTUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A unified architecture for cross layer design in the future optical internet",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5286984/",
            "Abstract": "We present a novel architecture, which naturally enables cross-layer interactions through the construction of application-specific protocol stacks out of small reusable services which expose explicit controls to cross-layer tuning policies. Together with a concept we term `Software Defined Optics' (SDO) this architecture can enable the future optical internet.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:WqliGbK-hY8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Flow isolation in optical networks",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6076926/",
            "Abstract": "We address the issue of ensuring the integrity and privacy of communications in optical networks. To this end, we extend the traffic grooming concept to encompass flow isolation considerations through a multi-class traffic model. We develop, solve, and compare ILP formulations that ensure that only traffic components within the same class are groomed onto (share) the same wavelength. Our approach provides flow isolation guarantees with an increase in overall cost as a tradeoff.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:WA5NYHcadZ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On congestion minimization for service chain routing problems",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8761660/",
            "Abstract": "Network function virtualization (NFV), with its perceived potential to accelerate service deployment and to introduce flexibility in service provisioning, has drawn a growing interest from industry and academia alike over the past few years. One of the key challenges in realizing NFV is the service chain routing problem, whereby traffic must be routed so as to traverse the various components of a network service that have been mapped onto the underlying network. In this work, we consider the online service chain routing problem with the goal of minimizing the maximum network congestion. To this end, we present a simple yet effective online algorithm in which the routing decision is irrevocably made without prior knowledge of future requests. We prove that our algorithm is O(log m)-competitive, where m is the number of edges of the underlying network topology, and we show that this ratio is asymptotically optimal.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:RfQ-KHj5eBsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic grooming in optical networks: Decomposition and partial linear programming (LP) relaxation",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-5-8-825",
            "Abstract": "We consider the traffic grooming problem, a fundamental network design problem in optical networks. We review a typical integer linear program formulation considered in the literature, and we identify two challenges related to this formulation in terms of scalability and wavelength fragmentation. We then propose a new (to our knowledge) solution approach that decomposes the traffic grooming problem into two subproblems that are solved sequentially: 1) the virtual topology and traffic routing (VTTR) subproblem, which does not take into account physical topology constraints, and 2) the routing and wavelength assignment subproblem, which reconciles the virtual topology determined by VTTR with the physical topology. The decomposition is exact when the network is not wavelength limited. We also propose an algorithm that uses a partial linear programming relaxation technique driven by lightpath utilization …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:a3BOlSfXSfwC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Optimization-Aware Scheduling in Cloud Computing",
            "Publication year": 2016,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2980258.2980293",
            "Abstract": "Cloud computing allows delivery of computational resources via internet. Some of the computational resources include signals, codes and physical resources. Cloud users require computational resources for execution of their tasks. The computational elements, when thoroughly assigned to the cloud users according to requirement facilitate an efficient scheduling mechanism. The efficiency is dependent on the parameters chosen to promote the assignment of task to resources. Here, computational cost is chosen as the optimization factor, and the solution with the least cost is selected as the best assignment. A Cuckoo Search inspired technique is used, and task assignment to resources is done by validating the solution with the least value of cost.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:G60ApcfeQaAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On wavelength assignment in optical burst switched networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1363787/",
            "Abstract": "A fundamental assumption underlying most studies of optical burst switched (OBS) networks is that full wavelength conversion is available throughout the network. In practice however, economic and technical considerations are likely to dictate a more limited and sparse deployment of wavelength converters in the optical network. Therefore, we expect wavelength assignment policies to be an important component of OBS networks. In this paper, we explain why wavelength selection schemes developed for wavelength routed networks are not appropriate for OBS. We then develop a suite of adaptive and non-adaptive policies for OBS switches. We also apply traffic engineering techniques to reduce wavelength contention through traffic isolation. Our performance study indicates that, in the absence of full conversion capabilities, intelligent choices in assigning wavelengths to bursts at the source can have a profound …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A comparison of the JIT, JET, and horizon wavelength reservation schemes on a single OBS node",
            "Publication year": 2003,
            "Publication url": "https://csc.ncsu.edu/faculty/rouskas/Publications/Conferences/WOBS-Teng-2003.pdf",
            "Abstract": "We present a detailed analysis of the JIT, JET, and Horizon wavelength reservation schemes for optical burst switched (OBS) networks. Our analysis accounts for several important parameters, including the burst offset length, and the optical switching and hardware processing overheads associated with bursts as they travel across the network. The contributions of our work include:(i) analytical models of JET and Horizon (on a single OBS node) that are more accurate than previously published ones, and which are valid for general burst length and offset length distributions; and (ii) the determination of the regions of parameter values in which a more complex reservation scheme reduces to a simpler one. We compare the performance of the three wavelength reservation schemes on a single OBS node under various sets of parameter values. Our major finding is that, under reasonable assumptions regarding the current and future state-of-the-art in optical switch and electronic hardware technologies, the simplicity of JIT seems to outweigh any performance benefits of Horizon and JET.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance analysis of an edge optical burst switching node with a large number of wavelengths",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138834370380238X",
            "Abstract": "We consider an edge optical burst switching (OBS) node with or without converters, and with no buffering. The OBS node serves a number of users, each connected to the switch with a fiber link that supports multiple wavelengths. Each wavelength is associated with a 3-state Markovian burst arrival process which permits short and long bursts to be modeled. In a previous paper [18], we modeled the edge OBS node as a closed multi-class non-product-form queueing network, which we analyzed approximately by decomposition. In this paper, we develop computationally efficient approximate algorithms to analyze an edge node in the limiting case where the number of wavelengths is large. This limiting case is of practical importance since WDM technology will permit hundreds of wavelengths in a fiber.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Computing Across Curricula",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.140.9139&rep=rep1&type=pdf",
            "Abstract": "Today’s somewhat disjointed approach to discipline-specific computing and generic computer literacy does not accurately mirror the knowledge, skills, and abilities needed by the engineer of the future global workplace. Computing in the workplace is pervasive and involves many complex tools, many approaches to problem solving, strategic decision making, and synthesis. Knowledge, comprehension, and application are no longer enough for one to be labeled highly competent in computing. A successful engineer will need a mastery of computing applicable to the higher level cognitive skills of analysis, synthesis, and evaluation, as well. To prepare students for pervasive, advanced computing in the workplace, we must begin to think in terms of pervasive, advanced computing in their education. This premise served as the basis for a project funded by the National Science Foundation CISE Pathways to Revitalized Undergraduate Computing Education (CPATH) initiative in 2007. The project is being carried out by the authors comprised of a multidisciplinary team of faculty from six departments in the College of Engineering and one from the College of Education at North Carolina State University.The project has two overarching goals:(1) create a computational thinking thread in the engineering curriculum that spans from the freshman to senior years and bridges the divide between freshman year computing and computing in upper-level classes, and (2) enable students to take computing competency to the next level, where they are able to perform high-level computing tasks within the context of a discipline. The first phase of the project entails …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:1yQoGdGgb4wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Service-concatenation routing with applications to network functions virtualization",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8038463/",
            "Abstract": "Interest in network functions virtualization (NFV) continues to grow due to its perceived benefits to both service providers and users. One of the main challenges in realizing NFV has to do with orchestration of virtual functions deployed in various locations across the network. In this work, we consider the service-concatenation routing problem, where the objective is to construct a path of minimum cost that visits a set of nodes where virtual services are to be applied to the user's traffic in a specific order. We first show that this problem can be modeled as the shortest path tour problem (SPTP) that has been studied in different contexts. We then review and implement a suite of algorithms that use a variety of solution approaches for tackling SPTP, and we also develop a new algorithm. Finally, we carry out a comprehensive experimental evaluation of all algorithms and demonstrate that our algorithm scales well to large …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Y0agIcFmOsQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Graduc-1te Certificate In Agriculture Data Srience",
            "Publication year": 2021,
            "Publication url": "https://scholar.google.com/scholar?cluster=12822555155601124254&hl=en&oi=scholarr",
            "Abstract": "The Graduate Certificate in Agriculture Data Science is an interdisciplinary graduate certificate program that applies the power of data science to agriculture, food and life science issues. The certificate is housed in the College of Agriculture and Life Science at North Carolina State University and brings together faculty and coursework from three colleges: Agriculture and Life Science (CALS), College of Engineering (COE), and College of Science (COS) and 15 departments from those colleges.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:2BeMVx_SZpEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Design of logical topologies for wavelength routed networks",
            "Publication year": 2000,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=05DzBwAAQBAJ&oi=fnd&pg=PA79&dq=info:g2IIQ4i8nscJ:scholar.google.com&ots=sb8xbuj2X-&sig=85-mild-RYqsAmdpbr6_jlQGq8M",
            "Abstract": "In this chapter we provide a complete formulation of the problem and survey the literature on the topic. We restrict ourselves to transport networks rather than local area networks, and static topology design as opposed to topologies in which individual lightpaths are set up and torn down in response to traffic demands.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:lonyfjS0l_UC",
            "Publisher": "Kluwer Publishers"
        },
        {
            "Title": "Resource co-allocation for large-scale distributed environments",
            "Publication year": 2009,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/1551609.1551634",
            "Abstract": "Advances in the development of large scale distributed computing systems such as Grids and Computing Clouds have intensified the need for developing scheduling algorithms capable of allocating multiple resources simultaneously. In principle, the required resources may be allocated by sequentially scheduling each resource individually. However, such a solution can be computationally expensive, hence inappropriate for time-sensitive applications, and may lead to deadlocks. In this work we present an efficient online algorithm for co-allocating resources that also provides support for advance reservations. The algorithm utilizes data structures specifically designed to organize the temporal availability of resources, and implements co-allocation through efficient range searches that identify all available resources simultaneously. We use simulations driven by real workloads to show that the co-allocation …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Secure burst control packet scheme for Optical Burst Switching networks",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7230771/",
            "Abstract": "Optical networks are the most adequate platform for the transport of ever increasing bandwidth-hungry applications and services (BwGAS). Additionally, these networks cope with the continuous growth of the number of Internet users. Optical Burst Switching (OBS) paradigm is expected to be the backbone infrastructure of near-future all-optical Internet. In OBS, data and control packet known as burst header packet (BHP) are sent out of band (i.e., control packets and data bursts are carried by different channels) and it is sent ahead of the data burst to reserve necessary network resources for the corresponding burst. After the elapse of a predetermined time known as offset time, the data burst is sent with the hope that, the control packet was able to make necessary reservations. Sending the BHP ahead of the burst exposes the burst to different security challenges, particularly data burst redirection and denial of service …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:SQZOXlr1FBsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multi-destination communication in broadcast WDM networks: A survey",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.10.4635",
            "Abstract": "In this paper we survey protocols and scheduling algorithms designed to transport multi-destination traffic in broadcast WDM networks. The protocols are classified based on the underlying strategy used to transmit multicast packets, as well as on their assumptions regarding the network architecture. A number of approaches for scheduling both single-and multi-destination traffic are also described and discussed. We discuss the advantages and disadvantages of each scheme, and we also identify the regions of network operation for which each strategy is most appropriate.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Next-generation internet: architectures and protocols",
            "Publication year": 2011,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=jzZ0GbYwVeMC&oi=fnd&pg=PR7&dq=info:wCpClyB2dXQJ:scholar.google.com&ots=28Mk493vq3&sig=tNjQk8xs0nbC_kLA1Tpmgy-CS2Q",
            "Abstract": "With ever-increasing demands on capacity, quality of service, speed, and reliability, current Internet systems are under strain and under review. Combining contributions from experts in the field, this book captures the most recent and innovative designs, architectures, protocols, and mechanisms that will enable researchers to successfully build the next-generation Internet. A broad perspective is provided, with topics including innovations at the physical/transmission layer in wired and wireless media, as well as the support for new switching and routing paradigms at the device and sub-system layer. The proposed alternatives to TCP and UDP at the data transport layer for emerging environments are also covered, as are the novel models and theoretical foundations proposed for understanding network complexity. Finally, new approaches for pricing and network economics are discussed, making this ideal for students, researchers, and practitioners who need to know about designing, constructing, and operating the next-generation Internet.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:4fKUyHm3Qg0C",
            "Publisher": "Cambridge University Press"
        },
        {
            "Title": "Networks and Switching-Adaptive Path Selection in OBS Networks",
            "Publication year": 2006,
            "Publication url": "https://scholar.google.com/scholar?cluster=9767073387281642595&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:eK4aujBuqBIC",
            "Publisher": "New York, NY: Institute of Electrical and Electronics Engineers, c1983-"
        },
        {
            "Title": "Determination of task scheduling mechanism using computational intelligence in Cloud Computing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7411217/",
            "Abstract": "Cloud Computing delivers computational services through the internet. The services availed can vary according to the user requirements. The services are basically provided using virtualization technique. One of the services that are provided is the computational services for the client tasks. The client provides the Service Provider with various sized tasks that need to be executed. The execution of tasks is done using the resources present within the Provider of the services. The service provider checks for available resources, and allocates the jobs to these resources in such a manner as to minimize execution time, and various other factors that affect the performance of the Cloud. The process of allocating resources to the tasks is known as scheduling, and various scheduling mechanisms are present. A single scheduling strategy may not be always optimal in performing scheduling. In this paper, an improved …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:uHQrz-U2knEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Practical and Efficient Implementation of WF2Q+",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288707/",
            "Abstract": "The WF 2 Q+ scheduler combines all three properties that are important to a fair queueing algorithm: a tight delay bound, a small worst-case fair index value, and a relatively low worst-case complexity of  O ( log n ) for a link with  n  flows. We present a new implementation of WF 2 Q+ in which both the number of packet sorting operations and the computation of the virtual time function are independent of the number  n  of flows. Our implementation exploits two widely observed characteristics of the Internet, namely that service providers offer some type of tiered service with a small number of service levels, and that a small number of packet sizes dominate. Our scheduler combines provably good performance with amenability to hardware implementation in high-speed routers.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:70eg2SAEIzsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "At-scale experimentation with resource virtualization in a metro optical testbed",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.141.1481&rep=rep1&type=pdf",
            "Abstract": "In this paper we describe several efforts to explore integrated approaches to resource virtualization in a metro-scale optical testbed dubbed BEN (Breakable Experimental Network) located in Research Triangle Park, NC. The first one is an extension of work done at Duke on the ORCA (Open Resource Control Architecture) framework. The effort between RENCI and Duke seeks to expand the scope ORCA to enable it to function as management plane for the network as well as edge resources, acting as a GENI management plane. The second describes an attempt to redefine the architecture of the protocol stack with important implications to network virtualization. This is done using the SILO (Services Integration controL and Optimization) framework being jointly developed at RENCI and NCSU.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:a0OBvERweLwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Performance modeling of an edge optical burst switching node",
            "Publication year": 2002,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.641.6464&rep=rep1&type=pdf",
            "Abstract": "We consider an edge optical burst switching (OBS) node with or without converters. The OBS node serves a number of users, each connected to the switch over a fiber link that supports multiple wavelengths. Each wavelength is associated with a 3-state Markovian burst arrival process. The arrival process permits short and long bursts to be modeled. We model the edge OBS node as a closed non-product-form queueing network, and we develop a suite of approximate algorithms to analyze it. Our approximate algorithms have a good accuracy, and they provide insight into the effect of various system parameters on the performance of the edge OBS node.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:eflP2zaiRacC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computing call blocking probabilities in LEO satellite networks",
            "Publication year": 2001,
            "Publication url": "https://search.proquest.com/openview/7460b41be9386a80573a08edce87848e/1?pq-origsite=gscholar&cbl=18750&diss=y",
            "Abstract": "We present an analytical model for computing call blocking probabilities in a LEO satellite network that carries voice calls. Both satellite-fixed and earth-fixed constellations are considered. The model is analyzed approximately by decomposing it into sub-systems. Each sub-system is solved exactly in isolation using a Markov process and the individual results are combined together through an iterative method. Our model also calculates call blocking probabilities due to hand-offs. Numerical results demonstrate that our method is accurate for a wide range of traffic patterns and for constellations with a number of satellites that is representative of commercial systems. For larger systems, we also propose a method to calculate upper and lower bounds for call blocking probabilities.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:4OULZ7Gr8RgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Tiered Structures for Multiple Services",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_6",
            "Abstract": "In our study of tiered service so far, we have considered only the case where the network service is characterized by a single parameter, e.g., Internet access speed or amount of user-generated traffic. In practice, network providers often package several distinct services into a bundle, or provide a single service that may be characterized by multiple parameters. Service bundles, and associated tiered structures, are quite common in the telecommunications market. For instance, wireless providers combine voice, data, and text services into tiered subscription packages marketed to users, where a given tier corresponds to a certain combination of values for voice minutes, Internet (e.g., web and email) data, and text messages available to the user during the billing period (with additional charges applying if the user exceeds its allocation in any of the services). Similarly, ISPs may bundle a broadband access service with …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:IRz6iEL74y4C",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "ERONs: Dynamic Optical Networking via Overlay Control of Static Lightpaths",
            "Publication year": 2009,
            "Publication url": "https://rouskas.csc.ncsu.edu/Publications/Talks/ONDM-2009-ERON.pdf",
            "Abstract": "ERONs: Dynamic Optical Networking via Overlay Control of Static Lightpaths Page 1 ERONs: \nDynamic Optical Networking via Overlay Control of Static Lightpaths G. Karmous-Edwards, \nD. Reeves, L. Battestilli, P. Vegesna, A. Viswanath, GN Rouskas Department of Computer \nScience North Carolina State University Supported by DARPA under Grant No: HR0011-08-1-0076 \nERONs: Dynamic Optical Networking via Overlay Control of Static Lightpaths ONDM 2009, \nFebruary 18, 2009 – p.1 Page 2 Outline Dynamic Optical Networking: Vision vs. Reality Edge \nReconfigurable Optical Networks (ERONs) ERON Dimensioning Simulation Results ERONs: \nDynamic Optical Networking via Overlay Control of Static Lightpaths ONDM 2009, February \n18, 2009 – p.2 Page 3 Dynamic Optical Networking Vision: E2E transparent lightpaths with \noptical switching Hundreds of λs On-demand optical connections Highly reconfigurable : , .…",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:JG67p0iyyesC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Path switching in OBS networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11422778_33",
            "Abstract": "We investigate the concept of path switching in optical burst switched (OBS) networks and its potential to reducing the overall burst drop probability.With path switching, each source maintains a list of alternate paths to each destination, and uses information regarding the recent congestion status of the network links to rank the paths; it then transmits bursts along the least congested path. We present a suite of path switching strategies, each utilizing a different type of information regarding the link congestion status, and evaluate them using simulation. Our results demonstrate that, in general, path switching outperforms shortest path routing, and, depending on the path strategy involved, the network topology, and the traffic pattern, this improvement can be significant. We also present a new framework for the development of hybrid path switching strategies, which make routing decisions based on a weighted …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "selection algorithms for link-based ILPs and applications to RWA in mesh networks",
            "Publication year": 2013,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.641.8386",
            "Abstract": "RWA is a fundamental problem in the design and control of optical networks. We propose link selection algorithms that reduce the size of the link-based ILP formulation for RWA by pruning redundant link decision variables. The resulting formulation scales well to mesh topologies representative of backbone and regional networks. In our experiments, the new formulation decreases the running time by more than two orders of magnitude without any impact on optimality. The link selection techniques are general in that they may be applied to any optimization problem for which the ILP formulation consists of multicommodity flow equations as its core constraints. I.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:aFwNBOTKqaYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Evaluation of sip proxy server performance: Packet-level measurements and queuing model",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6654877/",
            "Abstract": "The growing number of applications that use the Session Initiation Protocol (SIP) to manage media sessions over IP is placing increasing demands on the SIP proxy servers (SPS) that make up the core of the SIP network. In this work we investigate the performance of OpenSIPS, an open source SPS. We have collected a large set of experimental data to characterize the performance of the SPS under various call arrival rates and inter-arrival time distributions. Based on these measurements, we model the SPS as an M/G/1 queue. A key component of the model is a parameter that captures the cache-miss overhead, i.e., the impact of cache-misses on kernel service times.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Y5dfb0dijaUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Minimizing inter-core crosstalk jointly in spatial, frequency, and time domains for scheduled lightpath demands in multi-core fiber-based elastic optical network",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9122545/",
            "Abstract": "Elastic optical networks (EON) technology in combination with space division multiplexing (SDM) is considered as having the potential to expand the transmission capacity of optical transport networks. However, inter-core crosstalk may cause serious signal impairment in a multi-core fiber (MCF) links. At the same time, scheduled lightpath demands, for which the expected setup and teardown times are known in advance, are considered as an important type of traffic demand for future networks. In this article, we develop approaches to schedule simultaneous lightpaths onto non-adjacent MCF cores so as to reduce inter-core crosstalk between these lightpaths. To this end, we first define a new metric to estimate the inter-core crosstalk jointly considering the spatial, frequency, and time domains. We then tackle the routing, spectrum, core, and time assignment (RSCTA) problem for the MCF-based EON by developing …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:RsqFu5Siv-AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the physical and logical topology design of large-scale optical networks",
            "Publication year": 2003,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jlt-21-4-904",
            "Abstract": "We consider the problem of designing a network of optical cross-connects (OXCs) to provide end-to-end lightpath services to large numbers of label switched routers (LSRs). We present a set of heuristic algorithms to address the combined problem of physical topology design (i.e., determine the number of OXCs required and the fiber links among them) and logical topology design (i.e., determine the routing and wavelength assignment for the lightpaths among the LSRs). Unlike previous studies which were limited to small topologies with a handful of nodes and a few tens of lightpaths, we have applied our algorithms to networks with hundreds or thousands of LSRs and with a number of lightpaths that is an order of magnitude larger than the number of LSRs. In order to characterize the performance of our algorithms, we have developed lower bounds which can be computed efficiently. We present numerical results …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Worst-case fair bin sort queuing (WBSQ): an O (1) worst-case fair scheduler",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5963218/",
            "Abstract": "The design of packet schedulers involves a tradeoff between implementation complexity, on one hand, and delay and fairness guarantees, on the other. In this paper, we present worst-case fair bin sort queuing (WBSQ), a new scheduler that has good worst-case fairness and delay properties, yet has low complexity and is amenable to simple hardware implementation. WBSQ achieves this performance by combining features of BSFQ and WF 2 Q+. We establish the worst-case fairness and delay properties of WBSQ through both analysis and simulation.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal granularity of MPLS tunnels",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1388343703801452",
            "Abstract": "We consider the problem of tunneling MPLS label switched paths (LSPs) over an optical network in which λ-channels (lightpaths) of a fixed capacity are the main mechanism of transport. While any set of LSPs, each LSP having an arbitrary rate, can be tunneled over a given λ-channel as long as the aggregate rate does not exceed the channel's capacity, intuition suggests that this flexibility has a limit. In other words, we believe that it is sufficient for the network to provide a small set of fixed service levels in terms of the LSP data rate. We present an efficient dynamic programming algorithm to obtain an optimal set of service levels given (a) a fixed set of LSPs and corresponding bandwidth requests, or (b) the probability distribution of LSP bandwidth requests. The set of optimal service levels strikes a balance between the conflicting goals of simplicity and performance. Numerical results indicate that with as few as ten …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:lSLTfruPkqcC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A reservation protocol for broadcast WDM networks and stability analysis",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128699001371",
            "Abstract": "We consider the problem of coordinating access to the various channels of a single-hop wavelength division multiplexing (WDM) network. We present a high performance reservation (HiPeR-ℓ) protocol specifically designed to overcome the potential inefficiencies of operating in environments with non-negligible processing, tuning, and propagation delays. HiPeR-ℓ differs from previous reservation protocols in that each control packet makes reservations for all data packets waiting in a node's queues, thus significantly reducing control overhead. Packets are scheduled for transmission using algorithms that can effectively mask the tuning times. HiPeR-ℓ also uses pipelining to mask processing times and propagation delays; parameter ℓ of the protocol is used to control the degree of pipelining. We use Markov chain theory to obtain a sufficient condition for the stability of the protocol. The stability condition provides …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:NMxIlDl6LWMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Application-based dynamically reconfigurable optical network on chip architecture",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9125862/",
            "Abstract": "We propose an application based dynamically reconfigurable optical network on chip architecture and a power efficient reconfigurable optical router structure. The simulation results show the reconfigurable architecture can reduce path-setup delay by 70% compared with Torus and 43% compared with Firefly under a dynamic traffic.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:c6chOJGeGucC",
            "Publisher": "IET"
        },
        {
            "Title": "Power-aware lightpath management for SDN-based elastic optical networks",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8038398/",
            "Abstract": "Elastic optical networks (EONs) are considered as the most promising technology for interconnecting data centers. With the rapid growth of inter- datacenter traffic, power consumption of EONs becomes a significant challenge. In this work, we present a lightpath management algorithm that uses traffic prediction techniques to eliminate unnecessary lightpath termination and re- establishment so as to decrease switching power and enhance the energy efficiency of the network. Our algorithm builds upon the centralized control and capabilities of software defined networking (SDN) technology. Numerical results show that the proposed algorithm is effective in achieving substantial savings in power consumption while maintaining a bandwidth blocking ratio at levels comparable to those of earlier algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:hbz17DqrwuEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The SILO architecture for services integration, control, and optimization for the future internet",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288987/",
            "Abstract": "We propose a new internetworking architecture that represents a departure from current philosophy and practice, as a contribution to the ongoing debate regarding the future Internet. Building upon our experience with the design and prototyping of the just-in-time protocol suite, we outline a framework consisting of (1) building blocks of fine-grain functionality, (2) explicit support for combining elemental blocks to accomplish highly configurable complex communication tasks, and (3) control elements to facilitate (what is currently referred to as) cross-layer interactions. In this position paper, we take a holistic view of network design, allowing applications to work synergistically with the network architecture and physical layers to select the most appropriate functional blocks and tune their behavior so as to meet the application's needs within resource availability constraints. The proposed architecture is flexible and …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:eQOLeE2rZwMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic grooming in star networks",
            "Publication year": 2004,
            "Publication url": "https://repository.lib.ncsu.edu/bitstream/handle/1840.4/902/TR-2004-16.pdf?sequence=1",
            "Abstract": "We study the traffic grooming problem on WDM networks with the physical topology of a star. In star networks, several nodes are connected to a single hub directly through a bidirectional optical fiber, but are not connected to each other. Previous studies concentrated on the objective of minimizing the total amount of electronic switching. However, in order to lower the network cost, we consider the objective of minimizing the number of line terminating equipments (LTE), which has dominating cost among optical devices. We first show our study on the various complexity results of the problem. A variation of the objective to minimize the maximum number of LTEs at each node (the Min-Max objective) is also studied. Then, heuristic algorithms are given for the two objectives, respectively. Numerical results are collected to show the effectiveness of our algorithm from experiments. The relationship between the two objectives is explored as well.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:maZDTaKrznsC",
            "Publisher": "North Carolina State University. Dept. of Computer Science"
        },
        {
            "Title": "QoS‐aware ant‐based route, wavelength and timeslot assignment algorithm for optical burst switched networks",
            "Publication year": 2015,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.2919",
            "Abstract": "All‐optical networks are the aspiration of bandwidth‐greedy applications providers and users such as telecom operators and scientific research centres. Because of the limitations of current network infrastructures, some optical switching paradigms have been proposed. Among these paradigms, optical burst switching (OBS) is seen as the most appropriate solution. However, OBS suffers from high burst loss ratio as a result of contention at the buffer‐less core node. According to current optical technology reviews, cost effective optical memories are yet to be cost effective. In this paper, an ant‐based route, wavelength and timeslot allocation algorithm is proposed to address high burst loss in OBS and improve the overall network performance. The solution was implemented in hierarchical time‐sliced OBS and was evaluated through computer simulation where it was compared with shortest path (SP) algorithm …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:d4Uf0zfqV5IC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Exploiting SDN principles for extremely fast restoration in elastic optical datacenter networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7841831/",
            "Abstract": "In order to find out the tradeoff between recovery time and resource overhead when a link failure occurs, we propose a software-defined based fast restoration scheme for elastic optical datacenter networks, called precomputation based restoration path (P-RP). By extending the controller functionality and OpenFlow protocol in software defined networking (SDN) technology, we establish a novel elastic optical inter-datacenter network architecture which can quickly and accurately converge the network state information with a global view for failure recovery. Based on this architecture, the P-RP performs path computation and bandwidth resource selection for restoration before a failure occurs. The experimental results demonstrate that the proposed scheme can achieve fast recovery with low blocking probability while maintaining high spectrum efficiency. Compared with existing restoration schemes, average recovery …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:renmPk63pRgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Considerations for sizing buffers in optical packet switched networks",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5062047/",
            "Abstract": "Optical packet switches of the foreseeable future are expected to have severely limited buffering capability, since storage of optical signals remains a difficult and expensive operation. Our observations in simulation of TCP and real-time traffic in networks with such small buffers have revealed regions of anomalous performance in which losses for real-time traffic become higher as buffers get larger. The detrimental impact of larger optical buffers is studied in this paper and three new contributions are made. First, we develop a Markov chain model that allows analytical computation of loss. Our model validates observations from simulation, and opens the doors to an analytical understanding of how various factors affect the anomaly. Second, we study the anomaly under realistic traffic mixes containing persistent and non-persistent TCP flows, and show that the traffic mix does not significantly alter the anomaly. Third …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:yD5IFk8b50cC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum management techniques for elastic optical networks: A survey",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427714000253",
            "Abstract": "In recent years, OFDM has been the focus of extensive research efforts in optical transmission and networking, initially as a means to overcome physical impairments in optical communications. However, unlike, say, in wireless LANs or xDSL systems where OFDM is deployed as a transmission technology in a single link, in optical networks it is being considered as the technology underlying the novel elastic network paradigm. Consequently, network-wide spectrum management arises as the key challenge to be addressed in network design and control. In this work, we review and classify a range of spectrum management techniques for elastic optical networks, including offline and online routing and spectrum assignment (RSA), distance-adaptive RSA, fragmentation-aware RSA, traffic grooming, and survivability.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:GFxP56DSvIMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Deterministic preemptive scheduling of real-time tasks",
            "Publication year": 2002,
            "Publication url": "http://rouskas.csc.ncsu.edu/Publications/Journals/Computer-Jackson-2002.pdf",
            "Abstract": "In a multiprocessor system, the limited resources consist of one or more processors, which can be either identical or distinct with respect to function and speed. The systems we focus on process realtime tasks, characterized by their computation time, ready time, and deadline. Task parameters are deterministic: A task first becomes available for processing at its ready time, and it must receive an amount of processing equal to its computation time within the next deadline units of time. Task preemptions are allowed, meaning that the system can interrupt the processing of one task to process another task.Scheduling problems are characterized by the types of processors and tasks in the system and by the scheduling constraints imposed on them. For a given task set, a number of processors greater than or equal to one, and a set of constraints, scheduling addresses two problems:",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Efficient QoS resource management for heterogeneous Grids",
            "Publication year": 2008,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.69.4749&rep=rep1&type=pdf",
            "Abstract": "QoS support is of crucial importance to the adoption of Grid technologies. Advance reservations is one mechanism that can be employed to provide QoS; however, its deployment is limited due to the lack of flexibility and scalability of existing implementations. Furthermore, the inherent heterogeneity of resources in Grid environments makes the task of providing QoS even more formidable. In this work we consider two aspects of advance reservations. First, we investigate the impact of heterogeneity on Grid resource management. Second, we employ techniques from computational geometry to develop an efficient heterogeneity-aware scheduling algorithm. Our main finding is that Grids may benefit from high levels of resource heterogeneity, independently of the total system capacity. Our results show that our algorithm performs well across several user and system performance metrics and overcomes the lack of scalability and adaptability of existing mechanisms.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:UCVoGz2p8ukC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scheduling problems with applications to packet-switched optical WDM networks",
            "Publication year": 2001,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4599/0000/Scheduling-problems-with-applications-to-packet-switched-optical-WDM-networks/10.1117/12.436056.short",
            "Abstract": "We consider a scheduling problem, which we call the Scheduling and Wavelength Assignment (SWA) problem, arising in optical networks that are based on the Wavelength Division Multiplexing (WDM) technology. We prove that the SWA problem is (Nu) (Rho) -hard for both the preemptive and the non- preemptive cases. Furthermore, we propose two efficient approximation algorithms. The first is for the preemptive case and it is based on a natural decomposition of the problem to the classical multiprocessor scheduling and open-shop problems. For the non-preemptive case, we prove that a naive implementation of list scheduling produces a schedule that can be m times far from the optimum, where m is the number of processors (equivalently, WDM channels). Finally, we give a more refined version of list scheduling and we prove it to be a 2-approximation algorithm for both the off-line and the on- line contexts.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Tiz5es2fbqcC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A dynamic recursive unified internet design (DRUID)",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S138912861000383X",
            "Abstract": "The Dynamic Recursive Unified Internet Design (DRUID) is a future Internet design that unifies overlay networks with conventional layered network architectures. DRUID is based on the fundamental concept of recursion, enabling a simple and direct network architecture that unifies the data, control, management, and security aspects of the current Internet, leading to a more trustworthy network. DRUID’s architecture is based on a single recursive block that can adapt to support a variety of communication functions, including parameterized mechanisms for hard/soft state, flow and congestion control, sequence control, fragmentation and reassembly, compression, encryption, and error recovery. This recursion is guided by the structure of a graph of translation tables that help compartmentalize the scope of various functions and identifier spaces, while relating these spaces for resource discovery, resolution, and routing …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:ipzZ9siozwsC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A framework for tiered service in MPLS networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4215767/",
            "Abstract": "Many network operators offer some type of tiered service, in which users may select only from a small set of service levels (tiers). Such a service has the potential to simplify a wide range of core network functions, allowing the providers to scale their operations efficiently. In this work, we provide a theoretical framework for reasoning about and tackling algorithmically the general problem of service tier selection. Drawing upon results from discrete location theory, we formulate the problem as a  p -median problem under a new directional distance measure, and we develop efficient algorithms for a number of important variants. Our main finding is that, by appropriately selecting the set of service levels, network providers may realize the benefits of tiered service with only a small sacrifice in network resources.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:RGFaLdJalmkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Dynamic Wavelength Sharing Policies for Absolute QoS in OBS Networks.",
            "Publication year": 2006,
            "Publication url": "https://scholar.archive.org/work/gpuw5ogxmza7tm3aj4eb4ucjvy/access/wayback/http://rouskas.csc.ncsu.edu/Publications/Conferences/GLOBECOM-Yang-2006.pdf",
            "Abstract": "We consider the problem of providing absolute QoS guarantees to multiple classes of users of an OBS network in terms of the end-to-end burst loss. We employ Markov decision process (MDP) theory to develop wavelength sharing policies that maximize throughput while meeting the QoS guarantees. The randomized threshold policies we obtain are simple to implement and operate, and make effective use of statistical multiplexing.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:738O_yMBCRsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dynamic lightpath networking via overlay control of static optical connections",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5377023/",
            "Abstract": "To bridge the gap between the current practice of setting up expensive, dedicated, lightpath connections (i.e., static topologies), and the distant future vision of inexpensive access to dynamically switched end-to-end lightpaths, we propose a medium term solution in the form of edge-reconfigurable optical networks (ERONs).",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:sSrBHYA8nusC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Scheduling Combined Unicast",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=vcnTBwAAQBAJ&oi=fnd&pg=PA137&dq=info:KSN9Hkv8pDMJ:scholar.google.com&ots=PbFsuwvVMZ&sig=DquQIETTGlf5PMVDUDmCfFgDjTU",
            "Abstract": "We study the performance of various strategies for scheduling a combined load of unicast and multicast traffic in a broadcast WDM network. The performance measure of interest is schedule length, which directly affects both aggregate network throughput and average packet delay. Three different scheduling strategies are presented, namely: separate scheduling of unicast and multicast traffic, treating multicast traffic as a number of unicast messages, and treating unicast traffic as multicasts of size one. The strategies are compared against each other using extensive simulation experiments in order to establish the regions of operation, in terms of a number of relevant system parameters, for which each strategy performs best. Our main conclusions are as follows. Multi-cast traffic can be treated as unicast traffic under very limited circumstances. On the other hand, treating unicast traffic as multicast traffic produces short schedules in most cases. Alternatively, scheduling and transmitting each traffic component separately is also a good choice.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:oYc2ogjtvagC",
            "Publisher": "Springer"
        },
        {
            "Title": "QoS measurement and evaluation of telecommunications quality of service [Book Review]",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/983906/",
            "Abstract": "QOS measurement and evaluation of telecommunications quality of service [Book Review] \nPage 1 BOOK REVIEWS/EDITED BY ANDRZEJ JAJSZCZYK QOS MEASUREMENT AND \nEVALUATION OF TELECOMMUNICATIONS QUALITY OF SER- VICE BY WILLIAM C. HARDY, \nJOHN WILEY & SONS, 2001, ISBN 0-471-49957-9, HARDCOVER, 230 PAGES REVIEWER: \nROBERT CHODOREK During the past few years, the importance of quality of service (QoS) has \ngrown considerably in the telecommunications industry. The book QoS Measure- ment and \nEvaluation of Telecommuni- cations Quality of Service by William C . Hardy, an expert from \nWorldcom, covers all the most important topics related to QoS. The book gives a comprehensive \nbackground of QoS in telecommunications, and theoretical principles are illustrated by some \npractical examples from more than 30 years of the author’s experience in QoS. , the of a …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic grooming in WDM ring networks to minimize the maximum electronic port cost",
            "Publication year": 2005,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1573427705000032",
            "Abstract": "We consider the problem of traffic grooming in WDM ring networks. Traffic grooming is a variant of the well-known logical topology design problem, and is concerned with the development of techniques for combining low speed traffic components onto high speed channels in order to minimize network cost. Previous studies have focused on aggregate representations of the network cost. In this work, we consider a Min–Max objective, in which it is desirable to minimize the cost at the node where this cost is maximum. Such an objective is of high practical value when dimensioning a network for unknown future traffic demands and/or for dynamic traffic scenarios. We present new theoretical results which demonstrate that traffic grooming with the Min–Max objective is NP-complete even when wavelength assignment is not an issue. We also present new polynomial-time traffic grooming algorithms for minimizing the …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Computing blocking probabilities in multiclass wavelength routing networks",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/364996.365001",
            "Abstract": "We present an approximate analytical method to evaluate efficiently and accurately the call blocking probabilities in wavelength routing networks with multiple classes of calls. The model is fairly general and allows each source-destination pair to service calls of different classes, with each call occupying one wavelength per link. Our approximate analytical approach involves two steps. The arrival process of calls on some routes is first modified slightly to obtain an approximate multiclass network model. Next, all classes of calls on a particular route are aggregated to give an equivalent single-class model. Thus, path decomposition algorithms for single-class wavelength routing networks may be readily extended to the multiclass case. This article is a first step towards  understanding the issues arising in wavelength routing networks that serve multiple classes of customers.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:dfsIfKJdRG4C",
            "Publisher": "ACM"
        },
        {
            "Title": "MPCP-ℓ: Look-ahead enhanced MPCP for EPON",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655158/",
            "Abstract": "We present a simple yet effective enhancement to the operation of the EPON multipoint control protocol (MPCP) that results in significant performance gains across the whole range of traffic loads. The enhancement, inspired by our earlier work in a related but different context, allows the OLT to perform look-ahead scheduling on the upstream channel. The look-ahead operation is fully compatible with the existing standard, and may be implemented via software updates to the OLT without affecting the operation of ONUs. In addition to improvements in delay and throughput performance, look-ahead enhanced MPCP also opens up new opportunities for the design of sophisticated DBA algorithms to support advanced quality of service (QoS) capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:tuHXwOkdijsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Tiered-Service Fair Queueing (TSFQ)",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_11",
            "Abstract": "As we explained in the previous chapter, the high algorithmic complexity of timestamp-based schedulers is due to two fundamental operations: (1) computation of the virtual time function to track the corresponding GPS system, and (2) packet sorting to select the packet with the smallest timestamp to serve next. The WF2Q+ scheduler we described in Section 10.2.1.4 implements both operations in time O(logn), where n is the number of flows served. Importantly, WF2Q+ closely emulates the ideal GPS fluid-flow scheduler, and thus it provides tight delay bounds to all flows and achieves a constant worst-case fair index. Although several timestampbased or hybrid scheduler variants have been developed with lower complexity, these schedulers provide looser delay and fairness guarantees than WF2Q+. As a result, the service received by individual flows under these simpler schedulers may be significantly different …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Optical network engineering",
            "Publication year": 2003,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/0471478342.ch10",
            "Abstract": "This chapter discusses the application of traffic engineering and planning methodologies to the design and operation of optical networks employing WDM technology. The routing and wavelength assignment (RWA) problem is first introduced as the fundamental control problem in WDM networks. The RWA problem is then studied in two different but complementary contexts. The static RWA arises in the network design phase where the objective is capacity planning and the sizing of network resources. The dynamic RWA is encountered during the real‐time network operation phase and involves the dynamic provisioning of optical connections. Both the static and dynamic variants of the problem are explored in depth with an emphasis on solution approaches and algorithms. The chapter concludes with a discussion of control plane issues and related standardization activities in support of traffic engineering functionality.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:jW3pDOCzWhQC",
            "Publisher": "John Wiley & Sons, Inc."
        },
        {
            "Title": "SDN enabled restoration with triggered precomputation in elastic optical inter-datacenter networks",
            "Publication year": 2018,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-10-1-24",
            "Abstract": "Flexi-grid elastic optical networks (EONs) provide a promising infrastructure for meeting the high-bandwidth and low-latency requirements of interconnecting datacenters. Since failures of high-capacity fiber links prevent users from accessing cloud services and lead to large amounts of data loss, much recent research has focused on inter-datacenter network failure recovery. In this paper, we build upon software-defined networking (SDN) technology and develop a fast restoration strategy with triggered precomputation (FR-TP) that achieves fast failure recovery with minimal resource overhead. Our work makes several contributions. We extend the controller functionality and OpenFlow protocol for software-defined elastic optical inter-datacenter network architectures, so as to obtain the global network state information quickly and accurately. We then present the FR-TP strategy and an associated trigger mechanism to …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:xpFxhiwfz1QC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Elsevier OSN is Sad to Announce the Loss of Fabio Neri, co-Editor-in-Chief of the Journal, Distinguished Professor and Researcher",
            "Publication year": 2011,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-7ab0953c-fd6b-32a6-9364-e7074774fdde",
            "Abstract": "Elsevier OSN is Sad to Announce the Loss of Fabio Neri, co-Editor-in-Chief of the Journal, \nDistinguished Professor and Researcher × Close The Infona portal uses cookies, ie strings of \ntext saved by a browser on the user's device. The portal can access those files and use them to \nremember the user's data, such as their chosen settings (screen view, interface language, \netc.), or their login data. By using the Infona portal the user accepts automatic saving and using \nthis information for portal operation purposes. More information on the subject can be found \nin the Privacy Policy and Terms of Service. By closing this window the user confirms that they \nhave read the information on cookie usage, and they accept the privacy policy and the way \ncookies are used by the portal. You can change the cookie settings in your browser. I accept \nPolski English Login or register account remember me Password recovery INFONA - portal …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Recursive algorithm for selecting optimum routing tables to solve offline routing and spectrum assignment problem",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2090447919301443",
            "Abstract": "The Routing and Spectrum Assignment (RSA) problem is NP-Hard so searching the entire problem space is not applicable. Many decomposition algorithms rely on reducing the search space in the routing space and applying heuristics algorithm in the spectrum assignment sub-problem. This is not necessarily a right solution as the ignored routing tables may lead to a better solution when they are used later as input to the Spectrum Assignment sub-problem. In this paper, we develop a new recursive decomposition approach for the RSA problem in optical networks. At the core of our approach is a new recursive branch and-bound procedure for carrying out an exhaustive search of the routing space in a scalable manner. This recursion effectively decouples the routing from the spectrum assignment part of the problem. Sequential generation of the full set of routing tables requires huge memory and very large …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Fd6TstiuZzAC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Offline Distance-Adaptive Routing and Spectrum Assignment in Mesh Elastic Optical Networks",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7842036/",
            "Abstract": "The routing and spectrum assignment (RSA) problem has emerged as the key design and control problem in elastic optical networks. Distance adaptive spectrum allocation exploits the tradeoff between spectrum width and reach to improve resource utilization by tailoring the modulation format to the level of impairments along the path. In this paper, we consider the distance-adaptive RSA (DA-RSA) problem with fixed alternate routing. We first show that the DA-RSA problem in networks of general topology is a special case of a well-studied multiprocessor scheduling problem. We then leverage insights from scheduling theory to (1) present new results regarding the complexity of the DA-RSA problem, and (2) build upon list scheduling concepts to develop a computationally efficient solution approach that is effective in utilizing the available spectrum resources.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:07QC26MHY14C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On optimal sizing of tiered network services",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4509840/",
            "Abstract": "We develop an economic model for networks offering tiered services and we formulate the problem of selecting the service tiers from three perspectives: one that considers the users' interests only, one that considers only the service provider's interests, and one that considers both simultaneously, i.e., the interests of society as a whole. We also present dynamic programming algorithms that solve these problems optimally. Our work provides a theoretical framework for reasoning about Internet tiered services, as well as a practical toolset for network providers to develop customized menus of service offerings.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A queueing network model of an edge optical burst switching node",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1209223/",
            "Abstract": "We consider an edge optical burst switching (OBS) node with or without converters, and with no buffering. The OBS node serves a number of users, each connected to the switch over a fiber link that supports multiple wavelengths. Each wavelength is associated with a 3-state Markovian burst arrival process. The arrival process permits short and long bursts to be modeled. We model the edge OBS node as a closed nonproduct-form queueing network, with multiple heterogeneous classes, and we develop a suite of approximate decomposition algorithms to analyze it. Our approximate algorithms have a good accuracy, and they provide insight into the effect of various system parameters on the performance of the edge OBS node.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:kNdYIx-mwKoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computing across curricula: The view of industry leaders",
            "Publication year": 2009,
            "Publication url": "https://peer.asee.org/computing-across-curricula-the-view-of-industry-leaders",
            "Abstract": "NOTE: The first page of text has been automatically extracted and included below in lieu of an abstract",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:SEmTV4UfSqwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the design of online scheduling algorithms for advance reservations and QoS in grids",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4227954/",
            "Abstract": "We consider the problem of providing QoS guarantees to Grid users through advance reservation of resources. Advance reservation mechanisms provide the ability to allocate resources to users based on agreed-upon QoS requirements and increase the predictability of a Grid system, yet incorporating such mechanisms into current Grid environments has proven to be a challenging task due to the resulting resource fragmentation. We use concepts from computational geometry to present a framework for tackling the resource fragmentation, and for formulating a suite of scheduling strategies. We also develop efficient implementations of the scheduling algorithms that scale to large Grids. We conduct a comprehensive performance evaluation study using simulation, and we present numerical results to demonstrate that our strategies perform well across several metrics that reflect both user-and system-specific goals …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Networking 2004: Networking Technologies, Services, and Protocols; Performance of Computer and Communications Networks; Mobile and Wireless Communications; Third International IFIP-TC6 Networking Conference, Athens, Greece, May 9-14, 2004; Proceedings",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=kz2A5E0tB_gC&oi=fnd&pg=PA1&dq=info:8Tawxg9BxYAJ:scholar.google.com&ots=ZEF_y2mNcF&sig=Cj2hdK8dQZjUgOwZFmaPstGfFQo",
            "Abstract": "This book contains the refereed proceedings of the 3rd International IFIP-TC6 Networking Conference, Networking 2004. Conferences in the Networking series span the interests of several distinct, but related, TC6 working groups, including Working Groups 6.2, 6.3, and 6.8. Re? ecting this, the conference was structured with three Special Tracks:(i) Networking Technologies, Services, and Protocols;(ii) Performance of Computer and Communication Networks; and (iii) Mobile and Wireless Communications. However, beyond providing a forum for the presentation of high-quality-search in various complementary aspects of networking, the conference was also targetedtocontributingtoauni? edviewofthe? eldandtofosteringtheinter-tion and exchange of fruitful ideas between the various related (and overlapping) specialized subcommunities therein. Towards this second objective, more than a few conference sessions (and thematic sections in this book)‘cut across’ the Special Tracks, along more generic or fundamental concepts. Networking 2004 was fortunate to attract very high interest among the c-munity, and the conference received 539 submissions from 44 countries in all? ve continents. These? gures correspond to a remarkable increase in subm-sions from the previous very successful events (roughly, a 156% increase over Networking 2000 and 71% over Networking 2002), and indicate that Netw-king conferences are progressively becoming established as worldwide reference events in the? eld.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:whNN5KpgZFsC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "Efficient implementation of best-fit scheduling for advance reservations and qos in grids",
            "Publication year": 2007,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.88.6261&rep=rep1&type=pdf",
            "Abstract": "We consider the problem of providing QoS guarantees to Grid users through advance reservation of network resources. Advance reservation mechanism provides the ability to allocate resources to users based on agreed-upon QoS requirements and increase the predictability of a Grid system. However, incorporating such mechanisms into current Grid environments has proven to be a challenging task due to the resulting resource fragmentation. In our previous work we introduced a suite of scheduling algorithms for Grids capable of handling resource fragmentation efficiently and providing with QoS guarantee to users. In this paper we extend that work by introducing an efficient implementation of best-fit scheduling algorithm. We evaluate the performance of best-fit by means of extensive simulation and analysis against the scheduling algorithms introduced previously. Our results show that best-fit performs well across several metrics that reflect both user and system specific goals.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:p2g8aNsByqUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The scheduling and wavelength assignment problem in optical WDM networks",
            "Publication year": 2002,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-20-5-754",
            "Abstract": "We consider a scheduling problem, which we call the scheduling and wavelength assignment (SWA) problem, arising in optical networks that are based on the wavelength-division-multiplexing (WDM) technology. We prove that the SWA problem is NP -complete for both the preemptive and the nonpreemptive cases. Furthermore, we propose two efficient approximation algorithms. The first is for the preemptive case and is based on a natural decomposition of the problem to the classical multiprocessor scheduling and open-shop problems. For the nonpreemptive case, we prove that a naive implementation of list scheduling produces a schedule that can be m times far from the optimum, where m is the number of processors (equivalently, WDM channels). Finally, we give a more refined version of list scheduling and we prove it to be a 2-approximation algorithm for both the off-line and the on-line contexts.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On The Design of MPS Networks",
            "Publication year": 2001,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.29.1930",
            "Abstract": "We consider the problem of designing an MPS network of optical cross-connects (OXCs) to interconnect a given number of label switched routers (LSRs). We present a set of heuristic algorithms to address the combined problem of physical topology design (ie, determine the number of OXCs required and the ber links among them) and logical topology design (ie, determine the routing and wavelength assignment for the lightpaths among the LSRs). Unlike previous studies which were limited to small topologies with a handful of nodes, our heuristic algorithms can be applied directly to networks with hundreds or thousands of LSRs and can accommodate a number of lightpaths that is an order of magnitude larger than the number of LSRs. We present numerical results for a wide range of system parameters such as the number of wavelengths per ber, the number of transceivers per LSR, and the number of ports per OXC, which provide new insight into the design of MPS networks. Keywords: Multiprotocol Lambda Switching (MPS), Wavelength-routed optical network, physical topology design, routing and wavelength assignment, integer programming model, genetic algorithm. Department of Computer Science North Carolina State University Raleigh, NC 27695-7534 This work was supported by the NSF under grant ANI-9805016. 1",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Q9ss7R9eeXsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Network service orchestration in heterogeneous 5G networks using an open marketplace",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/document/8183323/",
            "Abstract": "Network service orchestration across heterogeneous networks needs an open marketplace where the services advertised by the providers in different domains can be purchased for short-term or long-term time scales. The authors present two design paradigms and evaluate two corresponding prototypes which provide a framework for network services to be purchased. They compare the two prototypes from the point of view of how effective they are in addressing some of the challenges posed by heterogeneous 5G networks namely programmability, scalability and innovation. They present a network service orchestration algorithm which is advertised as a network service in the marketplace.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:oFKsPyNwwpYC",
            "Publisher": "IET"
        },
        {
            "Title": "ERONs: dynamic lightpath networking via overlay control of static optical connections",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5062480/",
            "Abstract": "To bridge the gap between the current practice of setting up expensive, dedicated, lightpath connections (i.e., static topologies), and the distant future vision of inexpensive access to dynamically switched end-to-end lightpaths we propose a medium term solution in the form of edge-reconfigurable optical networks (ERONs). An ERON is an overlay-control network created by installing readily available MEMS optical switches and implementing a GMPLS control plane at sites interconnected by static lightpaths. The switches and control software are deployed at the edge of the network and operated by the organization-user (i.e., outside the network provider's control), hence the term ldquoERON.ldquo By providing dynamic, automated control of end-to-end lightpaths, ERONs enable the sharing of expensive network resources among multiple users and applications that require sporadic access to these resources. We …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:5Ul4iDaHHb8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Jumpstart: A just-in-time signaling architecture for WDM burst-switched networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1027527/",
            "Abstract": "We present an overview of an architecture and a signaling protocol for a cored WDM network. The architecture is based on wavelength routing and burst switching. Burst switching, as opposed to circuit or packet switching, implies that the network is capable of switching data in variable-sized parcels. Signaling is \"just-in-time\" indicating that signaling messages travel slightly ahead of the data they are describing. Signaling is out of band, with signaling packets undergoing electro-optical conversion at every hop. Data, on the other hand, travels transparently.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:BjLbhSWBl98C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic grooming in WDM networks: Past and future",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1081765/",
            "Abstract": "Traffic grooming refers to techniques used to combine low-speed traffic streams onto high-speed wavelengths in order to minimize the networkwide cost in terms of line terminating equipment and/or electronic switching. Such techniques become increasingly important for emerging network technologies, including SONET/WDM rings and MPLS/MP/spl lambda/S backbones, for which traffic grooming is essential. In this article we formally define the traffic grooming problem, and we provide a general formulation that captures the features of a wide range of problem variants. We then present a comprehensive comparative survey of the literature that unveils the significant amount of research on this subject (the traffic grooming past). We also offer a broad set of ambitious research directions (the traffic grooming future) that are motivated by the exciting new challenges arising with the advent of MP/spl lambda/S technology.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Link selection algorithms for link-based ILPs and applications to RWA in mesh networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6524888/",
            "Abstract": "RWA is a fundamental problem in the design and control of optical networks. We propose link selection algorithms that reduce the size of the link-based ILP formulation for RWA by pruning redundant link decision variables. The resulting formulation scales well to mesh topologies representative of backbone and regional networks. In our experiments, the new formulation decreases the running time by more than two orders of magnitude without any impact on optimality. The link selection techniques are general in that they may be applied to any optimization problem for which the ILP formulation consists of multicommodity flow equations as its core constraints.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:bz8QjSJIRt4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Fast exact ILP decompositions for ring RWA",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-3-7-577",
            "Abstract": "Wavelength division multiplexing rings are now capable of supporting more than 100 wavelengths over a single fiber. Conventional link and path formulations for the routing and wavelength assignment problem are inefficient due to the inherent symmetry in wavelength assignment and the fact that the problem size increases fast with the number of wavelengths. Although a formulation based on maximal independent sets (MIS) does not have these drawbacks, it suffers from exponential growth in the number of variables with increasing network size. We develop a new ILP (integer linear program) formulation based on the key idea of partitioning the path set and representing the MIS in the original network using the independent sets calculated in each of these partitions. This exact decomposition trades off the number of variables with the number of constraints and, as a result, achieves a much better scalability in …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:tOudhMTPpwUC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A sequence of bounds for the problem of minimizing electronic routing in wavelength routed optical rings",
            "Publication year": 2000,
            "Publication url": "https://repository.lib.ncsu.edu/bitstream/handle/1840.4/794/TR-2000-11.pdf?sequence=1",
            "Abstract": "Я гвз ж и джг а б г з в в к жий а игдгаг н иг б в б о а ижгв жгйи в в л к а в и жгйи гди а ж в зК Ь йаа к жий а игдгаг н з в джг а б з ЦШЙ ж к в в и ж зиж и з л ж и д нз а игдгаг н з ж в И в к ж гйз йж зи з к в джгдгз в и а и ж ийж гж г и в в гг згайи гвзИ йзй аан гж Ћ ж ви а зз з г джг а б взи в зК Я дж з ви в л ж б лгж л в йз иг к ай и и д ж гжб в г йж зи зИ в л ж ей ж з з в Ќ виан а зз гбдйи и гв и в к ай и в и гди б а згайи гвК Ь з ж б лгж з з гв в ж а гжбйа и гв г и к жий а игдгаг н джг а бИ в и гвз зиз г з ей в г гйв зИ ги йдд ж в агл жИ в л зй зз к гйв з и а зи з зижгв з и дж к гйз гв К Ь зй зз к гйв з и а ж ж бгйвиз г гбдйи и гв иг к ай и И в и вйб ж г гйв з иг к ай и гж к в джг а б взи в з гван а б и н и гбдйи и гв а дгл ж к а а К Ь гйв з ж з гв гбдгз в и ж в виг з из г вг з жж в в д и И в гди в и аг аан гди б а игдгаг н л и в з иК Я а л гван гвз ж и г и к г б в б о в а ижгв жгйи в в и з д д жИ гйж дджг иг г и в в и з ей в г гйв з в дда иг б вн к жий а игдгаг н джг а бз гв ж в зК Ь йдд ж гйв з л г и в азг джгк йз йа з ж з г йж зи згайи гвзК",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:ZHo1McVdvXMC",
            "Publisher": "North Carolina State University. Dept. of Computer Science"
        },
        {
            "Title": "OPN05-5: Dynamic Wavelength Sharing Policies for Absolute QoS in OBS Networks",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4151016/",
            "Abstract": "We consider the problem of providing absolute QoS guarantees to multiple classes of users of an OBS network in terms of the end-to-end burst loss. We employ Markov decision process (MDP) theory to develop wavelength sharing policies that maximize throughput while meeting the QoS guarantees. The randomized threshold policies we obtain are simple to implement and operate, and make effective use of statistical multiplexing.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:P7PM_jyRRcwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An intra-and inter-domain routing architecture for optical burst switched (OBS) networks",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1589726/",
            "Abstract": "We describe an intra- and inter-domain routing architecture for just-in-time (JIT) optical burst switched (OBS) networks. The architecture addresses the problem of routing optical signals of varying types across an all-optical burst-switched backbone network while maintaining the optical signal quality required by each application. The architecture distinguishes between routing for bursts and ancillary signaling messages (\"data plane routing\"), and routing for other management and control messages (\"control plane routing\")",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:g5m5HwL7SMYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "ChoiceNet: toward an economy plane for the Internet",
            "Publication year": 2014,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2656877.2656886",
            "Abstract": "The Internet has been a key enabling technology for many new distributed applications and services. However, the deployment of new protocols and services in the Internet infrastructure itself has been sluggish, especially where economic incentives for network providers are unclear. In our work, we seek to develop an \"economy plane\" for the Internet that enables network providers to offer new network-based services (QoS, storage, etc.) for sale to customers. The explicit connection between economic relationships and network services across various time scales enables users to select among service alternatives. The resulting competition among network service providers will lead to overall better technological solutions and more competitive prices. In this paper, we present the architectural aspects of our ChoiceNet economy plane as well as some of the technological problems that need to be addressed in a …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:_OXeSy2IsFwC",
            "Publisher": "ACM"
        },
        {
            "Title": "Network virtualization: Technologies, perspectives, and frontiers",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6272301/",
            "Abstract": "Network virtualization refers to a broad set of technologies. Commercial solutions have been offered by the industry for years, while more recently the academic community has emphasized virtualization as an enabler for network architecture research, deployment, and experimentation. We review the entire spectrum of relevant approaches with the goal of identifying the underlying commonalities. We offer a unifying definition of the term “network virtualization” and examine existing approaches to bring out this unifying perspective. We also discuss a set of challenges and research directions that we expect to come to the forefront as network virtualization technologies proliferate.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:epqYDVWIO7EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum assignment in rings with shortest-path routing: Complexity and approximation algorithms",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7069420/",
            "Abstract": "We study the spectrum assignment (SA) problem in ring networks with shortest path (or, more generally, fixed) routing. With fixed routing, each traffic demand follows a predetermined path to its destination. In earlier work, we have shown that the SA problem can be viewed as a multiprocessor problem. Based on this insight, we prove that, under the shortest path assumption, the SA problem can be solved in polynomial time in small rings, and we develop constant-ratio approximation algorithms for large rings. For rings of size up to 16 nodes (the maximum size of a SONET/SDH ring), the approximation ratios of our algorithms are strictly smaller than the best known ratio to date.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:HNqp4bORoCIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Clustering methods for hierarchical traffic grooming in large-scale mesh WDM networks",
            "Publication year": 2010,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JOCN-2-8-502",
            "Abstract": "We consider a hierarchical approach for traffic grooming in large multiwavelength networks of a general topology. Inspired by similar concepts in the airline industry, we decompose the network into clusters, and select a hub node in each cluster to groom traffic originating and terminating locally. At the second level of the hierarchy, the hub nodes form a virtual cluster for the purpose of grooming intra-cluster traffic. Clustering and hierarchical grooming enables us to cope with large network sizes and facilitates the control and management of traffic and network resources. Yet, determining the size and composition of clusters so as to yield good grooming solutions is a challenging task. We identify the grooming-specific factors affecting the selection of clusters, and we develop a parameterized clustering algorithm that can achieve a desired trade-off among various goals. We also obtain lower bounds on two important …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:35N4QoGY0k4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Scheduling-inspired spectrum assignment algorithms for mesh elastic optical networks",
            "Publication year": 2016,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=oRouDwAAQBAJ&oi=fnd&pg=PA225&dq=info:bMWCb4JRUJ4J:scholar.google.com&ots=kmkhGkdAkC&sig=ruRe-W4RMg_d3WiRezgm2bDvghs",
            "Abstract": "Spectrum assignment has emerged as the key design and control problem in elastic optical networks. We have shown that spectrum assignment in networks of general topology is a special case of scheduling multiprocessor tasks on dedicated processors. Based on this insight, we develop and evaluate efficient and effective algorithms for mesh and chain networks that build upon list scheduling concepts.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:gubd_9ZgCi8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Scalable Solution to Network Design Problems: Decomposition with Exhaustive Routing Search",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9322439/",
            "Abstract": "Many network design problems encompass two tasks, routing and resource allocation, that are so intricately intertwined as to contribute significantly to the intractability of such problems. In this paper, we make two contributions to addressing general network design problems of this nature. First, we present a new decomposition method that optimally decouples resource allocation from routing, making it possible to tackle each of these aspects separately. Second, we develop a recursive branch-and-bound algorithm to search the routing space exhaustively, yet in a scalable manner. We apply our method to a well-known intractable problem in optical networks, routing and spectrum assignment (RSA). Our results indicate that the recursive algorithm is able to search efficiently the entire routing space of topologies representative of large-scale wide area networks.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:FnaCo-ypupUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Virtual network reconfiguration with load balancing and migration cost considerations",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8485903/",
            "Abstract": "Efficient allocation of resources is an essential yet challenging problem in a virtual network environment, especially in an online setting whereby virtual network requests may arrive, depart, or be modified in real time. Virtual network reconfiguration may help to improve network performance by remapping a subset of virtual nodes or links to better align the allocation of resources to current network conditions. In this paper, we develop a virtual network reconfiguration scheme that aims to balance the load on the substrate network by dynamically reconfiguring the embedding of both virtual nodes and links. Our solution consists of decomposing the problem into two subproblems: i) virtual node selection, for which we present a linear programming-based fully polynomial time approximation scheme to select the virtual nodes to be migrated, and ii) virtual node remapping, for which we make use of random walk on a …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:BO8BTsX0K1AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TDM emulation in packet-switched networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4288989/",
            "Abstract": "Many network operators offer some type of tiered service, in which users may select only from a small set of service levels (tiers). In this work, we study the problem of designing a tiered-service network that allocates bandwidth in multiples of a basic bandwidth unit. Such a packet-switched network can enjoy many of the benefits, in terms of control and management, of a TDM network, but without the associated data plane rigidities.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "TOPICS IN INTERNET TECHNOLOGY-TECHNIQUES FOR OPTICAL PACKET SWITCHING AND OPTICAL BURST SWITCHING-Several different technologies have been developed so far for the transfer of data over WDM. In",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=5809307178341710914&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:eMMeJKvmdy0C",
            "Publisher": "[New York, Communications Society of Institute of Electrical and Electronics Engineers]"
        },
        {
            "Title": "On bandwidth tiered service",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5208212/",
            "Abstract": "Many network operators offer some type of tiered service, in which users may select only from a small set of service levels (tiers). Such a service has the potential to simplify a wide range of core network functions, allowing the providers to scale their operations efficiently. In this work, we study a number of problem variants related to service tier selection. Our contributions include: (1) a faster algorithm for obtaining optimal service tiers; (2) a new formulation and optimal algorithm to optimize jointly the number and magnitude of each service tier; and (3) the concept of ¿TDM emulation¿ in which all service tiers are multiples of the same (software-configurable) bandwidth unit, and a suite of algorithms to select jointly the basic unit and service tiers. Our work provides a systematic framework for reasoning about and tackling algorithmically the general problem of service tier selection, and has applications to a number of …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:8AbLer7MMksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "The directional p-median problem: Definition, complexity, and algorithms",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0377221706000907",
            "Abstract": "An instance of a p-median problem gives n demand points. The objective is to locate p supply points in order to minimize the total distance of the demand points to their nearest supply point. p-Median is polynomially solvable in one dimension but NP-hard in two or more dimensions, when either the Euclidean or the rectilinear distance measure is used. In this paper, we treat the p-median problem under a new distance measure, the directional rectilinear distance, which requires the assigned supply point for a given demand point to lie above and to the right of it. In a previous work, we showed that the directional p-median problem is polynomially solvable in one dimension; we give here an improved solution through reformulating the problem as a special case of the constrained shortest path problem. We have previously proven that the problem is NP-complete in two or more dimensions; we present here an efficient …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:isC4tDSrTZIC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Are bigger optical buffers necessarily better?",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4544595/",
            "Abstract": "Conventional wisdom suggests that bigger switch buffers translate to lower packet loss. However, we have observed in simulations (using ns2) that buffer sizes in the range of interest for optical packet switched networks show unexpected behaviour: larger buffers can cause higher losses for open-loop (real-time) traffic when it multiplexes with closed-loop (TCP) traffic. In this short paper we develop a simplified Markov Chain model that helps explain this anomalous behaviour. The phenomenon observed in this paper can be of serious concern to all-optical packet switch designers and network service providers, who make huge investment in setting up the network infrastructure, but only to realise potentially degraded performance if appropriate care is not taken when dimensioning their router buffer sizes.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:f2IySw72cVMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bandwidth Tiered Service: TDM Emulation",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_4",
            "Abstract": "Many existing networks operate over an infrastructure that is based on time division multiplexing (TDM); examples include the legacy telephone network, the synchronous optical network/synchronous digital hierarchy (SONET/SDH) transport architecture, and time division multiple access wireless communications networks such as those employing the global system for mobile communications (GSM) standard. Whereas networks based on TDM technology today offer a multitude of data services in addition to classical voice service, it is often convenient for providers to allocate bandwidth to users in multiples of a unit rate that is typically tied to the slot size of the underlying transmission system. Legacy telephone networks and SONET/SDH networks, in particular, impose a rigid hierarchy of rates that are multiples of a voice channel (i.e., 64 Kbps), hence there is a proliferation of data services with rates ranging from DS …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:2VqYfGB8ITEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Computing call-blocking probabilities in LEO satellite networks: The single-orbit case",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/994809/",
            "Abstract": "We study the problem of carrying voice calls over a low-Earth-orbit satellite network and present an analytical model for computing call-blocking probabilities for a single orbit of a satellite constellation. We have devised a method to solve the corresponding Markov process efficiently for orbits of up to five satellites. For orbits consisting of a larger number of satellites, we have developed an approximate decomposition algorithm to compute the call-blocking probabilities by decomposing the system into smaller subsystems and iteratively solving each subsystem in isolation using the exact Markov process. Our approach can capture blocking due to handoffs for both satellite-fixed and Earth-fixed constellations. Numerical results demonstrate that our method is accurate for a wide range of traffic patterns and for orbits with a number of satellites that is representative of commercial satellite systems.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:r0BpntZqJG4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A novel fast restoration mechanism for optical burst switched networks",
            "Publication year": 2004,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.70.7566&rep=rep1&type=pdf",
            "Abstract": "Survivability is a critical network design issue for optical networks since even a single failure for a short duration may result in huge data loss due to the large capacity of optical fibers. However, few studies have been done on this issue for optical burst switching (OBS) networks. In this paper, we extend our early work on the fast restoration technique for OBS networks and present a novel fast restoration mechanism based on distributed deflection routing. Compared to other survivability schemes, the proposed mechanism has the advantage of fast and low-overhead fault management process and demonstrates excellent burst blocking performance by balancing the deflected traffic load during the restoration process.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:D03iK_w7-QYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "On service composition algorithm for Open Marketplaces of network services",
            "Publication year": 2017,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7980657/",
            "Abstract": "Network service composition provided as a service in an Open Marketplace enables users to obtain customized end-to-end composed service(s) using the services advertised by the providers in the marketplace. By providing a semantic language for advertising services and offering choice for the composed service(s) we provide a level playing field for the providers and alternatives for the users to choose from based on their requirement. This is similar to the services offered in the cloud, but without the provider monopoly or the limitation of having to select from limited options.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:z2g7kDSNNyoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A simulation study of optical burst switching and access protocols for WDM ring networks",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128602003717",
            "Abstract": "We consider a wavelength division multiplexing metro ring architecture with optical burst switching. The ring consists of N nodes, and each node owns a home wavelength on which it transmits its bursts. The ring operates under the fixed transmitter tunable receiver scheme. Control information is transmitted on a separate control channel. Five different burst switching access protocols are proposed, and their performance and fairness is evaluated by simulation.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "AC 2009-676: COMPUTING ACROSS CURRICULA: THE VIEW OF INDUSTRY LEADERS",
            "Publication year": 2009,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.156.8008&rep=rep1&type=pdf",
            "Abstract": "With the aim of preparing students for pervasive, advanced computing in the workplace, a project funded by the National Science Foundation CISE Pathways to Revitalized Undergraduate Computing Education (CPATH) was initiated in 2007. The multidisciplinary project has two overarching goals:(1) create a computational thinking thread in the engineering curriculum that spans from the freshman to senior years and bridges the divide between freshman year computing and computing in upper-level classes, and (2) enable students to take computing competency to the next level, where they are able to perform high-level computing tasks within the context of a discipline.The first phase of the project entailed the establishment of an academe-industry community in which stakeholders from a broad range of engineering disciplines convened to discuss the challenges and opportunities inherent in transforming the undergraduate computing education and to identify creative strategies for implementation. To effectively facilitate group communication within the “Computing Across Curricula”(CAC) community, the Delphi method was employed for the systematic knowledge collection and the achievement of consensus among industry leaders. Three critical phases are described in this process:(1) organize an industry panel to identify potential Delphi participants and to generate questions for an open-ended Delphi survey,(2) design, implement, and analyze an open-ended Delphi survey, and (3) design, implement, and analyze a quantifiable Delphi survey. A model of computational capabilities was also derived from the industry panel and is being used …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:zCpYd49hD24C",
            "Publisher": "Unknown"
        },
        {
            "Title": "JumpStart: A just-in-time signaling architecture for WDM burst-switched networks",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/983912/",
            "Abstract": "We present an architecture for a core dWDM network which utilizes the concept of optical burst switching coupled with a just-in-time signaling scheme. It is a reservation-based architecture whose distinguishing characteristics are its relative simplicity, its amenability to hardware implementation, and the ability to support multicast natively. Another important feature is data transparency-the network infrastructure is independent of the format of the data being transmitted on individual wavelengths. We present the signaling protocol designed for this architecture, as well as an unified signaling message structure to be used in conjunction with the protocol. We also present the future directions of this research.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:2osOgNQ5qMEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wavelength Routed Networks: Architectures, Protocols, and Experiments",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/article/10.1023/A:1017484106556",
            "Abstract": "OPTICAL NETWORKS MAGAZINE: ISSN 1388-6916 is published bimonthly by SPIE—The International Society for Optical Engineering, PO Box 10, Bellingham WA 98227-0010 USA and Kluwer Academic Publishers, 101 Philip Drive, Norwell, MA 02061 USA. Articles and reviews published herein reflect the opinion of the author (s); inclusion of articles and advertisements does not necessarily constitute endorsement or sanction by the editors or by SPIE/Kluwer Academic Publishers.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:dTyEYWd-f8wC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A Detailed Analysis and Performance Comparison of Wavelength Reservation Schemes for Optical Burst Switched Networks†",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s11107-004-6435-0.pdf",
            "Abstract": "We present a detailed analysis of the JIT, JET, and Horizon wavelength reservation schemes for optical burst switched (OBS) networks. Our analysis accounts for several important parameters, including the burst offset length, and the optical switching and hardware processing overheads associated with bursts as they travel across the network. The contributions of our work include: (i) analytical models of JET and Horizon (on a single OBS node) that are more accurate than previously published ones, and which are valid for general burst length and offset length distributions; (ii) the determination of the regions of parameter values in which a more complex reservation scheme reduces to a simpler one; and (iii) a new reservation scheme, JIT+, which is as simple to implement as JIT, but whose performance tracks that of Horizon and JET. We compare the performance of the four wavelength reservation …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Topology design in WDM rings to minimize electronic routing: Efficient computation of tight bounds",
            "Publication year": 2000,
            "Publication url": "http://csc.ncsu.edu/faculty/rouskas/Publications/Conferences/ALLERTON-Dutta-2000.pdf",
            "Abstract": "We consider the problem of designing a virtual topology to minimize electronic routing, that is, grooming traffic, in wavelength routed optical rings. The full virtual topology design problem is NP-hard even in the restricted case where the physical topology is a ring, and heuristics have been proposed in the literature. We present a new framework of bounds which can be used to evaluate the performance of heuristics, and which requires significantly less computation than evaluating the optimal solution. This framework consists of a sequence of bounds, both upper and lower, in which each successive bound is at least as strong as the previous one. The number of bounds to be evaluated for a given problem instance is only limited by the computational power available. The bounds are based on decomposing the ring into sets of nodes arranged in a path, and adopting the locally optimal topology within each set. While we only consider the objective of minimizing electronic routing in this paper, our approach to obtaining the sequence of bounds can be applied to many virtual topology problems on rings. The upper bounds we obtain also provide a useful series of heuristic solutions.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:u9iWguZQMMsC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Spectrum assignment in optical networks: A multiprocessor scheduling perspective",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-6-8-754",
            "Abstract": "The routing and spectrum assignment problem has emerged as the key design and control problem in elastic optical networks. In this work, we show that the spectrum assignment (SA) problem in mesh networks transforms to the problem of scheduling multiprocessor tasks on dedicated processors. Based on this new perspective, we show that the SA problem in chain (linear) networks is NP-hard for four or more links, but is solvable in polynomial time for three links. We also develop new constant-ratio approximation algorithms for the SA problem in chains when the number of links is fixed. Finally, we present several list scheduling algorithms that are computationally efficient and simple to implement, yet produce solutions that, on average, are within 1%–5% of the lower bound.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:xggF7591RyAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "A spectral clustering approach to network-aware virtual request partitioning",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128618301609",
            "Abstract": "Virtual request partitioning is an essential subproblem of two common problems in virtual networks, namely, virtual network embedding (VNE) and virtual machine placement (VMP). In this study, we consider a network-aware variant of the problem where the objective is to partition a virtual request so as to minimize the total amount of inter-cluster traffic. This problem is equivalent to the (k, v)-balanced partitioning problem, an NP-complete problem. To handle the inherent complexity of this problem, we develop a spectral clustering-based partitioning scheme that produces good solutions in a reasonable amount of time. Our solution consists of several components: (a) spectral clustering, (b) a Constrained k-means partitioning algorithm that ensures that capacity limits for clusters are met, and for which we present a polynomial-time greedy algorithm, and (c) a greedy refinement algorithm using simulated annealing to …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:NWFKKQzSIN4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An objective study on improvement of task scheduling mechanism using computational intelligence in cloud computing",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7435660/",
            "Abstract": "Cloud Computing facilitates delivery of various types of computational services through the internet. These services can be availed according to the user demand. The resource scarcity problems within the Service Providers are met using Virtualization technique, which allows scalability of resources and thereby helps to meet the client requirements. Allocation of resources to client tasks is an issue that is being addressed for a long time. Due to the increased complexity in the area, there has not yet been a perfect scheduling mechanism. Practices have been done profusely in order to find solutions for scheduling that nears optimality. A single scheduling mechanism may not always give the expected outcome. The task scheduling mechanisms are designed in a manner as to optimize some metrics related to the Cloud. This paper overviews various literature associated with task scheduling and resource scheduling in …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:RF4BjkDOTHkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An efficient algorithm for solving traffic grooming problems in optical networks",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6655176/",
            "Abstract": "We consider the virtual topology and traffic routing (VTTR) problem, a subproblem of traffic grooming that arises as a fundamental network design problem in optical networks. The objective of VTTR is to determine the minimum number of light-paths so as to satisfy a set of traffic demands, and does not take into account physical layer constraints; a routing and wavelength assignment (RWA) algorithm must reconcile the virtual topology obtained by VTTR with the physical topology. We propose an efficient algorithms that uses a partial LP relaxation technique with lazy constraints to improve substantially the scalability of VTTR, and, hence, of traffic grooming. Our approach delivers a desirable tradeoff between running time and quality of solution.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:b1wdh0AR-JQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Anomalous loss performance for mixed real-time and TCP traffic in routers with very small buffers",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5648399/",
            "Abstract": "In the past few years there has been vigorous debate regarding the size of buffers required at core Internet routers. Recent arguments supported by theory and experimentation show that under certain conditions, core router buffer sizes of a few tens of packets suffice for realizing acceptable end-to-end TCP throughputs. This is a significant step toward the realization of optical packet switched (OPS) networks, which are inherently limited in their ability to buffer optical signals. However, prior studies have largely ignored the presence of real-time traffic, which is increasing in importance as a source of revenue for Internet service providers. In this paper, we study the interaction that happens between real-time (open-loop) and TCP (closed-loop) traffic when they multiplex at buffers of very small size (few tens of packets) and make a significant discovery - namely that in a specific range of buffer size, real-time traffic losses …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Service Chain Rerouting for NFV Load Balancing",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9322265/",
            "Abstract": "Network function virtualization (NFV), with its potential to facilitate network service provisioning, has drawn growing interest from both academia and industry. One essential challenge is to allocate efficiently the bandwidth and computational resources to the service requests. In an online context, service chain requests may arrive, depart or evolve in an arbitrary fashion, adding more difficulty to the problem. Service chain reconfiguration may help improve the performance by individually rerouting a subset of the service chain requests. In this paper, we propose a new service chain reconfiguration framework to achieve load balancing in an NFV environment under varying levels of support from the underlying infrastructure. We show that our framework can achieve an approximation ratio of O(lnm/ln lnm) with high probability for the service chain request rerouting problem.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:oQQVFBP0nzwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A practical fair queuing scheduler: Simplification through quantization",
            "Publication year": 2011,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128611001320",
            "Abstract": "The design of fair packet schedulers involves a tradeoff between implementation complexity, on one hand, and delay and fairness guarantees, on the other. In this paper, we present tiered-service fair queuing (TSFQ), a new scheduler that exploits certain properties of Internet traffic to speed up the bottleneck operations related to virtual time computation and packet sorting. Specifically, TSFQ makes innovative use of quantization (along the two dimensions of flow weights and packet lengths) her with specialized yet simple queuing structures. TSFQ combines all three properties that are important to a fair queuing algorithm, namely, a tight delay bound, worst-case fairness, and low complexity and amenability to hardware implementation. Hence, we believe that, for network operators, deploying TSFQ scheduling has the potential to enhance their ability to offer and guarantee a wide range of services.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:LPZeul_q3PIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Selected papers from Optical Network Design and Modeling (ONDM) 2005 conference",
            "Publication year": 2005,
            "Publication url": "https://re.public.polimi.it/handle/11311/693715",
            "Abstract": "La presente simulazione è stata realizzata sulla base delle regole riportate nel DM 598/2018 e allegata Tabella A. Cineca non si assume alcuna responsabilità in merito all’uso che il diretto interessato o terzi faranno della simulazione. Si specifica inoltre che la simulazione contiene calcoli effettuati con dati e algoritmi di pubblico dominio e deve quindi essere considerata come un mero ausilio al calcolo svolgibile manualmente o con strumenti equivalenti. Informazioni sui dati: vengono considerati tutti i prodotti in stato definitivo. Per i prodotti indicizzati wos/scopus, l’anno di riferimento e la tipologia sono quelli riportati in banca-dati.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:KbBQZpvPDL4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Distance-adaptive routing and spectrum assignment in rings",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/document/7490468/",
            "Abstract": "Distance adaptive spectrum allocation exploits the tradeoff between spectrum width and reach to improve resource utilisation by tailoring the modulation format to the level of impairments along the path. The authors first show that the distance-adaptive routing and spectrum assignment (DA-RSA) problem is a special case of a multiprocessor scheduling problem. The authors then develop a suite of efficient and effective DA-RSA algorithms for ring networks, that build upon list scheduling concepts. This work explores the tradeoffs involved in DA-RSA algorithm design, and opens up new research directions that may leverage the vast literature in scheduling theory.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:MDBbo4b0KHEC",
            "Publisher": "IET"
        },
        {
            "Title": "MTCP: Scalable TCP-like congestion control for reliable multicast",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128601002687",
            "Abstract": "We present MTCP, a congestion control scheme for large-scale reliable multicast. Congestion control for reliable multicast is important, because of its wide applications in multimedia and collaborative computing, yet non-trivial, because of the potentially large number of receivers involved. Many schemes have been proposed to handle the recovery of lost packets in a scalable manner, but there is little work on the design and implementation of congestion control schemes for reliable multicast. We propose new techniques that can effectively handle instances of congestion occurring simultaneously at various parts of a multicast tree.Our protocol incorporates several novel features: (1) hierarchical congestion status reports that distribute the load of processing feedback from all receivers across the multicast group, (2) the relative time delay concept which overcomes the difficulty of estimating round-trip times in tree …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:qjMakFHDy7sC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Choice as a principle in network architecture",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2342356.2342382",
            "Abstract": "There has been a great interest in defining a new network architecture that can meet the needs of a future Internet. One of the main challenges in this context is how to realize the many different technical solutions that have developed in recent years in a single coherent architecture. In addition, it is necessary to consider how to ensure economic viability of architecture solutions. In this work, we discuss how to design a network architecture where choices at different layers of the protocol stack are explicitly exposed to users. This approach ensures that innovative technical solutions can be used and rewarded, which is essential to encourage wide deployment of this architecture.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:AvfA0Oy_GE0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A unified software architecture to enable cross-layer design in the future internet",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4317792/",
            "Abstract": "While research on cross-layer network optimization has been progressing, useful implementations have been lagging because the current Internet architecture does not accommodate cross-layering gracefully. As part of our FIND project, we propose a software architecture for the future Internet that is designed to accommodate such interactions. We present a conceptual overview as well as high level software design and an early prototype implementation, and point out the strengths of our architecture.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical grooming in multigranular networks",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4620209/",
            "Abstract": "We present a hierarchical algorithm for grooming lightpaths into wavebands, and routing wavebands over a network of multigranular switching nodes. Our approach is conceptually simple, scalable, and consistent with the way networks are operated and controlled in practice.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:OU6Ihb5iCvQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Light-tree routing under optical power budget constraints",
            "Publication year": 2004,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JON-3-5-282",
            "Abstract": "Feature Issue on Next-Generation WDM Network Design and Routing (WDMN)  It has been widely recognized that physical-layer impairments, including power losses, must be taken into account when optical connections are routed in transparent networks. We study the problem of constructing light-trees under optical-layer power budget constraints, with a focus on algorithms that can guarantee a certain level of quality for the signals received by the destination nodes. We define a new constrained light-tree routing problem by introducing a set of constraints on the source-destination paths to account for the power losses at the optical layer. We investigate a number of variants of this problem, we characterize their complexity, and we develop a suite of corresponding routing algorithms; one of the algorithms is appropriate for networks with sparse light splitting and/or limited splitting fanout. We find that, to guarantee an …Feature Issue on Next-Generation WDM Network Design and Routing (WDMN)",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Economic Model for Bandwidth Tiered Service",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_7",
            "Abstract": "In Part I of the book, we considered several variants of the problem of determining optimal structures for tiered services. These problem formulations refiect cost considerations on the part of the network provider only: indeed, the various objective functions represent measures of the additional cost incurred by operating a tieredservice network compared to a continuous-rate one, and the goal is to minimize this cost. In Part II, on the other hand, we use concepts from economic theory to formulate the service tier selection problem in a manner that takes into account the realities of the marketplace, and in particular, the interests of users, in addition to the cost incurred by the provider for offering the service. Our work provides a theoretical framework for reasoning about and pricing Internet tiered services, as well as a practical toolset for network providers to develop customized menus of service offerings. Our results also …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:8d8msizDQcsC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Internet Tiered Services: Theory, Economics, and Quality of Service",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=k0nLv3O7TIAC&oi=fnd&pg=PA1&dq=info:f6zExRAug3MJ:scholar.google.com&ots=5C865cp5i-&sig=eYzs6q3WLnUQlISrZTpp-LmrGk8",
            "Abstract": "As telecommunications products and services have become an essential part of-eryday life, consumers have at the same time grown intimately familiar with the concept of tiered pricing that is associated with such services. With tiered service structures, users may select from a small set of tiers that offer progressively higher levels of service with a correspondingincrease in price. Tiered structures have been applied in several forms to wireless services (eg, characterized by the amount of voice minutes, number of text messages, or the size of one’s circle of friends to whom voice calls are free), Internet broadband access (eg, the access speed or volume of monthly transferred data), and digital TV offerings (eg, the number of channels included), among others. Service tiering is a form of market segmentation which, if applied appropriately, bene ts both providers and consumers by making available services and associated price points that re ect the diversity in consumers’ needs and ability to pay. The purpose of this book is to develop a theoretical framework for reasoning about and pricing Internet tiered services, as well as a practical algorithmic toolset fornetworkproviderstodevelopcustomizedmenusofserviceofferings. We provide a comprehensive study of the design, sizing, and pricing of tiered structures for-ternet services, and we illustrate their potential in simplifying the operation of c-plex components such as packet schedulers.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "A path decomposition approach for computing blocking probabilities in wavelength-routing networks",
            "Publication year": 2000,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/893871/",
            "Abstract": "We study a class of circuit-switched wavelength-routing networks with fixed or alternate routing and with random wavelength allocation. We present an iterative path decomposition algorithm to evaluate accurately and efficiently the blocking performance of such networks with and without wavelength converters. Our iterative algorithm analyzes the original network by decomposing it into single-path subsystems. These subsystems are analyzed in isolation, and the individual results are appropriately combined to obtain a solution for the overall network. To analyze individual subsystems, we first construct an exact Markov process that captures the behavior of a path in terms of wavelength use. We also obtain an approximate Markov process which has a closed-form solution that can be computed efficiently for short paths. We then develop an iterative algorithm to analyze approximately arbitrarily long paths. The path …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Computing across curricula",
            "Publication year": 2008,
            "Publication url": "https://peer.asee.org/computing-across-curricula",
            "Abstract": "NOTE: The first page of text has been automatically extracted and included below in lieu of an abstract",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Uo5fLKClJkAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "The Directional p-Median Problem: Definition and Applications",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_2",
            "Abstract": "In this chapter we first review the classical p-median problem that arises in a wide range of facility location and clustering applications. We then introduce a new variant of the problem, the .directional. p-median problem defined under a new notion of distance, the directional rectilinear distance metric. We discuss the complexity of the p-median and directional p-median problems, and we describe several applications of the latter problem. The directional p-median problem provides the theoretical foundations for studying the network tiered service that is the subject of this book.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Z98IfIjqAwMC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "JumpStart just-in-time signaling protocol: A formal description using extended finite state machines",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/journals/optical-engineering/volume-42/issue-2/0000/Jumpstart-just-in-time-signaling-protocol--a-formal-description/10.1117/1.1533795.short",
            "Abstract": "We present a formal protocol description for a just-in-time (JIT) signaling scheme running over a core dense wavelength division multiplexing (DWDM) network that utilizes optical burst switches (OBSs). We apply an eight-tuple extended finite state machine (EFSM) model to formally specify the protocol. Using the EFSM model, we define the communication between a source client node and a destination client node through an ingress and one or multiple intermediate switches. We work on on-the-fly and persistent unicast connections. The communication between the EFSMs is handled through messages.© 2003 Society of Photo-",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:KlAtU1dfN6UC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Demonstration of QoS-aware video streaming over a metro-scale optical network using a cross-layer architectural design",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5875204/",
            "Abstract": "QoS-aware video streaming is demonstrated on an optical network using a service-oriented architecture and a NetFPGA-based optical control plane. Dynamic optical power fluctuations are either compensated or the lightpath is rerouted to ensure the QoS.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:K3LRdlH-MEoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On optimal traffic grooming in WDM rings",
            "Publication year": 2002,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/974666/",
            "Abstract": "We consider the problem of designing a virtual topology to minimize electronic routing, that is, grooming traffic, in wavelength routed optical rings. The full virtual topology design problem is NP-hard even in the restricted case where the physical topology is a ring, and various heuristics have been proposed in the literature for obtaining good solutions, usually for different classes of problem instances. We present a new framework which can be used to evaluate the performance of heuristics and which requires significantly less computation than evaluating the optimal solution. This framework is based on a general formulation of the virtual topology problem, and it consists of a sequence of bounds, both upper and lower, in which each successive bound is at least as strong as the previous one. The successive bounds take larger amounts of computation to evaluate, and the number of bounds to be evaluated for a given …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Techniques for optical packet switching and optical burst switching",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/894388/",
            "Abstract": "Wavelength-division multiplexing appears to be the solution of choice for providing a faster networking infrastructure that can meet the explosive growth of the Internet. Several different technologies have been developed so far for the transfer of data over WDM. We survey two new technologies which are still in the experimental stage-optical packet switching and optical burst switching-and comment on their suitability for transporting IP traffic.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:u5HHmVD_uO8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Selected papers from the BROADNETS 2004 Optical Networking Symposium",
            "Publication year": 2005,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-0b6358b6-ac5d-33e5-a0e0-0370c72e1864",
            "Abstract": "Selected papers from the BROADNETS 2004 Optical Networking Symposium × Close The \nInfona portal uses cookies, ie strings of text saved by a browser on the user's device. The \nportal can access those files and use them to remember the user's data, such as their \nchosen settings (screen view, interface language, etc.), or their login data. By using the \nInfona portal the user accepts automatic saving and using this information for portal \noperation purposes. More information on the subject can be found in the Privacy Policy and \nTerms of Service. By closing this window the user confirms that they have read the \ninformation on cookie usage, and they accept the privacy policy and the way cookies are \nused by the portal. You can change the cookie settings in your browser. I accept Polski \nEnglish Login or register account remember me Password recovery INFONA - science \ncommunication portal INFONA Search advanced × -…",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:fFSKOagxvKUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Wavelength selection in OBS networks using traffic engineering and priority-based concepts",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1490652/",
            "Abstract": "A fundamental assumption underlying most studies of optical burst switched (OBS) networks is that full wavelength conversion is available throughout the network. In practice, however, economic and technical considerations are likely to dictate a more limited and sparse deployment of wavelength converters in the optical network. Therefore, we expect wavelength assignment policies to be an important component of OBS networks. In this paper, we explain why wavelength selection schemes developed for wavelength routed (circuit-switched) networks are not appropriate for OBS. We then develop a suite of adaptive and nonadaptive policies for OBS switches. We also apply traffic engineering techniques to reduce wavelength contention through traffic isolation. Our performance study indicates that, in the absence of full conversion capabilities, intelligent choices in assigning wavelengths to bursts at the source can …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:YsMSGLbcyi4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Spectrum management techniques for elastic optical networks",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=7220869071408622823&hl=en&oi=scholarr",
            "Abstract": "In recent years, OFDM has been the focus of extensive research efforts in optical transmission and networking, initially as a means to overcome physical impairments in optical communications. However, unlike, say, in wireless LANs or xDSL systems where OFDM is deployed as a transmission technology in a single link, in optical networks it is being considered as the technology underlying the novel elastic network paradigm.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:dZbaGXT4iR0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Congestion Minimization for Service Chain Routing Problems With Path Length Considerations",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9178487/",
            "Abstract": "Network function virtualization (NFV), with its perceived potential to accelerate service deployment and to introduce flexibility in service provisioning, has drawn a growing interest from industry and academia alike over the past few years. One of the key challenges in realizing NFV is the service chain routing problem, whereby traffic must be routed so as to traverse the various components of a network service that have been mapped onto the underlying network. In this work, we consider the online service chain routing problem. We route the service chain with the goal of jointly minimizing the maximum network congestion and the number of hops from the source to the destination. To this end, we present a simple yet effective online algorithm in which the routing decision is irrevocably made without prior knowledge of future requests. We prove that our algorithm is O(log m)-competitive in terms of congestion …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:twffdjNOitAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multipoint control protocol with look-ahead for wavelength division multiplexed ethernet passive optical network",
            "Publication year": 2014,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=jocn-6-2-104",
            "Abstract": "We present a simple yet effective enhancement to the operation of the Ethernet passive optical network (EPON) multipoint control protocol (MPCP) for wavelength division multiplexing (WDM) EPON. The enhancement, inspired by our earlier work in a related but different context, allows the optical line terminal (OLT) to perform look-ahead scheduling on each of the upstream channels. The look-ahead operation is fully compatible with the existing standard and may be implemented via software updates to the OLT without affecting the operation of optical network units in EPON. The look-ahead enhanced MPCP achieves significant performance gains across a wide range of traffic loads and opens up new opportunities for the design of sophisticated dynamic bandwidth algorithms to support advanced quality of service capabilities.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:I__7AI8a974C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "An economic model for pricing tiered network services",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/article/10.1007/s12243-009-0149-3",
            "Abstract": "We consider networks offering tiered services and corresponding price structures, a model that has become prevalent in practice. We develop an economic model for such networks and make contributions in two important areas. First, we formulate the problem of selecting the service tiers from three perspectives: one that considers the users’ interests only, one that considers only the service provider’s interests, and one that considers both simultaneously, i.e., the interests of society as a whole. We also present an approximate yet accurate and efficient solution approach for tackling these nonlinear programming problems. Given the set of (near-) optimal service tiers, we then employ game-theoretic techniques to find an optimal price for each service tier that strikes a balance between the conflicting objectives of users and service provider. This work provides a theoretical framework for reasoning about and …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:KxtntwgDAa4C",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "On time dependent routing algorithms for open marketplaces of path services with support for in-advance path reservation",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128618301610",
            "Abstract": "Open marketplaces of path services are the next step towards realizing “routing-as-a-service.” Such marketplaces will enable users to select from a set of path services offered by multiple competing network providers so as to construct customized end-to-end paths for their applications. This is analogous to online travel marketplaces that allow users to explore travel options and book their travel. We review the requirements for path planners to assist users in stitching together available path services which are time sensitive. We define the problem of finding multi-criteria time-constrained paths in this context, and present algorithms to construct these paths and also provide support for in-advance path reservation.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:VDARjI3xf8gC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Conversations (oral history interviews) with members of North Carolina State University Computer Science Department by Carol Lee and Carolyn Miller",
            "Publication year": 2017,
            "Publication url": "https://conservancy.umn.edu/handle/11299/211361",
            "Abstract": "This is a compilation of 16 individual interviews gathered between November 2016 and February 2017 and published in August 2017 to mark the 50th Anniversary of the Department of Computer Science at N.C. State University. Interviewees ranged from undergraduate students to the Department Head. The interviewees included three students, eleven faculty, and two staff members. Their interviewees provide a broad view of the department in the decade ending in 2017. Two standard questions were asked of each interviewee: what computing devices do you use and what is computer science today? The answers reflect the personal computing technology in use at the time, as well as the definition of Computer Science from various points of view and experience. The ubiquity of computers in every facet of contemporary life is a recurring response. The primary themes are: the abundance of opportunity within computer science education and the importance of seizing it; the multi-disciplinary nature of the department, which includes the presence of the Center for the Education and Informatics; the benefit of being located in the Research Triangle Park with all its opportunities for collaboration and future employment; the cutting-edge program for undergraduate research; and the innovative capstone class combining writing and presentation skills with computer science knowledge. There is emphasis on the Professional Teaching Faculty, which includes computer science faculty members who are dedicated exclusively to teaching, with no research or grant-writing responsibilities.  Also featured is the Interdisciplinary Faculty Cluster program in which …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:WzbvD7BMtBoC",
            "Publisher": "Department of Computer Science, North Carolina State University"
        },
        {
            "Title": "Transporting IP packets over light: a survey",
            "Publication year": 2000,
            "Publication url": "https://repository.lib.ncsu.edu/bitstream/handle/1840.4/801/TR-2000-03.pdf?sequence=1",
            "Abstract": "Optical networks appear to be the solution of choice for providing a faster networking infrastructure that can meet the explosive growth of the Internet. One of the key issues that needs to be addressed is how optical networks can be used to carry IP traffic. In this paper, we survey some of the techniques that have been proposed in the literature for transporting IP traffic over an optical network. Specifically, we survey techniques for IP over SONET, optical packet switch architectures, and optical burst switching.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:XiSMed-E-HIC",
            "Publisher": "North Carolina State University. Dept. of Computer Science"
        },
        {
            "Title": "Network-aware virtual request partitioning based on spectral clustering",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7568548/",
            "Abstract": "Virtual request partitioning is an essential subproblem of two common problems in virtual networks, namely, virtual network embedding (VNE) and virtual machine placement (VMP). In this study, we consider a network-aware variant of the problem where the objective is to partition a virtual request so as to minimize the total amount of inter-cluster traffic. This problem is equivalent to the (k,v)-balanced partitioning problem, an NP-complete problem. To handle the inherent complexity of this problem, we develop a spectral clustering-based partitioning scheme that produces good solutions in a reasonable amount of time. Our solution consists of several components: (a) spectral clustering, (b) a constrained k-means partitioning algorithm that ensures that capacity limits for clusters are met, and for which we present a polynomial-time greedy algorithm, and (c) a greedy refinement algorithm using simulated annealing to …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:dhZ1Wuf5EGsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Offline distance-adaptive routing and spectrum assignment (DA-RSA) in rings",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7417037/",
            "Abstract": "Distance adaptive spectrum allocation exploits the tradeoff between spectrum width and reach to improve resource utilization by tailoring the modulation format to the level of impairments along the path. We first show that the distance-adaptive routing and spectrum assignment (DA-RSA) problem in mesh networks is a special case of a multiprocessor scheduling problem. We then develop a suite of efficient and effective DA-RSA algorithms that build upon list scheduling concepts. Our work explores the tradeoffs involved in DA-RSA algorithm design, and opens up new research directions that may leverage the vast literature in scheduling theory.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:hEp1lTclR2YC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic grooming for optical networks: foundations, techniques and frontiers",
            "Publication year": 2008,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=yMVa4Qv2AA4C&oi=fnd&pg=PR7&dq=info:DB225Mmu8OcJ:scholar.google.com&ots=9L1uxZRIwV&sig=iOSfrNC03vAz4ffDAOoDlnrXhRY",
            "Abstract": "The objective of this book is to provide timely and comprehensive coverage of the principles, technology, practice, and future of tra? c grooming in op-cal networks. Tra? c grooming considerations are already shaping new switch designs and standards, including next generation Synchronous Optical N-work/Synchronous Digital Hierarchy (SONET/SDH) and Generic Framing Procedure (GFP), are a? ecting future optical network technologies, and are creating new business opportunities. Yet information on the topic is sc-tered and there is a shortage of technical sources where relevant material can be accessed in a single location. The motivation for this book was to bridge this gap by providing a single authoritative point of reference to the tra? c grooming state of the art. Tra? c grooming is a complex subject, involving a number of interrelated concepts, standards, and technologies. It is also a rapidly growing? eld of study, makingitdi? cultforasinglebooktocoverallaspectsindetail. Tocope with this scope and complexity, this book provides appropriate background information, followed by an in-depth study of a few key issues and challenges. It has been our intention to bring together a broad range of perspectives from preeminent researchers in both academia and industry. We believe that these multiple, diverse points of view add considerable value and make the contents more interesting to the reader.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer Science & Business Media"
        },
        {
            "Title": "10 Optical Network Engineering",
            "Publication year": 2004,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=I-RtJ0k0EcUC&oi=fnd&pg=PA299&dq=info:tjWzGKmTpyQJ:scholar.google.com&ots=jdmCUhR56Q&sig=JPi2D5n8uCFocbLfH87A_UHyn5c",
            "Abstract": "Over the last few years we have witnessed a wide deployment of point-to-point wavelength-division multiplexing (WDM) transmission technology in the Internet infrastructure. The corresponding massive increase in network bandwidth due to WDM has heightened the need for faster switching at the core of the network. At the same time, there has been a growing effort to enhance the Internet protocol (IP) to support traffic engineering [1, 2] as well as different levels of quality of service (QoS)[3]. Label switching routers (LSRs) running multiprotocol label switching (MPLS)[4, 5] are being deployed to address the issues of faster switching, QoS support, and traffic engineering. On the one hand, label switching simplifies the forwarding function, thereby making it possible to operate at higher data rates. On the other hand, MPLS enables the Internet architecture, built on the connectionless Internet protocol, to behave in a connection-oriented fashion that is more conducive to supporting QoS and traffic engineering. The rapid advancement and evolution of optical technologies makes it possible to move beyond point-to-point WDM transmission systems to an all-optical backbone network that can take full advantage of the bandwidth available by eliminating the need for per-hop packet forwarding. Such a network consists of a number of optical cross-connects (OXCs) arranged in some arbitrary topology, and its main function is to provide interconnection to a number of IP/MPLS subnetworks. Each OXC can switch the optical signal coming in on a wavelength of an input fiber link to the same wavelength in an output fiber link. The OXC may also be equipped with …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:1sJd4Hv_s6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A fast path-based ILP formulation for offline RWA in mesh optical networks",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6503572/",
            "Abstract": "RWA is a fundamental problem in the design and control of optical networks. We introduce the concept of symmetric RWA solutions and present a new ILP formulation to construct optimally such solutions. The formulation scales to mesh topologies representative of backbone and regional networks. Numerical results demonstrate that the new formulation achieves a decrease of up to two orders of magnitude in running time compared to existing formulations. In particular, optimal solutions for topologies up to 20 nodes can be obtained within minutes using commodity CPUs, and larger networks can be solved in reasonable time. Our approach significantly lowers the barrier to entry in fully exploring the solution space of optical network design and in investigating the sensitivity of design decisions to forecast demands via extensive “what-if” analysis. Such analysis cannot be carried out currently without large …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:J-pR_7NvFogC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the suitability of composable services for the assurable future internet",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4455045/",
            "Abstract": "Our SILO architecture for the future Internet consists of composable fine-grain protocol elements called \"services\", and explicitly enables cross-layer interaction and optimization. While information assurance was not the only goal of SILO, we recognize that a critical need for the global network is a degree of assurability. In this paper, we present our view of the consequences of the SILO architecture with respect to information assurance services that could be easier enabled by SILO than the current architecture.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Formal description of the JumpStart just-in-time signaling protocol using EFSM",
            "Publication year": 2002,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/4874/0000/Formal-description-of-the-jumpstart-just-in-time-signaling-protocol/10.1117/12.475294.short",
            "Abstract": "We present a formal protocol description for a Just-In-Time (JIT) signaling scheme running over a core dWDM network which utilizes Optical Burst Switches (OBS). We apply an eight-tuple extended finite state machine (EFSM) model to formally specify the protocol. Using the EFSM model, we define the communication between a source client node and a destination client node through an ingress and one or multiple intermediate switches. We worked on single burst connections that means setting up the connection just before sending a single burst and then closing the connection as soon as the burst is sent. The communication between the EFSMs is handled through message transfer between protocol entities.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:blknAaTinKkC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "A composition algorithm for the SILO cross-layer optimization service architecture",
            "Publication year": 2007,
            "Publication url": "http://csc.ncsu.edu/faculty/rouskas/Publications/Conferences/ANTS-Vellala-2007.pdf",
            "Abstract": "We have previously proposed a software architec-ture for the future Internet called SILO that is specifically targeted to accommodate cross-layering gracefully. In such an architecture, composing the services that make up the software layers for specific data flow requirements emerges as an essential part of the architectural system. We provide a minimal set of precedence constraints to express service interactions, and an algorithm that obtains correct compositions under this set. The algorithm appears to have a super-polynomial worst case running time, and we conjecture that the problem is NP-complete. We show that under some further simplifications of the set of constraints, the problem is polynomial.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:ns9cj8rnVeAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A comparison of allocation policies in wavelength routing networks",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/article/10.1023/A:1010056408572",
            "Abstract": "We consider wavelength routing networks with and without wavelength converters, and several wavelength allocation policies. Through numerical and simulation results we obtain upper and lower bounds on the blocking probabilities for two wavelength allocation policies that are most likely to be used in practice, namely, most-used and first-fit allocation. These bounds are the blocking probabilities obtained by the random wavelength allocation policy with either no converters or with converters at all nodes of the network. Furthermore, we demonstrate that using the most-used or first-fit policies gives an improvement on call blocking probabilities that is equivalent to employing converters at a number of nodes in a network with the random allocation policy. These results have been obtained for a wide range of loads for both single-path and general mesh topology networks. The main conclusion of our work is …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:0EnyYjriUFMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Bandwidth Tiered Service: Stochastic Demands",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_5",
            "Abstract": "In Chapters 3 and 4 we considered the general problem of optimizing the bandwidth tier structure for tiered-service networks. The objective was to minimize the bandwidth penalty incurred by the provider relative to a continuous-rate network. An underlying assumption in these studies was that the size of the user population is fixed and does not change, and, furthermore, that the user demands are specified and known in advance. Consequently, the corresponding DPM1 problem and its variants include the fixed set X of demand points and their number n as part of the formulation.In practice, within the problem domain we are considering, the user population is likely to undergo continuous changes, e.g., as users move in or out of the service area where a given provider operates. Customers are also likely to adjust their service over time. For instance, in a capacity-based tiering structure whereby the level of …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:zG6RlwjYRPQC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Internet service tiering as a market segmentation strategy",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5425887/",
            "Abstract": "We consider Internet broadband access as an elastic service whose value varies across segments of the user population. We show that introducing multiple tiers of service can be an effective market segmentation strategy that can lead to an increase of profits for the ISP. We also develop an efficient dynamic programming algorithm for the problem of determining optimally both the service tiers and their prices. Our approach provides new insights into the selection and pricing of Internet tiered services, and our results indicate that exponential tiering structures adopted by ISPs are far from optimal.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:vRqMK49ujn8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Grooming mechanisms in SONET/SDH and next-generation SONET/SDH",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-0-387-74518-3_4.pdf",
            "Abstract": "Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) are very closely related standards, which came into being primarily as a means of transporting telephone traffic in large volumes utilizing optical fiber transmission systems. SONET was brought forth by Bellcore (Telcordia), with coordination from International Telecommunication Union (ITU) as well as other standards organizations, and is primarily in use in North America, whereas SDH was developed by ITU, came into use slightly later than SONET, and is in use in the rest of the world. The two standards so closely resemble each other in most significant concepts as well as details that they are often spoken of as a single entity, and denoted as SONET/SDH. In what follows in the rest of this chapter as well as elsewhere in the book, the distinctions between the two are not important, and we continue to mean “SONET/SDH”, even when …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "On optimal traffic grooming in elemental network topologies",
            "Publication year": 2003,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/5285/0000/On-optimal-traffic-grooming-in-elemental-network-topologies/10.1117/12.533162.short",
            "Abstract": "We consider the problem of traffic grooming in WDM path, star, and tree networks. Traffic grooming is a variant of the well-known logical topology design problem, and is concerned with the development of techniques for combining low speed traffic components onto high speed channels in order to minimize network cost. Our contribution is two-fold. In the first part of the paper we settle the complexity of traffic grooming in path and star networks by proving that a number of variants of the problem are computationally hard. Since routing and wavelength assignment in these two topologies is trivial, these results demonstrate that traffic grooming is itself an inherently difficult problem. Our results have implications for ring and other more general topologies, which we explore. In the second part, we design practical grooming algorithms with provable properties. Specifically, for all three topologies, we obtain a series of lower …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Z5m8FVwuT1cC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "Performance evaluation of multi-core, multi-threaded SIP proxy servers (SPS)",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7511427/",
            "Abstract": "Process schedulers are part of the core functionality of an operating system (OS), and have been enhanced over the years to account for multiple cores in the processors and to support multi-threaded applications. In this study, we investigate the impact of the Linux scheduler's load-balancing algorithm on the performance of multi-threaded OpenSIPS (an open source SIP proxy server, SPS) running on a multi-core processor system. Linux uses the “completely fair scheduler” (CFS) scheduling policy and provides parameters specifically tunable in a multi-core environment. We conducted extensive experiments and analyzed the collected data to characterize the performance of SPS as a function of the number of CPU cores, the number of server threads and the call arrival rate. Based on our analysis, we show how to configure the various scheduler parameters as a function of the number of CPU cores to achieve a …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:w2Aknop99M4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid FRR/p-cycle MPLS link protection design",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6133597/",
            "Abstract": "Survivable MPLS technologies are crucial in ensuring reliable communication services. The fast reroute (FRR) mechanism has been standardized to achieve fast local repair of label switched paths (LSPs). We present a hybrid survivability scheme for MPLS networks that combines the well-known p-cycle method with FRR technology. While with pure FRR backup paths are planned individually for each link, the hybrid scheme selects backup paths embedded within a set of p-cycles that may be selected by taking a holistic view of network performance. The hybrid FRR/p-cycle method is fully RFC 4090-compliant, yet allows network operators to leverage a large existing body of p-cycle design techniques.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "RWA in WDM rings: An efficient formulation based on maximal independent set decomposition",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5507142/",
            "Abstract": "WDM rings are now capable of supporting more than 100 wavelengths over a single fiber. Conventional link and path formulations for the RWA problem are inefficient due to the inherent symmetry in wavelength assignment and the fact that the problem size increases fast with the number of wavelengths. Although a formulation based on maximal independent sets (MIS) does not have these drawbacks, it suffers from the exponential growth in the number of variables with the increasing network size. We develop a new ILP formulation based on the idea of partitioning the path set and representing the maximal independent sets in the original network using the independent sets calculated in each of these partitions. This formulation trades off the number of variables with the number of constraints and, as a result, achieves a much better scalability in terms of network dimension. The proposed approach is compared with …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:08ZZubdj9fEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Mtcp: scalable tcp-like congestion control",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=4233693146271171595&hl=en&oi=scholarr",
            "Abstract": "We present MTCP, a congestion control scheme for large-scale reliable multicast. Congestion control for reliable multicast is important, because of its wide applications in multimedia and collaborative computing, yet nontrivial, because of the potentially large number of receivers involved. Many schemes have been proposed to handle the recovery of lost packets in a scalable manner, but there is little work on the design and implementation of congestion control schemes for reliable multicast. We propose techniques that can effectively handle instances of both shortterm and persistent congestion occurring simultaneously at various parts of a multicast tree. Our protocol incorporates several novel features:(1) hierarchical congestion status reports that distribute the load of processing feedback from all receivers across the multicast group,(2) the relative time delay (RTD) concept which overcomes the difficulty of …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:SFOYbPikdlgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Routing and wavelength assignment in optical WDM networks",
            "Publication year": 2001,
            "Publication url": "http://rouskas.csc.ncsu.edu/Publications/Books/Wiley-Rouskas-2001.pdf",
            "Abstract": "This article discusses the routing and wavelength assignment (RWA) problem in optical networks employing wavelenength division multiplexing (WDM) technology. Two variants of the problem are studied: static RWA, whereby the traffic requirements are known in advance, and dynamic RWA in which connection requests arrive in some random fashion. Both point-topoint and multicast traffic demands are considered.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:M3ejUd6NZC8C",
            "Publisher": "Wiley"
        },
        {
            "Title": "Routing and Wavelength (Spectrum) Assignment",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-16250-4_12",
            "Abstract": "Routing a connection from its source to its destination is a fundamental component of network design. The choice of route affects numerous properties of a connection, most notably cost, latency, and availability, as well as the resulting level of congestion in the network. This chapter addresses various algorithms, strategies, and tradeoffs related to routing.At the physical optical layer, connections are assigned a unique wavelength on a particular optical fiber, a process known as wavelength assignment (). Together with routing, the combination of these two processes is commonly referred to as . In networks based on all-optical technology, WA can be challenging. It becomes more so when the physical properties of the optical signal need to be considered. This chapter covers several WA algorithms and strategies that have produced efficient designs in practical networks.A recent development …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:M3zsPnPgUlUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "A tutorial on optical networks",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-36162-6_7",
            "Abstract": "In this half-day tutorial, we present the current state-of-the-art in optical networks. We begin by discussing the various optical devices used in optical networks. Then, we present wavelength-routed networks, which is currently the dominant architecture for optical networks. We discuss wavelength allocation policies, calculation of call blocking probabilities, and network optimization techniques. Subsequently, we focus on the various protocols that have been proposed for wavelength-routed networks. Specifically, we present a framework for IP over optical networks, MPLS, LDP, CR-LDP, and GMPLS. Next, we discuss optical packet switching and optical burst switching, two new emerging and highly promising technologies.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Hierarchical traffic grooming: A tutorial",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128614001820",
            "Abstract": "Traffic grooming is concerned with the design, operation, and control of networks with multigranular bandwidth demands. As the number of resources in a multigranular network increases rapidly with the network size, wavelength capacity, and load, a scalable framework for managing these entities becomes essential. Hierarchical traffic grooming facilitates the control and management of multigranular WDM networks. In this paper, we present a survey of traffic grooming schemes for optical networks that make use of architectures, algorithms and design techniques that impose a hierarchical structure on the network topology.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:tUtwDVdCwjgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Converging choice and service in future commodity optical networks using traffic grooming",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6602954/",
            "Abstract": "The problem of providing an agile, energy-aware, flexible optical network architecture is one of the challenges in optical networking in the coming decade. A key element in this challenge is the balancing of the benefits to customer and provider, and creating an agile system capable of reflecting both provider and customer interests on an ongoing basis as network conditions change. In this paper, we articulate how the traditional optical networking research area of traffic grooming may be combined with recent advances in Internet architecture, specifically a proposed Future Internet architecture called ChoiceNet, and empowered by the recently emerged concept of software defined networking, to make some key contributions to this problem.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:OP4eGU-M3BUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Traffic engineering approach to path selection in optical burst switching networks",
            "Publication year": 2005,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JON-4-11-759",
            "Abstract": "It is usually assumed that optical burst switching (OBS) networks use the shortest path routing along with next-hop burst forwarding. The shortest path routing minimizes delay and optimizes utilization of resources, however, it often causes certain links to become congested while others remain underutilized. In a bufferless OBS network in which burst drop probability is the primary metric of interest, the existence of a few highly congested links could lead to unacceptable performance for the entire network. We take a traffic engineering approach to path selection in OBS networks with the objective of balancing the traffic across the network links to reduce congestion and to improve overall performance. We present an approximate integer linear optimization problem as well as a simple integer relaxation heuristic to solve the problem efficiently for large networks. Numerical results demonstrate that our approach is …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:4DMP91E08xMC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "On the impact of scheduler settings on the performance of multi-threaded SIP servers",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7249307/",
            "Abstract": "Multi-threading is a widely used program execution model, where each thread executes independently while sharing some of the process resources. Multi-threaded processes are used for a range of network application servers including web servers, mail servers and SIP proxy servers (SPS) for Voice over IP (VoIP). The process scheduler is a core part of any Operating System and the policy it uses may have a significant impact on the various applications executing on the system. In this work, we investigate the impact of the Linux scheduler on the performance of OpenSIPS, an open source SIP proxy server. The version of Linux used in our study uses a scheduling policy known as “Completely Fair Scheduler” (CFS), and the Linux kernel provides several parameters that may be used to tune the CFS policy. We have collected a large set of experimental data, in a methodical fashion, to characterize the performance …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:6TexfgwXQfYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hybrid offset‐time and burst assembly algorithm (H‐OTBA) for delay sensitive applications over optical burst switching networks",
            "Publication year": 2016,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/dac.2821",
            "Abstract": "Optical burst switching (OBS) is the most favourable switching paradigm for future all‐optical networks. Burst assembly is the first process in OBS and it consists of aggregating clients packets into bursts. Assembled bursts wait for an offset time before being transmitted to their intended destinations. Offset time is used to allow burst control packet reserve required resources prior to burst arrival. Burst assembly process and offset‐time create extra delay in OBS networks. To make OBS suitable for real time applications, this extra latency needs to be controlled. This paper proposes and evaluates a novel offset time and burst assembly scheme to address this issue. Constant bit rate (CBR) traffic that has stringent end‐to‐end delay QoS requirements is used in this study. The proposed scheme is called hybrid offset‐time and burst assembly algorithm (H‐OTBA). The objective of the paper is achieved by controlling …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:GjXqcohcbckC",
            "Publisher": "John Wiley & Sons, Ltd"
        },
        {
            "Title": "Multicast routing under optical layer constraints",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1354691/",
            "Abstract": "It has been widely recognized that physical layer impairments, including power losses, must be taken into account when routing optical connections in transparent networks. In this paper we study the problem of constructing light-trees under optical layer power budget constraints, with a focus on algorithms which can guarantee a certain level of quality for the signals received by the destination nodes. We define a new constrained light-tree routing problem by introducing a set of constraints on the source-destination paths to account for the power losses at the optical layer. We investigate a number of variants of this problem, we characterize their complexity, and we develop a suite of corresponding routing algorithms; one of the algorithms is appropriate for networks with sparse light splitting and/or limited splitting fanout. We find that, in order to guarantee an adequate signal quality and to scale to large destination …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:ufrVoPGSRksC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the Suitability of Composable Services for the DoD Assured Global Network",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=12455679178551453182&hl=en&oi=scholarr",
            "Abstract": "The authors of this position paper include a multi-organization collaborative research team that has been working on a clean-slate approach to future Internet design called “SILO”, funded by a grant from the NSF Future Internet Design program, and security researchers collaborating to articulate the information assurance related strengths and weaknesses of this architecture. A subset of us have previously collaborated on a DTO (previously ARDA) supported project involving the formulation, development and field testing of a clean slate approach to optical networking. We have also previously led a variety of information assurance research efforts sponsored by DARPA and DTO involving federated systems, intrusion detection, intrusion tolerance, high speed network encryptors, DoS and intruder traceback through watermarking, focusing on a broad spectrum of information assurance goals ranging from detection …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:fQNAKQ3IYiAC",
            "Publisher": "RTI International"
        },
        {
            "Title": "On hierarchical traffic grooming in WDM networks",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4469906/",
            "Abstract": "The traffic grooming problem is of high practical importance in emerging wide-area wavelength division multiplexing (WDM) optical networks, yet it is intractable for any but trivial network topologies. In this work, we present an effective and efficient hierarchical traffic grooming framework for WDM networks of general topology, with the objective of minimizing the total number of electronic ports. At the first level of hierarchy, we decompose the network into clusters and designate one node in each cluster as the hub for grooming traffic. At the second level, the hubs form another cluster for grooming intercluster traffic. We view each (first- or second-level) cluster as a  virtual star , and we present an efficient near-optimal algorithm for determining the logical topology of lightpaths to carry the traffic within each cluster. Routing and wavelength assignment is then performed directly on the underlying physical topology. We …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:mVmsd5A6BfQC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Packet Scheduling",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_10",
            "Abstract": "In packet-switched networks, packets from various users (flows) have to share the network resources, including buffer space at the routers and link bandwidth. Whenever resources are shared, contention arises among users seeking service. Consequently, shared resources employ a scheduling discipline to resolve contention by determining the order in which users receive service. In particular, the scheduling algorithm is a central component of the quality of service (QoS) architecture of packet switched networks. In this chapter, we discuss the requirements for link scheduling disciplines, we review and classify a number of packet schedulers, and we describe their properties and the trade-offs involved. This discussion sets the stage for the introduction in the next chapter of a new, scalable packet scheduler that is based on the concept of tiered service.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:KtrhGiDecpEC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Maximizing multicast throughput in WDM networks with tuning latencies using the virtual receiver concept",
            "Publication year": 2000,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ett.4460110109",
            "Abstract": "We consider the problem of supporting multipoint communication at the MAC layer of broadcast WDM networks. We first introduce the midticcut rhroughprrt as the performance measure of interest and we show that it depends on two measures that have previously been considered in isolation, namely, the efficient use of channel bandwidth and wavelength throughput. We then present a new technique for the transmission of multicast packets based on the concept of a Lzirninl receiver, a set of physical receivers which behave identically in terms of tuning. We also demonstrate that the number of virtual receivers naturally captures the performance of the system in terms of multicast throughput. Consequently, we focus on the problem of optimally selecting the virtual receivers to maximize multicast throughput, and we prove that it is Ji'P‐complete. Finally, we present four heuristics of varying degree of complexity for …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Clustering for Hierarchical Traffic Grooming in Large Scale Mesh WDM",
            "Publication year": 2004,
            "Publication url": "http://130.203.136.60/viewdoc/summary?doi=10.1.1.1067.43",
            "Abstract": "We present a clustering algorithm for hierarchical traffic grooming in large WDM networks. In hierarchical grooming, the network is decomposed into clusters, and one hub node in each cluster is responsible for grooming traffic from and to the cluster. Hierarchical grooming scales to large network sizes and facilitates the control and management of traffic and network resources. Yet determining the size and composition of clusters so as to yield good grooming solutions is a challenging task. We identify the grooming-specific factors affecting the selection of clusters, and we develop a parameterized clustering algorithm that can achieve a desired tradeoff among various goals.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:C4Vd9JCM9EcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Scalable traffic grooming in optical networks",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ACPC-2012-AS3D.2",
            "Abstract": "We develop a new solution approach for the traffic grooming problem by decomposing it into a virtual topology and traffic routing (VTTR) subproblem, and the RWA subproblem. We solve the VTTR subproblem with a new partial LP relaxation technique.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:uWiczbcajpAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Performance Evaluation of Brute Force Techniques for Routing and Spectrum Assignment in Elastic Optical Network using MPI and CUDA",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8947844/",
            "Abstract": "In Elastic Optical Networks, Routing and Spectrum Assignment algorithms find a routing table and assign spectrum slots for each traffic demand such that the consumed spectrum on each optical link is minimized. This work deploys brute force algorithm to investigate all possible routing tables and select best candidates. Those candidates are then evaluated using the Spectrum Allocation algorithm to select the optimum spectrum utilization on the links. Routing table selection process depends on a scoring function that can be computed in linear time. Starting with an initial routing table (depending on shortest path algorithm) as an initial seed, the Selection criteria of the routing table decide whether to keep the initial seed or replace it with the one that can lead to a much more better solution. This in turn will eliminate the need to solve the spectrum assignment problem for each routing table. Consequently, the time …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:N8RR74vhTp4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Clustering for hierarchical traffic grooming in large scale mesh WDM networks",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72731-6_28",
            "Abstract": "We present a clustering algorithm for hierarchical traffic grooming in large WDM networks. In hierarchical grooming, the network is decomposed into clusters, and one hub node in each cluster is responsible for grooming traffic from and to the cluster. Hierarchical grooming scales to large network sizes and facilitates the control and management of traffic and network resources. Yet determining the size and composition of clusters so as to yield good grooming solutions is a challenging task. We identify the grooming-specific factors affecting the selection of clusters, and we develop a parameterized clustering algorithm that can achieve a desired tradeoff among various goals.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:HeT0ZceujKMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Design of Large-scale Optical Networks.",
            "Publication year": 2002,
            "Publication url": "https://www.academia.edu/download/46222047/PDCS-Xin-2002.pdf",
            "Abstract": "We consider the problem of designing a network of optical cross-connects (OXCs) to provide end-to-end lightpath services to large numbers of label switched routers (LSRs). We present a set of heuristic algorithms to address the combined problem of physical topology design and logical topology design. Unlike previous studies which were limited to small topologies, we have applied our algorithms to networks with hundreds or thousands of LSRs and with a number of lightpaths that is an order of magnitude larger than the number of LSRs. We present numerical results for up to 1000 LSRs and for a wide range of system parameters such as the number of wavelengths per fiber, the number of transceivers per LSR, and the number of ports per OXC.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic grooming in path, star, and tree networks: complexity, bounds, and algorithms",
            "Publication year": 2003,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/781027.781066",
            "Abstract": "In wavelength division multiplexing (WDM) optical networks, the lightpath is the main transport element. The set of lightpaths defines a logical topology. The logical topology design problem has been studied extensively in the literature [2]. Traffic grooming is a variant of the logical topology design problem, and is concerned with the development of techniques for combining low speed traffic components onto high speed channels in order to minimize network cost, and has received attention in recent literature [4, 3, 1, 6, 8]. In this paper we consider the problem of traffic grooming in path, star, and tree networks, which are useful topologies in themselves but are also building blocks for more general topologies. First, we settle the complexity of traffic grooming in path and star networks. Since routing and wavelength assignment in these two topologies is trivial, these results demonstrate that traffic grooming is itself an …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:TQgYirikUcIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Comparison of allocation policies in wavelength routing networks [4213-09]",
            "Publication year": 2000,
            "Publication url": "https://scholar.google.com/scholar?cluster=4329399608591843831&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:t6usbXjVLHcC",
            "Publisher": "International Society for Optical Engineering; 1999"
        },
        {
            "Title": "Routing path optimization in optical burst switched networks",
            "Publication year": 2005,
            "Publication url": "https://www.academia.edu/download/31924413/ONDM-Teng-2005.pdf",
            "Abstract": "(OBS) networks employ shortest path routing along with nexthop burst forwarding. Shortest path routing minimizes delay and optimizes the utilization of resources, however, it often causes certain links to become congested while others remain underutilized. In a buffer-less OBS network in which burst drop probability is the primary metric of interest, the existence of a few highly congested links may lead to unacceptable performance for the entire network. In this paper, we take a traffic engineering approach to path selection in OBS networks with the objective of balancing the traffic across the network links in order to reduce congestion and improve overall performance. We present an approximate integer linear optimization problem, as well as a simple integer relaxation heuristic to solve the problem efficiently for large networks. Numerical results demonstrate that our approach is effective in reducing the network-wide burst drop probability, in many cases significantly, over shortest path routing.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Hierarchical Traffic Grooming",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-0-387-74518-3_6.pdf",
            "Abstract": "Traffic grooming is the field of study that is concerned with the development of algorithms and protocols for the design, operation, and control of networks with multigranular bandwidth demands [1]. As the number of logical entities (including sub-wavelength channels, wavelengths, wavebands, and fibers) that need to be controlled in a multigranular network increases rapidly with the network size, wavelength capacity, and load, a scalable framework for managing these entities becomes a sine qua non for future wide area WDM networks. Several variants of the traffic grooming problem have been studied in the literature under a range of assumptions regarding the network topology, the nature of traffic, and the optical and electronic switching model [2, 3, 4, 5, 6, 7, 8, 9, 10]. Typically, an integer linear programming (ILP) formulation serves as the basis for reasoning about and tackling the problem. Unfortunately, solving …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Traffic grooming in path, star, and tree networks: Complexity, bounds, and algorithms",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1613773/",
            "Abstract": "We consider the problem of traffic grooming in WDM path, star, and tree networks. Traffic grooming is a variant of the well-known logical topology design, and is concerned with the development of techniques for combining low speed traffic components onto high speed channels in order to minimize network cost. Our contribution is two-fold. In the first part of the paper we present a wealth of results which settle the complexity of traffic grooming in path and star networks, by proving that a number of variants of the problem are computationally intractable. Since routing and wavelength assignment in these two topologies is trivial, these results demonstrate that traffic grooming is itself an inherently difficult problem. Our results have implications for ring and other more general topologies, which we explore. In the second part we design practical grooming algorithms with provable properties. Specifically, for all three …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:Se3iqnhoufwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimization-Aware scheduling in cloud computing",
            "Publication year": 2016,
            "Publication url": "http://210.212.194.26/jspui/handle/123456789/8662",
            "Abstract": "Cloud computing allows delivery of computational resources via internet. Some of the computational resources include signals, codes and physical resources. Cloud users require computational resources for execution of their tasks. The computational elements, when thoroughly assigned to the cloud users according to requirement facilitate an efficient scheduling mechanism. The efficiency is dependent on the parameters chosen to promote the assignment of task to resources. Here, computational cost is chosen as the optimization factor, and the solution with the least cost is selected as the best assignment. A Cuckoo Search inspired technique is used, and task assignment to resources is done by validating the solution with the least value of cost.   2016 ACM.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:yKcmA0jEsUoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Traffic adaptive WDM networks: A study of reconfiguration issues",
            "Publication year": 2001,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=JLT-19-4-433",
            "Abstract": "This paper studies the issues arising in the reconfiguration phase of broadcast optical networks. Although the ability to dynamically optimize the network under changing traffic conditions has been recognized as one of the key features of multiwavelength optical networks, this is the first in-depth study of the tradeoffs involved in carrying out the reconfiguration process. We develop and compare reconfiguration policies to determine  when to reconfigure the network, and we present an approach to carry out the network transition by describing a class of strategies that determine how to retune the optical transceivers. We identify the degree of load balancing and the number of retunings as two important, albeit conflicting, objectives in the design of reconfiguration policies, naturally leading to a formulation of the problem as a Markovian decision process. Consequently,we develop a systematic and flexible framework in …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Bandwidth Tiered Service: Deterministic Demands",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09738-1_3",
            "Abstract": "Consider a network operator providing a service characterized strictly by the amount of bandwidth allocated to each user, e.g., as is the case for many residential and business Internet access services. The service provider is interested in making available only a small number p of distinct bandwidth levels (tiers) to which users may subscribe. In offering such a tiered bandwidth service, the operator must determine the number of tiers and the amount of bandwidth for each tier, as well as provision suffcient capacity within the network. Assuming that the provider has some information regarding the users' bandwidth requirements, it must balance two objectives in dimensioning its network for the tiered service: on the one hand, it must ensure that each user's bandwidth needs are adequately satisfied, while on the other hand it must minimize its own cost for providing the service.In this chapter we make the …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:x9HjRiAMpasC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Architectural support for internet evolution and innovation",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983509/",
            "Abstract": "The architecture of the modern Internet encompasses a large number of principles, concepts and assumptions, that have evolved over several decades. In this paper, we introduce the SILO architecture, a meta-design framework within which the system design can change and evolve. We describe the actual architecture itself, as well as the “proof-of-concept” software prototype we have built.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Language of choice: On embedding choice-related semantics in a realizable protocol",
            "Publication year": 2016,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7846760/",
            "Abstract": "Choice-based future Internet architectures, in which choice is offered for fine-grained network services to different traffic flows, have been proposed in the literature. Such choice-based architectures have been envisioned in literature as realizing an economy of networking services that can give rise to a beneficial ecosystem of providers and consumers over time. Such an architecture would use an economy plane to allow service providers and customers to exchange information about available service alternatives, complete purchase and payment interactions, and use purchased services. While samples of such semantics have been proposed in these previous works, embedding them in specific realizations by defining messages to be exchanged and their syntax is a separate challenge, in which the needs for efficiency, ease of implementation, and extensibility, all need to be balanced. In this paper, we present the …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:RW1BPcyHXiwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Open marketplace and service orchestration for virtual optical networks",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8396132/",
            "Abstract": "A key challenge in multi-vendor heterogeneous virtual optical networks is providing transparent access to network resources and virtual functions in a manner that enables users to combine them appropriately into meaningful end-to-end services. In this paper, we present a solution that consists of two components: an open marketplace where vendors and users of network resources and functions meet to establish economic relationships; and a planning service for creating end-to-end communication services from functional building blocks available in the marketplace. We also discuss algorithms for tackling variants of the network service orchestration problem.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:z62hWG5Wpo0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On routing and spectrum assignment in rings",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6971086/",
            "Abstract": "We present a theoretical study of the routing and spectrum assignment (RSA) problem in ring networks. We first show that the RSA problem with fixed-alternate routing in general-topology (mesh) networks (and, hence, in rings as well) is a special case of a multiprocessor scheduling problem. We then consider bidirectional ring networks and investigate two problems: 1) the spectrum assignment problem under the assumption that each demand is routed along a single fixed path (e.g., the shortest path), and 2) the general case of the RSA problem whereby a routing decision along the clockwise and counter-clockwise directions must be made jointly with spectrum allocation. Based on insights from multiprocessor scheduling theory, we derive the complexity of the two problems and develop new constant-ratio approximation algorithms with a ratio that is strictly smaller than the best known ratio to date.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:7XCffrwrS2sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Helios: a broadcast optical architecture",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-47906-6_72",
            "Abstract": "In this article we present a new all-optical broadcast LAN architecture and an accompanying signaling protocol. The distinguishing characteristics of this architecture are its fault-tolerant design and its collision-free nature, which allows it to achieve high throughput in a broadcast environment. The flexibility of the design allows different schedulers to be used, which can introduce new features into the network (e.g. multicast and QoS) as well as optimize its behavior for the specific setting in which it is used.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fault management with fast restoration for optical burst switched networks",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1363788/",
            "Abstract": "This paper studies the important fault management issue with focus on the fast restoration mechanisms for optical burst switched (OBS) networks. In order to reduce the burst losses during the restoration process, effective fast restoration schemes are necessary. This is illustrated via two basic fast restoration schemes, the distributed deflection scheme and the local deflection scheme, compared with the slow global routing update mechanism. A novel priority-based QoS restoration scheme is also proposed to provide differentiated restoration services. Through detailed descriptive analysis and a comprehensive simulation study, these fast restoration schemes demonstrate fast restoration process, low fault management overheads, and excellent burst loss performance. As far as we know, this is the first comprehensive study on the restoration mechanisms for OBS networks.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Commentary: Toward specialized undergraduate telecommunication engineering education in the US",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6295705/",
            "Abstract": "In ancient times, unless somebody was prepared to travel, man could only communicate as far as he could shout. Methods were then developed to enable communications to extend over longer distances, using trumpets, beacon fire, flags, etc. It was not until the inauguration of telegraphy (by W. Cooke and C. Wheatstone in England in 1839, and by S. Morse in the US in 1844) and telephony (by A. G. Bell in 1876), that electricity was utilized to facilitate commercial telecommunication service [1]-[2]. Then, for nearly 100 years, telecommunications was mainly about telephony and telegraphy and was based almost entirely on electrical engineering methods. From audio to radio signals, electro-mechanic to electronic technologies, analog to digital systems, and electronic to photonic devices; telecommunications has witnessed tremendous progress on numerous fronts. In terms of services and applications …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:URolC5Kub84C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Optimal quantization of periodic task requests on multiple identical processors",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1225058/",
            "Abstract": "We simplify the periodic tasks scheduling problem by making a trade off between processor load and computational complexity. A set N of periodic tasks, each characterized by its density /spl rho//sub i/, contains n possibly unique values of /spl rho//sub i/. We transform N through a process called quantization, in which each /spl rho/i /spl isin/ N is mapped onto a service level s/sub j/ /spl isin/ L, where |L| = l /spl Lt/ n and /spl rho//sub i/ /spl les/ s/sub j/, (this second condition differentiates this problem from the p-median problem on the real line). We define the periodic task quantization problem with deterministic input (PTQ-D) and present an optimal polynomial time dynamic programming solution. We also introduce the problem PTQ-S (with stochastic input) and present an optimal solution. We examine, in a simulation study, the trade off penalty of excess processor load needed to service the set of quantized tasks over …",
            "Abstract entirety": 0,
            "Author pub id": "tmuBOhwAAAAJ:iH-uZ7U-co4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "The spectrum assigment (SA) problem in optical networks: A multiprocesor scheduling perspective",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6855758/",
            "Abstract": "The routing and spectrum assignment (RSA) problem has emerged as the key design and control problem in elastic optical networks. In this work, we provide new insight into the spectrum assignment (SA) problem in mesh networks by showing that it transforms to the problem of scheduling multiprocessor tasks on dedicated processors. Based on this new perspective, we show that the SA problem in paths is NP-hard for four or more links, but is solvable in polynomial time for three links. We also develop new constant-ratio approximation algorithms for the SA problem in paths when the number of links is fixed. Finally, we introduce a suite of list scheduling algorithms that are computationally efficient and simple to implement, yet produce solutions that, on average, are within 1-5% of the lower bound.",
            "Abstract entirety": 1,
            "Author pub id": "tmuBOhwAAAAJ:ZzlSgRqYykMC",
            "Publisher": "IEEE"
        }
    ]
}]