[{
    "name": "Γεώργιος Σεργιάδης",
    "romanize name": "Georgios Sergiadis",
    "School-Department": "Ηλεκτρολόγων Μηχ & Μηχ Υπολογιστών",
    "University": "auth",
    "Rank": "Καθηγητής",
    "Apella_id": 19216,
    "Scholar name": "George Sergiadis",
    "Scholar id": "TmGjsAoAAAAJ",
    "Affiliation": "Professor, School of Electrical and Computer Engineering, Aristotle University",
    "Citedby": 1928,
    "Interests": [
        "Biomedical Engineering"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=TmGjsAoAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "A novel, shooting and bouncing rays technique for propagation prediction, based on a varying-step calculation procedure",
            "Publication year": 2005,
            "Publication url": "http://users.auth.gr/antodimi/Conference%20Papers/MMS05_dimitriou_sergiadis_paper.pdf",
            "Abstract": "As site specific propagation modeling has become crucial for most modern wireless systems’ applications, runningtime of the corresponding “ray tracing” techniques is a key issue. We propose a new shooting and bouncing rays (SBR) technique that optimizes the performance of traditional SBR methods in terms of running time, for the same accuracy requirements. This is accomplished via shooting rays towards the quadrangularly arranged locations of interest and performing the calculations at specific distance-intervals. The proposed method is straightforward and can be easily implemented in a ray tracing propagation prediction tool. The main computational advantage, compared to the traditional approaches, results from not performing the reception-sphere tests. The proposed SBR technique is thoroughly explained and the corresponding advantages are demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:4TOpqqG69KYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Image quality indices based on fuzzy discrimination informationmeasures.",
            "Publication year": 2004,
            "Publication url": "https://www.academia.edu/download/43628594/465-183.pdf",
            "Abstract": "Quality measures play an important role in the field of image processing. Such measures are commonly used to assess the performance of different algorithm that are designed to perform a specific image processing task. In this paper we propose two novel indices for image quality assessment based on the notion of discrimination information between two fuzzy sets. Two different definitions for the discrimination information have been used. In order to calculate the proposed quality indices two approaches were evaluated, one with application of the indices directly to the pixels of the image and the other using the fuzzy set corresponding to the normalized histogram of the image. A comparative study of the proposed indices is performed by investigating their behavior using images with different types of distortions, such as impulsive “salt & pepper” noise, additive white Gaussian noise, multiplicative speckle noise, blurring, gamma distortion, and JPEG compression.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Blood vessel imaging using radiofrequency-induced second harmonic acoustic response",
            "Publication year": 2018,
            "Publication url": "https://www.nature.com/articles/s41598-018-33732-0",
            "Abstract": "We introduce a contrast mechanism for visualizing blood vessels based on radiofrequency-induced second harmonic acoustic (RISHA) signals sensing blood conductivity. We develop a novel imaging system using commonly available inexpensive components, and demonstrate in vivo RISHA visualization of blood vessels based on low-power quasi-continuous radiofrequency excitation of tissue at frequencies of a few MHz. We show how the novel approach also implicitly enables radiofrequency-induced passive ultrasound imaging and can be readily applied to non-invasive imaging of blood vessels ex vivo and in vivo. We discuss the implications of non-invasive conductivity measurements in the context of biomedical applications.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:EUQCXRtRnyEC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Hesitancy histogram equalization",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4295620/",
            "Abstract": "Extending our previous work on intuitionistic fuzzy histograms [1], we introduce the concept of hesitancy histogram and its application for enhancing low-contrasted images. The hesitancy histogram is based on intuitionistic fuzzy numbers using an entropic optimization criterion. Motivated by the histogram equalization technique, a hesitancy histogram equalization scheme is also proposed. Application of the presented intuitionistic fuzzy approach to real-world low-contrasted images demonstrate the efficiency of the proposed method.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Device for endoscopic optoacoustic imaging, in particular for endoscopic optoacoustic imaging of cavities and hollow objects",
            "Publication year": 2020,
            "Publication url": "https://patents.google.com/patent/US20200196873A1/en",
            "Abstract": "The invention relates to a device (1) for endoscopic optoacoustic imaging comprising an imaging unit (2) configured to be at least partially inserted into an object (5), said imaging unit (2) comprising an irradiation unit (6) configured to irradiate a region of interest (7) inside the object (5) with electromagnetic radiation and a detection unit (8) comprising at least one ultrasound transducer configured to detect ultrasound waves generated in the region of interest (7) in response to irradiating the region of interest (7) with the electromagnetic radiation and to generate according detection signals, wherein the at least one ultrasound transducer exhibits a field of view (8 b) being at least partially located in the irradiated region of interest (7). A position stabilizing structure (3) with an outer face (3 a) and an interior (3 b) is configured to stabilize and/or fix the imaging unit (2) in a position and/or orientation in the object (5) by …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:P5F9QuxV20EC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A heuristic approach to intuitionistic fuzzification of color images",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812774118_0108",
            "Abstract": "In this work we present a heuristic approach to the intuitionistic fuzzification of color images; that is constructing the intuitionistic fuzzy set corresponding to a color digital image. Exploiting the physical properties and drawbacks of the imaging and acquisition chain, we model the uncertainties present in digital color images, using the concept of fuzzy histogram using fuzzy numbers.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:qxL8FJ1GzNcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Managing topological prioritization in ray-tracing based progressive propagation-prediction modeling",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1707945/",
            "Abstract": "In a progressive propagation prediction model, significant time is saved by interrupting the process when specific application related constraints have been met. Such limitations have to do with the statistics of intermediate results as well as their spatial arrangement in the area of interest. We propose a time-efficient method to control the topological distribution of intermediate predictions. The proposed criterion allows different priorities to be set in different regions of the study area. In addition, we put forward two progressive strategies capable of adjusting the ray-tracing engine to the desired prioritization. The advantages of the proposed strategies compared with existing approaches are well demonstrated",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Near-field radio-frequency thermo-acoustic imaging based on transmission lines for optimized performance",
            "Publication year": 2012,
            "Publication url": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/8223/82231O/Near-field-radio-frequency-thermo-acoustic-imaging-based-on-transmission/10.1117/12.908616.short",
            "Abstract": "Near-field Radio-frequency Thermoacoustic Imaging (NRTI) is an imaging modality that was recently introduced to generate thermoacoustic signals using ultra-short high energy impulses. Because it allows for a higher energy coupling within an ultra-short time, it can achieve higher resolutions and higher signal to noise ratio, compared to traditional thermoacoustic tomography based on radiating sources at single frequencies. As for traditional thermoacoustic imaging the contrast comes from the conductivity and the dielectric properties of the tissues, while the resolution depends on the measured acoustic waves. Since NRTI depends on the efficient generation of high energy short impulses, the ability to control their time width and pulse shape is of high importance. We present here a methodology for generating such impulses based on transmission lines. The ability of such generators to generate impulses in the …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "International Society for Optics and Photonics"
        },
        {
            "Title": "The role of entropy in intuitionistic fuzzy contrast enhancement",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72950-1_11",
            "Abstract": "In this paper we study the impact of selecting different entropy measures in the framework of intuitionistic fuzzy image processing and especially in the process of intuitionistic fuzzification of images. Different notions of entropy characterized by different properties are reviewed and their behavior is thoroughly studied under the scope of performing contrast enhancement. Finally, experimental results using gray-scale images reveal the characteristics of the aforementioned measures.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A curvelet-based lacunarity approach for ulcer detection from wireless capsule endoscopy images",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6627801/",
            "Abstract": "Wireless Capsule Endoscopy (WCE) is a fairly new technology that offers a low-risk, non invasive visual inspection of the patient's digestive tract, especially the small bowel, that was previously unreachable using the traditional endoscopic methods. However, the large amount of images produced by WCE requires a highly trained physician to manually inspect them; a procedure that is time consuming and prone to human error. This was the rationale to propose a novel strategy for automatic detection of WCE images related to ulcer, one of the most common findings of the digestive tract. This paper introduces a new texture extraction method based on the Discrete Curvelet Transform (DCT), a recent multi-resolution analysis tool. Textural information is acquired by calculating the lacunarity index of DCT subbands of the WCE images. The classification step is performed by a Support Vector Machine (SVM …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:M05iB0D1s5AC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Multirate SPAMM tagging",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1220211/",
            "Abstract": "Many magnetic resonance tagging sequences rely on periodicity in order to produce a uniform tagging grid that covers the whole image plane. This, however, is not always desirable, since motion may be restricted to specific parts of the image, and also different motion characteristics may call for different tagging grid densities. In this paper, we present a combination of the spatial modulation of magnetization 1-1 method with selective excitation pulses that can be used in order to restrict the tagging grid only to regions of interest and produce tagging grid of different density in each region. The method is fast and easy to implement even on older or less expensive systems, since it does not require extensive gradient switching.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:aqlVkmm33-oC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Acoustics and Ultrasonics Instrumentation and Measurements-Three-Dimensional Nondestructive\" Sampling\" of Art Objects Using Acoustic Microscopy and Time-Frequency Analysis",
            "Publication year": 2011,
            "Publication url": "https://scholar.google.com/scholar?cluster=12544300287489558786&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:M3NEmzRMIkIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Magnetoacoustic sensing of magnetic nanoparticles",
            "Publication year": 2016,
            "Publication url": "https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.116.108103",
            "Abstract": "The interaction of magnetic nanoparticles and electromagnetic fields can be determined through electrical signal induction in coils due to magnetization. However, the direct measurement of instant electromagnetic energy absorption by magnetic nanoparticles, as it relates to particle characterization or magnetic hyperthermia studies, has not been possible so far. We introduce the theory of magnetoacoustics, predicting the existence of second harmonic pressure waves from magnetic nanoparticles due to energy absorption from continuously modulated alternating magnetic fields. We then describe the first magnetoacoustic system reported, based on a fiber-interferometer pressure detector, necessary for avoiding electric interference. The magnetoacoustic system confirmed the existence of previously unobserved second harmonic magnetoacoustic responses from solids, magnetic nanoparticles, and nanoparticle …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:fPk4N6BV_jEC",
            "Publisher": "American Physical Society"
        },
        {
            "Title": "Edge Detection By Fusion Using Local Information of Edges",
            "Publication year": 2003,
            "Publication url": "https://www.koreascience.or.kr/article/CFKO200311922197881.page",
            "Abstract": "This paper presents a robust algorithm for edge detection based on fuzzy fusion, using a novel local edge information measure based on Renyi's a-order entropy. The calculation of the proposed measure is carried out using a parametric classification scheme based on local statistics. By suitably tuning its parameters, the local edge information measure is capable of extracting different types of edges, while exhibiting high immunity to noise. The notions of fuzzy measures and the Choquet fuzzy integral are applied to combine the different sources of information obtained using the local edge information measure with different sets of parameters. The effectiveness and the robustness of the new method are demonstrated by applying our algorithm to various synthetic computer-generated and real-world images.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:SeFeTyx0c_EC",
            "Publisher": "Korean Institute of Intelligent Systems"
        },
        {
            "Title": "Noninvasive visualization of electrical conductivity in tissues at the micrometer scale",
            "Publication year": 2021,
            "Publication url": "https://advances.sciencemag.org/content/7/20/eabd1505.abstract",
            "Abstract": "Despite its importance in regulating cellular or tissue function, electrical conductivity can only be visualized in tissue indirectly as voltage potentials using fluorescent techniques, or directly with radio waves. These either requires invasive procedures like genetic modification or suffers from limited resolution. Here, we introduce radio-frequency thermoacoustic mesoscopy (RThAM) for the noninvasive imaging of conductivity by exploiting the direct absorption of near-field ultrashort radio-frequency pulses to stimulate the emission of broadband ultrasound waves. Detection of ultrasound rather than radio waves enables micrometer-scale resolutions, over several millimeters of tissue depth. We confirm an imaging resolution of <30 μm in phantoms and demonstrate microscopic imaging of conductivity correlating to physical structures in 1- and 512-cell zebrafish embryos, as well as larvae. These results support RThAM as …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:UxriW0iASnsC",
            "Publisher": "American Association for the Advancement of Science"
        },
        {
            "Title": "In vivo frequency domain optoacoustic tomography",
            "Publication year": 2012,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ol-37-16-3423",
            "Abstract": "Optoacoustic imaging has been primarily implemented in the time domain, i.e., using ultrashort nanosecond laser pulses for illumination. Alternatively, frequency domain optoacoustic imaging can be performed when employing amplitude modulated light sources. We present herein a tomographic implementation of optoacoustic imaging using a linear frequency modulated laser source. The method developed demonstrated the ability to produce tomographic images of optical absorbing phantoms and in vivo images, by enabling visualization of the mouse tail following ICG injection.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:NaGl4SEjCO4C",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Architectural features and urban propagation",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1603803/",
            "Abstract": "Radiocoverage measurements in urban environments often unveil unexpected power distribution patterns. Architectural features seem to be the cause of this behavior, as demonstrated in this paper. We demonstrate that the elements of a typical building facade, such as windows, exterior doors, balconies and railings, should be considered as significant \"sources\" of EM radiation in several current wireless communication systems. We propose a method for modeling the influence of those scatterers in EM wave propagation. In our model, the major structural elements are represented by two sets of orthogonally arranged wedges. The uniform geometrical theory of diffraction is employed to calculate the scattering field. The simulation results show that such \"urban\" scatterers may create a dominant propagation mode in an urban canyon. Our predictions are additionally verified by experimental measurements …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:d1gkVwhDpl0C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Special Session on Intuitionistic Fuzzy Sets: Recent Advances-A Two-Dimensional Entropic Approach to Intuitionistic Fuzzy Contrast Enhancement",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=7711468096571939381&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:b0M2c_1WBrUC",
            "Publisher": "Berlin: Springer-Verlag, 1973-"
        },
        {
            "Title": "Development of a Wireless Communications Planning Tool for Optimizing Indoor Coverage Areas",
            "Publication year": 2001,
            "Publication url": "http://users.auth.gr/antodimi/Conference%20Papers/2_planning%20tool.pdf",
            "Abstract": "In this paper we present some preliminary results on the subject of indoor wireless communications planning by using computer simulation of signal propagation. The goal of this simulation is to obtain an overview of the received signal strength throughout the indoor environment and then try to optimize the coverage by moving the antenna properly. The optimization is considered as a procedure of moving signal “blind spots” according to a non-standard pattern that obeys custom needs, related to specific parameters of the environment (eg furniture).",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:ZeXyd9-uunAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Processing of UV/VIS/nIR/mIR diffuse reflectance spectra and acoustic microscopy echo graphs for stratigraphy determination, using neural networks and wavelet transform",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4529904/",
            "Abstract": "A main concern for the documentation of artworks (such as paintings, miniatures, icons, manuscripts, wall paintings) is how to reveal the information that stems from the internal paint layers (stratigraphy). This information is up to now mainly acquired through analytical spectroscopic methods which require a micro-sampling operation. In the majority of the cases, the objects under study are extremely valuable, rare and fragile, therefore they may not be subjected to any intervention, rendering the micro sampling procedures prohibitive. The current work proposes a method combining signal processing techniques with novel non-destructive testing techniques for the determination of artworks' paint layers profile in depth as well as the local distribution of the pigments in each of the paint layers without micro-sampling.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:MXK_kJrjxJIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimation of motions in color image sequences using hypercomplex Fourier transforms",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4682625/",
            "Abstract": "Although the motion estimation problem has been extensively studied, most of the proposed estimation approaches deal mainly with monochrome videos. The most usual way to apply them also in color image sequences is to process each color channel separately. A different, more sophisticated approach is to process the color channels in a ldquoholisticrdquo manner using quaternions, as proposed by Ell and Sangwine. In this paper, we extend standard spatiotemporal Fourier-based approaches to handle color image sequences, using the hypercomplex Fourier transform. We show that translational motions are manifested as energy concentration along planes in the hypercomplex 3D Fourier domain and we describe a methodology to estimate the motions, based on this property. Furthermore, we compare the three-channels-separately approach with our approach and we show that the computational effort can …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:9yKSN-GCB0IC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Motion estimation, segmentation and separation, using hypercomplex phase correlation, clustering techniques and graph-based optimization",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314208001409",
            "Abstract": "The problem of estimating the motions in image sequences has been extensively studied. However, most of the proposed motion estimation approaches deal only with the luminance component of the images, although the color information is also important. The usual way to apply these techniques in color image sequences is to process each color channel separately. As proposed by Ell, Sangwine and Moxey, a more sophisticated approach is to handle the color channels in a “holistic” manner, using quaternions. We present a motion estimation approach which is based on the Hypercomplex (quaternionic) Phase Correlation of Moxey et al. We show that the quaternionic approach is computationally more efficient and more robust to sensor noise, compared with the corresponding three-channels-separately approach. With the assumption of smoothly time-varying velocities we propose the application of a weighted …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:Se3iqnhoufwC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "High quality cellular communications at the Athens 2004 Olympic Games",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/article/10.1007/s10550-005-0021-6",
            "Abstract": "Traditionally thousands of spectators, reporters, officials and athletes congregate at Olympic Games within a very small area. This concentration peaks, especially during the opening and closing ceremonies, at very high numbers, seldom encountered on any other occasion globally. Most national cellular infrastructures now serve practically the whole of the country, and mobile telephones have penetrated to a considerable extent into the general population, usually outperforming fixed telephones, but past Olympic Games, and other equally important world-wide sports venues, suffered from shorter or longer blocking of the cellular services. An exception to this rule is the Olympic Games of Athens, where high-quality cellular communications were offered. This paper presents the design philosophy of the cellular network GSM 1800, proposed by the author and adopted by Cosmote, the official cellular …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:maZDTaKrznsC",
            "Publisher": "Kluwer Academic Publishers-Consultants Bureau"
        },
        {
            "Title": "Nondestructive stratigraphy determination artworks using system modeling",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1307778/",
            "Abstract": "This paper presents the nondestructive stratigraphy determination through the use of UV/VIS/nIR spectroscopy. The UV/VIS/nIR backscattered light through a multilayered structure, such as the paint layers of artworks, is simulated. The device used to produce and measure the backscattered light, is the Perkin-Elmer Lambda 900 UV/VIS/nIR spectrophotometer equipped with an external integration sphere for \"in situ\" nondestructive measurements. The final target of this work is the development of a nondestructive technique to permit the stratigraphy reconstruction of artworks.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:IWHjjKOFINEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "In vivo mouse imaging using frequency domain optoacoustic tomography",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ECBO-2013-88000A",
            "Abstract": "Frequency domain optoacoustics relates to stimulation of optoacoustic signals using intensity modulated continuous wave light instead of pulsed laser light employed in time domain optoacoustic imaging. We present a method to generate frequency domain tomographic images of optical absorbers and cross sectional in-vivo mouse images, showing the changes of optical absorption before and after injection of indocyanine green (ICG).",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:70eg2SAEIzsC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "WE‐D‐BRF‐02: Acoustic Signal From the Bragg Peak for Range Verification in Proton Therapy",
            "Publication year": 2014,
            "Publication url": "https://aapm.onlinelibrary.wiley.com/doi/abs/10.1118/1.4889400",
            "Abstract": "Range verification in ion beam therapy relies to date on nuclear imaging techniques which require complex and costly detector systems. A different approach is the detection of thermoacoustic signals that are generated due to localized energy loss of ion beams. Aim of this work is to study the feasibility of determining the ion range with sub‐mm accuracy by use of high frequency ultrasonic (US) transducers and to image the Bragg peak by tomography.A water phantom was irradiated by a pulsed 20 MeV proton beam with varying pulse intensity, length and repetition rate. The acoustic signal of single proton pulses was measured by different PZT‐based US detectors (3.5 MHz and 10 MHz central frequencies). For tomography a 64 channel US detector array was used and moved along the ion track by a remotely controlled motor stage.A clear signal of the Bragg peak was visible for an …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:ZHo1McVdvXMC",
            "Publisher": "American Association of Physicists in Medicine"
        },
        {
            "Title": "PLL powered, real-time visual motion tracking",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5401100/",
            "Abstract": "We present a novel approach that handles the motion estimation/tracking problem in a phase-frequency tracking framework. Motion estimation in the spectral domain has been extensively studied. However, the real-time time-varying velocities tracking is still a challenging task. Our approach is based on a proposed phase-locked loop (PLL)-based system, which is hardware implementable and can be used for true real-time motion estimation of objects in image sequences. We describe all the necessary details of the PLL-based system which can track a single or multiple time-varying motions. We highlight the advantages and limitations of our methodology and we present promising simulation results on both synthetic and natural image sequences.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:dhFuZR0502QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Seismic resilience assessment of the western Macedonia highway network in Greece",
            "Publication year": 2017,
            "Publication url": "https://www.researchgate.net/profile/Andreas-Kappos-2/publication/320208976_SEISMIC_RESILIENCE_ASSESSMENT_OF_THE_WESTERN_MACEDONIA_HIGHWAY_NETWORK_IN_GREECE/links/5e6f5e9292851c6ba7066f86/SEISMIC-RESILIENCE-ASSESSMENT-OF-THE-WESTERN-MACEDONIA-HIGHWAY-NETWORK-IN-GREECE.pdf",
            "Abstract": "Retis-Risk is a comprehensive framework recently developed for the assessment and management of the seismic resilience of interurban roadway networks. In this paper, this framework is applied for the road network of the prefecture of Western Macedonia in Greece. Refined data concerning real traffic conditions and network topology were collected and a detailed network mapping was performed in GIS. Utilizing an ad-hoc developed software for implementing the holistic methodology, the as-built road network was assessed and the network components with the highest vulnerability and consequence were identified. To improve the loss assessment reliability, bridge-specific fragility curves were employed based on the refined FE modeling. Structural and traffic cost due to earthquake scenarios of different return period were then predicted. To identify effective loss mitigation measures, the whole process was repeated assuming two different pre-earthquake risk management strategies. The first one concerns a retrofit program tailored to selected (ie, the most critical) network components, while the second one focuses on the beneficial effect of a better recovery planning. Results indicate the significant contribution of an effective risk management to the loss mitigation and network resilience improvement. Moreover, a sustainable health monitoring system was installed on Polymylos bridge to ensure satellite data transmission during an earthquake event to update the postearthquake recovery model, nearly in real time, with the measured spectral acceleration of the superstructure. The results indicate that the road network is adequately resilient …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:nb7KW1ujOQ8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Computer-aided capsule endoscopy images evaluation based on color rotation and texture features: An educational tool to physicians",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6627789/",
            "Abstract": "Wireless capsule endoscopy (WCE) is a revolutionary, patient-friendly imaging technique that enables non-invasive visual inspection of the patient's digestive tract and, especially, small intestine. However, reviewing the endoscopic data is time consuming and requires intense labor of highly experienced physicians. These limitations were the motive to propose a novel strategy for automatic discrimination of WCE images related to ulcer, the most common finding of digestive tract. Towards this direction, WCE data are color-rotated in order to boost the chromatic attributes of ulcer regions. Then, texture information is extracted by utilizing the local binary pattern operator that analyses the spatial structure of the images at a very local level. Experimental results demonstrated promising classification accuracy (91.1%) exhibiting high potential towards a complete computer-aided diagnosis system that will not only reduce …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:35N4QoGY0k4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wideband printed dipole antenna parasitically enhanced with over‐an‐octave bandwidth. Dual‐band variant for WLAN applications",
            "Publication year": 2006,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.21375",
            "Abstract": "In this paper, a wideband dipole antenna with more than an octave of impedance bandwidth is presented. Enhancement is achieved by using an additional coplanar parasitic element and via optimization of the tapered feeding network. The prototype antenna demonstrates 87% impedance bandwidth (VSWR < 2), operating between 2.01 and 5.08 GHz. A sensitivity analysis reveals the possibility for a dual‐band variant, covering both the 2.4‐ and 5.2‐GHz WLAN operating bands, for use in IEEE 802.11a/b/g compliant systems. © 2006 Wiley Periodicals, Inc. Microwave Opt Technol Lett 48: 444–449, 2006; Published online in Wiley InterScience (www.interscience.wiley.com). DOI 10.1002/mop.21375",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:roLk4NBRz8UC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Three-dimensional nondestructive “sampling” of art objects using acoustic microscopy and time–frequency analysis",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5751685/",
            "Abstract": "The microsampling destructions, which are caused by the sampling procedures of analytical spectroscopic methods, are, in most cases, not permitted to art objects, which are extremely valuable, rare, and fragile. Consequently, the development of nondestructive analysis techniques becomes a necessity. In this paper, we present a technique and method for the nondestructive identification of the stratigraphic structure of the paint layers of art objects. Using acoustic microscopy, in combination with time-frequency representations, the continuous or discrete wavelet transform, or the Hilbert-Huang transform, the depth profile of the stratigraphy is determined.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:M3ejUd6NZC8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Trajectory-Tracking of UHF RFID Tags, Exploiting Phase Measurements Collected From Fixed Antennas",
            "Publication year": 2021,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9328865/",
            "Abstract": "In this article we propose a novel method for tracking a moving UHF RFID tag in 3D space. The tag moves in an area monitored by at least two antennas fixed at known locations. Phase measurements from each antenna are collected. Assuming a grid of     initial positions, we calculate     possible trajectories, by deriving closed form expressions, exploiting only the phase measurements collected by each antenna separately. Then, using the measured phase-difference from each antenna-pair, a hyperbola’s branch on which the tag must be located is calculated. We evaluate the distance of each trajectory from the hyperbolas. Finally, we select the trajectory that minimizes the distance. Experimental results, conducted with a SLAM (Simultaneous Localization and Mapping)-enabled robot show a mean error less than 20cm with estimations derived in the order of ms. Compared to prior art, the proposed method …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:dshw04ExmUIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intuitionistic fuzzy histograms of an image",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-72950-1_9",
            "Abstract": "This paper proposes an automated approach for constructing the intuitionistic fuzzy histograms (IF-histograms) of a gray-scale digital image, based on the notion of intuitionistic fuzzy numbers (IF-numbers). A method for constructing parametric IF-numbers from their fuzzy counterparts using intuitionistic fuzzy generators (IFGs) is also presented, using an entropic optimization criterion. Finally, experimental results demonstrate the ability of the proposed approach to obtain efficiently the IF-histograms of gray-scale images.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Spatial and spectral mapping and decomposition of neural dynamics and organization of the mouse brain with multispectral optoacoustic tomography",
            "Publication year": 2019,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2211124719301822",
            "Abstract": "In traditional optical imaging, limited light penetration constrains high-resolution interrogation to tissue surfaces. Optoacoustic imaging combines the superb contrast of optical imaging with deep penetration of ultrasound, enabling a range of new applications. We used multispectral optoacoustic tomography (MSOT) for functional and structural neuroimaging in mice at resolution, depth, and specificity unattainable by other neuroimaging modalities. Based on multispectral readouts, we computed hemoglobin gradient and oxygen saturation changes related to processing of somatosensory signals in different structures along the entire subcortical-cortical axis. Using temporal correlation analysis and seed-based maps, we reveal the connectivity between cortical, thalamic, and sub-thalamic formations. With the same modality, high-resolution structural tomography of intact mouse brain was achieved based on …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:abG-DnoFyZgC",
            "Publisher": "Cell Press"
        },
        {
            "Title": "Intuitionistic fuzzy image processing",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-38233-1_14",
            "Abstract": "The purpose of this chapter is to establish a flexible mathematical framework for image processing, based on the concepts of intuitionistic fuzzy sets theory. The images in the intuitionistic fuzzy environment are composed of components corresponding to membership and indeterminacy functions, associated with image properties. Heuristic and analytical methods are presented that model the inherent uncertainty of images from different points of departure. The modelling is carried out by exploiting and interpreting the inherent ambiguity and vagueness, carried by the image itself, in terms of elements of intuitionistic fuzzy sets. The efficiency of the proposed intuitionistic fuzzy framework is demonstrated in the context of contrast enhancement and edge detection, yielding satisfactory and promising results.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:Y0pCki6q_DkC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Abnormal pattern detection in wireless capsule endoscopy images using nonlinear analysis in RGB color space",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5627648/",
            "Abstract": "In recent years, an innovative method has been developed for the non-invasive observation of the gastrointestinal tract (GT), namely Wireless Capsule Endoscopy (WCE). WCE especially enables a detailed inspection of the entire small bowel and identification of its clinical lesions. However, the foremost disadvantage of this technological breakthrough is the time consuming task of reviewing the vast amount of images produced. To address this, a novel technique for distinguishing pathogenic endoscopic images related to ulcer, the most common disease of GT, is presented here. Towards this direction, the Bidimensional Ensemble Empirical Mode Decomposition was applied to RGB color images of the small bowel acquired by a WCE system in order to extract their Intrinsic Mode Functions (IMFs). The IMFs reveal differences in structure from their finest to their coarsest scale, providing a new analysis domain …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:_FxGoFyzp5QC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Wideband fiber-interferometer stabilization with variable phase",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6257460/",
            "Abstract": "We report on a robust scheme for wideband variable-phase interferometer stabilization based on active modulation. In contrast to previous schemes, the correction signal is generated without using second harmonics, whose low amplitude often requires employing narrowband lock-in amplifiers. Resonances in the element modulating the phase are attenuated to enable high gain without high-frequency oscillations. Operation over a 3-kHz bandwidth is demonstrated.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:hC7cP41nSMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Apparatus and method for frequency-domain thermo-acoustic tomographic imaging",
            "Publication year": 2015,
            "Publication url": "https://patents.google.com/patent/US20150366458A1/en",
            "Abstract": "An imaging apparatus (100), configured for thermoacoustic tomographic imaging a region of interest (2) in an object (1), comprises a source device (10) being arranged for emitting an electromagnetic energy input into the region of interest (2), a detector device (20) being arranged for detecting mechanical wave response signals generated in the region of interest (2) along multiple angular projection directions in response to the electromagnetic energy input, and an image data acquisition and processing device (30) being arranged for providing tomographic image data representing the image of the region of interest (2) on the basis of the mechanical wave response signals, wherein the source device (10) is adapted for continuously emitting the electromagnetic energy input with a predetermined input modulation, and the image data acquisition and processing device (30) is adapted for converting the mechanical …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:u_35RYKgDlwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A novel technique for the approximation of 3-D antenna radiation patterns",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1461546/",
            "Abstract": "In this paper, a novel technique for the approximation of three-dimensional (3-D) antenna radiation patterns is presented. The proposed method combines the two principal cuts in order to acquire an adequate estimate of the 3-D antenna radiation solid. The absolute error from the theoretical solution is analyzed along with other statistical measures for various types of antenna structures, namely omni-directional and directive arrays. The performance of the method is compared against other existing extrapolation algorithms. The proposed technique exhibits low approximation errors and is easily integrated into 3-D radio propagation planning tools (such as ray-tracing algorithms).",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:Tyk-4Ss8FVUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Microcellular propagation prediction model based on a geometric progression approximation-process",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4120248/",
            "Abstract": "A new propagation prediction model, suitable for an antenna placed below rooftop level in an urban environment is presented. It is shown that the contribution of various arriving rays at a specific location can be well approximated by a set of geometric progressions. Each progression is associated with a source. Then, estimation is delivered as soon as the leading term and the ratio have been computed. The ratio reflects the significance of secondary ray-paths. It depends on the geometry and the electromagnetic properties of the materials within the \"street canyon.\" In contrast to typical semi-deterministic approaches, detailed information on the power, the time of arrival and the angle of arrival of all significant components is delivered. Consequently, wideband characterization of the environment is accomplished at short running-time. High accuracy is experimentally verified in a typical urban configuration",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:HDshCWvjkbEC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An automated image thresholding scheme for highly contrast-degraded images based on a-order fuzzy entropy",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/10983652_40",
            "Abstract": "This paper presents an automated thresholding algorithm for highly contrast-degraded images based on the minimization of the a-order fuzzy entropy of an image. The advantage of the proposed method is that it is based on a flexible parametric criterion function that can be automatically tuned according to the histogram statistics, in order for the thresholded image to preserve as much of the object properties of the initial image as possible, despite the contrast degradation. The effectiveness of the new algorithm is demonstrated by applying our method to different types of contrast-degraded images. Performance assessment is based on comparison of the results derived using the proposed method with the results obtained from various existed image thresholding algorithms using objective empirical discrepancy measures.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Inner product based entropy in the intuitionistic fuzzy setting",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/S0218488506004059",
            "Abstract": "In this paper, an entropy formula for intuitionistic fuzzy sets is presented. The notion of the intuitionistic fuzzy vector is introduced and an entropy measure is derived based on the normalized inner product between intuitionistic fuzzy vectors in the unit intuitionistic fuzzy cube. Some considerations regarding the geometrical representations of intuitionistic fuzzy sets are also stated and a connection between the different notions of entropy in the intuitionistic fuzzy setting is established. Finally, the relation of the proposed entropy measure to the concepts of correlation and informational energy for intuitionistic fuzzy sets is revealed and a new correlation coefficient is introduced.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:lSLTfruPkqcC",
            "Publisher": "World Scientific Publishing Company"
        },
        {
            "Title": "Quality Measures for Image Comparison Based on Correlation of Fuzzy Sets",
            "Publication year": 2003,
            "Publication url": "https://www.koreascience.or.kr/article/CFKO200311922198496.page",
            "Abstract": "Quality measures play an important role in the field of image processing. Such measures are commonly used to assess the performance of different algorithms that are designed to perform a specific image processing task. In this paper we propose two novel measures for image quality assessment based on the notion of correlation between fuzzy sets. Two different definitions fur the correlation between fuzzy sets have been used. In order to calculate the proposed quality measures two approaches were evaluated, one with direct application of the measures to the image′ s pixels and the other using the fuzzy set corresponding to the normalized histogram of the image. A comparative study of the proposed measures is performed by investigating their behavior using images with different types of distortions, such as impulsive\" salt at pepper\" noise, additive white Gaussian noise, multiplicative speckle noise, blurring, gamma distortion, and JPEG compression.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Korean Institute of Intelligent Systems"
        },
        {
            "Title": "Traffic behavior simulation of a DECT technology network",
            "Publication year": 2001,
            "Publication url": "http://users.auth.gr/~antodimi/Conference%20Papers/1_traffic.pdf",
            "Abstract": "In this paper we present the results of a simulation we performed in order to examine DECT’s behavior as far as its traffic capabilities are concerned. Therefore, we consider a network that uses the DECT radio access technology and try to simulate a realistic traffic scenario. We are trying to involve DECT’s characteristics as those were defined by the DECT ETSI specification. The results show a satisfactory capacity behavior for indoor applications.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:QIV2ME_5wuYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Estimation of multiple, time-varying motions using time-frequency representations and moving-objects segmentation",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4509496/",
            "Abstract": "We extend existing spatiotemporal approaches to handle time-varying motions estimation of multiple objects. It is shown that multiple, time-varying motions estimation is equivalent to the instantaneous frequency estimation of superpoliteness FM sinusoids. Therefore, we apply established signal processing tools, such as time-frequency representations to show that for each time instant, the energy is concentrated along planes in the 3-D space: spatial frequencies - instantaneous frequency. Using fuzzy C-planes, we estimate indirectly the instantaneous velocities. Furthermore, adapting existing approaches to our problem, we attain the identification of the moving objects. The experimental results verify the effectiveness of our methodology.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:8k81kl-MbHgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Narrow directional steerable filters in motion estimation",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1077314207001129",
            "Abstract": "We extend the mathematical analysis of previous work [M.T. Andersson, Controllable multi-dimensional filters and models in low-level computer vision, Ph.D. Thesis, Department of Electrical Engineering, Linkonping University, Sweden, 1992] and we give rigorous, general, mathematical formulas for the construction of 3-D steerable directional cosine filters of arbitrary higher order. Furthermore, we present the mathematical analysis for the construction of arbitrary narrow, steerable directional quadrature pairs. Incorporating the “Donut Mechanism” of Simoncelli [E.P. Simoncelli, Distributed representation and analysis of visual motion, Ph.D. Thesis, Department of Electrical Engineering and Computer Science, Massachusetts Institute of Technology, 1993] and extending it for quadrature pairs, we present a unified theory and a simple algorithm for using the constructed filters to estimate the motion in image sequences …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Academic Press"
        },
        {
            "Title": "FUZZINESS-DRIVEN EDGE DETECTION BASED ON RENYI'S -ORDER FUZZY ENTROPY",
            "Publication year": 2004,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812702661_0043",
            "Abstract": "This paper presents an algorithm for edge detection in images based on fuzzy sets theory. In order to perform edge detection we exploit the fuzziness present at edge locations in an image. The proposed parametric scheme is based on the notion of the -order entropy of a fuzzy set. The parameter  controls the sensitivity of the algorithm to detect various types of edges. A detailed comparison with the algorithm proposed in [1] is carried out.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:k_IJM867U9cC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A wideband printed dipole antenna with optimized tapered feeding balun for ISM and FWA bands",
            "Publication year": 2004,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mop.20495",
            "Abstract": "This paper presents a wideband printed dipole‐antenna element. The broad bandwidth is achieved by optimization of the feeding network, which is implemented as a microstrip tapered balun. The design is based on double‐sided flat‐dipole implementation. The prototype antenna exhibits a measured impedance bandwidth of 58% (VSWR < 2), operating over the entire 2.4‐GHz ISM and 3.6‐GHz FWA bands. © 2004 Wiley Periodicals, Inc. Microwave Opt Technol Lett 43: 437–441, 2004; Published online in Wiley InterScience (www.interscience.wiley.com). DOI 10.1002/mop.20495",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Wiley Subscription Services, Inc., A Wiley Company"
        },
        {
            "Title": "Ionoacoustic tomography of the proton Bragg peak in combination with ultrasound and optoacoustic imaging",
            "Publication year": 2016,
            "Publication url": "https://www.nature.com/articles/srep29305",
            "Abstract": "Ions provide a more advantageous dose distribution than photons for external beam radiotherapy, due to their so-called inverse depth dose deposition and, in particular a characteristic dose maximum at their end-of-range (Bragg peak). The favorable physical interaction properties enable selective treatment of tumors while sparing surrounding healthy tissue, but optimal clinical use requires accurate monitoring of Bragg peak positioning inside tissue. We introduce ionoacoustic tomography based on detection of ion induced ultrasound waves as a technique to provide feedback on the ion beam profile. We demonstrate for 20 MeV protons that ion range imaging is possible with submillimeter accuracy and can be combined with clinical ultrasound and optoacoustic tomography of similar precision. Our results indicate a simple and direct possibility to correlate, in-vivo and in real-time, the conventional ultrasound echo …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:a0OBvERweLwC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Intuitionistic fuzzy processing of mammographic images",
            "Publication year": 2009,
            "Publication url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781420060614-11/intuitionistic-fuzzy-processing-mammographic-images-ioannis-vlachos-george-sergiadis",
            "Abstract": "The main purpose of this chapter is to extend and adapt the intuitionistic fuzzy image processing (IFIP) framework in the context of mammographic imaging. Intuitionistic fuzzy sets, favored for their ability to cope with the imprecise and imperfect nature of information, successfully handle the intrinsic uncertainty carried by mammographic images. Analytical models are presented for analyzing/synthesizing the images to and from their intuitionistic fuzzy components, based on different notions of intuitionistic fuzzy entropy and intuitionistic defuzzification schemes. Moreover, extensions of fuzzy approaches for contrast enhancement in the intuitionistic fuzzy setting demonstrate the efficiency of the IFIP framework. Finally, experimental results are assessed by objective enhancement evaluation measures that further verify the potential of using intuitionistic fuzzy sets for mammographic image processing.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Chapman and Hall/CRC"
        },
        {
            "Title": "Estimation of linear parametric distortions and motions in the frequency domain",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_189",
            "Abstract": "The image registration and motion estimation problems have been largely studied in the spatial frequency domain. However, most of the existed frequency-domain methodologies consider that themoving objects’ motions can be approximated as simply translational. In this work, we study the linear parametric motion model (affine distortion plus translation) in the spatial frequency domain and we present an algorithm for the estimation of its parameters. The experimental application of the methodology presents promising results.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:7PzlFSSx8tAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "A two-dimensional entropic approach to intuitionistic fuzzy contrast enhancement",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73400-0_40",
            "Abstract": "This paper presents a generalized approach to the intuitionistic fuzzification of gray-scale images. Parametric membership and non-membership functions are applied in order to derive the optimal representation of the image in the intuitionistic fuzzy domain. A two-dimensional intuitionistic fuzzy entropy measure is employed as the optimization criterion for driving the aforementioned procedure. Finally, experimental results demonstrate the ability of the proposed method to efficiently enhance low-contrasted gray-scale images.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:9ZlFYXVOiuMC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Second harmonic acoustic responses induced in matter by quasi continuous radiofrequency fields",
            "Publication year": 2013,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.4824709",
            "Abstract": "We subjected conductive matter and tissue to intermittent continuous-wave radiofrequency fields and investigated whether acoustic responses could be recorded. By placing samples in the near-field of the excitation, we observed frequency-domain acoustic responses from tissues responding to CW radiofrequency excitation. Frequency analysis revealed the generation of 2nd harmonic mechanical waves. This discovery of non-linear responses can lead to alternative measurement concepts of CW radiofrequency deposition in matter and tissues. We offer the theoretical mainframe and discuss sensing applications involving the direct measurement of second harmonic responses representative of CW RF energy deposition in matter.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:g5m5HwL7SMYC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "High resolution imaging with impulse based thermoacoustic tomography",
            "Publication year": 2011,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ECBO-2011-808905",
            "Abstract": "Existing imaging modalities like microwave-or radiofrequency (RF) induced thermoacoustic tomography systems show the potential for resolving structures deep inside tissue due to the high penetration properties of RF. However, one of the major drawbacks of existing thermoacoustic tomography systems with pulse modulated carrier frequency excitation is the compromise between efficient signal generation and attainable spatial resolution. In order to overcome limitations of conventional thermoacoustic imaging methods, we herein present and experimentally validate our novel approach towards high resolution thermoacoustic tomography. Instead of carrier-frequency amplification, we utilize ultrahigh-energy electromagnetic impulses at nanosecond duration with near-field energy coupling, thus maintaining thermoacoustic signal strength without compromising spatial resolution. Preliminary experiments on highly …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:TFP_iSt0sucC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Highly sensitive PZT transducer with integrated miniature amplifier for photoacoustic imaging",
            "Publication year": 2019,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8925854/",
            "Abstract": "The design, fabrication and experimental characterization of a 20MHz lead zirconium titanate (PZT) transducer with integrated monolithic amplifier die for highly sensitive photoacoustic imaging is presented. The miniature amplifier is designed as a rectangular die for close connection to the transducer to match the output impedance to the connecting coaxial cable and provide front-end signal amplification. The measured frequency response of the integrated amplifier shows a wide bandwidth beyond 200 MHz, which is sufficient for wide band detection of photoacoustic signals. Both acoustical measurements and imaging experiments demonstrate that the fabricated prototype is capable of improving the signal-to-noise ratio (SNR) by over 10 dB.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:xtRiw3GOFMkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Sensitivity enhanced photoacoustic imaging using a high-frequency PZT transducer with an integrated front-end amplifier",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/629166",
            "Abstract": "Photoacoustic (PA) imaging is a hybrid imaging technique that can provide both structural and functional information of biological tissues. Due to limited permissible laser energy deposited on tissues, highly sensitive PA imaging is required. Here, we developed a 20 MHz lead zirconium titanate (PZT) transducer (1.5 mm× 3 mm) with front-end amplifier circuits for local signal processing to achieve sensitivity enhanced PA imaging. The electrical and acoustic performance was characterized. Experiments on phantoms and chicken breast tissue were conducted to validate the imaging performance. The fabricated prototype shows a bandwidth of 63% and achieves a noise equivalent pressure (NEP) of 0.24 mPa/√ Hz and a receiving sensitivity of 62.1 μV/Pa at 20 MHz without degradation of the bandwidth. PA imaging of wire phantoms demonstrates that the prototype is capable of improving the detection sensitivity by 10 dB compared with the traditional transducer without integrated amplifier. In addition, in vitro experiments on chicken breast tissue show that structures could be imaged with enhanced contrast using the prototype and the imaging depth range was improved by 1 mm. These results demonstrate that the transducer with an integrated front-end amplifier enables highly sensitive PA imaging with improved penetration depth. The proposed method holds the potential for visualization of deep tissue structures and enhanced detection of weak physiological changes. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:CHSYGLWDkRkC",
            "Publisher": "Multidisciplinary Digital Publishing Institute"
        },
        {
            "Title": "Nondestructive multispectral reflectoscopy between 800 and : An instrument for the investigation of the stratigraphy in paintings",
            "Publication year": 2007,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.2744236",
            "Abstract": "In the present work, a powerful tool for the investigation of paintings is presented. This permits the tuneable multispectral real time imaging between 200 and 5000nm and the simultaneous multispectral acquisition of spectroscopic data from the same region. We propose the term infrared reflectoscopy for tuneable infrared imaging in paintings (Chryssonlakis and Chassery, The Application of Physicochemical Methods of Analysis and Image Processing Techniques to Painted Works of Art, Erasmus Project ICP-88-006-6, Athens, June, 1989) for a technique that is effective especially when the spectroscopic data acquisition is performed between 800 and 1900nm. Elements such as underdrawings, old damage that is not visible to the naked eye, later interventions or overpaintings, hidden signatures, nonvisible inscriptions, and authenticity features can thus be detected with the overlying paint layers becoming …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:ufrVoPGSRksC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "On the intuitionistic defuzzification of digital images for contrast enhancement",
            "Publication year": 2006,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812774118_0107",
            "Abstract": "This paper addresses the issue of the intuitionistic defuzzification of digital images. Based on a recently introduced framework for intuitionistic fuzzy image processing, the validity conditions and properties of different intuitionistic defuzzification schemes are studied under the scope of performing contrast enhancement.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Near‐field thermoacoustic imaging with transmission line pulsers",
            "Publication year": 2012,
            "Publication url": "https://aapm.onlinelibrary.wiley.com/doi/abs/10.1118/1.4729710",
            "Abstract": "Near‐field radiofrequency thermoacoustic (NRT) tomography has been recently introduced for imaging electromagnetic (EM) properties of tissues using ultrawideband, high‐energy impulses, which induce thermoacoustic responses. Operation in the near‐field allows for more effective energy coupling into tissue, compared to using radiating sources, which in turn enables the use of shorter excitation pulses and leads to higher image resolution. This work aimed at investigating transmission lines as a method to generate excitation pulses to improve the NRT resolution over previous implementations without compromising the energy coupled into tissue.The authors implemented a number of custom‐made transmission lines to overcome the challenges of the broadband nature of the impulse excitation required in NRT. The authors further constructed phantoms and investigated the performance of …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:RGFaLdJalmkC",
            "Publisher": "American Association of Physicists in Medicine"
        },
        {
            "Title": "Enhanced ulcer recognition from capsule endoscopic images using texture analysis",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=kOOZDwAAQBAJ&oi=fnd&pg=PA185&dq=info:llPFl5nO_A0J:scholar.google.com&ots=LdTu9OGXL6&sig=PN-2Ou-KrBlHloa6AxmM69bJ8io",
            "Abstract": "The five senses constitute some of the most substantial elements of the human nature. Beyond their importance in daily life and perception of the world, they play crucial role in knowledge acquisition as well. For instance, medicine was one of the first domains where the conceptual tools of rationality and empiricism were combined with techniques of investigation to make the human body an object of knowledge (Foucault, 1973). In this context, the techniques mentioned above are based on the application of senses in order to acquire medical knowledge. More precisely, vision and hearing became specific objects of knowledge over the course of the 19th century, supplemented through technique and technology. Thus, seeing and hearing are to be understood as fundamentally and absolutely different modes of not only knowing the world, but also reaching a medical diagnosis.A branch of medicine closely associated with one of these techniques, namely visual inspection, is gastroenterology. In the field of gastroenterology, vision is widely understood as the fundamental mode of knowing the state of the gastrointestinal (GI) tract. The advent of medical imaging technologies, such as radiography (in the wider sense), tomography and especially endoscopy, promoted this thesis (Lorenz et al., 1993; Rutgeerts et al., 1980) by enabling the visual examination without demanding to gain physical access. In case of visual inspection, as in case of auscultation, there are specific properties observed in order to assess the image content, no matter how simple or sophisticated the imaging technology is. During a stethoscope examination, for instance, the …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:-f6ydRqryjwC",
            "Publisher": "Croatia: InTech"
        },
        {
            "Title": "Ulcer detection in wireless capsule endoscopy images using bidimensional nonlinear analysis",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-13039-7_59",
            "Abstract": "Wireless Capsule Endoscopy (WCE) constitutes a recent technological breakthrough that enables the observation of the gastrointestinal tract (GT) and especially the entire small bowel in a non-invasive way compared to the traditional imaging techniques. WCE allows a detailed inspection of the intestine and identification of its clinical lesions. However, the main drawback of this method is the time consuming task of reviewing the vast amount of images produced. To address this, a novel technique for discriminating abnormal endoscopic images related to ulcer, the most common disease of GT, is presented here. Towards this direction, the Bidimensional Ensemble Empirical Mode Decomposition (BEEMD) was applied to images of the small bowel acquired by a WCE system in order to extract their Intrinsic Mode Functions (IMFs). The IMFs reveal differences in structure from their finest to their coarsest scale …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Fast histogram-based brain segmentation from T1-weighted MR images using morphological processing and geometric criteria",
            "Publication year": 2014,
            "Publication url": "https://www.physicamedica.com/article/S1120-1797(14)00417-7/abstract",
            "Abstract": "Background-approach: Segmentation of brain from three-dimensional magnetic resonance (MR) head images has always attracted significant research and clinical interest. Current MR-based brain segmentation techniques, although accurate, are complex and time-consuming for certain applications. This work proposes a fast, automated and accurate technique for whole-brain segmentation from T1-weighted MR images towards brain volume measurement for potential identification of statistically significant differences between healthy individuals and patients.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:3s1wT3WcHBgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A novel method for non-destructive stratigraphy determination of artworks using acoustic microscopy and UV/VIS/nIR spectroscopy",
            "Publication year": 2007,
            "Publication url": "https://scholar.google.com/scholar?cluster=17102160486370001486&hl=en&oi=scholarr",
            "Abstract": "(2) where o I is the spectrum of the incident radiation, mb 1b H, H are vectors and di represents the thickness of each sub-layer. The simulated spectra are calculated using Eq. 2, the transfer functions obtained from the spectral responses of the reference panels, the number of the successive paint layers and their thickness values.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "An efficient representation of combined indoor/outdoor 3D mobile radio-coverage",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1353764/",
            "Abstract": "This paper describes an efficient method for visualizing the simulated received power levels at a specified site in the form of equipower scatter plots. This approach provides an easy way for inspecting the actual radio-coverage limits of a mobile network, for a specified reception threshold. For an increased degree of accuracy to be achieved, a ray launching technique has been implemented for the propagation simulations. The representation is applicable to both indoor and outdoor applications.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:qUcmZB5y_30C",
            "Publisher": "IET"
        },
        {
            "Title": "Parametric indices of fuzziness for automated image enhancement",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165011405005853",
            "Abstract": "This paper presents an automated fuzziness-driven algorithm for image enhancement. A class of parametric indices of fuzziness is introduced, which serves as the optimization criterion of the contrast-enhancement procedure. We show that the parametric class of indices constitutes a one-parameter generalization of the linear index of fuzziness of a set. The modification of the membership values of image pixels in the fuzzy plane is performed by finding the optimal S-function, which maximizes the parametric index of fuzziness (PIF). The first-order fuzzy moment of the image is used for tuning the PIF. Experimental results demonstrate the efficiency of the proposed framework in enhancing even highly low-contrasted images and also its ability to improve existing contrast-enhancing algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:qjMakFHDy7sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Pulse shaping for localized magnetic resonance tagging",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1017229/",
            "Abstract": "Magnetic resonance tagging is usually achieved by means of a train of non-selective radio-frequency pulses separated by gradient pulses. Thus, the modulation of the M/sub 2/ magnetization component expands all over the imaging plane. It has been proposed that the use of selective excitation pulses may limit the modulation only to regions of interest, thus preserving anatomical data in the rest of the image. In this paper, we intend to expand the tagging k-space concept in order to account for pulse selectivity, and offer a prediction and design tool for localized MR tagging sequences.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:blknAaTinKkC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Intuitionistic fuzzy information–applications to pattern recognition",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167865506001905",
            "Abstract": "This paper addresses the issue of information-theoretic discrimination measures for intuitionistic fuzzy sets (IFSs). Although many measures of distance, similarity, dissimilarity, and correlation between IFSs have been proposed, there is no reference regarding information-driven measures used for comparison between sets. In this work we introduce the concepts of discrimination information and cross-entropy in the intuitionistic fuzzy setting and we derive an extension of the De Luca–Termini nonprobabilistic entropy for IFSs. Based on this entropy, we reveal an intuitive and mathematical connection between the notions of entropy for fuzzy sets (FSs) and IFSs in terms of fuzziness and intuitionism. Finally, we demonstrate the efficiency of the proposed discrimination information measure for pattern recognition, medical diagnosis, and image segmentation.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:u5HHmVD_uO8C",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Seismic risk of inter-urban transportation networks",
            "Publication year": 2014,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2212567114009393",
            "Abstract": "The paper presents a holistic approach for assessing and managing the seismic risk and potential loss in inter-urban highway networks in earthquake-prone areas. The vulnerability of all elements of the intercity transportation system (i.e., roads, bridges, abutments, retaining walls, and tunnels) is assessed considering the interdependency among the structural, transportational and geotechnical components of the network under different seismic scenarios. Both the direct earthquake-induced damage, as well as the indirect socio-economic loss attributed to reduced network functionality are taken into account in an explicit and transparent formulation that is then displayed in space through an ad-hoc developed GIS-based software. The methodology and the decision-making tools developed are adequately modular, for them to be utilized after appropriate adaptation by local authorities in identifying, prior to a major …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:KxtntwgDAa4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Towards intuitionistic fuzzy image processing",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1631233/",
            "Abstract": "This paper discusses the issue of applying the theory of intuitionistic fuzzy sets in the field of image processing. In order to carry out this task, we have to find intuitive ways to interpret and describe the inherent ambiguity and vagueness carried by the image itself in terms of the elements of intuitionistic fuzzy sets theory. We consider the problem of constructing the intuitionistic fuzzy set corresponding to a digital image, by exploiting the inherent imprecision or/and imperfection of information originating out of the imaging and acquisition chain. This action involves the definition of suitable membership and non-membership functions, by treating the term \"brightness\" of a gray level in a \"qualitative\" rather than a \"quantitative\" way. To model the hesitancy present in digital images, the notion of fuzzy histogram is used based on fuzzy numbers. Finally, experimental results using real-world images, demonstrate the ability of …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:IjCSPb-OGe4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "A Rotational Approach to Localized SPAMM 1–1 Tagging",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780702925917",
            "Abstract": "Magnetic resonance tagging usually relies on controlling the phase dispersion of the transverse magnetization component. Phase dispersion is, however, affected by the inherent phase of selective excitation pulses, thus limiting their combination with tagging sequences to the application of refocusable pulses, as in the localized spatial modulation of magnetization (L-SPAMM) technique. In this study, we examine the effect of selective excitation pulses on a L-SPAMM 1–1 sequence, showing that in the case of two identical pulses the phase component is canceled out, and thus preemphasis and refocus gradients are not needed, allowing us to take advantage of a constant gradient throughout the tagging sequence, and also that one might choose nonrefocusable maximum and minimum phase pulses.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:4DMP91E08xMC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Fuzzy reasoning scheme for edge detection using local edge information based on Renyi's entropy",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1224762/",
            "Abstract": "In this paper we present a robust approach to edge detection using fuzzy reasoning. In order to implement the fuzzy inference system a novel entropic local edge information measure is introduced based on Renyi's a-order entropy. The calculation of the proposed measure is carried out using a parametric classification scheme based on local statistics. By suitable tuning its parameter, the local edge information measure is capable of preserving edge information while exhibiting high immunity to noise. The proposed fuzzy system is able to successfully detect edges in images corrupted by noise. The effectiveness and the robustness of the new method are demonstrated by applying our algorithm to noisy images. Performance assessment is based on comparison of the results derived using the proposed method with those obtained using various existing edge-detection algorithms.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Comment on:\" Image thresholding using type II fuzzy sets\"",
            "Publication year": 2008,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2008PatRe..41.1810V/abstract",
            "Abstract": "This short comment aims at providing connections between the algorithm for image thresholding using type II fuzzy sets, recently proposed by Tizhoosh in Ref.[1], and Atanassov's intuitionistic fuzzy sets (A-IFSs), as well as pointing out some terminological issues. The idea of applying higher-order fuzzy sets for image thresholding discussed in Ref.[1] is interesting and promising; however, some clarifications have to be stressed out regarding the underlying theoretical treatment of the proposed approach. Before proceeding, the basic definitions and concepts used throughout this comment are briefly presented.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:WF5omc3nYNoC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Human brain inspired still and moving image processing",
            "Publication year": 2010,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5548499/",
            "Abstract": "Even the tiniest fly has faster analysis and processing capabilities than most of our complex calculating devices. Real time processing and recognition capability by the human brain of both still and moving images is well beyond any known artificial computer based system. Our research team tried to explore some still and moving image processing techniques that are better suited to be used by biological computers, or brains, in an effort to benefit from Nature's experience and wealth. Intuitionistic fuzzy image processing, spatiotemporal motion estimation approaches and hypercomplex color image processing are among them.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:RYcK_YlVTxYC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Estimation of wall-scattering in the urban canyon",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5068154/",
            "Abstract": "Recent measurements have shown that the scattered field from the buildings' facades can greatly affect the magnitude, the delay spread and the angular spread of the received field inside the ldquourban canyonrdquo. In this paper a model that estimates the net scattered field by a single facade is derived, assuming that the building's wall comprises numerous identical elementary scatterers (e.g. windows) with known scattering gain function. The proposed model can be easily implemented in a ray-tracing propagation prediction tool, thanks to its simplicity and the small estimation time.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Transmission line based thermoacoustic imaging of small animals",
            "Publication year": 2013,
            "Publication url": "https://www.osapublishing.org/abstract.cfm?uri=ecbo-2013-88000D",
            "Abstract": "We have generated high resolution images of RF-Contrast in small animals using near-field thermoacoustic system. This enables us to see some anatomical features of a mouse such as the heart, the spine and the boundary.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:2P1L_qKh6hAC",
            "Publisher": "Optical Society of America"
        },
        {
            "Title": "Intuitionistic fuzzy histogram hyperbolization for color images",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73400-0_41",
            "Abstract": "In this paper an extension of the Intuitionistic Fuzzy Image Processing (IFIP) framework from gray-scale to color images is presented. Analysis and synthesis of images into their corresponding intuitionistic fuzzy components is demonstrated using a suitable color model. Additionally, application of the proposed framework to histogram hyperbolization is also shown. Finally, experimental results demonstrate the efficiency of the proposed scheme.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:L8Ckcad2t8MC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Capsule endoscopy image analysis using texture information from various colour models",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0169260711002689",
            "Abstract": "Wireless capsule endoscopy (WCE) is a novel imaging technique that is gradually gaining ground as it enables the non-invasive and efficacious visualization of the digestive track, and especially the entire small bowel including its middle part. However, the task of reviewing the vast amount of images produced by a WCE examination is a burden for the physicians. To tackle this major drawback, an innovative scheme for discriminating endoscopic images related to one of the most common intestinal diseases, ulceration, is presented here. This new approach focuses on colour–texture features in order to investigate how the structure information of healthy and abnormal tissue is distributed on RGB, HSV and CIE Lab colour spaces. The WCE images are pre-processed using bidimensional ensemble empirical mode decomposition so as to facilitate differential lacunarity analysis to extract the texture patterns of normal …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:_kc_bZDykSQC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Continuous wave laser diodes enable fast optoacoustic imaging",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S2213597917300356",
            "Abstract": "Pulsed laser diodes may offer a smaller, less expensive alternative to conventional optoacoustic laser sources; however they do not provide pulse rates faster than a few tens of kHz and emit at wavelengths only within the near-infrared region. We investigated whether continuous wave (CW) laser diodes, which are available in visible and near-infrared regions, can be good optoacoustic light sources when overdriven with a peak current >40-fold higher than the CW absolute maximum. We found that overdriven CW diodes provided ∼10 ns pulses of ∼200 nJ/pulse and repetition rates higher than 600 kHz without being damaged, outperforming many pulsed laser diodes. Using this system, we obtained images of phantoms and mouse ear and human arm in vivo, confirming their use in optoacoustic imaging and sensing.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:bFI3QPDXJZMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "150: Experimental characterization of acoustic detection and imaging for Bragg peak localization in proton therapy",
            "Publication year": 2014,
            "Publication url": "https://www.infona.pl/resource/bwmeta1.element.elsevier-8aed49bb-ef0b-3791-ba82-7a1da9ad1699",
            "Abstract": "150: Experimental characterization of acoustic detection and imaging for Bragg peak \nlocalization in proton therapy × Close The Infona portal uses cookies, ie strings of text saved by \na browser on the user's device. The portal can access those files and use them to remember the \nuser's data, such as their chosen settings (screen view, interface language, etc.), or their login \ndata. By using the Infona portal the user accepts automatic saving and using this information \nfor portal operation purposes. More information on the subject can be found in the Privacy \nPolicy and Terms of Service. By closing this window the user confirms that they have read the \ninformation on cookie usage, and they accept the privacy policy and the way cookies are used \nby the portal. You can change the cookie settings in your browser. I accept Polski English \nLogin or register account remember me Password recovery INFONA - science portal INFONA …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:zA6iFVUQeVQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Intrinsic higher-order correlation and lacunarity analysis for WCE-based ulcer classification",
            "Publication year": 2012,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6266356/",
            "Abstract": "Wireless capsule endoscopy (WCE) is a revolutionary, patient-friendly imaging technique that enables non-invasive visual inspection of the patient's digestive tract, especially small intestine. However, the time-consuming task of reviewing the endoscopic data is a burden for the physicians. This limitation was the motive to propose a novel strategy for automatic discrimination of WCE images related to ulcer, the most common finding of digestive tract. Towards this direction, WCE data are processed with Bidimensional Ensemble Empirical Mode Decomposition to reveal their inherent structural components, and also to reconstruct a new refined image. Then, texture information is extracted by analyzing the intrinsic second/higher-order correlation of the original image and by calculating the lacunarity index of the refined image. Experimental results demonstrated promising classification accuracy (97%) exhibiting high …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:O3NaXMp0MMsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Diffuse reflectance spectroscopic mapping imaging applied to art objects materials determination from 200 up to 5000 nm",
            "Publication year": 2010,
            "Publication url": "https://aip.scitation.org/doi/abs/10.1063/1.3497303",
            "Abstract": "The microsampling destructions caused by the sampling of analytical spectroscopic methods are generally not permitted to art objects. Consequently, the development of nondestructive analysis techniques is a necessity. In this work we present a set of signal processing and artificial intelligence techniques which support the operation of a novel device developed for the nondestructive identification of art objects. The proposed device combines ultraviolet, visible, near infrared, and midinfrared spectroscopy in diffuse reflectance mode to identify the materials that exist in each paint layer of an artwork.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:KlAtU1dfN6UC",
            "Publisher": "American Institute of Physics"
        },
        {
            "Title": "Subsethood, entropy, and cardinality for interval-valued fuzzy sets—an algebraic derivation",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0165011406005574",
            "Abstract": "In this paper a unified formulation of subsethood, entropy, and cardinality for interval-valued fuzzy sets (IVFSs) is presented. An axiomatic skeleton for subsethood measures in the interval-valued fuzzy setting is proposed, in order for subsethood to reduce to an entropy measure. By exploiting the equivalence between the structures of IVFSs and Atanassov's intuitionistic fuzzy sets (A-IFSs), the notion of average possible cardinality is presented and its connection to least and biggest cardinalities, proposed in [E. Szmidt, J. Kacprzyk, Entropy for intuitionistic fuzzy sets, Fuzzy Sets and Systems 118 (2001) 467–477], is established both algebraically and geometrically. A relation with the cardinality of fuzzy sets (FSs) is also demonstrated. Moreover, the entropy-subsethood and interval-valued fuzzy entropy theorems are stated and algebraically proved, which generalize the work of Kosko [Fuzzy entropy and conditioning …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:u-x6o8ySG0sC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "Estimation of multiple accelerated motions using chirp-Fourier transform and clustering",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4032802/",
            "Abstract": "Motion estimation in the spatiotemporal domain has been extensively studied and many methodologies have been proposed, which, however, cannot handle both time-varying and multiple motions. Extending previously published ideas, we present an efficient method for estimating multiple, linearly time-varying motions. It is shown that the estimation of accelerated motions is equivalent to the parameter estimation of superpositioned chirp signals. From this viewpoint, one can exploit established signal processing tools such as the chirp-Fourier transform. It is shown that accelerated motion results in energy concentration along planes in the 4-D space: spatial frequencies-temporal frequency-chirp rate. Using fuzzy c-planes clustering, we estimate the plane/motion parameters. The effectiveness of our method is verified on both synthetic as well as real sequences and its advantages are highlighted",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Lacunarity-based inherent texture correlation approach for wireless capsule endoscopy image analysis",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-00846-2_74",
            "Abstract": "Wireless capsule endoscopy (WCE) is a novel technology that offers non-invasive visual inspection of the digestive tract (DT) and especially small bowel. However, the revision of the large amount of images produced is highly time-consuming and prone to human error. This weakness was the rationale to propose a novel strategy for automatic detection of WCE images related to ulcer, one of the most common findings of DT. This paper introduces a new texture extraction method based on the inherent texture correlation measure and lacunarity index. WCE data are pre-processed with Bidimensional Ensemble Empirical Mode Decomposition to reveal their congenital structure primitives, and also to adaptively reconstruct new refined images. Classification results demonstrated promising classification accuracy (89.1%) exhibiting high potential towards further research in this field.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:ldfaerwXgEUC",
            "Publisher": "Springer, Cham"
        },
        {
            "Title": "On the entropy of intuitionistic fuzzy events",
            "Publication year": 2005,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1631460/",
            "Abstract": "This paper introduces the notion of entropy of intuitionistic fuzzy events. Based on the concept of probability of events in the intuitionistic fuzzy setting, we propose different entropy definitions. These entropies constitute a generalization of the corresponding definitions for fuzzy events. Moreover, their properties are thoroughly studied and their connections are investigated. Finally, relations between the concepts of probability and entropy for fuzzy and intuitionistic fuzzy events are stated and proved",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:R3hNpaxXUhUC",
            "Publisher": "IEEE"
        },
        {
            "Title": "AUTOMATED IMAGE ENHANCEMENT ALGORITHM BASED ON OPTIMIZATION OF GENERALIZED FUZZY ENTROPIES (GFEs)",
            "Publication year": 2002,
            "Publication url": "https://www.worldscientific.com/doi/abs/10.1142/9789812777102_0034",
            "Abstract": "This paper presents a novel automated entropy-domain algorithm for contrast enhancement based on fuzzy sets theory. In view of performing contrast enhancement a novel class of generalized fuzzy entropies (GFEs) is introduced as an extension of the classical definition of entropy of a fuzzy set. The definition of entropy contrast is also carried out for evaluating the uniformity of distribution of the informational content over the total gray-level range of the image. In the first stage of the algorithm the image is transferred into the fuzzy domain and a set of optimal transformation parameters, based on Yager class of involutive membership functions, is calculated in accordance with maximum entropy principle. Using the notion of entropy contrast as an optimization criterion, the overall optimal gray-level modification parameter is obtained. The proposed algorithm provides a self-contained framework for dealing with image …",
            "Abstract entirety": 0,
            "Author pub id": "TmGjsAoAAAAJ:hMod-77fHWUC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Improved Shinnar–Le Roux algorithm",
            "Publication year": 2000,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1090780799919651",
            "Abstract": "Selective excitation pulses are widely used in magnetic resonance imaging in order to excite predetermined slices of the body under examination. Such pulses are optimally designed by means of the Shinnar–Le Roux algorithm. In this paper, we show that under minimal assumptions, the complexity and computing cost of the original Shinnar–Le Roux algorithm can be drastically reduced. We further propose an improved version of the algorithm, involving only real quantities, which is both easier to implement and faster to execute, so it is suitable for implementation at the hardware level, in the context of a real-time fully digital magnetic resonance transceiver.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Low-cost wideband antenna arrays on glass substrate for ism band applications",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5067847/",
            "Abstract": "In this paper we present the methodology and guidelines for the fabrication of wideband planar antenna arrays, for ISM band applications. The fabrication is carried-out by hand using off-the-shelf components, ensuring an extremely low-cost process and rapid prototyping. The methodology is addressed to radio amateurs, or less skilled individuals wishing to deploy WLAN networks in a quick and inexpensive manner.",
            "Abstract entirety": 1,
            "Author pub id": "TmGjsAoAAAAJ:mB3voiENLucC",
            "Publisher": "IEEE"
        }
    ]
}]