[{
    "name": "Γιώργος Γεωργακόπουλος",
    "romanize name": "Giorgos Georgakopoulos",
    "School-Department": "Επιστήμης Υπολογιστών",
    "University": "uoc",
    "Rank": "Αναπληρωτής Καθηγητής",
    "Apella_id": 7075,
    "Scholar name": "George Georgakopoulos",
    "Scholar id": "AkCowUsAAAAJ",
    "Affiliation": "Unknown affiliation",
    "Citedby": 429,
    "Scholar url": "https://scholar.google.com/citations?user=AkCowUsAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "How to Splay for loglogN-Competitiveness",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11427186_49",
            "Abstract": "We present an extension of the splay technique, the chain-splay. Chain-splay trees splay the accessed element to the root exactly as classic splay trees do, but also perform some local ‘house-keeping’ splay operations below the accessed element. We prove that chain-splay is loglogN-competitive to any off-line searching algorithm. This result is the nearest point to dynamic optimality of splay trees reached since 1983.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "The curve equipartition problem",
            "Publication year": 2005,
            "Publication url": "https://www.csd.uoc.gr/~cpanag/papers/EP.pdf",
            "Abstract": "In this paper, we analyze the general problem of a continuous curve partition into equal length segments, defined by any smooth distance metric, like the Euclidean distance. The goal is to locate N− 1 consecutive curve points, so that the curve can be divided into N equal length segments. First, it is proved that for any curve C and any number N there always exists at least one N-equipartition (EP) of C. The approach adopted for the proof can be used to compute at least one solution of the problem or all the solutions using a greedy version of this method. These methods have only theoretical value, as there appear algebraic expressions exponentially with increasing degree N. This can be explained by our proof that a version of the EP problem is NP-hard. So, the EP is possibly complete for the NP class. However, an O (N) approximate proof based algorithm can solve the problem with high accuracy. Moreover, we propose two algorithms, an algorithm that computes approximately all the solutions and a steepest descent based method that converges to one of them. Some possible applications are also discussed.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:zYLM7Y9cAGgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nash equilibria in all-optical networks",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11600930_104",
            "Abstract": "We consider the problem of routing a number of communication requests in WDM (wavelength division multiplexing) all-optical networks from the standpoint of game theory. If we view each routing request (pair of source-target nodes) as a player, then a strategy consists of a path from the source to the target and a frequency (color). To reflect the restriction that two requests must not use the same frequency on the same edge, conflicting strategies are assigned a prohibitively high cost.Under this formulation, we consider several natural cost functions focusing on the existence of Nash equilibria and on the complexity of recognizing and computing them.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:5nxA0vEk-isC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Nash equilibria in all-optical networks",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0012365X09000168",
            "Abstract": "We consider the problem of routing a number of communication requests in WDM (wavelength division multiplexing) all-optical networks from the standpoint of game theory. If we view each routing request (pair of source-target nodes) as a player, then a strategy consists of a path from the source to the target and a frequency (color). To reflect the restriction that two requests must not use the same frequency on the same edge, conflicting strategies are assigned a prohibitively high cost.Under this formulation, we consider several natural cost functions, each one reflecting a different aspect of restriction in the available bandwidth. For each cost function we examine the problem of the existence of pure Nash equilibria, the complexity of recognizing and computing them and finally, the problem in which we are given a Nash equilibrium and we are asked to find a better one in the sense that the total bandwidth used is less …",
            "Abstract entirety": 0,
            "Author pub id": "AkCowUsAAAAJ:_FxGoFyzp5QC",
            "Publisher": "North-Holland"
        },
        {
            "Title": "A data driven approach reveals disease similarity on a molecular level",
            "Publication year": 2019,
            "Publication url": "https://www.nature.com/articles/s41540-019-0117-0",
            "Abstract": "Could there be unexpected similarities between different studies, diseases, or treatments, on a molecular level due to common biological mechanisms involved? To answer this question, we develop a method for computing similarities between empirical, statistical distributions of high-dimensional, low-sample datasets, and apply it on hundreds of-omics studies. The similarities lead to dataset-to-dataset networks visualizing the landscape of a large portion of biological data. Potentially interesting similarities connecting studies of different diseases are assembled in a disease-to-disease network. Exploring it, we discover numerous non-trivial connections between Alzheimer’s disease and schizophrenia, asthma and psoriasis, or liver cancer and obesity, to name a few. We then present a method that identifies the molecular quantities and pathways that contribute the most to the identified similarities and could point to …",
            "Abstract entirety": 0,
            "Author pub id": "AkCowUsAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Nature Publishing Group"
        },
        {
            "Title": "Precedence constrained scheduling: a case in P",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8129646/",
            "Abstract": "‘Unit execution time’ precedence constrained scheduling (UET) is an NP-complete problem with very few special cases known to be solvable in P-time. In this article we present a practically useful case of UET solvable in P-time: we show that if the task graph is given in levels that are ‘locally’ of in-degree two and of ‘width’ more than 1.55 times the number of processors (plus 1), then an optimal schedule can be found in P-time. Task graphs which represent algebraic computations fall ordinarily in this category. Our algorithm is based on a limited look-ahead technique which allows us to use it in an on-line fashion. In the appendix we give two short NP-completeness proofs which suggest that both ‘width’ and ‘degree’ restrictions are needed to get a polynomially solvable subcase.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:qjMakFHDy7sC",
            "Publisher": "OUP"
        },
        {
            "Title": "Sphendamnœ: A Proof that k-Splay Fails to Achieve logkN Behaviour",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-38076-0_31",
            "Abstract": "The “splay” technique was introduced to cope with biasedness or changeability in data access frequencies, achieving optimality within a small constant factor w.r.t. static trees, without sacrificing log N worst-case behaviour, in an amortized sense. It achieves this through a series of local transformations, starting from the search node and propagating upwards along the search path to the root. It seems plausible that a similar policy, suitably adapted to multi-way trees, could achieve logk N amortized performance (nodes visited), where k is the degree of the tree. Sherk’s k-splay, a generalization of Sleator and Tarjan’s splay technique to multi-way trees, proved to exhibit amortized log2 N behaviour, could be considered the most likely candidate for a multi-way splay-like self-adjusting policy with logk N amortized complexity. We construct a family of k-ary trees having depth k and …",
            "Abstract entirety": 0,
            "Author pub id": "AkCowUsAAAAJ:8k81kl-MbHgC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Max-density revisited: a generalization and a more efficient algorithm",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8140056/",
            "Abstract": "We present an algorithm that given a graph computes a subgraph of maximum ‘density’. (For unweighed graphs, density is the edges-to-vertices ratio). The proposed algorithm is asymptotically more efficient than the currently available ones. Our approach remains efficient for weighed graphs and more generally for weighed set-systems. Two faster approximation algorithms are offered, and a number of applications are discussed.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:9yKSN-GCB0IC",
            "Publisher": "OUP"
        },
        {
            "Title": "Available online at www. sciencedirect. com",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=8966429445354923843&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Capsule Reviews",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/comjnl/article-abstract/47/1/1/656861",
            "Abstract": "The Capsule Reviews are intended to provide a short succinct review of each paper in the issue, in order to bring the content to a wider readership. This issue's Capsule Reviews were compiled by Fairouz Kamareddine. Professor Kamareddine is an Associate Editor of The Computer Journal and is based in the School of Mathematical and Computer Sciences at Heriot-Watt University, Edinburgh, UK.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:KlAtU1dfN6UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PoweRGen: A power-law based generator of RDFS schemas",
            "Publication year": 2012,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0306437911001141",
            "Abstract": "As the amount of RDF datasets available on the Web has grown significantly over the last years, scalability and performance of Semantic Web (SW) systems are gaining importance. Current RDF benchmarking efforts either consider schema-less RDF datasets or rely on fixed RDFS schemas. In this paper, we present the first RDFS schema generator, termed PoweRGen, which takes into account the features exhibited by real SW schemas. It considers the power-law functions involved in (a) the combined in-and out-degree distribution of the property graph (which captures the domains and ranges of the properties defined in a schema) and (b) the out-degree distribution of the transitive closure (TC) of the subsumption graph (which essentially captures the class hierarchy). The synthetic schemas generated by PoweRGen respect the power-law functions given as input with an accuracy ranging between 89 and 96%, as …",
            "Abstract entirety": 0,
            "Author pub id": "AkCowUsAAAAJ:UeHWp8X0CEIC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Krzysztof Diks, Pierre Fraigniaud, Evangelos Kranakis, and Andrzej Pelc. Tree",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=10386969518707873495&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:roLk4NBRz8UC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Nash equilibria as a fundamental issue concerning network-switches design",
            "Publication year": 2004,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1312667/",
            "Abstract": "We view the 'packet-switching problem' (from N inputs towards N outputs) from the perspective of game theory and we prove that, if the rates of flows are weighed then 'weighed max-min fair service rates' are the unique Nash equilibrium point of a natural strategic game in which throughput is granted on a 'least-demanding first-served' principle. We prove that a crossbar switching device with suitably randomized schedulers converges to this equilibrium point without pre-computing it.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Generalized template splay: A basic theory and calculus",
            "Publication year": 2004,
            "Publication url": "https://academic.oup.com/comjnl/article-abstract/47/1/10/656864",
            "Abstract": "We generalize the technique of classic splay trees of Sleator and Tarjan, showing that almost all template-based rules for self-adjusting a multi-way tree have logarithmic amortized cost and other properties of splay trees, such as ‘static optimality’, the ‘static finger’ and ‘working set’ properties. We achieve this by defining in a new way (through ‘progress factors’) a potential on a weighted tree, and by introducing a new technique (which we call ‘± calculus’) for calculating the changes in potential.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:WF5omc3nYNoC",
            "Publisher": "Oxford University Press"
        },
        {
            "Title": "Splay trees: a reweighing lemma and a proof of competitiveness vs. dynamic balanced trees",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0196677403001573",
            "Abstract": "We give a new lemma (dynamic reweighing) about splay trees and we define a class of dynamically self-adjusted trees ( parametrically balanced) wide enough to include BB(α), AVL, rank-balanced and B-trees. Using our lemma we prove that splay trees are competitive to any such class of dynamic trees—noticing that so far splay trees had been proven competitive only w.r.t. static structures like trees and sorted tables with a finger, or exponentially faster than dynamic linear structures like a ‘move-to-front’ self-adjusting list. (Note: A class of dynamic trees achieving the dynamic finger property can be designed, and splay trees have been shown to have this property also.) Finally, we extend these results to generalized splay trees.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:u-x6o8ySG0sC",
            "Publisher": "Academic Press"
        },
        {
            "Title": "Few buffers suffice: Explaining why and how crossbars with weighted fair queuing converge to weighted max-min fairness",
            "Publication year": 2003,
            "Publication url": "https://ics.forth.gr/carv/bufxbar/bxb_WFQs_ggeo_03-07.pdf",
            "Abstract": "We explain why and how a crossbar switch with weighted fair queues (a deterministic device) converges to weighted max-min fair rates of service. Based on a plausible technical hypothesis we prove that a small mean number of buffers suffices to this end. WMMF-rates comprise the unique Nash equilibrium of a natural switching game—a fact that supports further their use.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:LkGwnXOMwfcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Chain-splay trees, or, how to achieve and prove loglogN-competitiveness by splaying",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0020019007002840",
            "Abstract": "We present an extension of the splay technique, the chain-splay. Chain-splay trees ‘splay’the accessed element to the root as classical splay trees do, but also perform some local ‘house-keeping’splay operations below the accessed element. We prove that chain-splay is log log N-competitive to any off-line algorithm that maintains a binary search tree with rotations. This result is the nearest point to the dynamic optimality that splay trees have reached since 1983.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:hqOjcs7Dif8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Buffered cross-bar switches, revisited: Design steps, proofs and simulations towards optimal rate and minimum buffer memory",
            "Publication year": 2008,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4460578/",
            "Abstract": "Regarding the packet-switching problem, we prove that the weighed max-min fair service rates comprise the unique Nash equilibrium point of a strategic game, specifically a throughput auction based on a ldquoleast-demanding first-servedrdquo principle. We prove that a buffered crossbar switch can converge to this equilibrium with no pre-computation or internal acceleration, with either randomized or deterministic schedulers, (the latter with a minimum buffering of a single - packet per crosspoint). Finally, we present various simulation results that corroborate and extend our analysis.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:3fE2CSJIrl8C",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the curve equipartition problem: a brief exposition of basic issues",
            "Publication year": 2006,
            "Publication url": "http://users.tem.uoc.gr/~mkaravel/files/EuroCG06Proc.pdf#page=41",
            "Abstract": "We describe briefly the problem of partitioning a continuous curve into N parts with equal chords.(The length of a chord may be defined by any smooth distance metric applied on its endpoints-the Euclidean metric being one of them.) A have proved that a decision variation of this problem is NP-complete, yet for any continuous curve and any N there always exists at least one equipartition. In this work, we propose an approximate algorithm and also a steepest descent method that converges to an exact solution.",
            "Abstract entirety": 1,
            "Author pub id": "AkCowUsAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Unknown"
        },
        {
            "Title": "On the synthetic generation of semantic web schemas",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-70960-2_6",
            "Abstract": "In order to cope with the expected size of the Semantic Web (SW) in the coming years, we need to benchmark existing SW tools (e.g., query language interpreters) in a credible manner. In this paper we present the first RDFS schema generator, termed PoweRGen, which takes into account the morphological features that schemas frequently exhibit in reality. In particular, we are interested in generating synthetically the two core components of an RDFS schema, namely the property (relationships between classes or attributes) and the subsumption (subsumption relationships among classes) graph. The total-degree distribution of the former, as well as the out-degree distribution of the Transitive Closure (TC) of the latter, usually follow a power-law. PoweRGen produces synthetic property and subsumption graphs whose distributions respect the power-law exponents given as input with a confidence ranging …",
            "Abstract entirety": 0,
            "Author pub id": "AkCowUsAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        }
    ]
}]