[{
    "name": "Δημήτριος Γκρίτζαλης",
    "romanize name": "Dimitrios Gkritzalis",
    "School-Department": "Πληροφορικής",
    "University": "aueb",
    "Rank": "Καθηγητής",
    "Apella_id": 8292,
    "Scholar name": "Dimitris A. Gritzalis",
    "Scholar id": "5hIalXgAAAAJ",
    "Affiliation": "Professor of Cybersecurity, Athens University of Economics & Business",
    "Citedby": 15491,
    "Interests": [
        "Cybersecurity",
        "Critical Infrastructure Protection",
        "Information Security",
        "Malware"
    ],
    "Scholar url": "https://scholar.google.com/citations?user=5hIalXgAAAAJ&hl=en",
    "Publications": [
        {
            "Title": "Critical Information Infrastructure Security (CRITIS-2011)",
            "Publication year": 2013,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=_mW5BQAAQBAJ&oi=fnd&pg=PP5&dq=info:xg4hIGGa0QcJ:scholar.google.com&ots=u8zfp4JJcI&sig=FyJ0wG6RSVl3-dMh8XSER6duvwc",
            "Abstract": "This book constitutes revised selected papers from the 6th International Workshop on Critical Information Infrastructure Security, CRITIS 2011, held in Lucerne, Switzerland, in September 2011. The 16 full papers and 6 short papers presented in this volume were carefully reviewed and selected from 38 submissions. They deal with all areas of critical infrastructure protection research.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:tYavs44e6CUC",
            "Publisher": "Springer"
        },
        {
            "Title": "SIP vulnerabilities and anti-SPIT mechanisms assessment",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4317883/",
            "Abstract": "Although VoIP provides new ways of communication, at the same time it offers new possibilities for transmitting bulk unsolicited messages and calls, enabling spam over internet telephony (SPIT). The VoIP prevailing protocol is SIP, which it is vulnerable to threats that allow SPIT to be deployed. In this paper we assess the risk of identified threats and vulnerabilities of the SIP protocol. Then, we conduct an analytical survey of already proposed anti-SPIT techniques and we evaluate their effectiveness, in terms of how they deal with the threats and vulnerabilities. Finally, we complete our evaluation by presenting a theoretical evaluation framework, based on additional qualitative and quantitative criteria.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:LkGwnXOMwfcC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Exiting the risk assessment maze: A meta-survey",
            "Publication year": 2018,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3145905",
            "Abstract": "Organizations are exposed to threats that increase the risk factor of their ICT systems. The assurance of their protection is crucial, as their reliance on information technology is a continuing challenge for both security experts and chief executives. As risk assessment could be a necessary process in an organization, one of its deliverables could be utilized in addressing threats and thus facilitate the development of a security strategy. Given the large number of heterogeneous methods and risk assessment tools that exist, comparison criteria can provide better understanding of their options and characteristics and facilitate the selection of a method that best fits an organization's needs. This article aims to address the problem of selecting an appropriate risk assessment method to assess and manage information security risks, by proposing a set of comparison criteria, grouped into four categories. Based upon them, it …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:-uzm3Y7AvW0C",
            "Publisher": "ACM Press"
        },
        {
            "Title": "From risk analysis to effective security management: Towards an automated approach",
            "Publication year": 2004,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/09685220410518856/full/html",
            "Abstract": "Effective and risk‐free operation of modern information systems relies heavily on security practices and overall information security management. Usually, organizations perform risk analysis in order to adjust their security practices and controls to an acceptable level of risk. One of the various outputs of a risk analysis is a set of recommended practices expressed in high‐level statements of a natural language. In order to be applied to the real world, it is necessary to technically implement those requirements tailored to the specific organizational context. This is usually performed by experienced individuals. For this technical implementation and the configuration of the information technology facilities, several formal policy languages exist, which define access control policies, roles and responsibilities. This paper describes requirements for a software tool that could assist in the transition from high‐level security …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:gsN89kCJA0AC",
            "Publisher": "MSB University Press"
        },
        {
            "Title": "Towards a framework for evaluating certificate status information mechanisms",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366403000793",
            "Abstract": "A wide spectrum of certificate revocation mechanisms is currently in use. A number of them have been proposed by standardisation bodies, while some others have originated from academic or private institutions. What is still missing is a systematic and robust framework for the sound evaluation of these mechanisms. We present a mechanism-neutral framework for the evaluation of certificate status information (CSI) mechanisms. These mechanisms collect, process and distribute CSI. A detailed demonstration of its exploitation is also provided. The demonstration is mainly based on the evaluation of Certificate Revocation Lists, as well as of the Online Certificate Status Protocol. Other well-known CSI mechanisms are also mentioned for completeness.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:2osOgNQ5qMEC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Automated exploit detection using path profiling: The disposition should matter, not the position",
            "Publication year": 2015,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7518025/",
            "Abstract": "Recent advances in static and dynamic program analysis resulted in tools capable to detect various types of security bugs in the Applications under Test (AUT). However, any such analysis is designed for a priori specified types of bugs and it is characterized by some rate of false positives or even false negatives and certain scalability limitations. We present a new analysis and source code classification technique, and a prototype tool aiming to aid code reviews in the detection of general information flow dependent bugs. Our approach is based on classifying the criticality of likely exploits in the source code using two measuring functions, namely Severity and Vulnerability. For an AUT, we analyse every single pair of input vector and program sink in an execution path, which we call an Information Block (IB). A classification technique is introduced for quantifying the Severity (danger level) of an IB by static analysis …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:WC9gN4BGCRcC",
            "Publisher": "ScitePress"
        },
        {
            "Title": "Developing a European computer security incident reporting service for Health Care",
            "Publication year": 2001,
            "Publication url": "https://ebooks.iospress.nl/pdf/doi/10.3233/978-1-60750-910-3-181",
            "Abstract": "The use of ICT within Health Care Establishments (HCEs) increases very fast. HCE staff tend to depend all the more on computerised Health Information Systems (HISs) in order to perform their everyday functions. Moreover, HISs no longer process only hospital and financial data, as they once did. Nowadays, HCE staff uses HISs to assist themselves in diagnosing, to record information of a purely medical nature or even to assist themselves in patient treatment. These data are related directly to identifiable persons, their illness, their treatment, and sometimes their habits; hence they are extremely sensitive.Another fundamental change in the Health Care community is the transition from the traditional model of a stand-alone HIS, that is the HIS operating within the boundaries of a single HCE, to the networked HIS, that is a HCE's HIS interconnected to HISs of other HCEs or even of third parties, over national or …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:CHSYGLWDkRkC",
            "Publisher": "IOS Press; 1999"
        },
        {
            "Title": "Security Busters: Web browser security vs. rogue sites",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404815000590",
            "Abstract": "URL blacklists are used by the majority of modern web browsers as a means to protect users from rogue web sites, i.e. those serving malware and/or hosting phishing scams. There is a plethora of URL blacklists/reputation services, out of which Google's Safe Browsing and Microsoft's SmartScreen stand out as the two most commonly used ones. Frequently, such lists are the only safeguard web browsers implement against such threats. In this paper, we examine the level of protection that is offered by popular web browsers on iOS, Android and desktop (Windows) platforms, against a large set of phishing and malicious URL. The results reveal that most browsers – especially those for mobile devices – offer limited protection against such threats. As a result, we propose and evaluate a countermeasure, which can be used to significantly improve the level of protection offered to the users, regardless of the web browser …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:1yWc8FF-_SYC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Side channel attacks over encrypted TCP/IP Modbus reveal functionality Leaks",
            "Publication year": 2018,
            "Publication url": "https://www.scitepress.org/Papers/2018/68327/68327.pdf",
            "Abstract": "With HMI systems becoming increasingly connected with the internet, more and more critical infrastructures are starting to query PLC/RTU units through the Web through MODBUS ports. Commands sent from such interfaces are inevitably exposed to potential attacks even if encryption measures are in place. During the last decade, side channels have been widely exploited, focusing mostly on information disclosure. In this paper, we show that despite encryption, targeted side channel attacks on encrypted packets may lead to information disclosure of functionality over encrypted TCP/IP running MODBUS RTU protocol. Specifically, we found that any web interface that implements unpadded encryption with specific block cipher modes (eg CFB, GCM, OFB and CTR modes) or most stream ciphers (eg RC4) to send MODBUS functions over TCP/IP is subject to differential packet size attacks. A major cause for this attack is the very small number of potential MODBUS commands and differences in packet sizes, which leads to distinctions in traffic. To support the importance of these findings, we conducted research on Shodan looking for relevant devices with open MODBUS ports over TCP/IP that utilize encrypted web traffic. The result was that a significant amount of web interfaces communicate with MODBUS ports and many use unpadded ciphers and SSL with AES-GCM or RC4. We also implemented a PoC on a simulated architecture to validate our attack models.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:DIubQTN3OvUC",
            "Publisher": "ScitePress"
        },
        {
            "Title": "Critical Infrastructure Security and Resilience: Theories, Methods, Tools and Technologies",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:Nufq_to8ts0C",
            "Publisher": "Springer"
        },
        {
            "Title": "Business Process Modeling for Insider Threat Monitoring and Handling",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-09770-1_11",
            "Abstract": "Business process modeling has facilitated modern enterprises to cope with the constant need to increase their productivity, reduce costs and offer competitive products and services. Despite modeling’s and process management’s widespread success, one may argue that it lacks of built-in security mechanisms able to detect and deter threats that may manifest throughout the process. To this end, a variety of different solutions have been proposed by researchers which focus on different threat types. In this paper we examine the insider threat through business processes. Depending on their motives, insiders participating in an organization’s business process may manifest delinquently in a way that causes severe impact to the organization. We examine existing security approaches to tackle down the aforementioned threat in enterprise business processes and propose a preliminary model for a monitoring …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:BJbdYPG6LGMC",
            "Publisher": "Springer (LNCS 8647)"
        },
        {
            "Title": "Climate adaption: Addressing risks and impacts of climate change on Transport Sector",
            "Publication year": 2017,
            "Publication url": "https://scholar.google.com/scholar?cluster=4805847422353765479&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:tHtfpZlB6tUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Metasploit the penetration tester's guide",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.5555/2622676.2622899",
            "Abstract": "Book review: Metasploit the Penetration Tester's Guide: Computers and Security: Vol 32, No null \nACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About \nSign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences \nPeople More Search ACM Digital Library SearchSearch Advanced Search Computers and \nSecurity Periodical Home Latest Issue Archive Authors Affiliations Award Winners More \nHomeBrowse by TitlePeriodicalsComputers and SecurityVol. Book review: Metasploit the \nPenetration Tester's Guide article Book review: Metasploit the Penetration Tester's Guide Share \non Authors: Miltiadis Kandias profile image Miltiadis Kandias Dept. of Informatics, Athens \nUniversity of Economics & Business, 76 Patission Ave., Athens GR-10434, Greece Dept. of \nInformatics, Athens University of Economics & Business, 76 Patission Ave., Athens GR-10434, , .…",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:QsaTk4IG4EwC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Classification and Comparison of Critical Infrastructure Protection Tools",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-48737-3_14",
            "Abstract": "Modeling and analysis of critical infrastructure interdependencies is a research area that has attracted considerable interest. Interdependency and risk analyses can be computationally intensive, but can also yield useful results that enhance risk assessments and offer risk mitigation alternatives. Unfortunately, many tools and methodologies are left unsupported and are forgotten soon after the projects that developed them terminate.This chapter attempts to identify and classify many existing tools and frameworks to create a common baseline for threat identification and risk assessment. It also compares their attributes and technologies in creating a taxonomy. Conceptual and qualitative studies about infrastructure interdependencies along with modeling and simulation approaches are examined. The comparison is based on two aspects: the purpose that each tool serves and its technical modeling …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:1tZ8xJnm2c8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Functional requirements for a secure electronic voting system",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35586-3_40",
            "Abstract": "Electronic voting has been attracting the attention of governments and research groups with most work on the subject referring to the user requirements such a system should satisfy. For several cases, though, requirement identification seldom goes further than a simple narrative description of a basic set of non-functional characteristics related to security. On the other hand, governmental reports usually refer to requirements as the set of applicable laws pertaining a certain voting procedure. Both sides seem to underestimate the fact that an electronic voting system is an information system with functional, as well as nonfunctional, requirements. In this paper we apply the Rational Software Development Process for identifying and presenting the requirements an electronic voting system should meet. The requirements are based on a generic voting model that has been developed having in mind the European …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:YOwf2qJgpHMC",
            "Publisher": "Kluwer Academics Publisher"
        },
        {
            "Title": "Return on Security Investment for Cloud Platforms",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6735408/",
            "Abstract": "Cloud migration is a complex decision because of the multiple parameters that contribute for or against it (e.g. available budget, costs, performance, etc.). One of these parameters is information security and the investment required in order to ensure it. A potential client needs to evaluate various deployment options and Cloud Service Providers (CSP). This paper proposes a set of metrics focused on the assessment of security controls of a cloud deployment, in terms of cost and mitigation. Such an approach can support the client to decide whether she selects to deploy part of her services, data or infrastructure to a CSP, or not.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:hMsQuOkrut0C",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "A digital seal solution for deploying trust on commercial transactions",
            "Publication year": 2001,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/09685220110388836/full/html",
            "Abstract": "Traditional business practice depends on trust relations between the transacting parties. One of the most important aspects of this trust is the quality of the offered services or products. The Web currently constitutes an enabler for electronic commerce, providing a global transaction platform that does not require physical presence. However, transferring trust from the physical world to the electronic one is a process that requires a trust infrastructure. The current infrastructure, based on trusted third parties can be enhanced. We introduce the notion of digital seals and provide a mechanism for transferring the trust placed by users in companies in the physical world, to the electronic one.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:4uoR24qA-WYC",
            "Publisher": "MCB UP Ltd"
        },
        {
            "Title": "Design and Evaluation of COFELET-based approaches for cyber security learning and training",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404821000870",
            "Abstract": "Cyber security game-based learning is a new field that lacks design standards and common methodologies. To this end, the Conceptual Framework for eLearning and Training (COFELET) and the COFELET ontology have been proposed. COFELET is a framework that can be used as a guide for the design and evaluation of effective cyber security learning and training approaches, whereas the COFELET ontology describes the key elements that such approaches should embrace to assimilate well known cyber security threat analysis and modeling standards as the means to create interesting educational experiences. Aiming at providing insights on how COFELET compliant approaches can be developed, we propose the life-cycle of a COFELET game, a blueprint illustrating the design aspects and the course of phases for the development of COFELET compliant games (COFELET games). Besides, an extension …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:QYmifXMdJWgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Probabilistic model checking of CAPTCHA admission control for DoS resistant anti-SPIT protection",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41485-5_13",
            "Abstract": "Voice over IP (VoIP) service is expected to play a key role to new ways of communication. It takes advantage of Internet Protocols by using packet networks to transmit voice and multimedia data, thus providing extreme cost savings. On the other hand, this technology has inherited drawbacks, like SPAM over Internet Telephony (SPIT). A well-established method to tackle SPIT is the use of CAPTCHAs. CAPTCHAs are vulnerable to Denial of Service (DoS) attacks, due to their excessive demands for bandwidth. We suggest that anti-SPIT protection should be combined with appropriate admission control policies, for mitigating the effects of DoS attacks. In order to identify how effective is this technique, we quantify the costs and the benefits in bandwidth usage through probabilistic model checking four different admission control policies. We conclude with comments on how appropriate is each policy in tackling …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:vRqMK49ujn8C",
            "Publisher": "Springer"
        },
        {
            "Title": "An ontology-driven antiSPIT architecture",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-11631-5_18",
            "Abstract": "Over the last years Voice-over-IP (VoIP) is getting widespread a dop tion from business and residential customers.The preference towards VoIP ser vices stems from the fact that VoIP provides many ways to com mu ni ca te, with a lower cost than traditional telephony. However, VoIP in its present form may allow malicious users to exploit a number of vulnerabilities, make bulk un so li cited telephony calls and send bulk unsolicited instant messages. This ex p loi ta tion is referred to as Spam over Internet Telephony (SPIT). In this pa per we int roduce an antiSPIT management architecture, by using on to logies, which allow domain administrators to detect and handle SPIT auto ma tically, ba s ed on pre de fined requirements and preferences.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:70eg2SAEIzsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Threat analysis of the session initiation protocol regarding spam",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4197959/",
            "Abstract": "Voice over Internet protocol (VoIP) is becoming increasingly popular due to its significant advantages regarding cost and support of enhanced multimedia services. Despite of the substantial advantages of using the Internet as the transmission medium for voice calls, we can foresee many undesirable uses, especially in terms of spam. VoIP technology may provide new means for the transmission of bulk unsolicited messages and calls (spam over Internet telephony - SPIT), mainly due to the reduced cost compared to traditional telephony. Therefore, mechanisms are essential to address the SPIT problem, while maintaining the advantages of VoIP technology. In this paper we conduct a comprehensive threat analysis that addresses the ascendant VoIP protocol, the session initiation protocol, in terms of its vulnerability regarding SPIT deliverance. Our analysis introduces the requirements that the mechanisms dealing …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:UeHWp8X0CEIC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Proactive insider threat detection through social media: The YouTube case",
            "Publication year": 2013,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/2517840.2517865",
            "Abstract": "Insider threat is a major issue in cyber and corporate security. In this paper we study the psychosocial perspective of the insider via social media, Open Source Intelligence, and user generated content classification. Inductively, we propose a prediction method by evaluating the predisposition towards law enforcement and authorities, a personal psychosocial trait closely connected to the manifestation of malevolent insiders. We propose a methodology to detect users holding a negative attitude towards authorities. For doing so we facilitate the use of machine learning techniques and of a dictionary-based approach, so as to detect comments expressing negative attitude. Thus, we can draw conclusions over a user behavior and beliefs via the content the user generated within the limits a social medium. We also use an assumption free flat data representation technique in order to decide over the user's attitude …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:p__nRnzSRKYC",
            "Publisher": "ACM"
        },
        {
            "Title": "Defending airports from UAS: A survey on cyber-attacks and counter-drone sensing technologies",
            "Publication year": 2020,
            "Publication url": "https://www.mdpi.com/749552",
            "Abstract": "As the fastest growing segment of aviation, unmanned aerial systems (UAS) continue to increase in number, technical complexity and capabilities. Numerous civilian and commercial uses are drastically transforming civil protection, asset delivery, commercial and entertaining activities. However, UAS pose significant challenges in terms of safety, security and privacy within society. An increasing phenomenon, nowadays, is drone-related incidents near airport facilities, which are expected to proliferate in frequency, complexity and severity, as drones become larger and more powerful. Critical infrastructures need to be protected from such aerial attacks, through effective counteracting technologies, risk management and resilience plans. In this paper, we present a survey of drone incidents near airports and a literature review of sensor technologies, able to prevent, detect, identify and mitigate rogue drones. We exhibit the benefits and limitations of available counter-drone technologies (C-UAS); however, defending airports against misused drone activity is a hard problem. Therefore, we analyze three realistic attack scenarios from malicious drones and propose an effective C-UAS protection plan for each case. We discuss applicability limitations of C-UAS in the aviation context and propose a resilience action plan for airport stakeholders for defending against airborne threats from misused drones. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:WTQy_8Ay2UsC",
            "Publisher": "MDPI"
        },
        {
            "Title": "Emerging Challenges for Security, Privacy and Trust (SEC-2009)",
            "Publication year": 2009,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=zLJtCQAAQBAJ&oi=fnd&pg=PP2&dq=info:eIUXLzNSkWsJ:scholar.google.com&ots=p1ZpQlDfz5&sig=ln2qBAXaArfC1xdcCCFtWwHlm9Q",
            "Abstract": "It was an honor and a privilege to chair the 24th IFIP International Information Se-rity Conference (SEC 2009), a 24-year-old event that has become a tradition for-formation security professionals around the world. SEC 2009 was organized by the Technical Committee 11 (TC-11) of IFIP, and took place in Pafos, Cyprus, during May 18–20, 2009. It is an indication of good fortune for a Chair to serve a conference that takes place in a country with the natural beauty of Cyprus, an island where the hospitality and frie-liness of the people have been going together, hand-in-hand, with its long history. This volume contains the papers selected for presentation at SEC 2009. In response to the call for papers, 176 papers were submitted to the conference. All of them were evaluated on the basis of their novelty and technical quality, and reviewed by at least two members of the conference Program Committee. Of the papers submitted, 39 were selected for presentation at the conference; the acceptance rate was as low as 22%, thus making the conference a highly competitive forum. It is the commitment of several people that makes international conferences pos-ble. That also holds true for SEC 2009. The list of people who volunteered their time and energy to help is really long.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:bEWYMUwI8FkC",
            "Publisher": "Springer"
        },
        {
            "Title": "The ambient intelligence paradigm: A review of security and privacy strategies in leading economies",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4199396/",
            "Abstract": "In this paper, we comparatively review the AmI paradigm, as it emerges in three of the world's leading economies, namely: European Union, United States and Japan. We identify agonies, trends, and strategies of the national governments and private industries, we discuss the way these new concepts are perceived in each national context, and we examine the perspective they adopt to deal with the rising security and privacy risks. Furthermore, we examine the social disruption issues introduced and we conclude by presenting some general observations regarding the emerging paradigm",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:NMxIlDl6LWMC",
            "Publisher": "IEEE"
        },
        {
            "Title": "SPIDER: A platform for managing SIP-based Spam over Internet Telephony",
            "Publication year": 2011,
            "Publication url": "https://content.iospress.com/articles/journal-of-computer-security/jcs419",
            "Abstract": "The Session Initiation Protocol (SIP) has become the first widely adopted protocol for managing IP-based telephony, video, and multimedia sessions. SIP advertises a contact point of an individual to the Web. This contact point, similar to an e-mail address, can be exploited for spam purposes. Spam over Internet Telephony, also called SPIT, in general denotes any bulk unsolicited information sent to any potential calling-end of a VoIP infrastructure. Even though SPIT is a new concept, it is more reasonable to address this problem right now, rather than waiting until the problem prevails. To mitigate SPIT, adequate technical countermeasures are required. The solution space may expand to nontechnical ones, as well. In this paper, we propose the SPIDER (SPam over Internet telephony Detection sERvice) platform, a modular and efficient system for fighting SPIT. SPIDER orchestrates several discrete modules that …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:RGFaLdJalmkC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Holistic Information Security: Human Factor and Behavior Prediction using Social Media",
            "Publication year": 2014,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.704.6495&rep=rep1&type=pdf",
            "Abstract": "Holistic information Security: The human factor and the prediction of behavior via social media \nPage 1 Holistic Information Security: Human Factor and Behavior Prediction using Social \nMedia Dimitris Gritzalis January 2014 Page 2 Holistic Information Security: Human Factor and \nBehavior Prediction using Social Media Dimitris Gritzalis Professor and Director Information \nSecurity & Critical Infrastructure Protection Laboratory Athens University of Economics & \nBusiness Page 3 Outline • Insider Threat • Threat Definition • Malevolent User Needs • Personal \nFactors • Delinquent Behavior Prediction • Narcissism Detection • Predisposition towards Law \nEnforcement • Divided Loyalty • Group Homogeneity • Ethical and Legal Issues • Conclusions \nPage 4 Insider Threat • Critical problem in cyber/corporate security • Threats originating from \npeople given access rights to systems and misuse privileges violating security policy • in : …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:4e5Qn2KL_jwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Is Xenios Zeus still alive? Destination image of Athens in the years of Recession",
            "Publication year": 2018,
            "Publication url": "https://journals.sagepub.com/doi/abs/10.1177/0047287517705225",
            "Abstract": "This study examines the evolution of the destination image of Athens from 2005 to 2015, in order to exploit the impact of the recent economic recession on individual perceptions. It uses advanced web content mining to analyze TripAdvisor messages that were posted in Athens Travel Forum. The findings show that the image of Athens has remained positive, facing a significant, but short-term, shift during the first years of the crisis. The findings also reveal that the destination image of Athens is only partially shared by individuals residing inside and outside Greece, and that non-Greek residents have more favorable perceptions toward the destination. The study expands understanding on the destination image literature by demonstrating the normative nature of destination images, which—once established—can be particularly resistant to change, even during sustained crises.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:SAZ1SQo2q1kC",
            "Publisher": "Sage"
        },
        {
            "Title": "Cyber operations and International Humanitarian Law: A review of obstacles in applying International Law rules in cyber warfare",
            "Publication year": 2016,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/ICS-12-2014-0081/full/html",
            "Abstract": " – The increasing number of cyber attacks has transformed the “cyberspace” into a “battlefield”, bringing out “cyber warfare” as the “fifth dimension of war” and emphasizing the States’ need to effectively protect themselves against these attacks. The existing legal framework seem inadequate to deal effectively with cyber operations and, from a strictly legal standpoint, it indicates that addressing cyber attacks does not fall within the jurisdiction of just one legal branch. This is mainly because of the fact that the concept of cyber warfare itself is open to many different interpretations, ranging from cyber operations performed by the States within the context of armed conflict, under International Humanitarian Law, to illicit activities of all kinds performed by non-State actors including cybercriminals and terrorist groups. The paper initially presents major cyber-attack incidents and their impact on the …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ce2CqMG-AY4C",
            "Publisher": "Emerald"
        },
        {
            "Title": "Information Movement and Computer Security",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=14670257660194613475&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:h1pkognVyKwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Panoptis: Intrusion detection using process accounting records",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=5417680032427384408&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:5icHVeHT4IsC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Smart Airports Cybersecurity: Threat Mitigation and Cyber Resilience",
            "Publication year": 2019,
            "Publication url": "https://www.mdpi.com/384660",
            "Abstract": "Airports are at the forefront of technological innovation, mainly due to the fact that the number of air travel passengers is exponentially increasing every year. As a result, airports enhance their infrastructure intelligence and evolve as smart facilities to support growth, by offering an enjoyable travel experience. New challenges are coming up, which aviation has to deal with and adapt to, such as the integration of Industrial IoT (Internet of Things) in airport facilities and the increased use of smart devices from travelers and employees. Cybersecurity is becoming a key enabler for safety, which is paramount in the aviation context. Smart airports strive to provide optimal services in a reliable and sustainable manner, by working around the domains of growth, efficiency, safety and security. This article researches:(a) the implementation rate of cybersecurity measures in commercial airports;(b) malicious threats that evolve due to IoT and smart devices installed;(c) risk scenario analysis for IoT malicious attacks with threat mitigation actions. With the aim to enhance operational practices and develop robust cybersecurity governance in smart airports, we present a systematic and comprehensive analysis of malicious attacks in smart airports, to facilitate airport community comprehend risks and proactively act, by implementing cybersecurity best practices and resilience measures. View Full-Text",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:1EqfMoDn7-AC",
            "Publisher": "MDPI"
        },
        {
            "Title": "Externality cost assessment for interactive audio media protection of Internet services",
            "Publication year": 2012,
            "Publication url": "https://scholar.google.com/scholar?cluster=5765757705204531405&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:8AbLer7MMksC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Electronic voting systems: Security implications of the administrative workflow",
            "Publication year": 2003,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1232067/",
            "Abstract": "With the rapid growth of the Internet, online voting appears to be a reasonable alternative to conventional elections and other opinion expressing processes. Current research focuses on designing and building \"voting protocols\" that can support the voting process, while implementing the security mechanisms required for preventing fraud and protecting voter's privacy. However, not much attention has been paid to the administrative part of an electronic voting system that supports the actors of the system. Possible \"security gaps\" in the administrative workflow may result in deteriorating the overall security level of the system, even if the voting protocol implemented by the system succeeds to fully comply with the security requirements set for voting. To this direction, this paper describes the responsibilities and privileges of the actors involved in the electronic voting process. The description of the role of each actor …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:5nxA0vEk-isC",
            "Publisher": "IEEE"
        },
        {
            "Title": "A privacy-enhancing e-business model based on infomediaries",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/3-540-45116-1_10",
            "Abstract": "Rapid evolution of Internet may largely depend on gaining and maintaining the trust of users. This possibility may especially rule enterprises, whose financial viability depends on electronic commerce. Neither customers will have the time, the ability or the endurance to work out the best deals with vendors, nor will vendors have time to bargain with every customer. In order for customers to strike the best bargain with vendors, they need a privacy supporter, an information intermediary or infomediary. Infomediaries will become the custodians, agents, and brokers of customer personal information exchanged via Internet, while at the same time protecting their privacy. There is a scale between security and privacy that currently leans towards security; security adopts strong user authentication mechanisms in order to control access to personal data, while privacy requires loose authentication in order to provide …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:uWiczbcajpAC",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Negative MWOM and value co-destruction for destinations",
            "Publication year": 2018,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:qsWQJNntlusC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Social Media Intelligence in practice: The NEREUS experimental platform",
            "Publication year": 2015,
            "Publication url": "http://www.infosec.aueb.gr/Publications/NEREUS%20Demokritos%202015.pdf",
            "Abstract": "Social Media Intelligence in practice: The NEREUS experimental platform Page 1 Social \nMedia Intelligence in Practice: The NEREUS Experimental Platform Dimitris Gritzalis & \nVasilis Stavrou June 2015 Page 2 Social Media Intelligence in Practice: The NEREUS \nExperimental Platform Dimitris Gritzalis & Vasilis Stavrou Information Security & Critical \nInfrastructure Protection Laboratory Dept. of Informatics | Athens University of Economics & \nBusiness 3rd Hellenic Forum for Science, Technology & Innovation Athens, June 2015 \nPage 3 Presentation outline ⇒ Web 2.0 and Online Social Networks ⇒ Open Source and \nSocial Media Intelligence ⇒ The NEREUS Framework ⇒ SOCMINT and behavior \nprediction capabilities ⇒ Conclusions Page 4 Web 2.0 and Online Social Networks (OSN) \nSource: http://socialmediatoday.com/ Page 5 Open Source & Social Media Intelligence \nOpen Source Intelligence (OSINT) is produced (…",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:dAp6zn-oMfAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Dropping malware through sound injection: A comparative analysis on Android operating systems",
            "Publication year": 2021,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404821000523",
            "Abstract": "Trojan droppers are regularly ranked among the top 5 worst malware threats; especially for Android. Software for malware detection opts to either identify the payload when executed in memory or detect the connection from which droppers attempt to download malicious payloads. Much effort has been put into securing network channels and stopping droppers from delivering their payloads. This paves the way for alternative routes of infiltration. Our paper extends work on inaudible sound covert channel attacks and audio fingerprinting to use them for close vicinity attacks as potential mass dropper techniques. We demonstrate that malware modules can be dropped over the air to multiple devices using the same sound medium from approximately four to five meters away. Instead of using network connections, we conceal the malware within musics inaudible frequencies. Then we use a seemingly innocent app that …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:eLRq4zTgah0C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Program analysis with risk-based classification of dynamic invariants for logical error detection",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404817300330",
            "Abstract": "The logical errors in programs causing deviations from the intended functionality cannot be detected by automated source code analysis, which mainly focuses on known defects and code vulnerabilities. To this end, we introduce a combination of analysis techniques implemented in a proof-of-concept prototype called PLATO. First, a set of dynamic invariants is inferred from the source code that represents the program's logic. The code is instrumented with assertions from the invariants, which are subsequently valuated through the program's symbolic execution. The findings are ranked using a fuzzy logic system with two scales characterizing their impact: (i) a Severity scale for the execution paths' characteristics and their Information Gain, (ii) a Reliability scale based on the measured Computational Density. Real, as well as synthetic applications with at least four different types of logical errors were analyzed. The …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:D_tqNUsBuKoC",
            "Publisher": "Elesevier"
        },
        {
            "Title": "Access Control Issues in Utilizing Fog Computing for Transport Infrastructure",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-33331-1_2",
            "Abstract": "The integration of the information and communication technologies of cloud computing, Software Defined Networking (SDN) and Internet of Things (IoT) into traditional transportation infrastructures enables the evolution of Intelligent Transportation Systems (ITS). Moreover, the specific requirements for real-time applications and service provision near to consumers introduce the utilization of fog computing as an extension of cloud. However, such a movement affects security aspects and poses new access control challenges. In this paper, we study the operational characteristics of a proposed ITS paradigm utilizing fog computing and identify corresponding access control issues. To address these issues in such a versatile and highly distributed environment, we present the key pointers of an attribute-based access control scheme suitable for fog computing. This paper aims to set a basis for further work in …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:CYCckWUYoCcC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "Performance evaluation of certificate based authentication in integrated emerging 3G and Wi-Fi networks",
            "Publication year": 2004,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-25980-0_23",
            "Abstract": "Certificate based authentication of parties provides a powerful means for verifying claimed identities, avoiding the necessity of distributing shared secrets beforehand. Whereas Wi-Fi networks present security deficiencies, they manage to highly penetrate into the wireless market in a great degree due to their low cost, easy administration, great capacity, IP-oriented nature, etc. Considering Wi-Fi networking settings, administrated by different operators, as parts of a common core 3G infrastructure, the paper proposes and evaluates the potential application of enhanced TLS-based authentication mechanisms in integrated emerging-3G and Wi-Fi networks. We propose to use EAP-TLS protocol seconded by Public Key Infrastructure entities, to provide users with robust authentication mechanisms in hybrid WLAN-3G heterogeneous environment. Our alternative solution is discussed against EAP-AKA procedures …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:e5wmG9Sq2KIC",
            "Publisher": "Springer"
        },
        {
            "Title": "Smartphone sensor data as digital evidence",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404813000527",
            "Abstract": "The proliferation of smartphones introduces new opportunities in digital forensics. One of the reasons is that smartphones are usually equipped with sensors (e.g. accelerometer, proximity sensor, etc.), hardware which can be used to infer the user's context. This context may be useful in a digital investigation, as it can aid in the rejection or acceptance of an alibi, or even reveal a suspect's actions or activities. Nonetheless, sensor data are volatile, thus are not available in post-mortem analysis. Thus, the only way to timely acquire them, in case such a need arises during a digital investigation, is by software that collects them when they are generated by the suspect's actions. In this paper we examine the feasibility of ad-hoc data acquisition from smartphone sensors by implementing a device agent for their collection in Android, as well as a protocol for their transfer. Then, we discuss our experience regarding the data …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:WA5NYHcadZ8C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Mobile devices: A phisher's paradise",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7509476/",
            "Abstract": "Mobile devices - especially smartphones - have gained widespread adoption in recent years, due to the plethora of features they offer. The use of such devices for web browsing and accessing email services is also getting continuously more popular. The same holds true with other more sensitive online activities, such as online shopping, contactless payments, and web banking. However, the security mechanisms that are available on smartphones and protect their users from threats on the web are not yet mature, as well as their effectiveness is still questionable. As a result, smartphone users face increased risks when performing sensitive online activities with their devices, compared to desktop/laptop users. In this paper, we present an evaluation of the phishing protection mechanisms that are available with the popular web browsers of Android and iOS. Then, we compare the protection they offer against their …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:QD3KBmkZPeQC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A risk assessment method for smartphones",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30436-1_36",
            "Abstract": "Smartphones are multi-purpose ubiquitous devices, which face both, smartphone-specific and typical security threats. This paper describes a method for risk assessment that is tailored for smartphones. The method does not treat this kind of device as a single entity. Instead, it identifies smartphone assets and provides a detailed list of specific applicable threats. For threats that use application permissions as the attack vector, risk triplets are facilitated. The triplets associate assets to threats and permission combinations. Then, risk is assessed as a combination of asset impact and threat likelihood. The method utilizes user input, with respect to impact valuation, coupled with statistics for threat likelihood calculation. Finally, the paper provides a case study, which demonstrates the risk assessment method in the Android platform.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:NhqRSupF_l8C",
            "Publisher": "Springer"
        },
        {
            "Title": "BLAST: Off-the-shelf hardware for building an efficient hash-based cluster storage system",
            "Publication year": 2009,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5328457/",
            "Abstract": "During the past few years, large, reliable and efficient storage systems have become increasingly important in enterprise environments. Additional requirements for these environments include low installation, maintenance and administration costs. In this paper we propose a hash-based storage approach, combined with block-level operating system semantics. The experimental evaluation confirms that the proposed approach is viable and can offer a cost-effective storage solution.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:M3NEmzRMIkIC",
            "Publisher": "ΙΕΕΕ"
        },
        {
            "Title": "Evaluating the manageability of web browsers controls",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41098-7_6",
            "Abstract": "The proliferation of smartphones has introduced new challenges in web browsing security. These devices often have limited resources and small size, which may limit the security ‘arsenal’ of their user. This, however, does not seem to deter smartphone users from accessing the Web via their devices. On the same time, the popularity of browser-based exploits among attackers is also on the rise, especially in the form of Blackhole exploit kit, i.e. frameworks that attack browsers using 0-day exploits (e.g., in Java, Flash). In this context, the paper contributes by comparing the availability and manageability of security controls that are offered by popular smartphone and desktop browsers. It also provides insights about their preconfigured protection against web threats.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:uJ-U7cs_P_0C",
            "Publisher": "Springer"
        },
        {
            "Title": "A new strategy for improving cyber-attacks evaluation in the context of Τallinn manual",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404817300822",
            "Abstract": "In this paper a systematic modeling methodology for evaluating the effects of cyber-attacks on States Critical Information Infrastructure (CII) is introduced. The analysis is focused on the United Nations Charter's normative scheme of the “use of force”, in order to define whether these attacks constitute a wrongful “use of force” under the principles of international law. By using the qualitative criteria for recognising the impact of cyber-attacks as proposed by the International Group of Experts in the Manual on the International Law Applicable to Cyber Warfare (Tallinn Manual) and by applying Multiple Attribute Decision Making (MADM) methods, cyber operations evaluation results are presented. For the analysis a case study of kinetic and cyber-attacks on Supervisory Control and Data Acquisition (SCADA) system is employed. Pros and cons of the Simple Additive Weighting (SAW) method and the Weighted Product …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:c1e4I3QdEKYC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "A CBK for Information Security and Critical Infrastructure Protection",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-73269-5_7",
            "Abstract": "Academic institutions educate future Information Security and Critical Infrastructure Protection (ISCIP) professionals, offering expedient and broad knowledge of the field. As industry often demands higher productivity and stronger specialization, several organizations (academic, governmental, industrial) considered the use of a Common Body of Knowledge (CBK), to serve as a tool that appropriately groups together the essential knowledge of this field. In this paper, we review the content of current ISCIP curricula, we define the necessary skills of an ISCIP Professional – as indicated and suggested by the industry – and form a multidisciplinary CBK of the ISCIP field.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:blknAaTinKkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Computer Security (ESORICS-2010)",
            "Publication year": 2010,
            "Publication url": "https://ui.adsabs.harvard.edu/abs/2010LNCS.6345.....G/abstract",
            "Abstract": "Computer Security - ESORICS 2010 - NASA/ADS Now on home page ads icon ads Enable full \nADS view NASA/ADS Computer Security - ESORICS 2010 Gritzalis, Dimitris ; Preneel, Bart ; \nTheoharidou, Marianthi Abstract Publication: Lecture Notes in Computer Science Pub Date: \n2010 DOI: 10.1007/978-3-642-15497-3 Bibcode: 2010LNCS......G Keywords: Computer \nScience; Computer Communication Networks; Management of Computing and Information \nSystems; Data Encryption; Algorithm Analysis and Problem Complexity; Computers and Society; \nInformation Systems Applications (incl.Internet) full text sources Publisher | © The SAO/NASA \nAstrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian \nAstrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo \nSmithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @(.…",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ZHo1McVdvXMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Automatic network restructuring and risk mitigation through business process asset dependency analysis",
            "Publication year": 2020,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404820301413",
            "Abstract": "In the 4th industrial revolution era, security of multiple interconnected devices has become a critical issue. A rapidly increasing number of cybersecurity incidents emerge due to complex interconnected sensors, devices, and systems used in the Internet of Things. In this paper, we tackle the need for automation in security risk analysis and restructuring of such networks. The presented framework models the connections of assets and devices so as to depict their interdependencies on a company's business processes and effectively reduces their overall risk against cybersecurity threats. It achieves this by (1) identifying critical components and dependency structural risks, (2) prioritizing assets based on their influence on business processes and (3) proposing network restructures and asset clusters. To do that, the proposed algorithm utilizes (i) dependency risk graphs for modeling and analyzing networks …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:jMZTt8odoasC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A secure smartphone applications roll-out scheme",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22890-2_5",
            "Abstract": "The adoption of smartphones, devices transforming from simple communication devices to smart and multipurpose devices, is constantly increasing. Amongst the main reasons for their vast pervasiveness are their small size, their enhanced functionality, as well as their ability to host many useful and attractive applications. Furthermore, recent studies estimate that application installation in smartphones acquired from official application repositories, such as the Apple Store, will continue to increase. In this context, the official application repositories might become attractive to attackers trying to distribute malware via these repositories. The paper examines the security inefficiencies related to application distribution via application repositories. Our contribution focuses on surveying the application management procedures enforced during application distribution in the popular smartphone platforms (i.e. Android …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:O3NaXMp0MMsC",
            "Publisher": "Springer"
        },
        {
            "Title": "Open-source intelligence produced from social media: A proactive cyber defense tool",
            "Publication year": 2014,
            "Publication url": "http://www.infosec.aueb.gr/Publications/ECCWS-2014a.pdf",
            "Abstract": "Holistic information Security: The human factor and the prediction of behavior via social media \nPage 1 Open-Source Intelligence produced from Social Media: A proactive cyber defense \ntool Dimitris Gritzalis July 2014 1 Page 2 Open-Source Intelligence produced from Social \nMedia: A proactive cyber defense tool Dimitris A. Gritzalis Professor and Director Information \nSecurity & Critical Infrastructure Protection Laboratory Dept. of Informatics, Athens University \nof Economics & Business, Greece 13th European Conference on Cyber Warfare and Security \n(ECCWS-2014) July 2014, Piraeus, Greece Keynote address 2 Page 3 Outline • Social Media \n• Open Source Intelligence • Insider threat and threat parameters • Exploiting data from Social \nMedia • Behavior prediction capabilities Case 1: Success story - Insider detection based on \nNarcissism Case 2: Success story - Predisposition towards law enforcement Case 3: Horror /…",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:wLxue7F8ec0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A generic privacy enhancing technology for pervasive computing environments",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/11824633_11",
            "Abstract": "Pervasive computing is an emerging computing paradigm, which is expected to be part of our everyday life in the foreseeable future. Despite its huge potential value, one can foresee considerable drawbacks and undesirable potential uses of it in terms of privacy. In specific, the pervasive computing paradigm raises the level of the challenge to protect privacy of end-users, mainly due to the fact that devices operating in such an environment will be embedded in the fabric of the everyday life and will exhibit enhanced tracking and profiling capabilities. What is needed, inter alia, is appropriate mechanisms that are able to evolve with the needs of the users and interact with them in order to meet their privacy requirements. In this paper we suggest the foundations of a new Privacy Enhancing Technology (PET), with respect to the basic characteristics and implications introduced by pervasive environments.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:hMod-77fHWUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Cyber-attacks evaluation using a simple additive weighting method on the basis of Schmitt’s analysis",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/64478105/MCIS-2016%20Cyber%20Attack%20Evaluation%20using%20SAW%20Method.pdf",
            "Abstract": "A systematic modelling methodology is presented in this paper, so as to evaluate the effects of cyberattacks on states’ Critical Information Infrastructure, in order to answer the question of whether these attacks have risen to the level of a ‘use of force’under the principles of international law. By using the qualitative criteria for recognizing the impact of cyber-attacks as proposed by the International Group of Experts in the Manual on the International Law Applicable to Cyber Warfare (Tallinn Manual) and by applying the Simple Additive Weighting method, the widely used Multiple Attribute Decision Making method, cyber-operations evaluation results are presented. For the analysis a case study of kinetic and cyber-attacks on Supervisory Control and Data Acquisition system is employed. Taking into account the qualitative and quantitative aspects of such attacks and adding for the first time the ‘military character’attribute as defined by the Tallinn Manual in the calculation procedure, a more complete evaluation of such attacks is achieved.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:X9ykpCP0fEIC",
            "Publisher": "AISel"
        },
        {
            "Title": "Draft standard for high level security policies for Healthcare establishments",
            "Publication year": 2001,
            "Publication url": "https://ebooks.iospress.nl/pdf/doi/10.3233/978-1-60750-913-4-23",
            "Abstract": "The provision of security to Healthcare Information Systems (HIS) involves a continuous effort to preserve the constituent elements of a HIS, namely medical and nonmedical information, ICT equipment, software, people, and procedures. It also involves the preservation of the so-called security attributes of information, ie confidentiality, integrity, and availability. Such an effort requires significant decision making. Policies are high level instructions intended to provide guidance to those who must make present and future decisions. Decision-intensive activities, like the provision of security to a HIS, are strongly dependent on policies. Therefore, security policies are considered the primary building blocks for every information security effort. Healthcare Establishments (HCE) handling sensitive personal information face the challenge to achieve the following goals:",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:WJVC3Jt7v1AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Implementing secure healthcare telematics applications in Europe",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=13733133362148752249&hl=en&oi=scholarr",
            "Abstract": "Title page--Introduction to the ISHTAR Project--Contents--Chapter 1: The ISHTAR White Paper--Chapter 2: Security of Electronic Health Care Records: A Clinical Perspective--Chapter 3: Implications of the EU Data Protection Directive and Council of Europe Recommendations for Healthcare Establishments--Chapter 4: Legal Liability for Telemedicine and Healthcare Networking--Chapter 5: Current Security Issues Faced by Health Care Establishments and Resulting Requirements for a Secure Health Information System Architecture--Chapter 6: IT Security Training--Chapter 7: The ISHTAR Security Guidelines--Chapter 8: Developing a European Computer Security Incident Reporting Service for Health Care--Chapter 9: The ISHTAR World Wide Web Dissemination and Advisory Service for Healthcare Information Security--Chapter 10: Verification of ISHTAR Activities--Chapter 11: Security Consultancy to and Implementation in Healthcare Telematics Projects--Chapter 12: Conclusion--Annex: Complete Summary of Recommendations Regarding Legal Liability--Author Index",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:7XUxBq3GufIC",
            "Publisher": "John Wiley & Sons"
        },
        {
            "Title": "Building a reliable e-voting system: Functional requirements and legal constraints",
            "Publication year": 2002,
            "Publication url": "https://www.computer.org/csdl/proceedings-article/dexa/2002/16680435/12OmNx2QUHM",
            "Abstract": "Three main benefits of visual data flow programming languages (VDFLs) are the asynchronous and parallel program execution and the concrete representation of program code. In a real world, optical communication is a good example of free and parallel data flow. Therefore, we considered a VDFL as a practical tool for visualizing an optical communication flow. However, in a VDFL data flow can become synchronous and discontinuous by reasons represented in this article.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:_Qo2XoVZTnwC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Insiders trapped in the mirror reveal themselves in social media",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38631-2_17",
            "Abstract": "Social media have widened society’s opportunities for communication, while they offer ways to perform employees’ screening and profiling. Our goal in this paper is to develop an insider threat prediction method by (e)valuating a users’ personality trait of narcissism, which is deemed to be closely connected to the manifestation of malevolent insiders. We utilize graph theory tools in order to detect influence of and usage deviation. Then, we categorize the users according to a proposed taxonomy. Thus we detect individuals with narcissistic characteristics and manage to test groups of people under the prism of group homogeneity. Furthermore, we compare and classify users to larger sub-communities consisting of people of the same profession. The analysis is based on an extensive crawling of Greek users of Twitter. As the application of this method may lead to infringement of privacy rights, its use should …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:eq2jaN3J8jMC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Security Policy Development for Healthcare Information Systems",
            "Publication year": 2003,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-60750-940-0-105",
            "Abstract": "In this paper the issue of security policy development for health information systems is addressed. Security policy development involves the definition of the policy content, the analysis of the social, organisational, and technical contexts, as well as the organisation of the policy development process. We present the structure of security policies, analyse the characteristics of the HIS context, and analyse the different categories of methodologies, which can be used towards this end.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:d6JCS5z0ckYC",
            "Publisher": "Advanced Health Telematics and Telemedicine"
        },
        {
            "Title": "Smart home solutions: Privacy issues",
            "Publication year": 2017,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:ji7lAbPyDbYC",
            "Publisher": "Springer International Publishing"
        },
        {
            "Title": "A SIP-oriented SPIT management framework",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404808000333",
            "Abstract": "Voice over IP (VoIP) telephony is increasingly gaining popularity among home and business users alike, as a viable alternative to traditional telephony, and is expected to achieve a significant market share in the near future. When this happens, it is also expected that several new threats exploiting the Internet vulnerabilities will appear. One of these is the Spam over Internet Telephony (SPIT). This paper examines in detail the SPIT attack, provides a review and assessment of previously proposed SPIT management techniques and proposes the use of an attack-oriented methodology for thwarting the SPIT threat. This results in a generic SPIT management framework, which combines the strengths of existing solutions, while alleviating their insufficiencies.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:YsMSGLbcyi4C",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Access Control in the Industrial Internet of Things",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-12330-7_5",
            "Abstract": "The Industrial Internet of Things (IIoT) is an ecosystem that consists of – among others – various networked sensors and actuators, achieving mainly advancements related with lowering production costs and providing workflow flexibility. Introducing access control in such environments is considered to be challenging, mainly due to the variety of technologies and protocols in IIoT devices and networks. Thus, various access control models and mechanisms should be examined, as well as the additional access control requirements posed by these industrial environments. To achieve these aims, we elaborate on existing state-of-the-art access control models and architectures and investigate access control requirements in IIoT, respectively. These steps provide valuable indications on what type of an access control model and architecture may be beneficial for application in the IIoT. We describe an access …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:_mQi-xiA4oYC",
            "Publisher": "Springer"
        },
        {
            "Title": "Information Security and Privacy Research (SEC-2012)",
            "Publication year": 2012,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=EYW5BQAAQBAJ&oi=fnd&pg=PR3&dq=info:JYPQSJe3gOAJ:scholar.google.com&ots=sS4uXPFzK2&sig=fKe4r_djV7k0yhOpnIYjnVc3DJ8",
            "Abstract": "This book constitutes the refereed proceedings of the 27th IFIP TC 11 International Information Security Conference, SEC 2012, held in Heraklion, Crete, Greece, in June 2012. The 42 revised full papers presented together with 11 short papers were carefully reviewed and selected from 167 submissions. The papers are organized in topical sections on attacks and malicious code, security architectures, system security, access control, database security, privacy attitudes and properties, social networks and social engineering, applied cryptography, anonymity and trust, usable security, security and trust models, security economics, and authentication and delegation.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:XiVPGOgt02cC",
            "Publisher": "Springer"
        },
        {
            "Title": "Implementing cyber-security measures in airports to improve cyber-resilience",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8534523/",
            "Abstract": "Airports are at the forefront of technological innovation, mainly due to the fact that the number of air travel passengers is exponentially increasing every year. As a result, airports enhance infrastructure's intelligence and evolve as smart facilities to support growth, by offering a pleasurable travel experience, which plays a vital role in increasing revenue of aviation sector. New challenges are coming up, which aviation has to deal and adapt, such as the integration of Industrial IoT in airport facilities and the increased use of Bring Your Own Device from travelers and employees. Cybersecurity is becoming a key enabler for safety, which is paramount in the aviation context. Smart airports strive to provide optimal services in a reliable and sustainable manner, by working around the domains of growth, efficiency, safety andsecurity. This paper researches the implementation rate of cybersecurity measures and best practices …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:e84hm74t-eoC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Using centrality measures in CI dependency risk graphs for efficient risk mitigation",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-26567-4_18",
            "Abstract": "One way to model cascading critical infrastructure failures is through dependency risk graphs. These graphs help assess the expected risk of critical infrastructure dependency chains. This research extends an existing dependency risk analysis methodology towards risk management. The relationship between dependency risk paths and graph centrality measures is explored in order to identify nodes that significantly impact the overall dependency risk. Experimental results using random graphs to simulate common critical infrastructure dependency characteristics are presented. Based on the experimental findings, an algorithm is proposed for efficient risk mitigation. The algorithm can be used to define priorities in selecting nodes for the application of mitigation controls.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:L1USKYWJimsC",
            "Publisher": "Springer"
        },
        {
            "Title": "High level security policies for health: from theory to practice.",
            "Publication year": 2004,
            "Publication url": "https://ebooks.iospress.nl/volumearticle/20859",
            "Abstract": "The design and implementation of a security policy for a healthcare organisation is by no means trivial but it is, at least, feasible, taking into account the wide range of information security and privacy enhancing technologies that are currently available. Considering, however, a shared care environment with the participation of many independent healthcare organisations and the requirement for exchanging electronic healthcare records, the situation becomes much more complex since the implementation of global security policy may turn out to be an over ambitious task. This paper aims to highlight the main sources of complexity and to provide pointers for managing or/and resolving them.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:7T2F9Uy0os0C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cyber-attacks on the Oil & Gas sector: A survey on incident assessment and attack patterns",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9136701/",
            "Abstract": "During the past two decades, oil and gas operational and information technology systems have experienced constant digital growth, closely followed by an increasing number of cyber-attacks on the newly interconnected systems. Adversaries exploit vulnerable accessible device or malware attacks networked services, in an attempt to gain access to critical systems and machinery that are interconnected over networks. Given the importance of the oil and gas sector on the global economy and the diversity of critical systems often being controlled over remote locations, it is highly important to understand and mitigate such attacks. In this paper, we survey cyber-attacks on all three domains of the oil and gas sector (upstream, midstream, downstream) starting from the early 90s up until 2020. For each domain, we document and analyze verified attacks based on real-world reports and published demo attacks on systems …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ITz7TVZQ0sgC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Automatic analysis of attack graphs for risk mitigation and prioritization on large-scale and complex networks in Industry 4.0",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/article/10.1007/s10207-020-00533-4",
            "Abstract": "Threat models and attack graphs have been used more than 20 years by enterprises and organizations for mapping the actions of potential adversaries, analyzing the effects of vulnerabilities and visualizing attack scenarios. Although efficient when describing high-level interactions in simpler enterprise networks, they fall short in modern decentralized systems, especially in microservices architectures and multi-cloud environments with increased complexity and interactions. Most current research focuses on automatically generating attach graphs for such complex environments and deals with scaling and mapping issues, while neglecting to address the overall complexity of actually analyzing and extracting useful information from these overly convoluted models. In this paper, we present a method for automatically analyzing complex attack graphs both in microservices-based and multi-cloud infrastructures. We …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:MnogvFdIBdwC",
            "Publisher": "Springer (https://doi.org/10.1007/s10207-020-00533-4)"
        },
        {
            "Title": "Electronic Governance in the Twilight Zone",
            "Publication year": 2015,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.701.7462&rep=rep1&type=pdf",
            "Abstract": "What's on your must-do list for a perfect Eid? On this# TravelTuesday, we recommend you to enjoy the many off the beaten path & popular attractions Dubai has to offer, or travel by car and discover other Emirates to experience a Five-Star holiday with your loved ones!# eidholidays# eidalfitr# mydubai",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:e0LTWoPxLYMC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cyber attack evaluation methodology",
            "Publication year": 2014,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=hFQJBAAAQBAJ&oi=fnd&pg=PA264&dq=info:8Q7hkZMul_0J:scholar.google.com&ots=w5TLkqcDeO&sig=pjULpuROH5-uUlK0I3rmtaE-Dys",
            "Abstract": "Following the identification on an international basis of cyberspace as a new ‘domain of warfare’, it has become widely (though not fully) accepted that the traditional rules of International Humanitarian Law are also applicable to Computer Network Attacks (CNAs). Despite the fact that there has been considerable progress at the European and International level towards the development of National Cyber Security Strategies and the adoption of an effective comprehensive legal framework of prevention measures against cyber attacks, there is confusion regarding the application of these rules. More specifically, it has not been clarified: a) in which cases do cyber attacks constitute a ‘threat or use of force’so that the prohibition of article 2 (4) of the UN Charter can apply, b) in which cases do cyber attacks constitute a ‘threat to the peace, breach of the peace, or act of aggression’so that the Security Council may decide upon measures to restore international peace and security under Article 42 of the UN Charter, and c) in which cases cyber attacks can be treated as an ‘armed attack’, making it possible for a UN Member State to respond by exercising its legitimate right of self‐-defense under Article 51 of the UN Charter. The difficulty in applying the traditional rules of International Humanitarian Law to categorize cyber attacks stems from a number of factors. The most important of them is the failure to estimate properly the impact of a cyber attack in the host country and in the international environment. Additionally, the inability to positively identify the key actor of an attack makes it often quite hard to handle the issue of ‘attribution’. The aim of this paper is to …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:IRz6iEL74y4C",
            "Publisher": "API"
        },
        {
            "Title": "S-Port: Collaborative security management of Port Information Systems",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6623698/",
            "Abstract": "Port Information and Communication Technology (PICT) systems offer a series of critical services rendering their effective security management an issue of vital importance. Existing regulation, standardization, and risk management methodologies do not adequately address the cyber threats the dependent environment of PICT systems is exposed to. In the SPort project, we identified and addressed these needs by proposing a collaborative environment offering customized security management services targeted at the unique needs of port authorities. The success of S-Port has been deployed in three commercial ports, so as to assist them in self managing security and risks. In this paper, we present the main objectives and core functionalities of S-Port environment, as well as the overall results of its assessment.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:dTyEYWd-f8wC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Critical Infrastructure Protection: A Holistic Methodology for Greece",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-61437-3_2",
            "Abstract": " The protection of Critical Infrastructures (CI) is, by definition, of high importance for the welfare of citizens, due to direct threats (dictated by the current international political situation) and also due to their dependencies at international and European levels. Today, Greece remains one of the countries of the European Union, which has no comprehensive strategy to safeguard national CI, nor any process of developing such an integrated plan, except for some initiatives taken from the General Secretariat of Digital Policy. This paper aims to contribute to: (i) The creation of an inventory of all stakeholders, (legislative, supervisory or regulatory) involved in CI protection in Greece, (ii) the identification of potential national CI, as well as their interdependencies, (iii) the development of a structured identification based on impact assessment methodology for national CI, that takes into account internationally applied CI …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:H_jBuBxbQIAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Interdependencies between Critical Infrastructures: Analyzing the Risk of Cascading Effects",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41476-3_9",
            "Abstract": "One of the most challenging problems, when protecting critical infrastructures, is the identification and assessment of interdependencies. In this paper we examine the possible cumulative effects of a single security incident on multiple infrastructures. Our method provides a way to identify threats that may appear insignificant when examining only first-order dependencies, but may have potentially significant impact if one adopts a more macroscopic view and assesses multi-order dependencies. Based on previous work, we utilize existing first-order dependency graphs, in order to assess the effect of a disruption to consequent infrastructures.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:geHnlv5EZngC",
            "Publisher": "Springer"
        },
        {
            "Title": "Risk-based criticality analysis",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-04798-5_3",
            "Abstract": "Critical infrastructure protection requires the evaluation of the criticality of infrastructures and the prioritization of critical assets. However, criticality analysis is not yet standardized. This paper examines the relation between risk and criticality. It analyzes the similarities and differences in terms of scope, aims, impact, threats and vulnerabilities; and proposes a generic risk-based criticality analysis methodology. The paper also presents a detailed list of impact criteria for assessing the criticality level of infrastructures. Emphasis is placed on impact types that are society-centric and/or sector-centric, unlike traditional risk analysis methodologies that mainly consider the organization-centric impact.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:hC7cP41nSMkC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Evaluating certificate status information mechanisms",
            "Publication year": 2000,
            "Publication url": "https://dl.acm.org/doi/pdf/10.1145/352600.352603",
            "Abstract": "A wide spectrum of certificate revocation mechanisms is currently in use. A number of them have been proposed by standardisation bodies, while some others have originated from academic or private institutions. What is still missing is a systematic and robust framework for the sound evaluation of these mechanisms. We present a mechanism-neutral framework for the evaluation of mechanisms, which collect, process and distribute certificate status information. A detailed demonstration of its exploitation is also provided. The demonstration is mainly based on the evaluation of Certificate Revocation Lists, as well as of the Online Certificate Status Protocol.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:Se3iqnhoufwC",
            "Publisher": "ACM"
        },
        {
            "Title": "e-Passports as a means towards the first world-wide Public Key Infrastructure",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-73408-6_3",
            "Abstract": "Millions of citizens around the world have already acquired their new electronic passport. The e-passport is equipped with contactless communication capability, as well as with a smart card processor enabling cryptographic functionality. Countries are required to build a Public Key Infrastructure to support digital signatures, as this is considered the basic tool to prove the authenticity and integrity of the Machine Readable Travel Documents. The first large-scale worldwide PKI is currently under construction, by means of bilateral trust relationships between Countries. In this paper, we investigate the good practices, which are essential for the establishment of a global identification scheme based on e-passports, together with the security and privacy issues that may arise. We argue that an e-passport may also be exploited in other applications as a globally interoperable PKI-enabled tamperproof device. The …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:_kc_bZDykSQC",
            "Publisher": "Springer"
        },
        {
            "Title": "Cryptology and Network Security (CANS-2014)",
            "Publication year": 2014,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:0ngZmJvimKcC",
            "Publisher": "Greece, Springer"
        },
        {
            "Title": "Human-Centered Specification Exemplars for Critical Infrastructure Environments",
            "Publication year": 2016,
            "Publication url": "https://www.scienceopen.com/hosted-document?doi=10.14236/ewic/HCI2016.93",
            "Abstract": "Specification models of critical infrastructure focus on parts of a larger environment. However, to consider the security of critical infrastructure systems, we need approaches for modelling the sum of these parts; these include people and activities, as well as technology. This paper present human-centered specification exemplars that capture the nuances associated with interactions between people, technology, and critical infrastructure environments. We describe requirements each exemplar needs to satisfy, and present preliminary results developing and evaluating them.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:UmS_249rOGwC",
            "Publisher": "Bournemouth University"
        },
        {
            "Title": "Exploitation of auctions for outsourcing security-critical projects",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/5983912/",
            "Abstract": "ICT outsourcing may introduce several risks. This paper attempts to mitigate this problem by applying an auctioning scheme. By adopting the scheme, the involved organization selects one or more potential outsourced service providers via an auction similar to the FCC spectrum ones. The project is divided in sub-projects, bidders are pre-evaluated, in terms of security and each bid is assessed in terms of cost and appropriate security metrics. The bidding process continues according to the auction rules allocating all the sub-projects to the best bidders. The ultimate goal is to achieve upgraded security, while keeping the cost at a reasonable level and meeting adequate security requirements. In this direction our model provokes competition and motivates providers to place superior bids, in terms of security, while providing flexibility to the organization. The auction process is demonstrated through a case study, where …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:P5F9QuxV20EC",
            "Publisher": "IEEE"
        },
        {
            "Title": "An assurance-by-ontology paradigm proposal: Elements of security knowledge management",
            "Publication year": 2006,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=ZmB39UpxTLUC&oi=fnd&pg=PA15&dq=info:LF8wzrajDZEJ:scholar.google.com&ots=J9327jeG8J&sig=6i4VsjmQsU-gLQ0OeaOIHIabxSQ",
            "Abstract": "The effective management of information and related information systems (IS) of an organization is a very important issue, nowadays. However, the radical changes in IS emphasize the need to better manage information and IS-related risks. Thus, risk management forms a key part of enterprise management and enterprise governance.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:bnK-pcrLprsC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "An integrated architecture for deploying a virtual private medical network over the Web",
            "Publication year": 2001,
            "Publication url": "https://www.tandfonline.com/doi/abs/10.1080/14639230117731",
            "Abstract": "In this paper we describe a pilot architecture aiming at protecting Web-based medical applications through the development of a virtual private medical network. The basic technology, which is utilized by this integrated architecture, is the Trusted Third Party (TTP). In specific, a TTP is used to generate, distribute, and revoke digital certificates to/from medical practitioners and healthcare organizations wishing to communicate in a secure way. Digital certificates and digital signatures are, in particular, used to provide peer and data origin authentication and access control functionalities. We also propose a logical Public Key Infrastructure (PKI) architecture, which is robust, scalable, and based on standards. This architecture aims at supporting large-scale healthcare applications. It supports openness, scalability, flexibility and extensibility, and can be integrated with existing TTP schemes and infrastructures offering …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:puFLaqDw8dcC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Book review: Inside cyber warfare: Mapping the cyber underworld",
            "Publication year": 2012,
            "Publication url": "https://dl.acm.org/doi/abs/10.1016/j.cose.2012.05.006",
            "Abstract": "Book review: Inside Cyber Warfare: Mapping the Cyber Underworld: Computers and Security: \nVol 31, No 6 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search \nBrowse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search \nComputers and Security Periodical Home Latest Issue Archive Authors Affiliations Award \nWinners More HomeBrowse by TitlePeriodicalsComputers and SecurityVol. , No. Book review: \nInside Cyber Warfare: Mapping the Cyber Underworld article Book review: Inside Cyber Warfare: \nMapping the Cyber Underworld Share on Authors: Bill Tsoumas profile image Bill Tsoumas \nDept. of Informatics, Athens University of Economics & Business, 76 Patission Ave., Athens \nGR-10434, Greece Dept. of Informatics, Athens University of Economics & Business, 76 ., -, …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:yIeBiWEAh44C",
            "Publisher": "Elsevier Advanced Technology Publications"
        },
        {
            "Title": "Aviation Cybersecurity and Cyber-Resilience: Assessing Risk in Air Traffic Management",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-00024-0_13.pdf",
            "Abstract": "Civil aviation is the safest transport mode in the world and probably also the most interconnected system of information and communication technology. Cyber-attacks are increasing in quantity and persistence, so the consequences of a successful malicious cyber-attack on civil aviation operations could be severe nowadays. New technologies, extension of connectivity and their integration in the aviation industry, especially in the field of Air Traffic Management (ATM), increase the risk to these critical assets. This chapter examines cyber security challenges and interoperability in ATM systems. We propose an extended threat model for analyzing possible targets and risks involved. We also introduce and analyze cyber resilience aspects in the aviation context and the need for holistic strategy of defense, prevention and response. Under the resilience umbrella, all actors should work on collaborative, risk …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:pUxgyZctzPYC",
            "Publisher": "Springer"
        },
        {
            "Title": "Exploring the protection of private browsing in desktop browsers",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404817300597",
            "Abstract": "Desktop browsers have introduced private browsing mode, a security control which aims to protect users' data that are generated during a private browsing session by not storing them in the filesystem. As the Internet becomes ubiquitous, the existence of this security control is beneficial to users, since privacy violations are increasing, while users tend to be more concerned about their privacy when browsing the web in a post-Snowden era. In this context, this work examines the protection that is offered by the private browsing mode of the most popular desktop browsers in Windows (i.e., Chrome, Firefox, IE and Opera). Our experiments uncover occasions in which even if users browse the web with a private session, privacy violations exist contrary to what is documented by the browser. To raise the bar of privacy protection that is offered by web browsers, we propose the use of a virtual filesystem as the storage …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:T_ojBgVMvoEC",
            "Publisher": "Elesevier"
        },
        {
            "Title": "Secure Electronic Voting; New Trends New Threats",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=6852075754347102420&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:QtA78RmWg5MC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Advanced Persistent Threats: The Empire Strikes Back!",
            "Publication year": 2015,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.701.9635&rep=rep1&type=pdf",
            "Abstract": "• USA: Since 2009 has created the US Cyber Command, an armed-‐forces command, focused on cyberspace operations. US short term plans include to grow the Cyber Command to 6000 people by 2016(and in 2015 the cyber budget is expected to exceed 5 billion USD)",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:BmWJbWwHJAwC",
            "Publisher": "Athens, Greece"
        },
        {
            "Title": "An adaptive policy-based approach to SPIT management",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-88313-5_29",
            "Abstract": "Voice over IP (VoIP) is a key enabling technology, which provides new ways of communication. VoIP technologies take advantage of existing data networks to provide inexpensive voice communications world-wide as a promising alternative to the traditional telephone service. At the same time, VoIP provides the means for transmitting bulk unsolicited calls, namely SPam over Internet Telephony (SPIT). SPIT is, up to a given extend, similar to email spam. However, it is expected to be more frustrating because of the real-time processing requirements of voice calls. In this paper we set the foundations of an adaptive approach that handles SPIT through a policy-based management approach (aSPM). aSPM incorporates a set of rules for SPIT attacks detections, together with appropriate actions and controls that should be enforced so as to counter these attacks. Furthermore, the policy is formally described …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ULOm3_A8WrAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Assessing interdependencies and congestion delays in the aviation network",
            "Publication year": 2020,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/9296210/",
            "Abstract": "Concerning air traffic delays, air transport networks appear to have variable performance and stochastic nature. A delay incident in one airport may affect the operational efficiency of others and generate various side effects to the whole aviation network. Flight delays are a widespread phenomenon nowadays, costing billions to the air transportation economy and degrading passenger's quality of service. Dependency graphs have been proposed in the past to understand the delay propagation phenomenon and analyze such cascading events by using dependency chains. In this work, we propose a risk-based method to analyze interdependencies and congestions in the aviation network. The methodology and the developed tool can assess delay incidents in airports and produce weighted risk dependency graphs, presenting how a delay that occurred in one airport may affect other interconnected airports. Based …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:w-fwKiQwpQAC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Misinformation vs. situational awareness: The art of deception and the need for cross-domain detection",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1424-8220/21/16/5496",
            "Abstract": "The world has been afflicted by the rise of misinformation. The sheer volume of news produced daily necessitates the development of automated methods for separating fact from fiction. To tackle this issue, the computer science community has produced a plethora of approaches, documented in a number of surveys. However, these surveys primarily rely on one-dimensional solutions, i.e., deception detection approaches that focus on a specific aspect of misinformation, such as a particular topic, language, or source. Misinformation is considered a major obstacle for situational awareness, including cyber, both from a company and a societal point of view. This paper explores the evolving field of misinformation detection and analytics on information published in news articles, with an emphasis on methodologies that handle multiple dimensions of the fake news detection conundrum. We analyze and compare existing research on cross-dimensional methodologies. Our evaluation process is based on a set of criteria, including a predefined set of performance metrics, data pre-processing features, and domains of implementation. Furthermore, we assess the adaptability of each methodology in detecting misinformation in real-world news and thoroughly analyze our findings. Specifically, survey insights demonstrate that when a detection approach focuses on several dimensions (e.g., languages and topics, languages and sources, etc.), its performance improves, and it becomes more flexible in detecting false information across different contexts. Finally, we propose a set of research directions that could aid in furthering the development of more …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:JhbybO29vGQC",
            "Publisher": "MDPI"
        },
        {
            "Title": "Risk assessment of multi-order interdependencies between critical information and communication infrastructures",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=16569498352917521812&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:9Nmd_mFXekcC",
            "Publisher": "IGI Global"
        },
        {
            "Title": "Which side are you on? A new Panopticon vs. Privacy",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7223159/",
            "Abstract": "Social media and Web 2.0 have enabled internet users to contribute online content, which may be crawled and utilized for a variety of reasons, from personalized advertising to behaviour prediction/profiling. One negative case scenario is the political affiliation profiling. Our hypothesis is that this scenario is nowadays realistic, applicable to social media, and violates civil rights, privacy and freedom. To demonstrate this, we developed a horror story, i.e., a Panopticon method, in order to reveal this threat and contribute in raising the social awareness over it. The Panopticon relies on data/opinion mining techniques; hence it classifies comments, videos and playlists, collected from the popular social medium YouTube. Afterwards, it aggregates these classifications in order to decide over the users' political affiliation. The experimental test case of the Panopticon is an extensive Greek community of YouTube users. In …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ZfRJV9d4-WMC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "ADoCSI: Towards a transparent mechanism for disseminating Certificate Status Information",
            "Publication year": 2003,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S014036640300080X",
            "Abstract": "Several mechanisms have been proposed for disseminating information regarding the status of a digital certificate, each one with its own advantages and disadvantages. We believe that what is still missing from such mechanisms is transparency. A user should not need to comprehend the mechanics of such mechanisms in order to verify a certificate. In this paper, we present a mechanism called Alternative mechanism for the Dissemination of Certificate Status Information that supports transparency in disseminating Certificate Status Information.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:vV6vV6tmYwMC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Smartphone Forensics: A Proactive Investigation Scheme for Evidence Acquisition",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-30436-1_21",
            "Abstract": "Smartphones constantly interweave into everyday life, as they accompany individuals in different contexts. Smartphones include a combination of heterogeneous data sources, which can prove essential when combating crime. In this paper we examine potential evidence that may be collected from smartphones. We also examine the available connection channels for evidence transfer during a forensic investigation. We propose a Proactive Smartphone Investigation Scheme that focuses on ad hoc acquisition of smartphone evidence. We also, take into consideration the legal implications of the proposed scheme, as it is essential that the scheme includes prevention mechanisms, so as to protect individuals from misuse by investigators or malicious entities.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:vbGhcppDl1QC",
            "Publisher": "Springer"
        },
        {
            "Title": "Autonomy and Civil Disobedience in Cyberspace",
            "Publication year": 2004,
            "Publication url": "https://scholar.google.com/scholar?cluster=5243124873282580170&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:eMMeJKvmdy0C",
            "Publisher": "Papasotiriou Publications"
        },
        {
            "Title": "Using formal distributions for threat likelihood estimation in Cloud-enabled IT risk assessment",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1389128618300446",
            "Abstract": "We present a quantitative business-process risk assessment methodology that utilizes formal mathematical distributions over historical data to enable better granularity and less subjective assessment on cyber-physical systems (CPS) and IT systems that use cloud services in general. The proposed methodology supports risks on asset-based processes associated with cloud computing platforms. ISO and US standards for cloud platforms are used to detect cloud-based attack vectors, threats and vulnerabilities both for CPS and traditional IT systems. Poisson distributions are proposed as a scientific means to quantify the likelihood of threat manifestation for assessing security risks. The key advantage of the presented method is its non-subjective likelihood threat estimation (contrary to current standards) and its ability to assess risk based on novel asset-based processes that fully support cloud services and CPS …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:X4-KO54GjGYC",
            "Publisher": "Unknown"
        },
        {
            "Title": "OntoSPIT: SPIT management through ontologies",
            "Publication year": 2009,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0140366408005276",
            "Abstract": "VoIP enables new ways for communication. At the same time, it provides new means, in terms of transmitting bulk unsolicited messages and calls, namely SPam over Internet telephony (SPIT). In this paper, we propose a conceptual model, based on an underlying ontology, which describes the SPIT domain. The ontology provides capabilities, such as modeling the SPIT phenomenon in a SIP-based VoIP environment, a common understanding of SPIT domain, as well as reusable SPIT-related knowledge interoperability, aggregation and reasoning. We demonstrate that the proposed ontology, combined with a set of SPIT identification criteria, as its underlying axioms and rules, could enhance the correlation and management of SPIT incidents. It could also support SPIT detection, thus facilitating the better protection of VoIP environments in a holistic, cooperative, and effective way.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:kNdYIx-mwKoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Insider threat prevention through Open Source Intelligence based on Online Social Networks",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=3593563162568911705&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:kVjdVfd2voEC",
            "Publisher": "Keynote address"
        },
        {
            "Title": "Addressing cultural dissimilarity in the information security management outsourcing relationship",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-74409-2_5",
            "Abstract": "Organizational culture influences the way a) information security is perceived, b) security countermeasures are adopted, and c) the organization reacts to the cultural changes of a new security program. In Information Security Management Outsourcing (ISMO), cultural differences may arise between the organization and the provider, for example conflict between the countermeasures applied by the provider and the company’s internal policies. We propose a conceptual framework of security mechanisms in order organizations that choose ISMO to identify and manage cultural dissimilarity.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:TFP_iSt0sucC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Automatic Defense Against Zero-day Polymorphic Worms in Communication Networks",
            "Publication year": 2014,
            "Publication url": "https://pascal-francis.inist.fr/vibad/index.php?action=getRecordDetail&idt=28361776",
            "Abstract": "Pascal 001 Exact sciences and technology/001D Applied sciences/001D02 Computer science; control theory; systems/001D02B Software/001D02B07 Memory organisation. Data processing/001D02B07C Memory and file management (including protection and security)",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:OcBU2YAGkTUC",
            "Publisher": "Elsevier Science"
        },
        {
            "Title": "An intensive analysis of the availability of security and privacy browser add-ons",
            "Publication year": 2015,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:-7ulzOJl1JYC",
            "Publisher": "Springer"
        },
        {
            "Title": "An insider threat prediction model",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-15152-1_3",
            "Abstract": "Information systems face several security threats, some of which originate by insiders. This paper presents a novel, interdisciplinary insider threat prediction model. It combines approaches, techniques, and tools from computer science and psychology. It utilizes real time monitoring, capturing the user’s technological trait in an information system and analyzing it for misbehavior. In parallel, the model is using data from psychometric tests, so as to assess for each user the predisposition to malicious acts and the stress level, which is an enabler for the user to overcome his moral inhibitions, under the condition that the collection of such data complies with the legal framework. The model combines the above mentioned information, categorizes users, and identifies those that require additional monitoring, as they can potentially be dangerous for the information system and the organization.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:mB3voiENLucC",
            "Publisher": "Springer"
        },
        {
            "Title": "Phishing campaigns in corporate water",
            "Publication year": 2017,
            "Publication url": "https://books.google.com/books?hl=en&lr=&id=uFA8DwAAQBAJ&oi=fnd&pg=PA34&dq=info:26p-YrAdvS8J:scholar.google.com&ots=YTq-gAZp4B&sig=75zRTDylHEvzkStNzhYm0mte9Vo",
            "Abstract": "Social Engineering is considered to be a blend of Computer and Psychology Sciences. In the context of information security, it is defined as “the psychological manipulation of people into performing actions or divulging confidential information”. A very common and popular social engineering attack against valuable assets of companies, organizations and individuals, is phishing. This method remains as the top threat vector for cyberattacks, due to the indisputable fact that the exploitation of human vulnerabilities continues to be the most attractive, and at the same time, successful path for achieving it. Such attacks are used prevalently across the adversary spectrum, from novice cyber-criminals to advanced nation-state operations. This paper grapples with the development of a platform that evaluates human resources of an information system, by pinpointing potential weaknesses that can be used to exploit the human factor, aiming at an increase in security awareness level of users being assessed. During our research, we gathered, studied, classified and evaluated tools used to implement phishing attacks. Afterwards, we developed an integrated web-based framework capable of unifying those tools properly, performing a tool chain. Additionally, we devised plausible attack scenarios, with their anticipated results. In our research, we developed a reporting system, geared by predetermined custom metrics per victims' behavior. Furthermore, apart from the framework itself, our contribution includes spotting several legal issues arising from its usage at workplaces. We also prepared a questionnaire for companies or organizations to help them set …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:mJbmKSuM8toC",
            "Publisher": "Academic Conferences International Limited"
        },
        {
            "Title": "The insider threat in cloud computing",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-41476-3_8",
            "Abstract": "Cloud computing is an emerging technology paradigm, enabling and facilitating the dynamic and versatile provision of computational resources and services. Even though the advantages offered by cloud computing are several, there still exist second thoughts on the security and privacy of the cloud services. Use of cloud services affects the security posture of organizations and critical infrastructures, therefore it is necessary that new threats and risks introduced by this new paradigm are clearly understood and mitigated. In this paper we focus on the insider threat in cloud computing, a topic which has not received research focus, as of now. We address the problem in a holistic way, differentiating between the two possible scenarios: a) defending against a malicious insider working for the cloud provider, and b) defending against an insider working for an organization which chooses to outsource parts or the …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:sSrBHYA8nusC",
            "Publisher": "Springer"
        },
        {
            "Title": "Combining invariant violation with execution path classification for detecting multiple types of logical errors and race conditions",
            "Publication year": 2016,
            "Publication url": "https://www.academia.edu/download/64588486/eb0624ad0d94e10df2cb0601a0a4df22f72a.pdf",
            "Abstract": "Context: Modern automated source code analysis techniques can be very successful in detecting a priori defined defect patterns and security vulnerabilities. Yet, they cannot detect flaws that manifest due to erroneous translation of the software’s functional requirements into the source code. The automated detection of logical errors that are attributed to a faulty implementation of applications’ functionality, is a relatively uncharted territory. In previous research, we proposed a combination of automated analyses for logical error detection. In this paper, we develop a novel business-logic oriented method able to filter mathematical depictions of software logic in order to augment logical error detection, eliminate previous limitations in analysis and provide a formal tested logical error detection classification without subjective discrepancies. As a proof of concept, our method has been implemented in a prototype tool called PLATO that can detect various types of logical errors. Potential logical errors are thus detected that are ranked using a fuzzy logic system with two scales characterizing their impact:(i) a Severity scale, based on the execution paths’ characteristics and Information Gain,(ii) a Reliability scale, based on the measured program’s Computational Density. The method’s effectiveness is shown using diverse experiments. Albeit not without restrictions, the proposed automated analysis seems able to detect a wide variety of logical errors, while at the same time limiting the false positives.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:sA9dB-pw3HoC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "A qualitative approach to information availability",
            "Publication year": 2000,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35515-3_5",
            "Abstract": "During the last fifty years Information and Communication Technology (ICT) has contributed to almost all sectors of organized societies. As a result, information security is fundamental for several social and business processes that rely on ICT. One dimension of information security concerns availability of information and computational resources. It is essential for a system’s correct operation and its acceptance from end-users to respond with proper reaction times to authorized requests. But whereas other security parameters have been studied and analysed very well, availability has not. Throughout this paper this fundamental parameter of ICT security is under study through a qualitative perspective. We aim at providing the basis for a consequent formalistic foundation of information availability. Approaches like these may be useful for the conceptual description of the problem domain, whilst this …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:4DMP91E08xMC",
            "Publisher": "Kluwer"
        },
        {
            "Title": "Social media profiling: A Panopticon or Omniopticon tool?",
            "Publication year": 2014,
            "Publication url": "https://www.infosec.aueb.gr/Publications/2014-SSN-Privacy%20Social%20Media.pdf",
            "Abstract": "Online Social Networks and Media indicate and incorporate the shift to interpersonal, horizontal, and mutual communication and, thus, information aggregation. Online content (namely YouTube videos and comments or Tweets) along with online relations (friendships, followings, mentions, comments etc.) may be crawled and utilized for a variety of purposes including user/usage profiling and behavior prediction. In our previous research we have demonstrated that it is possible and even potentially trivial (by utilizing a simple personal computer and a broadband internet connection) to extract sensitive, personal information such as political beliefs, psychosocial characteristics (narcissism and predisposition towards law enforcement) etc. about social media users in an automated manner via data crawling, data aggregation, machine learning and graph and content analysis of the collected dataset of YouTube and Twitter Open Source Intelligence. Web 2.0 technological features combined with voluntary exposure to an indefinite audience in social media give rise to traditional surveillance as Government is enabled to connect the dots, combine information about political beliefs and every-day activities and generate mass user profiles on the base of identifying patterns. Despite the lack of centralized control over the Internet, its platforms and applications allow multilevel and latent surveillance, thus pose new risks for individuals by forming new power relations and asymmetries. Our research highlights how Web 2.0 and social media (YouTube and Twitter) may become a topos of participatory panopticism, an omniopticon in which the many watch the …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:S16KYo8Pm5AC",
            "Publisher": "SSN"
        },
        {
            "Title": "An ontology-based approach to information systems security management",
            "Publication year": 2005,
            "Publication url": "https://link.springer.com/chapter/10.1007/11560326_12",
            "Abstract": "Complexity of modern information systems (IS), impose novel security requirements. On the other hand, the ontology paradigm aims to support knowledge sharing and reuse in an explicit and mutually agreed manner. Therefore, in this paper we set the foundations for establishing a knowledge-based, ontology-centric framework with respect to the security management of an arbitrary IS. We demonstrate that the linking between high-level policy statements and deployable security controls is possible and the implementation is achievable. This framework may support critical security expert activities with respect to security requirements identification and selection of certain controls and countermeasures. In addition, we present a structured approach for establishing a security management framework and identify its critical parts. Our security ontology is being represented in a neutral manner, based on well …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:qjMakFHDy7sC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A knowledge-based repository model for security policies management",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-45215-7_9",
            "Abstract": "Most organizations currently build customized security policies by extending the principles and guidelines suggested by generic security policies. This method cannot guarantee that the resulting policies are compatible, neither it can ensure that the resulting protection levels are equivalent. We introduce a Security Policies Repository (SPR), which consists of a knowledge base, storing multiple security policies in a structured way. The SPR facilitates the juxtaposition of security policies, in order to detect, analyze, and resolve conflicts, and to compare and negotiate the protection level of each of the co- operating information systems. Reconciliation of security policies is achieved by means of developing mutually accepted meta-policies.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:uWQEDVKXjbEC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "A CBK for information security and critical information and communication infrastructure protection",
            "Publication year": 2008,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874548208000103",
            "Abstract": "A Common Body of Knowledge (CBK) is a way to conceptually represent the knowledge of a discipline. It can serve as a guide when designing a curriculum, a course, or a training program, as it describes and sets the boundaries of a knowledge field. In this paper, we aim at extending our previous work on creating a CBK that can serve as the basis of an Information Security and Critical Information and Communication Infrastructure Protection (ISCIP) curriculum. It can also be advisory in terms of professional certification and accreditation, or when designing training or awareness programs. It views ISCIP as a multidisciplinary field, and presents the contents of its proposed domains in a more complete and detailed analysis than existing approaches.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:iH-uZ7U-co4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Elaborating quantitative approaches for IT security evaluation",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35586-3_5",
            "Abstract": "Information Systems security evaluation is a sine qua non requirement for effective IT security management, as well as for establishing trust among different but cooperating business partners. This paper initially provides a critical review of traditionally applied evaluation and certification schemes. Based upon this review, the paper stresses the need for an approach that is quantitative in nature and can address the problem of IS operational security. Then, such an approach is presented, mainly based on an existing complex of models (CEISOQ) for evaluating IS operation quality. It is argued that there are certain benefits if this approach is applied in combination with the traditional qualitative ones.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:f2IySw72cVMC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "Audio CAPTCHA for SIP-based VoIP",
            "Publication year": 2009,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-01244-0_3",
            "Abstract": "Voice over IP (VoIP) introduces new ways of communication, while utilizing existing data networks to provide inexpensive voice communications worldwide as a promising alternative to the traditional PSTN telephony. SPam over Internet Telephony (SPIT) is one potential source of future annoyance in VoIP. A common way to launch a SPIT attack is the use of an automated procedure (bot), which generates calls and produces audio advertisements. In this paper, our goal is to design appropriate CAPTCHA to fight such bots. We focus on and develop audio CAPTCHA, as the audio format is more suitable for VoIP environments and we implement it in a SIP-based VoIP environment. Furthermore, we suggest and evaluate the specific attributes that audio CAPTCHA should incorporate in order to be effective, and test it against an open source bot implementation.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:mVmsd5A6BfQC",
            "Publisher": "Springer"
        },
        {
            "Title": "Consumer online-privacy and anonymity protection using infomediary schemes",
            "Publication year": 2001,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/972639/",
            "Abstract": "The rapid evolution of the Internet may largely depend on gaining and maintaining the trust of users. This possibility may especially rule enterprises whose financial viability depends on electronic commerce. Customers will neither have the time, the ability or the endurance to work out the best deals with vendors, nor will vendors have time to bargain with every customer. In order for customers to strike the best bargain with vendors, they need a privacy supporter, an information intermediary or \"infomediary\". Infomediaries will become the custodians, agents and brokers of customer personal information exchanged via the Internet, while at the same time protecting their privacy. There is a scale between security and privacy that currently leans towards security; security adopts strong user authentication mechanisms. In order to control access to personal data, while privacy requires loose authentication in order to …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:lmc2jWPfTJgC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analysis and classification of mitigation tools against cyber-attacks in the COVID-19 era",
            "Publication year": 2021,
            "Publication url": "https://www.hindawi.com/journals/scn/2021/3187205/",
            "Abstract": "The COVID-19 outbreak has forced businesses to shift to an unprecedented “work from home” company environment. While this provides advantages for employees and businesses, it also leads to a multitude of shortcomings, most prevalent of which is the emergence of additional security risks. Previous to the outbreak, company computer networks were mainly confined within its facilities. The pandemic has now caused this network to “spread thin,” as the majority of employees work remotely. This has opened up a variety of new vulnerabilities, as workers’ cyber protection is not the same at home as it is in office. Although the effects of the virus are now subsiding, working remotely has embedded itself as the new normal. Thus, it is imperative for company management to take the necessary steps to ensure business continuity and be prepared to deal with an increased number of cyber threats. In our research, we provide a detailed classification for a group of tools which will facilitate risk mitigation and prevention. We also provide a selection of automated tools such as vulnerability scanners, monitoring and logging tools, and antivirus software. We outline each tool using tables, to show useful information such as advantages, disadvantages, scalability, cost, and other characteristics. Additionally, we implement decision trees for each category of tools, in an attempt to assist in navigating the large amount of information presented in this paper. Our objective is to provide a multifaceted taxonomy and analysis of mitigation tools, which will support companies in their endeavor to protect their computer networks. Our contribution can also help companies …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:0paDrhnEFY0C",
            "Publisher": "Wiley"
        },
        {
            "Title": "Profiling Online Social Networks users: An Omniopticon tool",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSNM.2017.10012921",
            "Abstract": "Online social networks (OSN) and media indicate and incorporate the shift to interpersonal, horizontal and mutual communication and, thus information aggregation. In our previous research we have demonstrated that it is possible and potentially trivial to extract personal sensitive information such as political beliefs and psychosocial about OSN users in an automated manner. Our research highlights how Web 2.0 and OSNs (YouTube and Twitter) may become a topos of participatory panopticism, an omniopticon in which the many watch the many and can reconstruct sensitive information out of seemingly anonymous data/content. We focus on the results of this type of surveillance that facilitates the exculpation of such penetrating and privacy-violating technologies and amplifies the threshold of societal tolerance towards a panopticon-like state of surveillance. Furthermore, we analyse and discuss implications of …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:kJDgFkosVoMC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Negative MWOM and value co-destruction during destination crises",
            "Publication year": 2019,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/BPMJ-07-2019-0278/full/html",
            "Abstract": "The purpose of this paper is to examine the impact of microblogging word of mouth (MWOM) through twitter on value co-destruction for Athens, as a tourism destination facing a sustained crisis. The study demonstrates the sentiment and sharing evolution of tweets, illustrating the value co-destruction of a tourism destination. Overall, the study expands understanding on the online footprints of MWOM in the field of tourism.It uses social media focused data mining and sentiment analysis, to analyze more than 90,000 tweets posted by top twitter influencers between 2013 and 2015. The methodology that the authors have adopted follows seven steps: first, identification of the top-5 twitter influencers who use the hashtag #Athens, based on their klout score; second, collection of tweets from the top-5 twitter influencers, for the period from January 2013 until June 2015; third, collection …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:HKviVsUxM5wC",
            "Publisher": "Emerald Publishing"
        },
        {
            "Title": "Special issue-Realizing security into the electronic health record-Introduction",
            "Publication year": 2004,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:_B80troHkn4C",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Avoiding network detection using packet bit-masking",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:Y0RG-0fxPaAC",
            "Publisher": "ScitePress"
        },
        {
            "Title": "Roles of ICT in the Information Society",
            "Publication year": 2007,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-47650-6_6",
            "Abstract": "The strategy of the European Union is to establish Europe as “the largets knowledge base economy” by 2010 (Lisbon Strategy). This is supported by several programs, esp. also addressing developments of Information and Communication Technologies with some emphasis on security.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:eIKNFFVQvJAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Can we trust this user? Predicting insider’s attitude via YouTube usage profiling",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6726229/",
            "Abstract": "Addressing the insider threat is a major issue in cyber and corporate security in order to enhance trusted computing in critical infrastructures. In this paper we study the psychosocial perspective and the implications of insider threat prediction via social media, Open Source Intelligence and user generated content classification. Inductively, we propose a prediction method by evaluating the predisposition towards law enforcement and authorities, a personal psychosocial trait closely connected to the manifestation of malevolent insiders. We propose a methodology to detect users holding negative attitude towards authorities. For doing so, we facilitate a brief analysis of the medium (YouTube), machine learning techniques and a dictionary-based approach, in order to detect comments expressing negative attitude. Thus, we can draw conclusions over a user behavior and beliefs via the content the user generated within …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:MLfJN-KU85MC",
            "Publisher": "IEEE"
        },
        {
            "Title": "3D printing and its regulation dynamics: The World in front of a paradigm shift",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.702.3365&rep=rep1&type=pdf",
            "Abstract": "3D printing is increasingly being considered capable to do for manufacturing what the Internet did for information. While the technology is already being deployed, limited studies have been advanced on its anticipated effects. After offering a “primer” of the emerging technology in question, this paper continues by elaborating on its possible impacts in architecture, aesthetics and design. It then attempts to map its impact in the political, economic, industrial and social spheres. The paper concludes by advancing a discussion on the different regulatory approaches that could be adopted, along with the relevant key concerns.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:GtLg2Ama23sC",
            "Publisher": "Law Library (Nomiki Vivliothiki)"
        },
        {
            "Title": "Securing transportation-critical infrastructures: Trends and perspectives",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-33448-1_24",
            "Abstract": "Critical infrastructure Protection (CIP) includes ensuring the resilience of transportation infrastructures. This sector is considered vital worldwide due to its economic importance and due to the various interdependencies with other infrastructures and sectors. This paper aims at examining the current state in national policies and in research regarding the protection of transport infrastructures. It examines methods to model interdependencies and to assess risk suitable for transport CIP. It recommends future steps for research in this sector.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:RYcK_YlVTxYC",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "On Business Logic Vulnerabilities Hunting: The APP_LogGIC Framework",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38631-2_18",
            "Abstract": "While considerable research effort has been put in the identification of technical vulnerabilities, such as buffer overflows or SQL injections, business logic vulnerabilities have drawn limited attention. Logic vulnerabilities are an important class of defects that are the result of faulty application logic. Business logic refers to requirements implemented in algorithms that reflect the intended functionality of an application, e.g. in an online shop application, a logic rule could be that each cart must register only one discount coupon per product. In our paper, we extend a novel heuristic and automated method for the detection of logic vulnerabilitieswhich we presented in a previous publication. This method detects logic vulnerabilities and asserts their criticality in Java GUI applications using dynamic analysis and static together with a fuzzy logic system in order to compare and rank its findings, in an effort to minimize …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:SdhP9T11ey4C",
            "Publisher": "Springer Berlin Heidelberg"
        },
        {
            "Title": "Delegate the smartphone user? Security awareness in smartphone platforms",
            "Publication year": 2013,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404812001733",
            "Abstract": "Smartphone users increasingly download and install third-party applications from official application repositories. Attackers may use this centralized application delivery architecture as a security and privacy attack vector. This risk increases since application vetting mechanisms are often not in place and the user is delegated to authorize which functionality and protected resources are accessible by third-party applications. In this paper, we mount a survey to explore the security awareness of smartphone users who download applications from official application repositories (e.g. Google Play, Apple's App Store, etc.). The survey findings suggest a security complacency, as the majority of users trust the app repository, security controls are not enabled or not added, and users disregard security during application selection and installation. As a response to this security complacency we built a prediction model to identify …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:K3LRdlH-MEoC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Automatic detection of various malicious traffic using side channel features on TCP packets",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-99073-6_17",
            "Abstract": "Modern intrusion detection systems struggle to detect advanced, custom attacks against most vectors; from web application injections to malware reverse connections with encrypted traffic. Current solutions mostly utilize complex patterns or behavioral analytics on software, user actions and services historical data together with traffic analysis, in an effort to detect specific types of attacks. Still, false positives and negatives plague such systems. Behavioral-based security solutions provides good results but need large amounts of time and data to train (often spanning months or even years of surveillance) - especially when encryption comes into play. In this paper, we present a network traffic monitoring system that implements a detection method using machine learning over side channel characteristics of TCP/IP packets and not deep packet inspection, user analytics or binary analysis. We were able to …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:RfUwGJFMQ-0C",
            "Publisher": "Springer (LNCS 11099)"
        },
        {
            "Title": "History of Information: The case of Privacy and Security in Social Media",
            "Publication year": 2014,
            "Publication url": "https://www.infosec.aueb.gr/Publications/INFOHIST-2014%20Legal%20Publications.pdf",
            "Abstract": "Web 2.0 and Social media have widened society’s opportunities for communication amusement and networking, while enabling internet users to contribute online content. The information flows created, along with Open Source Intelligence techniques, can be crawled and processed for a variety of reasons from personalized advertising to behaviour prediction/profiling. In this paper, our goal is to present two horror stories from the digital world of Social Media, in order to:(a). Present an insider threat prediction method by (e) valuating a users’ personality trait of narcissism, which is deemed to be closely connected to the manifestation of malevolent insiders, as it was developed via Twitter.(b). Raise user awareness over political profiling and data processing for discriminative purposes, via a methodology applied to YouTube. As both methodologies set user’s privacy and dignity at stake, we provide the reader with an analysis of the legal means for each case, so as to effectively be prevented from a privacy violation threat and also present the exceptional cases, such as the selection of security officers of critical infrastructures, where methodologies to detect the insider threat could be used.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:_FM0Bhl9EiAC",
            "Publisher": "Law Library (Nomiki Vivliothiki)"
        },
        {
            "Title": "Using logical error detection in Remote-Terminal Units to predict initiating events of Critical Infrastructures failures",
            "Publication year": 2015,
            "Publication url": "https://scholar.google.com/scholar?cluster=8520375659376453205&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:PYBJJbyH-FwC",
            "Publisher": "Springer (LNCS 9190)"
        },
        {
            "Title": "A multi-layer criticality assessment methodology based on interdependencies",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404810000210",
            "Abstract": "In this paper we propose a holistic Criticality Assessment methodology, suitable for the development of an infrastructure protection plan in a multi-sector or national level. The proposed methodology aims to integrate existing security plans and risk assessments performed in isolated infrastructures, in order to assess sector-wide or intra-sector security risks. In order to achieve this, we define three different layers of security assessments with different requirements and goals; the operator layer, the sector layer and the intra-sector or national layer. We determine the characteristics of each layer, as well as their interdependencies. In this way, existing security plans can be fully exploited in order to provide a “shortcut” for the development of security plans for complex inter-dependent infrastructures. A key element in the proposed methodology is the formal definition of interdependencies between different infrastructures …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:R3hNpaxXUhUC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Evaluating the effects of cyber-attacks on critical infrastructures in the context of Tallinn Manual",
            "Publication year": 2017,
            "Publication url": "https://www.infosec.aueb.gr/Publications/NATO-NMIOTC-2017-Cyber_attacks_Tallinn_manual.pdf",
            "Abstract": "The Internet of Things (IoT), in which billions of things such as devices, applications and networks, are interconnected to each other and are capable to interact without any human intervention, is transforming the way of life. Public safety, transportation and communication, energy, healthcare, logistics, government and education are using cute-edging technologies such as intelligent sensors, wireless communication, cloud computing and data analysis techniques, with a variety of applications within different infrastructures in order to provide instant access to information, to communication and to create new economic opportunities. However, the more Critical Information Infrastructures (CII) are becoming independent the higher the vulnerability of states and the well-being of societies and citizens. The increasing number and complexity of cyber-attacks on state’s CII in recent years has been transforming cyberspace into a new battlefield where “the mouse and the keyboard being the new weapons” bringing out “cyber warfare” as the “5th dimension of war”. In this paper a systematic modeling methodology is presented for evaluating the effects of cyber-attacks on state’s CII in the context of Tallinn Manual. The analysis is focused on the United Nations Charter’s normative scheme of the “use of force” in order to define whether these attacks constitute a wrongful “use of force” under the principles of international law. In order this to be achieved the qualitative criteria for recognizing the impact of cyber-attacks as proposed by the International Group of Experts (IGE) in the Tallinn Manual has been used. Furthermore, Multi-attribute Decision Making (MADM …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:4QKQTXcH0q8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "Smartphone security evaluation: The malware attack case",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6732369/",
            "Abstract": "The adoption of smartphones, devices transforming from simple communication devices to ‘smart’ and multipurpose devices, is constantly increasing. Amongst the main reasons are their small size, their enhanced functionality and their ability to host many useful and attractive applications. However, this vast use of mobile platforms makes them an attractive target for conducting privacy and security attacks. This scenario increases the risk introduced by these attacks for personal mobile devices, given that the use of smartphones as business tools may extend the perimeter of an organization's IT infrastructure. Furthermore, smartphone platforms provide application developers with rich capabilities, which can be used to compromise the security and privacy of the device holder and her environment (private and/or organizational). This paper examines the feasibility of malware development in smartphone platforms by …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:l7t_Zn2s7bgC",
            "Publisher": "SciTekPress"
        },
        {
            "Title": "Security and Privacy in the Age of Uncertainty (SEC-2003)",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:pqnbT2bcN3wC",
            "Publisher": "Kluwer Academic Publishers"
        },
        {
            "Title": "A data protection scheme for a remote vital signs monitoring healthcare service",
            "Publication year": 2000,
            "Publication url": "https://europepmc.org/article/med/11086971",
            "Abstract": "Personal and medical data processed by Healthcare Information Systems must be protected against unauthorized access, modification and withholding. Security measures should be selected to provide the required level of protection in a cost-efficient manner. This is only feasible if specific characteristics of the information system are examined on a basis of a risk analysis methodology. This paper presents the results of a risk analysis, based on the CRAMM methodology, for a healthcare organization offering a patient home-monitoring service through the transmission of vital signs, focusing on the identified security needs and the proposed countermeasures. The architectural and functional models of this service were utilized for identifying and valuating the system assets, the associated threats and vulnerabilities, as well as for assessing the impact on the patients and on the service provider, should the security of any of these assets is affected. A set of adequate organizational, administrative and technical countermeasures is described for the remote vital signs monitoring service, thus providing the healthcare organization with a data protection framework that can be utilized for the development of its own security plan.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:BrmTIyaxlBUC",
            "Publisher": "Taylor & Francis"
        },
        {
            "Title": "Innovative Security Management Services for Maritime Environment",
            "Publication year": 2016,
            "Publication url": "https://infosec.aueb.gr/Publications/NATO-2016%20Ntouskas%20Gritzalis.pdf",
            "Abstract": "• Innovative, collaborative, cost effective and user friendly security consultancy environment.• Can be used by different type of organizations in order to collaboratively manage their information security.• Offers a bundle of targeted services to the ICT users in order to guide them to securely manage their ICT systems.• Based on the PDCA model of the ISO27001 security standard.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:I2jIoRS3jIgC",
            "Publisher": "NMIOTC"
        },
        {
            "Title": "Towards an interdisciplinary information security education model",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=15410215740882931598&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:B3FOqHPlNUQC",
            "Publisher": "Moscow Engineering Physics Institute"
        },
        {
            "Title": "Stress level detection via OSN usage pattern and chronicity analysis: an OSINT threat intelligence module",
            "Publication year": 2017,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404816301742",
            "Abstract": "Online Social Networks (OSN) are not only a popular communication and entertainment platform but also a means of self-representation. In this paper, we adopt an interdisciplinary approach combining Open Source Intelligence (OSINT) and user-generated content classification techniques with a user-driven stress test as applied to a Greek community of OSN users. The main goal of the paper is to study the chronicity of the stress level users experience, as depicted by OSN user generated content. In order to achieve that, we investigate whether collected data are able to facilitate the process of stress level detection. To this end, we perform unsupervised flat data classification of the user-generated content and formulate two working clusters which classify usage patterns that depict medium-to-low and medium-to-high stress levels respectively. To address the main goal of the paper, we divide user-generated content …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:eGYfIraVYiQC",
            "Publisher": "Elesevier"
        },
        {
            "Title": "Towards Indeterminacy-Tolerant Access Control in the IoT",
            "Publication year": 2019,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-10543-3_4",
            "Abstract": "The ultimate goal of any access control system is to assign precisely the necessary level of access (i.e., no more and no less) to each subject. Meeting this goal is challenging in an environment that is inherently scalable, heterogeneous and dynamic as the Internet of Things (IoT). This holds true as the volume, velocity and variety of data produced by wireless sensors, RFID tags and other enabling technologies in IoT introduce new challenges for data access. Traditional access control methods that rely on static, pre-defined access policies do not offer flexibility in dealing with the new challenges of the dynamic environment of IoT, which has been extensively studied in the relevant literature. This work, defines and studies the indeterminacy challenge for access control in the context of IoT, which to the best of our knowledge has not been studied in the relevant literature. The current access control models, even …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:WIXB4To3Tx4C",
            "Publisher": "Springer"
        },
        {
            "Title": "PyTHIA: Towards anonymity in authentication",
            "Publication year": 2001,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-306-46998-7_1",
            "Abstract": "There is a scale between authentication and anonymity, which is currently leaning towards the side of authentication, when it comes to e-commerce. Service providers and merchants are usually keeping track of user-related information in order to construct behavioural profiles of their customers. Service providers and merchants also correlate profiles of this kind, stemming from different sources, in order to increase their profit. This correlation is usually performed with the use of Unified Codes. Authentication, confidentiality, integrity, authentication, and non-repudiation are necessary functionalities for enabling e-commerce. Most of the currently used mechanisms that support these services do not provide anonymity. This paper presents PyTHIA, a mechanism, which is based on the use of Message Digest Algorithms and the intermediation of Trusted Third Parties in order to provide anonymity to e-commerce …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:4JMBOYKVnBMC",
            "Publisher": "Kluwer Academics Publisher"
        },
        {
            "Title": "Secure Electronic Voting",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:u5HHmVD_uO8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Readiness exercises: Are risk assessment methodologies ready for the Cloud?",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-41196-1_6",
            "Abstract": "Cloud computing is a type of service that allows the use of computing resources from a distance, rather than a new technology. Various services exist on-demand, ranging from data storage and processing to software as a service, like email and developing platforms. Cloud computing enables ubiquitous, on-demand access over the net to a shared pool of configurable resources, like servers, applications, etc. that can be accessed, altered or even restored rapidly with minimal service provider interaction or management effort. Still, due to the vast growth of cloud computing, new security issues have been introduced. Key factors are the loss of control over any outsourced resources and cloud’s computing inherent security vulnerabilities. Managing these risks requires the adoption of an effective risk management method, capable of involving both the Cloud customer and the Cloud Service Provider. Risk assessment …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:cTy_cm4PQvYC",
            "Publisher": "Springer (Learning and Analytics in Intelligent Systems)"
        },
        {
            "Title": "SPIT identification criteria implementation: Effectiveness and lessons learned",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-09699-5_25",
            "Abstract": "While VoIP enables new means for communication, it may also provide a new way of transmitting bulk unsolicited messages and calls, namely SPam over Internet Telephony (SPIT). In this paper, we present the phases of a SPIT management process and we form a set of SPIT identification criteria, which are needed in order to characterize a call as SPIT, or a caller as spitter. Then, we present briefly the currently existing anti-SPIT frameworks, so as to examine which of the SPIT identification criteria is fulfilled by each framework, thus providing an insight on which criteria a technique should cope with, as well as how one can evaluate and combine existing approaches, in order to effectively mitigate SPIT. Finally, we implement a list of the criteria in our lab environment in order to examine the applicability of these controls in a Session Initiation Protocol (SIP) environment.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:aqlVkmm33-oC",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "A game-theoretic analysis of preventing spam over Internet Τelephony with audio CAPTCHA-based authentication",
            "Publication year": 2014,
            "Publication url": "https://content.iospress.com/articles/journal-of-computer-security/jcs496",
            "Abstract": "Spam over Internet Telephony (SPIT) is a potential source of disruption in Voice over IP (VoIP) systems. The use of anti-SPIT mechanisms, such as filters and audio CAPTCHA (Completely Automated Public Turing Test to Tell Computer and Humans Apart) can prevent unsolicited calls and lead to less unwanted traffic. In this paper, we present a game-theoretic model, in which the game is played between SPIT senders and internet telephony users. The game includes call filters and audio CAPTCHA, so as to classify incoming calls as legitimate or malicious. We show how the resulting model can be used to decide upon the trade-offs present in this problem and help us predict the SPIT sender’s behavior. We also highlight the advantages in terms of SPIT call reduction of merely introducing CAPTCHA, and provide experimental verification of our results.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:YohjEiUPhakC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Why we need standardisation in healthcare security",
            "Publication year": 2002,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-60750-913-4-7",
            "Abstract": "This chapter presents the benefits resulting from standardisation in the field of Security in Healthcare Information Systems (HIS). Especially in the EU, standardisation appears as a key element for the effectiveness of the Single Market and the competitiveness of European industry.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:RHpTSmoSYBkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Contextualized filtering for shared cyber threat information",
            "Publication year": 2021,
            "Publication url": "https://www.mdpi.com/1424-8220/21/14/4890",
            "Abstract": "Cyber threat information sharing is an imperative process towards achieving collaborative security, but it poses several challenges. One crucial challenge is the plethora of shared threat information. Therefore, there is a need to advance filtering of such information. While the state-of-the-art in filtering relies primarily on keyword- and domain-based searching, these approaches require sizable human involvement and rarely available domain expertise. Recent research revealed the need for harvesting of business information to fill the gap in filtering, albeit it resulted in providing coarse-grained filtering based on the utilization of such information. This paper presents a novel contextualized filtering approach that exploits standardized and multi-level contextual information of business processes. The contextual information describes the conditions under which a given threat information is actionable from an organization perspective. Therefore, it can automate filtering by measuring the equivalence between the context of the shared threat information and the context of the consuming organization. The paper directly contributes to filtering challenge and indirectly to automated customized threat information sharing. Moreover, the paper proposes the architecture of a cyber threat information sharing ecosystem that operates according to the proposed filtering approach and defines the characteristics that are advantageous to filtering approaches. Implementation of the proposed approach can support compliance with the Special Publication 800-150 of the National Institute of Standards and Technology.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:CKf5m1HYVjMC",
            "Publisher": "MDPI"
        },
        {
            "Title": "A practical Steganography approach for Matroska-based high quality video files",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6550476/",
            "Abstract": "Several steganographic algorithms have been proposed for protecting message secrecy against unauthorized \"reads\". The most used method for hiding a message relies on embedding the secret message in Least Significant Bit (LSB) on the cover object. Though various digital formats have been proposed in literature to be used as cover objects, little attention has been paid on Matroska multimedia containers. In this work, we propose a practical method for applying steganography in these types of files. The proposed method consists of three distinct phases. The first one encrypts the hidden message, the second embeds it to the stego cover, while at the final step the stego cover is attached to a Matroska container. We tested our approach in various scenarios in order to evaluate the introduced overhead. Results shows that the use of several sizes for TXT and WAV files did not introduce considerable overhead …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:HE397vMXCloC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Towards an ontology-based security management",
            "Publication year": 2006,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/1620314/",
            "Abstract": "The paramount complexity of enterprise in formation leads to hard-to-deal security management issues and system configurations. We present a security management framework of an arbitrary information system (IS) which builds upon knowledge-based resources, such as security ontology (SO) providing reusable security knowledge interoperability, aggregation and reasoning exploiting security knowledge from diverse sources; in addition, the separation of security requirements from their technical implementations facilitates the security management. We provide a feasible framework which links the high-level policy statements and deployable security controls and facilitates the security expert's work",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:u-x6o8ySG0sC",
            "Publisher": "IEEE"
        },
        {
            "Title": "On the feasibility of malware attacks in smartphone platforms",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-35755-8_16",
            "Abstract": "Smartphones are multipurpose devices that host multiple and heterogeneous data. Their user base is constantly increasing and as a result they have become an attractive target for conducting privacy and security attacks. The attacks’ impact increases, when smartphone users tend to use their devices both for personal and business purposes. Moreover, application development in smartphone platforms has been simplified, in the platforms developers’ effort to attract more developers and increase its popularity by offering more attractive applications. In this paper we provide a comparative evaluation of the security level of well-known smartphone platforms, regarding their protection against simple malicious applications. We then study the feasibility and easiness of smartphone malware development by average programmers via an implementation case study. Our study proved that, under certain …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:tOudhMTPpwUC",
            "Publisher": "Springer"
        },
        {
            "Title": "Privacy risks, security and accountability in the Cloud",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6753795/",
            "Abstract": "Migrating data, applications or services to the cloud exposes a business to a number of new threats and vulnerabilities, which need to be properly assessed. Assessing privacy risk in cloud environments remains a complex challenge, mitigation of this risk requires trusting a cloud service provider to implement suitable privacy controls. Furthermore, auditors and authorities need to be able to hold service providers accountable for their actions, enforcing rules and regulations through penalties and other mechanisms, and ensuring that any problems are remedied promptly and adequately. This paper examines privacy risk assessment for cloud, and identifies threats, vulnerabilities and countermeasures that clients and providers should implement in order to achieve privacy compliance and accountability.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:ILKRHgRFtOwC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Towards a Criticality Analysis Methodology: Redefining Risk Analysis for Critical Infrastructure Protection",
            "Publication year": 2009,
            "Publication url": "https://infosec.aueb.gr/Publications/CIP-2009%20Risk-Criticality-Analysis.pdf",
            "Abstract": "Critical Infrastructure Protection requires the prioritization of critical assets and the evaluation of the criticality of infrastructures. However, criticality analysis is not yet standardized. In this paper we examine the relation between security risk and criticality. We analyze the similarities and differences in terms of scope, aims, impacts, threats and vulnerabilities and we suggest how existing risk analysis can be applied when examining Critical Infrastructures. Based on the identified relation between risk and criticality, we propose a generic risk-based Criticality Analysis methodology. We place key emphasis on the definition of examined impact types, which are social-centric and/or sector-centric, in contrast to traditional risk analysis methodologies that mainly examine organization-centric impacts. We propose a detailed list of impact criteria in order to assess the criticality level of an infrastructure.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:rDsFeusoTZkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PKI Services in the Public Sector of the European Union Member States",
            "Publication year": 2003,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:M7yex6snE4oC",
            "Publisher": "Univ. of the Aegean"
        },
        {
            "Title": "The Big Four – What we did wrong in Advanced Persistent Threat detection?",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6657248/",
            "Abstract": "As both the number and the complexity of cyber-attacks continuously increase, it is becoming evident that current security mechanisms have limited success in detecting sophisticated threats. Stuxnet, Duqu, Flame and Red October have troubled the security community due to their severe complexity and their ability to evade detection - in some cases for several years. The significant technical and financial resources needed for orchestrating such complex attacks are a clear indication that perpetrators are well organized and, likely, working under a state umbrella. In this paper we perform a technical analysis of these advanced persistent threats, highlighting particular characteristics and identifying common patterns and techniques. We also focus on the issues that enabled the malware authors to evade detection from a wide range of security solutions and propose technical countermeasures for strengthening our …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:tKAzc9rXhukC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Vital signs monitoring from home with open systems",
            "Publication year": 2000,
            "Publication url": "https://ebooks.iospress.nl/doi/10.3233/978-1-60750-921-9-1141",
            "Abstract": "This study investigates the applicability of a novel codification scheme based on two healthcare informatics standards (namely the VITAL (ENV 13734) and DICOM Sup. 30 Waveform Interchange) in addressing the robust interchange of waveform and medical data in remote healthcare applications. To further address system validation and clinical acceptance issues, pilots were set-up between home-monitoring stations and a hospital-based telemedicine consultation center. The pilots focused in assessing applicability, technical feasibility and performance of the proposed codification scheme based on the two standards. This paper presents the system and services requirements as studied for a home-care application, the design goals for the preservation of security stature, the practical issues of validation and the results of integrating these codification schemes into a commercial patient connected device.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:ZeXyd9-uunAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "A new methodology towards effectively assessing data center sustainability",
            "Publication year": 2018,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404817302754",
            "Abstract": "Data centers are found in nearly every sector of the economy, such as financial and commercial services, media and communications, academic and governmental institutions. Day to day, there is an increasing demand for data processing and storage, thus cloud computing has evolved, supported by the continuous growth of internet services worldwide. This has led to significant energy consumption, accompanied with serious environmental impacts, such as earth resources spending, greenhouse gas emissions, electronic equipment waste and environmental pollution. Various metrics have been proposed to evaluate efficiency in data centers, aiming to develop energy conscious behavior and resources savings, however they are falling short, when assessing sustainability of a data center in a holistic view. Sustainability aims at preserving the environment, along with economic, operational and social longevity …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:BJrgspguQaEC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Assessing privacy risks in Android: A user-centric approach",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-07076-6_2",
            "Abstract": "The increasing presence of privacy violating apps in app marketplaces poses a significant privacy risk for smartphone users. Current approaches assessing privacy risk lack user input, assuming that the value of each smartphone sub-asset (e.g. contact list, usage history) is perceived similarly across users. Thus, per user privacy risk assessment is not achievable. This paper refines our previous work on smartphone risk assessment by proposing an approach for assessing the privacy risk of Android users. Its cornerstone is impact valuation from users, as well as their usage profiles, which enables assessment of per user risk. Threat likelihood is assessed based on the presence of specific permission combinations, which we consider vulnerabilities that enable privacy threat scenarios. These permission combinations correspond to users’ app profiles, i.e. to the app categories of Google Play that each user …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:VaXvl8Fpj5cC",
            "Publisher": "Springer"
        },
        {
            "Title": "A process-based dependency risk analysis methodology for critical infrastructures",
            "Publication year": 2017,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCIS.2017.088231",
            "Abstract": "This paper applies research in dependency modelling to a process-based risk assessment methodology suitable for critical infrastructures. The proposed methodology dynamically assesses the evolution of cascading failures over time between assets involved in a business process of an infrastructure. This approach can be applied by a CI operator/owner to explore how a failure in a single component (asset) affects the other assets and relevant business processes. It could also be applied in an analysis that includes multiple CI operators in the same supply chain to explore the dependencies between their assets and explore how these affect the provision of key societal services. The paper presents a proof-of-concept tool, based on business-process risk assessment and graph modelling, and a realistic case example of a rail scheduling process. The approach allows risk assessors and decision makers to analyse …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:KWzIFqRkAKkC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Holistic Protection of Critical Infrastructures",
            "Publication year": 2017,
            "Publication url": "https://infosec.aueb.gr/Publications/NMIOTC%20Journal%20Vol.%2014%202017.pdf#page=29",
            "Abstract": "The protection of Critical Infrastructures (CIs) is, by definition, of high importance for the welfare of citizens of each country; especially nowadays, both because of direct threats (dictated by the current international political situation) and also due to emerging interactions or dependencies developed between national CIs at international and European levels. Today, Greece remains one of the few countries of the European Union, which (besides the formal transposi-",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:JP7YXuLIOvAC",
            "Publisher": "NMIOTC"
        },
        {
            "Title": "Audio CAPTCHA: Existing solutions assessment and a new implementation for VoIP telephony",
            "Publication year": 2010,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404809001412",
            "Abstract": "SPam over Internet Telephony (SPIT) is a potential source of future annoyance in Voice over IP (VoIP) systems. A typical way to launch a SPIT attack is the use of an automated procedure (i.e., bot), which generates calls and produces unsolicited audio messages. A known way to protect against SPAM is a Reverse Turing Test, called CAPTCHA (Completely Automated Public Turing Test to Tell Computer and Humans Apart). In this paper, we evaluate existing audio CAPTCHA, as this type of format is more suitable for VoIP systems, to help them fight bots. To do so, we first suggest specific attributes-requirements that an audio CAPTCHA should meet in order to be effective. Then, we evaluate this set of popular audio CAPTCHA, and demonstrate that there is no existing implementation suitable enough for VoIP environments. Next, we develop and implement a new audio CAPTCHA, which is suitable for SIP-based …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:Zph67rFs4hoC",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Automated detection of logical errors in programs",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-17127-2_3",
            "Abstract": "Static and dynamic program analysis tools mostly focus on the detection of a priori defined defect patterns and security vulnerabilities. Automated detection of logical errors, due to a faulty implementation of applications’ functionality is a relatively uncharted territory. Automation can be based on profiling the intended behavior behind the source code. In this paper, we present a new code profiling method that combines the crosschecking of dynamic program invariants with symbolic execution, an information flow analysis, and the use of fuzzy logic. Our goal is to detect logical errors and exploitable vulnerabilities. The theoretical underpinnings and the practical implementation of our approach are discussed. We test the APP_LogGIC tool that implements the proposed analysis on two real-world applications. The results show that profiling the intended program behavior is feasible in diverse applications. We …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:1lhNe0rCu4AC",
            "Publisher": "Springer"
        },
        {
            "Title": "Risk assessment methodology for interdependent critical infrastructures",
            "Publication year": 2011,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJRAM.2011.042113",
            "Abstract": "Assessing risk in interdependent infrastructures is a challenging topic due to its complexity and the nature of critical infrastructures. This paper describes a methodology for assessing the risk of an infrastructure or a sector, taking into account the presence of interdependencies between infrastructures and sectors. Although the proposed methodology is compatible with current information systems practices, our approach focuses on the consequences to the society and not on the infrastructure itself. The methodology is accompanied by a comprehensive case example.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:YFjsv_pBGBYC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "Exploiting Open Source Intelligence capabilities for the benefit of the Hellenic Air Force",
            "Publication year": 2016,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.726.9370&rep=rep1&type=pdf",
            "Abstract": "• Open Source Intelligence (OSINT) is produced from publicly available information, which is:–collected, exploited and disseminated in a timely manner–offered to an appropriate audience–used for the purpose of addressing a specific intelligence requirement• Publicly available information refers to (not only):–Traditional media (eg television, newspapers, radio, magazines)–Web-based communities (eg social networking sites, blogs)–Public data (eg government reports, official data, public hearings)–Amateur observation/reporting (eg amateur spotters, radio monitors)• OSINT defined by US Dept. of Defense (Public Law 109-163, Sec.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:q1zXlPLtbUIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Using side channel TCP features for real-time detection of malware connections",
            "Publication year": 2019,
            "Publication url": "https://content.iospress.com/articles/journal-of-computer-security/jcs191286",
            "Abstract": "During the past years, deep packet inspection has been prevalent in network intrusion detection systems. Most solutions employ complex algorithms to analyze the intended behaviour and underlying characteristics of packets and their payloads, in an effort to detect and prevent malicious users and software from communicating over business intranets and wider networks. Still, there are multiple issues that inhibit their success rate. Most signature-based security software is plagued by false positives and/or false negatives. On the other hand, behavioral-based solutions achieve better detection rates but need to analyze large amounts of traffic. In this article, we present a real-time network traffic monitoring system that implements machine learning over side channel characteristics of TCP network packets to distinguish normal from malicious TCP sessions, even when encryption is in place. We test in university …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:GtqhT-R7ZnwC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "YouTube user and usage profiling: Stories of political horror and security success",
            "Publication year": 2014,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-662-44788-8_16",
            "Abstract": "Social media and Web 2.0 have enabled internet users to contribute online content, which may be crawled and utilized for a variety of reasons, from personalized advertising to behaviour prediction/profiling. In this paper, our goal is to present a horror and a success story from the digital world of Social Media, in order to: (a). present a political affiliation profiling method, the Panopticon method, in order to reveal this threat and contribute in raising the social awareness over it. (b). describe an insider threat prediction method by evaluating the predisposition towards law enforcement and authorities, a personal psychosocial trait closely connected to the manifestation of malevolent insiders. The experimental test case of both methodologies is an extensive Greek community of YouTube users. In order to demonstrate our cases, we performed graph theoretic and content analysis of the collected dataset and …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:OR75R8vi5nAC",
            "Publisher": "Springer"
        },
        {
            "Title": "Electronic voting: Constitutional and legal requirements, and their technical implications",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0239-5_4",
            "Abstract": "This paper provides a systematic overview of the major constitutional and legalaspects of e-voting, together with their technical implications. All democracy-oriented legal and constitutional requirements of an Internet-based voting system are identified. Such a voting system has to comply with these, in order to encourage and promote the participation of citizens, without violating any of their fundamental rights (privacy, anonymity, equality, etc.).",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:_FxGoFyzp5QC",
            "Publisher": "Springer US"
        },
        {
            "Title": "Formal analysis for robust anti-SPIT protection using model checking",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/s10207-012-0159-4.pdf",
            "Abstract": "Anti-SPIT policies counter the SPam over Internet Telephony (SPIT) by distinguishing bots launching unsolicited bulks of VoIP calls from human beings. We propose an Anti-SPIT Policy Management mechanism (aSPM) that detects spam calls and prevents VoIP session establishment by the Session Initiation Protocol (SIP). The SPIN model checker is used to formally model and analyze the robustness of the aSPM mechanism in execution scenarios with parallel SIP sessions. In case of a possible design flaw, the model checker provides a trace of the caught unexpected behavior (counterexample), that can be used for the revision of the mechanism’s design. Our SPIN model is parameterized, based on measurements from experiments with VoIP users. Non-determinism plays a key role in representing all possible anti-SPIT policy decisions, in terms of the SIP messages that may be exchanged. The model …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:HoB7MX3m0LUC",
            "Publisher": "Springer-Verlag"
        },
        {
            "Title": "Applicability of privacy enhancing technologies in ubiquitous computing environments",
            "Publication year": 2005,
            "Publication url": "https://scholar.google.com/scholar?cluster=13308508757449722488&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:XD-gHx7UXLsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Action Learning in Practice: Pilot delivery of an INFOSEC University laboratory course",
            "Publication year": 2001,
            "Publication url": "https://research-information.bris.ac.uk/en/publications/action-learning-in-practice-pilot-delivery-of-an-infosec-universi",
            "Abstract": "Action learning in practice: Pilot delivery of an INFOSEC University laboratory course — \nUniversity of Bristol Skip to main navigation Skip to search Skip to main content University of \nBristol Logo Help & Terms of Use Home Profiles Research Units Research Outputs Projects \nStudent theses Datasets Activities Prizes Facilities/Equipment Search by expertise, name or \naffiliation Action learning in practice: Pilot delivery of an INFOSEC University laboratory course D \nGritzalis, T Tryfonas Department of Civil Engineering Systems Centre Research output: Chapter \nin Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) \nOverview Translated title of the contribution action learning in practice: Pilot delivery of an \nINFOSEC University laboratory course Original language English Title of host publication \nInformation Security Education - WISE 2001 Publisher Kluwer Academic Publishers Pages - - : …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:J_g5lzvAfSwC",
            "Publisher": "Unknown"
        },
        {
            "Title": "In Cloud we Trust: Risk-Assessment-as-a-Service",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-38323-6_7",
            "Abstract": "Cloud computing is an emerging paradigm that allows adoption of on-demand services in a cost-effective way. Migrating services to the Cloud also means been exposed to new threats and vulnerabilities, thus, resulting in a modified assessment of risk. Assessing risk in the Cloud remains an open research issue, as it requires a given level of trust of the Cloud service provider for providing assessment data and implementing controls. This paper surveys existing knowledge, regarding risk assessment for the Cloud, and highlights the requirements for the design of a cloud-targeted method that is offered as a service, which is also in compliance with the specific characteristics of the Cloud.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:Mojj43d5GZwC",
            "Publisher": "Springer"
        },
        {
            "Title": "Defending oil & gas critical infrastructures from cyber-attacks",
            "Publication year": 2020,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:654Jc7Ppz2kC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Protecting privacy and anonymity in pervasive computing: Trends and perspectives",
            "Publication year": 2006,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0736585305000493",
            "Abstract": "Pervasive computing is expected to enter our everyday life in the foreseeable future. The capabilities of the devices, which operate in such an environment, as well as the range of services offered to the end-users are expected to be significantly increased. However, this new era is expected to have a serious effect on privacy. In this paper, we first refer to the privacy threats identified in a pervasive environment; then, we present a set of principles for ensuring privacy in this context. In the sequel, we examine a number of privacy protection mechanisms for pervasive systems, with a focus on the level of anonymity offered to the end-users. We identify flaws, these mechanisms suffer by, in terms of the limited anonymity level they offer. We conclude by presenting a set of essential actions one should take into account, in order to ensure user’s anonymity in a pervasive computing environment.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:W7OEmFMy1HYC",
            "Publisher": "Pergamon"
        },
        {
            "Title": "Towards integrating security in industrial engineering design practices",
            "Publication year": 2021,
            "Publication url": "https://www.scitepress.org/Papers/2021/105440/105440.pdf",
            "Abstract": "During the past decades, and especially since the Stuxnet event, there has being a growing concern around the protection of critical infrastructures. Even though the protection of such systems and services has been an international security priority, still, even after all those years, relevant research either focuses on individual ICS systems security (PLC, RTU and SCADA network protection and attacks), or uses high-level models to perform risk assessments, mostly from a system-of-systems scope that studies interdependencies. From an engineering perspective, current approaches address system resilience from an efficiency perspective (ie focusing on the availability of physical processes) while neglecting the security dimension of their components. Still, the availability and reliability requirements of such systems are directly affected by security incidents. To our knowledge, there is currently no process to integrate security-by-design in industrial critical infrastructure engineering. To this end, we present a method to integrate security risk assessment analysis into engineering design practices. We do this by modeling internal dependencies between physical components in critical industrial production processes to identify possible hotspots of system failures that are challenging to handle later in the development lifecycle, especially during operation. To validate our approach, we model and assess the present situation in a portion of an actual oil refining plant, thereby establishing a baseline model. Then we introduce risk mitigation measures by altering the design of the baseline model, resulting in a reduction of the overall cascade risk.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:w5CyTnyFq80C",
            "Publisher": "ScitePress"
        },
        {
            "Title": "Attack modeling of SIP-oriented SPIT",
            "Publication year": 2008,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-540-89173-4_25",
            "Abstract": "The use of IP networks for telephony applications (VoIP) is becoming increasingly popular, mainly due to its advantages in terms of communication and multimedia services. This fact may also shift several problems from the Internet context, such as spam, which - in the VoIP case - has been identified as SPIT. In this paper, we propose an abstract model for describing SPIT attack strategies by incorporating the underlying threats and vulnerabilities of the VoIP technology regarding SPIT phenomenon. Our model is mainly focused on the signaling part of VoIP sessions (i.e. the SIP protocol), and it is based on the representation of attacks through attack graphs and attack trees. We also demonstrate how this model could be used for the development of a set of reusable attack scenarios (patterns), with an eye towards the development of a SPIT Detection System.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:Wp0gIr-vW9MC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Legal and regulatory issues on e-voting and data protection in Europe",
            "Publication year": 2002,
            "Publication url": "https://scholar.google.com/scholar?cluster=17354891928178014362&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:mUJArPsKIAAC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Situational Crime Prevention and Insider Threat: Countermeasures and Ethical Considerations",
            "Publication year": 2009,
            "Publication url": "https://privpapers.ssrn.com/sol3/Delivery.cfm/SSRN_ID2619734_code373851.pdf?abstractid=2619734&type=2#page=822",
            "Abstract": "Insider threat is a threat posed to information systems. In this paper we examine how the theory of Situational Crime Prevention can contribute in mitigating computer abuse by insiders. We present the theory, which focuses in removing opportunities for criminal activity, and examine whether and how its techniques can be applied on an Information System or Critical Infrastructure. Thus, we create a set of security countermeasures that correspond to the techniques of the theory, so as to achieve its goals, namely:(a) to increase the effort required to attempt an* Marianthi Theocharidou received a B. Sc. in Informatics, in 2002, and a M. Sc. in Information Systems, in 2004, both acquired from Athens University of Economics and Business, Greece. She is currently performing her Ph. D. research in the Informatics Department of Athens University of Economics and Business, Greece. Her published work includes several …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:KUbvn5osdkgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Insider Threat: Enhancing BPM through Social Media",
            "Publication year": 2014,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6814027/",
            "Abstract": "Modern business environments have a constant need to increase their productivity, reduce costs and offer competitive products and services. This can be achieved via modeling their business processes. Yet, even in light of modelling's widespread success, one can argue that it lacks built-in security mechanisms able to detect and fight threats that may manifest throughout the process. Academic research has proposed a variety of different solutions which focus on different kinds of threat. In this paper we focus on insider threat, i.e. insiders participating in an organization's business process, who, depending on their motives, may cause severe harm to the organization. We examine existing security approaches to tackle down the aforementioned threat in enterprise business processes. We discuss their pros and cons and propose a monitoring approach that aims at mitigating the insider threat. This approach …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:8d8msizDQcsC",
            "Publisher": "IEEE"
        },
        {
            "Title": "Analyzing congestion interdependencies of ports and container ship routes in the maritime network infrastructure",
            "Publication year": 2018,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/8502759/",
            "Abstract": "Events, such as prolonged congestion in ports or unavailable ship routes in the maritime network, often initiate cascading congestions that block transportation and/or disrupt services over wide areas. Existing traffic flow analysis methods lack the ability to understand the cascading effects of delays in ship routes or how to reduce overall delays in greater maritime areas. Dependency risk graphs have been proposed as a tool for analyzing such cascading events using dependency chains. This paper proposes a risk-based interdependency analysis method capable to detect large-scale traffic congestions between interconnected ports and ship routes in the maritime network and provide solutions to improve flow. Presented dependency risk chains of ports along with graph theory help us analyze ship routes and detect ports that are affected most when other major ports are congested in the maritime network, detect the …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:zzCxg_vo7cAC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Approaching encryption through complex number logarithms",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/7223218/",
            "Abstract": "In this paper, we approach encryption through the properties of complex logarithm and the complex plane. We introduce a mathematical concept to be used in cryptography. As an example, we propose a new crypto-system, by mixing known robust techniques such as chain-block encryption and AES-like structures together with complex exponentiation to provide robust encryption of plaintext messages. The proposed method implements encryption by transforming complex numbers into position vectors in a two-dimensional Cartesian coordinate system called the complex plane and utilizes the properties of the complex logarithm together with well-defined techniques from global standards (such as AES), in order to ensure robustness against cryptanalysis. This is made possible without implementing any computational costly algorithm. This has two important consequences: First, it may open up viable solutions to …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:_Re3VWB3Y0AC",
            "Publisher": "SCITEPRESS"
        },
        {
            "Title": "The Sphinx enigma in critical VoIP infrastructures: Human or botnet?",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6623704/",
            "Abstract": "Sphinx was a monster in Greek mythology devouring those who could not solve her riddle. In VoIP, a new service in the role of Sphinx provides protection against SPIT (Spam over Internet Telephony) by discriminating human callers from botnets. The VoIP Sphinx tool uses audio CAPTCHA (Completely Automated Public Turing test to tell Computers and Humans Apart) that are controlled by an anti-SPIT policy mechanism. The design of the Sphinx service has been formally verified for the absence of side-effects in the VoIP services (robustness), as well as for its DoS-resistance. We describe the principles and innovations of Sphinx, together with experimental results from pilot use cases.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:JoZmwDi-zQgC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Principles and requirements for a secure e-voting system",
            "Publication year": 2002,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404802010143",
            "Abstract": "Electronic voting (e-voting) is considered a means to further enhance and strengthen the democratic processes in modern information societies. E-voting should first comply with the existing legal and regulatory framework. Moreover, e-voting should be technically implemented in such a way that ensures adequate user requirements. As a result, the aim of this paper is twofold. Firstly, to identify the set of generic constitutional requirements, which should be met when designing an e-voting system for general elections. This set will lead to the specific (design) principles of a legally acceptable e-voting system. Second, to identify, using the Rational Unified Process, the requirements of an adequately secure e-voting system. These requirements stem from the design principles identified previously. The paper concludes that an e-voting capability should, for the time being, be considered only as a complementary means to …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:d1gkVwhDpl0C",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "Analysis and classification of adaptation tools for the Transport Sector adaptation planning",
            "Publication year": 2017,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-99843-5_4",
            "Abstract": "Climate change is an upcoming and unavoidable challenge that all critical infrastructures including transport sector will have to face. Although transport sector and its network substructures are typically designed to withstand weather-related stressors, shifts in climate patterns will greatly increase potential risks. The area of climate adaptation planning is still relatively new, however a variety of processes and methodologies for assessing and reducing the vulnerability to climate change are currently being developed. These processes require and benefit from the use of geospatial analyses, software tools and web portals. In this research, we have focused on climate-related adaptation planning. We provide detailed classification of a set of tools that can facilitate adaptation assessment and risk planning. Our goal is to present a multi-faceted taxonomy and analysis of available Climate Change Adaptation tools …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ZqE1mSdD_DYC",
            "Publisher": "Springer (LNCS 10707)"
        },
        {
            "Title": "Interdependency analysis of junctions for congestion mitigation in Transportation Infrastructures",
            "Publication year": 2017,
            "Publication url": "https://dl.acm.org/doi/abs/10.1145/3152042.3152078",
            "Abstract": "The resilience of the Transportation road infrastructure network is of major importance, since failures such as prolonged road congestion in specific parts of the infrastructure often initiate major cascading effects that block transportation and/or disrupt services of other infrastructures over wide areas. Existing traffic flow analysis methods lack the ability to understand cascading effect of congestions and how to improve overall resilience in greater areas. Dependency risk graphs have been proposed as a tool for analyzing such cascading failures using infrastructure dependency chains. In this paper, we propose a risk-based interdependency analysis methodology capable to detect large-scale traffic congestions between interconnected junctions of the road network and provide mitigation solutions to increase traffic flow resilience. Dependency risk chains of junctions provide important information about which junctions …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:AzKEL7Gb_04C",
            "Publisher": "ACM Press"
        },
        {
            "Title": "A security architecture for interconnecting health information systems",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386505603002144",
            "Abstract": "Several hereditary and other chronic diseases necessitate continuous and complicated health care procedures, typically offered in different, often distant, health care units. Inevitably, the medical records of patients suffering from such diseases become complex, grow in size very fast and are scattered all over the units involved in the care process, hindering communication of information between health care professionals. Web-based electronic medical records have been recently proposed as the solution to the above problem, facilitating the interconnection of the health care units in the sense that health care professionals can now access the complete medical record of the patient, even if it is distributed in several remote units. However, by allowing users to access information from virtually anywhere, the universe of ineligible people who may attempt to harm the system is dramatically expanded, thus severely …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:9yKSN-GCB0IC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "A domain-specific language for intrusion detection",
            "Publication year": 2000,
            "Publication url": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.22.4888&rep=rep1&type=pdf",
            "Abstract": "We describe the use of a domain-specific language (DSL) for expressing critical design values and constraints in an intrusion detection application. Through the use of this specialised language information that is critical to the correct operation of the software can be expressed in a form that can be easily drafted, verified, and maintained by domain experts (security officers) thus minimising the risk inherent from the mediation of software engineers. Our application, panoptis is a DSL-based low-cost, easy-to-use intrusion detection system using the process accounting records kept by most Unix systems. A set of databases contain resource usage profiles for processes, terminals, users, and time intervals. Panoptis monitors new process data against the recorded profiles and reports on entities diverging from the established resource usage envelopes implying possible data security threats.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:M05iB0D1s5AC",
            "Publisher": "Unknown"
        },
        {
            "Title": "PANOPTES: The Greek National Cyber Defence Exercise",
            "Publication year": 2016,
            "Publication url": "https://infosec.aueb.gr/Publications/CEER-ENISA-2016%20Gritzalis%20Papageorgiou.pdf",
            "Abstract": "PANOPTES: The Greek National Cyber Defence Exercise Page 1 PANOPTES: The Greek \nNational Cyber Defence Exercise Dimitris Gritzalis, Spyros Papageorgiou January 2016 Page 2 \nPANOPTES: The Greek National Cyber Defence Exercise Dimitris GRITZALIS Spyros \nPAPAGEORGIOU Professor & Director Commander & Director INFOSEC Laboratory Cyber \nDefence Directorate Athens University of Economics & Business Hellenic National Defence \nGeneral Staff CEER-ENISA Workshop Athens, Greece January 2016 Page 3 Table of contents \n1. Cyber attacks: Facts 2. Cyber Defense Exercises (CDX) 3. PANOPTES - Overview, Objectives, \nParticipants 4. Scenario - Context and Scope 5. CDX - Planning and Conducting 6. PANOPTES \n- The future http://map.norsecorp.com/ Page 4 Cyber attacks Source: Hackmageddon.com \nCyber attacks: Facts Page 5 Cyber attacks Source: Hackmageddon.com Cyber attacks: 6 () …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:kvJssbFybhEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "“Water, Water, Every Where”: Nuances for a Water Industry Critical Infrastructure Specification Exemplar",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-33331-1_20",
            "Abstract": "The water infrastructure is critical to human life, but little attention has been paid to the nuances of the water industry. Without such attention, evaluating security innovation in this domain without compromising the productivity goals when delivering water services is difficult. This paper proposes four nuances that need to be incorporated into a representative specification exemplar for the water industry; these provided input to the exemplar based on a fictional water company.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:-jrNzM816MMC",
            "Publisher": "Springer (LNCS 9578)"
        },
        {
            "Title": "Recurrent IT security issues and recommendations",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=4610209771702400907&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:VOx2b1Wkg3QC",
            "Publisher": "Kluwer Academics Publisher"
        },
        {
            "Title": "Results on container ship route risk-based interdependency modeling",
            "Publication year": 2019,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:pRWBApOjXDcC",
            "Publisher": "Unknown"
        },
        {
            "Title": "CIDA: Critical Infrastructure Dependency Analysis Tool",
            "Publication year": 2014,
            "Publication url": "https://scholar.google.com/scholar?cluster=4939024857080476663&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:1DsIQWDZLl8C",
            "Publisher": "Unknown"
        },
        {
            "Title": "A qualitative metrics vector for the awareness of smartphone security users",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-40343-9_15",
            "Abstract": "The proliferation of smartphones introduced new challenges in the users’ security and privacy. Currently, the literature concentrates mainly on the ‘nuts and bolts’ of their security models. Not extensive work is available on the security awareness of smartphone users, even though their role in the ecosystem is important. This is so, as users’ actions directly affect their security and privacy. This paper extends a previous work on the awareness of smartphone users who install apps from official repositories. More specifically, we explore if a security background affects the smartphone security awareness of the survey participants by splitting them in two groups, comprising of security savvy and non-security savvy users. The results of the statistical analysis indicate, inter alia, that the participants’ security background has slight impact on their security awareness in the smartphone ecosystem.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:tzM49s52ZIMC",
            "Publisher": "Springer"
        },
        {
            "Title": "Secure electronic voting: The current landscape",
            "Publication year": 2003,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-1-4615-0239-5_7",
            "Abstract": "This paper presents the security requirements and the system wide properties that the voting protocol of an electronic voting system is expected to fulfil. Then, an overview of the existing voting protocols, together with a brief analysis of their characteristics, is provided. The aim is to investigate and discuss the extent to which current voting protocols comply with the identified requirements and thus examine the feasibility of organising and conducting an Internet based election in a secure, efficient and reliable way.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:zfsRRabFVBUC",
            "Publisher": "Springer, Boston, MA"
        },
        {
            "Title": "Unconventional Cyber Attacks: Facts - Not Fakes",
            "Publication year": 2020,
            "Publication url": "https://www.infosec.aueb.gr/Publications/Cyber-Operations-Malware.pdf",
            "Abstract": "An unconventional attack Dropping malware modules to multiple smartphones, over the air and from some meters away, using:(a) the sound medium, and (b) an algorithm (similar to Shazam’s audio fingerprinting).",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:C5mqfHIFIucC",
            "Publisher": "Unknown"
        },
        {
            "Title": "A cloud provider-agnostic secure storage protocol",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21694-7_9",
            "Abstract": "Over the last years Cloud Computing has been seen as an emerging technology, which has changed the way computing services are delivered. Cloud computing is not a new technology paradigm, but rather introduces a new way of delivering computing services and resources. On top of its potential value and the several advantages it offers, we can foresee a number of drawbacks of cloud computing, in terms of security and privacy issues. In specific, cloud computing raises the level of expertise needed to protect security and privacy of its stakeholders (i.e. organizations and end-users), mainly due to the fact that the massive concentration of computer resources and data could be a more attractive target to malicious users. In this paper, we present a cloud provider-agnostic model for outsourcing both static and dynamic data to third parties, while preserving their confidentiality and integrity. In addition to a …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:35N4QoGY0k4C",
            "Publisher": "Springer"
        },
        {
            "Title": "Secure cloud storage: Available infrastructures and architectures review and evaluation",
            "Publication year": 2011,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-22890-2_7",
            "Abstract": "Cloud Computing is an emerging technology paradigm, enabling and facilitating the dynamic and versatile provision of computational resources and services. Even though the advantages offered by cloud computing are several, there still exists thoughts as per the thus offered security and privacy services. Transferring and storing data to a cloud computing infrastructure, provided by Storage-as-a-Service (STaS) tenants, changes an organization’s security posture, as it is challenging to control or audit the cloud provider’s infrastructure in terms of the way the underlying risks are controlled and mitigated. Therefore, it is necessary that the organizations understand the new threats and risks introduced by the cloud technology. On the other hand we need to adopt, develop, and deploy mechanisms that can effectively and efficiently preserve the confidentiality and integrity of the data. In this paper we examine …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:j3f4tGmQtD8C",
            "Publisher": "Springer"
        },
        {
            "Title": "Hunting application-level logical errors",
            "Publication year": 2012,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-28166-2_13",
            "Abstract": "Business applications are complex artefacts implementing custom business logic. While much research effort has been put in the identification of technical vulnerabilities (such as buffer overflows and SQL injections), application-level logic vulnerabilities have drawn relatively limited attention, thus putting the application’s mission at risk. In this paper, we design, implement, and evaluate a novel heuristic application-independent framework, which combines static and dynamic analysis, input vector, and information extraction analysis, along with a fuzzy logic system, so as to detect and assert the criticality of application-level logic vulnerabilities in Java stand-alone GUI applications.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:rO6llkc54NcC",
            "Publisher": "Springer"
        },
        {
            "Title": "Panoptis: Intrusion detection using a domain-specific language",
            "Publication year": 2002,
            "Publication url": "https://content.iospress.com/articles/journal-of-computer-security/jcs153",
            "Abstract": "We describe the use of a domain-specific language (DSL) for expressing critical design values and constraints in an intrusion detection application. Through the use of this specialised language, information that is critical to the correct operation of the software can be expressed in a form that can be easily drafted, verified, and maintained by domain experts (security officers), thus minimising the risk inherent from the mediation of software engineers. Our application, Panoptis, is a DSL-based low-cost, easy-to-use intrusion detection system using the process accounting records kept by most Unix systems. A set of database tables contain resource usage profiles for processes, terminals, users, and time intervals. Panoptis monitors new process data against the recorded profiles and reports on entities diverging from the established resource usage envelopes implying possible data security threats. We demonstrate the …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:oE_QS-WwsdAC",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Common body of knowledge for information security",
            "Publication year": 2007,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/4140992/",
            "Abstract": "The need for skilled information security professionals has led various academic, governmental, and industrial organizations to work to develop a common body of knowledge (CBK) for the security domain. A CBK is a framework and collection of information that provides a basis for understanding terms and concepts in a particular knowledge area. It defines the basic information that people who work in that area are expected to know. The International Information Systems Security Certification Consortium ([ISC]; www.isc2.org) defines a CBK as a taxonomy of topics relevant to professionals around the world. Information security is a multidisciplinary endeavor. In practice, professionals need knowledge and experience from fields such as management, business administration, ethics, sociology, and political science. Yet, existing CBKs focus on specific information security subdomains and thus offer limited …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:UebtZRa9Y70C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Securing the European Gas Net­work: The Greek Business Case",
            "Publication year": 2021,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-69460-9_21",
            "Abstract": "SecureGas focuses on the 140.000 km of the European Gas network covering the entire value chain from Production to Distribution to the users, providing methodologies, tools and guidelines to secure existing and incoming installations and make them resilient to cyber-physical threats. In this chapter, SecureGas approach will be described, focusing on a business case, which involves two different Gas CI operators of Greece, the respective aim and needs, as well as the components involved, in the framework of the High-Level Reference Architecture, which is built upon the SecureGas Conceptual Model, a blueprint on how to design, build, operate and maintain the EU gas network to make it secure and resilient against cyber-physical threats.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:HoDPlbN_d1QC",
            "Publisher": "Springer (Security Informatics and Law Enforcement Series)"
        },
        {
            "Title": "Countering unsolicited calls in the Internet Telephony: An anti-SPIT architecture",
            "Publication year": 2009,
            "Publication url": "https://academicpublishingplatforms.com/downloads/pdfs/houjoi/volume1/201107242135_26-68-1-PB.pdf",
            "Abstract": "VoIP), a telephony service which is based in packet transmission through IP networks, is becoming increasingly popular. Besides the obvious advantages of VoIP technology, in terms of cost reduction, user portability, and sophisticated end-user services, the use of the Internet as VoIP’s main infrastructure introduces several threats and vulnerabilities. Most of these threats and vulnerabilities are related to the e-mail Spam phenomenon, which-in the case of VoIP context-is called Spam over Internet Telephony (SPIT). The scope of this paper is twofold: to study and evaluate the current anti-SPIT techniques and mechanisms and to propose a new architecture for managing SPIT.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:isC4tDSrTZIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Trusted Computing vs. Advanced Persistent Threats: Can a defender win this game?",
            "Publication year": 2013,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6726235/",
            "Abstract": "As both the number and the complexity of cyber attacks continuously increase, it is becoming evident that traditional security mechanisms have limited success in detecting sophisticated threats. Stuxnet, Duqu, Flame, Red October and, more recently, Miniduke, have troubled the security community due to their severe complexity and their ability to evade detection in some cases for several years, while exfiltrating gigabytes of data or sabotaging critical infrastructures. The significant technical and financial resources needed for orchestrating such complex attacks are a clear indication that perpetrators are well organized and, likely, working under a state umbrella. In this paper we perform a technical analysis of these advanced persistent threats, highlighting particular characteristics and identifying common patterns and techniques. We also focus on the issues that enabled the malware to evade detection from a wide …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:LI9QrySNdTsC",
            "Publisher": "IEEE Press"
        },
        {
            "Title": "Security-by-ontology: A knowledge-centric approach",
            "Publication year": 2006,
            "Publication url": "https://link.springer.com/chapter/10.1007/0-387-33406-8_9",
            "Abstract": "We present a security ontology (SO), which can be used as a basis of security management of an arbitrary information system. This SO provides capabilities, such as modeling of risk assessment knowledge, abstraction of security requirements, reusable security knowledge interoperability, aggregation and reasoning. The SO is based on the exploitation of security-related knowledge, derived from diverse sources. We demonstrate that the establishment of such a framework is feasible and, furthermore, that a SO can support critical security activities of an expert, e.g. security requirements identification, as well as selection of certain countermeasures. We also present and discuss an implementation of a specific SO. The implementation is accompanied by results regarding how a SO can be built and populated with security information.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:HDshCWvjkbEC",
            "Publisher": "Springer Boston"
        },
        {
            "Title": "Revisiting legal and regulatory requirements for secure e-voting",
            "Publication year": 2002,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-0-387-35586-3_37",
            "Abstract": "This paper addresses the democracy-oriented legal and constitutional requirements that an electronic voting system has to comply with. Its scope covers every election or decision-making process, which takes place through voting. Due mainly to the digital divide and to current technological limitation, electronic voting cannot be proposed as a universal means of voting but rather as an alternative option, supplemental to traditional voting means. An electronic voting process must be designed in such a way as to guarantee the general, free, equal and secret character of elections. In a democratic context an electronic voting system should respect and ensure attributes and properties such as transparency, verifiability, accountability, security and accuracy. Only then can it foster and promote the participation of the citizens, the legitimacy and the democratic transaction of the election process.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:eQOLeE2rZwMC",
            "Publisher": "Kluwer Academics Publisher"
        },
        {
            "Title": "Hide and seek: On the disparity of browser security settings",
            "Publication year": 2013,
            "Publication url": "https://scholar.google.com/scholar?cluster=15285319673574569270&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:0KyAp5RtaNEC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cybersecurity self-assessment tools: Evaluating the importance of securing industrial control systems in Critical Infrastructures",
            "Publication year": 2018,
            "Publication url": "https://link.springer.com/content/pdf/10.1007/978-3-030-05849-4_10.pdf",
            "Abstract": "Periodically assessing the security status of Industrial Control Systems (ICS) is essential to enable cybersecurity compliance and performance evaluation against an organization’s risk appetite. Ensuring appropriate security level is especially important in Critical Infrastructures (CI). Existing cybersecurity risk management methodologies provide frameworks through which CI stakeholders can enhance security and better protect their assets, against cybersecurity risks. Following traditional risk assessment procedures, a self-assessment tool can support an organization to build up on knowledge and security awareness, check implemented cybersecurity practices and responsibilities. Such methods and tools, when systematically implemented, can identify security weaknesses, establish cybersecurity targets and improve resilience. This paper aims to provide a review and analysis of available cybersecurity …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:ukw-9cB-YDkC",
            "Publisher": "Springer"
        },
        {
            "Title": "Source code profiling and classification for automated detection of logical errors",
            "Publication year": 2014,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.477.4104&rep=rep1&type=pdf",
            "Abstract": "Research and industrial experience reveal that code reviews as a part of software inspection might be the most cost-effective technique a team can use to reduce defects. Tools that automate code inspection mostly focus on the detection of a priori known defect patterns and security vulnerabilities. Automated detection of logical errors, due to a faulty implementation of applications’ functionality is a relatively uncharted territory. Automation can be based on profiling the intended behavior behind the source code. In this paper, we present a code profiling method based on token classification. Our method combines an information flow analysis, the crosschecking of dynamic invariants with symbolic execution, and code classification heuristics with the use of a fuzzy logic system. Our goal is to detect logical errors and exploitable vulnerabilities. The theoretical underpinnings and the practical implementation of our approach are discussed. We test the APP_LogGIC tool that implements the proposed analysis on two real-world applications. The results show that profiling the intended program behavior is feasible in diverse applications. We discuss in detail the heuristics used to overcome the problem of state space explosion and that of the large data sets. Code metrics and test results are provided to demonstrate the effectiveness of the proposed approach. This paper extends the work that appears in an article currently submitted to an international conference with proceedings. In this adequately extended version of our method we present classification mechanisms that can take into account multiple user input and provide a detailed description of the …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:sJsF-0ZLhtgC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Cascading effects of common-cause failures in critical infrastructures",
            "Publication year": 2013,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-45330-4_12",
            "Abstract": "One of the most challenging problems in critical infrastructure protection is the assessment and mitigation of cascading failures across infrastructures. In previous research, we have proposed a model for assessing the cumulative security risk of cascading threats due to high-order dependencies between infrastructures. However, recent empirical studies indicate that common-cause failures may result in extremely high impact situations, which may be comparable with or even more devastating than the cascading effects of high-order dependencies. This paper presents an extension to our model, which permits the assessment of the risk arising from complex situations involving multiple cascading failures triggered by major or concurrent common-cause events. The paper also discusses a realistic scenario that is used as a test case for the model extension.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:KaMxkj08jr0C",
            "Publisher": "Springer, Berlin, Heidelberg"
        },
        {
            "Title": "Leaking supervisory controls and data acquisition commands over unpadded TCP/IP encryption through differential packet size analysis",
            "Publication year": 2019,
            "Publication url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/spy2.82",
            "Abstract": "MODBUS is the most common protocol in industrial control systems for relaying commands and fetching data. Still, the protocol has zero built‐in security. Thus, modern implementations want to control remote units through the internet to maximize utility, they often implement MODBUS over TCP/IP connections. To cope with the inherent vulnerabilities, trending implementations of MODBUS‐TCP utilize encryption on TCP packets to protect the commands and data being transferred. Still, side characteristics can be exploited to break the confidentiality of these command executions. In this article, we present attacks that leak what is being executed on a real‐world Supervisory Controls and Data Acquisition (SCADA) system running MODBUS, even if commands are encrypted over a TCP/IP channel. Presented scenario attacks use network traffic sniffed from a hardware‐in‐the‐loop simulated Power Grid Industrial …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:u_mOZUIutIEC",
            "Publisher": "Wiley"
        },
        {
            "Title": "Information systems security management in virtual organizations",
            "Publication year": 2000,
            "Publication url": "Unknown",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:wyM6WWKXmoIC",
            "Publisher": "Unknown"
        },
        {
            "Title": "ASPF: Adaptive anti-spit policy-based framework",
            "Publication year": 2011,
            "Publication url": "https://ieeexplore.ieee.org/abstract/document/6045927/",
            "Abstract": "SPam over Internet Telephony (SPIT) is a rising IP voice telephony threat. Voice over IP enables the transmission of telephone calls over the Internet, as opposed to plain old telephone service. Internet Telephony essentially means low-cost phone calls, i.e. a clear benefit for both consumers and businesses, which may also lead to cheap methods of mass advertising. Still, industry observers warn that VoIP's low-cost and openness makes it relatively easy for spammers to send unsolicited audio-commercials to VoIP voice-mail inboxes, in much the same way they currently bombard e-mail inboxes. In this paper we set the foundations of an adaptive approach that handles SPIT through an adaptive anti-SPIT policy-based framework (ASPF). ASPF incorporates a set of rules for SPIT detection, together with appropriate actions and controls that should be enforced, so as to counter these attacks. ASPF is formally …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:NaGl4SEjCO4C",
            "Publisher": "IEEE"
        },
        {
            "Title": "Time-based critical infrastructure dependency analysis for large-scale and cross-sectoral failures",
            "Publication year": 2016,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874548215000803",
            "Abstract": "Dependency analysis of critical infrastructures is a computationally intensive problem when dealing with large-scale, cross-sectoral, cascading and common-cause failures. The problem intensifies when attempting a dynamic, time-based dependency analysis. This paper extends a previous graph-based risk analysis methodology to dynamically assess the evolution of cascading failures over time. Various growth models are employed to capture slow, linear and rapidly evolving effects, but instead of using static projections, the evolution of each dependency is “objectified” by a fuzzy system that also considers the effects of nearby dependencies. To achieve this, the impact (and, eventually, risk) of each dependency is quantified on the time axis into a form of many-valued logic. In addition, the methodology is extended to analyze major failures triggered by concurrent common-cause cascading events. A critical …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:pAkWuXOU-OoC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "An improved bit masking technique to enhance covert channel attacks on everyday IT systems",
            "Publication year": 2020,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-030-90428-9_1",
            "Abstract": "We present an improved network attack evasion technique that allows malicious two-way communication and bypasses popular host and network intrusion techniques/systems that use deep packet inspection, signature analysis, and traffic behavior. The attack is based on previous research that leverages legitimate network traffic (existing or intuitively generated) from different contexts and reuses it to communicate malicious content. Still, contrary to previous research, the proposed approach: (i) provides increased bandwidth and allows us to exfiltrate large amounts of data with improved execution times while avoiding detection, and (ii) removes the administration privilege constraint that existed in previous implementations. Both novelties now make the attack feasible in real-world scenarios. We present two different attack implementations in different contexts, i.e., scripts/commands two-way communication …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:-BKJ5vZJwzMC",
            "Publisher": "Spinger"
        },
        {
            "Title": "Cumulative notarization for long-term preservation of digital signatures",
            "Publication year": 2004,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S0167404804001014",
            "Abstract": "The long-term preservation of digitally signed documents may be approached and analyzed from various perspectives, i.e. future data readability, signature validity, storage media longevity, etc. The paper focuses on technology and trust issues related to the long-term validation of a digital signature. We exploit the notarization paradigm and propose a mechanism for cumulative data notarization that results in a successive trust transition towards new entities, modern technologies, and refreshed data. A future relying party will have to trust only the information provided by the last notary, in order to verify the validity of the initial signature, thus eliminating any dependency on ceased entities, obsolete data, and weak old technologies. The proposed framework uses recursive XML elements so that a notarization token structure encapsulates an identical data structure containing a previous notarization token.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:IjCSPb-OGe4C",
            "Publisher": "Elsevier Advanced Technology"
        },
        {
            "Title": "A formally verified mechanism for countering SPIT",
            "Publication year": 2010,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-642-21694-7_11",
            "Abstract": "Voice over IP (VoIP) is a key technology, which provides new ways of communication. It enables the transmission of telephone calls over the Internet, which delivers economical telephony that can clearly benefit both consumers and businesses, but it also provides a cheap method of mass advertising. Those bulks unsolicited calls are known as SPam over Internet Telephony (SPIT). In this paper we illustrate an anti-SPIT policy-based management (aSPM) mechanism which can handle the SPIT phenomenon. Moreover, we introduce a formal verification as a mean for validating the effectiveness of the aSPM against its intended goals. We provide model checking results that report upper bounds in the duration of call session establishment for the analyzed anti-SPIT policy over the Session Initiation Protocol (SIP) and prove the absence of deadlocks.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:lSLTfruPkqcC",
            "Publisher": "Springer Berlin/Heidelberg"
        },
        {
            "Title": "Assessing n-order dependencies between critical infrastructures",
            "Publication year": 2013,
            "Publication url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCIS.2013.051606",
            "Abstract": "The protection of critical infrastructures (CI) is a complex task, since it involves the assessment of both internal and external security risk. In the recent literature, methodologies have been proposed that can be used to identify organisation-wise security threats, or even first-order dependency risk (i.e., risk deriving from direct dependencies). However, there is a lack of work in the area of multi-order dependencies, i.e., assessing the cumulative effects of a single incident, on infrastructures that are connected indirectly. In this paper, we propose a method to identify and assess multi-order dependencies. Based on previous work, we utilise existing first-order dependency graphs, in order to assess the effect of a disruption to consequent infrastructures. In this way, it may be possible to identify and prevent security threats of very high impact from a macroscopic view, which would be hard to identify if we only examine first …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:tS2w5q8j5-wC",
            "Publisher": "Inderscience Publishers"
        },
        {
            "Title": "3D Printing: A Paradigm Shift in Political Economy?",
            "Publication year": 2015,
            "Publication url": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.721.3812&rep=rep1&type=pdf",
            "Abstract": "3D printing is expected to do for manufacturing what the Internet did for information: It will decentralise and democratise it. The technology seems to be at its really early phases, however studies have already started to emerge on possible implycations of the technology in certain social spheres, especially in what pertains to national security, through the proliferation of 3D printed guns. Increasing focus has also been put on how to properly regulate the technology. However, implications can also be significant in the international political economy sphere. Most scholars believe that if 3D printing will allow for the creation of not only prototypes but mass production, then the economies of scale advantage of manufacturing platforms like China or other states with a similar production profile will perhaps stand a lot to lose. However, even a maximal deployment of 3D printing will not completely make the Current Account imbalances recede. To the contrary, it will place the focus more on input materials, but also on intellectual property. This paper, after advancing a primer of the technology, attempts to offer a\" first-cut\" analysis of the impact of 3D printing from a political economy and geopolitical perspective.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:7BrZ7Jt4UNcC",
            "Publisher": "International Studies Association"
        },
        {
            "Title": "Risk mitigation strategies for critical infrastructures based on graph centrality analysis",
            "Publication year": 2015,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1874548215000414",
            "Abstract": "Dependency risk graphs have been proposed as a tool for analyzing cascading failures due to critical infrastructure dependency chains. However, dependency chain analysis is not by itself adequate to develop an efficient risk mitigation strategy – one that specifies which critical infrastructures should have high priority for applying mitigation controls in order to achieve an optimal reduction in the overall risk. This paper extends previous dependency risk analysis research to implement efficient risk mitigation. This is accomplished by exploring the relation between dependency risk paths and graph centrality characteristics. Graph centrality metrics are applied to design and evaluate the effectiveness of alternative risk mitigation strategies. The experimental evaluations are based on random graphs that simulate common critical infrastructure dependency characteristics as identified by recent empirical studies. The …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:3NQIlFlcGxIC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Deploying a secure cyberbazaar by adding trust on commercial transactions",
            "Publication year": 2002,
            "Publication url": "https://www.spinellis.gr/pubs/jrnl/2002-eJETA-Cosacc/html/cyberbazaar.pdf",
            "Abstract": "Traditional business practice depends on trust relations between the transacting parties. One of the most important aspects of this trust is the quality of the offered services or products. The Web currently constitutes an enabler for Electronic Commerce, providing a global transaction platform that does not require physical presence. However, transferring trust from the physical world to the electronic one is a process that requires a trust infrastructure to be provided by the electronic world. We believe that current infrastructure models based on Trusted Third Parties can be enhanced. We introduce the notion of Digital Seals and we provide a mechanism for transferring the trust placed by users to companies in the physical world, to the electronic one.",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:EUQCXRtRnyEC",
            "Publisher": "eJeta.org"
        },
        {
            "Title": "Cryptographic libraries as a means to support privacy-enhanced information systems",
            "Publication year": 2001,
            "Publication url": "https://scholar.google.com/scholar?cluster=6602681232566046097&hl=en&oi=scholarr",
            "Abstract": "Unknown",
            "Abstract entirety": 1,
            "Author pub id": "5hIalXgAAAAJ:t9Ks5LMjN0QC",
            "Publisher": "Unknown"
        },
        {
            "Title": "Long-term verifiability of the electronic healthcare records’ authenticity",
            "Publication year": 2007,
            "Publication url": "https://www.sciencedirect.com/science/article/pii/S1386505606002152",
            "Abstract": "To investigate whether the long-term preservation of the authenticity of electronic healthcare records (EHR) is possible. To propose a mechanism that enables the secure validation of an EHR for long periods, far beyond the lifespan of a digital signature and at least as long as the lifetime of a patient.The study is based on the fact that although the attributes of data authenticity, i.e. integrity and origin verifiability, can be preserved by digital signatures, the necessary period for the retention of EHRs is far beyond the lifespan of a simple digital signature. It is identified that the lifespan of signed data is restricted by the validity period of the relevant keys and the digital certificates, by the future unavailability of signature-verification data, and by suppression of trust relationships. In this paper, the notarization paradigm is exploited, and a mechanism for cumulative notarization of signed EHR is proposed …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:8k81kl-MbHgC",
            "Publisher": "Elsevier"
        },
        {
            "Title": "Browser Blacklist: The Utopia of Phishing Protection",
            "Publication year": 2016,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-25915-4_15",
            "Abstract": "Mobile devices - especially smartphones - have gained widespread adoption in recent years, due to the plethora of features they offer. The use of such devices for web browsing, accessing email services and social networking is also getting continuously more popular. The same holds true for other more sensitive online activities, such as online shopping, contactless payments, and web banking. However, the security mechanisms available on smartphones are not yet mature, while their effectiveness is still questionable. As a result, smartphone users face increased risks when performing sensitive online activities with their devices, compared to desktop/laptop users. In this paper, we present an evaluation of the phishing protection mechanisms that are available with the popular web browsers of the Android and iOS platform. Following, we compare the protection they offer against their desktop counterparts …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:VN7nJs4JPk0C",
            "Publisher": "Springer (CCIS-554)"
        },
        {
            "Title": "Embedding privacy in IT applications development",
            "Publication year": 2004,
            "Publication url": "https://www.emerald.com/insight/content/doi/10.1108/09685220410518801/full/html",
            "Abstract": "A considerable research stream in information systems security has elaborated several propositions as to how privacy and anonymity can be protected, the most prominent of which make use of encryption and digital signing. Since privacy protection is a persistent topic in most electronically performed activities, the icreasing popularity of Internet has driven researchers to approach privacy protection in a holistic way. As a result, privacy‐enhancing technologies have been put forth, aiming at protecting users against privacy and anonymity threats and vulnerabilities. Nowadays, that privacy protection has to be incorporated in most IT applications is one of the least controversial statements. This paper describes Privacy Protector, a technological means for enhancing privacy in an IT application development process. Privacy Protector comprises of a set of software services that have been built upon generic, privacy …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:MXK_kJrjxJIC",
            "Publisher": "Emerald Group Publishing Limited"
        },
        {
            "Title": "e-Passports as a means towards a globally interoperable Public Key Infrastructure",
            "Publication year": 2010,
            "Publication url": "https://content.iospress.com/articles/journal-of-computer-security/jcs370",
            "Abstract": "Millions of citizens around the world have already acquired their new electronic passport. The e-passport is equipped with contactless communication capability, as well as with an Integrated Circuit Chip enabling cryptographic functionality. Countries are required to build a national Public Key Infrastructure to support digital signatures, as this is considered the basic mechanism to prove the authenticity and integrity of the Machine Readable Travel Documents. The first, large-scale, worldwide PKI is currently under construction, by means of bilateral trust relationships between Countries. In this paper, we propose a set of good practices, which are essential for the establishment of a global identification scheme based on e-passports, together with an analysis of the security and privacy issues that may arise. We argue that an e-passport may also be exploited in other applications as a globally interoperable PKI-enabled …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:JV2RwH3_ST0C",
            "Publisher": "IOS Press"
        },
        {
            "Title": "Execution path classification for vulnerability analysis and detection",
            "Publication year": 2015,
            "Publication url": "https://link.springer.com/chapter/10.1007/978-3-319-30222-5_14",
            "Abstract": "Various commercial and open-source tools exist, developed both by the industry and academic groups, which are able to detect various types of security bugs in applications’ source code. However, most of these tools are prone to non-negligible rates of false positives and false negatives, since they are designed to detect a priori specified types of bugs. Also, their analysis scalability to large programs is often an issue. To address these problems, we present a new source code analysis technique based on execution path classification. We develop a prototype tool to test our method’s ability to detect different types of information-flow dependent bugs. Our approach is based on classifying the Risk of likely exploits inside source code execution paths using two measuring functions: Severity and Vulnerability. For an Application Under Test (AUT), we analyze every single pair of input vector and program sink in …",
            "Abstract entirety": 0,
            "Author pub id": "5hIalXgAAAAJ:eO3_k5sD8BwC",
            "Publisher": "Springer, Cham"
        }
    ]
}]